Repository: python/python-docs-uk
Catalog: faq/design.po
Languages: uk

source: Design and History FAQ
uk: Поширені запитання про оформлення та історію

source: Contents
uk: Зміст

source: Why does Python use indentation for grouping of statements?
uk: Чому Python використовує відступи для групування операторів?

source: Guido van Rossum believes that using indentation for grouping is extremely elegant and contributes a lot to the clarity of the average Python program. Most people learn to love this feature after a while.
uk: Гвідо ван Россум вважає, що використання відступів для групування є надзвичайно елегантним і значною мірою сприяє ясності звичайної програми на Python. Більшість людей через деякий час полюблять цю функцію.

source: Since there are no begin/end brackets there cannot be a disagreement between grouping perceived by the parser and the human reader. Occasionally C programmers will encounter a fragment of code like this::
uk: Оскільки немає початкових/кінцевих дужок, не може бути розбіжностей між групуванням, сприйнятим синтаксичним аналізатором і людиною, що читає код. Час від часу програмісти на C стикаються з таким фрагментом коду:

source: Only the ``x++`` statement is executed if the condition is true, but the indentation leads many to believe otherwise. Even experienced C programmers will sometimes stare at it a long time wondering as to why ``y`` is being decremented even for ``x > y``.
uk: Тільки оператор ``x++`` виконується, якщо умова виконується, але відступ змушує багатьох вважати протилежне. Навіть досвідчені С-програмісти іноді довго дивляться на нього, дивуючись, чому ``y`` зменшується навіть для ``x > y``.

source: Because there are no begin/end brackets, Python is much less prone to coding-style conflicts. In C there are many different ways to place the braces. After becoming used to reading and writing code using a particular style, it is normal to feel somewhat uneasy when reading (or being required to write) in a different one.
uk: Оскільки немає початкових/кінцевих фігурних дужок, Python значно менше схильний до конфліктів стилю кодування. У C є багато різних способів розміщення фігурних дужок. Після того, як ви звикли читати та писати код, використовуючи певний стиль, це нормально відчувати незручності, коли читаєте (або коли вам потрібно писати) в іншому стилі.

source: Many coding styles place begin/end brackets on a line by themselves. This makes programs considerably longer and wastes valuable screen space, making it harder to get a good overview of a program. Ideally, a function should fit on one screen (say, 20--30 lines). 20 lines of Python can do a lot more work than 20 lines of C. This is not solely due to the lack of begin/end brackets -- the lack of declarations and the high-level data types are also responsible -- but the indentation-based syntax certainly helps.
uk: Багато стилів кодування розміщують початкові/кінцеві дужки на рядку самостійно. Це робить програми значно довшими та витрачає дорогоцінний простір на екрані, що ускладнює гарний огляд програми. В ідеалі функція повинна міститися на одному екрані (скажімо, 20--30 рядків). 20 рядків Python можуть виконувати набагато більше роботи, ніж 20 рядків C. Це пов’язано не лише з відсутністю початкових/кінцевих дужок – відсутність декларацій і високорівневих типів даних також відповідає – але оснований на відступах синтаксис, звичайно, допомагає.

source: Why am I getting strange results with simple arithmetic operations?
uk: Чому я отримую дивні результати під час простих арифметичних операцій?

source: See the next question.
uk: Дивіться наступне запитання.

source: Why are floating-point calculations so inaccurate?
uk: Чому обчислення з плаваючою комою настільки неточні?

source: Users are often surprised by results like this::
uk: Користувачів часто дивують такі результати:

source: and think it is a bug in Python. It's not. This has little to do with Python, and much more to do with how the underlying platform handles floating-point numbers.
uk: і вони думають, що це помилка в Python. Це не так. Це має мало спільного з Python, і набагато більше пов’язане з тим, як базова платформа обробляє числа з плаваючою комою.

source: The :class:`float` type in CPython uses a C ``double`` for storage. A :class:`float` object's value is stored in binary floating-point with a fixed precision (typically 53 bits) and Python uses C operations, which in turn rely on the hardware implementation in the processor, to perform floating-point operations. This means that as far as floating-point operations are concerned, Python behaves like many popular languages including C and Java.
uk: Тип :class:`float` у CPython використовує C ``double`` для зберігання. Значення об’єкта :class:`float` зберігається у двійковій формі з плаваючою комою з фіксованою точністю (зазвичай 53 біти), і Python використовує операції C, які, у свою чергу, покладаються на апаратну реалізацію в процесорі, щоб виконувати операції з плаваючою комою. Це означає, що в операціях з плаваючою комою Python поводиться як багато популярних мов, включаючи C і Java.

source: the value stored for ``x`` is a (very good) approximation to the decimal value ``1.2``, but is not exactly equal to it. On a typical machine, the actual stored value is::
uk: значення, яке зберігається для ``x``, є (дуже точним) наближенням до десяткового значення ``1.2``, але не зовсім дорівнює йому. На типовій машині фактичне збережене значення:

source: which is exactly::
uk: а саме::

source: The typical precision of 53 bits provides Python floats with 15--16 decimal digits of accuracy.
uk: Типова точність в 53 біти забезпечує числа з плаваючою точкою Python з точністю 15--16 десяткових цифр.

source: Why are Python strings immutable?
uk: Чому рядки Python немутабельні?

source: There are several advantages.
uk: Є кілька переваг.

source: One is performance: knowing that a string is immutable means we can allocate space for it at creation time, and the storage requirements are fixed and unchanging. This is also one of the reasons for the distinction between tuples and lists.
uk: Одна з них — це продуктивність: знання того, що рядок є незмінним, означає, що ми можемо виділити для нього місце під час створення, а вимоги до пам’яті є фіксованими та незмінними. Це також одна з причин відмінності між кортежами та списками.

source: Another advantage is that strings in Python are considered as "elemental" as numbers. No amount of activity will change the value 8 to anything else, and in Python, no amount of activity will change the string "eight" to anything else.
uk: Ще одна перевага полягає в тому, що рядки в Python вважаються такими ж "елементарними", як і числа. Жодна активність не змінить значення 8 на щось інше, а в Python жодна активність не змінить рядок "вісім" на щось інше.

source: Why must 'self' be used explicitly in method definitions and calls?
uk: Чому "self" має використовуватися явно у визначеннях і викликах методів?

source: The idea was borrowed from Modula-3. It turns out to be very useful, for a variety of reasons.
uk: Ідея була запозичена з Modula-3. Це виявляється дуже корисним з різних причин.

source: First, it's more obvious that you are using a method or instance attribute instead of a local variable. Reading ``self.x`` or ``self.meth()`` makes it absolutely clear that an instance variable or method is used even if you don't know the class definition by heart. In C++, you can sort of tell by the lack of a local variable declaration (assuming globals are rare or easily recognizable) -- but in Python, there are no local variable declarations, so you'd have to look up the class definition to be sure. Some C++ and Java coding standards call for instance attributes to have an ``m_`` prefix, so this explicitness is still useful in those languages, too.
uk: По-перше, більш очевидно, що ви використовуєте метод або атрибут екземпляра замість локальної змінної. Читання ``self.x`` або ``self.meth()`` робить абсолютно зрозумілим, що використовується змінна екземпляра або метод, навіть якщо ви не знаєте визначення класу напам'ять. У C++ це можна визначити за відсутністю оголошення локальної змінної (якщо глобальні значення рідкісні або легко впізнавані), але в Python немає оголошення локальної змінної, тому вам доведеться шукати визначення класу, щоб бути впевненим. Деякі стандарти кодування C++ і Java вимагають, щоб атрибути екземплярів мали префікс ``m_``, тому ця чіткість все ще корисна в цих мовах.

source: Finally, for instance variables it solves a syntactic problem with assignment: since local variables in Python are (by definition!) those variables to which a value is assigned in a function body (and that aren't explicitly declared global), there has to be some way to tell the interpreter that an assignment was meant to assign to an instance variable instead of to a local variable, and it should preferably be syntactic (for efficiency reasons). C++ does this through declarations, but Python doesn't have declarations and it would be a pity having to introduce them just for this purpose. Using the explicit ``self.var`` solves this nicely. Similarly, for using instance variables, having to write ``self.var`` means that references to unqualified names inside a method don't have to search the instance's directories. To put it another way, local variables and instance variables live in two different namespaces, and you need to tell Python which namespace to use.
uk: Нарешті, для змінних екземпляра, такий підхід вирішує синтаксичну проблему з призначенням: оскільки локальні змінні в Python — це (за визначенням!) ті змінні, яким присвоєно значення в тілі функції (і які явно не оголошені глобальними), необхідно бути якимось способом повідомити інтерпретатору, що це призначено для встановленния значення змінній екземпляра, а не локальній змінній, і бажано, щоб воно було синтаксичним (з причин ефективності). C++ робить це за допомогою декларацій, але Python не має декларацій, і було б шкода вводити їх лише для цієї мети. Використання явного ``self.var`` добре вирішує цю проблему. Подібним чином, для використання змінних екземпляра необхідність запису ``self.var`` означає, що посилання на некваліфіковані імена всередині методу не потребують пошуку в каталогах екземпляра. Іншими словами, локальні змінні та змінні екземплярів живуть у двох різних просторах імен, і вам потрібно сказати інтерпритатору Python, який простір імен використовувати.

source: Why can't I use an assignment in an expression?
uk: Чому я не можу використовувати присвоєння у виразі?

source: Starting in Python 3.8, you can!
uk: Починаючи з Python 3.8, ви можете!

source: See :pep:`572` for more information.
uk: Перегляньте :pep:`572` для отримання додаткової інформації.

source: Why does Python use methods for some functionality (e.g. list.index()) but functions for other (e.g. len(list))?
uk: Чому Python використовує методи для одних функцій (наприклад, list.index()), а функції для інших (наприклад, len(list))?

source: As Guido said:
uk: Як сказав Гвідо:

source: (a) For some operations, prefix notation just reads better than postfix -- prefix (and infix!) operations have a long tradition in mathematics which likes notations where the visuals help the mathematician thinking about a problem. Compare the easy with which we rewrite a formula like x*(a+b) into x*a + x*b to the clumsiness of doing the same thing using a raw OO notation.
uk: (a) Для деяких операцій префіксна нотація просто читається краще, ніж постфіксна — префіксні (та інфіксні!) операції мають давню традицію в математиці, яка любить нотації, де візуальні елементи допомагають математику думати про проблему. Порівняйте легкість, за допомогою якої ми переписуємо формулу на кшталт x*(a+b) на x*a + x*b, із незграбністю виконання того ж самого, використовуючи чисту нотацію OO.

source: (b) When I read code that says len(x) I *know* that it is asking for the length of something. This tells me two things: the result is an integer, and the argument is some kind of container. To the contrary, when I read x.len(), I have to already know that x is some kind of container implementing an interface or inheriting from a class that has a standard len(). Witness the confusion we occasionally have when a class that is not implementing a mapping has a get() or keys() method, or something that isn't a file has a write() method.
uk: (b) Коли я читаю код, який каже len(x), я *знаю*, що він запитує довжину чогось. Це говорить мені про дві речі: результат є цілим числом, а аргумент є певним контейнером. Навпаки, коли я читаю x.len(), я вже маю знати, що x — це якийсь контейнер, який реалізує інтерфейс або успадковує від класу, який має стандартний len(). Подивіться, яка плутанина у нас іноді виникає, коли клас, який не реалізує відображення, має метод get() або keys(), або щось, що не є файлом, має метод write().

source: Why is join() a string method instead of a list or tuple method?
uk: Чому метод join() є методом рядків, а не методом списку чи кортежу?

source: Strings became much more like other standard types starting in Python 1.6, when methods were added which give the same functionality that has always been available using the functions of the string module. Most of these new methods have been widely accepted, but the one which appears to make some programmers feel uncomfortable is::
uk: Рядки стали набагато більше схожими на інші стандартні типи, починаючи з Python 1.6, коли були додані методи, які надають ту саму функціональність, яка завжди була доступна за допомогою функцій модуля string. Більшість цих нових методів були широко прийняті, але один, який, здається, змушує деяких програмістів почуватися некомфортно:

source: which gives the result::
uk: що дає результат::

source: There are two common arguments against this usage.
uk: Існує два загальні аргументи проти такого використання.

source: The first runs along the lines of: "It looks really ugly using a method of a string literal (string constant)", to which the answer is that it might, but a string literal is just a fixed value. If the methods are to be allowed on names bound to strings there is no logical reason to make them unavailable on literals.
uk: Перше звучить так: "Це виглядає дуже потворно, використовуючи метод рядкового літералу (рядкова константа)", на що є відповідь, що це може бути, навіть якщо рядковий літерал це лише фіксоване значення. Якщо методи мають бути дозволені для імен, прив’язаних до рядків, немає логічної причини робити їх недоступними для літералів.

source: The second objection is typically cast as: "I am really telling a sequence to join its members together with a string constant". Sadly, you aren't. For some reason there seems to be much less difficulty with having :meth:`~str.split` as a string method, since in that case it is easy to see that ::
uk: Друге заперечення, як правило, формулюється так: "Я справді кажу послідовності об’єднати її члени за допомогою рядкової константи". На жаль, ні. З певних причин здається, що з використанням :meth:`~str.split` як рядкового методу набагато менше труднощів, оскільки в цьому випадку легко побачити, що:

source: is an instruction to a string literal to return the substrings delimited by the given separator (or, by default, arbitrary runs of white space).
uk: це вказівка для рядкового літералу повертати підрядки, розділені заданим роздільником (або, за замовчуванням, пробілом).

source: :meth:`~str.join` is a string method because in using it you are telling the separator string to iterate over a sequence of strings and insert itself between adjacent elements. This method can be used with any argument which obeys the rules for sequence objects, including any new classes you might define yourself. Similar methods exist for bytes and bytearray objects.
uk: :meth:`~str.join` — це рядковий метод, оскільки, використовуючи його, ви вказуєте рядку-роздільнику перебирати послідовність рядків і вставляти себе між суміжними елементами. Цей метод можна використовувати з будь-яким аргументом, який підкоряється правилам для об’єктів послідовності, включаючи будь-які нові класи, які ви можете визначити самостійно. Подібні методи існують для об’єктів bytes і bytearray.

source: How fast are exceptions?
uk: Як швидко працюють винятки?

source: This only made sense when you expected the dict to have the key almost all the time. If that wasn't the case, you coded it like this::
uk: Це мало сенс лише тоді, коли ви очікували, що dict матиме ключ майже весь час. Якщо це не так, ви закодували це так::

source: For this specific case, you could also use ``value = dict.setdefault(key, getvalue(key))``, but only if the ``getvalue()`` call is cheap enough because it is evaluated in all cases.
uk: Для цього конкретного випадку ви також можете використати ``value = dict.setdefault(key, getvalue(key))``, але лише якщо виклик ``getvalue()`` досить дешевий, оскільки він оцінюється в усіх випадках.

source: Why isn't there a switch or case statement in Python?
uk: Чому в Python немає оператора switch або case?

source: For cases where you need to choose from a very large number of possibilities, you can create a dictionary mapping case values to functions to call. For example::
uk: У випадках, коли вам потрібно вибрати з дуже великої кількості можливостей, ви можете створити словник, який зіставлятиме значення регістру з функціями для виклику. Наприклад::

source: For calling methods on objects, you can simplify yet further by using the :func:`getattr` built-in to retrieve methods with a particular name::
uk: Для виклику методів об’єктів ви можете ще більше спростити, використовуючи вбудований :func:`getattr` для отримання методів із певним іменем::

source: It's suggested that you use a prefix for the method names, such as ``visit_`` in this example. Without such a prefix, if values are coming from an untrusted source, an attacker would be able to call any method on your object.
uk: Рекомендується використовувати префікс для імен методів, наприклад ``visit_`` у цьому прикладі. Без такого префікса, якщо значення надходять із ненадійного джерела, зловмисник зможе викликати будь-який метод вашого об’єкта.

source: Can't you emulate threads in the interpreter instead of relying on an OS-specific thread implementation?
uk: Чи не можна емулювати потоки в інтерпретаторі замість того, щоб покладатися на реалізацію потоку, специфічного для ОС?

source: Answer 1: Unfortunately, the interpreter pushes at least one C stack frame for each Python stack frame. Also, extensions can call back into Python at almost random moments. Therefore, a complete threads implementation requires thread support for C.
uk: Відповідь 1: На жаль, інтерпретатор надсилає принаймні один кадр стека C для кожного кадру стека Python. Крім того, розширення можуть повертатися до Python у майже випадкові моменти. Таким чином, повна реалізація потоків вимагає підтримки потоків для C.

source: Answer 2: Fortunately, there is `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, which has a completely redesigned interpreter loop that avoids the C stack.
uk: Відповідь 2: На щастя, є `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, який має повністю перероблений цикл інтерпретатора, який уникає стека C.

source: Why can't lambda expressions contain statements?
uk: Чому лямбда-вирази не можуть містити оператори?

source: Python lambda expressions cannot contain statements because Python's syntactic framework can't handle statements nested inside expressions. However, in Python, this is not a serious problem. Unlike lambda forms in other languages, where they add functionality, Python lambdas are only a shorthand notation if you're too lazy to define a function.
uk: Лямбда-вирази Python не можуть містити оператори, оскільки синтаксична структура Python не може обробляти оператори, вкладені у вирази. Однак у Python це не є серйозною проблемою. На відміну від лямбда-форм в інших мовах, де вони додають функціональність, лямбда-вирази Python є лише скороченою нотацією, якщо вам ліньки визначати функцію.

source: Can Python be compiled to machine code, C or some other language?
uk: Чи можна Python скомпілювати до машинного коду, мови C чи іншої?

source: How does Python manage memory?
uk: Як Python керує пам'яттю?

source: The details of Python memory management depend on the implementation. The standard implementation of Python, :term:`CPython`, uses reference counting to detect inaccessible objects, and another mechanism to collect reference cycles, periodically executing a cycle detection algorithm which looks for inaccessible cycles and deletes the objects involved. The :mod:`gc` module provides functions to perform a garbage collection, obtain debugging statistics, and tune the collector's parameters.
uk: Деталі керування пам’яттю Python залежать від реалізації. Стандартна реалізація Python, :term:`CPython`, використовує підрахунок посилань для виявлення недоступних об’єктів та інший механізм для збору посилальних циклів, періодично виконуючи алгоритм виявлення циклів, який шукає недоступні цикли та видаляє залучені об’єкти. Модуль :mod:`gc` надає функції для збирання сміття, отримання статистики налагодження та налаштування параметрів збирача.

source: In some Python implementations, the following code (which is fine in CPython) will probably run out of file descriptors::
uk: У деяких реалізаціях Python наступний код (який добре процює у CPython), ймовірно, не матиме файлових дескрипторів::

source: If you want to write code that will work with any Python implementation, you should explicitly close the file or use the :keyword:`with` statement; this will work regardless of memory management scheme::
uk: Якщо ви хочете написати код, який працюватиме з будь-якою реалізацією Python, вам слід явно закрити файл або використати оператор :keyword:`with`; це працюватиме незалежно від схеми керування пам'яттю:

source: Why doesn't CPython use a more traditional garbage collection scheme?
uk: Чому CPython не використовує більш традиційну схему збирання сміття?

source: For one thing, this is not a C standard feature and hence it's not portable. (Yes, we know about the Boehm GC library. It has bits of assembler code for *most* common platforms, not for all of them, and although it is mostly transparent, it isn't completely transparent; patches are required to get Python to work with it.)
uk: По-перше, це не є стандартною функцією C, а отже, вона не переносна. (Так, ми знаємо про бібліотеку Boehm GC. Вона містить фрагменти коду асемблера для *найбільш* поширених платформ, не для всіх, і хоча вона здебільшого прозора, але всеж таки не зовсім прозора; для Python потрібні патчи щоб працювати з нею.)

source: Why isn't all memory freed when CPython exits?
uk: Чому не вся пам'ять звільняється, коли CPython завершує роботу?

source: Objects referenced from the global namespaces of Python modules are not always deallocated when Python exits. This may happen if there are circular references. There are also certain bits of memory that are allocated by the C library that are impossible to free (e.g. a tool like Purify will complain about these). Python is, however, aggressive about cleaning up memory on exit and does try to destroy every single object.
uk: Об’єкти, на які посилаються глобальні простори імен модулів Python, не завжди звільняються, коли Python завершує роботу. Це може статися, якщо є циклічні посилання. Є також певні частини пам’яті, виділені бібліотекою C, які неможливо звільнити (наприклад, такий інструмент, як Purify, буде скаржитися на це). Однак Python агресивно очищає пам’ять під час виходу та намагається знищити кожен окремий об’єкт.
