Repository: python/python-docs-uk
Catalog: faq/design.po
Languages: uk

source: If you want to force Python to delete certain things on deallocation use the :mod:`atexit` module to run a function that will force those deletions.
uk: Якщо ви хочете змусити Python видалити певні речі під час звільнення, скористайтеся модулем :mod:`atexit`, щоб запустити функцію, яка примусово прискорить ці видалення.

source: Why are there separate tuple and list data types?
uk: Чому існують окремі типи даних кортежу та списку?

source: Tuples are immutable, meaning that once a tuple has been created, you can't replace any of its elements with a new value. Lists are mutable, meaning that you can always change a list's elements. Only immutable elements can be used as dictionary keys, and hence only tuples and not lists can be used as keys.
uk: Кортежі є незмінними, тобто після створення кортежу ви не можете замінити жоден із його елементів новим значенням. Списки є змінними, тобто ви завжди можете змінити елементи списку. Тільки незмінні елементи можна використовувати як ключі словника, а отже, лише кортежі можна використовувати як ключі, а списки не можна.

source: How are lists implemented in CPython?
uk: Як списки реалізовані в CPython?

source: CPython's lists are really variable-length arrays, not Lisp-style linked lists. The implementation uses a contiguous array of references to other objects, and keeps a pointer to this array and the array's length in a list head structure.
uk: Списки CPython насправді є масивами змінної довжини, а не пов’язаними списками як у стилі Lisp. Реалізація використовує безперервний масив посилань на інші об’єкти та зберігає вказівник на цей масив і довжину масиву в структурі заголовка списку.

source: This makes indexing a list ``a[i]`` an operation whose cost is independent of the size of the list or the value of the index.
uk: Це робить індексацію списку ``a[i]`` операцією, вартість якої не залежить від розміру списку або значення індексу.

source: When items are appended or inserted, the array of references is resized. Some cleverness is applied to improve the performance of appending items repeatedly; when the array must be grown, some extra space is allocated so the next few times don't require an actual resize.
uk: Коли елементи додаються або вставляються, розмір масиву посилань змінюється. Деяка кмітливість застосована для покращення продуктивності багаторазового додавання елементів; коли масив потрібно збільшити, виділяється додатковий простір, тому наступні кілька разів не вимагають фактичної зміни розміру.

source: How are dictionaries implemented in CPython?
uk: Як реалізовані словники в CPython?

source: CPython's dictionaries are implemented as resizable hash tables. Compared to B-trees, this gives better performance for lookup (the most common operation by far) under most circumstances, and the implementation is simpler.
uk: Словники CPython реалізовані як хеш-таблиці зі змінним розміром. Порівняно з B-деревами, це дає кращу продуктивність для пошуку (найпоширеніша операція на сьогоднішній день) у більшості випадків, а реалізація є простішою.

source: Why must dictionary keys be immutable?
uk: Чому ключі словника повинні бути незмінними?

source: The hash table implementation of dictionaries uses a hash value calculated from the key value to find the key. If the key were a mutable object, its value could change, and thus its hash could also change. But since whoever changes the key object can't tell that it was being used as a dictionary key, it can't move the entry around in the dictionary. Then, when you try to look up the same object in the dictionary it won't be found because its hash value is different. If you tried to look up the old value it wouldn't be found either, because the value of the object found in that hash bin would be different.
uk: Реалізація хеш-таблиці словників використовує хеш-значення, обчислене зі значення ключа, щоб знайти ключ. Якби ключ був змінним об’єктом, його значення могло б змінитися, а отже, і його хеш також міг би змінитися. Але оскільки той, хто змінює об’єкт ключа, не може сказати, що він використовувався як ключ словника, він не може переміщувати запис у словнику. Тоді, коли ви спробуєте знайти той самий об’єкт у словнику, він не буде знайдений, оскільки його хеш-значення інше. Якщо ви спробуєте знайти старе значення, його також не буде знайдено, оскільки значення об’єкта, знайденого в цьому хеш-біні, буде іншим.

source: If you want a dictionary indexed with a list, simply convert the list to a tuple first; the function ``tuple(L)`` creates a tuple with the same entries as the list ``L``. Tuples are immutable and can therefore be used as dictionary keys.
uk: Якщо ви хочете, щоб словник був індексований списком, просто спочатку перетворіть список на кортеж; функція ``tuple(L)`` створює кортеж з тими самими записами, що і список ``L``. Кортежі є незмінними, тому їх можна використовувати як ключі словника.

source: Some unacceptable solutions that have been proposed:
uk: Деякі неприйнятні рішення, які були запропоновані:

source: Hash lists by their address (object ID). This doesn't work because if you construct a new list with the same value it won't be found; e.g.::
uk: Хешувати списки за їхньою адресою (ID об'єкта). Це не працює, тому що якщо ви створите новий список із тим самим значенням, його не буде знайдено; наприклад::

source: would raise a :exc:`KeyError` exception because the id of the ``[1, 2]`` used in the second line differs from that in the first line. In other words, dictionary keys should be compared using ``==``, not using :keyword:`is`.
uk: викличе виняток :exc:`KeyError`, оскільки ідентифікатор ``[1, 2]``, який використовується у другому рядку, відрізняється від ідентифікатора в першому рядку. Іншими словами, ключі словника слід порівнювати за допомогою ``==``, а не за допомогою :keyword:`is`.

source: Make a copy when using a list as a key. This doesn't work because the list, being a mutable object, could contain a reference to itself, and then the copying code would run into an infinite loop.
uk: Зробити копію, якщо використовуєте список як ключ. Це не працює, тому що список, будучи змінним об’єктом, може містити посилання на себе, і тоді код копіювання запускатиметься в нескінченний цикл.

source: Allow lists as keys but tell the user not to modify them. This would allow a class of hard-to-track bugs in programs when you forgot or modified a list by accident. It also invalidates an important invariant of dictionaries: every value in ``d.keys()`` is usable as a key of the dictionary.
uk: Дозволити списки як ключі, але сказати користувачеві не змінювати їх. Це дозволило б створити клас помилок, які важко відстежити в програмах, коли ви випадково забули або змінили список. Це також робить недійсним важливий інваріант словників: кожне значення в ``d.keys()`` можна використовувати як ключ словника.

source: Mark lists as read-only once they are used as a dictionary key. The problem is that it's not just the top-level object that could change its value; you could use a tuple containing a list as a key. Entering anything as a key into a dictionary would require marking all objects reachable from there as read-only -- and again, self-referential objects could cause an infinite loop.
uk: Позначайте списки як доступні лише для читання, коли вони використовуються як ключ словника. Проблема полягає в тому, що не лише об’єкт верхнього рівня може змінити своє значення; ви можете використовувати кортеж, що містить список, як ключ. Введення будь-чого як ключа до словника вимагало б позначити всі доступні звідти об’єкти як доступні лише для читання – і знову ж таки самопосилання на об’єкти могло б спричинити нескінченний цикл.

source: Note that the hash computation is complicated by the possibility that some members of the list may be unhashable and also by the possibility of arithmetic overflow.
uk: Зверніть увагу, що обчислення хешу ускладнюється можливістю того, що деякі члени списку можуть бути нехешованими, а також можливістю арифметичного переповнення.

source: Furthermore it must always be the case that if ``o1 == o2`` (ie ``o1.__eq__(o2) is True``) then ``hash(o1) == hash(o2)`` (ie, ``o1.__hash__() == o2.__hash__()``), regardless of whether the object is in a dictionary or not. If you fail to meet these restrictions dictionaries and other hash based structures will misbehave.
uk: Крім того, завжди має бути так, що якщо ``o1 == o2`` (тобто ``o1.__eq__(o2) має значення True``), тоді ``hash(o1) == hash(o2)`` (тобто, ``o1.__hash__() == o2.__hash__()``), незалежно від того, чи є об’єкт у словнику чи ні. Якщо ви не впораєтеся з цими обмеженнями, словники та інші хеш-структури працюватимуть неправильно.

source: Why doesn't list.sort() return the sorted list?
uk: Чому list.sort() не повертає відсортований список?

source: In situations where performance matters, making a copy of the list just to sort it would be wasteful. Therefore, :meth:`list.sort` sorts the list in place. In order to remind you of that fact, it does not return the sorted list. This way, you won't be fooled into accidentally overwriting a list when you need a sorted copy but also need to keep the unsorted version around.
uk: У ситуаціях, коли продуктивність має значення, створення копії списку лише для його сортування було б марним. Тому :meth:`list.sort` сортує список за місцем. Щоб нагадати вам про цей факт, він не повертає відсортований список. Таким чином, вас не введуть в оману випадковим перезаписом списку, коли вам потрібна відсортована копія, але також потрібно зберегти невідсортовану версію.

source: If you want to return a new list, use the built-in :func:`sorted` function instead. This function creates a new list from a provided iterable, sorts it and returns it. For example, here's how to iterate over the keys of a dictionary in sorted order::
uk: Якщо ви хочете повернути новий список, скористайтеся вбудованою функцією :func:`sorted`. Ця функція створює новий список із наданого ітератора, сортує його та повертає. Наприклад, ось як виконати ітерацію по ключах словника у відсортованому порядку:

source: How do you specify and enforce an interface spec in Python?
uk: Як визначити та застосувати специфікацію інтерфейсу в Python?

source: An interface specification for a module as provided by languages such as C++ and Java describes the prototypes for the methods and functions of the module. Many feel that compile-time enforcement of interface specifications helps in the construction of large programs.
uk: Специфікація інтерфейсу для модуля, яка надається такими мовами, як C++ і Java, описує прототипи методів і функцій модуля. Багато хто вважає, що примусове виконання специфікацій інтерфейсу під час компіляції допомагає створювати великі програми.

source: Python 2.6 adds an :mod:`abc` module that lets you define Abstract Base Classes (ABCs). You can then use :func:`isinstance` and :func:`issubclass` to check whether an instance or a class implements a particular ABC. The :mod:`collections.abc` module defines a set of useful ABCs such as :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container`, and :class:`~collections.abc.MutableMapping`.
uk: Python 2.6 додає модуль :mod:`abc`, який дозволяє визначати абстрактні базові класи (ABC - Abstract Base Classes ). Потім ви можете використовувати :func:`isinstance` і :func:`issubclass`, щоб перевірити, чи екземпляр або клас певного ABC їх реалізує. Модуль :mod:`collections.abc` визначає набір корисних ABC, таких як :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container` і :class:`~collections. abc.MutableMapping`.

source: For Python, many of the advantages of interface specifications can be obtained by an appropriate test discipline for components.
uk: Для Python багато переваг специфікацій інтерфейсу можна отримати за допомогою відповідного порядку тестування компонентів.

source: A good test suite for a module can both provide a regression test and serve as a module interface specification and a set of examples. Many Python modules can be run as a script to provide a simple "self test." Even modules which use complex external interfaces can often be tested in isolation using trivial "stub" emulations of the external interface. The :mod:`doctest` and :mod:`unittest` modules or third-party test frameworks can be used to construct exhaustive test suites that exercise every line of code in a module.
uk: Хороший набір тестів для модуля може як забезпечити регресійний тест, так і служити специфікацією інтерфейсу модуля та набором прикладів. Багато модулів Python можна запускати як сценарій для забезпечення простого "самотестування". Навіть модулі, які використовують складні зовнішні інтерфейси, часто можуть бути протестовані ізольовано за допомогою тривіальних "заглушок" емуляції зовнішнього інтерфейсу. Модулі :mod:`doctest` і :mod:`unittest` або сторонні фреймворки тестування можна використовувати для створення вичерпних наборів тестів, які перевіряють кожен рядок коду в модулі.

source: Writing test suites is very helpful, and you might want to design your code to make it easily tested. One increasingly popular technique, test-driven development, calls for writing parts of the test suite first, before you write any of the actual code. Of course Python allows you to be sloppy and not write test cases at all.
uk: Написання наборів тестів дуже корисно, і ви можете розробити свій код, щоб його було легко перевірити. Одна з технік, що стає все більш популярною, — розробка на основі тестування (TDD - test-driven development)— вимагає спочатку написати частини набору тестів, перш ніж писати будь-який фактичний код. Звичайно, Python дозволяє вам бути неохайними і взагалі не писати тести.

source: Why is there no goto?
uk: Чому немає goto?

source: Why can't raw strings (r-strings) end with a backslash?
uk: Чому необроблені рядки (r-рядки) не можуть закінчуватися зворотною косою рискою?

source: More precisely, they can't end with an odd number of backslashes: the unpaired backslash at the end escapes the closing quote character, leaving an unterminated string.
uk: Точніше, вони не можуть закінчуватися непарною кількістю зворотних скісних рисок: непарна зворотна коса риска в кінці виходить із символу закриваючої лапки, залишаючи незакінчений рядок.

source: Raw strings were designed to ease creating input for processors (chiefly regular expression engines) that want to do their own backslash escape processing. Such processors consider an unmatched trailing backslash to be an error anyway, so raw strings disallow that. In return, they allow you to pass on the string quote character by escaping it with a backslash. These rules work well when r-strings are used for their intended purpose.
uk: Необроблені рядки були розроблені, щоб полегшити створення вхідних даних для процесорів (головним чином механізмів регулярних виразів), які хочуть виконувати власну обробку зворотного слеша. Такі процесори в будь-якому випадку вважають невідповідну зворотну косу риску в кінці помилкою, тому необроблені рядки це забороняють. Натомість вони дозволяють вам передати символ лапки рядка, екрануючи його зворотною косою рискою. Ці правила добре працюють, коли r-рядки використовуються за призначенням.

source: If you're trying to build Windows pathnames, note that all Windows system calls accept forward slashes too::
uk: Якщо ви намагаєтеся створити імена шляхів Windows, зверніть увагу, що всі системні виклики Windows також приймають косу риску::

source: If you're trying to build a pathname for a DOS command, try e.g. one of ::
uk: Якщо ви намагаєтеся створити шлях для команди DOS, спробуйте, наприклад. один з ::

source: Why doesn't Python have a "with" statement for attribute assignments?
uk: Чому в Python немає оператора "with" для призначення атрибутів?

source: In Python, such a construct would be ambiguous.
uk: У Python така конструкція була б неоднозначною.

source: Other languages, such as Object Pascal, Delphi, and C++, use static types, so it's possible to know, in an unambiguous way, what member is being assigned to. This is the main point of static typing -- the compiler *always* knows the scope of every variable at compile time.
uk: Інші мови, такі як Object Pascal, Delphi та C++, використовують статичні типи, тому можна однозначно знати, якому члену призначено. Це головний момент статичної типізації -- компілятор *завжди* знає область кожної змінної під час компіляції.

source: Python uses dynamic types. It is impossible to know in advance which attribute will be referenced at runtime. Member attributes may be added or removed from objects on the fly. This makes it impossible to know, from a simple reading, what attribute is being referenced: a local one, a global one, or a member attribute?
uk: Python використовує динамічні типи. Неможливо знати заздалегідь, на який атрибут буде посилатися під час виконання. Атрибути учасників можна додавати або видаляти з об’єктів на льоту. Це робить неможливим з простого читання дізнатися, на який атрибут посилається: локальний, глобальний чи атрибут-член?

source: For instance, take the following incomplete snippet::
uk: Наприклад, візьмемо наступний неповний фрагмент:

source: write this::
uk: напиши це::

source: This also has the side-effect of increasing execution speed because name bindings are resolved at run-time in Python, and the second version only needs to perform the resolution once.
uk: Це також має побічний ефект збільшення швидкості виконання, оскільки прив’язки імен вирішуються під час виконання в Python, а другій версії потрібно виконати розв’язання лише один раз.

source: Why don't generators support the with statement?
uk: Чому генератори не підтримують оператор with?

source: Why are colons required for the if/while/def/class statements?
uk: Чому в операторах if/while/def/class потрібні двокрапки?

source: The colon is required primarily to enhance readability (one of the results of the experimental ABC language). Consider this::
uk: Двокрапка потрібна насамперед для покращення читабельності (один із результатів експериментальної мови ABC). Розглянемо це::

source: versus ::
uk: проти ::

source: Notice how the second one is slightly easier to read. Notice further how a colon sets off the example in this FAQ answer; it's a standard usage in English.
uk: Зверніть увагу, що другий читається трохи легше. Зверніть увагу на те, як двокрапка виділяє приклад у цій відповіді на поширені запитання; це стандартне використання в англійській мові.

source: Another minor reason is that the colon makes it easier for editors with syntax highlighting; they can look for colons to decide when indentation needs to be increased instead of having to do a more elaborate parsing of the program text.
uk: Інша незначна причина полягає в тому, що двокрапка полегшує роботу редакторів із підсвічуванням синтаксису; вони можуть шукати двокрапки, щоб вирішити, коли потрібно збільшити відступ, замість того, щоб виконувати більш детальний розбір тексту програми.

source: Why does Python allow commas at the end of lists and tuples?
uk: Чому Python допускає коми в кінці списків і кортежів?

source: Python lets you add a trailing comma at the end of lists, tuples, and dictionaries::
uk: Python дозволяє додавати кінцеву кому в кінці списків, кортежів і словників:

source: There are several reasons to allow this.
uk: Є кілька причин дозволити це.

source: When you have a literal value for a list, tuple, or dictionary spread across multiple lines, it's easier to add more elements because you don't have to remember to add a comma to the previous line. The lines can also be reordered without creating a syntax error.
uk: Коли у вас є літеральне значення для списку, кортежу чи словника, розкиданого на кілька рядків, легше додати більше елементів, оскільки вам не потрібно пам’ятати про додавання коми в попередній рядок. Рядки також можна змінити, не створюючи синтаксичних помилок.

source: Accidentally omitting the comma can lead to errors that are hard to diagnose. For example::
uk: Випадковий пропуск коми може призвести до помилок, які важко діагностувати. Наприклад::

source: This list looks like it has four elements, but it actually contains three: "fee", "fiefoo" and "fum". Always adding the comma avoids this source of error.
uk: Цей список виглядає так, ніби він складається з чотирьох елементів, але насправді він містить три: "fee", "fiefoo" і "fum". Постійне додавання коми дозволяє уникнути цього джерела помилки.

source: Allowing the trailing comma may also make programmatic code generation easier.
uk: Дозвіл кінцевої коми також може полегшити генерацію програмного коду.
