Repository: python/python-docs-uk
Catalog: faq/general.po
Languages: uk

source: General Python FAQ
uk: Загальні поширені запитання щодо Python

source: Contents
uk: Зміст

source: General Information
uk: Загальна інформація

source: What is Python?
uk: Що таке Python?

source: Python is an interpreted, interactive, object-oriented programming language. It incorporates modules, exceptions, dynamic typing, very high level dynamic data types, and classes. It supports multiple programming paradigms beyond object-oriented programming, such as procedural and functional programming. Python combines remarkable power with very clear syntax. It has interfaces to many system calls and libraries, as well as to various window systems, and is extensible in C or C++. It is also usable as an extension language for applications that need a programmable interface. Finally, Python is portable: it runs on many Unix variants including Linux and macOS, and on Windows.
uk: Python — це інтерпретована, інтерактивна, об’єктно-орієнтована мова програмування. Він містить модулі, винятки, динамічну типізацію, динамічні типи даних дуже високого рівня та класи. Він підтримує кілька парадигм програмування, окрім об’єктно-орієнтованого програмування, наприклад процедурне та функціональне програмування. Python поєднує в собі надзвичайну потужність із дуже чітким синтаксисом. Він має інтерфейси для багатьох системних викликів і бібліотек, а також для різних віконних систем і розширюється на C або C++. Його також можна використовувати як мову розширення для програм, яким потрібен програмований інтерфейс. Нарешті, Python портативний: він працює на багатьох варіантах Unix, включаючи Linux і macOS, а також на Windows.

source: To find out more, start with :ref:`tutorial-index`. The `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ links to other introductory tutorials and resources for learning Python.
uk: Щоб дізнатися більше, почніть з :ref:`tutorial-index`. `Посібник для початківців з Python <https://wiki.python.org/moin/BeginnersGuide>`_ містить посилання на інші вступні посібники та ресурси для вивчення Python.

source: What is the Python Software Foundation?
uk: Що таке Python Software Foundation?

source: The Python Software Foundation is an independent non-profit organization that holds the copyright on Python versions 2.1 and newer. The PSF's mission is to advance open source technology related to the Python programming language and to publicize the use of Python. The PSF's home page is at https://www.python.org/psf/.
uk: Python Software Foundation — це незалежна некомерційна організація, яка володіє авторськими правами на Python версії 2.1 і новіших. Місія PSF полягає в тому, щоб просувати технологію з відкритим кодом, пов’язану з мовою програмування Python, і оприлюднювати використання Python. Домашня сторінка PSF знаходиться за адресою https://www.python.org/psf/.

source: Donations to the PSF are tax-exempt in the US. If you use Python and find it helpful, please contribute via `the PSF donation page <https://www.python.org/psf/donations/>`_.
uk: Пожертви на користь PSF звільняються від податків у США. Якщо ви використовуєте Python і вважаєте його корисним, зробіть свій внесок через `сторінку пожертв PSF <https://www.python.org/psf/donations/>`_.

source: Are there copyright restrictions on the use of Python?
uk: Чи існують обмеження авторського права на використання Python?

source: You can do anything you want with the source, as long as you leave the copyrights in and display those copyrights in any documentation about Python that you produce. If you honor the copyright rules, it's OK to use Python for commercial use, to sell copies of Python in source or binary form (modified or unmodified), or to sell products that incorporate Python in some form. We would still like to know about all commercial use of Python, of course.
uk: Ви можете робити з вихідним кодом усе, що завгодно, за умови, що ви залишите авторські права та відобразите ці авторські права в будь-якій документації щодо Python, яку ви створюєте. Якщо ви дотримуєтеся правил авторського права, можна використовувати Python для комерційного використання, продавати копії Python у вихідній чи двійковій формі (модифікованій чи немодифікованій) або продавати продукти, які в тій чи іншій формі містять Python. Звичайно, ми все ще хотіли б знати про комерційне використання Python.

source: See `the PSF license page <https://www.python.org/psf/license/>`_ to find further explanations and a link to the full text of the license.
uk: Перегляньте `сторінку ліцензії PSF <https://www.python.org/psf/license/>`_, щоб знайти додаткові пояснення та посилання на повний текст ліцензії.

source: The Python logo is trademarked, and in certain cases permission is required to use it. Consult `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ for more information.
uk: Логотип Python є торговою маркою, і в деяких випадках для його використання потрібен дозвіл. Зверніться до `Політики використання торговельних марок <https://www.python.org/psf/trademarks/>`__ для отримання додаткової інформації.

source: Why was Python created in the first place?
uk: Чому взагалі був створений Python?

source: Here's a *very* brief summary of what started it all, written by Guido van Rossum:
uk: Ось *дуже* короткий виклад того, з чого все почалося, написаний Гвідо ван Россумом:

source: I had extensive experience with implementing an interpreted language in the ABC group at CWI, and from working with this group I had learned a lot about language design. This is the origin of many Python features, including the use of indentation for statement grouping and the inclusion of very-high-level data types (although the details are all different in Python).
uk: У мене був великий досвід впровадження мови інтерпретації в групі ABC у CWI, і, працюючи з цією групою, я багато чого дізнався про мовний дизайн. Це походження багатьох функцій Python, включаючи використання відступів для групування операторів і включення типів даних дуже високого рівня (хоча всі деталі в Python різні).

source: I had a number of gripes about the ABC language, but also liked many of its features. It was impossible to extend the ABC language (or its implementation) to remedy my complaints -- in fact its lack of extensibility was one of its biggest problems. I had some experience with using Modula-2+ and talked with the designers of Modula-3 and read the Modula-3 report. Modula-3 is the origin of the syntax and semantics used for exceptions, and some other Python features.
uk: У мене було кілька нарікань щодо мови ABC, але мені також сподобалися багато її функцій. Неможливо було розширити мову ABC (або її реалізацію), щоб виправити мої скарги - насправді її відсутність розширюваності була однією з найбільших проблем. У мене був певний досвід використання Modula-2+, я поспілкувався з розробниками Modula-3 і прочитав звіт Modula-3. Modula-3 є джерелом синтаксису та семантики, які використовуються для винятків, а також деяких інших функцій Python.

source: I was working in the Amoeba distributed operating system group at CWI. We needed a better way to do system administration than by writing either C programs or Bourne shell scripts, since Amoeba had its own system call interface which wasn't easily accessible from the Bourne shell. My experience with error handling in Amoeba made me acutely aware of the importance of exceptions as a programming language feature.
uk: Я працював у групі розподілених операційних систем Amoeba в CWI. Нам потрібен був кращий спосіб адміністрування системи, ніж написання програм на C або сценаріїв оболонки Bourne, оскільки Amoeba мала власний інтерфейс системних викликів, до якого було важко отримати доступ із оболонки Bourne. Мій досвід обробки помилок в Amoeba дав мені чітке усвідомлення важливості винятків як функції мови програмування.

source: It occurred to me that a scripting language with a syntax like ABC but with access to the Amoeba system calls would fill the need. I realized that it would be foolish to write an Amoeba-specific language, so I decided that I needed a language that was generally extensible.
uk: Мені спало на думку, що мова сценаріїв із синтаксисом, подібним до ABC, але з доступом до системних викликів Amoeba, задовольнить цю потребу. Я зрозумів, що було б нерозумно писати мову, специфічну для Amoeba, тому я вирішив, що мені потрібна мова, яка загалом розширювана.

source: During the 1989 Christmas holidays, I had a lot of time on my hand, so I decided to give it a try. During the next year, while still mostly working on it in my own time, Python was used in the Amoeba project with increasing success, and the feedback from colleagues made me add many early improvements.
uk: Під час різдвяних свят 1989 року в мене було багато часу, тож я вирішив спробувати. Протягом наступного року, хоча я все ще здебільшого працював над ним у свій час, Python використовувався в проекті Amoeba з дедалі більшим успіхом, і відгуки колег змусили мене додати багато перших покращень.

source: In February 1991, after just over a year of development, I decided to post to USENET. The rest is in the ``Misc/HISTORY`` file.
uk: У лютому 1991 року, після трохи більше ніж року розробки, я вирішив опублікувати повідомлення в USENET. Решта у файлі ``Misc/HISTORY``.

source: What is Python good for?
uk: Чим корисний Python?

source: Python is a high-level general-purpose programming language that can be applied to many different classes of problems.
uk: Python — це мова програмування високого рівня загального призначення, яку можна застосовувати до багатьох різних класів задач.

source: The language comes with a large standard library that covers areas such as string processing (regular expressions, Unicode, calculating differences between files), internet protocols (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, CGI programming), software engineering (unit testing, logging, profiling, parsing Python code), and operating system interfaces (system calls, filesystems, TCP/IP sockets). Look at the table of contents for :ref:`library-index` to get an idea of what's available. A wide variety of third-party extensions are also available. Consult `the Python Package Index <https://pypi.org>`_ to find packages of interest to you.
uk: Мова постачається з великою стандартною бібліотекою, яка охоплює такі області, як обробка рядків (регулярні вирази, Unicode, обчислення відмінностей між файлами), Інтернет-протоколи (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, програмування CGI), розробка програмного забезпечення (модульне тестування, журналювання, профілювання, розбір коду Python) та інтерфейси операційної системи (системні виклики, файлові системи, сокети TCP/IP). Подивіться на зміст :ref:`library-index`, щоб отримати уявлення про те, що доступно. Також доступний широкий вибір сторонніх розширень. Перегляньте `Індекс пакетів Python <https://pypi.org>`_, щоб знайти пакунки, які вас цікавлять.

source: How does the Python version numbering scheme work?
uk: Як працює схема нумерації версій Python?

source: Python versions are numbered A.B.C or A.B. A is the major version number -- it is only incremented for really major changes in the language. B is the minor version number, incremented for less earth-shattering changes. C is the micro-level -- it is incremented for each bugfix release. See :pep:`6` for more information about bugfix releases.
uk: Версії Python пронумеровані A.B.C або A.B. A — це номер основної версії — він збільшується лише для справді значних змін у мові. B — номер другорядної версії, збільшений для менш карколомних змін. C — це мікрорівень — він збільшується для кожного випуску виправлення помилок. Перегляньте :pep:`6` для отримання додаткової інформації про випуски виправлень вад.

source: Not all releases are bugfix releases. In the run-up to a new major release, a series of development releases are made, denoted as alpha, beta, or release candidate. Alphas are early releases in which interfaces aren't yet finalized; it's not unexpected to see an interface change between two alpha releases. Betas are more stable, preserving existing interfaces but possibly adding new modules, and release candidates are frozen, making no changes except as needed to fix critical bugs.
uk: Не всі випуски є випусками з виправленнями помилок. Напередодні нового основного випуску створюється серія випусків для розробки, які позначаються як альфа-, бета-версія або кандидат на випуск. Альфа-версії — це ранні випуски, інтерфейси яких ще не завершено; не є несподіванкою побачити зміну інтерфейсу між двома альфа-версіями. Бета-версії більш стабільні, зберігають існуючі інтерфейси, але, можливо, додають нові модулі, а кандидати на випуски заморожені, не вносячи жодних змін, окрім тих, які потрібні для виправлення критичних помилок.

source: Alpha, beta and release candidate versions have an additional suffix. The suffix for an alpha version is "aN" for some small number N, the suffix for a beta version is "bN" for some small number N, and the suffix for a release candidate version is "rcN" for some small number N. In other words, all versions labeled 2.0aN precede the versions labeled 2.0bN, which precede versions labeled 2.0rcN, and *those* precede 2.0.
uk: Альфа-, бета-версії та версії-кандидати мають додатковий суфікс. Суфіксом для альфа-версії є "aN" для деякого невеликого числа N, суфіксом для бета-версії є "bN" для деякого невеликого числа N, а суфіксом для версії-кандидата є "rcN" для деякого невеликого числа N. Іншими словами, усі версії з позначкою 2.0aN передують версіям з позначкою 2.0bN, які передують версіям з позначкою 2.0rcN, а *ці* передують 2.0.

source: You may also find version numbers with a "+" suffix, e.g. "2.2+". These are unreleased versions, built directly from the CPython development repository. In practice, after a final minor release is made, the version is incremented to the next minor version, which becomes the "a0" version, e.g. "2.4a0".
uk: Ви також можете знайти номери версій із суфіксом "+", напр. "2,2+". Це неопубліковані версії, створені безпосередньо з репозиторію розробки CPython. На практиці, після створення остаточного мінорного випуску, версія збільшується до наступної мінорної версії, яка стає версією "a0", напр. "2.4a0".

source: See also the documentation for :data:`sys.version`, :data:`sys.hexversion`, and :data:`sys.version_info`.
uk: Дивіться також документацію для :data:`sys.version`, :data:`sys.hexversion` і :data:`sys.version_info`.

source: How do I obtain a copy of the Python source?
uk: Як отримати копію вихідного коду Python?

source: The latest Python source distribution is always available from python.org, at https://www.python.org/downloads/. The latest development sources can be obtained at https://github.com/python/cpython/.
uk: Найновіший вихідний код Python завжди доступний на сайті python.org за адресою https://www.python.org/downloads/. Останні джерела розробки можна отримати на https://github.com/python/cpython/.

source: The source distribution is a gzipped tar file containing the complete C source, Sphinx-formatted documentation, Python library modules, example programs, and several useful pieces of freely distributable software. The source will compile and run out of the box on most UNIX platforms.
uk: Дистрибутив вихідного коду — це файл tar у форматі gzip, що містить повний вихідний код C, документацію у форматі Sphinx, модулі бібліотеки Python, приклади програм і кілька корисних частин програмного забезпечення, яке вільно розповсюджується. Джерело компілюється та запускається з коробки на більшості платформ UNIX.

source: Consult the `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ for more information on getting the source code and compiling it.
uk: Зверніться до розділу `Початок роботи посібника розробника Python <https://devguide.python.org/setup/>`__, щоб дізнатися більше про отримання вихідного коду та його компіляцію.

source: How do I get documentation on Python?
uk: Як отримати документацію щодо Python?

source: The standard documentation for the current stable version of Python is available at https://docs.python.org/3/. PDF, plain text, and downloadable HTML versions are also available at https://docs.python.org/3/download.html.
uk: Стандартна документація для поточної стабільної версії Python доступна за адресою https://docs.python.org/3/. PDF, звичайний текст і HTML-версії для завантаження також доступні за адресою https://docs.python.org/3/download.html.

source: The documentation is written in reStructuredText and processed by `the Sphinx documentation tool <http://sphinx-doc.org/>`__. The reStructuredText source for the documentation is part of the Python source distribution.
uk: Документація написана у форматі reStructuredText і оброблена `інструментом документації Sphinx <http://sphinx-doc.org/>`__. Джерело reStructuredText для документації є частиною вихідного коду Python.

source: I've never programmed before. Is there a Python tutorial?
uk: Я ніколи раніше не програмував. Чи є підручник з Python?

source: There are numerous tutorials and books available. The standard documentation includes :ref:`tutorial-index`.
uk: Доступно багато підручників і книг. Стандартна документація включає :ref:`tutorial-index`.

source: Consult `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ to find information for beginning Python programmers, including lists of tutorials.
uk: Зверніться до `Посібника для початківців <https://wiki.python.org/moin/BeginnersGuide>`_, щоб знайти інформацію для початківців програмістів Python, включаючи списки навчальних посібників.

source: Is there a newsgroup or mailing list devoted to Python?
uk: Чи існує група новин або список розсилки, присвячений Python?

source: There is a newsgroup, :newsgroup:`comp.lang.python`, and a mailing list, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. The newsgroup and mailing list are gatewayed into each other -- if you can read news it's unnecessary to subscribe to the mailing list. :newsgroup:`comp.lang.python` is high-traffic, receiving hundreds of postings every day, and Usenet readers are often more able to cope with this volume.
uk: Є група новин :newsgroup:`comp.lang.python` і список розсилки `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. Група новин і список розсилки пов’язані один з одним — якщо ви можете читати новини, немає необхідності підписуватися на список розсилки. :newsgroup:`comp.lang.python` має високий трафік, отримує сотні публікацій щодня, і читачам Usenet часто легше впоратися з цим обсягом.

source: Announcements of new software releases and events can be found in comp.lang.python.announce, a low-traffic moderated list that receives about five postings per day. It's available as `the python-announce mailing list <https://mail.python.org/mailman/listinfo/python-announce-list>`_.
uk: Оголошення про нові випуски програмного забезпечення та події можна знайти в comp.lang.python.announce, модерованому списку з низьким трафіком, який отримує близько п’яти публікацій на день. Він доступний як `список розсилки python-announce <https://mail.python.org/mailman/listinfo/python-announce-list>`_.

source: More info about other mailing lists and newsgroups can be found at https://www.python.org/community/lists/.
uk: Додаткову інформацію про інші списки розсилки та групи новин можна знайти на https://www.python.org/community/lists/.

source: How do I get a beta test version of Python?
uk: Як отримати тестову бета-версію Python?

source: Alpha and beta releases are available from https://www.python.org/downloads/. All releases are announced on the comp.lang.python and comp.lang.python.announce newsgroups and on the Python home page at https://www.python.org/; an RSS feed of news is available.
uk: Альфа- та бета-версії доступні за адресою https://www.python.org/downloads/. Усі випуски оголошуються в групах новин comp.lang.python і comp.lang.python.announce, а також на домашній сторінці Python за адресою https://www.python.org/; доступна RSS-канал новин.

source: You can also access the development version of Python through Git. See `The Python Developer's Guide <https://devguide.python.org/>`_ for details.
uk: Ви також можете отримати доступ до версії Python для розробки через Git. Перегляньте `Посібник розробника Python <https://devguide.python.org/>`_ для отримання додаткової інформації.

source: How do I submit bug reports and patches for Python?
uk: Як надіслати звіти про помилки та виправлення для Python?

source: For more information on how Python is developed, consult `the Python Developer's Guide <https://devguide.python.org/>`_.
uk: Щоб дізнатися більше про те, як розробляється Python, зверніться до `Посібника розробника Python <https://devguide.python.org/>`_.

source: Are there any published articles about Python that I can reference?
uk: Чи є опубліковані статті про Python, на які я можу посилатися?

source: It's probably best to cite your favorite book about Python.
uk: Мабуть, найкраще процитувати вашу улюблену книгу про Python.

source: The very first article about Python was written in 1991 and is now quite outdated.
uk: Найперша стаття про Python була написана в 1991 році і зараз досить застаріла.

source: Guido van Rossum and Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
uk: Гвідо ван Россум і Джелке де Бур, "Інтерактивне тестування віддалених серверів за допомогою мови програмування Python", CWI Quarterly, том 4, випуск 4 (грудень 1991), Амстердам, стор. 283--303.

source: Are there any books on Python?
uk: Чи є книги про Python?

source: Yes, there are many, and more are being published. See the python.org wiki at https://wiki.python.org/moin/PythonBooks for a list.
uk: Так, їх багато, і публікується більше. Перегляньте список у вікі python.org за адресою https://wiki.python.org/moin/PythonBooks.

source: You can also search online bookstores for "Python" and filter out the Monty Python references; or perhaps search for "Python" and "language".
uk: Ви також можете шукати в книжкових онлайн-магазинах "Python" і відфільтрувати посилання на Monty Python; або, можливо, шукайте "Python" і "мова".

source: Where in the world is www.python.org located?
uk: Де у світі знаходиться www.python.org?

source: The Python project's infrastructure is located all over the world and is managed by the Python Infrastructure Team. Details `here <http://infra.psf.io>`__.
uk: Інфраструктура проекту Python розташована по всьому світу та управляється командою інфраструктури Python. Подробиці `тут <http://infra.psf.io>`__.

source: Why is it called Python?
uk: Чому він називається Python?

source: When he began implementing Python, Guido van Rossum was also reading the published scripts from `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, a BBC comedy series from the 1970s. Van Rossum thought he needed a name that was short, unique, and slightly mysterious, so he decided to call the language Python.
uk: Коли він почав впроваджувати Python, Гвідо ван Россум також читав опубліковані сценарії з `"Летючого цирку Монті Пайтона" <https://en.wikipedia.org/wiki/Monty_Python>`__, комедійного серіалу BBC 1970-х років. Ван Россум подумав, що йому потрібна коротка, унікальна та трохи загадкова назва, тому він вирішив назвати мову Python.

source: Do I have to like "Monty Python's Flying Circus"?
uk: Чи обов’язково мені подобається "Летючий цирк Монті Пайтона"?

source: No, but it helps. :)
uk: Ні, але допомагає. :)

source: Python in the real world
uk: Python у реальному світі

source: How stable is Python?
uk: Наскільки стабільний Python?
