Repository: python/python-docs-uk
Catalog: faq/general.po
Languages: uk

source: Very stable. New, stable releases have been coming out roughly every 6 to 18 months since 1991, and this seems likely to continue. As of version 3.9, Python will have a major new release every 12 months (:pep:`602`).
uk: Дуже стійкий. Нові стабільні випуски виходять приблизно кожні 6-18 місяців з 1991 року, і, схоже, це продовжуватиметься. Починаючи з версії 3.9, Python випускатиметься кожні 12 місяців (:pep:`602`).

source: The developers issue "bugfix" releases of older versions, so the stability of existing releases gradually improves. Bugfix releases, indicated by a third component of the version number (e.g. 3.5.3, 3.6.2), are managed for stability; only fixes for known problems are included in a bugfix release, and it's guaranteed that interfaces will remain the same throughout a series of bugfix releases.
uk: Розробники випускають релізи з "виправленнями" старих версій, тому стабільність існуючих релізів поступово покращується. Випуски виправлень помилок, позначені третім компонентом номера версії (наприклад, 3.5.3, 3.6.2), керуються стабільністю; лише виправлення відомих проблем включено у випуск виправлення помилок, і гарантовано, що інтерфейси залишатимуться незмінними протягом серії випусків виправлень помилок.

source: How many people are using Python?
uk: Скільки людей використовують Python?

source: There are probably millions of users, though it's difficult to obtain an exact count.
uk: Ймовірно, є мільйони користувачів, хоча важко отримати точну кількість.

source: Python is available for free download, so there are no sales figures, and it's available from many different sites and packaged with many Linux distributions, so download statistics don't tell the whole story either.
uk: Python доступний для безкоштовного завантаження, тому немає даних про продажі, і він доступний на багатьох різних сайтах і входить до складу багатьох дистрибутивів Linux, тому статистика завантажень також не говорить усієї історії.

source: The comp.lang.python newsgroup is very active, but not all Python users post to the group or even read it.
uk: Група новин comp.lang.python дуже активна, але не всі користувачі Python пишають у групі або навіть читають її.

source: Have any significant projects been done in Python?
uk: Чи були якісь значні проекти виконані на Python?

source: See https://www.python.org/about/success for a list of projects that use Python. Consulting the proceedings for `past Python conferences <https://www.python.org/community/workshops/>`_ will reveal contributions from many different companies and organizations.
uk: Див. https://www.python.org/about/success, щоб переглянути список проектів, які використовують Python. Перегляд матеріалів `минулих конференцій Python <https://www.python.org/community/workshops/>`_ покаже внески багатьох різних компаній і організацій.

source: High-profile Python projects include `the Mailman mailing list manager <http://www.list.org>`_ and `the Zope application server <http://www.zope.org>`_. Several Linux distributions, most notably `Red Hat <https://www.redhat.com>`_, have written part or all of their installer and system administration software in Python. Companies that use Python internally include Google, Yahoo, and Lucasfilm Ltd.
uk: Високопрофільні проекти Python включають `менеджер списку розсилки Mailman <http://www.list.org>`_ і `сервер додатків Zope <http://www.zope.org>`_. Кілька дистрибутивів Linux, особливо `Red Hat <https://www.redhat.com>`_, написали частину або все програмне забезпечення для встановлення та адміністрування системи на Python. Компанії, які внутрішньо використовують Python, включають Google, Yahoo та Lucasfilm Ltd.

source: What new developments are expected for Python in the future?
uk: Які нові розробки очікуються для Python у майбутньому?

source: New development is discussed on `the python-dev mailing list <https://mail.python.org/mailman/listinfo/python-dev/>`_.
uk: Нова розробка обговорюється в `списку розсилки python-dev <https://mail.python.org/mailman/listinfo/python-dev/>`_.

source: Is it reasonable to propose incompatible changes to Python?
uk: Чи розумно пропонувати несумісні зміни в Python?

source: In general, no. There are already millions of lines of Python code around the world, so any change in the language that invalidates more than a very small fraction of existing programs has to be frowned upon. Even if you can provide a conversion program, there's still the problem of updating all documentation; many books have been written about Python, and we don't want to invalidate them all at a single stroke.
uk: Загалом ні. По всьому світу вже існують мільйони рядків коду Python, тому будь-яку зміну в мові, яка робить недійсною більш ніж дуже малу частину існуючих програм, слід сприймати несхвально. Навіть якщо ви можете надати програму перетворення, все одно залишається проблема оновлення всієї документації; Про Python написано багато книжок, і ми не хочемо скасувати їх усі одним ударом.

source: Providing a gradual upgrade path is necessary if a feature has to be changed. :pep:`5` describes the procedure followed for introducing backward-incompatible changes while minimizing disruption for users.
uk: Надання поступового шляху оновлення є необхідним, якщо функцію потрібно змінити. :pep:`5` описує процедуру введення змін, несумісних із попередніми версіями, мінімізуючи перешкоди для користувачів.

source: Is Python a good language for beginning programmers?
uk: Чи є Python хорошою мовою для програмістів-початківців?

source: Yes.
uk: Так.

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
uk: Досі прийнято починати студентів із процедурної та статично типізованої мови, такої як Pascal, C або підмножини C++ чи Java. Студентам краще буде вивчати Python як рідну мову. Python має дуже простий і послідовний синтаксис і велику стандартну бібліотеку, і, що найважливіше, використання Python на початковому курсі програмування дозволяє студентам зосередитися на важливих навичках програмування, таких як декомпозиція задачі та проектування типів даних. За допомогою Python студенти можуть швидко познайомитися з основними поняттями, такими як цикли та процедури. Ймовірно, вони навіть можуть працювати з об’єктами, визначеними користувачем, у своєму першому курсі.

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
uk: Для студента, який ніколи раніше не програмував, використання статично типізованої мови виглядає неприродним. Це створює додаткову складність, яку студент повинен освоїти, і уповільнює темп курсу. Студенти намагаються навчитися мислити як комп’ютер, декомпонувати проблеми, проектувати послідовні інтерфейси та інкапсулювати дані. Хоча навчитися використовувати статично типізовану мову є важливим у довгостроковій перспективі, це не обов’язково найкраща тема для вивчення в першому курсі програмування студентів.

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that *do* something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
uk: Багато інших аспектів Python роблять його хорошою першою мовою. Подібно до Java, Python має велику стандартну бібліотеку, тому студентам можна призначати проекти програмування на початку курсу, які *роблять* щось. Завдання не обмежуються стандартним чотирифункціональним калькулятором і програмами перевірки балансу. Використовуючи стандартну бібліотеку, студенти можуть отримати задоволення від роботи над реалістичними програмами, вивчаючи основи програмування. Використання стандартної бібліотеки також навчає студентів повторному використанню коду. Сторонні модулі, такі як PyGame, також допомагають розширити охоплення студентів.

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window. If they can't remember the methods for a list, they can do something like this::
uk: Інтерактивний інтерпретатор Python дозволяє студентам тестувати функції мови під час програмування. Вони можуть тримати вікно з запущеним інтерпретатором, поки вони вводять джерело своєї програми в інше вікно. Якщо вони не можуть згадати методи для списку, вони можуть зробити щось подібне:

source: With the interpreter, documentation is never far from the student as they are programming.
uk: З інтерпретатором документація завжди є далекою від студента, оскільки він програмує.

source: There are also good IDEs for Python. IDLE is a cross-platform IDE for Python that is written in Python using Tkinter. PythonWin is a Windows-specific IDE. Emacs users will be happy to know that there is a very good Python mode for Emacs. All of these programming environments provide syntax highlighting, auto-indenting, and access to the interactive interpreter while coding. Consult `the Python wiki <https://wiki.python.org/moin/PythonEditors>`_ for a full list of Python editing environments.
uk: Існують також хороші IDE для Python. IDLE — це кросплатформна IDE для Python, написана на Python за допомогою Tkinter. PythonWin — це IDE для Windows. Користувачі Emacs будуть раді дізнатися, що для Emacs є дуже хороший режим Python. Усі ці середовища програмування забезпечують підсвічування синтаксису, автоматичний відступ і доступ до інтерактивного інтерпретатора під час кодування. Зверніться до `вікі Python <https://wiki.python.org/moin/PythonEditors>`_, щоб отримати повний список середовищ редагування Python.

source: If you want to discuss Python's use in education, you may be interested in joining `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
uk: Якщо ви хочете обговорити використання Python в освіті, вам може бути цікаво приєднатися до `списку розсилки edu-sig <https://www.python.org/community/sigs/current/edu-sig>`_.
