Repository: python/python-docs-uk
Catalog: faq/installed.po
Languages: uk

source: "Why is Python Installed on my Computer?" FAQ
uk: "Чому на моєму комп’ютері встановлено Python?" FAQ

source: What is Python?
uk: Що таке Python?

source: Python is a programming language. It's used for many different applications. It's used in some high schools and colleges as an introductory programming language because Python is easy to learn, but it's also used by professional software developers at places such as Google, NASA, and Lucasfilm Ltd.
uk: Python — мова програмування. Він використовується для багатьох різних застосувань. Його вивчають у деяких середніх школах і коледжах як першу мову програмування, оскільки Python легко вивчити, але його також використовують професійні розробники програмного забезпечення в таких організаціях, як Google, NASA та Lucasfilm Ltd.

source: If you wish to learn more about Python, start with the `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_.
uk: Якщо ви хочете дізнатися більше про Python, почніть із `Посібника для початківців з Python <https://wiki.python.org/moin/BeginnersGuide>`_.

source: Why is Python installed on my machine?
uk: Чому на моїй машині встановлено Python?

source: If you find Python installed on your system but don't remember installing it, there are several possible ways it could have gotten there.
uk: Якщо у вашій системі встановлено Python, але ви не пам’ятаєте, що встановлювали його, існує кілька можливих шляхів, якими він міг туди потрапити.

source: Perhaps another user on the computer wanted to learn programming and installed it; you'll have to figure out who's been using the machine and might have installed it.
uk: Можливо, інший користувач комп'ютера хотів навчитися програмуванню і встановив його; вам доведеться з’ясувати, хто використовував машину і, можливо, її встановив.

source: A third-party application installed on the machine might have been written in Python and included a Python installation. There are many such applications, from GUI programs to network servers and administrative scripts.
uk: Програма стороннього виробника, встановлена на машині, могла бути написана на Python і включала інсталяцію Python. Існує багато таких програм, це і програми з графічним користувацьким инерфейсом і мережеві сервери і адміністративні сценарії.

source: Some Windows machines also have Python installed. At this writing we're aware of computers from Hewlett-Packard and Compaq that include Python. Apparently some of HP/Compaq's administrative tools are written in Python.
uk: На деяких машинах Windows також встановлено Python. На момент написання цієї статті ми знаємо про комп’ютери Hewlett-Packard і Compaq, які включають Python. Очевидно, деякі інструменти адміністрування HP/Compaq написані на Python.

source: Many Unix-compatible operating systems, such as macOS and some Linux distributions, have Python installed by default; it's included in the base installation.
uk: У багатьох Unix-сумісних операційних системах, таких як macOS і деякі дистрибутиви Linux, стандартно встановлено Python; він включений в базову установку.

source: Can I delete Python?
uk: Чи можу я видалити Python?

source: That depends on where Python came from.
uk: Це залежить від того, звідки взявся Python.

source: If someone installed it deliberately, you can remove it without hurting anything. On Windows, use the Add/Remove Programs icon in the Control Panel.
uk: Якщо хтось встановив його додатково, ви можете видалити його, нічого не пошкодивши. У Windows використовуйте піктограму "Установка/видалення програм" на панелі керування.

source: If Python was installed by a third-party application, you can also remove it, but that application will no longer work. You should use that application's uninstaller rather than removing Python directly.
uk: Якщо Python було встановлено в комплекті разом з іншою програмою, ви також можете видалити його, але така програма більше не працюватиме. Вам слід використовувати програму видалення цієї програми, а не видаляти Python безпосередньо.

source: If Python came with your operating system, removing it is not recommended. If you remove it, whatever tools were written in Python will no longer run, and some of them might be important to you. Reinstalling the whole system would then be required to fix things again.
uk: Якщо Python поставляється разом із вашою операційною системою, видаляти його не рекомендується. Якщо ви видалите його, усі інструменти, написані на Python, більше не працюватимуть, а деякі з них можуть бути для вас важливими. Щоб виправити ситуацію, знадобиться перевстановити всю систему.
