Repository: python/python-docs-uk
Catalog: faq/programming.po
Languages: uk

source: Lists are :term:`mutable`, which means that you can change their content.
uk: Списки :term:`mutable`, що означає, що ви можете змінювати їхній вміст.

source: If we instead assign an immutable object to ``x``::
uk: Якщо натомість ми призначимо незмінний об’єкт ``x``::

source: we can see that in this case ``x`` and ``y`` are not equal anymore. This is because integers are :term:`immutable`, and when we do ``x = x + 1`` we are not mutating the int ``5`` by incrementing its value; instead, we are creating a new object (the int ``6``) and assigning it to ``x`` (that is, changing which object ``x`` refers to). After this assignment we have two objects (the ints ``6`` and ``5``) and two variables that refer to them (``x`` now refers to ``6`` but ``y`` still refers to ``5``).
uk: ми бачимо, що в цьому випадку ``x`` і ``y`` більше не рівні. Це тому, що цілі числа :term:`immutable`, і коли ми робимо ``x = x + 1``, ми не змінюємо int ``5``, збільшуючи його значення; натомість ми створюємо новий об’єкт (int ``6``) і призначаємо його ``x`` (тобто змінюємо, на який об’єкт посилається ``x``). Після цього призначення ми маємо два об’єкти (цілі ``6`` і ``5``) і дві змінні, які посилаються на них (``x`` тепер посилається на ``6``, але ``y`` все ще посилається на ``5``).

source: However, there is one class of operations where the same operation sometimes has different behaviors with different types: the augmented assignment operators. For example, ``+=`` mutates lists but not tuples or ints (``a_list += [1, 2, 3]`` is equivalent to ``a_list.extend([1, 2, 3])`` and mutates ``a_list``, whereas ``some_tuple += (1, 2, 3)`` and ``some_int += 1`` create new objects).
uk: Однак існує один клас операцій, де одна й та сама операція іноді має різну поведінку з різними типами: розширені оператори присвоєння. Наприклад, ``+=`` змінює списки, але не кортежі чи цілі (``a_list += [1, 2, 3]`` еквівалентно ``a_list.extend([1, 2, 3])`` і змінює ``a_list``, тоді як ``some_tuple += (1, 2, 3)`` і ``some_int += 1`` створюють нові об’єкти).

source: In other words:
uk: Іншими словами:

source: If we have a mutable object (:class:`list`, :class:`dict`, :class:`set`, etc.), we can use some specific operations to mutate it and all the variables that refer to it will see the change.
uk: Якщо у нас є змінний об’єкт (:class:`list`, :class:`dict`, :class:`set` тощо), ми можемо використати певні операції, щоб змінити його, і всі змінні, які посилаються на нього, будуть побачити зміни.

source: If we have an immutable object (:class:`str`, :class:`int`, :class:`tuple`, etc.), all the variables that refer to it will always see the same value, but operations that transform that value into a new value always return a new object.
uk: Якщо у нас є незмінний об’єкт (:class:`str`, :class:`int`, :class:`tuple` тощо), усі змінні, які посилаються на нього, завжди бачитимуть те саме значення, але операції, що перетворюють це значення в нове значення завжди повертає новий об’єкт.

source: If you want to know if two variables refer to the same object or not, you can use the :keyword:`is` operator, or the built-in function :func:`id`.
uk: Якщо ви хочете знати, чи дві змінні посилаються на той самий об’єкт, ви можете скористатися оператором :keyword:`is` або вбудованою функцією :func:`id`.

source: How do I write a function with output parameters (call by reference)?
uk: Як написати функцію з вихідними параметрами (виклик за посиланням)?

source: Remember that arguments are passed by assignment in Python. Since assignment just creates references to objects, there's no alias between an argument name in the caller and callee, and so no call-by-reference per se. You can achieve the desired effect in a number of ways.
uk: Пам’ятайте, що в Python аргументи передаються шляхом присвоєння. Оскільки присвоєння лише створює посилання на об’єкти, немає псевдоніма між ім’ям аргументу у викликаючому та викликаному, а тому немає виклику за посиланням як такого. Бажаного ефекту можна досягти кількома способами.

source: By returning a tuple of the results::
uk: Повертаючи кортеж результатів::

source: This is almost always the clearest solution.
uk: Це майже завжди найясніше рішення.

source: By using global variables. This isn't thread-safe, and is not recommended.
uk: За допомогою глобальних змінних. Це небезпечно для потоків і не рекомендується.

source: By passing a mutable (changeable in-place) object::
uk: Передаючи змінний (змінний на місці) об’єкт::

source: By passing in a dictionary that gets mutated::
uk: Передаючи словник, який мутується::

source: Or bundle up values in a class instance::
uk: Або об'єднайте значення в екземпляр класу::

source: There's almost never a good reason to get this complicated.
uk: Майже ніколи не буває вагомих причин ускладнювати це.

source: Your best choice is to return a tuple containing the multiple results.
uk: Ваш найкращий вибір — повернути кортеж, що містить кілька результатів.

source: How do you make a higher order function in Python?
uk: Як створити функцію вищого порядку в Python?

source: You have two choices: you can use nested scopes or you can use callable objects. For example, suppose you wanted to define ``linear(a,b)`` which returns a function ``f(x)`` that computes the value ``a*x+b``. Using nested scopes::
uk: У вас є два варіанти: ви можете використовувати вкладені області або ви можете використовувати викликані об’єкти. Наприклад, припустімо, що ви хочете визначити ``linear(a,b)``, яка повертає функцію ``f(x)``, яка обчислює значення ``a*x+b``. Використання вкладених областей::

source: Or using a callable object::
uk: Або за допомогою викликаного об'єкта::

source: In both cases, ::
uk: В обох випадках ::

source: gives a callable object where ``taxes(10e6) == 0.3 * 10e6 + 2``.
uk: дає викликуваний об’єкт, де ``taxes(10e6) == 0,3 * 10e6 + 2``.

source: The callable object approach has the disadvantage that it is a bit slower and results in slightly longer code. However, note that a collection of callables can share their signature via inheritance::
uk: Підхід викликаного об’єкта має той недолік, що він трохи повільніший і призводить до трохи довшого коду. Однак зауважте, що колекція викликів може ділитися своїм підписом через успадкування::

source: Object can encapsulate state for several methods::
uk: Об'єкт може інкапсулювати стан кількома методами:

source: Here ``inc()``, ``dec()`` and ``reset()`` act like functions which share the same counting variable.
uk: Тут ``inc()``, ``dec()`` і ``reset()`` діють як функції, які спільно використовують ту саму змінну підрахунку.

source: How do I copy an object in Python?
uk: Як скопіювати об’єкт у Python?

source: In general, try :func:`copy.copy` or :func:`copy.deepcopy` for the general case. Not all objects can be copied, but most can.
uk: Загалом, спробуйте :func:`copy.copy` або :func:`copy.deepcopy` для загального випадку. Не всі об'єкти можна скопіювати, але більшість можна.

source: Some objects can be copied more easily. Dictionaries have a :meth:`~dict.copy` method::
uk: Деякі об'єкти можна легше скопіювати. Словники мають метод :meth:`~dict.copy`::

source: Sequences can be copied by slicing::
uk: Послідовності можна скопіювати шляхом нарізки:

source: How can I find the methods or attributes of an object?
uk: Як я можу знайти методи або атрибути об’єкта?

source: How can my code discover the name of an object?
uk: Як мій код може виявити назву об’єкта?

source: Generally speaking, it can't, because objects don't really have names. Essentially, assignment always binds a name to a value; the same is true of ``def`` and ``class`` statements, but in that case the value is a callable. Consider the following code::
uk: Загалом, не може, тому що об’єкти насправді не мають назв. По суті, присвоєння завжди прив’язує ім’я до значення; те саме стосується операторів ``def`` і ``class``, але в цьому випадку значення є викликаним. Розглянемо наступний код::

source: Generally speaking it should not be necessary for your code to "know the names" of particular values. Unless you are deliberately writing introspective programs, this is usually an indication that a change of approach might be beneficial.
uk: Взагалі кажучи, вашому коду не потрібно "знати імена" певних значень. Якщо ви не навмисне пишете інтроспективні програми, це зазвичай свідчить про те, що зміна підходу може бути корисною.

source: In comp.lang.python, Fredrik Lundh once gave an excellent analogy in answer to this question:
uk: У comp.lang.python Фредрік Лунд якось дав чудову аналогію у відповідь на це запитання:

source: The same way as you get the name of that cat you found on your porch: the cat (object) itself cannot tell you its name, and it doesn't really care -- so the only way to find out what it's called is to ask all your neighbours (namespaces) if it's their cat (object)...
uk: Так само, як ви отримуєте ім’я того кота, якого знайшли на своєму під’їзді: кіт (об’єкт) сам не може назвати вам своє ім’я, і йому це не дуже важливо, тому єдиний спосіб дізнатися, як його звуть, це запитайте всіх своїх сусідів (простір імен), чи це їхній кіт (об’єкт)...

source: ....and don't be surprised if you'll find that it's known by many names, or no name at all!
uk: ....і не дивуйтеся, якщо ви побачите, що він відомий під багатьма іменами або взагалі без назви!

source: What's up with the comma operator's precedence?
uk: Що трапилося з пріоритетом оператора коми?

source: Comma is not an operator in Python. Consider this session::
uk: Кома не є оператором у Python. Розгляньте цю сесію::

source: Since the comma is not an operator, but a separator between expressions the above is evaluated as if you had entered::
uk: Оскільки кома є не оператором, а роздільником між виразами, наведене вище оцінюється так, ніби ви ввели::

source: not::
uk: ні ::

source: The same is true of the various assignment operators (``=``, ``+=`` etc). They are not truly operators but syntactic delimiters in assignment statements.
uk: Те саме стосується різних операторів присвоювання (``=``, ``+=`` тощо). Вони насправді не є операторами, а синтаксичними роздільниками в операторах присвоєння.

source: Is there an equivalent of C's "?:" ternary operator?
uk: Чи існує еквівалент потрійного оператора C "?:"?

source: Yes, there is. The syntax is as follows::
uk: Так, є. Синтаксис такий::

source: Before this syntax was introduced in Python 2.5, a common idiom was to use logical operators::
uk: До появи цього синтаксису в Python 2.5 поширеною ідіомою було використання логічних операторів::

source: However, this idiom is unsafe, as it can give wrong results when *on_true* has a false boolean value. Therefore, it is always better to use the ``... if ... else ...`` form.
uk: Однак ця ідіома небезпечна, оскільки може дати неправильні результати, якщо *on_true* має хибне логічне значення. Тому завжди краще використовувати форму ``... if ... else ...``.

source: Is it possible to write obfuscated one-liners in Python?
uk: Чи можна написати обфусковані однорядкові тексти на Python?

source: Don't try this at home, kids!
uk: Не пробуйте цього вдома, діти!

source: What does the slash(/) in the parameter list of a function mean?
uk: Що означає коса риска (/) у списку параметрів функції?

source: The slash at the end of the parameter list means that both parameters are positional-only. Thus, calling :func:`divmod` with keyword arguments would lead to an error::
uk: Слеш у кінці списку параметрів означає, що обидва параметри є лише позиційними. Таким чином, виклик :func:`divmod` з ключовими аргументами призведе до помилки::

source: Numbers and strings
uk: Числа та рядки

source: How do I specify hexadecimal and octal integers?
uk: Як вказати шістнадцяткові та вісімкові цілі числа?

source: To specify an octal digit, precede the octal value with a zero, and then a lower or uppercase "o". For example, to set the variable "a" to the octal value "10" (8 in decimal), type::
uk: Щоб вказати вісімкову цифру, поставте перед вісімковим значенням нуль, а потім малу або велику літеру "o". Наприклад, щоб встановити змінну "a" у вісімкове значення "10" (8 у десятковій системі), введіть::

source: Hexadecimal is just as easy. Simply precede the hexadecimal number with a zero, and then a lower or uppercase "x". Hexadecimal digits can be specified in lower or uppercase. For example, in the Python interpreter::
uk: Шістнадцяткове так само легко. Просто поставте перед шістнадцятковим числом нуль, а потім малий або великий регістр "x". Шістнадцяткові цифри можна вказувати як у нижньому, так і у верхньому регістрі. Наприклад, в інтерпретаторі Python::

source: Why does -22 // 10 return -3?
uk: Чому -22 // 10 повертає -3?

source: It's primarily driven by the desire that ``i % j`` have the same sign as ``j``. If you want that, and also want::
uk: Головним чином це зумовлено бажанням, щоб ``i % j`` мав той самий знак, що ``j``. Якщо ви цього хочете, а також хочете::

source: then integer division has to return the floor. C also requires that identity to hold, and then compilers that truncate ``i // j`` need to make ``i % j`` have the same sign as ``i``.
uk: тоді цілочисельне ділення має повернути підлогу. C також вимагає збереження цієї ідентичності, а потім компіляторам, які скорочують ``i // j``, потрібно зробити так, щоб ``i % j`` мав той самий знак, що і ``i``.

source: There are few real use cases for ``i % j`` when ``j`` is negative. When ``j`` is positive, there are many, and in virtually all of them it's more useful for ``i % j`` to be ``>= 0``. If the clock says 10 now, what did it say 200 hours ago? ``-190 % 12 == 2`` is useful; ``-190 % 12 == -10`` is a bug waiting to bite.
uk: Є кілька реальних випадків використання ``i % j``, коли ``j`` є від'ємним. Коли ``j`` додатне, їх багато, і практично в усіх з них корисніше, щоб ``i % j`` було ``>= 0``. Якщо годинник показує 10 зараз, що він показував 200 годин тому? ``-190 % 12 == 2`` є корисним; ``-190 % 12 == -10`` - це помилка, яка чекає, щоб вкусити.

source: How do I get int literal attribute instead of SyntaxError?
uk: Як отримати атрибут int literal замість SyntaxError?

source: The solution is to separate the literal from the period with either a space or parentheses.
uk: Рішення полягає в тому, щоб відокремити літерал від крапки пробілом або дужками.

source: How do I convert a string to a number?
uk: Як перетворити рядок на число?

source: By default, these interpret the number as decimal, so that ``int('0144') == 144`` holds true, and ``int('0x144')`` raises :exc:`ValueError`. ``int(string, base)`` takes the base to convert from as a second optional argument, so ``int( '0x144', 16) == 324``. If the base is specified as 0, the number is interpreted using Python's rules: a leading '0o' indicates octal, and '0x' indicates a hex number.
uk: За замовчуванням вони інтерпретують число як десяткове, так що ``int('0144') == 144`` залишається істинним, а ``int('0x144')`` викликає :exc:`ValueError`. ``int(string, base)`` бере основу для перетворення як другий необов’язковий аргумент, тому ``int( '0x144', 16) == 324``. Якщо основа вказана як 0, число інтерпретується за правилами Python: "0o" на початку означає вісімкове число, а "0x" означає шістнадцяткове число.

source: Do not use the built-in function :func:`eval` if all you need is to convert strings to numbers. :func:`eval` will be significantly slower and it presents a security risk: someone could pass you a Python expression that might have unwanted side effects. For example, someone could pass ``__import__('os').system("rm -rf $HOME")`` which would erase your home directory.
uk: Не використовуйте вбудовану функцію :func:`eval`, якщо вам потрібно лише перетворити рядки на числа. :func:`eval` буде значно повільніше, і це становить ризик для безпеки: хтось може передати вам вираз Python, який може мати небажані побічні ефекти. Наприклад, хтось може передати ``__import__('os').system("rm -rf $HOME")``, що стерло б ваш домашній каталог.

source: :func:`eval` also has the effect of interpreting numbers as Python expressions, so that e.g. ``eval('09')`` gives a syntax error because Python does not allow leading '0' in a decimal number (except '0').
uk: :func:`eval` також має ефект інтерпретації чисел як виразів Python, так що, наприклад, ``eval('09')`` дає синтаксичну помилку, оскільки Python не дозволяє починати '0' у десятковому числі (окрім '0').

source: How do I convert a number to a string?
uk: Як перетворити число на рядок?

source: How do I modify a string in place?
uk: Як змінити рядок на місці?

source: You can't, because strings are immutable. In most situations, you should simply construct a new string from the various parts you want to assemble it from. However, if you need an object with the ability to modify in-place unicode data, try using an :class:`io.StringIO` object or the :mod:`array` module::
uk: Ви не можете, тому що рядки незмінні. У більшості ситуацій вам слід просто побудувати нову струну з різних частин, з яких ви хочете її зібрати. Однак, якщо вам потрібен об’єкт із можливістю змінювати дані Unicode на місці, спробуйте використати об’єкт :class:`io.StringIO` або модуль :mod:`array`::

source: How do I use strings to call functions/methods?
uk: Як використовувати рядки для виклику функцій/методів?

source: There are various techniques.
uk: Існують різні техніки.

source: The best is to use a dictionary that maps strings to functions. The primary advantage of this technique is that the strings do not need to match the names of the functions. This is also the primary technique used to emulate a case construct::
uk: Найкраще використовувати словник, який відображає рядки на функції. Основна перевага цього методу полягає в тому, що рядки не повинні збігатися з назвами функцій. Це також основна техніка, яка використовується для емуляції конструкції case:

source: Use the built-in function :func:`getattr`::
uk: Використовуйте вбудовану функцію :func:`getattr`::

source: Note that :func:`getattr` works on any object, including classes, class instances, modules, and so on.
uk: Зауважте, що :func:`getattr` працює з будь-яким об’єктом, включаючи класи, екземпляри класів, модулі тощо.

source: This is used in several places in the standard library, like this::
uk: Це використовується в кількох місцях стандартної бібліотеки, наприклад:

source: Use :func:`locals` to resolve the function name::
uk: Використовуйте :func:`locals` для визначення імені функції::

source: Is there an equivalent to Perl's chomp() for removing trailing newlines from strings?
uk: Чи існує еквівалент Perl chomp() для видалення завершальних символів нового рядка з рядків?

source: You can use ``S.rstrip("\r\n")`` to remove all occurrences of any line terminator from the end of the string ``S`` without removing other trailing whitespace. If the string ``S`` represents more than one line, with several empty lines at the end, the line terminators for all the blank lines will be removed::
uk: Ви можете використовувати ``S.rstrip("\r\n")``, щоб видалити всі входження будь-якого термінатора рядка з кінця рядка ``S``, не видаляючи інші пробіли в кінці. Якщо рядок ``S`` представляє більше одного рядка з кількома порожніми рядками в кінці, кінцеві знаки для всіх порожніх рядків буде видалено:

source: Since this is typically only desired when reading text one line at a time, using ``S.rstrip()`` this way works well.
uk: Оскільки це зазвичай бажано лише під час читання тексту по одному рядку, використання ``S.rstrip()`` цей спосіб працює добре.

source: Is there a scanf() or sscanf() equivalent?
uk: Чи існує еквівалент scanf() або sscanf()?

source: Not as such.
uk: Не як такої.

source: What does 'UnicodeDecodeError' or 'UnicodeEncodeError' error mean?
uk: Що означає помилка "UnicodeDecodeError" або "UnicodeEncodeError"?

source: See the :ref:`unicode-howto`.
uk: Перегляньте :ref:`unicode-howto`.

source: Performance
uk: Продуктивність

source: My program is too slow. How do I speed it up?
uk: Моя програма надто повільна. Як це прискорити?

source: That's a tough one, in general. First, here are a list of things to remember before diving further:
uk: Загалом, це важко. По-перше, ось список речей, які слід запам’ятати перед подальшим зануренням:

source: Performance characteristics vary across Python implementations. This FAQ focuses on :term:`CPython`.
uk: Характеристики продуктивності відрізняються в різних реалізаціях Python. Цей FAQ присвячений :term:`CPython`.

source: Behaviour can vary across operating systems, especially when talking about I/O or multi-threading.
uk: Поведінка може відрізнятися в різних операційних системах, особливо коли мова йде про введення-виведення або багатопотоковість.

source: You should always find the hot spots in your program *before* attempting to optimize any code (see the :mod:`profile` module).
uk: Ви завжди повинні знаходити гарячі точки у своїй програмі *перед* спробою оптимізувати будь-який код (дивіться модуль :mod:`profile`).

source: Writing benchmark scripts will allow you to iterate quickly when searching for improvements (see the :mod:`timeit` module).
uk: Написання тестових сценаріїв дозволить вам швидко виконувати ітерації під час пошуку покращень (дивіться модуль :mod:`timeit`).

source: It is highly recommended to have good code coverage (through unit testing or any other technique) before potentially introducing regressions hidden in sophisticated optimizations.
uk: Настійно рекомендується добре охопити код (через модульне тестування або будь-яку іншу техніку), перш ніж потенційно вводити регресії, приховані в складних оптимізаціях.

source: That being said, there are many tricks to speed up Python code. Here are some general principles which go a long way towards reaching acceptable performance levels:
uk: З огляду на це, існує багато прийомів, щоб пришвидшити код Python. Ось кілька загальних принципів, які допоможуть досягти прийнятного рівня продуктивності:

source: Making your algorithms faster (or changing to faster ones) can yield much larger benefits than trying to sprinkle micro-optimization tricks all over your code.
uk: Пришвидшення ваших алгоритмів (або заміна на швидші) може дати набагато більші переваги, ніж спроба розсипати трюки мікрооптимізації по всьому коду.

source: Use the right data structures. Study documentation for the :ref:`bltin-types` and the :mod:`collections` module.
uk: Використовуйте правильні структури даних. Навчальна документація для модулів :ref:`bltin-types` і :mod:`collections`.

source: When the standard library provides a primitive for doing something, it is likely (although not guaranteed) to be faster than any alternative you may come up with. This is doubly true for primitives written in C, such as builtins and some extension types. For example, be sure to use either the :meth:`list.sort` built-in method or the related :func:`sorted` function to do sorting (and see the :ref:`sortinghowto` for examples of moderately advanced usage).
uk: Коли стандартна бібліотека надає примітив для виконання чогось, швидше за все (хоча це не гарантовано) буде швидше, ніж будь-яка альтернатива, яку ви можете придумати. Це подвійно вірно для примітивів, написаних на C, таких як вбудовані модулі та деякі типи розширень. Наприклад, обов’язково використовуйте або вбудований метод :meth:`list.sort`, або пов’язану функцію :func:`sorted` для виконання сортування (і перегляньте :ref:`sortinghowto` для прикладів помірно просунутого використання ).
