Repository: python/python-docs-uk
Catalog: faq/programming.po
Languages: uk

source: Programming FAQ
uk: FAQ з програмування

source: Contents
uk: Зміст

source: General Questions
uk: Загальні питання

source: Is there a source code level debugger with breakpoints, single-stepping, etc.?
uk: Чи існує налагоджувач рівня вихідного коду з точками зупинки, однокроковим режимом тощо?

source: Yes.
uk: Так.

source: Several debuggers for Python are described below, and the built-in function :func:`breakpoint` allows you to drop into any of them.
uk: Нижче описано кілька налагоджувачів для Python, і вбудована функція :func:`breakpoint` дозволяє вам перейти до будь-якого з них.

source: The pdb module is a simple but adequate console-mode debugger for Python. It is part of the standard Python library, and is :mod:`documented in the Library Reference Manual <pdb>`. You can also write your own debugger by using the code for pdb as an example.
uk: Модуль pdb — це простий, але адекватний налагоджувач у консольному режимі для Python. Це частина стандартної бібліотеки Python і :mod:`задокументована в Library Reference Manual <pdb>`. Ви також можете написати власний налагоджувач, використовуючи код для pdb як приклад.

source: PythonWin is a Python IDE that includes a GUI debugger based on pdb. The PythonWin debugger colors breakpoints and has quite a few cool features such as debugging non-PythonWin programs. PythonWin is available as part of `pywin32 <https://github.com/mhammond/pywin32>`_ project and as a part of the `ActivePython <https://www.activestate.com/products/python/>`_ distribution.
uk: PythonWin — це середовище розробки Python, яке містить налагоджувач графічного інтерфейсу на основі pdb. Налагоджувач PythonWin забарвлює точки зупину та має чимало цікавих функцій, таких як налагодження програм, які не належать до PythonWin. PythonWin доступний як частина проекту `pywin32 <https://github.com/mhammond/pywin32>`_ і як частина дистрибутива `ActivePython <https://www.activestate.com/products/python/>`_.

source: `trepan3k <https://github.com/rocky/python3-trepan/>`_ is a gdb-like debugger.
uk: `trepan3k <https://github.com/rocky/python3-trepan/>`_ є gdb-подібним налагоджувачем.

source: `Visual Studio Code <https://code.visualstudio.com/>`_ is an IDE with debugging tools that integrates with version-control software.
uk: `Visual Studio Code <https://code.visualstudio.com/>`_ — це середовище розробки з інструментами налагодження, яке інтегрується з програмним забезпеченням для керування версіями.

source: There are a number of commercial Python IDEs that include graphical debuggers. They include:
uk: Існує кілька комерційних Python IDE, які містять графічні налагоджувачі. Вони включають:

source: Are there tools to help find bugs or perform static analysis?
uk: Чи існують інструменти, які допомагають знайти помилки або виконати статичний аналіз?

source: How can I create a stand-alone binary from a Python script?
uk: Як я можу створити автономний двійковий файл зі сценарію Python?

source: You don't need the ability to compile Python to C code if all you want is a stand-alone program that users can download and run without having to install the Python distribution first. There are a number of tools that determine the set of modules required by a program and bind these modules together with a Python binary to produce a single executable.
uk: Вам не потрібна можливість компілювати код Python до C, якщо все, що вам потрібно, це окрема програма, яку користувачі можуть завантажити та запустити без попередньої інсталяції дистрибутива Python. Існує ряд інструментів, які визначають набір модулів, необхідних для програми, і зв’язують ці модулі з двійковим файлом Python для створення єдиного виконуваного файлу.

source: It works by scanning your source recursively for import statements (in both forms) and looking for the modules in the standard Python path as well as in the source directory (for built-in modules). It then turns the bytecode for modules written in Python into C code (array initializers that can be turned into code objects using the marshal module) and creates a custom-made config file that only contains those built-in modules which are actually used in the program. It then compiles the generated C code and links it with the rest of the Python interpreter to form a self-contained binary which acts exactly like your script.
uk: Він працює шляхом рекурсивного сканування джерела на наявність інструкцій імпорту (в обох формах) і пошуку модулів у стандартному шляху Python, а також у вихідному каталозі (для вбудованих модулів). Потім він перетворює байт-код для модулів, написаних на Python, у код C (ініціалізатори масивів, які можна перетворити на об’єкти коду за допомогою модуля marshal) і створює спеціальний файл конфігурації, який містить лише ті вбудовані модулі, які фактично використовуються в програма. Потім він компілює згенерований код C і пов’язує його з рештою інтерпретатора Python, щоб сформувати самодостатній двійковий файл, який діє точно так само, як ваш сценарій.

source: The following packages can help with the creation of console and GUI executables:
uk: Наступні пакети можуть допомогти зі створенням консолі та виконуваних файлів графічного інтерфейсу користувача:

source: `Nuitka <https://nuitka.net/>`_ (Cross-platform)
uk: `Nuitka <https://nuitka.net/>`_ (Кросплатформенний)

source: `PyOxidizer <https://pyoxidizer.readthedocs.io/en/stable/>`_ (Cross-platform)
uk: `PyOxidizer <https://pyoxidizer.readthedocs.io/en/stable/>`_ (Кросплатформенний)

source: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ (Cross-platform)
uk: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ (Кросплатформенний)

source: `py2app <https://github.com/ronaldoussoren/py2app>`_ (macOS only)
uk: `py2app <https://github.com/ronaldoussoren/py2app>`_ (лише для macOS)

source: Are there coding standards or a style guide for Python programs?
uk: Чи існують стандарти кодування чи керівництво по стилю для програм Python?

source: Yes. The coding style required for standard library modules is documented as :pep:`8`.
uk: Так. Стиль кодування, необхідний для модулів стандартної бібліотеки, задокументовано як :pep:`8`.

source: Core Language
uk: Основна мова

source: Why am I getting an UnboundLocalError when the variable has a value?
uk: Чому я отримую помилку UnboundLocalError, коли змінна має значення?

source: This code:
uk: Цей код:

source: works, but this code:
uk: працює, але цей код:

source: This is because when you make an assignment to a variable in a scope, that variable becomes local to that scope and shadows any similarly named variable in the outer scope. Since the last statement in foo assigns a new value to ``x``, the compiler recognizes it as a local variable. Consequently when the earlier ``print(x)`` attempts to print the uninitialized local variable and an error results.
uk: Це пояснюється тим, що коли ви робите призначення змінній в області видимості, ця змінна стає локальною для цієї області і затьмарює будь-яку змінну з подібним іменем у зовнішній області. Оскільки останній оператор у foo присвоює нове значення ``x``, компілятор розпізнає його як локальну змінну. Отже, коли попередній ``print(x)`` намагається надрукувати неініціалізовану локальну змінну, виникає помилка.

source: In the example above you can access the outer scope variable by declaring it global:
uk: У наведеному вище прикладі ви можете отримати доступ до зовнішньої змінної області видимості, оголосивши її глобальною:

source: This explicit declaration is required in order to remind you that (unlike the superficially analogous situation with class and instance variables) you are actually modifying the value of the variable in the outer scope:
uk: Ця явна декларація потрібна, щоб нагадати вам, що (на відміну від зовнішньо аналогічної ситуації зі змінними класу та екземпляра) ви фактично змінюєте значення змінної у зовнішній області:

source: You can do a similar thing in a nested scope using the :keyword:`nonlocal` keyword:
uk: Ви можете зробити подібне у вкладеній області, використовуючи ключове слово :keyword:`nonlocal`:

source: What are the rules for local and global variables in Python?
uk: Які правила для локальних і глобальних змінних у Python?

source: In Python, variables that are only referenced inside a function are implicitly global. If a variable is assigned a value anywhere within the function's body, it's assumed to be a local unless explicitly declared as global.
uk: У Python змінні, на які посилаються лише всередині функції, є неявно глобальними. Якщо змінній присвоєно значення будь-де в тілі функції, вона вважається локальною, якщо вона явно не оголошена як глобальна.

source: Though a bit surprising at first, a moment's consideration explains this. On one hand, requiring :keyword:`global` for assigned variables provides a bar against unintended side-effects. On the other hand, if ``global`` was required for all global references, you'd be using ``global`` all the time. You'd have to declare as global every reference to a built-in function or to a component of an imported module. This clutter would defeat the usefulness of the ``global`` declaration for identifying side-effects.
uk: Хоча це трохи дивно спочатку, мить міркування пояснює це. З одного боку, вимога :keyword:`global` для призначених змінних забезпечує захист від ненавмисних побічних ефектів. З іншого боку, якби ``global`` був потрібний для всіх глобальних посилань, ви б використовували ``global`` весь час. Ви повинні оголосити як глобальне кожне посилання на вбудовану функцію або на компонент імпортованого модуля. Цей безлад перекреслив би корисність оголошення ``global`` для визначення побічних ефектів.

source: Why do lambdas defined in a loop with different values all return the same result?
uk: Чому всі лямбда-вирази, визначені в циклі з різними значеннями, повертають однаковий результат?

source: Assume you use a for loop to define a few different lambdas (or even plain functions), e.g.::
uk: Припустімо, що ви використовуєте цикл for для визначення кількох різних лямбда-виразів (або навіть простих функцій), наприклад::

source: This gives you a list that contains 5 lambdas that calculate ``x**2``. You might expect that, when called, they would return, respectively, ``0``, ``1``, ``4``, ``9``, and ``16``. However, when you actually try you will see that they all return ``16``::
uk: Це дає вам список, який містить 5 лямбда-виразів, які обчислюють ``x**2``. Можна очікувати, що під час виклику вони повертатимуть, відповідно, ``0``, ``1``, ``4``, ``9`` і ``16``. Однак, коли ви насправді спробуєте, ви побачите, що всі вони повертають ``16``::

source: This happens because ``x`` is not local to the lambdas, but is defined in the outer scope, and it is accessed when the lambda is called --- not when it is defined. At the end of the loop, the value of ``x`` is ``4``, so all the functions now return ``4**2``, i.e. ``16``. You can also verify this by changing the value of ``x`` and see how the results of the lambdas change::
uk: Це відбувається тому, що ``x`` не є локальним для лямбда-вираз, а визначено у зовнішній області видимості, і доступ до нього здійснюється під час виклику лямбда-виразки --- а не тоді, коли вона визначена. Наприкінці циклу значення ``x`` дорівнює ``4``, тому всі функції тепер повертають ``4**2``, тобто ``16``. Ви також можете перевірити це, змінивши значення ``x`` і подивившись, як змінюються результати лямбда-виражень:

source: In order to avoid this, you need to save the values in variables local to the lambdas, so that they don't rely on the value of the global ``x``::
uk: Щоб уникнути цього, вам потрібно зберегти значення в змінних, локальних для лямбда-виразів, щоб вони не покладалися на значення глобального ``x``::

source: Here, ``n=x`` creates a new variable ``n`` local to the lambda and computed when the lambda is defined so that it has the same value that ``x`` had at that point in the loop. This means that the value of ``n`` will be ``0`` in the first lambda, ``1`` in the second, ``2`` in the third, and so on. Therefore each lambda will now return the correct result::
uk: Тут ``n=x`` створює нову змінну ``n``, локальну для лямбда-виразу, яка обчислюється, коли лямбда-визначення визначено таким чином, щоб воно мало те саме значення, яке ``x`` мав у цій точці циклу. Це означає, що значення ``n`` буде ``0`` у першому лямбда, ``1`` у другому, ``2`` у третьому, і так далі. Тому кожна лямбда тепер повертатиме правильний результат::

source: Note that this behaviour is not peculiar to lambdas, but applies to regular functions too.
uk: Зауважте, що ця поведінка не властива лямбда-виразам, але також стосується звичайних функцій.

source: How do I share global variables across modules?
uk: Як поділитися глобальними змінними між модулями?

source: The canonical way to share information across modules within a single program is to create a special module (often called config or cfg). Just import the config module in all modules of your application; the module then becomes available as a global name. Because there is only one instance of each module, any changes made to the module object get reflected everywhere. For example:
uk: Канонічний спосіб обміну інформацією між модулями в одній програмі полягає у створенні спеціального модуля (часто називається config або cfg). Просто імпортуйте модуль конфігурації в усі модулі вашої програми; потім модуль стає доступним як глобальне ім'я. Оскільки існує лише один екземпляр кожного модуля, будь-які зміни, внесені до об’єкта модуля, відображаються всюди. Наприклад:

source: What are the "best practices" for using import in a module?
uk: Які "найкращі практики" використання імпорту в модулі?

source: In general, don't use ``from modulename import *``. Doing so clutters the importer's namespace, and makes it much harder for linters to detect undefined names.
uk: Загалом, не використовуйте ``from modulename import *``. Це захаращує простір імен імпортера, і значно ускладнює для лінтерів виявлення невизначених імен.

source: Import modules at the top of a file. Doing so makes it clear what other modules your code requires and avoids questions of whether the module name is in scope. Using one import per line makes it easy to add and delete module imports, but using multiple imports per line uses less screen space.
uk: Імпорт модулів у верхній частині файлу. Це дає зрозуміти, які інші модулі вимагає ваш код, і уникає запитань про те, чи входить ім’я модуля в область видимості. Використання одного імпорту на рядок полегшує додавання та видалення імпортованих модулів, але використання кількох імпортів на рядок займає менше місця на екрані.

source: It's good practice if you import modules in the following order:
uk: Доцільно імпортувати модулі в такому порядку:

source: It is sometimes necessary to move imports to a function or class to avoid problems with circular imports. Gordon McMillan says:
uk: Іноді необхідно перемістити імпорт до функції чи класу, щоб уникнути проблем із циклічним імпортом. Гордон Макміллан каже:

source: Circular imports are fine where both modules use the "import <module>" form of import. They fail when the 2nd module wants to grab a name out of the first ("from module import name") and the import is at the top level. That's because names in the 1st are not yet available, because the first module is busy importing the 2nd.
uk: Циклічний імпорт підходить, якщо обидва модулі використовують форму імпорту "import <module>". Вони зазнають невдачі, коли 2-й модуль хоче отримати ім’я з першого ("з імені імпорту модуля"), а імпорт здійснюється на верхньому рівні. Це тому, що імена в 1-му ще недоступні, оскільки перший модуль зайнятий імпортом 2-го.

source: In this case, if the second module is only used in one function, then the import can easily be moved into that function. By the time the import is called, the first module will have finished initializing, and the second module can do its import.
uk: У цьому випадку, якщо другий модуль використовується лише в одній функції, імпорт можна легко перемістити в цю функцію. До моменту виклику імпорту перший модуль завершить ініціалізацію, і другий модуль зможе виконувати свій імпорт.

source: It may also be necessary to move imports out of the top level of code if some of the modules are platform-specific. In that case, it may not even be possible to import all of the modules at the top of the file. In this case, importing the correct modules in the corresponding platform-specific code is a good option.
uk: Також може знадобитися перемістити імпорт із верхнього рівня коду, якщо деякі модулі залежать від платформи. У цьому випадку може бути навіть неможливо імпортувати всі модулі у верхній частині файлу. У цьому випадку хорошим варіантом є імпорт правильних модулів у відповідний специфічний для платформи код.

source: Only move imports into a local scope, such as inside a function definition, if it's necessary to solve a problem such as avoiding a circular import or are trying to reduce the initialization time of a module. This technique is especially helpful if many of the imports are unnecessary depending on how the program executes. You may also want to move imports into a function if the modules are only ever used in that function. Note that loading a module the first time may be expensive because of the one time initialization of the module, but loading a module multiple times is virtually free, costing only a couple of dictionary lookups. Even if the module name has gone out of scope, the module is probably available in :data:`sys.modules`.
uk: Переміщуйте імпорт у локальну область, наприклад, у визначення функції, лише якщо це необхідно для вирішення проблеми, як-от уникнення циклічного імпорту або намагання скоротити час ініціалізації модуля. Ця техніка особливо корисна, якщо багато імпортів непотрібні залежно від того, як виконується програма. Ви також можете перемістити імпорт у функцію, якщо модулі використовуються лише в цій функції. Зауважте, що завантаження модуля вперше може бути дорогим через одноразову ініціалізацію модуля, але багаторазове завантаження модуля практично безкоштовне, коштуючи лише кількох пошуків у словнику. Навіть якщо назва модуля вийшла за межі видимості, модуль, імовірно, доступний у :data:`sys.modules`.

source: Why are default values shared between objects?
uk: Чому значення за замовчуванням є спільними між об’єктами?

source: This type of bug commonly bites neophyte programmers. Consider this function::
uk: Цей тип помилок зазвичай кусає програмістів-неофітів. Розглянемо цю функцію::

source: The first time you call this function, ``mydict`` contains a single item. The second time, ``mydict`` contains two items because when ``foo()`` begins executing, ``mydict`` starts out with an item already in it.
uk: Під час першого виклику цієї функції ``mydict`` містить один елемент. Другого разу ``mydict`` містить два елементи, тому що коли ``foo()`` починає виконуватися, ``mydict`` починає з елементом, який уже є в ньому.

source: It is often expected that a function call creates new objects for default values. This is not what happens. Default values are created exactly once, when the function is defined. If that object is changed, like the dictionary in this example, subsequent calls to the function will refer to this changed object.
uk: Часто очікується, що виклик функції створює нові об’єкти для значень за замовчуванням. Такого не буває. Значення за замовчуванням створюються рівно один раз під час визначення функції. Якщо цей об’єкт змінено, як і словник у цьому прикладі, наступні виклики функції посилатимуться на цей змінений об’єкт.

source: By definition, immutable objects such as numbers, strings, tuples, and ``None``, are safe from change. Changes to mutable objects such as dictionaries, lists, and class instances can lead to confusion.
uk: За визначенням, незмінні об’єкти, такі як числа, рядки, кортежі та ``None``, захищені від змін. Зміни змінних об’єктів, таких як словники, списки та екземпляри класів, можуть призвести до плутанини.

source: Because of this feature, it is good programming practice to not use mutable objects as default values. Instead, use ``None`` as the default value and inside the function, check if the parameter is ``None`` and create a new list/dictionary/whatever if it is. For example, don't write::
uk: Через цю функцію хороша практика програмування не використовувати змінні об’єкти як значення за замовчуванням. Натомість використовуйте ``None`` як значення за замовчуванням і всередині функції перевірте, чи параметр ``None``, і створіть новий список/словник/що завгодно, якщо він є. Наприклад, не пишіть::

source: but::
uk: але ::

source: This feature can be useful. When you have a function that's time-consuming to compute, a common technique is to cache the parameters and the resulting value of each call to the function, and return the cached value if the same value is requested again. This is called "memoizing", and can be implemented like this::
uk: Ця функція може бути корисною. Якщо у вас є функція, обчислення якої потребує багато часу, поширеною технікою є кешування параметрів і результуючого значення кожного виклику функції та повернення кешованого значення, якщо те саме значення запитується знову. Це називається "запам'ятовування" і може бути реалізовано так:

source: You could use a global variable containing a dictionary instead of the default value; it's a matter of taste.
uk: Ви можете використовувати глобальну змінну, що містить словник, замість значення за замовчуванням; це справа смаку.

source: How can I pass optional or keyword parameters from one function to another?
uk: Як я можу передати необов’язкові або ключові параметри з однієї функції в іншу?

source: Collect the arguments using the ``*`` and ``**`` specifiers in the function's parameter list; this gives you the positional arguments as a tuple and the keyword arguments as a dictionary. You can then pass these arguments when calling another function by using ``*`` and ``**``::
uk: Зберіть аргументи за допомогою специфікаторів ``*`` і ``**`` у списку параметрів функції; це дає вам позиційні аргументи як кортеж і ключові аргументи як словник. Потім ви можете передати ці аргументи під час виклику іншої функції за допомогою ``*`` і ``**``::

source: What is the difference between arguments and parameters?
uk: Яка різниця між аргументами та параметрами?

source: *foo*, *bar* and *kwargs* are parameters of ``func``. However, when calling ``func``, for example::
uk: *foo*, *bar* і *kwargs* є параметрами ``func``. Однак під час виклику ``func``, наприклад::

source: the values ``42``, ``314``, and ``somevar`` are arguments.
uk: значення ``42``, ``314`` і ``somevar`` є аргументами.

source: Why did changing list 'y' also change list 'x'?
uk: Чому зміна списку 'y' також змінила список 'x'?

source: If you wrote code like::
uk: Якщо ви написали такий код::

source: you might be wondering why appending an element to ``y`` changed ``x`` too.
uk: можливо, вам буде цікаво, чому додавання елемента до ``y`` також змінило ``x``.

source: There are two factors that produce this result:
uk: Є два чинники, які призводять до такого результату:

source: Variables are simply names that refer to objects. Doing ``y = x`` doesn't create a copy of the list -- it creates a new variable ``y`` that refers to the same object ``x`` refers to. This means that there is only one object (the list), and both ``x`` and ``y`` refer to it.
uk: Змінні - це просто імена, які посилаються на об'єкти. Виконання ``y = x`` не створює копію списку — воно створює нову змінну ``y``, яка посилається на той самий об’єкт, на який посилається ``x``. Це означає, що є лише один об’єкт (список), і як ``x``, так і ``y`` посилаються на нього.
