Repository: python/python-docs-uk
Catalog: faq/programming.po
Languages: uk

source: Abstractions tend to create indirections and force the interpreter to work more. If the levels of indirection outweigh the amount of useful work done, your program will be slower. You should avoid excessive abstraction, especially under the form of tiny functions or methods (which are also often detrimental to readability).
uk: Абстракції, як правило, створюють непрямість і змушують перекладача працювати більше. Якщо рівень опосередкованості переважає обсяг виконаної корисної роботи, ваша програма працюватиме повільніше. Вам слід уникати надмірної абстракції, особливо у формі крихітних функцій або методів (які також часто шкодять читабельності).

source: The wiki page devoted to `performance tips <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.
uk: Вікі-сторінка, присвячена `порадам щодо продуктивності <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.

source: What is the most efficient way to concatenate many strings together?
uk: Який найефективніший спосіб об’єднати багато рядків?

source: :class:`str` and :class:`bytes` objects are immutable, therefore concatenating many strings together is inefficient as each concatenation creates a new object. In the general case, the total runtime cost is quadratic in the total string length.
uk: Об’єкти :class:`str` і :class:`bytes` є незмінними, тому конкатенація багатьох рядків разом неефективна, оскільки кожна конкатенація створює новий об’єкт. У загальному випадку загальна вартість виконання є квадратичною щодо загальної довжини рядка.

source: To accumulate many :class:`str` objects, the recommended idiom is to place them into a list and call :meth:`str.join` at the end::
uk: Щоб накопичити багато об’єктів :class:`str`, рекомендована ідіома полягає в тому, щоб помістити їх у список і викликати :meth:`str.join` в кінці::

source: (another reasonably efficient idiom is to use :class:`io.StringIO`)
uk: (іншою досить ефективною ідіомою є використання :class:`io.StringIO`)

source: To accumulate many :class:`bytes` objects, the recommended idiom is to extend a :class:`bytearray` object using in-place concatenation (the ``+=`` operator)::
uk: Щоб накопичити багато об’єктів :class:`bytes`, рекомендована ідіома полягає в тому, щоб розширити об’єкт :class:`bytearray` за допомогою конкатенації на місці (оператор ``+=``):

source: Sequences (Tuples/Lists)
uk: Послідовності (кортежі/списки)

source: How do I convert between tuples and lists?
uk: Як конвертувати між кортежами та списками?

source: The type constructor ``tuple(seq)`` converts any sequence (actually, any iterable) into a tuple with the same items in the same order.
uk: Конструктор типу ``tuple(seq)`` перетворює будь-яку послідовність (фактично, будь-яку ітерацію) у кортеж з тими самими елементами в тому самому порядку.

source: For example, ``tuple([1, 2, 3])`` yields ``(1, 2, 3)`` and ``tuple('abc')`` yields ``('a', 'b', 'c')``. If the argument is a tuple, it does not make a copy but returns the same object, so it is cheap to call :func:`tuple` when you aren't sure that an object is already a tuple.
uk: Наприклад, ``tuple([1, 2, 3])`` дає ``(1, 2, 3)``, ``tuple('abc')`` дає ``('a', 'b ', 'c')``. Якщо аргумент є кортежем, він не створює копію, а повертає той самий об’єкт, тому дешево викликати :func:`tuple`, коли ви не впевнені, що об’єкт уже є кортежем.

source: The type constructor ``list(seq)`` converts any sequence or iterable into a list with the same items in the same order. For example, ``list((1, 2, 3))`` yields ``[1, 2, 3]`` and ``list('abc')`` yields ``['a', 'b', 'c']``. If the argument is a list, it makes a copy just like ``seq[:]`` would.
uk: Конструктор типу ``list(seq)`` перетворює будь-яку послідовність або ітерацію в список з тими самими елементами в тому самому порядку. Наприклад, ``list((1, 2, 3))`` дає ``[1, 2, 3]``, а ``list('abc')`` дає ``['a', 'b ', 'c']``. Якщо аргумент є списком, він створює копію так само, як ``seq[:]``.

source: What's a negative index?
uk: Що таке негативний індекс?

source: Python sequences are indexed with positive numbers and negative numbers. For positive numbers 0 is the first index 1 is the second index and so forth. For negative indices -1 is the last index and -2 is the penultimate (next to last) index and so forth. Think of ``seq[-n]`` as the same as ``seq[len(seq)-n]``.
uk: Послідовності Python індексуються позитивними та негативними числами. Для додатних чисел 0 є першим індексом, 1 є другим індексом і так далі. Для негативних індексів -1 є останнім індексом, а -2 є передостаннім (передостаннім) індексом і так далі. Подумайте про ``seq[-n]`` як про те саме, що ``seq[len(seq)-n]``.

source: Using negative indices can be very convenient. For example ``S[:-1]`` is all of the string except for its last character, which is useful for removing the trailing newline from a string.
uk: Використання від’ємних індексів може бути дуже зручним. Наприклад, ``S[:-1]`` — це весь рядок, за винятком останнього символу, який корисний для видалення кінцевого символу нового рядка з рядка.

source: How do I iterate over a sequence in reverse order?
uk: Як мені виконати ітерацію по послідовності у зворотному порядку?

source: Use the :func:`reversed` built-in function::
uk: Використовуйте вбудовану функцію :func:`reversed`::

source: This won't touch your original sequence, but build a new copy with reversed order to iterate over.
uk: Це не торкнеться вашої оригінальної послідовності, але створить нову копію зі зворотним порядком повторення.

source: How do you remove duplicates from a list?
uk: Як видалити дублікати зі списку?

source: See the Python Cookbook for a long discussion of many ways to do this:
uk: Перегляньте кулінарну книгу Python для довгого обговорення багатьох способів зробити це:

source: If you don't mind reordering the list, sort it and then scan from the end of the list, deleting duplicates as you go::
uk: Якщо ви не проти змінити порядок списку, відсортуйте його, а потім скануйте з кінця списку, видаляючи дублікати по ходу::

source: If all elements of the list may be used as set keys (i.e. they are all :term:`hashable`) this is often faster ::
uk: Якщо всі елементи списку можна використовувати як набір ключів (тобто всі вони :term:`hashable`), це часто швидше ::

source: This converts the list into a set, thereby removing duplicates, and then back into a list.
uk: Це перетворює список на набір, таким чином видаляючи дублікати, а потім знову на список.

source: How do you remove multiple items from a list
uk: Як видалити кілька елементів зі списку

source: As with removing duplicates, explicitly iterating in reverse with a delete condition is one possibility. However, it is easier and faster to use slice replacement with an implicit or explicit forward iteration. Here are three variations.::
uk: Як і у випадку з видаленням дублікатів, явне повторення у зворотному порядку з умовою видалення є однією з можливостей. Однак простіше і швидше використовувати заміну фрагмента з неявною або явною прямою ітерацією. Ось три варіації::

source: The list comprehension may be fastest.
uk: Розуміння списку може бути найшвидшим.

source: How do you make an array in Python?
uk: Як створити масив у Python?

source: Use a list::
uk: Використовуйте список::

source: Lists are equivalent to C or Pascal arrays in their time complexity; the primary difference is that a Python list can contain objects of many different types.
uk: За часовою складністю списки еквівалентні масивам C або Pascal; основна відмінність полягає в тому, що список Python може містити об’єкти багатьох різних типів.

source: How do I create a multidimensional list?
uk: Як створити багатовимірний список?

source: You probably tried to make a multidimensional array like this::
uk: Можливо, ви намагалися створити багатовимірний масив, подібний до цього:

source: This looks correct if you print it:
uk: Це виглядає правильно, якщо ви його надрукуєте:

source: But when you assign a value, it shows up in multiple places:
uk: Але коли ви призначаєте значення, воно відображається в кількох місцях:

source: The reason is that replicating a list with ``*`` doesn't create copies, it only creates references to the existing objects. The ``*3`` creates a list containing 3 references to the same list of length two. Changes to one row will show in all rows, which is almost certainly not what you want.
uk: Причина полягає в тому, що реплікація списку з ``*`` не створює копії, а лише створює посилання на існуючі об’єкти. ``*3`` створює список, що містить 3 посилання на той самий список довжиною два. Зміни в одному рядку відображатимуться в усіх рядках, що майже напевно не те, що ви хочете.

source: The suggested approach is to create a list of the desired length first and then fill in each element with a newly created list::
uk: Пропонований підхід полягає в тому, щоб спочатку створити список потрібної довжини, а потім заповнити кожен елемент новоствореним списком::

source: This generates a list containing 3 different lists of length two. You can also use a list comprehension::
uk: Це генерує список, що містить 3 різні списки довжиною два. Ви також можете використовувати розуміння списку:

source: Why does a_tuple[i] += ['item'] raise an exception when the addition works?
uk: Чому a_tuple[i] += ['item'] викликає виключення, коли додавання працює?

source: This is because of a combination of the fact that augmented assignment operators are *assignment* operators, and the difference between mutable and immutable objects in Python.
uk: Це пояснюється поєднанням того факту, що розширені оператори присвоєння є операторами *присвоєння*, а також різниці між змінними та незмінними об’єктами в Python.

source: This discussion applies in general when augmented assignment operators are applied to elements of a tuple that point to mutable objects, but we'll use a ``list`` and ``+=`` as our exemplar.
uk: Це обговорення загалом стосується випадків, коли розширені оператори присвоєння застосовуються до елементів кортежу, які вказують на змінні об’єкти, але ми будемо використовувати ``list`` і ``+=`` як наш приклад.

source: If you wrote::
uk: Якщо ви написали::

source: The reason for the exception should be immediately clear: ``1`` is added to the object ``a_tuple[0]`` points to (``1``), producing the result object, ``2``, but when we attempt to assign the result of the computation, ``2``, to element ``0`` of the tuple, we get an error because we can't change what an element of a tuple points to.
uk: Причина винятку має бути зрозуміла одразу: ``1`` додається до об’єкта ``a_tuple[0]``, що вказує на (``1``), створюючи об’єкт результату ``2``, але коли ми намагаємося призначити результат обчислення, ``2``, елементу ``0`` кортежу, ми отримуємо помилку, оскільки ми не можемо змінити те, на що вказує елемент кортежу.

source: Under the covers, what this augmented assignment statement is doing is approximately this::
uk: Під обкладинками цей доповнений оператор присвоєння робить приблизно наступне:

source: It is the assignment part of the operation that produces the error, since a tuple is immutable.
uk: Саме частина операції присвоєння створює помилку, оскільки кортеж є незмінним.

source: When you write something like::
uk: Коли ви пишете щось на зразок::

source: The exception is a bit more surprising, and even more surprising is the fact that even though there was an error, the append worked::
uk: Виняток є трохи більш дивним, і ще більш дивним є той факт, що, незважаючи на помилку, додаток працював:

source: This is equivalent to::
uk: Це еквівалентно::

source: The object pointed to by a_list has been mutated, and the pointer to the mutated object is assigned back to ``a_list``. The end result of the assignment is a no-op, since it is a pointer to the same object that ``a_list`` was previously pointing to, but the assignment still happens.
uk: Об’єкт, на який вказує a_list, було змінено, і вказівник на змінений об’єкт знову призначено ``a_list``. Кінцевим результатом призначення є no-op, оскільки це вказівник на той самий об’єкт, на який раніше вказував ``a_list``, але призначення все одно відбувається.

source: Thus, in our tuple example what is happening is equivalent to::
uk: Таким чином, у нашому прикладі кортежу те, що відбувається, еквівалентно::

source: I want to do a complicated sort: can you do a Schwartzian Transform in Python?
uk: Я хочу зробити складне сортування: чи можете ви виконати перетворення Шварца в Python?

source: The technique, attributed to Randal Schwartz of the Perl community, sorts the elements of a list by a metric which maps each element to its "sort value". In Python, use the ``key`` argument for the :meth:`list.sort` method::
uk: Техніка, яку приписують Рендалу Шварцу зі спільноти Perl, сортує елементи списку за метрикою, яка відображає кожен елемент на його "значення сортування". У Python використовуйте аргумент ``key`` для методу :meth:`list.sort`::

source: How can I sort one list by values from another list?
uk: Як я можу сортувати один список за значеннями з іншого списку?

source: Merge them into an iterator of tuples, sort the resulting list, and then pick out the element you want. ::
uk: Об’єднайте їх у ітератор кортежів, відсортуйте отриманий список, а потім виберіть потрібний елемент. ::

source: Objects
uk: Об'єкти

source: What is a class?
uk: Що таке клас?

source: A class is the particular object type created by executing a class statement. Class objects are used as templates to create instance objects, which embody both the data (attributes) and code (methods) specific to a datatype.
uk: Клас — це окремий тип об’єкта, створений шляхом виконання оператора класу. Об’єкти класу використовуються як шаблони для створення об’єктів екземплярів, які втілюють як дані (атрибути), так і код (методи), специфічні для типу даних.

source: A class can be based on one or more other classes, called its base class(es). It then inherits the attributes and methods of its base classes. This allows an object model to be successively refined by inheritance. You might have a generic ``Mailbox`` class that provides basic accessor methods for a mailbox, and subclasses such as ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` that handle various specific mailbox formats.
uk: Клас може базуватися на одному або кількох інших класах, які називаються базовими класами. Потім він успадковує атрибути та методи своїх базових класів. Це дозволяє послідовно вдосконалювати об’єктну модель шляхом успадкування. У вас може бути загальний клас ``Поштова скринька``, який надає основні методи доступу до поштової скриньки, і підкласи, такі як ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox``, які обробляють різні конкретні формати поштових скриньок.

source: What is a method?
uk: Що таке метод?

source: A method is a function on some object ``x`` that you normally call as ``x.name(arguments...)``. Methods are defined as functions inside the class definition::
uk: Метод — це функція для деякого об’єкта ``x``, який зазвичай викликається як ``x.name(arguments...)``. Методи визначаються як функції всередині визначення класу::

source: What is self?
uk: Що таке себе?

source: Self is merely a conventional name for the first argument of a method. A method defined as ``meth(self, a, b, c)`` should be called as ``x.meth(a, b, c)`` for some instance ``x`` of the class in which the definition occurs; the called method will think it is called as ``meth(x, a, b, c)``.
uk: Self — це просто умовна назва для першого аргументу методу. Метод, визначений як ``meth(self, a, b, c)``, слід викликати як ``x.meth(a, b, c)`` для деякого екземпляра ``x`` класу, в якому відбувається визначення; викликаний метод вважатиме, що він викликається як ``meth(x, a, b, c)``.

source: See also :ref:`why-self`.
uk: Дивіться також :ref:`why-self`.

source: How do I check if an object is an instance of a given class or of a subclass of it?
uk: Як перевірити, чи є об’єкт екземпляром заданого класу чи його підкласу?

source: Note that :func:`isinstance` also checks for virtual inheritance from an :term:`abstract base class`. So, the test will return ``True`` for a registered class even if hasn't directly or indirectly inherited from it. To test for "true inheritance", scan the :term:`MRO` of the class:
uk: Зауважте, що :func:`isinstance` також перевіряє віртуальне успадкування від :term:`abstract base class`. Таким чином, тест поверне ``True`` для зареєстрованого класу, навіть якщо він прямо чи опосередковано не успадкував його. Щоб перевірити "справжнє успадкування", проскануйте :term:`MRO` класу:

source: Note that most programs do not use :func:`isinstance` on user-defined classes very often. If you are developing the classes yourself, a more proper object-oriented style is to define methods on the classes that encapsulate a particular behaviour, instead of checking the object's class and doing a different thing based on what class it is. For example, if you have a function that does something::
uk: Зауважте, що більшість програм не дуже часто використовують :func:`isinstance` у визначених користувачем класах. Якщо ви розробляєте класи самостійно, більш правильним об’єктно-орієнтованим стилем є визначення методів у класах, які інкапсулюють конкретну поведінку, замість перевірки класу об’єкта та виконання інших дій на основі того, який це клас. Наприклад, якщо у вас є функція, яка щось робить:

source: A better approach is to define a ``search()`` method on all the classes and just call it::
uk: Кращий підхід полягає в тому, щоб визначити метод ``search()`` для всіх класів і просто викликати його::

source: What is delegation?
uk: Що таке делегування?

source: Delegation is an object oriented technique (also called a design pattern). Let's say you have an object ``x`` and want to change the behaviour of just one of its methods. You can create a new class that provides a new implementation of the method you're interested in changing and delegates all other methods to the corresponding method of ``x``.
uk: Делегування — це об’єктно-орієнтована техніка (яка також називається шаблоном проектування). Припустімо, у вас є об’єкт ``x`` і ви хочете змінити поведінку лише одного з його методів. Ви можете створити новий клас, який забезпечує нову реалізацію методу, який ви хочете змінити, і делегує всі інші методи відповідному методу ``x``.

source: Python programmers can easily implement delegation. For example, the following class implements a class that behaves like a file but converts all written data to uppercase::
uk: Програмісти на Python можуть легко реалізувати делегування. Наприклад, наступний клас реалізує клас, який поводиться як файл, але перетворює всі записані дані у верхній регістр:

source: How do I call a method defined in a base class from a derived class that extends it?
uk: Як викликати метод, визначений у базовому класі, з похідного класу, який його розширює?

source: Use the built-in :func:`super` function::
uk: Використовуйте вбудовану функцію :func:`super`::

source: In the example, :func:`super` will automatically determine the instance from which it was called (the ``self`` value), look up the :term:`method resolution order` (MRO) with ``type(self).__mro__``, and return the next in line after ``Derived`` in the MRO: ``Base``.
uk: У прикладі :func:`super` автоматично визначатиме екземпляр, з якого його було викликано (значення ``self``), шукатиме :term:`method resolution order` (MRO) за допомогою ``type(self) ).__mro__`` і повертає наступний рядок після ``Derived`` у MRO: ``Base``.

source: How can I organize my code to make it easier to change the base class?
uk: Як я можу організувати свій код, щоб полегшити зміну базового класу?

source: You could assign the base class to an alias and derive from the alias. Then all you have to change is the value assigned to the alias. Incidentally, this trick is also handy if you want to decide dynamically (e.g. depending on availability of resources) which base class to use. Example::
uk: Ви можете призначити базовий клас псевдоніму та отримати його від псевдоніма. Тоді все, що вам потрібно змінити, це значення, присвоєне псевдоніму. До речі, цей прийом також зручний, якщо ви хочете динамічно (наприклад, залежно від наявності ресурсів) вирішувати, який базовий клас використовувати. Приклад::

source: How do I create static class data and static class methods?
uk: Як створити статичні дані класу та статичні методи класу?

source: Both static data and static methods (in the sense of C++ or Java) are supported in Python.
uk: У Python підтримуються як статичні дані, так і статичні методи (у сенсі C++ або Java).

source: For static data, simply define a class attribute. To assign a new value to the attribute, you have to explicitly use the class name in the assignment::
uk: Для статичних даних просто визначте атрибут класу. Щоб призначити нове значення атрибуту, ви повинні явно використовувати ім’я класу в призначенні::

source: ``c.count`` also refers to ``C.count`` for any ``c`` such that ``isinstance(c, C)`` holds, unless overridden by ``c`` itself or by some class on the base-class search path from ``c.__class__`` back to ``C``.
uk: ``c.count`` також посилається на ``C.count`` для будь-якого ``c`` такого, що ``isinstance(c, C)`` має місце, якщо не перевизначено самим ``c`` або деякими на шляху пошуку базового класу від ``c.__class__`` назад до ``C``.

source: Caution: within a method of C, an assignment like ``self.count = 42`` creates a new and unrelated instance named "count" in ``self``'s own dict. Rebinding of a class-static data name must always specify the class whether inside a method or not::
uk: Застереження: у методі C призначення на кшталт ``self.count = 42`` створює новий і непов’язаний екземпляр під назвою "count" у власному дикторі ``self``. Повторне прив’язування назви статичних даних класу має завжди вказувати клас незалежно від того, чи знаходиться він у методі чи ні:

source: Static methods are possible::
uk: Можливі статичні методи:

source: However, a far more straightforward way to get the effect of a static method is via a simple module-level function::
uk: Однак набагато більш простий спосіб отримати ефект статичного методу — це за допомогою простої функції на рівні модуля::

source: If your code is structured so as to define one class (or tightly related class hierarchy) per module, this supplies the desired encapsulation.
uk: Якщо ваш код структурований таким чином, щоб визначити один клас (або тісно пов’язану ієрархію класів) на модуль, це забезпечує бажану інкапсуляцію.

source: How can I overload constructors (or methods) in Python?
uk: Як я можу перевантажити конструктори (або методи) у Python?

source: This answer actually applies to all methods, but the question usually comes up first in the context of constructors.
uk: Ця відповідь фактично стосується всіх методів, але зазвичай це питання виникає першим у контексті конструкторів.

source: In C++ you'd write
uk: У C++ ви б написали

source: In Python you have to write a single constructor that catches all cases using default arguments. For example::
uk: У Python ви повинні написати єдиний конструктор, який ловить усі випадки, використовуючи аргументи за замовчуванням. Наприклад::

source: This is not entirely equivalent, but close enough in practice.
uk: Це не зовсім еквівалентно, але досить близько на практиці.

source: You could also try a variable-length argument list, e.g. ::
uk: Ви також можете спробувати список аргументів змінної довжини, наприклад. ::

source: The same approach works for all method definitions.
uk: Той самий підхід працює для всіх визначень методів.

source: I try to use __spam and I get an error about _SomeClassName__spam.
uk: Я намагаюся використовувати __спам і отримую помилку про _SomeClassName__спам.
