Repository: python/python-docs-uk
Catalog: faq/programming.po
Languages: uk

source: Variable names with double leading underscores are "mangled" to provide a simple but effective way to define class private variables. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with any leading underscores stripped.
uk: Назви змінних із подвійним підкресленням на початку "спотворені", щоб забезпечити простий, але ефективний спосіб визначення приватних змінних класу. Будь-який ідентифікатор у формі ``__spam`` (принаймні два символи підкреслення на початку, не більше одного символу підкреслення в кінці) текстово замінюється на ``_classname__spam``, де ``classname`` є поточною назвою класу з будь-якими початковими символами підкреслення.

source: My class defines __del__ but it is not called when I delete the object.
uk: Мій клас визначає __del__, але він не викликається, коли я видаляю об’єкт.

source: There are several possible reasons for this.
uk: Для цього є кілька можливих причин.

source: Another way to avoid cyclical references is to use the :mod:`weakref` module, which allows you to point to objects without incrementing their reference count. Tree data structures, for instance, should use weak references for their parent and sibling references (if they need them!).
uk: Іншим способом уникнути циклічних посилань є використання модуля :mod:`weakref`, який дозволяє вам вказувати на об’єкти, не збільшуючи їх кількість посилань. Деревоподібні структури даних, наприклад, повинні використовувати слабкі посилання для своїх батьківських і братських посилань (якщо вони їм потрібні!).

source: How do I get a list of all instances of a given class?
uk: Як отримати список усіх екземплярів певного класу?

source: Python does not keep track of all instances of a class (or of a built-in type). You can program the class's constructor to keep track of all instances by keeping a list of weak references to each instance.
uk: Python не відстежує всі екземпляри класу (або вбудованого типу). Ви можете запрограмувати конструктор класу для відстеження всіх екземплярів, зберігаючи список слабких посилань на кожен екземпляр.

source: Why does the result of ``id()`` appear to be not unique?
uk: Чому результат ``id()`` здається не унікальним?

source: The :func:`id` builtin returns an integer that is guaranteed to be unique during the lifetime of the object. Since in CPython, this is the object's memory address, it happens frequently that after an object is deleted from memory, the next freshly created object is allocated at the same position in memory. This is illustrated by this example:
uk: Вбудований :func:`id` повертає ціле число, яке гарантовано буде унікальним протягом усього життя об’єкта. Оскільки в CPython це адреса пам’яті об’єкта, часто трапляється так, що після видалення об’єкта з пам’яті наступний щойно створений об’єкт розміщується в тій же позиції в пам’яті. Це проілюстровано таким прикладом:

source: The two ids belong to different integer objects that are created before, and deleted immediately after execution of the ``id()`` call. To be sure that objects whose id you want to examine are still alive, create another reference to the object:
uk: Два ідентифікатори належать до різних цілочисельних об’єктів, створених раніше та видалених одразу після виконання виклику ``id()``. Щоб переконатися, що об’єкти, чий ідентифікатор ви хочете перевірити, все ще живі, створіть інше посилання на об’єкт:

source: When can I rely on identity tests with the *is* operator?
uk: Коли я можу покладатися на перевірку ідентичності з оператором *is*?

source: The ``is`` operator tests for object identity. The test ``a is b`` is equivalent to ``id(a) == id(b)``.
uk: Оператор ``is`` перевіряє ідентичність об'єкта. Перевірка "a is b" еквівалентна "id(a) == id(b)".

source: The most important property of an identity test is that an object is always identical to itself, ``a is a`` always returns ``True``. Identity tests are usually faster than equality tests. And unlike equality tests, identity tests are guaranteed to return a boolean ``True`` or ``False``.
uk: Найважливіша властивість перевірки ідентичності полягає в тому, що об’єкт завжди ідентичний самому собі, ``a is a`` завжди повертає ``True``. Тести ідентифікації зазвичай швидші, ніж тести рівності. І на відміну від тестів на рівність, тести ідентичності гарантовано повертають логічне значення ``True`` або ``False``.

source: However, identity tests can *only* be substituted for equality tests when object identity is assured. Generally, there are three circumstances where identity is guaranteed:
uk: Однак тести на ідентичність можна *тільки* замінити на тести на рівність, якщо ідентичність об’єкта забезпечена. Загалом існує три обставини, за яких ідентичність гарантується:

source: 1) Assignments create new names but do not change object identity. After the assignment ``new = old``, it is guaranteed that ``new is old``.
uk: 1) Присвоєння створює нові імена, але не змінює ідентифікацію об’єкта. Після присвоєння ``нове = старе`` гарантується, що ``нове є старим``.

source: 2) Putting an object in a container that stores object references does not change object identity. After the list assignment ``s[0] = x``, it is guaranteed that ``s[0] is x``.
uk: 2) Поміщення об’єкта в контейнер, який зберігає посилання на об’єкти, не змінює ідентифікацію об’єкта. Після присвоєння списку ``s[0] = x`` гарантується, що ``s[0] є x``.

source: 3) If an object is a singleton, it means that only one instance of that object can exist. After the assignments ``a = None`` and ``b = None``, it is guaranteed that ``a is b`` because ``None`` is a singleton.
uk: 3) Якщо об’єкт є єдиним, це означає, що може існувати лише один екземпляр цього об’єкта. Після присвоєння ``a = None`` і ``b = None`` гарантується, що ``a є b``, оскільки ``None`` є єдиним елементом.

source: In most other circumstances, identity tests are inadvisable and equality tests are preferred. In particular, identity tests should not be used to check constants such as :class:`int` and :class:`str` which aren't guaranteed to be singletons::
uk: У більшості інших обставин тести на ідентичність є недоцільними, а тести на рівність є кращими. Зокрема, тести ідентичності не слід використовувати для перевірки таких констант, як :class:`int` і :class:`str`, які не гарантовано є одиночними:

source: Likewise, new instances of mutable containers are never identical::
uk: Подібним чином нові екземпляри змінних контейнерів ніколи не бувають ідентичними:

source: In the standard library code, you will see several common patterns for correctly using identity tests:
uk: У коді стандартної бібліотеки ви побачите кілька загальних шаблонів для правильного використання тестів ідентичності:

source: 1) As recommended by :pep:`8`, an identity test is the preferred way to check for ``None``. This reads like plain English in code and avoids confusion with other objects that may have boolean values that evaluate to false.
uk: 1) Відповідно до рекомендацій :pep:`8`, тест ідентичності є кращим способом перевірки ``None``. Це читається як звичайна англійська мова в коді та дозволяє уникнути плутанини з іншими об’єктами, які можуть мати логічні значення, які оцінюються як false.

source: 3) Container implementations sometimes need to augment equality tests with identity tests. This prevents the code from being confused by objects such as ``float('NaN')`` that are not equal to themselves.
uk: 3) Контейнерні реалізації іноді потребують доповнення тестів на рівність тестами ідентичності. Це запобігає заплутанню коду такими об’єктами, як ``float('NaN')``, які не дорівнюють собі.

source: How can a subclass control what data is stored in an immutable instance?
uk: Як підклас може контролювати, які дані зберігаються в незмінному екземплярі?

source: All of these immutable classes have a different signature than their parent class:
uk: Усі ці незмінні класи мають інший підпис, ніж їх батьківський клас:

source: The classes can be used like this:
uk: Класи можна використовувати так:

source: How do I cache method calls?
uk: Як кешувати виклики методів?

source: The two principal tools for caching methods are :func:`functools.cached_property` and :func:`functools.lru_cache`. The former stores results at the instance level and the latter at the class level.
uk: Двома основними інструментами для методів кешування є :func:`functools.cached_property` і :func:`functools.lru_cache`. Перший зберігає результати на рівні екземпляра, а другий — на рівні класу.

source: The *cached_property* approach only works with methods that do not take any arguments. It does not create a reference to the instance. The cached method result will be kept only as long as the instance is alive.
uk: Підхід *cached_property* працює лише з методами, які не приймають жодних аргументів. Він не створює посилання на екземпляр. Кешований результат методу зберігатиметься лише доти, доки екземпляр активний.

source: The advantage is that when an instance is no longer used, the cached method result will be released right away. The disadvantage is that if instances accumulate, so too will the accumulated method results. They can grow without bound.
uk: Перевагою є те, що коли екземпляр більше не використовується, кешований результат методу буде негайно опубліковано. Недоліком є те, що якщо екземпляри накопичуються, накопичений метод теж буде результатом. Вони можуть рости необмежено.

source: The advantage of the least recently used algorithm is that the cache is bounded by the specified *maxsize*. The disadvantage is that instances are kept alive until they age out of the cache or until the cache is cleared.
uk: Перевага найменш використовуваного алгоритму полягає в тому, що кеш обмежений указаним *maxsize*. Недоліком є те, що екземпляри залишаються активними, поки вони не вичерпаються з кешу або поки кеш не буде очищено.

source: This example shows the various techniques::
uk: Цей приклад демонструє різні техніки:

source: The above example assumes that the *station_id* never changes. If the relevant instance attributes are mutable, the *cached_property* approach can't be made to work because it cannot detect changes to the attributes.
uk: Наведений вище приклад передбачає, що *station_id* ніколи не змінюється. Якщо відповідні атрибути екземпляра є змінними, підхід *cached_property* не може працювати, оскільки він не може виявити зміни в атрибутах.

source: Modules
uk: Модулі

source: How do I create a .pyc file?
uk: Як створити файл .pyc?

source: When a module is imported for the first time (or when the source file has changed since the current compiled file was created) a ``.pyc`` file containing the compiled code should be created in a ``__pycache__`` subdirectory of the directory containing the ``.py`` file. The ``.pyc`` file will have a filename that starts with the same name as the ``.py`` file, and ends with ``.pyc``, with a middle component that depends on the particular ``python`` binary that created it. (See :pep:`3147` for details.)
uk: Коли модуль імпортується вперше (або якщо вихідний файл змінився після створення поточного скомпільованого файлу), файл ``.pyc``, що містить скомпільований код, має бути створений у підкаталозі ``__pycache__`` каталог, що містить файл ``.py``. Файл ``.pyc`` матиме назву файлу, яка починається з тієї самої назви, що й файл ``.py``, і закінчується ``.pyc``, із середнім компонентом, який залежить від конкретного ``python`` двійковий файл, який його створив. (Докладніше див. :pep:`3147`.)

source: One reason that a ``.pyc`` file may not be created is a permissions problem with the directory containing the source file, meaning that the ``__pycache__`` subdirectory cannot be created. This can happen, for example, if you develop as one user but run as another, such as if you are testing with a web server.
uk: Однією з причин того, що файл ``.pyc`` може не бути створений, є проблема з дозволами для каталогу, що містить вихідний файл, тобто неможливо створити підкаталог ``__pycache__``. Це може статися, наприклад, якщо ви розробляєте як один користувач, але запускаєте як інший, наприклад, якщо ви тестуєте за допомогою веб-сервера.

source: Unless the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable is set, creation of a .pyc file is automatic if you're importing a module and Python has the ability (permissions, free space, etc...) to create a ``__pycache__`` subdirectory and write the compiled module to that subdirectory.
uk: Якщо не встановлено змінну середовища :envvar:`PYTHONDONTWRITEBYTECODE`, створення файлу .pyc відбувається автоматично, якщо ви імпортуєте модуль і Python має можливість (дозволи, вільне місце тощо) створити ``__pycache__`` підкаталог і записати скомпільований модуль у цей підкаталог.

source: Running Python on a top level script is not considered an import and no ``.pyc`` will be created. For example, if you have a top-level module ``foo.py`` that imports another module ``xyz.py``, when you run ``foo`` (by typing ``python foo.py`` as a shell command), a ``.pyc`` will be created for ``xyz`` because ``xyz`` is imported, but no ``.pyc`` file will be created for ``foo`` since ``foo.py`` isn't being imported.
uk: Запуск Python на сценарії верхнього рівня не вважається імпортом, і ``.pyc`` не буде створено. Наприклад, якщо у вас є модуль верхнього рівня ``foo.py``, який імпортує інший модуль ``xyz.py``, коли ви запускаєте ``foo`` (ввівши ``python foo.py`` як команду оболонки), для ``xyz`` буде створено ``.pyc``, оскільки ``xyz`` імпортовано, але файл ``.pyc`` не буде створено для ``foo``, оскільки ``foo.py`` не імпортується.

source: If you need to create a ``.pyc`` file for ``foo`` -- that is, to create a ``.pyc`` file for a module that is not imported -- you can, using the :mod:`py_compile` and :mod:`compileall` modules.
uk: Якщо вам потрібно створити файл ``.pyc`` для ``foo``, тобто створити файл ``.pyc`` для модуля, який не імпортується, ви можете, використовувати модулі :mod:`py_compile` і :mod:`compileall`.

source: The :mod:`py_compile` module can manually compile any module. One way is to use the ``compile()`` function in that module interactively::
uk: Модуль :mod:`py_compile` може вручну скомпілювати будь-який модуль. Одним із способів є використання функції ``compile()`` у цьому модулі в інтерактивному режимі:

source: This will write the ``.pyc`` to a ``__pycache__`` subdirectory in the same location as ``foo.py`` (or you can override that with the optional parameter ``cfile``).
uk: Це запише ``.pyc`` до підкаталогу ``__pycache__`` в тому самому місці, що ``foo.py`` (або ви можете змінити це за допомогою додаткового параметра ``cfile``).

source: You can also automatically compile all files in a directory or directories using the :mod:`compileall` module. You can do it from the shell prompt by running ``compileall.py`` and providing the path of a directory containing Python files to compile::
uk: Ви також можете автоматично скомпілювати всі файли в каталозі або каталогах за допомогою модуля :mod:`compileall`. Ви можете зробити це з підказки оболонки, запустивши ``compileall.py`` і вказавши шлях до каталогу, що містить файли Python для компіляції::

source: How do I find the current module name?
uk: Як знайти поточну назву модуля?

source: A module can find out its own module name by looking at the predefined global variable ``__name__``. If this has the value ``'__main__'``, the program is running as a script. Many modules that are usually used by importing them also provide a command-line interface or a self-test, and only execute this code after checking ``__name__``::
uk: Модуль може дізнатися власну назву модуля, дивлячись на попередньо визначену глобальну змінну ``__name__``. Якщо має значення ``'__main__``, програма виконується як сценарій. Багато модулів, які зазвичай використовуються шляхом їх імпорту, також забезпечують інтерфейс командного рядка або самоперевірку та виконують цей код лише після перевірки ``__name__``::

source: How can I have modules that mutually import each other?
uk: Як я можу мати модулі, які взаємно імпортують один одного?

source: Suppose you have the following modules:
uk: Припустимо, у вас є такі модулі:

source: The problem is that the interpreter will perform the following steps:
uk: Проблема полягає в тому, що перекладач виконуватиме наступні кроки:

source: main imports ``foo``
uk: основний імпорт ``foo``

source: Empty globals for ``foo`` are created
uk: Створюються порожні глобальні значення для ``foo``

source: ``foo`` is compiled and starts executing
uk: ``foo`` компілюється та починає виконуватися

source: ``foo`` imports ``bar``
uk: ``foo`` імпортує ``bar``

source: Empty globals for ``bar`` are created
uk: Створено порожні глобали для ``bar``

source: ``bar`` is compiled and starts executing
uk: ``bar`` компілюється та починає виконуватися

source: ``bar`` imports ``foo`` (which is a no-op since there already is a module named ``foo``)
uk: ``bar`` імпортує ``foo`` (що є безопераційним, оскільки вже існує модуль з назвою ``foo``)

source: The import mechanism tries to read ``foo_var`` from ``foo`` globals, to set ``bar.foo_var = foo.foo_var``
uk: Механізм імпорту намагається прочитати ``foo_var`` з ``foo`` глобальних, щоб встановити ``bar.foo_var = foo.foo_var``

source: The last step fails, because Python isn't done with interpreting ``foo`` yet and the global symbol dictionary for ``foo`` is still empty.
uk: Останній крок не вдається, оскільки Python ще не завершив інтерпретацію ``foo``, а глобальний словник символів для ``foo`` все ще порожній.

source: The same thing happens when you use ``import foo``, and then try to access ``foo.foo_var`` in global code.
uk: Те ж саме відбувається, коли ви використовуєте ``import foo``, а потім намагаєтесь отримати доступ ``foo.foo_var`` у глобальному коді.

source: There are (at least) three possible workarounds for this problem.
uk: Є (принаймні) три можливі способи вирішення цієї проблеми.

source: Guido van Rossum recommends avoiding all uses of ``from <module> import ...``, and placing all code inside functions. Initializations of global variables and class variables should use constants or built-in functions only. This means everything from an imported module is referenced as ``<module>.<name>``.
uk: Гвідо ван Россум рекомендує уникати будь-якого використання ``from <module> import ...`` і розміщувати весь код у функціях. Для ініціалізації глобальних змінних і змінних класу слід використовувати лише константи або вбудовані функції. Це означає, що все з імпортованого модуля посилається як ``<module> . <name>``.

source: Jim Roskind suggests performing steps in the following order in each module:
uk: Джим Роскінд пропонує виконувати кроки в такому порядку в кожному модулі:

source: exports (globals, functions, and classes that don't need imported base classes)
uk: експорт (глобальні елементи, функції та класи, яким не потрібні імпортовані базові класи)

source: ``import`` statements
uk: оператори ``імпорту``

source: active code (including globals that are initialized from imported values).
uk: активний код (включаючи глобальні значення, ініціалізовані з імпортованих значень).

source: Van Rossum doesn't like this approach much because the imports appear in a strange place, but it does work.
uk: Ван Россуму не дуже подобається такий підхід, оскільки імпорт з’являється в незнайомому місці, але він працює.

source: Matthias Urlichs recommends restructuring your code so that the recursive import is not necessary in the first place.
uk: Матіас Урліхс рекомендує реструктуризувати ваш код, щоб рекурсивний імпорт не був необхідним.

source: These solutions are not mutually exclusive.
uk: Ці рішення не є взаємовиключними.

source: __import__('x.y.z') returns <module 'x'>; how do I get z?
uk: __import__('x.y.z') повертає <module 'x'> ; як я можу отримати z?

source: Consider using the convenience function :func:`~importlib.import_module` from :mod:`importlib` instead::
uk: Замість цього можна скористатися зручною функцією :func:`~importlib.import_module` з :mod:`importlib`::

source: When I edit an imported module and reimport it, the changes don't show up. Why does this happen?
uk: Коли я редагую імпортований модуль і повторно імпортую його, зміни не відображаються. чому це відбувається

source: For reasons of efficiency as well as consistency, Python only reads the module file on the first time a module is imported. If it didn't, in a program consisting of many modules where each one imports the same basic module, the basic module would be parsed and re-parsed many times. To force re-reading of a changed module, do this::
uk: З міркувань ефективності та узгодженості Python читає файл модуля лише під час першого імпорту модуля. Якби цього не було, у програмі, що складається з багатьох модулів, кожен з яких імпортує той самий базовий модуль, базовий модуль аналізувався б і повторно аналізувався багато разів. Щоб примусово перечитати змінений модуль, виконайте наступне:

source: Warning: this technique is not 100% fool-proof. In particular, modules containing statements like ::
uk: Попередження: ця техніка не є на 100% надійною. Зокрема, модулі, що містять оператори типу ::

source: will continue to work with the old version of the imported objects. If the module contains class definitions, existing class instances will *not* be updated to use the new class definition. This can result in the following paradoxical behaviour::
uk: продовжить працювати зі старою версією імпортованих об'єктів. Якщо модуль містить визначення класу, існуючі екземпляри класу *не* будуть оновлені для використання нового визначення класу. Це може призвести до наступної парадоксальної поведінки:

source: The nature of the problem is made clear if you print out the "identity" of the class objects::
uk: Природа проблеми стане зрозумілою, якщо ви роздрукуєте "ідентичність" об’єктів класу:

source: argument
uk: аргумент

source: parameter
uk: параметр
