Repository: python/python-docs-uk
Catalog: faq/windows.po
Languages: uk

source: Python on Windows FAQ
uk: Поширені запитання про Python у Windows

source: Contents
uk: Зміст

source: How do I run a Python program under Windows?
uk: Як запустити програму Python під Windows?

source: This is not necessarily a straightforward question. If you are already familiar with running programs from the Windows command line then everything will seem obvious; otherwise, you might need a little more guidance.
uk: Це не обов’язково однозначне запитання. Якщо ви вже знайомі із запуском програм із командного рядка Windows, то все буде здаватися очевидним; інакше вам може знадобитися трохи більше вказівок.

source: Unless you use some sort of integrated development environment, you will end up *typing* Windows commands into what is referred to as a "Command prompt window". Usually you can create such a window from your search bar by searching for ``cmd``. You should be able to recognize when you have started such a window because you will see a Windows "command prompt", which usually looks like this:
uk: Якщо ви не використовуєте якесь інтегроване середовище розробки, вам доведеться *вводити* команди Windows у так зване "вікно командного рядка". Зазвичай ви можете створити таке вікно з панелі пошуку, виконавши пошук за ``cmd``. Ви повинні мати змогу розпізнати, коли ви запустили таке вікно, оскільки ви побачите "командний рядок" Windows, який зазвичай виглядає так:

source: The letter may be different, and there might be other things after it, so you might just as easily see something like:
uk: Літера може бути іншою, і після неї можуть бути інші речі, тому ви можете так само легко побачити щось на зразок:

source: depending on how your computer has been set up and what else you have recently done with it. Once you have started such a window, you are well on the way to running Python programs.
uk: залежно від того, як налаштовано ваш комп’ютер і що ще ви нещодавно з ним робили. Як тільки ви запустили таке вікно, ви вже на шляху до запуску програм Python.

source: You need to realize that your Python scripts have to be processed by another program called the Python *interpreter*. The interpreter reads your script, compiles it into bytecodes, and then executes the bytecodes to run your program. So, how do you arrange for the interpreter to handle your Python?
uk: Ви повинні усвідомити, що ваші сценарії Python мають оброблятися іншою програмою під назвою *інтерпретатор* Python. Інтерпретатор читає ваш сценарій, компілює його в байт-коди, а потім виконує байт-коди для запуску вашої програми. Отже, як організувати роботу інтерпретатора з вашим Python?

source: First, you need to make sure that your command window recognises the word "py" as an instruction to start the interpreter. If you have opened a command window, you should try entering the command ``py`` and hitting return:
uk: По-перше, вам потрібно переконатися, що ваше командне вікно розпізнає слово "py" як інструкцію для запуску інтерпретатора. Якщо ви відкрили командне вікно, спробуйте ввести команду ``py`` і натиснути клавішу return:

source: You should then see something like:
uk: Тоді ви повинні побачити щось на зразок:

source: You have started the interpreter in "interactive mode". That means you can enter Python statements or expressions interactively and have them executed or evaluated while you wait. This is one of Python's strongest features. Check it by entering a few expressions of your choice and seeing the results:
uk: Ви запустили перекладач в "інтерактивному режимі". Це означає, що ви можете інтерактивно вводити оператори або вирази Python і виконувати їх чи оцінювати, поки ви чекаєте. Це одна з найсильніших можливостей Python. Перевірте це, ввівши кілька виразів на ваш вибір і переглянувши результати:

source: Many people use the interactive mode as a convenient yet highly programmable calculator. When you want to end your interactive Python session, call the :func:`exit` function or hold the :kbd:`Ctrl` key down while you enter a :kbd:`Z`, then hit the ":kbd:`Enter`" key to get back to your Windows command prompt.
uk: Багато людей використовують інтерактивний режим як зручний, але добре програмований калькулятор. Якщо ви хочете завершити свій інтерактивний сеанс Python, викличте функцію :func:`exit` або утримуйте клавішу :kbd:`Ctrl`, вводячи :kbd:`Z`, а потім натисніть ":kbd:`Enter`", щоб повернутися до командного рядка Windows.

source: You may also find that you have a Start-menu entry such as :menuselection:`Start --> Programs --> Python 3.x --> Python (command line)` that results in you seeing the ``>>>`` prompt in a new window. If so, the window will disappear after you call the :func:`exit` function or enter the :kbd:`Ctrl-Z` character; Windows is running a single "python" command in the window, and closes it when you terminate the interpreter.
uk: Ви також можете виявити, що у вас є пункт меню "Пуск", наприклад :menuselection:`Пуск --> Програми --> Python 3.x --> Python (командний рядок)`, який призводить до того, що ви бачите ``>>>`` у новому вікні. Якщо так, вікно зникне після виклику функції :func:`exit` або введення символу :kbd:`Ctrl-Z`; Windows виконує одну команду "python" у вікні та закриває її, коли ви завершуєте роботу інтерпретатора.

source: Now that we know the ``py`` command is recognized, you can give your Python script to it. You'll have to give either an absolute or a relative path to the Python script. Let's say your Python script is located in your desktop and is named ``hello.py``, and your command prompt is nicely opened in your home directory so you're seeing something similar to::
uk: Тепер, коли ми знаємо, що команда ``py`` розпізнається, ви можете надати їй свій сценарій Python. Вам потрібно буде вказати або абсолютний, або відносний шлях до сценарію Python. Припустімо, що ваш сценарій Python розташований на робочому столі та має назву ``hello.py``, а ваш командний рядок добре відкрито у вашому домашньому каталозі, тому ви бачите щось подібне до:

source: So now you'll ask the ``py`` command to give your script to Python by typing ``py`` followed by your script path::
uk: Отже, тепер ви попросите команду ``py`` передати ваш сценарій Python, ввівши ``py``, а потім шлях до вашого сценарію::

source: How do I make Python scripts executable?
uk: Як зробити сценарії Python виконуваними?

source: On Windows, the standard Python installer already associates the .py extension with a file type (Python.File) and gives that file type an open command that runs the interpreter (``D:\Program Files\Python\python.exe "%1" %*``). This is enough to make scripts executable from the command prompt as 'foo.py'. If you'd rather be able to execute the script by simple typing 'foo' with no extension you need to add .py to the PATHEXT environment variable.
uk: У Windows стандартний інсталятор Python уже пов’язує розширення .py з типом файлу (Python.File) і дає цьому типу файлу команду відкриття, яка запускає інтерпретатор (``D:\Program Files\Python\python.exe "% 1" %*``). Цього достатньо, щоб зробити скрипти виконуваними з командного рядка як "foo.py". Якщо ви бажаєте виконати сценарій, просто ввівши 'foo' без розширення, вам потрібно додати .py до змінної середовища PATHEXT.

source: Why does Python sometimes take so long to start?
uk: Чому іноді Python запускається так довго?

source: Usually Python starts very quickly on Windows, but occasionally there are bug reports that Python suddenly begins to take a long time to start up. This is made even more puzzling because Python will work fine on other Windows systems which appear to be configured identically.
uk: Зазвичай Python запускається дуже швидко в Windows, але іноді з’являються повідомлення про помилки, коли Python раптово починає займати багато часу для запуску. Це стає ще більш загадковим, оскільки Python добре працюватиме на інших системах Windows, які, здається, налаштовані однаково.

source: The problem may be caused by a misconfiguration of virus checking software on the problem machine. Some virus scanners have been known to introduce startup overhead of two orders of magnitude when the scanner is configured to monitor all reads from the filesystem. Try checking the configuration of virus scanning software on your systems to ensure that they are indeed configured identically. McAfee, when configured to scan all file system read activity, is a particular offender.
uk: Проблема може бути викликана неправильною конфігурацією програмного забезпечення перевірки вірусів на проблемній машині. Відомо, що деякі сканери вірусів створюють накладні витрати на запуск у два порядки величини, коли сканер налаштовано на моніторинг усіх зчитувань із файлової системи. Спробуйте перевірити конфігурацію програмного забезпечення для сканування вірусів у своїх системах, щоб переконатися, що вони справді налаштовані однаково. McAfee, налаштований на сканування всіх операцій читання файлової системи, є особливим порушником.

source: How do I make an executable from a Python script?
uk: Як створити виконуваний файл із сценарію Python?

source: See :ref:`faq-create-standalone-binary` for a list of tools that can be used to make executables.
uk: Перегляньте :ref:`faq-create-standalone-binary` список інструментів, які можна використовувати для створення виконуваних файлів.

source: Is a ``*.pyd`` file the same as a DLL?
uk: Чи файл ``*.pyd`` те саме, що DLL?

source: Yes, .pyd files are dll's, but there are a few differences. If you have a DLL named ``foo.pyd``, then it must have a function ``PyInit_foo()``. You can then write Python "import foo", and Python will search for foo.pyd (as well as foo.py, foo.pyc) and if it finds it, will attempt to call ``PyInit_foo()`` to initialize it. You do not link your .exe with foo.lib, as that would cause Windows to require the DLL to be present.
uk: Так, файли .pyd є dll, але є кілька відмінностей. Якщо у вас є DLL з назвою ``foo.pyd``, тоді вона повинна мати функцію ``PyInit_foo()``. Потім ви можете написати Python "import foo", і Python шукатиме foo.pyd (а також foo.py, foo.pyc) і, якщо знайде його, спробує викликати ``PyInit_foo()``, щоб ініціалізувати його . Ви не пов’язуєте свій .exe з foo.lib, оскільки це змусить Windows вимагати наявності DLL.

source: Note that the search path for foo.pyd is PYTHONPATH, not the same as the path that Windows uses to search for foo.dll. Also, foo.pyd need not be present to run your program, whereas if you linked your program with a dll, the dll is required. Of course, foo.pyd is required if you want to say ``import foo``. In a DLL, linkage is declared in the source code with ``__declspec(dllexport)``. In a .pyd, linkage is defined in a list of available functions.
uk: Зауважте, що шлях пошуку для foo.pyd — це PYTHONPATH, а не шлях, який Windows використовує для пошуку foo.dll. Крім того, foo.pyd не обов’язково присутній для запуску вашої програми, тоді як якщо ви пов’язали свою програму з dll, dll потрібна. Звичайно, foo.pyd потрібен, якщо ви хочете сказати ``import foo``. У DLL зв’язок оголошується у вихідному коді за допомогою ``__declspec(dllexport)``. У .pyd зв’язок визначається у списку доступних функцій.

source: How can I embed Python into a Windows application?
uk: Як я можу вставити Python у програму Windows?

source: Embedding the Python interpreter in a Windows app can be summarized as follows:
uk: Вбудовування інтерпретатора Python у програму Windows можна підсумувати таким чином:

source: You can link to Python in two different ways. Load-time linking means linking against :file:`python{NN}.lib`, while run-time linking means linking against :file:`python{NN}.dll`. (General note: :file:`python{NN}.lib` is the so-called "import lib" corresponding to :file:`python{NN}.dll`. It merely defines symbols for the linker.)
uk: Ви можете зв’язатися з Python двома різними способами. Зв’язування під час завантаження означає зв’язування з :file:`python{NN}.lib`, тоді як зв’язування під час виконання означає зв’язування з :file:`python{NN}.dll`. (Загальна примітка: :file:`python{NN}.lib` — це так звана "імпортована бібліотека", яка відповідає :file:`python{NN}.dll`. Вона лише визначає символи для компонувальника.)

source: Run-time linking greatly simplifies link options; everything happens at run time. Your code must load :file:`python{NN}.dll` using the Windows ``LoadLibraryEx()`` routine. The code must also use access routines and data in :file:`python{NN}.dll` (that is, Python's C API's) using pointers obtained by the Windows ``GetProcAddress()`` routine. Macros can make using these pointers transparent to any C code that calls routines in Python's C API.
uk: Зв’язування під час виконання значно спрощує параметри зв’язування; все відбувається під час виконання. Ваш код має завантажити :file:`python{NN}.dll` за допомогою процедури Windows ``LoadLibraryEx()``. Код також має використовувати підпрограми доступу та дані в :file:`python{NN}.dll` (тобто C API Python), використовуючи покажчики, отримані підпрограмою ``GetProcAddress()`` Windows. Макроси можуть зробити використання цих покажчиків прозорим для будь-якого коду C, який викликає підпрограми в C API Python.

source: SWIG will create an init function (a C function) whose name depends on the name of the extension module. For example, if the name of the module is leo, the init function will be called initleo(). If you use SWIG shadow classes, as you should, the init function will be called initleoc(). This initializes a mostly hidden helper class used by the shadow class.
uk: SWIG створить функцію ініціалізації (функцію C), назва якої залежить від назви модуля розширення. Наприклад, якщо назва модуля leo, функція init буде називатися initleo(). Якщо ви використовуєте тіньові класи SWIG, як і має бути, функція init називатиметься initleoc(). Це ініціалізує здебільшого прихований допоміжний клас, який використовується тіньовим класом.

source: The reason you can link the C code in step 2 into your .exe file is that calling the initialization function is equivalent to importing the module into Python! (This is the second key undocumented fact.)
uk: Причина, по якій ви можете пов’язати код C на кроці 2 у свій файл .exe, полягає в тому, що виклик функції ініціалізації еквівалентний імпорту модуля в Python! (Це другий ключовий незадокументований факт.)

source: In short, you can use the following code to initialize the Python interpreter with your extension module.
uk: Коротше кажучи, ви можете використовувати наступний код для ініціалізації інтерпретатора Python за допомогою вашого модуля розширення.

source: There are two problems with Python's C API which will become apparent if you use a compiler other than MSVC, the compiler used to build pythonNN.dll.
uk: Є дві проблеми з C API Python, які стануть очевидними, якщо ви використовуєте компілятор, відмінний від MSVC, компілятора, який використовується для створення pythonNN.dll.

source: Problem 2: SWIG generates the following code when generating wrappers to void functions:
uk: Проблема 2: SWIG генерує такий код під час генерації обгорток для функцій void:

source: Alas, Py_None is a macro that expands to a reference to a complex data structure called _Py_NoneStruct inside pythonNN.dll. Again, this code will fail in a mult-compiler environment. Replace such code by:
uk: На жаль, Py_None — це макрос, який розширюється до посилання на складну структуру даних під назвою _Py_NoneStruct усередині pythonNN.dll. Знову ж таки, цей код не працюватиме в середовищі з декількома компіляторами. Замініть такий код на:

source: It may be possible to use SWIG's ``%typemap`` command to make the change automatically, though I have not been able to get this to work (I'm a complete SWIG newbie).
uk: Можливо, можна використати команду ``%typemap`` SWIG, щоб внести зміни автоматично, хоча мені не вдалося змусити це працювати (я абсолютно новачок у SWIG).

source: Using a Python shell script to put up a Python interpreter window from inside your Windows app is not a good idea; the resulting window will be independent of your app's windowing system. Rather, you (or the wxPythonWindow class) should create a "native" interpreter window. It is easy to connect that window to the Python interpreter. You can redirect Python's i/o to _any_ object that supports read and write, so all you need is a Python object (defined in your extension module) that contains read() and write() methods.
uk: Використання сценарію оболонки Python для розміщення вікна інтерпретатора Python із програми Windows не є гарною ідеєю; отримане вікно не залежатиме від віконної системи вашої програми. Швидше, ви (або клас wxPythonWindow) повинні створити "власне" вікно інтерпретатора. Це вікно легко підключити до інтерпретатора Python. Ви можете перенаправити введення/виведення Python до будь-якого об'єкта, який підтримує читання та запис, тому все, що вам потрібно, це об’єкт Python (визначений у вашому модулі розширення), який містить методи read() і write().

source: How do I keep editors from inserting tabs into my Python source?
uk: Як заборонити редакторам вставляти вкладки в мій джерело Python?

source: The FAQ does not recommend using tabs, and the Python style guide, :pep:`8`, recommends 4 spaces for distributed Python code; this is also the Emacs python-mode default.
uk: FAQ не рекомендує використовувати вкладки, а посібник зі стилю Python, :pep:`8`, рекомендує 4 пробіли для розподіленого коду Python; це також стандартний режим Emacs python.

source: Under any editor, mixing tabs and spaces is a bad idea. MSVC is no different in this respect, and is easily configured to use spaces: Take :menuselection:`Tools --> Options --> Tabs`, and for file type "Default" set "Tab size" and "Indent size" to 4, and select the "Insert spaces" radio button.
uk: У будь-якому редакторі змішувати табуляції та пробіли – погана ідея. MSVC нічим не відрізняється в цьому відношенні, і його легко налаштувати для використання пробілів: візьміть :menuselection:`Інструменти --> Параметри --> Вкладки`, а для типу файлу "За замовчуванням" встановіть "Розмір вкладки" та "Розмір відступу" на 4 і виберіть перемикач "Вставити пробіли".

source: Python raises :exc:`IndentationError` or :exc:`TabError` if mixed tabs and spaces are causing problems in leading whitespace. You may also run the :mod:`tabnanny` module to check a directory tree in batch mode.
uk: Python викликає :exc:`IndentationError` або :exc:`TabError`, якщо змішані символи табуляції та пробіли спричиняють проблеми на початку пробілу. Ви також можете запустити модуль :mod:`tabnanny`, щоб перевірити дерево каталогів у пакетному режимі.

source: How do I check for a keypress without blocking?
uk: Як перевірити натискання клавіш без блокування?

source: Use the :mod:`msvcrt` module. This is a standard Windows-specific extension module. It defines a function ``kbhit()`` which checks whether a keyboard hit is present, and ``getch()`` which gets one character without echoing it.
uk: Використовуйте модуль :mod:`msvcrt`. Це стандартний модуль розширення для Windows. Він визначає функцію ``kbhit()``, яка перевіряє наявність натискання клавіатури, і ``getch()``, яка отримує один символ, не повторюючи його.
