Repository: python/python-docs-uk
Catalog: whatsnew/2.0.po
Languages: uk

source: Vladimir Marangozov's long-awaited malloc restructuring was completed, to make it easy to have the Python interpreter use a custom allocator instead of C's standard :func:`malloc`. For documentation, read the comments in :file:`Include/pymem.h` and :file:`Include/objimpl.h`. For the lengthy discussions during which the interface was hammered out, see the web archives of the 'patches' and 'python-dev' lists at python.org.
uk: Довгоочікувана реструктуризація malloc Володимира Марангозова була завершена, щоб полегшити використання інтерпретатором Python спеціального розподілювача замість стандартного C :func:`malloc`. Для документації прочитайте коментарі в :file:`Include/pymem.h` і :file:`Include/objimpl.h`. Щоб дізнатися про довгі дискусії, під час яких вироблявся інтерфейс, перегляньте веб-архіви списків "патчів" і "python-dev" на python.org.

source: Recent versions of the GUSI development environment for MacOS support POSIX threads. Therefore, Python's POSIX threading support now works on the Macintosh. Threading support using the user-space GNU ``pth`` library was also contributed.
uk: Останні версії середовища розробки GUSI для MacOS підтримують потоки POSIX. Таким чином, підтримка потоків Python POSIX тепер працює на Macintosh. Також була надана підтримка потоків за допомогою бібліотеки GNU ``pth`` у просторі користувача.

source: Threading support on Windows was enhanced, too. Windows supports thread locks that use kernel objects only in case of contention; in the common case when there's no contention, they use simpler functions which are an order of magnitude faster. A threaded version of Python 1.5.2 on NT is twice as slow as an unthreaded version; with the 2.0 changes, the difference is only 10%. These improvements were contributed by Yakov Markovitch.
uk: Також покращено підтримку потоків у Windows. Windows підтримує блокування потоків, які використовують об’єкти ядра лише у випадку конфлікту; у звичайному випадку, коли немає суперечок, вони використовують простіші функції, які на порядок швидші. Потокова версія Python 1.5.2 на NT вдвічі повільніша за безпотокову версію; зі змінами 2.0 різниця становить лише 10%. Ці вдосконалення вніс Яків Маркович.

source: Python 2.0's source now uses only ANSI C prototypes, so compiling Python now requires an ANSI C compiler, and can no longer be done using a compiler that only supports K&R C.
uk: Вихідні коди Python 2.0 тепер використовують лише прототипи ANSI C, тому для компіляції Python тепер потрібен компілятор ANSI C, і його більше неможливо виконати за допомогою компілятора, який підтримує лише K&R C.

source: Previously the Python virtual machine used 16-bit numbers in its bytecode, limiting the size of source files. In particular, this affected the maximum size of literal lists and dictionaries in Python source; occasionally people who are generating Python code would run into this limit. A patch by Charles G. Waldman raises the limit from ``2**16`` to ``2**32``.
uk: Раніше віртуальна машина Python використовувала 16-бітні числа у своєму байт-коді, обмежуючи розмір вихідних файлів. Зокрема, це вплинуло на максимальний розмір списків літералів і словників у вихідних кодах Python; час від часу люди, які генерують код Python, стикаються з цим обмеженням. Патч від Charles G. Waldman підвищує ліміт з ``2**16`` до ``2**32``.

source: Three new convenience functions intended for adding constants to a module's dictionary at module initialization time were added: :func:`PyModule_AddObject`, :func:`PyModule_AddIntConstant`, and :func:`PyModule_AddStringConstant`. Each of these functions takes a module object, a null-terminated C string containing the name to be added, and a third argument for the value to be assigned to the name. This third argument is, respectively, a Python object, a C long, or a C string.
uk: Додано три нові зручні функції, призначені для додавання констант до словника модуля під час ініціалізації модуля: :func:`PyModule_AddObject`, :func:`PyModule_AddIntConstant` і :func:`PyModule_AddStringConstant`. Кожна з цих функцій приймає об’єкт модуля, рядок C із нульовим символом, що містить ім’я, яке потрібно додати, і третій аргумент для значення, яке буде присвоєно імені. Цей третій аргумент є, відповідно, об’єктом Python, довгим C або рядком C.

source: A wrapper API was added for Unix-style signal handlers. :func:`PyOS_getsig` gets a signal handler and :func:`PyOS_setsig` will set a new handler.
uk: Було додано API оболонки для обробників сигналів у стилі Unix. :func:`PyOS_getsig` отримує обробник сигналу, а :func:`PyOS_setsig` встановить новий обробник.

source: Distutils: Making Modules Easy to Install
uk: Distutils: полегшення встановлення модулів

source: Before Python 2.0, installing modules was a tedious affair -- there was no way to figure out automatically where Python is installed, or what compiler options to use for extension modules. Software authors had to go through an arduous ritual of editing Makefiles and configuration files, which only really work on Unix and leave Windows and MacOS unsupported. Python users faced wildly differing installation instructions which varied between different extension packages, which made administering a Python installation something of a chore.
uk: До Python 2.0 встановлення модулів було нудною справою — не було можливості автоматично визначити, де встановлено Python, або які параметри компілятора використовувати для модулів розширення. Авторам програмного забезпечення довелося пройти через важкий ритуал редагування файлів Makefile та конфігураційних файлів, які справді працюють лише в Unix, а Windows і MacOS не підтримуються. Користувачі Python зіткнулися з надзвичайно різними інструкціями встановлення, які відрізнялися між різними пакетами розширень, що робило адміністрування встановлення Python чимось на зразок клопітку.

source: The SIG for distribution utilities, shepherded by Greg Ward, has created the Distutils, a system to make package installation much easier. They form the :mod:`distutils` package, a new part of Python's standard library. In the best case, installing a Python module from source will require the same steps: first you simply mean unpack the tarball or zip archive, and the run "``python setup.py install``". The platform will be automatically detected, the compiler will be recognized, C extension modules will be compiled, and the distribution installed into the proper directory. Optional command-line arguments provide more control over the installation process, the distutils package offers many places to override defaults -- separating the build from the install, building or installing in non-default directories, and more.
uk: SIG для розповсюджувальних утиліт, очолюваний Грегом Уордом, створив Distutils, систему, яка значно полегшує встановлення пакетів. Вони утворюють пакет :mod:`distutils`, нову частину стандартної бібліотеки Python. У найкращому випадку інсталяція модуля Python із вихідного коду вимагатиме тих самих кроків: спочатку ви просто маєте на увазі розпакування архіву tarball або zip і запустіть "``python setup.py install``". Платформа буде автоматично визначена, компілятор буде розпізнано, модулі розширення C будуть скомпільовані, а дистрибутив встановлено у відповідний каталог. Необов’язкові аргументи командного рядка забезпечують більше контролю над процесом інсталяції, пакет distutils пропонує багато місць для заміни значень за замовчуванням – відокремлення збірки від інсталяції, збірка або встановлення в каталогах, що не є типовими, тощо.

source: In order to use the Distutils, you need to write a :file:`setup.py` script. For the simple case, when the software contains only .py files, a minimal :file:`setup.py` can be just a few lines long::
uk: Щоб використовувати Distutils, вам потрібно написати сценарій :file:`setup.py`. У простому випадку, коли програмне забезпечення містить лише файли .py, мінімальний файл :file:`setup.py` може складатися лише з кількох рядків::

source: The :file:`setup.py` file isn't much more complicated if the software consists of a few packages::
uk: Файл :file:`setup.py` не є набагато складнішим, якщо програмне забезпечення складається з кількох пакетів::

source: A C extension can be the most complicated case; here's an example taken from the PyXML package::
uk: Розширення C може бути найскладнішим випадком; ось приклад, взятий з пакета PyXML::

source: The Distutils can also take care of creating source and binary distributions. The "sdist" command, run by "``python setup.py sdist``', builds a source distribution such as :file:`foo-1.0.tar.gz`. Adding new commands isn't difficult, "bdist_rpm" and "bdist_wininst" commands have already been contributed to create an RPM distribution and a Windows installer for the software, respectively. Commands to create other distribution formats such as Debian packages and Solaris :file:`.pkg` files are in various stages of development.
uk: Distutils також може подбати про створення вихідних і двійкових дистрибутивів. Команда "sdist", яку запускає "`` python setup.py sdist``", створює вихідний дистрибутив, такий як :file:`foo-1.0.tar.gz`. Додавати нові команди не складно, "bdist_rpm" Команди "bdist_wininst" і "bdist_wininst" вже були використані для створення дистрибутива RPM і інсталятора Windows для програмного забезпечення відповідно. .

source: All this is documented in a new manual, *Distributing Python Modules*, that joins the basic set of Python documentation.
uk: Усе це задокументовано в новому посібнику *Розповсюдження модулів Python*, який доповнює базовий набір документації Python.

source: XML Modules
uk: Модулі XML

source: Python 1.5.2 included a simple XML parser in the form of the :mod:`xmllib` module, contributed by Sjoerd Mullender. Since 1.5.2's release, two different interfaces for processing XML have become common: SAX2 (version 2 of the Simple API for XML) provides an event-driven interface with some similarities to :mod:`xmllib`, and the DOM (Document Object Model) provides a tree-based interface, transforming an XML document into a tree of nodes that can be traversed and modified. Python 2.0 includes a SAX2 interface and a stripped-down DOM interface as part of the :mod:`xml` package. Here we will give a brief overview of these new interfaces; consult the Python documentation or the source code for complete details. The Python XML SIG is also working on improved documentation.
uk: Python 1.5.2 містив простий аналізатор XML у формі модуля :mod:`xmllib`, наданого Sjoerd Mullender. Починаючи з випуску 1.5.2, два різні інтерфейси для обробки XML стали поширеними: SAX2 (версія 2 Simple API для XML) надає інтерфейс, керований подіями, дещо подібний до :mod:`xmllib`, і DOM (об’єкт документа). Model) надає інтерфейс на основі дерева, перетворюючи XML-документ на дерево вузлів, які можна переглядати та змінювати. Python 2.0 містить інтерфейс SAX2 і скорочений інтерфейс DOM як частину пакета :mod:`xml`. Тут ми дамо короткий огляд цих нових інтерфейсів; зверніться до документації Python або вихідного коду для отримання повної інформації. Python XML SIG також працює над покращенням документації.

source: SAX2 Support
uk: Підтримка SAX2

source: SAX defines an event-driven interface for parsing XML. To use SAX, you must write a SAX handler class. Handler classes inherit from various classes provided by SAX, and override various methods that will then be called by the XML parser. For example, the :meth:`startElement` and :meth:`endElement` methods are called for every starting and end tag encountered by the parser, the :meth:`characters` method is called for every chunk of character data, and so forth.
uk: SAX визначає керований подіями інтерфейс для аналізу XML. Щоб використовувати SAX, ви повинні написати клас обробника SAX. Класи обробників успадковуються від різних класів, наданих SAX, і перевизначають різні методи, які потім будуть викликані аналізатором XML. Наприклад, методи :meth:`startElement` і :meth:`endElement` викликаються для кожного початкового та кінцевого тегів, які зустрічає аналізатор, метод :meth:`characters` викликається для кожної частини символьних даних, і тому вперед.

source: The advantage of the event-driven approach is that the whole document doesn't have to be resident in memory at any one time, which matters if you are processing really huge documents. However, writing the SAX handler class can get very complicated if you're trying to modify the document structure in some elaborate way.
uk: Перевага керованого подіями підходу полягає в тому, що весь документ не повинен постійно зберігатися в пам’яті в будь-який момент часу, що має значення, якщо ви обробляєте дійсно великі документи. Однак написання класу обробника SAX може стати дуже складним, якщо ви намагаєтесь модифікувати структуру документа якимось складним чином.

source: For example, this little example program defines a handler that prints a message for every starting and ending tag, and then parses the file :file:`hamlet.xml` using it::
uk: Наприклад, цей маленький приклад програми визначає обробник, який друкує повідомлення для кожного початкового та кінцевого тегу, а потім аналізує файл :file:`hamlet.xml`, використовуючи його:

source: For more information, consult the Python documentation, or the XML HOWTO at http://pyxml.sourceforge.net/topics/howto/xml-howto.html.
uk: Для отримання додаткової інформації зверніться до документації Python або XML HOWTO на http://pyxml.sourceforge.net/topics/howto/xml-howto.html.

source: DOM Support
uk: Підтримка DOM

source: The Document Object Model is a tree-based representation for an XML document. A top-level :class:`Document` instance is the root of the tree, and has a single child which is the top-level :class:`Element` instance. This :class:`Element` has children nodes representing character data and any sub-elements, which may have further children of their own, and so forth. Using the DOM you can traverse the resulting tree any way you like, access element and attribute values, insert and delete nodes, and convert the tree back into XML.
uk: Об’єктна модель документа – це деревовидне представлення документа XML. Екземпляр :class:`Document` верхнього рівня є коренем дерева та має єдину дочірню примірник :class:`Element` верхнього рівня. Цей :class:`Element` має дочірні вузли, що представляють символьні дані та будь-які піделементи, які можуть мати інших власних дочірніх елементів тощо. Використовуючи DOM, ви можете переглядати отримане дерево будь-яким способом, отримувати доступ до значень елементів і атрибутів, вставляти та видаляти вузли та перетворювати дерево назад у XML.

source: The DOM is useful for modifying XML documents, because you can create a DOM tree, modify it by adding new nodes or rearranging subtrees, and then produce a new XML document as output. You can also construct a DOM tree manually and convert it to XML, which can be a more flexible way of producing XML output than simply writing ``<tag1>``...\ ``</tag1>`` to a file.
uk: DOM корисний для модифікації XML-документів, оскільки ви можете створити дерево DOM, змінити його, додавши нові вузли або перевпорядкувавши піддерева, а потім створити новий XML-документ як результат. Ви також можете побудувати дерево DOM вручну та перетворити його на XML, що може бути більш гнучким способом створення виводу XML, ніж просто запис ``<tag1>``...\ ``</tag1>`` у файл.

source: The DOM implementation included with Python lives in the :mod:`xml.dom.minidom` module. It's a lightweight implementation of the Level 1 DOM with support for XML namespaces. The :func:`parse` and :func:`parseString` convenience functions are provided for generating a DOM tree::
uk: Реалізація DOM, включена в Python, знаходиться в модулі :mod:`xml.dom.minidom`. Це спрощена реалізація DOM рівня 1 із підтримкою просторів імен XML. Зручні функції :func:`parse` і :func:`parseString` надаються для створення дерева DOM::

source: ``doc`` is a :class:`Document` instance. :class:`Document`, like all the other DOM classes such as :class:`Element` and :class:`Text`, is a subclass of the :class:`Node` base class. All the nodes in a DOM tree therefore support certain common methods, such as :meth:`toxml` which returns a string containing the XML representation of the node and its children. Each class also has special methods of its own; for example, :class:`Element` and :class:`Document` instances have a method to find all child elements with a given tag name. Continuing from the previous 2-line example::
uk: ``doc`` є екземпляром :class:`Document`. :class:`Document`, як і всі інші класи DOM, такі як :class:`Element` і :class:`Text`, є підкласом базового класу :class:`Node`. Тому всі вузли в дереві DOM підтримують певні загальні методи, такі як :meth:`toxml`, який повертає рядок, що містить XML-представлення вузла та його дочірніх елементів. Кожен клас також має власні спеціальні методи; наприклад, екземпляри :class:`Element` і :class:`Document` мають метод пошуку всіх дочірніх елементів із вказаною назвою тегу. Продовжуючи попередній 2-рядковий приклад::

source: For the *Hamlet* XML file, the above few lines output::
uk: Для XML-файлу *Hamlet* наведені вище кілька рядків виводять::

source: The root element of the document is available as ``doc.documentElement``, and its children can be easily modified by deleting, adding, or removing nodes::
uk: Кореневий елемент документа доступний як ``doc.documentElement``, і його дочірні елементи можна легко змінити шляхом видалення, додавання або вилучення вузлів:

source: Again, I will refer you to the Python documentation for a complete listing of the different :class:`Node` classes and their various methods.
uk: Знову ж таки, я відсилаю вас до документації Python, щоб отримати повний перелік різних класів :class:`Node` та їхніх різних методів.

source: Relationship to PyXML
uk: Відношення до PyXML

source: The XML Special Interest Group has been working on XML-related Python code for a while. Its code distribution, called PyXML, is available from the SIG's web pages at https://www.python.org/community/sigs/current/xml-sig. The PyXML distribution also used the package name ``xml``. If you've written programs that used PyXML, you're probably wondering about its compatibility with the 2.0 :mod:`xml` package.
uk: Група спеціальних інтересів XML деякий час працювала над кодом Python, пов’язаним із XML. Його розповсюдження коду під назвою PyXML доступне на веб-сторінках SIG за адресою https://www.python.org/community/sigs/current/xml-sig. Дистрибутив PyXML також використовував назву пакета ``xml``. Якщо ви писали програми, які використовували PyXML, ви, ймовірно, цікавитеся його сумісністю з пакетом 2.0 :mod:`xml`.

source: The answer is that Python 2.0's :mod:`xml` package isn't compatible with PyXML, but can be made compatible by installing a recent version PyXML. Many applications can get by with the XML support that is included with Python 2.0, but more complicated applications will require that the full PyXML package will be installed. When installed, PyXML versions 0.6.0 or greater will replace the :mod:`xml` package shipped with Python, and will be a strict superset of the standard package, adding a bunch of additional features. Some of the additional features in PyXML include:
uk: Відповідь полягає в тому, що пакет :mod:`xml` Python 2.0 несумісний з PyXML, але його можна зробити сумісним, встановивши останню версію PyXML. Багато програм можуть обійтися підтримкою XML, яка включена в Python 2.0, але складніші програми вимагають інсталяції повного пакета PyXML. Після встановлення PyXML версії 0.6.0 або новішої замінить пакет :mod:`xml`, який постачається разом із Python, і стане строгим доповненням до стандартного пакета, додаючи купу додаткових функцій. Деякі з додаткових функцій у PyXML включають:

source: 4DOM, a full DOM implementation from FourThought, Inc.
uk: 4DOM, повна реалізація DOM від FourThought, Inc.

source: The xmlproc validating parser, written by Lars Marius Garshol.
uk: Парсер перевірки xmlproc, написаний Ларсом Маріусом Гаршолом.

source: The :mod:`sgmlop` parser accelerator module, written by Fredrik Lundh.
uk: Модуль прискорювача парсера :mod:`sgmlop`, написаний Фредріком Лундом.

source: Module changes
uk: Зміни модуля

source: Lots of improvements and bugfixes were made to Python's extensive standard library; some of the affected modules include :mod:`readline`, :mod:`ConfigParser`, :mod:`cgi`, :mod:`calendar`, :mod:`posix`, :mod:`readline`, :mod:`xmllib`, :mod:`aifc`, :mod:`chunk, wave`, :mod:`random`, :mod:`shelve`, and :mod:`nntplib`. Consult the CVS logs for the exact patch-by-patch details.
uk: Було зроблено багато покращень і виправлень помилок у великій стандартній бібліотеці Python; деякі з постраждалих модулів включають :mod:`readline`, :mod:`ConfigParser`, :mod:`cgi`, :mod:`calendar`, :mod:`posix`, :mod:`readline`, :mod:`xmllib`, :mod:`aifc`, :mod:`chunk, wave`, :mod:`random`, :mod:`shelve` і :mod:`nntplib`. Зверніться до журналів CVS для отримання точних деталей кожного патча.

source: Brian Gallew contributed OpenSSL support for the :mod:`socket` module. OpenSSL is an implementation of the Secure Socket Layer, which encrypts the data being sent over a socket. When compiling Python, you can edit :file:`Modules/Setup` to include SSL support, which adds an additional function to the :mod:`socket` module: ``socket.ssl(socket, keyfile, certfile)``, which takes a socket object and returns an SSL socket. The :mod:`httplib` and :mod:`urllib` modules were also changed to support ``https://`` URLs, though no one has implemented FTP or SMTP over SSL.
uk: Брайан Галлью надав підтримку OpenSSL для модуля :mod:`socket`. OpenSSL — це реалізація рівня захищених сокетів, який шифрує дані, що надсилаються через сокет. Під час компіляції Python ви можете редагувати :file:`Modules/Setup`, щоб включити підтримку SSL, яка додає додаткову функцію до модуля :mod:`socket`: ``socket.ssl(socket, keyfile, certfile)``, який приймає об’єкт сокета та повертає сокет SSL. Модулі :mod:`httplib` і :mod:`urllib` також були змінені для підтримки URL-адрес ``https://``, хоча ніхто не реалізував FTP або SMTP через SSL.

source: The :mod:`httplib` module has been rewritten by Greg Stein to support HTTP/1.1. Backward compatibility with the 1.5 version of :mod:`httplib` is provided, though using HTTP/1.1 features such as pipelining will require rewriting code to use a different set of interfaces.
uk: Модуль :mod:`httplib` був переписаний Грегом Стайном для підтримки HTTP/1.1. Забезпечується зворотна сумісність із версією 1.5 :mod:`httplib`, хоча використання функцій HTTP/1.1, таких як конвеєр, потребуватиме переписування коду для використання іншого набору інтерфейсів.

source: The :mod:`Tkinter` module now supports Tcl/Tk version 8.1, 8.2, or 8.3, and support for the older 7.x versions has been dropped. The Tkinter module now supports displaying Unicode strings in Tk widgets. Also, Fredrik Lundh contributed an optimization which makes operations like ``create_line`` and ``create_polygon`` much faster, especially when using lots of coordinates.
uk: Модуль :mod:`Tkinter` тепер підтримує Tcl/Tk версії 8.1, 8.2 або 8.3, а підтримку старіших версій 7.x припинено. Модуль Tkinter тепер підтримує відображення рядків Unicode у віджетах Tk. Крім того, Фредрік Лунд вніс оптимізацію, яка робить такі операції, як ``create_line`` і ``create_polygon``, набагато швидшими, особливо при використанні великої кількості координат.
