Repository: python/python-docs-uk
Catalog: whatsnew/2.0.po
Languages: uk

source: Previously there was no way to implement a class that overrode Python's built-in :keyword:`in` operator and implemented a custom version. ``obj in seq`` returns true if *obj* is present in the sequence *seq*; Python computes this by simply trying every index of the sequence until either *obj* is found or an :exc:`IndexError` is encountered. Moshe Zadka contributed a patch which adds a :meth:`__contains__` magic method for providing a custom implementation for :keyword:`!in`. Additionally, new built-in objects written in C can define what :keyword:`!in` means for them via a new slot in the sequence protocol.
uk: Раніше не було можливості реалізувати клас, який замінює вбудований оператор Python :keyword:`in` і реалізовує спеціальну версію. ``obj in seq`` повертає істину, якщо *obj* присутній у послідовності *seq*; Python обчислює це, просто пробуючи кожен індекс послідовності, поки не буде знайдено *obj* або не буде виявлено :exc:`IndexError`. Moshe Zadka вніс патч, який додає магічний метод :meth:`__contains__` для надання спеціальної реалізації для :keyword:`!in`. Крім того, нові вбудовані об’єкти, написані мовою C, можуть визначати, що для них означає :keyword:`!in` через новий слот у протоколі послідовності.

source: Earlier versions of Python used a recursive algorithm for deleting objects. Deeply nested data structures could cause the interpreter to fill up the C stack and crash; Christian Tismer rewrote the deletion logic to fix this problem. On a related note, comparing recursive objects recursed infinitely and crashed; Jeremy Hylton rewrote the code to no longer crash, producing a useful result instead. For example, after this code::
uk: Попередні версії Python використовували рекурсивний алгоритм для видалення об’єктів. Глибоко вкладені структури даних можуть спричинити заповнення стека C і збій інтерпретатора; Крістіан Тісмер переписав логіку видалення, щоб вирішити цю проблему. У зв’язку з цим, порівняння рекурсивних об’єктів нескінченно рекурсувало і вийшло з ладу; Джеремі Гілтон переписав код, щоб він більше не виходив з ладу, натомість створюючи корисний результат. Наприклад, після цього коду::

source: The comparison ``a==b`` returns true, because the two recursive data structures are isomorphic. See the thread "trashcan and PR#7" in the April 2000 archives of the python-dev mailing list for the discussion leading up to this implementation, and some useful relevant links. Note that comparisons can now also raise exceptions. In earlier versions of Python, a comparison operation such as ``cmp(a,b)`` would always produce an answer, even if a user-defined :meth:`__cmp__` method encountered an error, since the resulting exception would simply be silently swallowed.
uk: Порівняння ``a==b`` повертає true, оскільки дві рекурсивні структури даних є ізоморфними. Дивіться тему "trashcan and PR#7" в архівах списку розсилки python-dev за квітень 2000 року для обговорення, що призвело до цієї реалізації, а також деякі корисні відповідні посилання. Зауважте, що порівняння тепер також можуть створювати винятки. У попередніх версіях Python операція порівняння, наприклад ``cmp(a,b)``, завжди давала відповідь, навіть якщо визначений користувачем метод :meth:`__cmp__` виявив помилку, оскільки результуючий виняток просто мовчки проковтнути.

source: Work has been done on porting Python to 64-bit Windows on the Itanium processor, mostly by Trent Mick of ActiveState. (Confusingly, ``sys.platform`` is still ``'win32'`` on Win64 because it seems that for ease of porting, MS Visual C++ treats code as 32 bit on Itanium.) PythonWin also supports Windows CE; see the Python CE page at http://pythonce.sourceforge.net/ for more information.
uk: Робота над перенесенням Python на 64-розрядну Windows на процесорі Itanium була виконана в основному Трентом Міком з ActiveState. (Для плутанини ``sys.platform`` все ще є ``'win32'`` на Win64, тому що здається, що для зручності перенесення MS Visual C++ розглядає код як 32-розрядний на Itanium.) PythonWin також підтримує Windows CE; дивіться сторінку Python CE за адресою http://pythonce.sourceforge.net/ для отримання додаткової інформації.

source: Another new platform is Darwin/MacOS X; initial support for it is in Python 2.0. Dynamic loading works, if you specify "configure --with-dyld --with-suffix=.x". Consult the README in the Python source distribution for more instructions.
uk: Ще одна нова платформа — Darwin/MacOS X; початкова підтримка для нього в Python 2.0. Динамічне завантаження працює, якщо ви вкажете "configure --with-dyld --with-suffix=.x". Щоб отримати додаткові вказівки, зверніться до файлу README у вихідному коді Python.

source: An attempt has been made to alleviate one of Python's warts, the often-confusing :exc:`NameError` exception when code refers to a local variable before the variable has been assigned a value. For example, the following code raises an exception on the ``print`` statement in both 1.5.2 and 2.0; in 1.5.2 a :exc:`NameError` exception is raised, while 2.0 raises a new :exc:`UnboundLocalError` exception. :exc:`UnboundLocalError` is a subclass of :exc:`NameError`, so any existing code that expects :exc:`NameError` to be raised should still work. ::
uk: Була зроблена спроба пом’якшити одну з недоліків Python, виняток :exc:`NameError`, який часто викликає плутанину, коли код посилається на локальну змінну до того, як їй було присвоєно значення. Наприклад, наступний код викликає виняток у операторі ``print`` як у 1.5.2, так і 2.0; у 1.5.2 виникає виняток :exc:`NameError`, тоді як у 2.0 виникає новий виняток :exc:`UnboundLocalError`. :exc:`UnboundLocalError` є підкласом :exc:`NameError`, тому будь-який існуючий код, який очікує виклику :exc:`NameError`, має працювати. ::

source: Two new exceptions, :exc:`TabError` and :exc:`IndentationError`, have been introduced. They're both subclasses of :exc:`SyntaxError`, and are raised when Python code is found to be improperly indented.
uk: Додано два нові винятки, :exc:`TabError` і :exc:`IndentationError`. Обидва вони є підкласами :exc:`SyntaxError` і викликаються, коли виявляється, що код Python має неправильний відступ.

source: Changes to Built-in Functions
uk: Зміни вбудованих функцій

source: A new built-in, ``zip(seq1, seq2, ...)``, has been added. :func:`zip` returns a list of tuples where each tuple contains the i-th element from each of the argument sequences. The difference between :func:`zip` and ``map(None, seq1, seq2)`` is that :func:`map` pads the sequences with ``None`` if the sequences aren't all of the same length, while :func:`zip` truncates the returned list to the length of the shortest argument sequence.
uk: Додано нову вбудовану функцію ``zip(seq1, seq2, ...)``. :func:`zip` повертає список кортежів, де кожен кортеж містить i-й елемент із кожної послідовності аргументів. Різниця між :func:`zip` і ``map(None, seq1, seq2)`` полягає в тому, що :func:`map` доповнює послідовності ``None``, якщо послідовності не мають однакову довжину , а :func:`zip` скорочує повернутий список до довжини найкоротшої послідовності аргументів.

source: The :func:`int` and :func:`long` functions now accept an optional "base" parameter when the first argument is a string. ``int('123', 10)`` returns 123, while ``int('123', 16)`` returns 291. ``int(123, 16)`` raises a :exc:`TypeError` exception with the message "can't convert non-string with explicit base".
uk: Функції :func:`int` і :func:`long` тепер приймають додатковий параметр "base", коли перший аргумент є рядком. ``int('123', 10)`` повертає 123, тоді як ``int('123', 16)`` повертає 291. ``int(123, 16)`` викликає виняток :exc:`TypeError` з повідомленням "неможливо перетворити не рядок із явною базою".

source: A new variable holding more detailed version information has been added to the :mod:`sys` module. ``sys.version_info`` is a tuple ``(major, minor, micro, level, serial)`` For example, in a hypothetical 2.0.1beta1, ``sys.version_info`` would be ``(2, 0, 1, 'beta', 1)``. *level* is a string such as ``"alpha"``, ``"beta"``, or ``"final"`` for a final release.
uk: До модуля :mod:`sys` додано нову змінну, що містить більш детальну інформацію про версію. ``sys.version_info`` — це кортеж ``(major, minor, micro, level, serial)``. Наприклад, у гіпотетичній версії 2.0.1beta1, ``sys.version_info`` буде ``(2, 0 , 1, 'бета', 1)``. *level* — це рядок, наприклад ``"alpha"``, ``"beta"`` або ``"final"`` для остаточного випуску.

source: Dictionaries have an odd new method, ``setdefault(key, default)``, which behaves similarly to the existing :meth:`get` method. However, if the key is missing, :meth:`setdefault` both returns the value of *default* as :meth:`get` would do, and also inserts it into the dictionary as the value for *key*. Thus, the following lines of code::
uk: У словниках є дивний новий метод, ``setdefault(key, default)``, який поводиться подібно до існуючого методу :meth:`get`. Однак, якщо ключ відсутній, :meth:`setdefault` повертає значення *default*, як це зробив би :meth:`get`, а також вставляє його до словника як значення для *key*. Таким чином, наступні рядки коду::

source: can be reduced to a single ``return dict.setdefault(key, [])`` statement.
uk: можна звести до одного оператора ``return dict.setdefault(key, [])``.

source: The interpreter sets a maximum recursion depth in order to catch runaway recursion before filling the C stack and causing a core dump or GPF.. Previously this limit was fixed when you compiled Python, but in 2.0 the maximum recursion depth can be read and modified using :func:`sys.getrecursionlimit` and :func:`sys.setrecursionlimit`. The default value is 1000, and a rough maximum value for a given platform can be found by running a new script, :file:`Misc/find_recursionlimit.py`.
uk: Інтерпретатор встановлює максимальну глибину рекурсії, щоб уловити невимушену рекурсію перед заповненням стека C і створенням дампа ядра або GPF. Раніше це обмеження було виправлено під час компіляції Python, але у 2.0 максимальну глибину рекурсії можна прочитати та змінити за допомогою :func:`sys.getrecursionlimit` і :func:`sys.setrecursionlimit`. Стандартним значенням є 1000, а приблизне максимальне значення для даної платформи можна знайти, запустивши новий сценарій :file:`Misc/find_recursionlimit.py`.

source: Porting to 2.0
uk: Перенесення на 2.0

source: New Python releases try hard to be compatible with previous releases, and the record has been pretty good. However, some changes are considered useful enough, usually because they fix initial design decisions that turned out to be actively mistaken, that breaking backward compatibility can't always be avoided. This section lists the changes in Python 2.0 that may cause old Python code to break.
uk: Нові випуски Python намагаються бути сумісними з попередніми випусками, і результати були досить хорошими. Однак деякі зміни вважаються досить корисними, зазвичай тому, що вони виправляють початкові дизайнерські рішення, які виявилися активно помилковими, тому порушення зворотної сумісності не завжди можна уникнути. У цьому розділі перераховано зміни в Python 2.0, які можуть призвести до поломки старого коду Python.

source: The change which will probably break the most code is tightening up the arguments accepted by some methods. Some methods would take multiple arguments and treat them as a tuple, particularly various list methods such as :meth:`append` and :meth:`insert`. In earlier versions of Python, if ``L`` is a list, ``L.append( 1,2 )`` appends the tuple ``(1,2)`` to the list. In Python 2.0 this causes a :exc:`TypeError` exception to be raised, with the message: 'append requires exactly 1 argument; 2 given'. The fix is to simply add an extra set of parentheses to pass both values as a tuple: ``L.append( (1,2) )``.
uk: Зміна, яка, ймовірно, найбільше порушить код, полягає в посиленні аргументів, прийнятих деякими методами. Деякі методи приймають кілька аргументів і розглядають їх як кортеж, зокрема різні методи списку, такі як :meth:`append` і :meth:`insert`. У попередніх версіях Python, якщо ``L`` є списком, ``L.append( 1,2 )`` додає кортеж ``(1,2)`` до списку. У Python 2.0 це викликає виняток :exc:`TypeError` із повідомленням: "додавання вимагає рівно 1 аргументу; 2 дано'. Виправлення полягає в тому, щоб просто додати додатковий набір дужок, щоб передати обидва значення як кортеж: ``L.append( (1,2) )``.

source: The earlier versions of these methods were more forgiving because they used an old function in Python's C interface to parse their arguments; 2.0 modernizes them to use :func:`PyArg_ParseTuple`, the current argument parsing function, which provides more helpful error messages and treats multi-argument calls as errors. If you absolutely must use 2.0 but can't fix your code, you can edit :file:`Objects/listobject.c` and define the preprocessor symbol ``NO_STRICT_LIST_APPEND`` to preserve the old behaviour; this isn't recommended.
uk: Попередні версії цих методів були більш поблажливими, оскільки вони використовували стару функцію в інтерфейсі C Python для аналізу своїх аргументів; 2.0 модернізує їх для використання :func:`PyArg_ParseTuple`, поточної функції аналізу аргументів, яка надає більш корисні повідомлення про помилки та розглядає багатоаргументні виклики як помилки. Якщо вам абсолютно необхідно використовувати 2.0, але ви не можете виправити свій код, ви можете відредагувати :file:`Objects/listobject.c` і визначити символ препроцесора ``NO_STRICT_LIST_APPEND``, щоб зберегти стару поведінку; це не рекомендується.

source: Some of the functions in the :mod:`socket` module are still forgiving in this way. For example, :func:`socket.connect( ('hostname', 25) )` is the correct form, passing a tuple representing an IP address, but :func:`socket.connect( 'hostname', 25 )` also works. :func:`socket.connect_ex` and :func:`socket.bind` are similarly easy-going. 2.0alpha1 tightened these functions up, but because the documentation actually used the erroneous multiple argument form, many people wrote code which would break with the stricter checking. GvR backed out the changes in the face of public reaction, so for the :mod:`socket` module, the documentation was fixed and the multiple argument form is simply marked as deprecated; it *will* be tightened up again in a future Python version.
uk: Деякі функції в модулі :mod:`socket` все ще прощають таким чином. Наприклад, :func:`socket.connect( ('hostname', 25) )` є правильною формою, яка передає кортеж, що представляє IP-адресу, але :func:`socket.connect( 'hostname', 25 )` також працює. :func:`socket.connect_ex` і :func:`socket.bind` так само прості. 2.0alpha1 посилив ці функції, але оскільки документація фактично використовувала помилкову форму з декількома аргументами, багато людей писали код, який порушує суворішу перевірку. GvR скасував зміни, незважаючи на реакцію громадськості, тому для модуля :mod:`socket` документацію було виправлено, а форму з кількома аргументами просто позначено як застарілу; його *буде* знову посилено в майбутній версії Python.

source: The ``\x`` escape in string literals now takes exactly 2 hex digits. Previously it would consume all the hex digits following the 'x' and take the lowest 8 bits of the result, so ``\x123456`` was equivalent to ``\x56``.
uk: Екранування ``\x`` у рядкових літералах тепер займає рівно 2 шістнадцяткові цифри. Раніше він використовував усі шістнадцяткові цифри після 'x' і брав молодші 8 бітів результату, тому ``\x123456`` був еквівалентним ``\x56``.

source: The :exc:`AttributeError` and :exc:`NameError` exceptions have a more friendly error message, whose text will be something like ``'Spam' instance has no attribute 'eggs'`` or ``name 'eggs' is not defined``. Previously the error message was just the missing attribute name ``eggs``, and code written to take advantage of this fact will break in 2.0.
uk: Винятки :exc:`AttributeError` і :exc:`NameError` мають більш зрозуміле повідомлення про помилку, текст якого буде приблизно таким, як "Екземпляр спаму" не має атрибута "яйця" або "назва "яйця" є не визначено``. Раніше повідомленням про помилку було лише відсутнє ім’я атрибута ``яйця``, і код, написаний для використання цього факту, зламається у 2.0.

source: Some work has been done to make integers and long integers a bit more interchangeable. In 1.5.2, large-file support was added for Solaris, to allow reading files larger than 2 GiB; this made the :meth:`tell` method of file objects return a long integer instead of a regular integer. Some code would subtract two file offsets and attempt to use the result to multiply a sequence or slice a string, but this raised a :exc:`TypeError`. In 2.0, long integers can be used to multiply or slice a sequence, and it'll behave as you'd intuitively expect it to; ``3L * 'abc'`` produces 'abcabcabc', and ``(0,1,2,3)[2L:4L]`` produces (2,3). Long integers can also be used in various contexts where previously only integers were accepted, such as in the :meth:`seek` method of file objects, and in the formats supported by the ``%`` operator (``%d``, ``%i``, ``%x``, etc.). For example, ``"%d" % 2L**64`` will produce the string ``18446744073709551616``.
uk: Було зроблено певну роботу, щоб зробити цілі та довгі цілі трохи більш взаємозамінними. У 1.5.2 була додана підтримка великих файлів для Solaris, щоб дозволити читати файли розміром понад 2 ГіБ; це змусило метод :meth:`tell` файлових об’єктів повертати довге ціле число замість звичайного цілого. Деякий код віднімав би два зміщення файлів і намагався використати результат для множення послідовності або фрагменту рядка, але це викликало :exc:`TypeError`. У версії 2.0 довгі цілі числа можна використовувати для множення або розділення послідовності, і вона працюватиме так, як ви інтуїтивно очікуєте; 3L * 'abc' створює 'abcabcabc', а ``(0,1,2,3)[2L:4L]`` створює (2,3). Довгі цілі також можна використовувати в різних контекстах, де раніше приймалися лише цілі числа, наприклад у методі :meth:`seek` файлових об’єктів, а також у форматах, які підтримуються оператором ``%`` (``%d`` , ``%i``, ``%x`` тощо). Наприклад, ``"%d" % 2L**64`` створить рядок ``18446744073709551616``.

source: The subtlest long integer change of all is that the :func:`str` of a long integer no longer has a trailing 'L' character, though :func:`repr` still includes it. The 'L' annoyed many people who wanted to print long integers that looked just like regular integers, since they had to go out of their way to chop off the character. This is no longer a problem in 2.0, but code which does ``str(longval)[:-1]`` and assumes the 'L' is there, will now lose the final digit.
uk: Найтонша зміна довгого цілого числа полягає в тому, що :func:`str` довгого цілого більше не має кінцевого символу 'L', хоча :func:`repr` все ще містить його. "L" дратувала багатьох людей, які хотіли надрукувати довгі цілі числа, які виглядали так само, як звичайні цілі числа, оскільки їм доводилося докладати всіх зусиль, щоб відрізати символ. Це більше не є проблемою у 2.0, але код, який виконує ``str(longval)[:-1]`` і припускає, що є 'L', тепер втратить останню цифру.

source: Taking the :func:`repr` of a float now uses a different formatting precision than :func:`str`. :func:`repr` uses ``%.17g`` format string for C's :func:`sprintf`, while :func:`str` uses ``%.12g`` as before. The effect is that :func:`repr` may occasionally show more decimal places than :func:`str`, for certain numbers. For example, the number 8.1 can't be represented exactly in binary, so ``repr(8.1)`` is ``'8.0999999999999996'``, while str(8.1) is ``'8.1'``.
uk: Прийняття :func:`repr` числа з плаваючою точкою тепер використовує іншу точність форматування, ніж :func:`str`. :func:`repr` використовує рядок формату ``%.17g`` для C :func:`sprintf`, а :func:`str` використовує ``%.12g``, як і раніше. Внаслідок цього :func:`repr` іноді може показувати більше десяткових знаків, ніж :func:`str`, для певних чисел. Наприклад, число 8.1 не може бути точно представлене у двійковій формі, тому ``repr(8.1)`` має значення ``'8.0999999999999996'``, а str(8.1) — ``'8.1'``.

source: The ``-X`` command-line option, which turned all standard exceptions into strings instead of classes, has been removed; the standard exceptions will now always be classes. The :mod:`exceptions` module containing the standard exceptions was translated from Python to a built-in C module, written by Barry Warsaw and Fredrik Lundh.
uk: Параметр командного рядка ``-X``, який перетворював усі стандартні винятки на рядки замість класів, було видалено; стандартними винятками тепер завжди будуть класи. Модуль :mod:`exceptions`, що містить стандартні винятки, було перекладено з Python на вбудований модуль C, написаний Баррі Варшау та Фредріком Лундом.

source: Extending/Embedding Changes
uk: Розширення/вбудовування змін

source: Some of the changes are under the covers, and will only be apparent to people writing C extension modules or embedding a Python interpreter in a larger application. If you aren't dealing with Python's C API, you can safely skip this section.
uk: Деякі зміни знаходяться під обкладинками, і вони будуть очевидні лише для людей, які пишуть модулі розширення C або вбудовують інтерпретатор Python у більшу програму. Якщо ви не маєте справу з API C Python, можете сміливо пропустити цей розділ.

source: The version number of the Python C API was incremented, so C extensions compiled for 1.5.2 must be recompiled in order to work with 2.0. On Windows, it's not possible for Python 2.0 to import a third party extension built for Python 1.5.x due to how Windows DLLs work, so Python will raise an exception and the import will fail.
uk: Номер версії Python C API було збільшено, тому розширення C, скомпільовані для 1.5.2, потрібно перекомпілювати, щоб працювати з 2.0. У Windows Python 2.0 не може імпортувати стороннє розширення, створене для Python 1.5.x, через те, як працюють бібліотеки DLL Windows, тому Python викличе виняток, і імпорт не вдасться.

source: Users of Jim Fulton's ExtensionClass module will be pleased to find out that hooks have been added so that ExtensionClasses are now supported by :func:`isinstance` and :func:`issubclass`. This means you no longer have to remember to write code such as ``if type(obj) == myExtensionClass``, but can use the more natural ``if isinstance(obj, myExtensionClass)``.
uk: Користувачі модуля ExtensionClass Джима Фултона будуть раді дізнатися, що були додані хуки, завдяки чому ExtensionClasses тепер підтримуються :func:`isinstance` і :func:`issubclass`. Це означає, що вам більше не потрібно пам’ятати про написання такого коду, як ``if type(obj) == myExtensionClass``, а можна використовувати більш природний ``if isinstance(obj, myExtensionClass)``.

source: The :file:`Python/importdl.c` file, which was a mass of #ifdefs to support dynamic loading on many different platforms, was cleaned up and reorganised by Greg Stein. :file:`importdl.c` is now quite small, and platform-specific code has been moved into a bunch of :file:`Python/dynload_\*.c` files. Another cleanup: there were also a number of :file:`my\*.h` files in the Include/ directory that held various portability hacks; they've been merged into a single file, :file:`Include/pyport.h`.
uk: Файл :file:`Python/importdl.c`, який являв собою масу #ifdefs для підтримки динамічного завантаження на багатьох різних платформах, був очищений і реорганізований Грегом Стайном. :file:`importdl.c` тепер досить малий, і специфічний для платформи код було переміщено до групи файлів :file:`Python/dynload_\*.c`. Ще одне очищення: у каталозі Include/ також було кілька файлів :file:`my\*.h`, які містили різноманітні хаки для перенесення; їх об’єднано в один файл :file:`Include/pyport.h`.
