Repository: python/python-docs-uk
Catalog: whatsnew/2.1.po
Languages: uk

source: When compiling Python, the user had to go in and edit the :file:`Modules/Setup` file in order to enable various additional modules; the default set is relatively small and limited to modules that compile on most Unix platforms. This means that on Unix platforms with many more features, most notably Linux, Python installations often don't contain all useful modules they could.
uk: Під час компіляції Python користувач мав зайти та відредагувати файл :file:`Modules/Setup`, щоб увімкнути різні додаткові модулі; стандартний набір відносно малий і обмежений модулями, які компілюються на більшості платформ Unix. Це означає, що на платформах Unix із набагато більшою кількістю можливостей, особливо Linux, встановлення Python часто не містять усіх корисних модулів, які могли б.

source: Python 2.0 added the Distutils, a set of modules for distributing and installing extensions. In Python 2.1, the Distutils are used to compile much of the standard library of extension modules, autodetecting which ones are supported on the current machine. It's hoped that this will make Python installations easier and more featureful.
uk: Python 2.0 додав Distutils, набір модулів для розповсюдження та встановлення розширень. У Python 2.1 Distutils використовуються для компіляції більшої частини стандартної бібліотеки модулів розширення, автоматично визначаючи, які з них підтримуються на поточній машині. Є надія, що це зробить інсталяцію Python простішою та функціональнішою.

source: Instead of having to edit the :file:`Modules/Setup` file in order to enable modules, a :file:`setup.py` script in the top directory of the Python source distribution is run at build time, and attempts to discover which modules can be enabled by examining the modules and header files on the system. If a module is configured in :file:`Modules/Setup`, the :file:`setup.py` script won't attempt to compile that module and will defer to the :file:`Modules/Setup` file's contents. This provides a way to specific any strange command-line flags or libraries that are required for a specific platform.
uk: Замість того, щоб редагувати файл :file:`Modules/Setup`, щоб увімкнути модулі, сценарій :file:`setup.py` у верхньому каталозі дистрибутива вихідного коду Python запускається під час збирання та намагається виявити які модулі можна ввімкнути, перевіривши модулі та файли заголовків у системі. Якщо модуль налаштовано в :file:`Modules/Setup`, сценарій :file:`setup.py` не намагатиметься скомпілювати цей модуль і звернеться до вмісту файлу :file:`Modules/Setup`. Це надає спосіб визначити будь-які дивні прапори командного рядка або бібліотеки, які потрібні для певної платформи.

source: In another far-reaching change to the build mechanism, Neil Schemenauer restructured things so Python now uses a single makefile that isn't recursive, instead of makefiles in the top directory and in each of the :file:`Python/`, :file:`Parser/`, :file:`Objects/`, and :file:`Modules/` subdirectories. This makes building Python faster and also makes hacking the Makefiles clearer and simpler.
uk: В іншій далекосяжній зміні механізму збірки Ніл Шеменауер змінив структуру так, що Python тепер використовує єдиний make-файл, який не є рекурсивним, замість make-файлів у верхньому каталозі та в кожному Підкаталоги з :file:`Python/`, :file:`Parser/`, :file:`Objects/` і :file:`Modules/`. Це робить створення Python швидшим, а також робить злам Makefiles зрозумілішим і простішим.

source: :pep:`229` - Using Distutils to Build Python
uk: :pep:`229` - Використання Distutils для створення Python

source: Written and implemented by A.M. Kuchling.
uk: Написана та реалізована А.М. Кухлінг.

source: PEP 205: Weak References
uk: PEP 205: Слабкі посилання

source: Weak references, available through the :mod:`weakref` module, are a minor but useful new data type in the Python programmer's toolbox.
uk: Слабкі посилання, доступні через модуль :mod:`weakref`, є другорядним, але корисним новим типом даних у наборі інструментів програміста Python.

source: Storing a reference to an object (say, in a dictionary or a list) has the side effect of keeping that object alive forever. There are a few specific cases where this behaviour is undesirable, object caches being the most common one, and another being circular references in data structures such as trees.
uk: Зберігання посилання на об’єкт (скажімо, у словнику чи списку) має побічним ефектом збереження цього об’єкта назавжди. Є кілька конкретних випадків, коли така поведінка є небажаною, найпоширенішим є кешування об’єктів, а іншим є циклічні посилання в структурах даних, таких як дерева.

source: For example, consider a memoizing function that caches the results of another function ``f(x)`` by storing the function's argument and its result in a dictionary::
uk: Наприклад, розглянемо функцію запам’ятовування, яка кешує результати іншої функції ``f(x)``, зберігаючи аргумент функції та її результат у словнику:

source: This version works for simple things such as integers, but it has a side effect; the ``_cache`` dictionary holds a reference to the return values, so they'll never be deallocated until the Python process exits and cleans up. This isn't very noticeable for integers, but if :func:`f` returns an object, or a data structure that takes up a lot of memory, this can be a problem.
uk: Ця версія працює для простих речей, таких як цілі числа, але вона має побічний ефект; словник ``_cache`` містить посилання на значення, що повертаються, тому їх ніколи не буде звільнено, доки процес Python не завершить роботу та не очистить. Це не дуже помітно для цілих чисел, але якщо :func:`f` повертає об’єкт або структуру даних, яка займає багато пам’яті, це може бути проблемою.

source: Weak references provide a way to implement a cache that won't keep objects alive beyond their time. If an object is only accessible through weak references, the object will be deallocated and the weak references will now indicate that the object it referred to no longer exists. A weak reference to an object *obj* is created by calling ``wr = weakref.ref(obj)``. The object being referred to is returned by calling the weak reference as if it were a function: ``wr()``. It will return the referenced object, or ``None`` if the object no longer exists.
uk: Слабкі посилання забезпечують спосіб реалізації кешу, який не зберігатиме об’єкти живими понад час. Якщо об’єкт доступний лише через слабкі посилання, об’єкт буде звільнено, а слабкі посилання тепер вказуватимуть, що об’єкт, на який він посилався, більше не існує. Слабке посилання на об’єкт *obj* створюється шляхом виклику ``wr = weakref.ref(obj)``. Об’єкт, на який посилається, повертається шляхом виклику слабкого посилання, як якщо б це була функція: ``wr()``. Він поверне об’єкт, на який посилається, або "Немає", якщо об’єкт більше не існує.

source: This makes it possible to write a :func:`memoize` function whose cache doesn't keep objects alive, by storing weak references in the cache. ::
uk: Це дає змогу написати функцію :func:`memoize`, кеш якої не зберігає живі об’єкти, зберігаючи слабкі посилання в кеші. ::

source: The :mod:`weakref` module also allows creating proxy objects which behave like weak references --- an object referenced only by proxy objects is deallocated -- but instead of requiring an explicit call to retrieve the object, the proxy transparently forwards all operations to the object as long as the object still exists. If the object is deallocated, attempting to use a proxy will cause a :exc:`weakref.ReferenceError` exception to be raised. ::
uk: Модуль :mod:`weakref` також дозволяє створювати проксі-об’єкти, які поводяться як слабкі посилання --- об’єкт, на який посилаються лише проксі-об’єкти, звільняється, але замість того, щоб вимагати явного виклику для отримання об’єкта, проксі прозоро пересилає всі операції до об’єкта, поки об’єкт все ще існує. Якщо об’єкт звільнено, спроба використати проксі призведе до виникнення винятку :exc:`weakref.ReferenceError`. ::

source: :pep:`205` - Weak References
uk: :pep:`205` - Слабкі посилання

source: Written and implemented by Fred L. Drake, Jr.
uk: Написаний і реалізований Фредом Л. Дрейком-молодшим.

source: PEP 232: Function Attributes
uk: PEP 232: Атрибути функцій

source: In Python 2.1, functions can now have arbitrary information attached to them. People were often using docstrings to hold information about functions and methods, because the ``__doc__`` attribute was the only way of attaching any information to a function. For example, in the Zope web application server, functions are marked as safe for public access by having a docstring, and in John Aycock's SPARK parsing framework, docstrings hold parts of the BNF grammar to be parsed. This overloading is unfortunate, since docstrings are really intended to hold a function's documentation; for example, it means you can't properly document functions intended for private use in Zope.
uk: У Python 2.1 функції тепер можуть мати довільну інформацію, приєднану до них. Люди часто використовували рядки документів для зберігання інформації про функції та методи, тому що атрибут ``__doc__`` був єдиним способом приєднання будь-якої інформації до функції. Наприклад, на сервері веб-додатків Zope функції позначаються як безпечні для загального доступу за допомогою рядка документації, а в системі аналізу Джона Ейкока SPARK рядки документів містять частини граматики BNF, які потрібно розібрати. Це перевантаження викликає жаль, оскільки рядки документації дійсно призначені для зберігання документації функції; наприклад, це означає, що ви не можете належним чином документувати функції, призначені для приватного використання в Zope.

source: Arbitrary attributes can now be set and retrieved on functions using the regular Python syntax::
uk: Довільні атрибути тепер можна встановлювати та отримувати для функцій за допомогою звичайного синтаксису Python:

source: The dictionary containing attributes can be accessed as the function's :attr:`~object.__dict__`. Unlike the :attr:`~object.__dict__` attribute of class instances, in functions you can actually assign a new dictionary to :attr:`~object.__dict__`, though the new value is restricted to a regular Python dictionary; you *can't* be tricky and set it to a :class:`UserDict` instance, or any other random object that behaves like a mapping.
uk: Доступ до словника, що містить атрибути, можна отримати як :attr:`~object.__dict__` функції. На відміну від атрибута :attr:`~object.__dict__` екземплярів класу, у функціях ви фактично можете призначити новий словник :attr:`~object.__dict__`, хоча нове значення обмежене звичайним словником Python; Ви *не можете* бути хитрими і встановити для нього екземпляр :class:`UserDict` або будь-який інший випадковий об’єкт, який поводиться як відображення.

source: :pep:`232` - Function Attributes
uk: :pep:`232` - Атрибути функції

source: Written and implemented by Barry Warsaw.
uk: Написав і реалізував Баррі Варшау.

source: PEP 235: Importing Modules on Case-Insensitive Platforms
uk: PEP 235: Імпорт модулів на платформах без урахування регістру

source: Some operating systems have filesystems that are case-insensitive, MacOS and Windows being the primary examples; on these systems, it's impossible to distinguish the filenames ``FILE.PY`` and ``file.py``, even though they do store the file's name in its original case (they're case-preserving, too).
uk: Деякі операційні системи мають файлові системи, які не чутливі до регістру, MacOS і Windows є основними прикладами; у цих системах неможливо розрізнити назви файлів ``FILE.PY`` і ``file.py``, навіть якщо вони зберігають назву файлу в оригінальному регістрі (вони також зберігають регістр).

source: In Python 2.1, the :keyword:`import` statement will work to simulate case-sensitivity on case-insensitive platforms. Python will now search for the first case-sensitive match by default, raising an :exc:`ImportError` if no such file is found, so ``import file`` will not import a module named ``FILE.PY``. Case-insensitive matching can be requested by setting the :envvar:`PYTHONCASEOK` environment variable before starting the Python interpreter.
uk: У Python 2.1 оператор :keyword:`import` працюватиме для імітації чутливості до регістру на платформах, які не чутливі до регістру. Тепер Python буде шукати перший збіг з урахуванням регістру за замовчуванням, викликаючи :exc:`ImportError`, якщо такий файл не знайдено, тому ``import file`` не імпортуватиме модуль з назвою ``FILE.PY``. Зіставлення без урахування регістру можна запитати, встановивши змінну середовища :envvar:`PYTHONCASEOK` перед запуском інтерпретатора Python.

source: PEP 217: Interactive Display Hook
uk: PEP 217: інтерактивний дисплей

source: When using the Python interpreter interactively, the output of commands is displayed using the built-in :func:`repr` function. In Python 2.1, the variable :func:`sys.displayhook` can be set to a callable object which will be called instead of :func:`repr`. For example, you can set it to a special pretty-printing function::
uk: Під час використання інтерпретатора Python в інтерактивному режимі вихід команд відображається за допомогою вбудованої функції :func:`repr`. У Python 2.1 змінна :func:`sys.displayhook` може бути встановлена на викликаний об’єкт, який буде викликатися замість :func:`repr`. Наприклад, ви можете встановити для нього спеціальну функцію красивого друку:

source: :pep:`217` - Display Hook for Interactive Use
uk: :pep:`217` - Дисплей Хук для інтерактивного використання

source: Written and implemented by Moshe Zadka.
uk: Написав і реалізував Моше Задка.

source: PEP 208: New Coercion Model
uk: PEP 208: Нова модель примусу

source: How numeric coercion is done at the C level was significantly modified. This will only affect the authors of C extensions to Python, allowing them more flexibility in writing extension types that support numeric operations.
uk: Спосіб виконання числового приведення на рівні C було значно змінено. Це вплине лише на авторів розширень C для Python, надаючи їм більше гнучкості в написанні типів розширень, які підтримують числові операції.

source: Extension types can now set the type flag ``Py_TPFLAGS_CHECKTYPES`` in their ``PyTypeObject`` structure to indicate that they support the new coercion model. In such extension types, the numeric slot functions can no longer assume that they'll be passed two arguments of the same type; instead they may be passed two arguments of differing types, and can then perform their own internal coercion. If the slot function is passed a type it can't handle, it can indicate the failure by returning a reference to the ``Py_NotImplemented`` singleton value. The numeric functions of the other type will then be tried, and perhaps they can handle the operation; if the other type also returns ``Py_NotImplemented``, then a :exc:`TypeError` will be raised. Numeric methods written in Python can also return ``Py_NotImplemented``, causing the interpreter to act as if the method did not exist (perhaps raising a :exc:`TypeError`, perhaps trying another object's numeric methods).
uk: Типи розширень тепер можуть установлювати прапор типу ``Py_TPFLAGS_CHECKTYPES`` у своїй структурі ``PyTypeObject``, щоб вказати, що вони підтримують нову модель примусу. У таких типах розширень функції числового слота більше не можуть припускати, що їм будуть передані два аргументи одного типу; натомість їм можуть бути передані два аргументи різних типів, і потім вони можуть виконувати власний внутрішній примус. Якщо функції слота передано тип, який вона не може обробити, вона може вказувати на помилку, повертаючи посилання на одноэлементне значення ``Py_NotImplemented``. Потім буде випробувано числові функції іншого типу, і, можливо, вони зможуть впоратися з операцією; якщо інший тип також повертає ``Py_NotImplemented``, тоді буде викликано :exc:`TypeError`. Числові методи, написані на Python, також можуть повертати ``Py_NotImplemented``, змушуючи інтерпретатор діяти так, ніби метод не існує (можливо, викликаючи :exc:`TypeError`, можливо, намагаючись використовувати числові методи іншого об’єкта).

source: :pep:`208` - Reworking the Coercion Model
uk: :pep:`208` - Переробка моделі примусу

source: Written and implemented by Neil Schemenauer, heavily based upon earlier work by Marc-André Lemburg. Read this to understand the fine points of how numeric operations will now be processed at the C level.
uk: Написаний і реалізований Нілом Шеменауером, значною мірою заснований на попередніх роботах Марка-Андре Лембурга. Прочитайте це, щоб зрозуміти тонкощі того, як числові операції тепер оброблятимуться на рівні C.

source: PEP 241: Metadata in Python Packages
uk: PEP 241: Метадані в пакетах Python

source: A common complaint from Python users is that there's no single catalog of all the Python modules in existence. T. Middleton's Vaults of Parnassus at http://www.vex.net/parnassus/ are the largest catalog of Python modules, but registering software at the Vaults is optional, and many people don't bother.
uk: Загальна скарга користувачів Python полягає в тому, що не існує єдиного каталогу всіх модулів Python. T. Middleton's Vaults of Parnassus на http://www.vex.net/parnassus/ є найбільшим каталогом модулів Python, але реєструвати програмне забезпечення в Vaults необов’язково, і багато людей це не турбує.

source: As a first small step toward fixing the problem, Python software packaged using the Distutils :command:`sdist` command will include a file named :file:`PKG-INFO` containing information about the package such as its name, version, and author (metadata, in cataloguing terminology). :pep:`241` contains the full list of fields that can be present in the :file:`PKG-INFO` file. As people began to package their software using Python 2.1, more and more packages will include metadata, making it possible to build automated cataloguing systems and experiment with them. With the result experience, perhaps it'll be possible to design a really good catalog and then build support for it into Python 2.2. For example, the Distutils :command:`sdist` and :command:`bdist_\*` commands could support an ``upload`` option that would automatically upload your package to a catalog server.
uk: Як перший невеликий крок до вирішення проблеми, програмне забезпечення Python, упаковане за допомогою команди Distutils :command:`sdist`, міститиме файл під назвою :file:`PKG-INFO`, що містить інформацію про пакунок, як-от його назву, версію та автора. (метадані, в термінології каталогізації). :pep:`241` містить повний список полів, які можуть міститися у файлі :file:`PKG-INFO`. Оскільки люди почали пакувати своє програмне забезпечення за допомогою Python 2.1, все більше і більше пакетів включатимуть метадані, що дає змогу створювати автоматизовані системи каталогізації та експериментувати з ними. З отриманим досвідом, можливо, стане можливим створити справді хороший каталог, а потім створити його підтримку в Python 2.2. Наприклад, команди Distutils :command:`sdist` і :command:`bdist_\*` можуть підтримувати опцію ``upload``, яка автоматично завантажуватиме ваш пакет на сервер каталогу.

source: You can start creating packages containing :file:`PKG-INFO` even if you're not using Python 2.1, since a new release of the Distutils will be made for users of earlier Python versions. Version 1.0.2 of the Distutils includes the changes described in :pep:`241`, as well as various bugfixes and enhancements. It will be available from the Distutils SIG at https://www.python.org/community/sigs/current/distutils-sig/.
uk: Ви можете почати створювати пакунки, що містять :file:`PKG-INFO`, навіть якщо ви не використовуєте Python 2.1, оскільки для користувачів попередніх версій Python буде створено новий випуск Distutils. Версія 1.0.2 Distutils містить зміни, описані в :pep:`241`, а також різні виправлення помилок і вдосконалення. Він буде доступний у Distutils SIG за адресою https://www.python.org/community/sigs/current/distutils-sig/.

source: :pep:`241` - Metadata for Python Software Packages
uk: :pep:`241` - метадані для програмних пакетів Python

source: :pep:`243` - Module Repository Upload Mechanism
uk: :pep:`243` - Механізм завантаження сховища модулів

source: Written by Sean Reifschneider, this draft PEP describes a proposed mechanism for uploading Python packages to a central server.
uk: Цей проект PEP, написаний Шоном Райфшнайдером, описує запропонований механізм для завантаження пакетів Python на центральний сервер.

source: New and Improved Modules
uk: Нові та вдосконалені модулі

source: Ka-Ping Yee contributed two new modules: :mod:`inspect.py`, a module for getting information about live Python code, and :mod:`pydoc.py`, a module for interactively converting docstrings to HTML or text. As a bonus, :file:`Tools/scripts/pydoc`, which is now automatically installed, uses :mod:`pydoc.py` to display documentation given a Python module, package, or class name. For example, ``pydoc xml.dom`` displays the following::
uk: Ka-Ping Yee вніс два нові модулі: :mod:`inspect.py`, модуль для отримання інформації про живий код Python, і :mod:`pydoc.py`, модуль для інтерактивного перетворення рядків документів у HTML або текст. Як бонус, :file:`Tools/scripts/pydoc`, який тепер автоматично встановлюється, використовує :mod:`pydoc.py` для відображення документації з назвою модуля, пакета чи класу Python. Наприклад, ``pydoc xml.dom`` відображає наступне:

source: :file:`pydoc` also includes a Tk-based interactive help browser. :file:`pydoc` quickly becomes addictive; try it out!
uk: :file:`pydoc` також містить інтерактивний довідковий браузер на основі Tk. :file:`pydoc` швидко викликає звикання; Спробуй!

source: Two different modules for unit testing were added to the standard library. The :mod:`doctest` module, contributed by Tim Peters, provides a testing framework based on running embedded examples in docstrings and comparing the results against the expected output. PyUnit, contributed by Steve Purcell, is a unit testing framework inspired by JUnit, which was in turn an adaptation of Kent Beck's Smalltalk testing framework. See http://pyunit.sourceforge.net/ for more information about PyUnit.
uk: До стандартної бібліотеки додано два різних модулі для модульного тестування. Модуль :mod:`doctest`, наданий Тімом Пітерсом, надає структуру тестування, засновану на виконанні вбудованих прикладів у рядки документів і порівняння результатів із очікуваним результатом. PyUnit, наданий Стівом Перселлом, — це фреймворк модульного тестування, натхненний JUnit, який, у свою чергу, був адаптацією фреймворку тестування Smalltalk Кента Бека. Перегляньте http://pyunit.sourceforge.net/ для отримання додаткової інформації про PyUnit.

source: The :mod:`difflib` module contains a class, :class:`SequenceMatcher`, which compares two sequences and computes the changes required to transform one sequence into the other. For example, this module can be used to write a tool similar to the Unix :program:`diff` program, and in fact the sample program :file:`Tools/scripts/ndiff.py` demonstrates how to write such a script.
uk: Модуль :mod:`difflib` містить клас :class:`SequenceMatcher`, який порівнює дві послідовності та обчислює зміни, необхідні для перетворення однієї послідовності в іншу. Наприклад, цей модуль можна використовувати для написання інструменту, подібного до програми Unix :program:`diff`, і фактично приклад програми :file:`Tools/scripts/ndiff.py` демонструє, як написати такий сценарій.
