Repository: python/python-docs-uk
Catalog: whatsnew/2.1.po
Languages: uk

source: What's New in Python 2.1
uk: Що нового в Python 2.1

source: Author
uk: Автор

source: Introduction
uk: вступ

source: This article explains the new features in Python 2.1. While there aren't as many changes in 2.1 as there were in Python 2.0, there are still some pleasant surprises in store. 2.1 is the first release to be steered through the use of Python Enhancement Proposals, or PEPs, so most of the sizable changes have accompanying PEPs that provide more complete documentation and a design rationale for the change. This article doesn't attempt to document the new features completely, but simply provides an overview of the new features for Python programmers. Refer to the Python 2.1 documentation, or to the specific PEP, for more details about any new feature that particularly interests you.
uk: У цій статті пояснюються нові функції Python 2.1. Хоча у версії 2.1 не так багато змін, як у Python 2.0, все ж є деякі приємні сюрпризи. 2.1 є першим випуском, який керується використанням Python Enhancement Proposals або PEP, тому більшість значних змін супроводжуються PEP, які надають більш повну документацію та обґрунтування зміни. Ця стаття не намагається повністю задокументувати нові функції, а просто надає огляд нових функцій для програмістів Python. Зверніться до документації Python 2.1 або до конкретного PEP, щоб дізнатися більше про будь-яку нову функцію, яка вас особливо цікавить.

source: One recent goal of the Python development team has been to accelerate the pace of new releases, with a new release coming every 6 to 9 months. 2.1 is the first release to come out at this faster pace, with the first alpha appearing in January, 3 months after the final version of 2.0 was released.
uk: Одна з нещодавніх цілей команди розробників Python полягала в тому, щоб пришвидшити темп випуску нових випусків, причому новий випуск виходить кожні 6-9 місяців. 2.1 є першим випуском, який вийшов таким швидким темпом, з першою альфа-версією, яка з’явилася в січні, через 3 місяці після виходу остаточної версії 2.0.

source: The final release of Python 2.1 was made on April 17, 2001.
uk: Остаточний випуск Python 2.1 був зроблений 17 квітня 2001 року.

source: PEP 227: Nested Scopes
uk: PEP 227: Вкладені області

source: The largest change in Python 2.1 is to Python's scoping rules. In Python 2.0, at any given time there are at most three namespaces used to look up variable names: local, module-level, and the built-in namespace. This often surprised people because it didn't match their intuitive expectations. For example, a nested recursive function definition doesn't work::
uk: Найбільша зміна в Python 2.1 стосується правил визначення області видимості Python. У Python 2.0 у будь-який момент часу існує щонайбільше три простори імен, які використовуються для пошуку імен змінних: локальний, на рівні модуля та вбудований простір імен. Це часто дивувало людей, оскільки не відповідало їхнім інтуїтивним очікуванням. Наприклад, визначення вкладеної рекурсивної функції не працює:

source: The function :func:`g` will always raise a :exc:`NameError` exception, because the binding of the name ``g`` isn't in either its local namespace or in the module-level namespace. This isn't much of a problem in practice (how often do you recursively define interior functions like this?), but this also made using the :keyword:`lambda` expression clumsier, and this was a problem in practice. In code which uses :keyword:`lambda` you can often find local variables being copied by passing them as the default values of arguments. ::
uk: Функція :func:`g` завжди викличе виняток :exc:`NameError`, оскільки прив’язка імені ``g`` не знаходиться ні в його локальному просторі імен, ні в просторі імен на рівні модуля. Це не є великою проблемою на практиці (як часто ви рекурсивно визначаєте такі внутрішні функції?), але це також робило використання виразу :keyword:`lambda` більш незграбним, і це було проблемою на практиці. У коді, який використовує :keyword:`lambda`, ви часто можете знайти локальні змінні, які копіюються, передаючи їх як стандартні значення аргументів. ::

source: The readability of Python code written in a strongly functional style suffers greatly as a result.
uk: У результаті цього значно погіршується читабельність коду Python, написаного у сильно функціональному стилі.

source: The most significant change to Python 2.1 is that static scoping has been added to the language to fix this problem. As a first effect, the ``name=name`` default argument is now unnecessary in the above example. Put simply, when a given variable name is not assigned a value within a function (by an assignment, or the :keyword:`def`, :keyword:`class`, or :keyword:`import` statements), references to the variable will be looked up in the local namespace of the enclosing scope. A more detailed explanation of the rules, and a dissection of the implementation, can be found in the PEP.
uk: Найсуттєвіша зміна Python 2.1 полягає в тому, що для вирішення цієї проблеми до мови додано статичне визначення області видимості. Як перший ефект, аргумент за замовчуванням ``name=name`` тепер непотрібний у наведеному вище прикладі. Простіше кажучи, коли заданому імені змінної не присвоєно значення у функції (за допомогою призначення або операторів :keyword:`def`, :keyword:`class` або :keyword:`import`), посилання на змінна буде шукатися в локальному просторі імен охоплюючої області. Більш детальне пояснення правил і опис реалізації можна знайти в PEP.

source: This change may cause some compatibility problems for code where the same variable name is used both at the module level and as a local variable within a function that contains further function definitions. This seems rather unlikely though, since such code would have been pretty confusing to read in the first place.
uk: Ця зміна може спричинити деякі проблеми сумісності для коду, де те саме ім’я змінної використовується як на рівні модуля, так і як локальна змінна у функції, яка містить додаткові визначення функцій. Це здається малоймовірним, оскільки такий код було б досить заплутаним для читання.

source: One side effect of the change is that the ``from module import *`` and ``exec`` statements have been made illegal inside a function scope under certain conditions. The Python reference manual has said all along that ``from module import *`` is only legal at the top level of a module, but the CPython interpreter has never enforced this before. As part of the implementation of nested scopes, the compiler which turns Python source into bytecodes has to generate different code to access variables in a containing scope. ``from module import *`` and ``exec`` make it impossible for the compiler to figure this out, because they add names to the local namespace that are unknowable at compile time. Therefore, if a function contains function definitions or :keyword:`lambda` expressions with free variables, the compiler will flag this by raising a :exc:`SyntaxError` exception.
uk: Одним із побічних ефектів змін є те, що оператори ``from module import *`` і ``exec`` були зроблені незаконними в межах функції за певних умов. У довідковому посібнику Python весь час говорилося, що ``from module import *`` допустимо лише на верхньому рівні модуля, але інтерпретатор CPython ніколи раніше не виконував цього. Як частина реалізації вкладених областей, компілятор, який перетворює джерело Python на байт-коди, має згенерувати інший код для доступу до змінних у місткій області. ``from module import *`` і ``exec`` не дозволяють компілятору це зрозуміти, оскільки вони додають імена до локального простору імен, які невідомі під час компіляції. Таким чином, якщо функція містить визначення функції або :keyword:`lambda` вирази з вільними змінними, компілятор позначить це, викликавши виняток :exc:`SyntaxError`.

source: To make the preceding explanation a bit clearer, here's an example::
uk: Щоб зробити попереднє пояснення трохи зрозумілішим, ось приклад::

source: Line 4 containing the ``exec`` statement is a syntax error, since ``exec`` would define a new local variable named ``x`` whose value should be accessed by :func:`g`.
uk: Рядок 4, що містить інструкцію ``exec``, є синтаксичною помилкою, оскільки ``exec`` визначатиме нову локальну змінну з назвою ``x``, до значення якої має отримати доступ :func:`g`.

source: This shouldn't be much of a limitation, since ``exec`` is rarely used in most Python code (and when it is used, it's often a sign of a poor design anyway).
uk: Це не повинно бути великим обмеженням, оскільки ``exec`` рідко використовується в більшості коду Python (і коли він використовується, це часто свідчить про поганий дизайн).

source: Compatibility concerns have led to nested scopes being introduced gradually; in Python 2.1, they aren't enabled by default, but can be turned on within a module by using a future statement as described in :pep:`236`. (See the following section for further discussion of :pep:`236`.) In Python 2.2, nested scopes will become the default and there will be no way to turn them off, but users will have had all of 2.1's lifetime to fix any breakage resulting from their introduction.
uk: Занепокоєння щодо сумісності призвело до поступового впровадження вкладених областей; у Python 2.1 вони не ввімкнені за замовчуванням, але їх можна ввімкнути в модулі за допомогою оператора future, як описано в :pep:`236`. (Див. наступний розділ для подальшого обговорення :pep:`236`.) У Python 2.2 вкладені області стануть типовими, і не буде можливості їх вимкнути, але користувачі матимуть весь час життя 2.1, щоб усунути будь-яку поломку внаслідок їх введення.

source: :pep:`227` - Statically Nested Scopes
uk: :pep:`227` - Статично вкладені області

source: Written and implemented by Jeremy Hylton.
uk: Написаний і реалізований Джеремі Гілтоном.

source: PEP 236: __future__ Directives
uk: PEP 236: директиви __future__

source: The reaction to nested scopes was widespread concern about the dangers of breaking code with the 2.1 release, and it was strong enough to make the Pythoneers take a more conservative approach. This approach consists of introducing a convention for enabling optional functionality in release N that will become compulsory in release N+1.
uk: Реакцією на вкладені області було широко поширене занепокоєння щодо небезпеки злому коду з випуском 2.1, і воно було досить сильним, щоб змусити Pythoneers застосувати більш консервативний підхід. Цей підхід полягає у введенні угоди про ввімкнення додаткової функціональності у випуску N, який стане обов’язковим у випуску N+1.

source: The syntax uses a ``from...import`` statement using the reserved module name :mod:`__future__`. Nested scopes can be enabled by the following statement::
uk: Синтаксис використовує оператор ``from...import`` із використанням зарезервованої назви модуля :mod:`__future__`. Вкладені області можна активувати наступним оператором::

source: While it looks like a normal :keyword:`import` statement, it's not; there are strict rules on where such a future statement can be put. They can only be at the top of a module, and must precede any Python code or regular :keyword:`!import` statements. This is because such statements can affect how the Python bytecode compiler parses code and generates bytecode, so they must precede any statement that will result in bytecodes being produced.
uk: Хоча це виглядає як звичайний оператор :keyword:`import`, це не так; існують суворі правила щодо того, де можна розмістити таку майбутню заяву. Вони можуть бути лише у верхній частині модуля та повинні передувати будь-якому коду Python або звичайним операторам :keyword:`!import`. Це тому, що такі оператори можуть впливати на те, як компілятор байт-коду Python аналізує код і генерує байт-код, тому вони повинні передувати будь-якому оператору, який призведе до створення байт-кодів.

source: :pep:`236` - Back to the :mod:`__future__`
uk: :pep:`236` - Назад у :mod:`__future__`

source: Written by Tim Peters, and primarily implemented by Jeremy Hylton.
uk: Написаний Тімом Пітерсом, а в основному реалізований Джеремі Гілтоном.

source: PEP 207: Rich Comparisons
uk: PEP 207: багаті порівняння

source: In earlier versions, Python's support for implementing comparisons on user-defined classes and extension types was quite simple. Classes could implement a :meth:`__cmp__` method that was given two instances of a class, and could only return 0 if they were equal or +1 or -1 if they weren't; the method couldn't raise an exception or return anything other than a Boolean value. Users of Numeric Python often found this model too weak and restrictive, because in the number-crunching programs that numeric Python is used for, it would be more useful to be able to perform elementwise comparisons of two matrices, returning a matrix containing the results of a given comparison for each element. If the two matrices are of different sizes, then the compare has to be able to raise an exception to signal the error.
uk: У попередніх версіях підтримка Python для реалізації порівнянь визначених користувачем класів і типів розширень була досить простою. Класи можуть реалізовувати метод :meth:`__cmp__`, який отримує два екземпляри класу, і може повертати лише 0, якщо вони рівні, або +1 або -1, якщо вони не були; метод не міг викликати виняток або повертати нічого, окрім логічного значення. Користувачі числового Python часто вважали цю модель занадто слабкою та обмежувальною, тому що в програмах для обробки чисел, для яких використовується числовий Python, було б корисніше мати можливість виконувати поелементне порівняння двох матриць, повертаючи матрицю, що містить результати дане порівняння для кожного елемента. Якщо дві матриці мають різні розміри, тоді порівняння має мати можливість викликати виняток, щоб сигналізувати про помилку.

source: In Python 2.1, rich comparisons were added in order to support this need. Python classes can now individually overload each of the ``<``, ``<=``, ``>``, ``>=``, ``==``, and ``!=`` operations. The new magic method names are:
uk: У Python 2.1 для підтримки цієї потреби було додано розширені порівняння. Класи Python тепер можуть окремо перевантажувати кожну з операцій ``<``, ``<=``, ``>``, ``>=``, ``==`` і ``!=``. Назви нових магічних методів:

source: Operation
uk: Операція

source: Method name
uk: Назва методу

source: (The magic methods are named after the corresponding Fortran operators ``.LT.``. ``.LE.``, &c. Numeric programmers are almost certainly quite familiar with these names and will find them easy to remember.)
uk: (Чарівні методи названо на честь відповідних операторів Fortran ``.LT.``. ``.LE.`` тощо. Цифрові програмісти майже напевно добре знайомі з цими назвами та легко їх запам’ятають.)

source: Each of these magic methods is of the form ``method(self, other)``, where ``self`` will be the object on the left-hand side of the operator, while ``other`` will be the object on the right-hand side. For example, the expression ``A < B`` will cause ``A.__lt__(B)`` to be called.
uk: Кожен із цих чарівних методів має форму ``method(self, other)``, де ``self`` буде об’єктом ліворуч від оператора, а ``other`` буде об’єктом з правого боку. Наприклад, вираз ``A < B`` призведе до виклику ``A.__lt__(B)``.

source: Each of these magic methods can return anything at all: a Boolean, a matrix, a list, or any other Python object. Alternatively they can raise an exception if the comparison is impossible, inconsistent, or otherwise meaningless.
uk: Кожен із цих магічних методів може повернути будь-що: логічне значення, матрицю, список або будь-який інший об’єкт Python. Крім того, вони можуть викликати виняток, якщо порівняння є неможливим, непослідовним або іншим чином безглуздим.

source: The built-in ``cmp(A,B)`` function can use the rich comparison machinery, and now accepts an optional argument specifying which comparison operation to use; this is given as one of the strings ``"<"``, ``"<="``, ``">"``, ``">="``, ``"=="``, or ``"!="``. If called without the optional third argument, :func:`cmp` will only return -1, 0, or +1 as in previous versions of Python; otherwise it will call the appropriate method and can return any Python object.
uk: Вбудована функція ``cmp(A,B)`` може використовувати механізм розширеного порівняння та тепер приймає необов’язковий аргумент, який визначає, яку операцію порівняння використовувати; це надається як один із рядків ``" <"``, ``"<="``, ``"> "``, ``">="``, ``"=="`` або ``"!="``. Якщо викликати без додаткового третього аргументу, :func:`cmp` поверне лише -1, 0 або +1, як у попередніх версіях Python; інакше він викличе відповідний метод і може повернути будь-який об’єкт Python.

source: There are also corresponding changes of interest to C programmers; there's a new slot ``tp_richcmp`` in type objects and an API for performing a given rich comparison. I won't cover the C API here, but will refer you to :pep:`207`, or to 2.1's C API documentation, for the full list of related functions.
uk: Є також відповідні зміни, які цікавлять програмістів на C; є новий слот ``tp_richcmp`` в об’єктах типу та API для виконання певного розширеного порівняння. Я не буду тут розповідати про C API, але відсилаю вас до :pep:`207` або до документації C API 2.1, щоб отримати повний список пов’язаних функцій.

source: :pep:`207` - Rich Comparisons
uk: :pep:`207` - багаті порівняння

source: Written by Guido van Rossum, heavily based on earlier work by David Ascher, and implemented by Guido van Rossum.
uk: Написаний Гвідо ван Россумом, значною мірою заснований на попередніх роботах Девіда Ашера та реалізований Гвідо ван Россумом.

source: PEP 230: Warning Framework
uk: PEP 230: Попередження

source: Over its 10 years of existence, Python has accumulated a certain number of obsolete modules and features along the way. It's difficult to know when a feature is safe to remove, since there's no way of knowing how much code uses it --- perhaps no programs depend on the feature, or perhaps many do. To enable removing old features in a more structured way, a warning framework was added. When the Python developers want to get rid of a feature, it will first trigger a warning in the next version of Python. The following Python version can then drop the feature, and users will have had a full release cycle to remove uses of the old feature.
uk: За 10 років існування Python накопичив певну кількість застарілих модулів і функцій. Важко визначити, коли функцію безпечно видалити, оскільки неможливо дізнатися, скільки коду її використовує --- можливо, жодна програма не залежить від функції, або, можливо, багато хто залежить від цієї функції. Щоб уможливити видалення старих функцій у більш структурований спосіб, було додано рамку попереджень. Коли розробники Python хочуть позбутися функції, це спочатку викличе попередження в наступній версії Python. Наступна версія Python може відмовитися від цієї функції, і користувачі матимуть повний цикл випуску, щоб усунути використання старої функції.

source: Python 2.1 adds the warning framework to be used in this scheme. It adds a :mod:`warnings` module that provide functions to issue warnings, and to filter out warnings that you don't want to be displayed. Third-party modules can also use this framework to deprecate old features that they no longer wish to support.
uk: Python 2.1 додає структуру попереджень для використання в цій схемі. Він додає модуль :mod:`warnings`, який надає функції для видачі попереджень і для фільтрації попереджень, які ви не бажаєте відображати. Сторонні модулі також можуть використовувати цю структуру, щоб відмовитися від старих функцій, які вони більше не хочуть підтримувати.

source: For example, in Python 2.1 the :mod:`regex` module is deprecated, so importing it causes a warning to be printed::
uk: Наприклад, у Python 2.1 модуль :mod:`regex` є застарілим, тому його імпортування призводить до друку попередження::

source: Warnings can be issued by calling the :func:`warnings.warn` function::
uk: Попередження можна видати, викликавши функцію :func:`warnings.warn`::

source: The first parameter is the warning message; an additional optional parameters can be used to specify a particular warning category.
uk: Перший параметр – це попереджувальне повідомлення; додаткові необов'язкові параметри можуть використовуватися для визначення певної категорії попередження.

source: Filters can be added to disable certain warnings; a regular expression pattern can be applied to the message or to the module name in order to suppress a warning. For example, you may have a program that uses the :mod:`regex` module and not want to spare the time to convert it to use the :mod:`re` module right now. The warning can be suppressed by calling ::
uk: Можна додати фільтри, щоб вимкнути певні попередження; шаблон регулярного виразу можна застосувати до повідомлення або до назви модуля, щоб придушити попередження. Наприклад, у вас може бути програма, яка використовує модуль :mod:`regex`, і ви не хочете витрачати час на перетворення її на використання модуля :mod:`re` прямо зараз. Попередження можна придушити викликом ::

source: This adds a filter that will apply only to warnings of the class :class:`DeprecationWarning` triggered in the :mod:`__main__` module, and applies a regular expression to only match the message about the :mod:`regex` module being deprecated, and will cause such warnings to be ignored. Warnings can also be printed only once, printed every time the offending code is executed, or turned into exceptions that will cause the program to stop (unless the exceptions are caught in the usual way, of course).
uk: Це додає фільтр, який застосовуватиметься лише до попереджень класу :class:`DeprecationWarning`, ініційованих у модулі :mod:`__main__`, і застосовує регулярний вираз, щоб відповідати лише повідомленню про наявність модуля :mod:`regex` не підтримується, і такі попередження ігноруватимуться. Попередження також можна друкувати лише один раз, друкувати кожного разу, коли виконується код-порушник, або перетворювати на винятки, які призведуть до зупинки програми (звичайно, якщо винятки не перехоплюються звичайним способом).

source: Functions were also added to Python's C API for issuing warnings; refer to PEP 230 or to Python's API documentation for the details.
uk: До API C Python також додано функції для видачі попереджень; подробиці зверніться до PEP 230 або до документації Python API.

source: :pep:`5` - Guidelines for Language Evolution
uk: :pep:`5` - Рекомендації щодо розвитку мови

source: Written by Paul Prescod, to specify procedures to be followed when removing old features from Python. The policy described in this PEP hasn't been officially adopted, but the eventual policy probably won't be too different from Prescod's proposal.
uk: Написав Пол Прескод, щоб визначити процедури, яких слід дотримуватися під час видалення старих функцій з Python. Політика, описана в цьому PEP, не була офіційно прийнята, але остаточна політика, ймовірно, не надто відрізнятиметься від пропозиції Prescod.

source: :pep:`230` - Warning Framework
uk: :pep:`230` - Рамка попереджень

source: Written and implemented by Guido van Rossum.
uk: Написаний і реалізований Гвідо ван Россумом.

source: PEP 229: New Build System
uk: PEP 229: Нова система побудови
