Repository: python/python-docs-uk
Catalog: whatsnew/2.2.po
Languages: uk

source: The :mod:`xmlrpclib` module was contributed to the standard library by Fredrik Lundh, providing support for writing XML-RPC clients. XML-RPC is a simple remote procedure call protocol built on top of HTTP and XML. For example, the following snippet retrieves a list of RSS channels from the O'Reilly Network, and then lists the recent headlines for one channel::
uk: Модуль :mod:`xmlrpclib` був доданий до стандартної бібліотеки Фредріком Лундом, надаючи підтримку для написання клієнтів XML-RPC. XML-RPC — це простий протокол віддаленого виклику процедури, створений на основі HTTP і XML. Наприклад, наведений нижче фрагмент отримує список каналів RSS із мережі O'Reilly, а потім перераховує останні заголовки для одного каналу:

source: The :mod:`SimpleXMLRPCServer` module makes it easy to create straightforward XML-RPC servers. See http://xmlrpc.scripting.com/ for more information about XML-RPC.
uk: Модуль :mod:`SimpleXMLRPCServer` дозволяє легко створювати прості сервери XML-RPC. Перегляньте http://xmlrpc.scripting.com/ для отримання додаткової інформації про XML-RPC.

source: The new :mod:`hmac` module implements the HMAC algorithm described by :rfc:`2104`. (Contributed by Gerhard Häring.)
uk: Новий модуль :mod:`hmac` реалізує алгоритм HMAC, описаний :rfc:`2104`. (Надав Герхард Херінг.)

source: Several functions that originally returned lengthy tuples now return pseudo-sequences that still behave like tuples but also have mnemonic attributes such as memberst_mtime or :attr:`tm_year`. The enhanced functions include :func:`stat`, :func:`fstat`, :func:`statvfs`, and :func:`fstatvfs` in the :mod:`os` module, and :func:`localtime`, :func:`gmtime`, and :func:`strptime` in the :mod:`time` module.
uk: Кілька функцій, які спочатку повертали довгі кортежі, тепер повертають псевдопослідовності, які все ще поводяться як кортежі, але також мають мнемонічні атрибути, такі як memberst_mtime або :attr:`tm_year`. До розширених функцій належать :func:`stat`, :func:`fstat`, :func:`statvfs` і :func:`fstatvfs` у модулі :mod:`os`, а також :func:`localtime`, :func:`gmtime` і :func:`strptime` у модулі :mod:`time`.

source: For example, to obtain a file's size using the old tuples, you'd end up writing something like ``file_size = os.stat(filename)[stat.ST_SIZE]``, but now this can be written more clearly as ``file_size = os.stat(filename).st_size``.
uk: Наприклад, щоб отримати розмір файлу за допомогою старих кортежів, вам доведеться написати щось на зразок ``file_size = os.stat(filename)[stat.ST_SIZE]``, але тепер це можна записати більш чітко як ``file_size = os.stat(назва_файлу).st_size``.

source: The original patch for this feature was contributed by Nick Mathewson.
uk: Оригінальний патч для цієї функції надав Нік Метьюсон.

source: The Python profiler has been extensively reworked and various errors in its output have been corrected. (Contributed by Fred L. Drake, Jr. and Tim Peters.)
uk: Профайлер Python було значно перероблено та виправлено різні помилки в його виводі. (Надано Фредом Л. Дрейком молодшим і Тімом Пітерсом.)

source: The :mod:`socket` module can be compiled to support IPv6; specify the :option:`!--enable-ipv6` option to Python's configure script. (Contributed by Jun-ichiro "itojun" Hagino.)
uk: Модуль :mod:`socket` можна скомпільувати для підтримки IPv6; вкажіть параметр :option:`!--enable-ipv6` для сценарію налаштування Python. (Надав Дзюн-ічіро "ітоджун" Хагіно.)

source: Two new format characters were added to the :mod:`struct` module for 64-bit integers on platforms that support the C :c:type:`long long` type. ``q`` is for a signed 64-bit integer, and ``Q`` is for an unsigned one. The value is returned in Python's long integer type. (Contributed by Tim Peters.)
uk: До модуля :mod:`struct` додано два нові символи формату для 64-розрядних цілих чисел на платформах, які підтримують тип C :c:type:`long long`. ``q`` для 64-розрядного цілого числа зі знаком, а ``Q`` для беззнакового. Значення повертається в типі довгого цілого числа Python. (Надав Тім Пітерс.)

source: In the interpreter's interactive mode, there's a new built-in function :func:`help` that uses the :mod:`pydoc` module introduced in Python 2.1 to provide interactive help. ``help(object)`` displays any available help text about *object*. :func:`help` with no argument puts you in an online help utility, where you can enter the names of functions, classes, or modules to read their help text. (Contributed by Guido van Rossum, using Ka-Ping Yee's :mod:`pydoc` module.)
uk: В інтерактивному режимі інтерпретатора є нова вбудована функція :func:`help`, яка використовує модуль :mod:`pydoc`, представлений у Python 2.1, для надання інтерактивної довідки. ``help(object)`` відображає будь-який доступний текст довідки про *object*. :func:`help` без аргументу передає вас до утиліти онлайн-довідки, де ви можете вводити назви функцій, класів або модулів, щоб прочитати їхній текст довідки. (Надано Гвідо ван Россумом, використовуючи модуль Ka-Ping Yee :mod:`pydoc`.)

source: Various bugfixes and performance improvements have been made to the SRE engine underlying the :mod:`re` module. For example, the :func:`re.sub` and :func:`re.split` functions have been rewritten in C. Another contributed patch speeds up certain Unicode character ranges by a factor of two, and a new :meth:`finditer` method that returns an iterator over all the non-overlapping matches in a given string. (SRE is maintained by Fredrik Lundh. The BIGCHARSET patch was contributed by Martin von Löwis.)
uk: У механізмі SRE, що лежить в основі модуля :mod:`re`, було зроблено різні виправлення помилок і покращено продуктивність. Наприклад, функції :func:`re.sub` і :func:`re.split` було переписано мовою C. Інший патч пришвидшує певні діапазони символів Юнікоду в два рази, а також новий :meth:`метод finditer`, який повертає ітератор для всіх неперекриваючих збігів у заданому рядку. (SRE підтримує Фредрік Лунд. Патч BIGCHARSET надав Мартін фон Льовіс.)

source: The :mod:`smtplib` module now supports :rfc:`2487`, "Secure SMTP over TLS", so it's now possible to encrypt the SMTP traffic between a Python program and the mail transport agent being handed a message. :mod:`smtplib` also supports SMTP authentication. (Contributed by Gerhard Häring.)
uk: Модуль :mod:`smtplib` тепер підтримує :rfc:`2487`, "Безпечний SMTP через TLS", тому тепер можна шифрувати SMTP-трафік між програмою Python і агентом транспортування пошти, якому передається повідомлення. :mod:`smtplib` також підтримує аутентифікацію SMTP. (Надав Герхард Херінг.)

source: The :mod:`imaplib` module, maintained by Piers Lauder, has support for several new extensions: the NAMESPACE extension defined in :rfc:`2342`, SORT, GETACL and SETACL. (Contributed by Anthony Baxter and Michel Pelletier.)
uk: Модуль :mod:`imaplib`, який підтримує Пірс Лаудер, підтримує кілька нових розширень: розширення NAMESPACE, визначене в :rfc:`2342`, SORT, GETACL і SETACL. (Надано Ентоні Бакстером і Мішелем Пеллетьє.)

source: The :mod:`rfc822` module's parsing of email addresses is now compliant with :rfc:`2822`, an update to :rfc:`822`. (The module's name is *not* going to be changed to ``rfc2822``.) A new package, :mod:`email`, has also been added for parsing and generating e-mail messages. (Contributed by Barry Warsaw, and arising out of his work on Mailman.)
uk: Аналіз адрес електронної пошти модулем :mod:`rfc822` тепер сумісний з :rfc:`2822`, оновленням до :rfc:`822`. (Ім’я модуля *не* буде змінено на ``rfc2822``.) Новий пакет, :mod:`email`, також було додано для аналізу та генерування повідомлень електронної пошти. (Надано Баррі Варшау, що є результатом його роботи над Mailman.)

source: The :mod:`difflib` module now contains a new :class:`Differ` class for producing human-readable lists of changes (a "delta") between two sequences of lines of text. There are also two generator functions, :func:`ndiff` and :func:`restore`, which respectively return a delta from two sequences, or one of the original sequences from a delta. (Grunt work contributed by David Goodger, from ndiff.py code by Tim Peters who then did the generatorization.)
uk: Модуль :mod:`difflib` тепер містить новий клас :class:`Differ` для створення зрозумілих людині списків змін ("дельта") між двома послідовностями рядків тексту. Є також дві функції-генератори, :func:`ndiff` і :func:`restore`, які відповідно повертають дельту з двох послідовностей або одну з оригінальних послідовностей з дельти. (Роботу Grunt вніс Девід Гуджер, з коду ndiff.py Тім Пітерс, який потім виконав генерацію.)

source: New constants :const:`ascii_letters`, :const:`ascii_lowercase`, and :const:`ascii_uppercase` were added to the :mod:`string` module. There were several modules in the standard library that used :const:`string.letters` to mean the ranges A-Za-z, but that assumption is incorrect when locales are in use, because :const:`string.letters` varies depending on the set of legal characters defined by the current locale. The buggy modules have all been fixed to use :const:`ascii_letters` instead. (Reported by an unknown person; fixed by Fred L. Drake, Jr.)
uk: Нові константи :const:`ascii_letters`, :const:`ascii_lowercase` і :const:`ascii_uppercase` додано до модуля :mod:`string`. У стандартній бібліотеці було кілька модулів, які використовували :const:`string.letters` для позначення діапазонів A-Za-z, але це припущення є неправильним, коли використовуються локалі, оскільки :const:`string.letters` змінюється залежно від на наборі юридичних символів, визначених поточною локалізацією. У всіх модулях із помилками було виправлено використання :const:`ascii_letters`. (Повідомлено невідомою особою; виправлено Фредом Л. Дрейком-молодшим)

source: The :mod:`mimetypes` module now makes it easier to use alternative MIME-type databases by the addition of a :class:`MimeTypes` class, which takes a list of filenames to be parsed. (Contributed by Fred L. Drake, Jr.)
uk: Модуль :mod:`mimetypes` тепер полегшує використання альтернативних баз даних типу MIME завдяки доданню класу :class:`MimeTypes`, який приймає список імен файлів для аналізу. (Надав Фред Л. Дрейк-молодший)

source: A :class:`Timer` class was added to the :mod:`threading` module that allows scheduling an activity to happen at some future time. (Contributed by Itamar Shtull-Trauring.)
uk: До модуля :mod:`threading` було додано клас :class:`Timer`, який дозволяє планувати виконання активності в майбутньому. (Надав Ітамар Штул-Траурінг.)

source: Interpreter Changes and Fixes
uk: Зміни та виправлення перекладача

source: Some of the changes only affect people who deal with the Python interpreter at the C level because they're writing Python extension modules, embedding the interpreter, or just hacking on the interpreter itself. If you only write Python code, none of the changes described here will affect you very much.
uk: Деякі зміни стосуються лише тих, хто має справу з інтерпретатором Python на рівні C, оскільки вони пишуть модулі розширення Python, вбудовують інтерпретатор або просто зламують сам інтерпретатор. Якщо ви пишете лише код на Python, жодна з описаних тут змін не вплине на вас.

source: Profiling and tracing functions can now be implemented in C, which can operate at much higher speeds than Python-based functions and should reduce the overhead of profiling and tracing. This will be of interest to authors of development environments for Python. Two new C functions were added to Python's API, :c:func:`PyEval_SetProfile` and :c:func:`PyEval_SetTrace`. The existing :func:`sys.setprofile` and :func:`sys.settrace` functions still exist, and have simply been changed to use the new C-level interface. (Contributed by Fred L. Drake, Jr.)
uk: Функції профілювання та трасування тепер можна реалізувати в C, який може працювати на набагато вищій швидкості, ніж функції на основі Python, і має зменшити накладні витрати на профілювання та трасування. Це буде цікаво авторам середовищ розробки для Python. До API Python додано дві нові функції C: :c:func:`PyEval_SetProfile` і :c:func:`PyEval_SetTrace`. Існуючі функції :func:`sys.setprofile` і :func:`sys.settrace` все ще існують, і їх просто змінено для використання нового інтерфейсу рівня C. (Надав Фред Л. Дрейк-молодший)

source: Another low-level API, primarily of interest to implementors of Python debuggers and development tools, was added. :c:func:`PyInterpreterState_Head` and :c:func:`PyInterpreterState_Next` let a caller walk through all the existing interpreter objects; :c:func:`PyInterpreterState_ThreadHead` and :c:func:`PyThreadState_Next` allow looping over all the thread states for a given interpreter. (Contributed by David Beazley.)
uk: Було додано ще один низькорівневий API, який в першу чергу цікавить розробників налагоджувачів Python та інструментів розробки. :c:func:`PyInterpreterState_Head` і :c:func:`PyInterpreterState_Next` дозволяють абоненту пройти через усі існуючі об’єкти інтерпретатора; :c:func:`PyInterpreterState_ThreadHead` і :c:func:`PyThreadState_Next` дозволяють циклічно переглядати всі стани потоку для певного інтерпретатора. (Надав Девід Бізлі.)

source: The C-level interface to the garbage collector has been changed to make it easier to write extension types that support garbage collection and to debug misuses of the functions. Various functions have slightly different semantics, so a bunch of functions had to be renamed. Extensions that use the old API will still compile but will *not* participate in garbage collection, so updating them for 2.2 should be considered fairly high priority.
uk: Інтерфейс рівня C для збирача сміття було змінено, щоб полегшити написання типів розширень, які підтримують збирання сміття, і налагодити неправильне використання функцій. Різні функції мають дещо різну семантику, тому купу функцій довелося перейменувати. Розширення, які використовують старий API, все одно будуть компілюватися, але *не* братимуть участь у збиранні сміття, тому їхнє оновлення до 2.2 має вважатися досить пріоритетним.

source: To upgrade an extension module to the new API, perform the following steps:
uk: Щоб оновити модуль розширення до нового API, виконайте такі дії:

source: Rename :c:func:`Py_TPFLAGS_GC` to :c:func:`PyTPFLAGS_HAVE_GC`.
uk: Перейменуйте :c:func:`Py_TPFLAGS_GC` на :c:func:`PyTPFLAGS_HAVE_GC`.

source: Use :c:func:`PyObject_GC_New` or :c:func:`PyObject_GC_NewVar` to allocate
uk: Використовуйте :c:func:`PyObject_GC_New` або :c:func:`PyObject_GC_NewVar` для виділення

source: objects, and :c:func:`PyObject_GC_Del` to deallocate them.
uk: об’єктів і :c:func:`PyObject_GC_Del`, щоб звільнити їх.

source: Rename :c:func:`PyObject_GC_Init` to :c:func:`PyObject_GC_Track` and
uk: Перейменуйте :c:func:`PyObject_GC_Init` на :c:func:`PyObject_GC_Track` і

source: :c:func:`PyObject_GC_Fini` to :c:func:`PyObject_GC_UnTrack`.
uk: :c:func:`PyObject_GC_Fini` до :c:func:`PyObject_GC_UnTrack`.

source: Remove :c:func:`PyGC_HEAD_SIZE` from object size calculations.
uk: Видалити :c:func:`PyGC_HEAD_SIZE` з обчислень розміру об’єкта.

source: Remove calls to :c:func:`PyObject_AS_GC` and :c:func:`PyObject_FROM_GC`.
uk: Видаліть виклики :c:func:`PyObject_AS_GC` і :c:func:`PyObject_FROM_GC`.

source: A new ``et`` format sequence was added to :c:func:`PyArg_ParseTuple`; ``et`` takes both a parameter and an encoding name, and converts the parameter to the given encoding if the parameter turns out to be a Unicode string, or leaves it alone if it's an 8-bit string, assuming it to already be in the desired encoding. This differs from the ``es`` format character, which assumes that 8-bit strings are in Python's default ASCII encoding and converts them to the specified new encoding. (Contributed by M.-A. Lemburg, and used for the MBCS support on Windows described in the following section.)
uk: Нову послідовність формату ``et`` додано до :c:func:`PyArg_ParseTuple`; ``et`` приймає як параметр, так і ім’я кодування та перетворює параметр у вказане кодування, якщо параметр виявляється рядком Юнікоду, або залишає його в спокої, якщо це 8-бітовий рядок, припускаючи, що він уже є у потрібному кодуванні. Це відрізняється від символу формату ``es``, який припускає, що 8-бітні рядки мають типове кодування ASCII Python, і перетворює їх у вказане нове кодування. (Надано M.-A. Lemburg і використовується для підтримки MBCS у Windows, описаної в наступному розділі.)

source: A different argument parsing function, :c:func:`PyArg_UnpackTuple`, has been added that's simpler and presumably faster. Instead of specifying a format string, the caller simply gives the minimum and maximum number of arguments expected, and a set of pointers to :c:type:`PyObject\*` variables that will be filled in with argument values.
uk: Було додано іншу функцію розбору аргументів, :c:func:`PyArg_UnpackTuple`, яка є простішою та, імовірно, швидшою. Замість того, щоб вказувати рядок формату, виклик просто надає мінімальну та максимальну кількість очікуваних аргументів, а також набір покажчиків на змінні :c:type:`PyObject\*`, які будуть заповнені значеннями аргументів.

source: Two new flags :const:`METH_NOARGS` and :const:`METH_O` are available in method definition tables to simplify implementation of methods with no arguments or a single untyped argument. Calling such methods is more efficient than calling a corresponding method that uses :const:`METH_VARARGS`. Also, the old :const:`METH_OLDARGS` style of writing C methods is now officially deprecated.
uk: Два нові прапорці :const:`METH_NOARGS` і :const:`METH_O` доступні в таблицях визначення методів, щоб спростити реалізацію методів без аргументів або з одним нетиповим аргументом. Виклик таких методів ефективніший, ніж виклик відповідного методу, який використовує :const:`METH_VARARGS`. Крім того, старий :const:`METH_OLDARGS` стиль написання методів C тепер офіційно застарів.

source: Two new wrapper functions, :c:func:`PyOS_snprintf` and :c:func:`PyOS_vsnprintf` were added to provide cross-platform implementations for the relatively new :c:func:`snprintf` and :c:func:`vsnprintf` C lib APIs. In contrast to the standard :c:func:`sprintf` and :c:func:`vsprintf` functions, the Python versions check the bounds of the buffer used to protect against buffer overruns. (Contributed by M.-A. Lemburg.)
uk: Дві нові функції оболонки, :c:func:`PyOS_snprintf` і :c:func:`PyOS_vsnprintf`, були додані, щоб забезпечити кросплатформену реалізацію відносно нових :c:func:`snprintf` і :c:func:`vsnprintf` API C lib. На відміну від стандартних функцій :c:func:`sprintf` і :c:func:`vsprintf`, версії Python перевіряють межі буфера, який використовується для захисту від переповнення буфера. (Уклав М.-А. Лембург.)

source: The :c:func:`_PyTuple_Resize` function has lost an unused parameter, so now it takes 2 parameters instead of 3. The third argument was never used, and can simply be discarded when porting code from earlier versions to Python 2.2.
uk: Функція :c:func:`_PyTuple_Resize` втратила невикористаний параметр, тому тепер вона приймає 2 параметри замість 3. Третій аргумент ніколи не використовувався, і його можна просто відкинути під час перенесення коду з попередніх версій на Python 2.2.

source: Other Changes and Fixes
uk: Інші зміни та виправлення

source: As usual there were a bunch of other improvements and bugfixes scattered throughout the source tree. A search through the CVS change logs finds there were 527 patches applied and 683 bugs fixed between Python 2.1 and 2.2; 2.2.1 applied 139 patches and fixed 143 bugs; 2.2.2 applied 106 patches and fixed 82 bugs. These figures are likely to be underestimates.
uk: Як завжди, було багато інших покращень і виправлень помилок, розкиданих по дереву вихідних кодів. Пошук у журналах змін CVS виявив, що було застосовано 527 патчів і 683 виправлені помилки між Python 2.1 і 2.2; 2.2.1 застосовано 139 патчів і виправлено 143 помилки; 2.2.2 застосовано 106 патчів і виправлено 82 помилки. Ймовірно, ці цифри занижені.

source: Some of the more notable changes are:
uk: Деякі з найбільш помітних змін:

source: The code for the MacOS port for Python, maintained by Jack Jansen, is now kept in the main Python CVS tree, and many changes have been made to support MacOS X.
uk: Код порту MacOS для Python, який підтримує Джек Янсен, тепер зберігається в основному дереві Python CVS, і внесено багато змін для підтримки MacOS X.

source: The most significant change is the ability to build Python as a framework, enabled by supplying the :option:`!--enable-framework` option to the configure script when compiling Python. According to Jack Jansen, "This installs a self-contained Python installation plus the OS X framework "glue" into :file:`/Library/Frameworks/Python.framework` (or another location of choice). For now there is little immediate added benefit to this (actually, there is the disadvantage that you have to change your PATH to be able to find Python), but it is the basis for creating a full-blown Python application, porting the MacPython IDE, possibly using Python as a standard OSA scripting language and much more."
uk: Найсуттєвішою зміною є можливість створювати Python як фреймворк, увімкнений шляхом надання опції :option:`!--enable-framework` до сценарію конфігурації під час компіляції Python. За словами Джека Янсена, "це встановлює самодостатню інсталяцію Python, а також фреймворк OS X "клей" у :file:`/Library/Frameworks/Python.framework` (або в інше розташування). це додаткова перевага (насправді, є недолік, що вам потрібно змінити свій ШЛЯХ, щоб мати змогу знайти Python), але це основа для створення повномасштабної програми Python, портування MacPython IDE, можливо, використання Python як стандартна мова сценаріїв OSA та багато іншого".

source: Most of the MacPython toolbox modules, which interface to MacOS APIs such as windowing, QuickTime, scripting, etc. have been ported to OS X, but they've been left commented out in :file:`setup.py`. People who want to experiment with these modules can uncomment them manually.
uk: Більшість модулів панелі інструментів MacPython, які взаємодіють з API MacOS, такими як вікна, QuickTime, сценарії тощо, було перенесено в OS X, але вони залишилися прокоментованими в :file:`setup.py`. Люди, які хочуть поекспериментувати з цими модулями, можуть розкоментувати їх вручну.

source: Keyword arguments passed to built-in functions that don't take them now cause a :exc:`TypeError` exception to be raised, with the message "*function* takes no keyword arguments".
uk: Аргументи ключових слів, передані вбудованим функціям, які зараз їх не приймають, викликають виняток :exc:`TypeError` із повідомленням "*функція* не приймає аргументів ключового слова".

source: Weak references, added in Python 2.1 as an extension module, are now part of the core because they're used in the implementation of new-style classes. The :exc:`ReferenceError` exception has therefore moved from the :mod:`weakref` module to become a built-in exception.
uk: Слабкі посилання, додані в Python 2.1 як модуль розширення, тепер є частиною ядра, оскільки вони використовуються в реалізації класів нового стилю. Тому виняток :exc:`ReferenceError` переміщено з модуля :mod:`weakref` і став вбудованим винятком.

source: A new script, :file:`Tools/scripts/cleanfuture.py` by Tim Peters, automatically removes obsolete ``__future__`` statements from Python source code.
uk: Новий скрипт, :file:`Tools/scripts/cleanfuture.py` Тіма Пітерса, автоматично видаляє застарілі оператори ``__future__`` з вихідного коду Python.
