Repository: python/python-docs-uk
Catalog: whatsnew/2.2.po
Languages: uk

source: First, ``__getattr__(attr_name)`` is still supported by new-style classes, and nothing about it has changed. As before, it will be called when an attempt is made to access ``obj.foo`` and no attribute named ``foo`` is found in the instance's dictionary.
uk: По-перше, ``__getattr__(attr_name)`` все ще підтримується класами нового стилю, і нічого в ньому не змінилося. Як і раніше, він буде викликаний, коли буде зроблена спроба отримати доступ до ``obj.foo``, а атрибут з назвою ``foo`` не знайдено в словнику примірника.

source: New-style classes also support a new method, ``__getattribute__(attr_name)``. The difference between the two methods is that :meth:`__getattribute__` is *always* called whenever any attribute is accessed, while the old :meth:`__getattr__` is only called if ``foo`` isn't found in the instance's dictionary.
uk: Класи нового стилю також підтримують новий метод, ``__getattribute__(attr_name)``. Різниця між цими двома методами полягає в тому, що :meth:`__getattribute__` *завжди* викликається щоразу, коли здійснюється доступ до будь-якого атрибута, тоді як старий :meth:`__getattr__` викликається, лише якщо ``foo`` не знайдено в екземплярі словник.

source: However, Python 2.2's support for :dfn:`properties` will often be a simpler way to trap attribute references. Writing a :meth:`__getattr__` method is complicated because to avoid recursion you can't use regular attribute accesses inside them, and instead have to mess around with the contents of :attr:`~object.__dict__`. :meth:`__getattr__` methods also end up being called by Python when it checks for other methods such as :meth:`__repr__` or :meth:`__coerce__`, and so have to be written with this in mind. Finally, calling a function on every attribute access results in a sizable performance loss.
uk: Однак підтримка Python 2.2 :dfn:`properties` часто буде простішим способом перехоплення посилань на атрибути. Написання методу :meth:`__getattr__` є складним, тому що, щоб уникнути рекурсії, ви не можете використовувати звичайний доступ до атрибутів усередині них, а натомість вам доведеться возитися з вмістом :attr:`~object.__dict__`. Методи :meth:`__getattr__` також викликаються Python під час перевірки інших методів, таких як :meth:`__repr__` або :meth:`__coerce__`, тому їх потрібно писати з урахуванням цього. Нарешті, виклик функції для кожного доступу до атрибута призводить до значної втрати продуктивності.

source: :class:`property` is a new built-in type that packages up three functions that get, set, or delete an attribute, and a docstring. For example, if you want to define a :attr:`size` attribute that's computed, but also settable, you could write::
uk: :class:`property` — це новий вбудований тип, який містить три функції, які отримують, встановлюють або видаляють атрибут і рядок документації. Наприклад, якщо ви хочете визначити атрибут :attr:`size`, який обчислюється, але також може бути встановлений, ви можете написати::

source: That is certainly clearer and easier to write than a pair of :meth:`__getattr__`/:meth:`__setattr__` methods that check for the :attr:`size` attribute and handle it specially while retrieving all other attributes from the instance's :attr:`~object.__dict__`. Accesses to :attr:`size` are also the only ones which have to perform the work of calling a function, so references to other attributes run at their usual speed.
uk: Це, звичайно, зрозуміліше та простіше для написання, ніж пара методів :meth:`__getattr__`/:meth:`__setattr__`, які перевіряють наявність атрибута :attr:`size` і обробляють його спеціально, одночасно одержуючи всі інші атрибути з екземпляра :attr:`~об’єкт.__dict__`. Доступи до :attr:`size` також є єдиними, які повинні виконувати роботу виклику функції, тому посилання на інші атрибути виконуються зі звичайною швидкістю.

source: Finally, it's possible to constrain the list of attributes that can be referenced on an object using the new :attr:`~object.__slots__` class attribute. Python objects are usually very dynamic; at any time it's possible to define a new attribute on an instance by just doing ``obj.new_attr=1``. A new-style class can define a class attribute named :attr:`~object.__slots__` to limit the legal attributes to a particular set of names. An example will make this clear::
uk: Нарешті, можна обмежити список атрибутів, на які можна посилатися в об’єкті, використовуючи новий атрибут класу :attr:`~object.__slots__`. Об'єкти Python зазвичай дуже динамічні; у будь-який час можна визначити новий атрибут екземпляра, просто виконавши ``obj.new_attr=1``. Клас нового стилю може визначати атрибут класу під назвою :attr:`~object.__slots__`, щоб обмежити допустимі атрибути певним набором імен. Приклад прояснить це:

source: Note how you get an :exc:`AttributeError` on the attempt to assign to an attribute not listed in :attr:`~object.__slots__`.
uk: Зверніть увагу, як ви отримуєте :exc:`AttributeError` під час спроби призначити атрибут, не вказаний у :attr:`~object.__slots__`.

source: Related Links
uk: Пов'язані посилання

source: This section has just been a quick overview of the new features, giving enough of an explanation to start you programming, but many details have been simplified or ignored. Where should you go to get a more complete picture?
uk: Цей розділ був лише коротким оглядом нових можливостей, що дає достатньо пояснень, щоб почати програмування, але багато деталей було спрощено або проігноровано. Куди звернутися, щоб отримати більш повну картину?

source: https://docs.python.org/dev/howto/descriptor.html is a lengthy tutorial introduction to the descriptor features, written by Guido van Rossum. If my description has whetted your appetite, go read this tutorial next, because it goes into much more detail about the new features while still remaining quite easy to read.
uk: https://docs.python.org/dev/howto/descriptor.html — це довгий навчальний посібник із ознайомленням із функціями дескриптора, написаний Гвідо ван Россумом. Якщо мій опис розпалив ваш апетит, прочитайте цей підручник далі, оскільки він містить набагато більше деталей про нові функції, але все ще залишається досить легким для читання.

source: Next, there are two relevant PEPs, :pep:`252` and :pep:`253`. :pep:`252` is titled "Making Types Look More Like Classes", and covers the descriptor API. :pep:`253` is titled "Subtyping Built-in Types", and describes the changes to type objects that make it possible to subtype built-in objects. :pep:`253` is the more complicated PEP of the two, and at a few points the necessary explanations of types and meta-types may cause your head to explode. Both PEPs were written and implemented by Guido van Rossum, with substantial assistance from the rest of the Zope Corp. team.
uk: Далі є два відповідних PEP, :pep:`252` і :pep:`253`. :pep:`252` має назву "Зробіть типи схожими на класи" та охоплює API дескриптора. :pep:`253` має назву "Підтипування вбудованих типів" і описує зміни в об’єктах типів, які роблять можливим підтипування вбудованих об’єктів. :pep:`253` є більш складним PEP з двох, і в деяких моментах необхідні пояснення типів і мета-типів можуть змусити вашу голову вибухнути. Обидва PEP були написані та реалізовані Гвідо ван Россумом за значної допомоги решти команди Zope Corp.

source: Finally, there's the ultimate authority: the source code. Most of the machinery for the type handling is in :file:`Objects/typeobject.c`, but you should only resort to it after all other avenues have been exhausted, including posting a question to python-list or python-dev.
uk: Нарешті, є найвищий авторитет: вихідний код. Більшість механізмів для обробки типів знаходиться в :file:`Objects/typeobject.c`, але ви повинні вдаватися до нього лише після того, як вичерпано всі інші способи, включно з розміщенням запитання в python-list або python-dev.

source: PEP 234: Iterators
uk: PEP 234: Ітератори

source: Another significant addition to 2.2 is an iteration interface at both the C and Python levels. Objects can define how they can be looped over by callers.
uk: Іншим значним доповненням до 2.2 є ітераційний інтерфейс як на рівнях C, так і на Python. Об’єкти можуть визначати, як вони можуть бути зациклені абонентами.

source: In Python versions up to 2.1, the usual way to make ``for item in obj`` work is to define a :meth:`__getitem__` method that looks something like this::
uk: У версіях Python до 2.1 звичайний спосіб змусити ``for item in obj`` працювати — це визначити метод :meth:`__getitem__`, який виглядає приблизно так::

source: :meth:`__getitem__` is more properly used to define an indexing operation on an object so that you can write ``obj[5]`` to retrieve the sixth element. It's a bit misleading when you're using this only to support :keyword:`for` loops. Consider some file-like object that wants to be looped over; the *index* parameter is essentially meaningless, as the class probably assumes that a series of :meth:`__getitem__` calls will be made with *index* incrementing by one each time. In other words, the presence of the :meth:`__getitem__` method doesn't mean that using ``file[5]`` to randomly access the sixth element will work, though it really should.
uk: :meth:`__getitem__` правильніше використовувати для визначення операції індексування об’єкта, щоб ви могли написати ``obj[5]`` для отримання шостого елемента. Це трохи оманливо, коли ви використовуєте це лише для підтримки циклів :keyword:`for`. Розглянемо якийсь файлоподібний об’єкт, який хоче бути зациклений; параметр *index* по суті не має сенсу, оскільки клас, ймовірно, припускає, що серія викликів :meth:`__getitem__` буде здійснена зі збільшенням *index* на одиницю кожного разу. Іншими словами, наявність методу :meth:`__getitem__` не означає, що використання ``file[5]`` для довільного доступу до шостого елемента буде працювати, хоча це справді має працювати.

source: In Python 2.2, iteration can be implemented separately, and :meth:`__getitem__` methods can be limited to classes that really do support random access. The basic idea of iterators is simple. A new built-in function, ``iter(obj)`` or ``iter(C, sentinel)``, is used to get an iterator. ``iter(obj)`` returns an iterator for the object *obj*, while ``iter(C, sentinel)`` returns an iterator that will invoke the callable object *C* until it returns *sentinel* to signal that the iterator is done.
uk: У Python 2.2 ітерація може бути реалізована окремо, а методи :meth:`__getitem__` можуть бути обмежені класами, які дійсно підтримують довільний доступ. Основна ідея ітераторів проста. Для отримання ітератора використовується нова вбудована функція, ``iter(obj)`` або ``iter(C, sentinel)``. ``iter(obj)`` повертає ітератор для об’єкта *obj*, тоді як ``iter(C, sentinel)`` повертає ітератор, який викличе об’єкт *C*, що викликається, доки він не поверне *sentinel*, щоб повідомити, що ітератор готовий.

source: Python classes can define an :meth:`__iter__` method, which should create and return a new iterator for the object; if the object is its own iterator, this method can just return ``self``. In particular, iterators will usually be their own iterators. Extension types implemented in C can implement a :c:member:`~PyTypeObject.tp_iter` function in order to return an iterator, and extension types that want to behave as iterators can define a :c:member:`~PyTypeObject.tp_iternext` function.
uk: Класи Python можуть визначати метод :meth:`__iter__`, який має створити та повернути новий ітератор для об’єкта; якщо об’єкт є власним ітератором, цей метод може просто повернути ``self``. Зокрема, ітератори зазвичай є своїми власними ітераторами. Типи розширень, реалізовані в C, можуть реалізовувати функцію :c:member:`~PyTypeObject.tp_iter` для повернення ітератора, а типи розширень, які хочуть поводитися як ітератори, можуть визначати :c:member:`~PyTypeObject.tp_iternext` функція.

source: So, after all this, what do iterators actually do? They have one required method, :meth:`next`, which takes no arguments and returns the next value. When there are no more values to be returned, calling :meth:`next` should raise the :exc:`StopIteration` exception. ::
uk: Отже, після всього цього, що насправді роблять ітератори? Вони мають один обов’язковий метод, :meth:`next`, який не приймає аргументів і повертає наступне значення. Якщо більше немає значень, які потрібно повернути, виклик :meth:`next` має викликати виняток :exc:`StopIteration`. ::

source: In 2.2, Python's :keyword:`for` statement no longer expects a sequence; it expects something for which :func:`iter` will return an iterator. For backward compatibility and convenience, an iterator is automatically constructed for sequences that don't implement :meth:`__iter__` or a :c:member:`~PyTypeObject.tp_iter` slot, so ``for i in [1,2,3]`` will still work. Wherever the Python interpreter loops over a sequence, it's been changed to use the iterator protocol. This means you can do things like this::
uk: У 2.2 оператор Python :keyword:`for` більше не очікує послідовності; він очікує щось, для чого :func:`iter` поверне ітератор. Для зворотної сумісності та зручності ітератор автоматично створюється для послідовностей, які не реалізують :meth:`__iter__` або слот :c:member:`~PyTypeObject.tp_iter`, тому ``for i в [1,2, 3]`` все одно працюватиме. Усюди, де інтерпретатор Python циклічно перебирає послідовність, його було змінено на використання протоколу ітератора. Це означає, що ви можете робити такі речі:

source: Iterator support has been added to some of Python's basic types. Calling :func:`iter` on a dictionary will return an iterator which loops over its keys::
uk: До деяких базових типів Python додано підтримку ітераторів. Виклик :func:`iter` у словнику поверне ітератор, який перебирає його ключі:

source: That's just the default behaviour. If you want to iterate over keys, values, or key/value pairs, you can explicitly call the :meth:`iterkeys`, :meth:`itervalues`, or :meth:`iteritems` methods to get an appropriate iterator. In a minor related change, the :keyword:`in` operator now works on dictionaries, so ``key in dict`` is now equivalent to ``dict.has_key(key)``.
uk: Це лише поведінка за умовчанням. Якщо ви хочете перебирати ключі, значення або пари ключ/значення, ви можете явно викликати методи :meth:`iterkeys`, :meth:`itervalues` або :meth:`iteritems`, щоб отримати відповідний ітератор. У незначній відповідній зміні оператор :keyword:`in` тепер працює зі словниками, тому ``key in dict`` тепер еквівалентний ``dict.has_key(key)``.

source: Files also provide an iterator, which calls the :meth:`readline` method until there are no more lines in the file. This means you can now read each line of a file using code like this::
uk: Файли також містять ітератор, який викликає метод :meth:`readline`, доки у файлі не залишиться рядків. Це означає, що тепер ви можете читати кожен рядок файлу за допомогою такого коду:

source: Note that you can only go forward in an iterator; there's no way to get the previous element, reset the iterator, or make a copy of it. An iterator object could provide such additional capabilities, but the iterator protocol only requires a :meth:`next` method.
uk: Зауважте, що в ітераторі можна рухатися лише вперед; немає способу отримати попередній елемент, скинути ітератор або зробити його копію. Об’єкт-ітератор може надати такі додаткові можливості, але протокол ітератора потребує лише методу :meth:`next`.

source: :pep:`234` - Iterators
uk: :pep:`234` - Ітератори

source: Written by Ka-Ping Yee and GvR; implemented by the Python Labs crew, mostly by GvR and Tim Peters.
uk: Написаний Ка-Пінг Йі та GvR; реалізований командою Python Labs, переважно GvR і Тімом Пітерсом.

source: PEP 255: Simple Generators
uk: PEP 255: Прості генератори

source: Generators are another new feature, one that interacts with the introduction of iterators.
uk: Генератори — ще одна нова функція, яка взаємодіє з появою ітераторів.

source: You're doubtless familiar with how function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a :keyword:`return` statement, the local variables are destroyed and the resulting value is returned to the caller. A later call to the same function will get a fresh new set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
uk: Ви, безсумнівно, знайомі з тим, як працюють виклики функцій у Python або C. Коли ви викликаєте функцію, вона отримує приватний простір імен, де створюються її локальні змінні. Коли функція досягає оператора :keyword:`return`, локальні змінні знищуються, а отримане значення повертається до викликаючого. Пізніший виклик тієї ж функції отримає новий набір локальних змінних. Але що, якби локальні змінні не були викинуті під час виходу з функції? Що, якби ви могли пізніше відновити функцію, де вона була зупинена? Це те, що забезпечують генератори; їх можна розглядати як відновлювані функції.

source: Here's the simplest example of a generator function::
uk: Ось найпростіший приклад функції генератора:

source: A new keyword, :keyword:`yield`, was introduced for generators. Any function containing a :keyword:`!yield` statement is a generator function; this is detected by Python's bytecode compiler which compiles the function specially as a result. Because a new keyword was introduced, generators must be explicitly enabled in a module by including a ``from __future__ import generators`` statement near the top of the module's source code. In Python 2.3 this statement will become unnecessary.
uk: Для генераторів було введено нове ключове слово :keyword:`yield`. Будь-яка функція, що містить оператор :keyword:`!yield`, є функцією-генератором; це виявляється компілятором байт-коду Python, який спеціально компілює функцію в результаті. Оскільки було введено нове ключове слово, генератори мають бути явно ввімкнені в модулі, включивши оператор ``from __future__ import generators`` у верхній частині вихідного коду модуля. У Python 2.3 цей оператор стане непотрібним.

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the :keyword:`yield` statement, the generator outputs the value of ``i``, similar to a :keyword:`return` statement. The big difference between :keyword:`!yield` and a :keyword:`!return` statement is that on reaching a :keyword:`!yield` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's ``next()`` method, the function will resume executing immediately after the :keyword:`!yield` statement. (For complicated reasons, the :keyword:`!yield` statement isn't allowed inside the :keyword:`!try` block of a :keyword:`try`...\ :keyword:`finally` statement; read :pep:`255` for a full explanation of the interaction between :keyword:`!yield` and exceptions.)
uk: Коли ви викликаєте функцію генератора, вона не повертає жодного значення; замість цього він повертає об'єкт генератора, який підтримує протокол ітератора. Під час виконання оператора :keyword:`yield` генератор виводить значення ``i``, подібне до оператора :keyword:`return`. Велика різниця між :keyword:`!yield` і оператором :keyword:`!return` полягає в тому, що при досягненні :keyword:`!yield` стан виконання генератора призупиняється, а локальні змінні зберігаються. Під час наступного виклику методу ``next()`` генератора функція відновить виконання відразу після оператора :keyword:`!yield`. (Зі складних причин оператор :keyword:`!yield` не дозволяється всередині блоку :keyword:`!try` оператора :keyword:`try`...\ :keyword:`finally`; читайте :pep:`255` для повного пояснення взаємодії між :keyword:`!yield` і винятками.)

source: Here's a sample usage of the :func:`generate_ints` generator::
uk: Ось приклад використання генератора :func:`generate_ints`::

source: You could equally write ``for i in generate_ints(5)``, or ``a,b,c = generate_ints(3)``.
uk: Так само можна написати ``for i in generate_ints(5)`` або ``a,b,c = generate_ints(3)``.

source: Inside a generator function, the :keyword:`return` statement can only be used without a value, and signals the end of the procession of values; afterwards the generator cannot return any further values. :keyword:`!return` with a value, such as ``return 5``, is a syntax error inside a generator function. The end of the generator's results can also be indicated by raising :exc:`StopIteration` manually, or by just letting the flow of execution fall off the bottom of the function.
uk: Усередині функції генератора оператор :keyword:`return` може використовуватися лише без значення та сигналізує про завершення процесії значень; після цього генератор не може повертати жодних додаткових значень. :keyword:`!return` зі значенням, таким як ``return 5``, є синтаксичною помилкою у функції генератора. Кінець результатів генератора також можна вказати, піднявши :exc:`StopIteration` вручну, або просто дозволивши потоку виконання впасти з нижньої частини функції.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`next` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class would be much messier. :file:`Lib/test/test_generators.py` contains a number of more interesting examples. The simplest one implements an in-order traversal of a tree using generators recursively. ::
uk: Ви можете досягти ефекту генераторів вручну, написавши власний клас і зберігши всі локальні змінні генератора як змінні екземпляра. Наприклад, щоб повернути список цілих чисел, можна встановити ``self.count`` на 0, а метод :meth:`next` збільшити ``self.count`` і повернути його. Однак для помірно складного генератора написання відповідного класу було б набагато складнішим. :file:`Lib/test/test_generators.py` містить ще кілька цікавих прикладів. Найпростіший реалізує рекурсивний обхід дерева за допомогою генераторів. ::

source: Two other examples in :file:`Lib/test/test_generators.py` produce solutions for the N-Queens problem (placing $N$ queens on an $NxN$ chess board so that no queen threatens another) and the Knight's Tour (a route that takes a knight to every square of an $NxN$ chessboard without visiting any square twice).
uk: Два інших приклади в :file:`Lib/test/test_generators.py` створюють рішення для проблеми N-Queens (розміщення $N$ ферзів на $NxN$ шахівниці так, щоб жодна королева не загрожувала іншій) і Knight's Tour (a маршрут, який веде лицаря до кожного поля $NxN$ шахівниці, не відвідуючи жодного поля двічі).

source: The idea of generators comes from other programming languages, especially Icon (https://www.cs.arizona.edu/icon/), where the idea of generators is central. In Icon, every expression and function call behaves like a generator. One example from "An Overview of the Icon Programming Language" at https://www.cs.arizona.edu/icon/docs/ipd266.htm gives an idea of what this looks like::
uk: Ідея генераторів походить від інших мов програмування, особливо Icon (https://www.cs.arizona.edu/icon/), де ідея генераторів є центральною. У Icon кожен вираз і виклик функції поводяться як генератор. Один приклад із "Огляду мови програмування значків" на https://www.cs.arizona.edu/icon/docs/ipd266.htm дає уявлення про те, як це виглядає:
