Repository: python/python-docs-uk
Catalog: whatsnew/2.2.po
Languages: uk

source: An additional *flags* argument has been added to the built-in function :func:`compile`, so the behaviour of ``__future__`` statements can now be correctly observed in simulated shells, such as those presented by IDLE and other development environments. This is described in :pep:`264`. (Contributed by Michael Hudson.)
uk: Додатковий аргумент *flags* було додано до вбудованої функції :func:`compile`, тому поведінку операторів ``__future__`` тепер можна правильно спостерігати в змодельованих оболонках, таких як представлені IDLE та інші розробки середовищ. Це описано в :pep:`264`. (Надав Майкл Хадсон.)

source: The new license introduced with Python 1.6 wasn't GPL-compatible. This is fixed by some minor textual changes to the 2.2 license, so it's now legal to embed Python inside a GPLed program again. Note that Python itself is not GPLed, but instead is under a license that's essentially equivalent to the BSD license, same as it always was. The license changes were also applied to the Python 2.0.1 and 2.1.1 releases.
uk: Нова ліцензія, представлена разом із Python 1.6, не була сумісною з GPL. Це виправлено деякими незначними текстовими змінами в ліцензії 2.2, тому тепер можна знову вставляти Python у програму GPL. Зауважте, що сам Python не підпадає під ліцензію GPL, а натомість діє під ліцензією, яка, по суті, еквівалентна ліцензії BSD, як і було завжди. Зміни ліцензії також було застосовано до випусків Python 2.0.1 і 2.1.1.

source: When presented with a Unicode filename on Windows, Python will now convert it to an MBCS encoded string, as used by the Microsoft file APIs. As MBCS is explicitly used by the file APIs, Python's choice of ASCII as the default encoding turns out to be an annoyance. On Unix, the locale's character set is used if ``locale.nl_langinfo(CODESET)`` is available. (Windows support was contributed by Mark Hammond with assistance from Marc-André Lemburg. Unix support was added by Martin von Löwis.)
uk: Коли в Windows надається ім’я файлу Unicode, Python тепер перетворює його на рядок у кодуванні MBCS, який використовується файловими API Microsoft. Оскільки MBCS явно використовується файловими API, вибір Python ASCII як кодування за замовчуванням виявляється неприємним. В Unix набір символів локалі використовується, якщо доступний ``locale.nl_langinfo(CODESET)``. (Підтримку Windows надав Марк Хаммонд за підтримки Марка-Андре Лембурга. Підтримку Unix додав Мартін фон Льовіс.)

source: Large file support is now enabled on Windows. (Contributed by Tim Peters.)
uk: Підтримка великих файлів тепер увімкнена в Windows. (Надав Тім Пітерс.)

source: The :file:`Tools/scripts/ftpmirror.py` script now parses a :file:`.netrc` file, if you have one. (Contributed by Mike Romberg.)
uk: Сценарій :file:`Tools/scripts/ftpmirror.py` тепер аналізує файл :file:`.netrc`, якщо він у вас є. (Надав Майк Ромберг.)

source: Some features of the object returned by the :func:`xrange` function are now deprecated, and trigger warnings when they're accessed; they'll disappear in Python 2.3. :class:`xrange` objects tried to pretend they were full sequence types by supporting slicing, sequence multiplication, and the :keyword:`in` operator, but these features were rarely used and therefore buggy. The :meth:`tolist` method and the :attr:`start`, :attr:`stop`, and :attr:`step` attributes are also being deprecated. At the C level, the fourth argument to the :c:func:`PyRange_New` function, ``repeat``, has also been deprecated.
uk: Деякі функції об’єкта, що повертаються функцією :func:`xrange`, тепер застаріли та викликають попередження під час доступу до них; вони зникнуть у Python 2.3. Об’єкти :class:`xrange` намагалися вдавати, що вони є типами повної послідовності, підтримуючи нарізку, множення послідовності та оператор :keyword:`in`, але ці функції рідко використовувалися і, отже, мали помилки. Метод :meth:`tolist` і атрибути :attr:`start`, :attr:`stop` і :attr:`step` також застаріли. На рівні C четвертий аргумент функції :c:func:`PyRange_New`, ``repeat``, також застарів.

source: There were a bunch of patches to the dictionary implementation, mostly to fix potential core dumps if a dictionary contains objects that sneakily changed their hash value, or mutated the dictionary they were contained in. For a while python-dev fell into a gentle rhythm of Michael Hudson finding a case that dumped core, Tim Peters fixing the bug, Michael finding another case, and round and round it went.
uk: Була купа патчів до реалізації словника, здебільшого для виправлення потенційних дампів ядра, якщо словник містить об’єкти, які потайки змінили своє хеш-значення або видозмінили словник, у якому вони містилися. На деякий час python-dev впав у м’який ритм Майкл Хадсон знайшов випадок, який викидав ядро, Тім Пітерс виправив помилку, Майкл знайшов інший випадок, і все пішло кругом.

source: On Windows, Python can now be compiled with Borland C thanks to a number of patches contributed by Stephen Hansen, though the result isn't fully functional yet. (But this *is* progress...)
uk: У Windows Python тепер можна скомпілювати за допомогою Borland C завдяки ряду патчів, внесених Стівеном Хансеном, хоча результат ще не повністю функціональний. (Але це *це* прогрес...)

source: Another Windows enhancement: Wise Solutions generously offered PythonLabs use of their InstallerMaster 8.1 system. Earlier PythonLabs Windows installers used Wise 5.0a, which was beginning to show its age. (Packaged up by Tim Peters.)
uk: Ще одне вдосконалення Windows: компанія Wise Solutions щедро запропонувала PythonLabs використовувати їхню систему InstallerMaster 8.1. Раніше інсталятори PythonLabs для Windows використовували Wise 5.0a, який почав показувати свій вік. (Упакував Тім Пітерс.)

source: Files ending in ``.pyw`` can now be imported on Windows. ``.pyw`` is a Windows-only thing, used to indicate that a script needs to be run using PYTHONW.EXE instead of PYTHON.EXE in order to prevent a DOS console from popping up to display the output. This patch makes it possible to import such scripts, in case they're also usable as modules. (Implemented by David Bolen.)
uk: Файли із закінченням ``.pyw`` тепер можна імпортувати в Windows. ``.pyw`` — це лише річ для Windows, яка використовується для вказівки на те, що сценарій потрібно запустити за допомогою PYTHONW.EXE замість PYTHON.EXE, щоб запобігти появі консолі DOS для відображення результату. Цей патч дає змогу імпортувати такі сценарії, якщо їх також можна використовувати як модулі. (Реалізовано Девідом Боленом.)

source: On platforms where Python uses the C :c:func:`dlopen` function to load extension modules, it's now possible to set the flags used by :c:func:`dlopen` using the :func:`sys.getdlopenflags` and :func:`sys.setdlopenflags` functions. (Contributed by Bram Stolk.)
uk: На платформах, де Python використовує функцію C :c:func:`dlopen` для завантаження модулів розширення, тепер можна встановити прапорці, які використовує :c:func:`dlopen` за допомогою :func:`sys.getdlopenflags` і :func:`sys.setdlopenflags` функції. (Надано Бремом Столком.)

source: The :func:`pow` built-in function no longer supports 3 arguments when floating-point numbers are supplied. ``pow(x, y, z)`` returns ``(x**y) % z``, but this is never useful for floating point numbers, and the final result varies unpredictably depending on the platform. A call such as ``pow(2.0, 8.0, 7.0)`` will now raise a :exc:`TypeError` exception.
uk: Вбудована функція :func:`pow` більше не підтримує 3 аргументи, коли надаються числа з плаваючою комою. ``pow(x, y, z)`` повертає ``(x**y) % z``, але це ніколи не корисно для чисел з плаваючою комою, і кінцевий результат непередбачувано змінюється залежно від платформи. Такий виклик, як ``pow(2.0, 8.0, 7.0)``, тепер викличе виняток :exc:`TypeError`.

source: Acknowledgements
uk: Подяки

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Fred Bremmer, Keith Briggs, Andrew Dalke, Fred L. Drake, Jr., Carel Fellinger, David Goodger, Mark Hammond, Stephen Hansen, Michael Hudson, Jack Jansen, Marc-André Lemburg, Martin von Löwis, Fredrik Lundh, Michael McLay, Nick Mathewson, Paul Moore, Gustavo Niemeyer, Don O'Donnell, Joonas Paalasma, Tim Peters, Jens Quade, Tom Reinhardt, Neil Schemenauer, Guido van Rossum, Greg Ward, Edward Welbourne.
uk: Автор хотів би подякувати наступним особам за пропозиції, виправлення та допомогу з різними чернетками цієї статті: Фред Бреммер, Кіт Бріггс, Ендрю Далк, Фред Л. Дрейк молодший, Карел Феллінгер, Девід Гуджер, Марк Хаммонд, Стівен Хансен, Майкл Хадсон, Джек Янсен, Марк-Андре Лембург, Мартін фон Левіс, Фредрік Лунд, Майкл МакЛей, Нік Метьюсон, Пол Мур, Густаво Німейєр, Дон О'Доннелл, Йоонас Пааласма, Тім Пітерс, Йенс Куейд, Том Рейнхардт, Ніл Шеменауер, Гвідо ван Россум, Грег Уорд, Едвард Велборн.
