Repository: python/python-docs-uk
Catalog: whatsnew/2.3.po
Languages: uk

source: There are a few ways to fix this warning. If you really need a positive number, just add an ``L`` to the end of the literal. If you're trying to get a 32-bit integer with low bits set and have previously used an expression such as ``~(1 << 31)``, it's probably clearest to start with all bits set and clear the desired upper bits. For example, to clear just the top bit (bit 31), you could write ``0xffffffffL &~(1L<<31)``.
uk: Є кілька способів виправити це попередження. Якщо вам справді потрібне позитивне число, просто додайте ``L`` до кінця літералу. Якщо ви намагаєтеся отримати 32-розрядне ціле число з установленими молодшими бітами і раніше використовували такий вираз, як ``~(1 << 31)``, ймовірно, найзрозуміліше почати з усіма встановленими бітами та очистити потрібний верхній біти. Наприклад, щоб очистити лише верхній біт (біт 31), ви можете написати ``0xffffffffL &~(1L<<31)``.

source: You can no longer disable assertions by assigning to ``__debug__``.
uk: Ви більше не можете вимкнути твердження, призначивши ``__debug__``.

source: The Distutils :func:`setup` function has gained various new keyword arguments such as *depends*. Old versions of the Distutils will abort if passed unknown keywords. A solution is to check for the presence of the new :func:`get_distutil_options` function in your :file:`setup.py` and only uses the new keywords with a version of the Distutils that supports them::
uk: Функція Distutils :func:`setup` отримала різні нові ключові аргументи, такі як *depends*. Старі версії Distutils перериваються, якщо передано невідомі ключові слова. Рішенням є перевірка наявності нової функції :func:`get_distutil_options` у вашому :file:`setup.py` і використання нових ключових слів лише з версією Distutils, яка їх підтримує:

source: Using ``None`` as a variable name will now result in a :exc:`SyntaxWarning` warning.
uk: Використання ``None`` як назви змінної тепер призведе до попередження :exc:`SyntaxWarning`.

source: Names of extension types defined by the modules included with Python now contain the module and a ``'.'`` in front of the type name.
uk: Назви типів розширень, визначені модулями, що входять до Python, тепер містять модуль і ``'.'`` перед назвою типу.

source: Acknowledgements
uk: Подяки

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Jeff Bauer, Simon Brunning, Brett Cannon, Michael Chermside, Andrew Dalke, Scott David Daniels, Fred L. Drake, Jr., David Fraser, Kelly Gerber, Raymond Hettinger, Michael Hudson, Chris Lambert, Detlef Lannert, Martin von Löwis, Andrew MacIntyre, Lalo Martins, Chad Netzer, Gustavo Niemeyer, Neal Norwitz, Hans Nowak, Chris Reedy, Francesco Ricciardi, Vinay Sajip, Neil Schemenauer, Roman Suzi, Jason Tishler, Just van Rossum.
uk: Автор хотів би подякувати наступним людям за пропозиції, виправлення та допомогу з різними чернетками цієї статті: Джефф Бауер, Саймон Бруннінг, Бретт Кеннон, Майкл Чермсайд, Ендрю Далк, Скотт Девід Деніелс, Фред Л. Дрейк молодший, Девід Фрейзер, Келлі Гербер, Реймонд Геттінгер, Майкл Хадсон, Кріс Ламберт, Детлеф Ланнерт, Мартін фон Левіс, Ендрю Макінтайр, Лало Мартінс, Чад Нетцер, Густаво Німейєр, Ніл Норвіц, Ханс Новак, Кріс Ріді, Франческо Ріккарді, Віней Саджип, Ніл Шеменауер, Роман Сузі, Джейсон Тішлер, Юст ван Россум.
