Repository: python/python-docs-uk
Catalog: whatsnew/2.3.po
Languages: uk

source: Pymalloc: A Specialized Object Allocator
uk: Pymalloc: спеціалізований розподільник об’єктів

source: Pymalloc, a specialized object allocator written by Vladimir Marangozov, was a feature added to Python 2.1. Pymalloc is intended to be faster than the system :c:func:`malloc` and to have less memory overhead for allocation patterns typical of Python programs. The allocator uses C's :c:func:`malloc` function to get large pools of memory and then fulfills smaller memory requests from these pools.
uk: Pymalloc, спеціалізований розподільник об’єктів, написаний Володимиром Марангозовим, був функцією, доданою до Python 2.1. Pymalloc має бути швидшим за системний :c:func:`malloc` і мати менше витрат пам’яті для шаблонів розподілу, типових для програм Python. Розподільник використовує функцію C :c:func:`malloc`, щоб отримати великі пули пам’яті, а потім виконує менші запити пам’яті з цих пулів.

source: In 2.1 and 2.2, pymalloc was an experimental feature and wasn't enabled by default; you had to explicitly enable it when compiling Python by providing the :option:`!--with-pymalloc` option to the :program:`configure` script. In 2.3, pymalloc has had further enhancements and is now enabled by default; you'll have to supply :option:`!--without-pymalloc` to disable it.
uk: У версіях 2.1 і 2.2 pymalloc був експериментальною функцією і не був увімкнений за замовчуванням; ви повинні були явно ввімкнути його під час компіляції Python, надавши опцію :option:`!--with-pymalloc` сценарію :program:`configure`. У версії 2.3 pymalloc отримав додаткові вдосконалення, і тепер він увімкнено за замовчуванням; вам доведеться вказати :option:`!--without-pymalloc`, щоб вимкнути його.

source: This change is transparent to code written in Python; however, pymalloc may expose bugs in C extensions. Authors of C extension modules should test their code with pymalloc enabled, because some incorrect code may cause core dumps at runtime.
uk: Ця зміна прозора для коду, написаного на Python; однак pymalloc може виявити помилки в розширеннях C. Автори модулів розширення C повинні протестувати свій код із увімкненим pymalloc, оскільки деякий неправильний код може спричинити дамп ядра під час виконання.

source: There's one particularly common error that causes problems. There are a number of memory allocation functions in Python's C API that have previously just been aliases for the C library's :c:func:`malloc` and :c:func:`free`, meaning that if you accidentally called mismatched functions the error wouldn't be noticeable. When the object allocator is enabled, these functions aren't aliases of :c:func:`malloc` and :c:func:`free` any more, and calling the wrong function to free memory may get you a core dump. For example, if memory was allocated using :c:func:`PyObject_Malloc`, it has to be freed using :c:func:`PyObject_Free`, not :c:func:`free`. A few modules included with Python fell afoul of this and had to be fixed; doubtless there are more third-party modules that will have the same problem.
uk: Є одна особливо поширена помилка, яка викликає проблеми. В API C Python є кілька функцій розподілу пам’яті, які раніше були лише псевдонімами :c:func:`malloc` і :c:func:`free` бібліотеки C, тобто якщо ви випадково викликали невідповідні функції, помилка не було б помітно. Коли розподільник об’єктів увімкнено, ці функції більше не є псевдонімами :c:func:`malloc` і :c:func:`free`, і виклик неправильної функції для звільнення пам’яті може призвести до створення дампа ядра. Наприклад, якщо пам’ять було виділено за допомогою :c:func:`PyObject_Malloc`, її потрібно звільнити за допомогою :c:func:`PyObject_Free`, а не :c:func:`free`. Кілька модулів, що входять до складу Python, вийшли з ладу, і їх потрібно було виправити; безсумнівно, є інші сторонні модулі, які матимуть таку саму проблему.

source: As part of this change, the confusing multiple interfaces for allocating memory have been consolidated down into two API families. Memory allocated with one family must not be manipulated with functions from the other family. There is one family for allocating chunks of memory and another family of functions specifically for allocating Python objects.
uk: У рамках цієї зміни незрозумілі кілька інтерфейсів для розподілу пам’яті були об’єднані у дві сімейства API. Пам'яттю, виділеною для одного сімейства, не можна маніпулювати функціями з іншого сімейства. Існує одне сімейство для розподілу фрагментів пам’яті та інше сімейство функцій спеціально для розподілу об’єктів Python.

source: To allocate and free an undistinguished chunk of memory use the "raw memory" family: :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc`, and :c:func:`PyMem_Free`.
uk: Щоб виділити та звільнити нерозрізнену частину пам’яті, використовуйте сімейство "необробленої пам’яті": :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` і :c:func:`PyMem_Free`.

source: The "object memory" family is the interface to the pymalloc facility described above and is biased towards a large number of "small" allocations: :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc`, and :c:func:`PyObject_Free`.
uk: Сімейство "об’єктної пам’яті" є інтерфейсом до описаного вище засобу pymalloc і спрямоване на велику кількість "маленьких" розподілів: :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` і :c:func:`PyObject_Free`.

source: To allocate and free Python objects, use the "object" family :c:func:`PyObject_New`, :c:func:`PyObject_NewVar`, and :c:func:`PyObject_Del`.
uk: Щоб виділити та звільнити об’єкти Python, використовуйте сімейство "об’єктів" :c:func:`PyObject_New`, :c:func:`PyObject_NewVar` і :c:func:`PyObject_Del`.

source: Thanks to lots of work by Tim Peters, pymalloc in 2.3 also provides debugging features to catch memory overwrites and doubled frees in both extension modules and in the interpreter itself. To enable this support, compile a debugging version of the Python interpreter by running :program:`configure` with :option:`!--with-pydebug`.
uk: Завдяки великій роботі Тіма Пітерса, pymalloc у версії 2.3 також надає функції налагодження для виявлення перезапису пам’яті та подвійного звільнення в обох модулях розширення та в самому інтерпретаторі. Щоб увімкнути цю підтримку, скомпілюйте версію інтерпретатора Python для налагодження, запустивши :program:`configure` з :option:`!--with-pydebug`.

source: To aid extension writers, a header file :file:`Misc/pymemcompat.h` is distributed with the source to Python 2.3 that allows Python extensions to use the 2.3 interfaces to memory allocation while compiling against any version of Python since 1.5.2. You would copy the file from Python's source distribution and bundle it with the source of your extension.
uk: Щоб допомогти розробникам розширень, файл заголовка :file:`Misc/pymemcompat.h` поширюється разом із джерелом для Python 2.3, який дозволяє розширенням Python використовувати інтерфейси 2.3 для розподілу пам’яті під час компіляції з будь-якою версією Python, починаючи з 1.5.2. Ви повинні скопіювати файл із вихідного коду Python і об’єднати його з джерелом вашого розширення.

source: For the full details of the pymalloc implementation, see the comments at the top of the file :file:`Objects/obmalloc.c` in the Python source code. The above link points to the file within the python.org SVN browser.
uk: Щоб отримати повну інформацію про реалізацію pymalloc, перегляньте коментарі у верхній частині файлу :file:`Objects/obmalloc.c` у вихідному коді Python. Наведене вище посилання вказує на файл у браузері python.org SVN.

source: Build and C API Changes
uk: Зміни збірки та C API

source: Changes to Python's build process and to the C API include:
uk: Зміни в процесі збирання Python і в API C включають:

source: The cycle detection implementation used by the garbage collection has proven to be stable, so it's now been made mandatory. You can no longer compile Python without it, and the :option:`!--with-cycle-gc` switch to :program:`configure` has been removed.
uk: Реалізація виявлення циклу, яка використовується для збирання сміття, виявилася стабільною, тому тепер вона стала обов’язковою. Ви більше не можете скомпілювати Python без нього, а перемикач :option:`!--with-cycle-gc` на :program:`configure` видалено.

source: Python can now optionally be built as a shared library (:file:`libpython2.3.so`) by supplying :option:`!--enable-shared` when running Python's :program:`configure` script. (Contributed by Ondrej Palkovsky.)
uk: Python тепер можна опціонально створити як спільну бібліотеку (:file:`libpython2.3.so`), вказавши :option:`!--enable-shared` під час виконання сценарію :program:`configure` Python. (Надав Ондрей Палковський.)

source: The :c:macro:`DL_EXPORT` and :c:macro:`DL_IMPORT` macros are now deprecated. Initialization functions for Python extension modules should now be declared using the new macro :c:macro:`PyMODINIT_FUNC`, while the Python core will generally use the :c:macro:`PyAPI_FUNC` and :c:macro:`PyAPI_DATA` macros.
uk: Макроси :c:macro:`DL_EXPORT` і :c:macro:`DL_IMPORT` тепер застаріли. Функції ініціалізації для модулів розширення Python тепер слід оголошувати за допомогою нового макросу :c:macro:`PyMODINIT_FUNC`, тоді як ядро Python зазвичай використовуватиме макроси :c:macro:`PyAPI_FUNC` і :c:macro:`PyAPI_DATA`.

source: The interpreter can be compiled without any docstrings for the built-in functions and modules by supplying :option:`!--without-doc-strings` to the :program:`configure` script. This makes the Python executable about 10% smaller, but will also mean that you can't get help for Python's built-ins. (Contributed by Gustavo Niemeyer.)
uk: Інтерпретатор може бути скомпільований без будь-яких рядків документації для вбудованих функцій і модулів, надаючи :option:`!--without-doc-strings` до сценарію :program:`configure`. Це робить виконуваний файл Python приблизно на 10% меншим, але також означатиме, що ви не зможете отримати допомогу для вбудованих компонентів Python. (Надав Густаво Німейєр.)

source: The :c:func:`PyArg_NoArgs` macro is now deprecated, and code that uses it should be changed. For Python 2.2 and later, the method definition table can specify the :const:`METH_NOARGS` flag, signalling that there are no arguments, and the argument checking can then be removed. If compatibility with pre-2.2 versions of Python is important, the code could use ``PyArg_ParseTuple(args, "")`` instead, but this will be slower than using :const:`METH_NOARGS`.
uk: Макрос :c:func:`PyArg_NoArgs` більше не підтримується, а код, який його використовує, слід змінити. Для Python 2.2 і пізніших версій таблиця визначення методів може вказати прапорець :const:`METH_NOARGS`, сигналізуючи про те, що аргументів немає, і тоді перевірку аргументів можна видалити. Якщо важлива сумісність із версіями Python до 2.2, замість цього код може використовувати ``PyArg_ParseTuple(args, "")``, але це буде повільніше, ніж використання :const:`METH_NOARGS`.

source: :c:func:`PyArg_ParseTuple` accepts new format characters for various sizes of unsigned integers: ``B`` for :c:type:`unsigned char`, ``H`` for :c:type:`unsigned short int`, ``I`` for :c:type:`unsigned int`, and ``K`` for :c:type:`unsigned long long`.
uk: :c:func:`PyArg_ParseTuple` приймає символи нового формату для різних розмірів беззнакових цілих чисел: ``B`` для :c:type:`unsigned char`, ``H`` для :c:type:`unsigned short int`, ``I`` для :c:type:`unsigned int` і ``K`` для :c:type:`unsigned long long`.

source: A new function, ``PyObject_DelItemString(mapping, char *key)`` was added as shorthand for ``PyObject_DelItem(mapping, PyString_New(key))``.
uk: Нову функцію ``PyObject_DelItemString(mapping, char *key)`` було додано як скорочення для ``PyObject_DelItem(mapping, PyString_New(key))``.

source: File objects now manage their internal string buffer differently, increasing it exponentially when needed. This results in the benchmark tests in :file:`Lib/test/test_bufio.py` speeding up considerably (from 57 seconds to 1.7 seconds, according to one measurement).
uk: Файлові об’єкти тепер керують своїм внутрішнім рядковим буфером по-іншому, збільшуючи його експоненціально за потреби. Це призводить до значного прискорення тестів у :file:`Lib/test/test_bufio.py` (з 57 секунд до 1,7 секунд, згідно з одним вимірюванням).

source: It's now possible to define class and static methods for a C extension type by setting either the :const:`METH_CLASS` or :const:`METH_STATIC` flags in a method's :c:type:`PyMethodDef` structure.
uk: Тепер можна визначити класові та статичні методи для типу розширення C, встановивши прапорці :const:`METH_CLASS` або :const:`METH_STATIC` у структурі методу :c:type:`PyMethodDef`.

source: Python now includes a copy of the Expat XML parser's source code, removing any dependence on a system version or local installation of Expat.
uk: Python тепер містить копію вихідного коду синтаксичного аналізатора Expat XML, усуваючи будь-яку залежність від версії системи або локальної інсталяції Expat.

source: If you dynamically allocate type objects in your extension, you should be aware of a change in the rules relating to the :attr:`__module__` and :attr:`~definition.__name__` attributes. In summary, you will want to ensure the type's dictionary contains a ``'__module__'`` key; making the module name the part of the type name leading up to the final period will no longer have the desired effect. For more detail, read the API reference documentation or the source.
uk: Якщо ви динамічно розподіляєте об’єкти типу у своєму розширенні, ви повинні знати про зміну правил, що стосуються атрибутів :attr:`__module__` і :attr:`~definition.__name__`. Таким чином, ви захочете переконатися, що словник типу містить ключ ``'__module__'``; створення назви модуля частиною назви типу, що веде до останньої крапки, більше не матиме бажаного ефекту. Щоб отримати докладніші відомості, прочитайте довідкову документацію API або джерело.

source: Port-Specific Changes
uk: Зміни, що стосуються порту

source: Support for a port to IBM's OS/2 using the EMX runtime environment was merged into the main Python source tree. EMX is a POSIX emulation layer over the OS/2 system APIs. The Python port for EMX tries to support all the POSIX-like capability exposed by the EMX runtime, and mostly succeeds; :func:`fork` and :func:`fcntl` are restricted by the limitations of the underlying emulation layer. The standard OS/2 port, which uses IBM's Visual Age compiler, also gained support for case-sensitive import semantics as part of the integration of the EMX port into CVS. (Contributed by Andrew MacIntyre.)
uk: Підтримку перенесення на OS/2 IBM за допомогою середовища виконання EMX було об’єднано в основне дерево вихідних кодів Python. EMX — це рівень емуляції POSIX над API системи OS/2. Порт Python для EMX намагається підтримувати всі POSIX-подібні можливості, надані середовищем виконання EMX, і здебільшого вдається; :func:`fork` і :func:`fcntl` обмежені обмеженнями основного рівня емуляції. Стандартний порт OS/2, який використовує компілятор IBM Visual Age, також отримав підтримку семантики імпорту з урахуванням регістру в рамках інтеграції порту EMX у CVS. (Надав Ендрю Макінтайр.)

source: On MacOS, most toolbox modules have been weaklinked to improve backward compatibility. This means that modules will no longer fail to load if a single routine is missing on the current OS version. Instead calling the missing routine will raise an exception. (Contributed by Jack Jansen.)
uk: У MacOS більшість модулів панелі інструментів були слабко зв’язані, щоб покращити зворотну сумісність. Це означає, що модулі більше не будуть завантажуватися, якщо в поточній версії ОС відсутня одна процедура. Натомість виклик відсутньої підпрограми призведе до виключення. (Надав Джек Янсен.)

source: The RPM spec files, found in the :file:`Misc/RPM/` directory in the Python source distribution, were updated for 2.3. (Contributed by Sean Reifschneider.)
uk: Файли специфікацій RPM, знайдені в каталозі :file:`Misc/RPM/` вихідного коду Python, було оновлено до версії 2.3. (Надав Шон Райфшнайдер.)

source: Other new platforms now supported by Python include AtheOS (http://www.atheos.cx/), GNU/Hurd, and OpenVMS.
uk: Інші нові платформи, які зараз підтримуються Python, включають AtheOS (http://www.atheos.cx/), GNU/Hurd і OpenVMS.

source: Other Changes and Fixes
uk: Інші зміни та виправлення

source: As usual, there were a bunch of other improvements and bugfixes scattered throughout the source tree. A search through the CVS change logs finds there were 523 patches applied and 514 bugs fixed between Python 2.2 and 2.3. Both figures are likely to be underestimates.
uk: Як завжди, була купа інших покращень і виправлень помилок, розкиданих по дереву вихідних кодів. Пошук у журналах змін CVS виявив, що між Python 2.2 і 2.3 було застосовано 523 виправлення та 514 виправлених помилок. Обидві цифри, ймовірно, занижені.

source: Some of the more notable changes are:
uk: Деякі з найбільш помітних змін:

source: If the :envvar:`PYTHONINSPECT` environment variable is set, the Python interpreter will enter the interactive prompt after running a Python program, as if Python had been invoked with the :option:`-i` option. The environment variable can be set before running the Python interpreter, or it can be set by the Python program as part of its execution.
uk: Якщо встановлено змінну середовища :envvar:`PYTHONINSPECT`, інтерпретатор Python увійде в інтерактивну підказку після запуску програми Python, як якщо б Python було викликано з параметром :option:`-i`. Змінну середовища можна встановити перед запуском інтерпретатора Python або її можна встановити програмою Python як частину її виконання.

source: The :file:`regrtest.py` script now provides a way to allow "all resources except *foo*." A resource name passed to the :option:`!-u` option can now be prefixed with a hyphen (``'-'``) to mean "remove this resource." For example, the option '``-uall,-bsddb``' could be used to enable the use of all resources except ``bsddb``.
uk: Сценарій :file:`regrtest.py` тепер надає спосіб дозволити "всі ресурси, крім *foo*". Ім’я ресурсу, передане параметру :option:`!-u`, тепер може мати перед префіксом дефіс (``'-'``), що означає "видалити цей ресурс". Наприклад, параметр "``-uall,-bsddb``" можна використовувати, щоб увімкнути використання всіх ресурсів, крім ``bsddb``.

source: The tools used to build the documentation now work under Cygwin as well as Unix.
uk: Інструменти, які використовуються для створення документації, тепер працюють як під Cygwin, так і під Unix.

source: The ``SET_LINENO`` opcode has been removed. Back in the mists of time, this opcode was needed to produce line numbers in tracebacks and support trace functions (for, e.g., :mod:`pdb`). Since Python 1.5, the line numbers in tracebacks have been computed using a different mechanism that works with "python -O". For Python 2.3 Michael Hudson implemented a similar scheme to determine when to call the trace function, removing the need for ``SET_LINENO`` entirely.
uk: Код операції ``SET_LINENO`` видалено. У давнину цей код операції був потрібний для створення номерів рядків у відстеженнях і підтримки функцій відстеження (наприклад, для :mod:`pdb`). Починаючи з Python 1.5, номери рядків у трасуваннях обчислюються за допомогою іншого механізму, який працює з "python -O". Для Python 2.3 Майкл Хадсон реалізував подібну схему, щоб визначити, коли викликати функцію трасування, повністю усунувши потребу в ``SET_LINENO``.

source: It would be difficult to detect any resulting difference from Python code, apart from a slight speed up when Python is run without :option:`-O`.
uk: Було б важко виявити будь-яку результуючу відмінність від коду Python, окрім невеликого прискорення, коли Python запускається без :option:`-O`.

source: C extensions that access the :attr:`f_lineno` field of frame objects should instead call ``PyCode_Addr2Line(f->f_code, f->f_lasti)``. This will have the added effect of making the code work as desired under "python -O" in earlier versions of Python.
uk: Розширення C, які мають доступ до поля :attr:`f_lineno` об’єктів фрейму, мають замість цього викликати ``PyCode_Addr2Line(f->f_code, f->f_lasti)``. Це матиме додатковий ефект, оскільки код працюватиме за бажанням під "python -O" у попередніх версіях Python.

source: A nifty new feature is that trace functions can now assign to the :attr:`f_lineno` attribute of frame objects, changing the line that will be executed next. A ``jump`` command has been added to the :mod:`pdb` debugger taking advantage of this new feature. (Implemented by Richie Hindle.)
uk: Чудовою новою функцією є те, що функції трасування тепер можуть призначати атрибут :attr:`f_lineno` об’єктів фрейму, змінюючи рядок, який буде виконано наступним. Команда ``jump`` була додана до налагоджувача :mod:`pdb`, використовуючи цю нову функцію. (Реалізовано Річі Гіндлом.)

source: Porting to Python 2.3
uk: Перенесення на Python 2.3

source: This section lists previously described changes that may require changes to your code:
uk: У цьому розділі перераховано описані раніше зміни, які можуть потребувати змін у вашому коді:

source: :keyword:`yield` is now always a keyword; if it's used as a variable name in your code, a different name must be chosen.
uk: :keyword:`yield` тепер завжди є ключовим словом; якщо воно використовується як ім’я змінної у вашому коді, потрібно вибрати інше ім’я.

source: For strings *X* and *Y*, ``X in Y`` now works if *X* is more than one character long.
uk: Для рядків *X* і *Y* "X в Y" тепер працює, якщо *X* містить більше одного символу.

source: The :func:`int` type constructor will now return a long integer instead of raising an :exc:`OverflowError` when a string or floating-point number is too large to fit into an integer.
uk: Конструктор типу :func:`int` тепер повертатиме довге ціле число замість того, щоб викликати :exc:`OverflowError`, коли рядок або число з плаваючою комою занадто велике, щоб поміститися в ціле число.

source: If you have Unicode strings that contain 8-bit characters, you must declare the file's encoding (UTF-8, Latin-1, or whatever) by adding a comment to the top of the file. See section :ref:`section-encodings` for more information.
uk: Якщо у вас є рядки Unicode, які містять 8-бітові символи, ви повинні оголосити кодування файлу (UTF-8, Latin-1 або інше), додавши коментар у верхній частині файлу. Перегляньте розділ :ref:`section-encodings` для отримання додаткової інформації.

source: Calling Tcl methods through :mod:`_tkinter` no longer returns only strings. Instead, if Tcl returns other objects those objects are converted to their Python equivalent, if one exists, or wrapped with a :class:`_tkinter.Tcl_Obj` object if no Python equivalent exists.
uk: Виклик методів Tcl через :mod:`_tkinter` більше не повертає лише рядки. Натомість, якщо Tcl повертає інші об’єкти, ці об’єкти перетворюються на їхній еквівалент Python, якщо такий існує, або загортаються в об’єкт :class:`_tkinter.Tcl_Obj`, якщо еквівалент Python не існує.

source: Large octal and hex literals such as ``0xffffffff`` now trigger a :exc:`FutureWarning`. Currently they're stored as 32-bit numbers and result in a negative value, but in Python 2.4 they'll become positive long integers.
uk: Великі вісімкові та шістнадцяткові літерали, такі як ``0xffffffff``, тепер викликають :exc:`FutureWarning`. Наразі вони зберігаються як 32-розрядні числа та отримують від’ємне значення, але в Python 2.4 вони стануть додатними довгими цілими числами.
