Repository: python/python-docs-uk
Catalog: whatsnew/2.3.po
Languages: uk

source: Pseudo-code for Python's new import logic, therefore, looks something like this (simplified a bit; see :pep:`302` for the full details)::
uk: Таким чином, псевдокод для нової логіки імпорту Python виглядає приблизно так (трохи спрощено; подробиці див. :pep:`302`):

source: :pep:`302` - New Import Hooks
uk: :pep:`302` - Нові хуки імпорту

source: Written by Just van Rossum and Paul Moore. Implemented by Just van Rossum.
uk: Автори: Джаст ван Россум і Пол Мур. Реалізовано Юстом ван Россумом.

source: PEP 305: Comma-separated Files
uk: PEP 305: Файли, розділені комами

source: Comma-separated files are a format frequently used for exporting data from databases and spreadsheets. Python 2.3 adds a parser for comma-separated files.
uk: Файли, розділені комами, — це формат, який часто використовується для експорту даних із баз даних і електронних таблиць. Python 2.3 додає аналізатор для файлів, розділених комами.

source: Comma-separated format is deceptively simple at first glance::
uk: Формат, розділений комами, на перший погляд оманливо простий:

source: Read a line and call ``line.split(',')``: what could be simpler? But toss in string data that can contain commas, and things get more complicated::
uk: Прочитати рядок і викликати ``line.split(',')``: що може бути простіше? Але додайте рядкові дані, які можуть містити коми, і все стане складнішим::

source: A big ugly regular expression can parse this, but using the new :mod:`csv` package is much simpler::
uk: Великий потворний регулярний вираз може проаналізувати це, але використання нового пакета :mod:`csv` набагато простіше:

source: The :func:`reader` function takes a number of different options. The field separator isn't limited to the comma and can be changed to any character, and so can the quoting and line-ending characters.
uk: Функція :func:`reader` має кілька різних параметрів. Роздільник полів не обмежується комою, його можна замінити будь-яким символом, а також символами лапок і кінця рядка.

source: Different dialects of comma-separated files can be defined and registered; currently there are two dialects, both used by Microsoft Excel. A separate :class:`csv.writer` class will generate comma-separated files from a succession of tuples or lists, quoting strings that contain the delimiter.
uk: Можна визначати та реєструвати різні діалекти файлів, розділених комами; наразі існує два діалекти, обидва використовуються Microsoft Excel. Окремий клас :class:`csv.writer` генеруватиме файли, розділені комами, із послідовності кортежів або списків, цитуючи рядки, які містять роздільник.

source: :pep:`305` - CSV File API
uk: :pep:`305` - API файлів CSV

source: Written and implemented by Kevin Altis, Dave Cole, Andrew McNamara, Skip Montanaro, Cliff Wells.
uk: Написали та реалізували Кевін Алтіс, Дейв Коул, Ендрю Макнамара, Скіп Монтанаро, Кліфф Веллс.

source: PEP 307: Pickle Enhancements
uk: PEP 307: Поліпшення соління

source: The :mod:`pickle` and :mod:`cPickle` modules received some attention during the 2.3 development cycle. In 2.2, new-style classes could be pickled without difficulty, but they weren't pickled very compactly; :pep:`307` quotes a trivial example where a new-style class results in a pickled string three times longer than that for a classic class.
uk: Модулі :mod:`pickle` і :mod:`cPickle` отримали деяку увагу протягом циклу розробки 2.3. У 2.2 класи нового стилю можна було маринувати без труднощів, але вони не були дуже компактно мариновані; :pep:`307` цитує тривіальний приклад, коли клас нового стилю призводить до маринованого рядка втричі довшого, ніж у класичного класу.

source: The solution was to invent a new pickle protocol. The :func:`pickle.dumps` function has supported a text-or-binary flag for a long time. In 2.3, this flag is redefined from a Boolean to an integer: 0 is the old text-mode pickle format, 1 is the old binary format, and now 2 is a new 2.3-specific format. A new constant, :const:`pickle.HIGHEST_PROTOCOL`, can be used to select the fanciest protocol available.
uk: Вихід полягав у винаході нового протоколу маринування. Функція :func:`pickle.dumps` довгий час підтримувала текстовий або бінарний прапор. У версії 2.3 цей прапорець змінено з логічного значення на ціле: 0 — це старий текстовий формат pickle, 1 — старий двійковий формат, а тепер 2 — це новий формат, специфічний для 2.3. Нову константу, :const:`pickle.HIGHEST_PROTOCOL`, можна використовувати для вибору найбільш модного доступного протоколу.

source: Unpickling is no longer considered a safe operation. 2.2's :mod:`pickle` provided hooks for trying to prevent unsafe classes from being unpickled (specifically, a :attr:`__safe_for_unpickling__` attribute), but none of this code was ever audited and therefore it's all been ripped out in 2.3. You should not unpickle untrusted data in any version of Python.
uk: Розбирання більше не вважається безпечною операцією. :mod:`pickle` версії 2.2 містить перехоплювачі для спроб запобігти видаленню небезпечних класів (зокрема, атрибут :attr:`__safe_for_unpickling__`), але жоден із цього коду ніколи не перевірявся, тому його було вилучено у 2.3 . Ви не повинні видаляти ненадійні дані в будь-якій версії Python.

source: To reduce the pickling overhead for new-style classes, a new interface for customizing pickling was added using three special methods: :meth:`__getstate__`, :meth:`__setstate__`, and :meth:`__getnewargs__`. Consult :pep:`307` for the full semantics of these methods.
uk: Щоб зменшити накладні витрати на травлення для класів нового стилю, було додано новий інтерфейс для налаштування травлення за допомогою трьох спеціальних методів: :meth:`__getstate__`, :meth:`__setstate__` та :meth:`__getnewargs__`. Зверніться до :pep:`307` для повної семантики цих методів.

source: As a way to compress pickles yet further, it's now possible to use integer codes instead of long strings to identify pickled classes. The Python Software Foundation will maintain a list of standardized codes; there's also a range of codes for private use. Currently no codes have been specified.
uk: Щоб ще більше стиснути pickles, тепер можна використовувати цілі коди замість довгих рядків для ідентифікації маринованих класів. Python Software Foundation підтримуватиме список стандартизованих кодів; також є ряд кодів для приватного використання. Наразі коди не вказано.

source: :pep:`307` - Extensions to the pickle protocol
uk: :pep:`307` - Розширення протоколу pickle

source: Written and implemented by Guido van Rossum and Tim Peters.
uk: Написано та реалізовано Гвідо ван Россумом і Тімом Пітерсом.

source: Extended Slices
uk: Розширені зрізи

source: Ever since Python 1.4, the slicing syntax has supported an optional third "step" or "stride" argument. For example, these are all legal Python syntax: ``L[1:10:2]``, ``L[:-1:1]``, ``L[::-1]``. This was added to Python at the request of the developers of Numerical Python, which uses the third argument extensively. However, Python's built-in list, tuple, and string sequence types have never supported this feature, raising a :exc:`TypeError` if you tried it. Michael Hudson contributed a patch to fix this shortcoming.
uk: Починаючи з Python 1.4, синтаксис нарізки підтримує додатковий третій аргумент "крок" або "крок". Наприклад, це законний синтаксис Python: ``L[1:10:2]``, ``L[:-1:1]``, ``L[::-1]``. Це було додано до Python на прохання розробників Numerical Python, який широко використовує третій аргумент. Однак вбудовані типи списків, кортежів і послідовностей рядків Python ніколи не підтримували цю функцію, викликаючи :exc:`TypeError`, якщо ви спробували її. Майкл Хадсон вніс патч для усунення цього недоліку.

source: For example, you can now easily extract the elements of a list that have even indexes::
uk: Наприклад, тепер ви можете легко витягти елементи списку, які мають парні індекси::

source: Negative values also work to make a copy of the same list in reverse order::
uk: Від’ємні значення також працюють для створення копії того самого списку у зворотному порядку:

source: This also works for tuples, arrays, and strings::
uk: Це також працює для кортежів, масивів і рядків::

source: If you have a mutable sequence such as a list or an array you can assign to or delete an extended slice, but there are some differences between assignment to extended and regular slices. Assignment to a regular slice can be used to change the length of the sequence::
uk: Якщо у вас є змінна послідовність, наприклад список або масив, ви можете призначити або видалити розширений фрагмент, але є деякі відмінності між призначенням розширеному та звичайному фрагментам. Призначення звичайному фрагменту можна використовувати для зміни довжини послідовності:

source: Extended slices aren't this flexible. When assigning to an extended slice, the list on the right hand side of the statement must contain the same number of items as the slice it is replacing::
uk: Розширені фрагменти не такі гнучкі. Під час призначення розширеному фрагменту список у правій частині оператора має містити таку ж кількість елементів, як і фрагмент, який він замінює:

source: Deletion is more straightforward::
uk: Видалення простіше:

source: One can also now pass slice objects to the :meth:`__getitem__` methods of the built-in sequences::
uk: Тепер також можна передавати об’єкти фрагментів до методів :meth:`__getitem__` вбудованих послідовностей::

source: Or use slice objects directly in subscripts::
uk: Або використовуйте об’єкти фрагментів безпосередньо в нижніх індексах::

source: To simplify implementing sequences that support extended slicing, slice objects now have a method ``indices(length)`` which, given the length of a sequence, returns a ``(start, stop, step)`` tuple that can be passed directly to :func:`range`. :meth:`indices` handles omitted and out-of-bounds indices in a manner consistent with regular slices (and this innocuous phrase hides a welter of confusing details!). The method is intended to be used like this::
uk: Щоб спростити реалізацію послідовностей, які підтримують розширене зрізання, об’єкти зрізів тепер мають метод ``indices(length)``, який, враховуючи довжину послідовності, повертає кортеж ``(start, stop, step)``, який можна передати безпосередньо до :func:`range`. :meth:`indices` обробляє пропущені та поза межами індекси у спосіб, що відповідає звичайним фрагментам (і ця нешкідлива фраза приховує купу заплутаних деталей!). Метод призначений для використання таким чином:

source: From this example you can also see that the built-in :class:`slice` object is now the type object for the slice type, and is no longer a function. This is consistent with Python 2.2, where :class:`int`, :class:`str`, etc., underwent the same change.
uk: З цього прикладу ви також можете побачити, що вбудований об’єкт :class:`slice` тепер є об’єктом типу для типу зрізу, і більше не є функцією. Це узгоджується з Python 2.2, де :class:`int`, :class:`str` тощо зазнали тих самих змін.

source: Other Language Changes
uk: Інші зміни мови

source: Here are all of the changes that Python 2.3 makes to the core Python language.
uk: Ось усі зміни, внесені Python 2.3 до основної мови Python.

source: The :keyword:`yield` statement is now always a keyword, as described in section :ref:`section-generators` of this document.
uk: Оператор :keyword:`yield` тепер завжди є ключовим словом, як описано в розділі :ref:`section-generators` цього документа.

source: A new built-in function :func:`enumerate` was added, as described in section :ref:`section-enumerate` of this document.
uk: Було додано нову вбудовану функцію :func:`enumerate`, як описано в розділі :ref:`section-enumerate` цього документа.

source: Two new constants, :const:`True` and :const:`False` were added along with the built-in :class:`bool` type, as described in section :ref:`section-bool` of this document.
uk: Дві нові константи, :const:`True` і :const:`False` було додано разом із вбудованим типом :class:`bool`, як описано в розділі :ref:`section-bool` цього документа.

source: The :func:`int` type constructor will now return a long integer instead of raising an :exc:`OverflowError` when a string or floating-point number is too large to fit into an integer. This can lead to the paradoxical result that ``isinstance(int(expression), int)`` is false, but that seems unlikely to cause problems in practice.
uk: Конструктор типу :func:`int` тепер повертатиме довге ціле число замість того, щоб викликати :exc:`OverflowError`, коли рядок або число з плаваючою комою занадто велике, щоб поміститися в ціле число. Це може призвести до парадоксального результату, що ``isinstance(int(expression), int)`` є хибним, але це навряд чи викличе проблеми на практиці.

source: Built-in types now support the extended slicing syntax, as described in section :ref:`section-slices` of this document.
uk: Вбудовані типи тепер підтримують розширений синтаксис нарізки, як описано в розділі :ref:`section-slices` цього документа.

source: A new built-in function, ``sum(iterable, start=0)``, adds up the numeric items in the iterable object and returns their sum. :func:`sum` only accepts numbers, meaning that you can't use it to concatenate a bunch of strings. (Contributed by Alex Martelli.)
uk: Нова вбудована функція, ``sum(iterable, start=0)``, додає числові елементи в ітераційному об’єкті та повертає їхню суму. :func:`sum` приймає лише числа, тобто ви не можете використовувати його для об’єднання рядків. (Надав Алекс Мартеллі.)

source: ``list.insert(pos, value)`` used to insert *value* at the front of the list when *pos* was negative. The behaviour has now been changed to be consistent with slice indexing, so when *pos* is -1 the value will be inserted before the last element, and so forth.
uk: ``list.insert(pos, value)`` використовувався для вставки *value* на початку списку, коли *pos* було від’ємним. Поведінку тепер змінено для узгодження з індексуванням фрагментів, тому, коли *pos* дорівнює -1, значення буде вставлено перед останнім елементом і так далі.

source: ``list.index(value)``, which searches for *value* within the list and returns its index, now takes optional *start* and *stop* arguments to limit the search to only part of the list.
uk: ``list.index(value)``, який шукає *value* у списку та повертає його індекс, тепер приймає додаткові аргументи *start* і *stop*, щоб обмежити пошук лише частиною списку.

source: Dictionaries have a new method, ``pop(key[, *default*])``, that returns the value corresponding to *key* and removes that key/value pair from the dictionary. If the requested key isn't present in the dictionary, *default* is returned if it's specified and :exc:`KeyError` raised if it isn't. ::
uk: У словниках є новий метод, ``pop(key[, *default*])``, який повертає значення, що відповідає *key*, і видаляє цю пару ключ/значення зі словника. Якщо потрібний ключ відсутній у словнику, повертається *default*, якщо його вказано, і :exc:`KeyError`, якщо його немає. ::

source: There's also a new class method, ``dict.fromkeys(iterable, value)``, that creates a dictionary with keys taken from the supplied iterator *iterable* and all values set to *value*, defaulting to ``None``.
uk: Існує також новий метод класу, ``dict.fromkeys(iterable, value)``, який створює словник із ключами, взятими з наданого ітератора *iterable*, і всіма значеннями, встановленими на *value*, за умовчанням ``None`` .

source: (Patches contributed by Raymond Hettinger.)
uk: (Патчі надав Раймонд Геттінгер.)

source: Also, the :func:`dict` constructor now accepts keyword arguments to simplify creating small dictionaries::
uk: Крім того, конструктор :func:`dict` тепер приймає аргументи ключових слів для спрощення створення невеликих словників::

source: (Contributed by Just van Rossum.)
uk: (Надав Джаст ван Россум.)

source: The :keyword:`assert` statement no longer checks the ``__debug__`` flag, so you can no longer disable assertions by assigning to ``__debug__``. Running Python with the :option:`-O` switch will still generate code that doesn't execute any assertions.
uk: Оператор :keyword:`assert` більше не перевіряє прапорець ``__debug__``, тому ви більше не можете вимкнути твердження, призначивши ``__debug__``. Запуск Python із перемикачем :option:`-O` усе одно генеруватиме код, який не виконує жодних тверджень.

source: Most type objects are now callable, so you can use them to create new objects such as functions, classes, and modules. (This means that the :mod:`new` module can be deprecated in a future Python version, because you can now use the type objects available in the :mod:`types` module.) For example, you can create a new module object with the following code:
uk: Більшість об’єктів типу тепер можна викликати, тому ви можете використовувати їх для створення нових об’єктів, таких як функції, класи та модулі. (Це означає, що модуль :mod:`new` може бути застарілим у майбутній версії Python, оскільки тепер ви можете використовувати об’єкти типу, доступні в модулі :mod:`types`.) Наприклад, ви можете створити новий модуль об'єкт із таким кодом:

source: A new warning, :exc:`PendingDeprecationWarning` was added to indicate features which are in the process of being deprecated. The warning will *not* be printed by default. To check for use of features that will be deprecated in the future, supply :option:`-Walways::PendingDeprecationWarning:: <-W>` on the command line or use :func:`warnings.filterwarnings`.
uk: Було додано нове попередження :exc:`PendingDeprecationWarning`, щоб вказати на функції, які перебувають у процесі припинення підтримки. За замовчуванням попередження *не* друкуватиметься. Щоб перевірити використання функцій, які в майбутньому будуть припинені, укажіть :option:`-Walways::PendingDeprecationWarning:: <-W>` у командному рядку або скористайтеся :func:`warnings.filterwarnings`.

source: The process of deprecating string-based exceptions, as in ``raise "Error occurred"``, has begun. Raising a string will now trigger :exc:`PendingDeprecationWarning`.
uk: Процес припинення винятків на основі рядків, як у ``підвищення "Сталася помилка"``, розпочато. Підвищення рядка тепер ініціює :exc:`PendingDeprecationWarning`.

source: Using ``None`` as a variable name will now result in a :exc:`SyntaxWarning` warning. In a future version of Python, ``None`` may finally become a keyword.
uk: Використання ``None`` як назви змінної тепер призведе до попередження :exc:`SyntaxWarning`. У майбутній версії Python ``None`` може нарешті стати ключовим словом.

source: The :meth:`xreadlines` method of file objects, introduced in Python 2.1, is no longer necessary because files now behave as their own iterator. :meth:`xreadlines` was originally introduced as a faster way to loop over all the lines in a file, but now you can simply write ``for line in file_obj``. File objects also have a new read-only :attr:`encoding` attribute that gives the encoding used by the file; Unicode strings written to the file will be automatically converted to bytes using the given encoding.
uk: Метод :meth:`xreadlines` файлових об’єктів, представлений у Python 2.1, більше не потрібен, оскільки файли тепер поводяться як власний ітератор. :meth:`xreadlines` спочатку було представлено як швидший спосіб циклічного перегляду всіх рядків у файлі, але тепер ви можете просто написати ``for line in file_obj``. Файлові об’єкти також мають новий атрибут :attr:`encoding`, доступний лише для читання, який надає кодування, яке використовується файлом; Рядки Unicode, записані у файл, будуть автоматично перетворені на байти з використанням заданого кодування.

source: The method resolution order used by new-style classes has changed, though you'll only notice the difference if you have a really complicated inheritance hierarchy. Classic classes are unaffected by this change. Python 2.2 originally used a topological sort of a class's ancestors, but 2.3 now uses the C3 algorithm as described in the paper `"A Monotonic Superclass Linearization for Dylan" <http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.3910>`_. To understand the motivation for this change, read Michele Simionato's article `"Python 2.3 Method Resolution Order" <http://www.phyast.pitt.edu/~micheles/mro.html>`_, or read the thread on python-dev starting with the message at https://mail.python.org/pipermail/python-dev/2002-October/029035.html. Samuele Pedroni first pointed out the problem and also implemented the fix by coding the C3 algorithm.
uk: Порядок вирішення методів, який використовується класами нового стилю, змінився, хоча ви помітите різницю, лише якщо у вас справді складна ієрархія успадкування. Ця зміна не торкнеться класичних класів. Python 2.2 спочатку використовував топологічний сорт предків класу, але 2.3 тепер використовує алгоритм C3, як описано в статті `"Монотонна лінеаризація суперкласу для Ділана" <http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.3910>`_. Щоб зрозуміти мотивацію цієї зміни, прочитайте статтю Michele Simionato `"Python 2.3 Method Resolution Order" <http://www.phyast.pitt.edu/~micheles/mro.html>`_ або прочитайте тему на python-dev, починаючи з повідомлення на https://mail.python.org/pipermail/python -dev/2002-October/029035.html. Самуеле Педроні вперше вказав на проблему, а також реалізував її, закодувавши алгоритм C3.

source: Python runs multithreaded programs by switching between threads after executing N bytecodes. The default value for N has been increased from 10 to 100 bytecodes, speeding up single-threaded applications by reducing the switching overhead. Some multithreaded applications may suffer slower response time, but that's easily fixed by setting the limit back to a lower number using ``sys.setcheckinterval(N)``. The limit can be retrieved with the new :func:`sys.getcheckinterval` function.
uk: Python запускає багатопотокові програми, перемикаючись між потоками після виконання N байт-кодів. Значення за замовчуванням для N було збільшено з 10 до 100 байт-кодів, що прискорює однопотокові програми за рахунок зменшення накладних витрат на перемикання. Деякі багатопотокові програми можуть страждати від повільнішого часу відповіді, але це легко виправити, установивши обмеження на нижче значення за допомогою ``sys.setcheckinterval(N)``. Обмеження можна отримати за допомогою нової функції :func:`sys.getcheckinterval`.

source: One minor but far-reaching change is that the names of extension types defined by the modules included with Python now contain the module and a ``'.'`` in front of the type name. For example, in Python 2.2, if you created a socket and printed its :attr:`__class__`, you'd get this output::
uk: Одна незначна, але далекосяжна зміна полягає в тому, що назви типів розширень, визначені модулями, що входять до складу Python, тепер містять модуль і ``'.'`` перед назвою типу. Наприклад, у Python 2.2, якщо ви створили сокет і надрукували його :attr:`__class__`, ви отримаєте такий результат::

source: In 2.3, you get this::
uk: У 2.3 ви отримаєте наступне:

source: One of the noted incompatibilities between old- and new-style classes has been removed: you can now assign to the :attr:`~definition.__name__` and :attr:`~class.__bases__` attributes of new-style classes. There are some restrictions on what can be assigned to :attr:`~class.__bases__` along the lines of those relating to assigning to an instance's :attr:`~instance.__class__` attribute.
uk: Одну із зазначених несумісностей між класами старого та нового стилів було видалено: тепер ви можете призначати атрибути :attr:`~definition.__name__` та :attr:`~class.__bases__` класів нового стилю. Існують деякі обмеження щодо того, що можна призначити :attr:`~class.__bases__` відповідно до тих, що стосуються присвоєння атрибуту :attr:`~instance.__class__` примірника.

source: String Changes
uk: Зміни рядків
