Repository: python/python-docs-uk
Catalog: whatsnew/2.3.po
Languages: uk

source: The :keyword:`in` operator now works differently for strings. Previously, when evaluating ``X in Y`` where *X* and *Y* are strings, *X* could only be a single character. That's now changed; *X* can be a string of any length, and ``X in Y`` will return :const:`True` if *X* is a substring of *Y*. If *X* is the empty string, the result is always :const:`True`. ::
uk: Оператор :keyword:`in` тепер працює інакше для рядків. Раніше під час обчислення ``X в Y``, де *X* і *Y* є рядками, *X* міг бути лише одним символом. Тепер це змінилося; *X* може бути рядком будь-якої довжини, і ``X в Y`` поверне :const:`True`, якщо *X* є підрядком *Y*. Якщо *X* є порожнім рядком, результат завжди буде :const:`True`. ::

source: Note that this doesn't tell you where the substring starts; if you need that information, use the :meth:`find` string method.
uk: Зауважте, що це не говорить вам, де починається підрядок; якщо вам потрібна ця інформація, скористайтеся методом рядка :meth:`find`.

source: The :meth:`strip`, :meth:`lstrip`, and :meth:`rstrip` string methods now have an optional argument for specifying the characters to strip. The default is still to remove all whitespace characters::
uk: Рядкові методи :meth:`strip`, :meth:`lstrip` і :meth:`rstrip` тепер мають додатковий аргумент для вказівки символів, які потрібно видалити. За замовчуванням усе ще видаляються всі пробіли::

source: (Suggested by Simon Brunning and implemented by Walter Dörwald.)
uk: (Запропоновано Саймоном Бруннінгом і реалізовано Вальтером Дорвальдом.)

source: The :meth:`startswith` and :meth:`endswith` string methods now accept negative numbers for the *start* and *end* parameters.
uk: Рядкові методи :meth:`startswith` і :meth:`endswith` тепер приймають від’ємні числа для параметрів *start* і *end*.

source: Another new string method is :meth:`zfill`, originally a function in the :mod:`string` module. :meth:`zfill` pads a numeric string with zeros on the left until it's the specified width. Note that the ``%`` operator is still more flexible and powerful than :meth:`zfill`. ::
uk: Іншим новим методом рядків є :meth:`zfill`, спочатку функція в модулі :mod:`string`. :meth:`zfill` доповнює числовий рядок нулями зліва, доки він не досягне заданої ширини. Зауважте, що оператор ``%`` все ще більш гнучкий і потужніший, ніж :meth:`zfill`. ::

source: (Contributed by Walter Dörwald.)
uk: (Надав Вальтер Дьорвальд.)

source: A new type object, :class:`basestring`, has been added. Both 8-bit strings and Unicode strings inherit from this type, so ``isinstance(obj, basestring)`` will return :const:`True` for either kind of string. It's a completely abstract type, so you can't create :class:`basestring` instances.
uk: Додано новий об’єкт типу :class:`basestring`. І 8-бітні рядки, і рядки Unicode успадковують цей тип, тому ``isinstance(obj, basestring)`` поверне :const:`True` для будь-якого типу рядка. Це повністю абстрактний тип, тому ви не можете створити екземпляри :class:`basestring`.

source: Interned strings are no longer immortal and will now be garbage-collected in the usual way when the only reference to them is from the internal dictionary of interned strings. (Implemented by Oren Tirosh.)
uk: Внутрішні рядки більше не є безсмертними і тепер збиратимуть сміття у звичайний спосіб, якщо єдине посилання на них міститься у внутрішньому словнику інтернованих рядків. (Реалізовано Ореном Тірошем.)

source: Optimizations
uk: Оптимізації

source: The creation of new-style class instances has been made much faster; they're now faster than classic classes!
uk: Створення екземплярів класу нового стилю стало набагато швидшим; тепер вони швидше, ніж класичні заняття!

source: The :meth:`sort` method of list objects has been extensively rewritten by Tim Peters, and the implementation is significantly faster.
uk: Метод :meth:`sort` для об’єктів списку був значною мірою переписаний Тімом Пітерсом, і реалізація значно швидша.

source: Multiplication of large long integers is now much faster thanks to an implementation of Karatsuba multiplication, an algorithm that scales better than the O(n\*n) required for the grade-school multiplication algorithm. (Original patch by Christopher A. Craig, and significantly reworked by Tim Peters.)
uk: Множення великих довгих цілих чисел тепер набагато швидше завдяки реалізації множення Карацуби, алгоритму, який масштабується краще, ніж O(n\*n), необхідний для алгоритму множення початкової школи. (Оригінальний патч Крістофера А. Крейга та значно перероблений Тімом Пітерсом.)

source: The ``SET_LINENO`` opcode is now gone. This may provide a small speed increase, depending on your compiler's idiosyncrasies. See section :ref:`23section-other` for a longer explanation. (Removed by Michael Hudson.)
uk: Код операції ``SET_LINENO`` тепер зник. Це може забезпечити невелике збільшення швидкості, залежно від особливостей вашого компілятора. Перегляньте розділ :ref:`23section-other` для більш детального пояснення. (Вилучено Майклом Хадсоном.)

source: :func:`xrange` objects now have their own iterator, making ``for i in xrange(n)`` slightly faster than ``for i in range(n)``. (Patch by Raymond Hettinger.)
uk: Об’єкти :func:`xrange` тепер мають власний ітератор, що робить ``for i in xrange(n)`` трохи швидшим, ніж ``for i in range(n)``. (Патч від Реймонда Геттінгера.)

source: A number of small rearrangements have been made in various hotspots to improve performance, such as inlining a function or removing some code. (Implemented mostly by GvR, but lots of people have contributed single changes.)
uk: У різних гарячих точках було зроблено ряд невеликих змін, щоб покращити продуктивність, як-от вбудовування функції або видалення деякого коду. (Реалізовано переважно GvR, але багато людей внесли окремі зміни.)

source: The net result of the 2.3 optimizations is that Python 2.3 runs the pystone benchmark around 25% faster than Python 2.2.
uk: Кінцевим результатом оптимізації 2.3 є те, що Python 2.3 виконує тест pystone приблизно на 25% швидше, ніж Python 2.2.

source: New, Improved, and Deprecated Modules
uk: Нові, покращені та застарілі модулі

source: As usual, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the CVS logs for all the details.
uk: Як завжди, стандартна бібліотека Python отримала низку вдосконалень і виправлень помилок. Ось неповний список найбільш помітних змін, відсортованих за алфавітом назв модулів. Зверніться до файлу :file:`Misc/NEWS` у дереві вихідних кодів, щоб отримати більш повний список змін, або перегляньте журнали CVS, щоб отримати всі деталі.

source: The :mod:`array` module now supports arrays of Unicode characters using the ``'u'`` format character. Arrays also now support using the ``+=`` assignment operator to add another array's contents, and the ``*=`` assignment operator to repeat an array. (Contributed by Jason Orendorff.)
uk: Модуль :mod:`array` тепер підтримує масиви символів Unicode з використанням символу формату ``'u'``. Масиви також тепер підтримують використання оператора призначення ``+=`` для додавання вмісту іншого масиву та оператора призначення ``*=`` для повторення масиву. (Надав Джейсон Орендорф.)

source: The :mod:`bsddb` module has been replaced by version 4.1.6 of the `PyBSDDB <http://pybsddb.sourceforge.net>`_ package, providing a more complete interface to the transactional features of the BerkeleyDB library.
uk: Модуль :mod:`bsddb` було замінено версією 4.1.6 пакета `PyBSDDB <http://pybsddb.sourceforge.net>`_, що забезпечує повніший інтерфейс для транзакційних функцій бібліотеки BerkeleyDB.

source: The old version of the module has been renamed to :mod:`bsddb185` and is no longer built automatically; you'll have to edit :file:`Modules/Setup` to enable it. Note that the new :mod:`bsddb` package is intended to be compatible with the old module, so be sure to file bugs if you discover any incompatibilities. When upgrading to Python 2.3, if the new interpreter is compiled with a new version of the underlying BerkeleyDB library, you will almost certainly have to convert your database files to the new version. You can do this fairly easily with the new scripts :file:`db2pickle.py` and :file:`pickle2db.py` which you will find in the distribution's :file:`Tools/scripts` directory. If you've already been using the PyBSDDB package and importing it as :mod:`bsddb3`, you will have to change your ``import`` statements to import it as :mod:`bsddb`.
uk: Стару версію модуля було перейменовано на :mod:`bsddb185` і більше не створюється автоматично; вам доведеться відредагувати :file:`Modules/Setup`, щоб увімкнути його. Зауважте, що новий пакет :mod:`bsddb` призначений для сумісності зі старим модулем, тому обов’язково повідомляйте про помилки, якщо виявите будь-яку несумісність. Під час оновлення до Python 2.3, якщо новий інтерпретатор скомпільовано з новою версією основної бібліотеки BerkeleyDB, вам майже напевно доведеться конвертувати файли вашої бази даних у нову версію. Ви можете зробити це досить легко за допомогою нових скриптів :file:`db2pickle.py` і :file:`pickle2db.py`, які ви знайдете в каталозі :file:`Tools/scripts` дистрибутива. Якщо ви вже використовували пакет PyBSDDB та імпортували його як :mod:`bsddb3`, вам доведеться змінити ваші оператори ``import``, щоб імпортувати його як :mod:`bsddb`.

source: The new :mod:`bz2` module is an interface to the bz2 data compression library. bz2-compressed data is usually smaller than corresponding :mod:`zlib`\ -compressed data. (Contributed by Gustavo Niemeyer.)
uk: Новий модуль :mod:`bz2` є інтерфейсом до бібліотеки стиснення даних bz2. bz2-стиснуті дані зазвичай менші за відповідні :mod:`zlib`\ -стиснуті дані. (Надав Густаво Німейєр.)

source: A set of standard date/time types has been added in the new :mod:`datetime` module. See the following section for more details.
uk: У новий модуль :mod:`datetime` додано набір стандартних типів дати/часу. Перегляньте наступний розділ для отримання додаткової інформації.

source: The Distutils :class:`Extension` class now supports an extra constructor argument named *depends* for listing additional source files that an extension depends on. This lets Distutils recompile the module if any of the dependency files are modified. For example, if :file:`sampmodule.c` includes the header file :file:`sample.h`, you would create the :class:`Extension` object like this::
uk: Клас Distutils :class:`Extension` тепер підтримує додатковий аргумент конструктора під назвою *depends* для переліку додаткових вихідних файлів, від яких залежить розширення. Це дозволяє Distutils перекомпілювати модуль, якщо будь-який із файлів залежностей змінено. Наприклад, якщо :file:`sampmodule.c` містить файл заголовка :file:`sample.h`, ви повинні створити об’єкт :class:`Extension` таким чином:

source: Modifying :file:`sample.h` would then cause the module to be recompiled. (Contributed by Jeremy Hylton.)
uk: Зміна :file:`sample.h` призведе до перекомпіляції модуля. (Надав Джеремі Гілтон.)

source: Other minor changes to Distutils: it now checks for the :envvar:`CC`, :envvar:`CFLAGS`, :envvar:`CPP`, :envvar:`LDFLAGS`, and :envvar:`CPPFLAGS` environment variables, using them to override the settings in Python's configuration (contributed by Robert Weber).
uk: Інші незначні зміни в Distutils: тепер він перевіряє змінні середовища :envvar:`CC`, :envvar:`CFLAGS`, :envvar:`CPP`, :envvar:`LDFLAGS` і :envvar:`CPPFLAGS`, використовуючи їх, щоб замінити налаштування в конфігурації Python (надано Робертом Вебером).

source: Previously the :mod:`doctest` module would only search the docstrings of public methods and functions for test cases, but it now also examines private ones as well. The :func:`DocTestSuite` function creates a :class:`unittest.TestSuite` object from a set of :mod:`doctest` tests.
uk: Раніше модуль :mod:`doctest` шукав лише тестові рядки загальнодоступних методів і функцій, але тепер він перевіряє й приватні. Функція :func:`DocTestSuite` створює об’єкт :class:`unittest.TestSuite` з набору тестів :mod:`doctest`.

source: The new ``gc.get_referents(object)`` function returns a list of all the objects referenced by *object*.
uk: Нова функція ``gc.get_referents(object)`` повертає список усіх об’єктів, на які посилається *object*.

source: The :mod:`getopt` module gained a new function, :func:`gnu_getopt`, that supports the same arguments as the existing :func:`getopt` function but uses GNU-style scanning mode. The existing :func:`getopt` stops processing options as soon as a non-option argument is encountered, but in GNU-style mode processing continues, meaning that options and arguments can be mixed. For example::
uk: Модуль :mod:`getopt` отримав нову функцію, :func:`gnu_getopt`, яка підтримує ті самі аргументи, що й існуюча функція :func:`getopt`, але використовує режим сканування у стилі GNU. Існуючий :func:`getopt` припиняє обробку параметрів, щойно зустрічається аргумент, що не є параметром, але в режимі стилю GNU обробка продовжується, тобто параметри та аргументи можуть змішуватися. Наприклад::

source: (Contributed by Peter Åstrand.)
uk: (Надав Пітер Естранд.)

source: The :mod:`grp`, :mod:`pwd`, and :mod:`resource` modules now return enhanced tuples::
uk: Модулі :mod:`grp`, :mod:`pwd` і :mod:`resource` тепер повертають розширені кортежі::

source: The :mod:`gzip` module can now handle files exceeding 2 GiB.
uk: Модуль :mod:`gzip` тепер може обробляти файли розміром понад 2 ГіБ.

source: The new :mod:`heapq` module contains an implementation of a heap queue algorithm. A heap is an array-like data structure that keeps items in a partially sorted order such that, for every index *k*, ``heap[k] <= heap[2*k+1]`` and ``heap[k] <= heap[2*k+2]``. This makes it quick to remove the smallest item, and inserting a new item while maintaining the heap property is O(lg n). (See https://xlinux.nist.gov/dads//HTML/priorityque.html for more information about the priority queue data structure.)
uk: Новий модуль :mod:`heapq` містить реалізацію алгоритму черги купи. Купа — це масивоподібна структура даних, яка зберігає елементи в частково відсортованому порядку, щоб для кожного індексу *k* "купа[k] <= купа[2*k+1]" і "купа[ k] <= купа[2*k+2]``. Це дозволяє швидко видалити найменший елемент, а вставити новий елемент, зберігаючи властивість купи, становить O(lg n). (Див. https://xlinux.nist.gov/dads//HTML/priorityque.html, щоб дізнатися більше про структуру даних пріоритетної черги.)

source: The :mod:`heapq` module provides :func:`heappush` and :func:`heappop` functions for adding and removing items while maintaining the heap property on top of some other mutable Python sequence type. Here's an example that uses a Python list::
uk: Модуль :mod:`heapq` надає функції :func:`heappush` і :func:`heappop` для додавання та видалення елементів, зберігаючи при цьому властивість купи поверх іншого змінного типу послідовності Python. Ось приклад використання списку Python::

source: (Contributed by Kevin O'Connor.)
uk: (Надав Кевін О'Коннор.)

source: The IDLE integrated development environment has been updated using the code from the IDLEfork project (http://idlefork.sourceforge.net). The most notable feature is that the code being developed is now executed in a subprocess, meaning that there's no longer any need for manual ``reload()`` operations. IDLE's core code has been incorporated into the standard library as the :mod:`idlelib` package.
uk: Інтегроване середовище розробки IDLE оновлено за допомогою коду проекту IDLEfork (http://idlefork.sourceforge.net). Найбільш помітною особливістю є те, що код, який розробляється, тепер виконується у підпроцесі, що означає, що більше немає потреби в ручних операціях ``reload()``. Код ядра IDLE було включено до стандартної бібліотеки як пакет :mod:`idlelib`.

source: The :mod:`imaplib` module now supports IMAP over SSL. (Contributed by Piers Lauder and Tino Lange.)
uk: Модуль :mod:`imaplib` тепер підтримує IMAP через SSL. (Пірс Лаудер і Тіно Ланге.)

source: The :mod:`itertools` contains a number of useful functions for use with iterators, inspired by various functions provided by the ML and Haskell languages. For example, ``itertools.ifilter(predicate, iterator)`` returns all elements in the iterator for which the function :func:`predicate` returns :const:`True`, and ``itertools.repeat(obj, N)`` returns ``obj`` *N* times. There are a number of other functions in the module; see the package's reference documentation for details. (Contributed by Raymond Hettinger.)
uk: :mod:`itertools` містить низку корисних функцій для використання з ітераторами, натхненними різними функціями, наданими мовами ML і Haskell. Наприклад, ``itertools.ifilter(predicate, iterator)`` повертає всі елементи в ітераторі, для яких функція :func:`predicate` повертає :const:`True`, і ``itertools.repeat(obj, N)`` повертає ``obj`` *N* разів. У модулі є ряд інших функцій; подробиці див. у довідковій документації пакета. (Надав Реймонд Геттінгер.)

source: Two new functions in the :mod:`math` module, ``degrees(rads)`` and ``radians(degs)``, convert between radians and degrees. Other functions in the :mod:`math` module such as :func:`math.sin` and :func:`math.cos` have always required input values measured in radians. Also, an optional *base* argument was added to :func:`math.log` to make it easier to compute logarithms for bases other than ``e`` and ``10``. (Contributed by Raymond Hettinger.)
uk: Дві нові функції в модулі :mod:`math`, ``degrees(rads)`` і ``radians(degs)``, конвертують між радіанами та градусами. Інші функції в модулі :mod:`math`, такі як :func:`math.sin` і :func:`math.cos`, завжди вимагали вхідних значень, виміряних у радіанах. Також до :func:`math.log` було додано необов’язковий аргумент *base*, щоб полегшити обчислення логарифмів для основ, відмінних від ``e`` і ``10``. (Надав Реймонд Геттінгер.)

source: Several new POSIX functions (:func:`getpgid`, :func:`killpg`, :func:`lchown`, :func:`loadavg`, :func:`major`, :func:`makedev`, :func:`minor`, and :func:`mknod`) were added to the :mod:`posix` module that underlies the :mod:`os` module. (Contributed by Gustavo Niemeyer, Geert Jansen, and Denis S. Otkidach.)
uk: Кілька нових функцій POSIX (:func:`getpgid`, :func:`killpg`, :func:`lchown`, :func:`loadavg`, :func:`major`, :func:`makedev`, :func:`minor` і :func:`mknod`) були додані до модуля :mod:`posix`, який лежить в основі модуля :mod:`os`. (Надано Густаво Німейєром, Гертом Янсеном і Денісом С. Откидачем.)

source: In the :mod:`os` module, the :func:`\*stat` family of functions can now report fractions of a second in a timestamp. Such time stamps are represented as floats, similar to the value returned by :func:`time.time`.
uk: У модулі :mod:`os` сімейство функцій :func:`\*stat` тепер може повідомляти частки секунди в мітці часу. Такі мітки часу представлені як числа з плаваючою точкою, подібні до значення, яке повертає :func:`time.time`.

source: During testing, it was found that some applications will break if time stamps are floats. For compatibility, when using the tuple interface of the :class:`stat_result` time stamps will be represented as integers. When using named fields (a feature first introduced in Python 2.2), time stamps are still represented as integers, unless :func:`os.stat_float_times` is invoked to enable float return values::
uk: Під час тестування було виявлено, що деякі програми працюватимуть з ладу, якщо мітки часу будуть плаваючими. Для сумісності під час використання інтерфейсу кортежу позначки часу :class:`stat_result` будуть представлені як цілі числа. Під час використання іменованих полів (функція, вперше представлена в Python 2.2), мітки часу все ще представлені як цілі числа, якщо тільки :func:`os.stat_float_times` не викликається, щоб увімкнути значення, що повертаються:

source: In Python 2.4, the default will change to always returning floats.
uk: У Python 2.4 значення за замовчуванням зміниться на завжди повертати числа з плаваючою точкою.

source: Application developers should enable this feature only if all their libraries work properly when confronted with floating point time stamps, or if they use the tuple API. If used, the feature should be activated on an application level instead of trying to enable it on a per-use basis.
uk: Розробникам програм слід увімкнути цю функцію, лише якщо всі їхні бібліотеки працюють належним чином, коли вони стикаються з мітками часу з плаваючою комою, або якщо вони використовують API кортежу. У разі використання цю функцію слід активувати на рівні програми, а не намагатися ввімкнути її для кожного окремого використання.

source: The :mod:`optparse` module contains a new parser for command-line arguments that can convert option values to a particular Python type and will automatically generate a usage message. See the following section for more details.
uk: Модуль :mod:`optparse` містить новий синтаксичний аналізатор аргументів командного рядка, який може конвертувати значення параметрів у певний тип Python і автоматично генеруватиме повідомлення про використання. Перегляньте наступний розділ для отримання додаткової інформації.

source: The old and never-documented :mod:`linuxaudiodev` module has been deprecated, and a new version named :mod:`ossaudiodev` has been added. The module was renamed because the OSS sound drivers can be used on platforms other than Linux, and the interface has also been tidied and brought up to date in various ways. (Contributed by Greg Ward and Nicholas FitzRoy-Dale.)
uk: Старий і ніколи не задокументований модуль :mod:`linuxaudiodev` було визнано застарілим і додано нову версію під назвою :mod:`ossaudiodev`. Модуль було перейменовано, тому що звукові драйвери OSS можна використовувати на платформах, відмінних від Linux, і інтерфейс також було впорядковано та оновлено різними способами. (Надано Грегом Уордом і Ніколасом ФітцРой-Дейлом.)

source: The new :mod:`platform` module contains a number of functions that try to determine various properties of the platform you're running on. There are functions for getting the architecture, CPU type, the Windows OS version, and even the Linux distribution version. (Contributed by Marc-André Lemburg.)
uk: Новий модуль :mod:`platform` містить ряд функцій, які намагаються визначити різні властивості платформи, на якій ви працюєте. Є функції для отримання архітектури, типу ЦП, версії ОС Windows і навіть версії дистрибутива Linux. (Надав Марк-Андре Лембург.)

source: The parser objects provided by the :mod:`pyexpat` module can now optionally buffer character data, resulting in fewer calls to your character data handler and therefore faster performance. Setting the parser object's :attr:`buffer_text` attribute to :const:`True` will enable buffering.
uk: Об’єкти синтаксичного аналізатора, надані модулем :mod:`pyexpat`, тепер можуть додатково буферизувати символьні дані, що призводить до меншої кількості викликів вашого обробника символьних даних і, отже, до швидшої роботи. Встановлення атрибута :attr:`buffer_text` об’єкта парсера на :const:`True` увімкне буферизацію.

source: The ``sample(population, k)`` function was added to the :mod:`random` module. *population* is a sequence or :class:`xrange` object containing the elements of a population, and :func:`sample` chooses *k* elements from the population without replacing chosen elements. *k* can be any value up to ``len(population)``. For example::
uk: До модуля :mod:`random` додано функцію ``sample(population, k)``. *population* — це послідовність або об’єкт :class:`xrange`, що містить елементи сукупності, а :func:`sample` вибирає *k* елементів із сукупності без заміни вибраних елементів. *k* може бути будь-яким значенням до ``len(population)``. Наприклад::
