Repository: python/python-docs-uk
Catalog: whatsnew/2.3.po
Languages: uk

source: PEP 278: Universal Newline Support
uk: PEP 278: універсальна підтримка нового рядка

source: The three major operating systems used today are Microsoft Windows, Apple's Macintosh OS, and the various Unix derivatives. A minor irritation of cross-platform work is that these three platforms all use different characters to mark the ends of lines in text files. Unix uses the linefeed (ASCII character 10), MacOS uses the carriage return (ASCII character 13), and Windows uses a two-character sequence of a carriage return plus a newline.
uk: Сьогодні використовуються три основні операційні системи: Microsoft Windows, Macintosh OS від Apple і різні похідні Unix. Невелике роздратування кросплатформної роботи полягає в тому, що всі ці три платформи використовують різні символи для позначення кінців рядків у текстових файлах. Unix використовує символ переводу рядка (символ ASCII 10), MacOS використовує символ повернення каретки (символ ASCII 13), а Windows використовує двосимвольну послідовність повернення каретки плюс новий рядок.

source: Python's file objects can now support end of line conventions other than the one followed by the platform on which Python is running. Opening a file with the mode ``'U'`` or ``'rU'`` will open a file for reading in :term:`universal newlines` mode. All three line ending conventions will be translated to a ``'\n'`` in the strings returned by the various file methods such as :meth:`read` and :meth:`readline`.
uk: Файлові об’єкти Python тепер можуть підтримувати угоди про кінець рядка, відмінні від того, за яким іде платформа, на якій працює Python. Відкриття файлу в режимі ``'U'`` або ``'rU'`` відкриє файл для читання в режимі :term:`universal newlines`. Усі три правила закінчення рядків буде перекладено на ``'\n'`` у рядках, які повертаються різними файловими методами, такими як :meth:`read` і :meth:`readline`.

source: Universal newline support is also used when importing modules and when executing a file with the :func:`execfile` function. This means that Python modules can be shared between all three operating systems without needing to convert the line-endings.
uk: Універсальна підтримка нового рядка також використовується під час імпорту модулів і під час виконання файлу за допомогою функції :func:`execfile`. Це означає, що модулі Python можна спільно використовувати між усіма трьома операційними системами без необхідності конвертувати закінчення рядків.

source: This feature can be disabled when compiling Python by specifying the :option:`!--without-universal-newlines` switch when running Python's :program:`configure` script.
uk: Цю функцію можна вимкнути під час компіляції Python, вказавши параметр :option:`!--without-universal-newlines` під час виконання сценарію :program:`configure` Python.

source: :pep:`278` - Universal Newline Support
uk: :pep:`278` - Універсальна підтримка нового рядка

source: Written and implemented by Jack Jansen.
uk: Написаний і реалізований Джеком Янсеном.

source: A new built-in function, :func:`enumerate`, will make certain loops a bit clearer. ``enumerate(thing)``, where *thing* is either an iterator or a sequence, returns an iterator that will return ``(0, thing[0])``, ``(1, thing[1])``, ``(2, thing[2])``, and so forth.
uk: Нова вбудована функція, :func:`enumerate`, зробить певні цикли трохи зрозумілішими. ``enumerate(thing)``, де *thing* є ітератором або послідовністю, повертає ітератор, який поверне ``(0, thing[0])``, ``(1, thing[1])``, ``(2, thing[2])`` і так далі.

source: A common idiom to change every element of a list looks like this::
uk: Загальна ідіома зміни кожного елемента списку виглядає так:

source: This can be rewritten using :func:`enumerate` as::
uk: Це можна переписати за допомогою :func:`enumerate` як::

source: :pep:`279` - The enumerate() built-in function
uk: :pep:`279` - Вбудована функція enumerate().

source: Written and implemented by Raymond D. Hettinger.
uk: Написаний і реалізований Реймондом Д. Хеттінгером.

source: PEP 282: The logging Package
uk: PEP 282: пакет журналів

source: A standard package for writing logs, :mod:`logging`, has been added to Python 2.3. It provides a powerful and flexible mechanism for generating logging output which can then be filtered and processed in various ways. A configuration file written in a standard format can be used to control the logging behavior of a program. Python includes handlers that will write log records to standard error or to a file or socket, send them to the system log, or even e-mail them to a particular address; of course, it's also possible to write your own handler classes.
uk: Стандартний пакет для запису журналів, :mod:`logging`, було додано до Python 2.3. Він забезпечує потужний і гнучкий механізм для генерації результатів журналювання, які потім можна фільтрувати та обробляти різними способами. Файл конфігурації, написаний у стандартному форматі, можна використовувати для керування поведінкою програми в журналі. Python включає обробники, які записуватимуть записи журналу до стандартної помилки або до файлу чи сокета, надсилатимуть їх до системного журналу чи навіть електронною поштою на певну адресу; звичайно, також можна написати власні класи обробників.

source: The :class:`Logger` class is the primary class. Most application code will deal with one or more :class:`Logger` objects, each one used by a particular subsystem of the application. Each :class:`Logger` is identified by a name, and names are organized into a hierarchy using ``.`` as the component separator. For example, you might have :class:`Logger` instances named ``server``, ``server.auth`` and ``server.network``. The latter two instances are below ``server`` in the hierarchy. This means that if you turn up the verbosity for ``server`` or direct ``server`` messages to a different handler, the changes will also apply to records logged to ``server.auth`` and ``server.network``. There's also a root :class:`Logger` that's the parent of all other loggers.
uk: Клас :class:`Logger` є основним класом. Більшість програмного коду працюватиме з одним або кількома об’єктами :class:`Logger`, кожен з яких використовується окремою підсистемою програми. Кожен :class:`Logger` ідентифікується за назвою, і імена організовані в ієрархію за допомогою ``.`` як розділювача компонентів. Наприклад, у вас можуть бути екземпляри :class:`Logger` з іменами ``server``, ``server.auth`` і ``server.network``. Останні два екземпляри знаходяться нижче ``сервера`` в ієрархії. Це означає, що якщо ви підвищите детальність для ``server`` або спрямуєте ``server`` повідомлення до іншого обробника, зміни також застосовуватимуться до записів, зареєстрованих у ``server.auth`` і ``server.network``. Існує також корінь :class:`Logger`, який є батьківським для всіх інших реєстраторів.

source: For simple uses, the :mod:`logging` package contains some convenience functions that always use the root log::
uk: Для простого використання пакет :mod:`logging` містить деякі зручні функції, які завжди використовують кореневий журнал::

source: This produces the following output::
uk: Це дає такий вихід:

source: In the default configuration, informational and debugging messages are suppressed and the output is sent to standard error. You can enable the display of informational and debugging messages by calling the :meth:`setLevel` method on the root logger.
uk: У конфігурації за замовчуванням інформаційні та налагоджувальні повідомлення пригнічуються, а вихід надсилається до стандартної помилки. Ви можете ввімкнути відображення інформаційних та налагоджувальних повідомлень, викликавши метод :meth:`setLevel` у кореневому реєстраторі.

source: Notice the :func:`warning` call's use of string formatting operators; all of the functions for logging messages take the arguments ``(msg, arg1, arg2, ...)`` and log the string resulting from ``msg % (arg1, arg2, ...)``.
uk: Зверніть увагу на використання виклику :func:`warning` операторів форматування рядків; усі функції для реєстрації повідомлень приймають аргументи ``(msg, arg1, arg2, ...)`` і записують рядок, що є результатом ``msg % (arg1, arg2, ...)``.

source: There's also an :func:`exception` function that records the most recent traceback. Any of the other functions will also record the traceback if you specify a true value for the keyword argument *exc_info*. ::
uk: Існує також функція :func:`exception`, яка записує останню трасування. Будь-яка інша функція також записуватиме зворотне відстеження, якщо ви вкажете справжнє значення для ключового аргументу *exc_info*. ::

source: Slightly more advanced programs will use a logger other than the root logger. The ``getLogger(name)`` function is used to get a particular log, creating it if it doesn't exist yet. ``getLogger(None)`` returns the root logger. ::
uk: Трохи просунутіші програми використовуватимуть інший реєстратор, ніж кореневий реєстратор. Функція ``getLogger(name)`` використовується для отримання певного журналу, створення його, якщо він ще не існує. ``getLogger(None)`` повертає кореневий реєстратор. ::

source: Log records are usually propagated up the hierarchy, so a message logged to ``server.auth`` is also seen by ``server`` and ``root``, but a :class:`Logger` can prevent this by setting its :attr:`propagate` attribute to :const:`False`.
uk: Записи журналу зазвичай поширюються вгору по ієрархії, тому повідомлення, зареєстроване на ``server.auth``, також бачать ``server`` і ``root``, але :class:`Logger` може запобігти цьому, встановивши його атрибут :attr:`propagate` до :const:`False`.

source: There are more classes provided by the :mod:`logging` package that can be customized. When a :class:`Logger` instance is told to log a message, it creates a :class:`LogRecord` instance that is sent to any number of different :class:`Handler` instances. Loggers and handlers can also have an attached list of filters, and each filter can cause the :class:`LogRecord` to be ignored or can modify the record before passing it along. When they're finally output, :class:`LogRecord` instances are converted to text by a :class:`Formatter` class. All of these classes can be replaced by your own specially-written classes.
uk: У пакеті :mod:`logging` є більше класів, які можна налаштувати. Коли примірнику :class:`Logger` наказано зареєструвати повідомлення, він створює примірник :class:`LogRecord`, який надсилається будь-якій кількості різних примірників :class:`Handler`. Реєстратори та обробники також можуть мати прикріплений список фільтрів, і кожен фільтр може призвести до ігнорування :class:`LogRecord` або може змінити запис перед його передачею. Коли вони нарешті виводяться, екземпляри :class:`LogRecord` перетворюються на текст класом :class:`Formatter`. Усі ці заняття можна замінити власними, спеціально написаними заняттями.

source: With all of these features the :mod:`logging` package should provide enough flexibility for even the most complicated applications. This is only an incomplete overview of its features, so please see the package's reference documentation for all of the details. Reading :pep:`282` will also be helpful.
uk: З усіма цими функціями пакет :mod:`logging` має забезпечити достатню гнучкість навіть для найскладніших програм. Це лише неповний огляд його функцій, тому, будь ласка, перегляньте довідкову документацію пакета, щоб отримати всі деталі. Читання :pep:`282` також буде корисним.

source: :pep:`282` - A Logging System
uk: :pep:`282` - Система реєстрації

source: Written by Vinay Sajip and Trent Mick; implemented by Vinay Sajip.
uk: Автори: Віней Саджип і Трент Мік; реалізовано Вінаєм Саджипом.

source: PEP 285: A Boolean Type
uk: PEP 285: логічний тип

source: A Boolean type was added to Python 2.3. Two new constants were added to the :mod:`__builtin__` module, :const:`True` and :const:`False`. (:const:`True` and :const:`False` constants were added to the built-ins in Python 2.2.1, but the 2.2.1 versions are simply set to integer values of 1 and 0 and aren't a different type.)
uk: Логічний тип було додано до Python 2.3. Дві нові константи додано до модуля :mod:`__builtin__`, :const:`True` і :const:`False`. (:const:`True` і :const:`False` константи були додані до вбудованих компонентів у Python 2.2.1, але версії 2.2.1 просто встановлені на цілі значення 1 і 0 і не відрізняються типу.)

source: The type object for this new type is named :class:`bool`; the constructor for it takes any Python value and converts it to :const:`True` or :const:`False`. ::
uk: Об’єкт типу для цього нового типу називається :class:`bool`; конструктор для нього приймає будь-яке значення Python і перетворює його на :const:`True` або :const:`False`. ::

source: Most of the standard library modules and built-in functions have been changed to return Booleans. ::
uk: Більшість стандартних бібліотечних модулів і вбудованих функцій було змінено для повернення логічних значень. ::

source: Python's Booleans were added with the primary goal of making code clearer. For example, if you're reading a function and encounter the statement ``return 1``, you might wonder whether the ``1`` represents a Boolean truth value, an index, or a coefficient that multiplies some other quantity. If the statement is ``return True``, however, the meaning of the return value is quite clear.
uk: Логічні значення Python були додані з головною метою зробити код зрозумілішим. Наприклад, якщо ви читаєте функцію та зустрічаєте оператор ``повернути 1``, ви можете запитати, чи ``1`` представляє логічне значення істинності, індекс або коефіцієнт, який множить якусь іншу величину. Однак, якщо оператор ``повернути Істину``, значення значення, що повертається, цілком зрозуміле.

source: Python's Booleans were *not* added for the sake of strict type-checking. A very strict language such as Pascal would also prevent you performing arithmetic with Booleans, and would require that the expression in an :keyword:`if` statement always evaluate to a Boolean result. Python is not this strict and never will be, as :pep:`285` explicitly says. This means you can still use any expression in an :keyword:`!if` statement, even ones that evaluate to a list or tuple or some random object. The Boolean type is a subclass of the :class:`int` class so that arithmetic using a Boolean still works. ::
uk: Логічні значення Python *не* додано задля суворої перевірки типу. Дуже сувора мова, така як Паскаль, також завадить вам виконувати арифметику з булевими значеннями, і вимагатиме, щоб вираз у операторі :keyword:`if` завжди обчислювався як логічний результат. Python не є таким суворим і ніколи не буде, про що прямо говорить :pep:`285`. Це означає, що ви все ще можете використовувати будь-який вираз у операторі :keyword:`!if`, навіть той, який обчислюється як список, кортеж або якийсь випадковий об’єкт. Логічний тип є підкласом класу :class:`int`, тому арифметика з використанням логічного значення все ще працює. ::

source: To sum up :const:`True` and :const:`False` in a sentence: they're alternative ways to spell the integer values 1 and 0, with the single difference that :func:`str` and :func:`repr` return the strings ``'True'`` and ``'False'`` instead of ``'1'`` and ``'0'``.
uk: Підводячи підсумок :const:`True` і :const:`False` у реченні: це альтернативні способи написання цілих значень 1 і 0, з тією єдиною різницею, що :func:`str` і :func:`repr` повертає рядки ``'True'`` і ``'False'`` замість ``'1'`` і ``'0'``.

source: :pep:`285` - Adding a bool type
uk: :pep:`285` - Додавання типу bool

source: Written and implemented by GvR.
uk: Написано та реалізовано GvR.

source: PEP 293: Codec Error Handling Callbacks
uk: PEP 293: Зворотні виклики обробки помилок кодека

source: When encoding a Unicode string into a byte string, unencodable characters may be encountered. So far, Python has allowed specifying the error processing as either "strict" (raising :exc:`UnicodeError`), "ignore" (skipping the character), or "replace" (using a question mark in the output string), with "strict" being the default behavior. It may be desirable to specify alternative processing of such errors, such as inserting an XML character reference or HTML entity reference into the converted string.
uk: Під час кодування рядка Юнікод у рядок байтів можуть зустрітися некодовані символи. Наразі Python дозволяв вказувати обробку помилок як "строгу" (викликаючи :exc:`UnicodeError`), "ігнорувати" (пропускаючи символ) або "замінювати" (використовуючи знак питання у вихідному рядку), з "суворий" є поведінкою за замовчуванням. Може бути бажано вказати альтернативну обробку таких помилок, таку як вставка посилання на символ XML або посилання на сутність HTML у перетворений рядок.

source: Python now has a flexible framework to add different processing strategies. New error handlers can be added with :func:`codecs.register_error`, and codecs then can access the error handler with :func:`codecs.lookup_error`. An equivalent C API has been added for codecs written in C. The error handler gets the necessary state information such as the string being converted, the position in the string where the error was detected, and the target encoding. The handler can then either raise an exception or return a replacement string.
uk: Python тепер має гнучку структуру для додавання різних стратегій обробки. Нові обробники помилок можна додати за допомогою :func:`codecs.register_error`, а потім кодеки зможуть отримати доступ до обробника помилок за допомогою :func:`codecs.lookup_error`. Для кодеків, написаних мовою C, додано еквівалентний C API. Обробник помилок отримує необхідну інформацію про стан, таку як рядок, який перетворюється, позиція в рядку, де було виявлено помилку, і цільове кодування. Тоді обробник може викликати виняток або повернути рядок заміни.

source: Two additional error handlers have been implemented using this framework: "backslashreplace" uses Python backslash quoting to represent unencodable characters and "xmlcharrefreplace" emits XML character references.
uk: За допомогою цього фреймворку було реалізовано два додаткові обробники помилок: "backslashreplace" використовує лапки Python для представлення некодованих символів, а "xmlcharrefreplace" видає посилання на символи XML.

source: :pep:`293` - Codec Error Handling Callbacks
uk: :pep:`293` - Помилка кодека при обробці зворотних викликів

source: Written and implemented by Walter Dörwald.
uk: Написав і реалізував Вальтер Дьорвальд.

source: PEP 301: Package Index and Metadata for Distutils
uk: PEP 301: Індекс пакетів і метадані для Distutils

source: Support for the long-requested Python catalog makes its first appearance in 2.3.
uk: Підтримка давно запитуваного каталогу Python вперше з’являється у 2.3.

source: The heart of the catalog is the new Distutils :command:`register` command. Running ``python setup.py register`` will collect the metadata describing a package, such as its name, version, maintainer, description, &c., and send it to a central catalog server. The resulting catalog is available from https://pypi.org.
uk: Серцем каталогу є нова команда Distutils :command:`register`. Запуск ``python setup.py register`` збирає метадані, що описують пакунок, наприклад його назву, версію, супроводжуючого, опис тощо, і надсилає їх на центральний сервер каталогу. Отриманий каталог доступний за адресою https://pypi.org.

source: To make the catalog a bit more useful, a new optional *classifiers* keyword argument has been added to the Distutils :func:`setup` function. A list of `Trove <http://catb.org/~esr/trove/>`_-style strings can be supplied to help classify the software.
uk: Щоб зробити каталог трохи кориснішим, до функції Distutils :func:`setup` додано новий необов’язковий аргумент ключового слова *classifiers*. Можна надати список рядків у стилі `Trove <http://catb.org/~esr/trove/>`_, щоб допомогти класифікувати програмне забезпечення.

source: Here's an example :file:`setup.py` with classifiers, written to be compatible with older versions of the Distutils::
uk: Ось приклад :file:`setup.py` з класифікаторами, написаними для сумісності зі старішими версіями Distutils::

source: The full list of classifiers can be obtained by running ``python setup.py register --list-classifiers``.
uk: Повний список класифікаторів можна отримати, запустивши ``python setup.py register --list-classifiers``.

source: :pep:`301` - Package Index and Metadata for Distutils
uk: :pep:`301` - Індекс пакета та метадані для Distutils

source: Written and implemented by Richard Jones.
uk: Написаний і реалізований Річардом Джонсом.

source: PEP 302: New Import Hooks
uk: PEP 302: нові імпортні гачки

source: While it's been possible to write custom import hooks ever since the :mod:`ihooks` module was introduced in Python 1.3, no one has ever been really happy with it because writing new import hooks is difficult and messy. There have been various proposed alternatives such as the :mod:`imputil` and :mod:`iu` modules, but none of them has ever gained much acceptance, and none of them were easily usable from C code.
uk: Хоча з моменту появи модуля :mod:`ihooks` у Python 1.3 стало можливим писати користувацькі хуки імпорту, ніхто ніколи не був цим дуже задоволений, тому що писати нові хуки імпорту складно та безладно. Існували різні запропоновані альтернативи, такі як модулі :mod:`imputil` і :mod:`iu`, але жоден з них ніколи не отримав великого визнання, і жоден з них не був легким для використання з коду C.

source: :pep:`302` borrows ideas from its predecessors, especially from Gordon McMillan's :mod:`iu` module. Three new items are added to the :mod:`sys` module:
uk: :pep:`302` запозичив ідеї у своїх попередників, особливо у модуля :mod:`iu` Гордона МакМіллана. До модуля :mod:`sys` додано три нові елементи:

source: ``sys.path_hooks`` is a list of callable objects; most often they'll be classes. Each callable takes a string containing a path and either returns an importer object that will handle imports from this path or raises an :exc:`ImportError` exception if it can't handle this path.
uk: ``sys.path_hooks`` - це список викликаних об'єктів; найчастіше це будуть класи. Кожен виклик приймає рядок, що містить шлях, і або повертає об’єкт імпортера, який оброблятиме імпорт із цього шляху, або викликає виняток :exc:`ImportError`, якщо він не може обробити цей шлях.

source: ``sys.path_importer_cache`` caches importer objects for each path, so ``sys.path_hooks`` will only need to be traversed once for each path.
uk: ``sys.path_importer_cache`` кешує об’єкти імпортера для кожного шляху, тому ``sys.path_hooks`` потрібно буде пройти лише один раз для кожного шляху.

source: ``sys.meta_path`` is a list of importer objects that will be traversed before ``sys.path`` is checked. This list is initially empty, but user code can add objects to it. Additional built-in and frozen modules can be imported by an object added to this list.
uk: ``sys.meta_path`` - це список об’єктів імпортера, які будуть проходити перед перевіркою ``sys.path``. Спочатку цей список порожній, але код користувача може додавати до нього об’єкти. Додаткові вбудовані та заморожені модулі можуть бути імпортовані об’єктом, доданим до цього списку.

source: Importer objects must have a single method, ``find_module(fullname, path=None)``. *fullname* will be a module or package name, e.g. ``string`` or ``distutils.core``. :meth:`find_module` must return a loader object that has a single method, ``load_module(fullname)``, that creates and returns the corresponding module object.
uk: Об’єкти імпортера повинні мати єдиний метод, ``find_module(fullname, path=None)``. *fullname* буде назвою модуля або пакета, наприклад. ``string`` або ``distutils.core``. :meth:`find_module` має повертати об’єкт завантажувача, який має один метод, ``load_module(fullname)``, який створює та повертає відповідний об’єкт модуля.
