Repository: python/python-docs-uk
Catalog: whatsnew/2.3.po
Languages: uk

source: The :mod:`random` module now uses a new algorithm, the Mersenne Twister, implemented in C. It's faster and more extensively studied than the previous algorithm.
uk: Модуль :mod:`random` тепер використовує новий алгоритм, Mersenne Twister, реалізований у C. Він швидший і детальніше вивчений, ніж попередній алгоритм.

source: (All changes contributed by Raymond Hettinger.)
uk: (Усі зміни внесено Реймондом Геттінгером.)

source: The :mod:`readline` module also gained a number of new functions: :func:`get_history_item`, :func:`get_current_history_length`, and :func:`redisplay`.
uk: Модуль :mod:`readline` також отримав низку нових функцій: :func:`get_history_item`, :func:`get_current_history_length` і :func:`redisplay`.

source: The :mod:`rexec` and :mod:`Bastion` modules have been declared dead, and attempts to import them will fail with a :exc:`RuntimeError`. New-style classes provide new ways to break out of the restricted execution environment provided by :mod:`rexec`, and no one has interest in fixing them or time to do so. If you have applications using :mod:`rexec`, rewrite them to use something else.
uk: Модулі :mod:`rexec` і :mod:`Bastion` оголошено мертвими, і спроби їх імпортувати будуть невдалими з :exc:`RuntimeError`. Класи нового стилю надають нові способи виходу з обмеженого середовища виконання, наданого :mod:`rexec`, і ніхто не зацікавлений у їх виправленні чи часу для цього. Якщо у вас є програми, які використовують :mod:`rexec`, перепишіть їх, щоб використовувати щось інше.

source: (Sticking with Python 2.2 or 2.1 will not make your applications any safer because there are known bugs in the :mod:`rexec` module in those versions. To repeat: if you're using :mod:`rexec`, stop using it immediately.)
uk: (Дотримання Python 2.2 або 2.1 не зробить ваші програми безпечнішими, оскільки в модулі :mod:`rexec` у цих версіях є відомі помилки. Повторюю: якщо ви використовуєте :mod:`rexec`, припиніть його використовувати негайно.)

source: The :mod:`rotor` module has been deprecated because the algorithm it uses for encryption is not believed to be secure. If you need encryption, use one of the several AES Python modules that are available separately.
uk: Модуль :mod:`rotor` застарів, оскільки алгоритм, який він використовує для шифрування, вважається небезпечним. Якщо вам потрібне шифрування, скористайтеся одним із кількох модулів AES Python, які доступні окремо.

source: The :mod:`shutil` module gained a ``move(src, dest)`` function that recursively moves a file or directory to a new location.
uk: Модуль :mod:`shutil` отримав функцію ``move(src, dest)``, яка рекурсивно переміщує файл або каталог до нового розташування.

source: Support for more advanced POSIX signal handling was added to the :mod:`signal` but then removed again as it proved impossible to make it work reliably across platforms.
uk: Підтримку вдосконаленої обробки сигналів POSIX було додано до :mod:`signal`, але потім знову вилучено, оскільки виявилося неможливим забезпечити його надійну роботу на різних платформах.

source: The :mod:`socket` module now supports timeouts. You can call the ``settimeout(t)`` method on a socket object to set a timeout of *t* seconds. Subsequent socket operations that take longer than *t* seconds to complete will abort and raise a :exc:`socket.timeout` exception.
uk: Модуль :mod:`socket` тепер підтримує тайм-аути. Ви можете викликати метод ``settimeout(t)`` для об’єкта сокета, щоб встановити час очікування *t* секунд. Подальші операції з сокетом, які тривають більше *t* секунд, перериваються та викликають виняток :exc:`socket.timeout`.

source: The original timeout implementation was by Tim O'Malley. Michael Gilfix integrated it into the Python :mod:`socket` module and shepherded it through a lengthy review. After the code was checked in, Guido van Rossum rewrote parts of it. (This is a good example of a collaborative development process in action.)
uk: Оригінальна реалізація тайм-ауту була створена Тімом О'Меллі. Майкл Гілфікс інтегрував його в модуль Python :mod:`socket` і перевірив його через довгий огляд. Після перевірки коду Гвідо ван Россум переписав його частини. (Це хороший приклад процесу спільної розробки в дії.)

source: On Windows, the :mod:`socket` module now ships with Secure Sockets Layer (SSL) support.
uk: У Windows модуль :mod:`socket` тепер поставляється з підтримкою Secure Sockets Layer (SSL).

source: The value of the C :const:`PYTHON_API_VERSION` macro is now exposed at the Python level as ``sys.api_version``. The current exception can be cleared by calling the new :func:`sys.exc_clear` function.
uk: Значення макросу C :const:`PYTHON_API_VERSION` тепер доступне на рівні Python як ``sys.api_version``. Поточний виняток можна очистити, викликавши нову функцію :func:`sys.exc_clear`.

source: The new :mod:`tarfile` module allows reading from and writing to :program:`tar`\ -format archive files. (Contributed by Lars Gustäbel.)
uk: Новий модуль :mod:`tarfile` дозволяє читати та записувати в архівні файли у форматі :program:`tar`\. (Надав Ларс Густебель.)

source: The new :mod:`textwrap` module contains functions for wrapping strings containing paragraphs of text. The ``wrap(text, width)`` function takes a string and returns a list containing the text split into lines of no more than the chosen width. The ``fill(text, width)`` function returns a single string, reformatted to fit into lines no longer than the chosen width. (As you can guess, :func:`fill` is built on top of :func:`wrap`. For example::
uk: Новий модуль :mod:`textwrap` містить функції для обтікання рядків, що містять абзаци тексту. Функція ``wrap(text, width)`` приймає рядок і повертає список, що містить текст, розбитий на рядки шириною не більше вибраного. Функція ``fill(text, width)`` повертає один рядок, переформатований, щоб поміститися в рядки, довжина яких не перевищує вибрану ширину. (Як ви можете здогадатися, :func:`fill` створено на основі :func:`wrap`. Наприклад::

source: The module also contains a :class:`TextWrapper` class that actually implements the text wrapping strategy. Both the :class:`TextWrapper` class and the :func:`wrap` and :func:`fill` functions support a number of additional keyword arguments for fine-tuning the formatting; consult the module's documentation for details. (Contributed by Greg Ward.)
uk: Модуль також містить клас :class:`TextWrapper`, який фактично реалізує стратегію обтікання текстом. Як клас :class:`TextWrapper`, так і функції :func:`wrap` і :func:`fill` підтримують низку додаткових ключових аргументів для точного налаштування форматування; подробиці дивіться в документації модуля. (Надав Грег Ворд.)

source: The :mod:`thread` and :mod:`threading` modules now have companion modules, :mod:`dummy_thread` and :mod:`dummy_threading`, that provide a do-nothing implementation of the :mod:`thread` module's interface for platforms where threads are not supported. The intention is to simplify thread-aware modules (ones that *don't* rely on threads to run) by putting the following code at the top::
uk: Модулі :mod:`thread` і :mod:`threading` тепер мають супутні модулі, :mod:`dummy_thread` і :mod:`dummy_threading`, які забезпечують бездіяльну реалізацію модуля :mod:`thread` інтерфейс для платформ, де потоки не підтримуються. Намір полягає в тому, щоб спростити модулі з підтримкою потоків (ті, які *не* покладаються на виконання потоків), розмістивши наступний код у верхній частині:

source: In this example, :mod:`_threading` is used as the module name to make it clear that the module being used is not necessarily the actual :mod:`threading` module. Code can call functions and use classes in :mod:`_threading` whether or not threads are supported, avoiding an :keyword:`if` statement and making the code slightly clearer. This module will not magically make multithreaded code run without threads; code that waits for another thread to return or to do something will simply hang forever.
uk: У цьому прикладі :mod:`_threading` використовується як назва модуля, щоб зрозуміти, що використовуваний модуль не обов’язково є справжнім модулем :mod:`threading`. Код може викликати функції та використовувати класи в :mod:`_threading` незалежно від того, підтримуються потоки чи ні, уникаючи оператора :keyword:`if` і роблячи код трохи зрозумілішим. Цей модуль магічним чином не змусить багатопоточний код працювати без потоків; код, який чекає, поки інший потік повернеться або щось зробить, просто зависне назавжди.

source: The :mod:`time` module's :func:`strptime` function has long been an annoyance because it uses the platform C library's :func:`strptime` implementation, and different platforms sometimes have odd bugs. Brett Cannon contributed a portable implementation that's written in pure Python and should behave identically on all platforms.
uk: Функція :func:`strptime` модуля :mod:`time` вже давно викликає роздратування, оскільки вона використовує реалізацію :func:`strptime` бібліотеки платформи C, і на різних платформах іноді трапляються дивні помилки. Бретт Кеннон зробив внесок у портативну реалізацію, яка написана на чистому Python і має однаково працювати на всіх платформах.

source: The new :mod:`timeit` module helps measure how long snippets of Python code take to execute. The :file:`timeit.py` file can be run directly from the command line, or the module's :class:`Timer` class can be imported and used directly. Here's a short example that figures out whether it's faster to convert an 8-bit string to Unicode by appending an empty Unicode string to it or by using the :func:`unicode` function::
uk: Новий модуль :mod:`timeit` допомагає виміряти, скільки часу потрібно для виконання фрагментів коду Python. Файл :file:`timeit.py` можна запустити безпосередньо з командного рядка, або клас :class:`Timer` модуля можна імпортувати та використовувати безпосередньо. Ось короткий приклад, який показує, чи можна швидше перетворити 8-бітний рядок на Unicode, додавши до нього порожній рядок Unicode або використовуючи функцію :func:`unicode`::

source: The :mod:`Tix` module has received various bug fixes and updates for the current version of the Tix package.
uk: Модуль :mod:`Tix` отримав різні виправлення помилок і оновлення для поточної версії пакета Tix.

source: The :mod:`Tkinter` module now works with a thread-enabled version of Tcl. Tcl's threading model requires that widgets only be accessed from the thread in which they're created; accesses from another thread can cause Tcl to panic. For certain Tcl interfaces, :mod:`Tkinter` will now automatically avoid this when a widget is accessed from a different thread by marshalling a command, passing it to the correct thread, and waiting for the results. Other interfaces can't be handled automatically but :mod:`Tkinter` will now raise an exception on such an access so that you can at least find out about the problem. See https://mail.python.org/pipermail/python-dev/2002-December/031107.html for a more detailed explanation of this change. (Implemented by Martin von Löwis.)
uk: Модуль :mod:`Tkinter` тепер працює з версією Tcl з підтримкою потоків. Потокова модель Tcl вимагає, щоб доступ до віджетів здійснювався лише з потоку, в якому вони створені; доступ з іншого потоку може спричинити паніку Tcl. Для певних інтерфейсів Tcl :mod:`Tkinter` тепер автоматично уникатиме цього, коли доступ до віджету здійснюється з іншого потоку, розподіляючи команду, передаючи її правильному потоку та чекаючи на результати. Інші інтерфейси не можна обробляти автоматично, але :mod:`Tkinter` тепер створить виняток для такого доступу, щоб ви могли принаймні дізнатися про проблему. Дивіться https://mail.python.org/pipermail/python-dev/2002-December/031107.html для більш детального пояснення цієї зміни. (Реалізовано Мартіном фон Льовісом.)

source: Calling Tcl methods through :mod:`_tkinter` no longer returns only strings. Instead, if Tcl returns other objects those objects are converted to their Python equivalent, if one exists, or wrapped with a :class:`_tkinter.Tcl_Obj` object if no Python equivalent exists. This behavior can be controlled through the :meth:`wantobjects` method of :class:`tkapp` objects.
uk: Виклик методів Tcl через :mod:`_tkinter` більше не повертає лише рядки. Натомість, якщо Tcl повертає інші об’єкти, ці об’єкти перетворюються на їхній еквівалент Python, якщо такий існує, або загортаються в об’єкт :class:`_tkinter.Tcl_Obj`, якщо еквівалент Python не існує. Цією поведінкою можна керувати за допомогою методу :meth:`wantobjects` об’єктів :class:`tkapp`.

source: When using :mod:`_tkinter` through the :mod:`Tkinter` module (as most Tkinter applications will), this feature is always activated. It should not cause compatibility problems, since Tkinter would always convert string results to Python types where possible.
uk: Під час використання :mod:`_tkinter` через модуль :mod:`Tkinter` (як у більшості програм Tkinter), ця функція завжди активна. Це не повинно викликати проблем із сумісністю, оскільки Tkinter завжди перетворюватиме результати рядків у типи Python, де це можливо.

source: If any incompatibilities are found, the old behavior can be restored by setting the :attr:`wantobjects` variable in the :mod:`Tkinter` module to false before creating the first :class:`tkapp` object. ::
uk: Якщо буде виявлено будь-яку несумісність, стару поведінку можна відновити, встановивши для змінної :attr:`wantobjects` у модулі :mod:`Tkinter` значення false перед створенням першого об’єкта :class:`tkapp`. ::

source: Any breakage caused by this change should be reported as a bug.
uk: Будь-яку поломку, спричинену цією зміною, слід повідомити як помилку.

source: The :mod:`UserDict` module has a new :class:`DictMixin` class which defines all dictionary methods for classes that already have a minimum mapping interface. This greatly simplifies writing classes that need to be substitutable for dictionaries, such as the classes in the :mod:`shelve` module.
uk: Модуль :mod:`UserDict` має новий клас :class:`DictMixin`, який визначає всі методи словника для класів, які вже мають мінімальний інтерфейс відображення. Це значно спрощує написання класів, які мають бути замінними словниками, наприклад класів у модулі :mod:`shelve`.

source: Adding the mix-in as a superclass provides the full dictionary interface whenever the class defines :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__`, and :meth:`keys`. For example::
uk: Додавання суміші як суперкласу надає повний інтерфейс словника щоразу, коли клас визначає :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__` та :meth:`keys`. Наприклад::

source: (Contributed by Raymond Hettinger.)
uk: (Надав Реймонд Геттінгер.)

source: The DOM implementation in :mod:`xml.dom.minidom` can now generate XML output in a particular encoding by providing an optional encoding argument to the :meth:`toxml` and :meth:`toprettyxml` methods of DOM nodes.
uk: Реалізація DOM у :mod:`xml.dom.minidom` тепер може генерувати вивід XML у певному кодуванні, надаючи необов’язковий аргумент кодування для методів :meth:`toxml` і :meth:`toprettyxml` вузлів DOM.

source: The :mod:`xmlrpclib` module now supports an XML-RPC extension for handling nil data values such as Python's ``None``. Nil values are always supported on unmarshalling an XML-RPC response. To generate requests containing ``None``, you must supply a true value for the *allow_none* parameter when creating a :class:`Marshaller` instance.
uk: Модуль :mod:`xmlrpclib` тепер підтримує розширення XML-RPC для обробки нульових значень даних, таких як ``None`` Python. Нульові значення завжди підтримуються при демаршалінгу відповіді XML-RPC. Щоб генерувати запити, які містять ``None``, ви повинні вказати справжнє значення для параметра *allow_none* під час створення екземпляра :class:`Marshaller`.

source: The new :mod:`DocXMLRPCServer` module allows writing self-documenting XML-RPC servers. Run it in demo mode (as a program) to see it in action. Pointing the web browser to the RPC server produces pydoc-style documentation; pointing xmlrpclib to the server allows invoking the actual methods. (Contributed by Brian Quinlan.)
uk: Новий модуль :mod:`DocXMLRPCServer` дозволяє писати самодокументовані сервери XML-RPC. Запустіть його в демонстраційному режимі (як програму), щоб побачити його в дії. Вказівка веб-браузера на сервер RPC створює документацію в стилі pydoc; вказівка xmlrpclib на сервер дозволяє викликати фактичні методи. (Надав Браян Квінлан.)

source: Support for internationalized domain names (RFCs 3454, 3490, 3491, and 3492) has been added. The "idna" encoding can be used to convert between a Unicode domain name and the ASCII-compatible encoding (ACE) of that name. ::
uk: Додано підтримку інтернаціоналізованих доменних імен (RFC 3454, 3490, 3491 і 3492). Кодування "idna" можна використовувати для перетворення між доменним іменем Unicode і ASCII-сумісним кодуванням (ACE) цього імені. ::

source: The :mod:`socket` module has also been extended to transparently convert Unicode hostnames to the ACE version before passing them to the C library. Modules that deal with hostnames such as :mod:`httplib` and :mod:`ftplib`) also support Unicode host names; :mod:`httplib` also sends HTTP ``Host`` headers using the ACE version of the domain name. :mod:`urllib` supports Unicode URLs with non-ASCII host names as long as the ``path`` part of the URL is ASCII only.
uk: Модуль :mod:`socket` також було розширено, щоб прозоро конвертувати імена хостів Unicode у версію ACE перед передачею їх до бібліотеки C. Модулі, що працюють з іменами хостів, наприклад :mod:`httplib` і :mod:`ftplib`), також підтримують імена хостів Unicode; :mod:`httplib` також надсилає заголовки HTTP ``Host``, використовуючи версію ACE доменного імені. :mod:`urllib` підтримує Unicode URL-адреси з іменами хостів, відмінними від ASCII, якщо частина URL-адреси ``path`` містить лише ASCII.

source: To implement this change, the :mod:`stringprep` module, the ``mkstringprep`` tool and the ``punycode`` encoding have been added.
uk: Для впровадження цієї зміни було додано модуль :mod:`stringprep`, інструмент ``mkstringprep`` і кодування ``punycode``.

source: Date/Time Type
uk: Тип дати/часу

source: Date and time types suitable for expressing timestamps were added as the :mod:`datetime` module. The types don't support different calendars or many fancy features, and just stick to the basics of representing time.
uk: Типи дати та часу, придатні для вираження позначок часу, були додані як модуль :mod:`datetime`. Типи не підтримують різні календарі чи багато модних функцій і лише дотримуються основ представлення часу.

source: The three primary types are: :class:`date`, representing a day, month, and year; :class:`~datetime.time`, consisting of hour, minute, and second; and :class:`~datetime.datetime`, which contains all the attributes of both :class:`date` and :class:`~datetime.time`. There's also a :class:`timedelta` class representing differences between two points in time, and time zone logic is implemented by classes inheriting from the abstract :class:`tzinfo` class.
uk: Три основні типи: :class:`date`, що представляє день, місяць і рік; :class:`~datetime.time`, що складається з години, хвилини та секунди; і :class:`~datetime.datetime`, який містить усі атрибути як :class:`date`, так і :class:`~datetime.time`. Існує також клас :class:`timedelta`, що представляє різницю між двома точками в часі, а логіка часового поясу реалізована класами, що успадковують абстрактний клас :class:`tzinfo`.

source: You can create instances of :class:`date` and :class:`~datetime.time` by either supplying keyword arguments to the appropriate constructor, e.g. ``datetime.date(year=1972, month=10, day=15)``, or by using one of a number of class methods. For example, the :meth:`date.today` class method returns the current local date.
uk: Ви можете створити екземпляри :class:`date` і :class:`~datetime.time`, надавши аргументи ключового слова у відповідний конструктор, наприклад. ``datetime.date(year=1972, month=10, day=15)`` або за допомогою одного з методів класу. Наприклад, метод класу :meth:`date.today` повертає поточну місцеву дату.

source: Once created, instances of the date/time classes are all immutable. There are a number of methods for producing formatted strings from objects::
uk: Після створення екземпляри класів дати/часу залишаються незмінними. Існує кілька методів створення форматованих рядків з об'єктів:

source: The :meth:`replace` method allows modifying one or more fields of a :class:`date` or :class:`~datetime.datetime` instance, returning a new instance::
uk: Метод :meth:`replace` дозволяє змінювати одне або більше полів екземпляра :class:`date` або :class:`~datetime.datetime`, повертаючи новий екземпляр:

source: Instances can be compared, hashed, and converted to strings (the result is the same as that of :meth:`isoformat`). :class:`date` and :class:`~datetime.datetime` instances can be subtracted from each other, and added to :class:`timedelta` instances. The largest missing feature is that there's no standard library support for parsing strings and getting back a :class:`date` or :class:`~datetime.datetime`.
uk: Екземпляри можна порівнювати, хешувати та перетворювати на рядки (результат такий самий, як у :meth:`isoformat`). Екземпляри :class:`date` і :class:`~datetime.datetime` можна відняти один від одного та додати до екземплярів :class:`timedelta`. Найбільша відсутня функція полягає в тому, що немає стандартної підтримки бібліотеки для аналізу рядків і повернення :class:`date` або :class:`~datetime.datetime`.

source: For more information, refer to the module's reference documentation. (Contributed by Tim Peters.)
uk: Для отримання додаткової інформації зверніться до довідкової документації модуля. (Надав Тім Пітерс.)

source: The optparse Module
uk: Модуль optparse

source: The :mod:`getopt` module provides simple parsing of command-line arguments. The new :mod:`optparse` module (originally named Optik) provides more elaborate command-line parsing that follows the Unix conventions, automatically creates the output for :option:`!--help`, and can perform different actions for different options.
uk: Модуль :mod:`getopt` забезпечує простий аналіз аргументів командного рядка. Новий модуль :mod:`optparse` (початкова назва Optik) забезпечує більш детальний аналіз командного рядка, який відповідає умовам Unix, автоматично створює вихід для :option:`!--help` і може виконувати різні дії для різних параметрів .

source: You start by creating an instance of :class:`OptionParser` and telling it what your program's options are. ::
uk: Ви починаєте зі створення екземпляра :class:`OptionParser` і повідомляєте йому, які параметри вашої програми. ::

source: Parsing a command line is then done by calling the :meth:`parse_args` method. ::
uk: Розбір командного рядка потім виконується викликом методу :meth:`parse_args`. ::

source: This returns an object containing all of the option values, and a list of strings containing the remaining arguments.
uk: Це повертає об’єкт, що містить усі значення параметрів, і список рядків, що містять решту аргументів.

source: Invoking the script with the various arguments now works as you'd expect it to. Note that the length argument is automatically converted to an integer.
uk: Виклик сценарію з різними аргументами тепер працює так, як ви очікували. Зауважте, що аргумент довжини автоматично перетворюється на ціле число.

source: The help message is automatically generated for you:
uk: Довідкове повідомлення генерується для вас автоматично:

source: See the module's documentation for more details.
uk: Додаткову інформацію дивіться в документації модуля.

source: Optik was written by Greg Ward, with suggestions from the readers of the Getopt SIG.
uk: Optik був написаний Грегом Уордом із пропозиціями читачів Getopt SIG.
