Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: Global symbols defined by the :mod:`ctypes` module are now prefixed with ``Py``, or with ``_ctypes``. (Implemented by Thomas Heller; :issue:`3102`.)
uk: Глобальні символи, визначені модулем :mod:`ctypes`, тепер мають префікс ``Py`` або ``_ctypes``. (Реалізовано Томасом Геллером; :issue:`3102`.)

source: New configure option: the :option:`!--with-system-expat` switch allows building the :mod:`pyexpat` module to use the system Expat library. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`7609`.)
uk: Нова опція конфігурації: перемикач :option:`!--with-system-expat` дозволяє створити модуль :mod:`pyexpat` для використання системної бібліотеки Expat. (Надано Arfrever Frehtes Taifersar Arahesis; :issue:`7609`.)

source: New configure option: the :option:`!--with-valgrind` option will now disable the pymalloc allocator, which is difficult for the Valgrind memory-error detector to analyze correctly. Valgrind will therefore be better at detecting memory leaks and overruns. (Contributed by James Henstridge; :issue:`2422`.)
uk: Новий параметр конфігурації: параметр :option:`!--with-valgrind` тепер вимикає розподільник pymalloc, який важко правильно аналізувати детектору помилок пам’яті Valgrind. Таким чином, Valgrind буде краще виявляти витоки пам’яті та перевантаження. (Надав Джеймс Хенстрідж; :issue:`2422`.)

source: New configure option: you can now supply an empty string to :option:`!--with-dbmliborder=` in order to disable all of the various DBM modules. (Added by Arfrever Frehtes Taifersar Arahesis; :issue:`6491`.)
uk: Новий параметр конфігурації: тепер ви можете надати порожній рядок :option:`!--with-dbmliborder=`, щоб вимкнути всі різні модулі DBM. (Додано Arfrever Frehtes Taifersar Arahesis; :issue:`6491`.)

source: The :program:`configure` script now checks for floating-point rounding bugs on certain 32-bit Intel chips and defines a :c:macro:`X87_DOUBLE_ROUNDING` preprocessor definition. No code currently uses this definition, but it's available if anyone wishes to use it. (Added by Mark Dickinson; :issue:`2937`.)
uk: Сценарій :program:`configure` тепер перевіряє помилки округлення з плаваючою комою на певних 32-розрядних мікросхемах Intel і визначає визначення препроцесора :c:macro:`X87_DOUBLE_ROUNDING`. Жоден код наразі не використовує це визначення, але воно доступне, якщо хтось захоче його використати. (Додав Марк Дікінсон; :issue:`2937`.)

source: :program:`configure` also now sets a :envvar:`LDCXXSHARED` Makefile variable for supporting C++ linking. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`1222585`.)
uk: :program:`configure` також тепер встановлює змінну :envvar:`LDCXXSHARED` Makefile для підтримки зв’язування C++. (Надано Arfrever Frehtes Taifersar Arahesis; :issue:`1222585`.)

source: The build process now creates the necessary files for pkg-config support. (Contributed by Clinton Roy; :issue:`3585`.)
uk: Тепер у процесі збирання створюються необхідні файли для підтримки pkg-config. (Надав Клінтон Рой; :issue:`3585`.)

source: The build process now supports Subversion 1.7. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`6094`.)
uk: Процес збирання тепер підтримує Subversion 1.7. (Надано Arfrever Frehtes Taifersar Arahesis; :issue:`6094`.)

source: Capsules
uk: Капсули

source: Python 3.1 adds a new C datatype, :c:type:`PyCapsule`, for providing a C API to an extension module. A capsule is essentially the holder of a C ``void *`` pointer, and is made available as a module attribute; for example, the :mod:`socket` module's API is exposed as ``socket.CAPI``, and :mod:`unicodedata` exposes ``ucnhash_CAPI``. Other extensions can import the module, access its dictionary to get the capsule object, and then get the ``void *`` pointer, which will usually point to an array of pointers to the module's various API functions.
uk: Python 3.1 додає новий тип даних C, :c:type:`PyCapsule`, для надання C API до модуля розширення. Капсула, по суті, є власником покажчика C ``void *`` і доступна як атрибут модуля; наприклад, API модуля :mod:`socket` представлено як ``socket.CAPI``, а :mod:`unicodedata` — ``ucnhash_CAPI``. Інші розширення можуть імпортувати модуль, отримати доступ до його словника, щоб отримати об’єкт капсули, а потім отримати покажчик ``void *``, який зазвичай вказує на масив покажчиків на різні функції API модуля.

source: There is an existing data type already used for this, :c:type:`PyCObject`, but it doesn't provide type safety. Evil code written in pure Python could cause a segmentation fault by taking a :c:type:`PyCObject` from module A and somehow substituting it for the :c:type:`PyCObject` in module B. Capsules know their own name, and getting the pointer requires providing the name:
uk: Для цього вже використовується існуючий тип даних, :c:type:`PyCObject`, але він не забезпечує безпеки типу. Злий код, написаний на чистому Python, може спричинити помилку сегментації, взявши :c:type:`PyCObject` з модуля A та якимось чином замінивши його на :c:type:`PyCObject` у модулі B. Капсули знають своє ім’я та отримання вказівника вимагає надання імені:

source: You are assured that ``vtable`` points to whatever you're expecting. If a different capsule was passed in, :c:func:`PyCapsule_IsValid` would detect the mismatched name and return false. Refer to :ref:`using-capsules` for more information on using these objects.
uk: Ви впевнені, що ``vtable`` вказує на те, що ви очікуєте. Якщо було передано іншу капсулу, :c:func:`PyCapsule_IsValid` виявить невідповідне ім’я та поверне false. Зверніться до :ref:`using-capsules` для отримання додаткової інформації про використання цих об’єктів.

source: Python 2.7 now uses capsules internally to provide various extension-module APIs, but the :c:func:`PyCObject_AsVoidPtr` was modified to handle capsules, preserving compile-time compatibility with the :c:type:`CObject` interface. Use of :c:func:`PyCObject_AsVoidPtr` will signal a :exc:`PendingDeprecationWarning`, which is silent by default.
uk: Python 2.7 тепер використовує внутрішньо капсули для надання різноманітних API модулів розширення, але :c:func:`PyCObject_AsVoidPtr` було змінено для обробки капсул, зберігаючи сумісність під час компіляції з інтерфейсом :c:type:`CObject`. Використання :c:func:`PyCObject_AsVoidPtr` сигналізує про :exc:`PendingDeprecationWarning`, яке за умовчанням мовчить.

source: Implemented in Python 3.1 and backported to 2.7 by Larry Hastings; discussed in :issue:`5630`.
uk: Реалізовано в Python 3.1 і перенесено до 2.7 Ларрі Гастінгсом; обговорено в :issue:`5630`.

source: Port-Specific Changes: Windows
uk: Зміни, що стосуються порту: Windows

source: The :mod:`msvcrt` module now contains some constants from the :file:`crtassem.h` header file: :data:`CRT_ASSEMBLY_VERSION`, :data:`VC_ASSEMBLY_PUBLICKEYTOKEN`, and :data:`LIBRARIES_ASSEMBLY_NAME_PREFIX`. (Contributed by David Cournapeau; :issue:`4365`.)
uk: Модуль :mod:`msvcrt` тепер містить деякі константи з файлу заголовків :file:`crtassem.h`: :data:`CRT_ASSEMBLY_VERSION`, :data:`VC_ASSEMBLY_PUBLICKEYTOKEN` і :data:`LIBRARIES_ASSEMBLY_NAME_PREFIX`. (Надав Девід Курнапо; :issue:`4365`.)

source: The :mod:`_winreg` module for accessing the registry now implements the :func:`~_winreg.CreateKeyEx` and :func:`~_winreg.DeleteKeyEx` functions, extended versions of previously-supported functions that take several extra arguments. The :func:`~_winreg.DisableReflectionKey`, :func:`~_winreg.EnableReflectionKey`, and :func:`~_winreg.QueryReflectionKey` were also tested and documented. (Implemented by Brian Curtin: :issue:`7347`.)
uk: Модуль :mod:`_winreg` для доступу до реєстру тепер реалізує функції :func:`~_winreg.CreateKeyEx` і :func:`~_winreg.DeleteKeyEx`, розширені версії раніше підтримуваних функцій, які приймають кілька додаткових аргументів. :func:`~_winreg.DisableReflectionKey`, :func:`~_winreg.EnableReflectionKey` і :func:`~_winreg.QueryReflectionKey` також були перевірені та задокументовані. (Реалізовано Brian Curtin: :issue:`7347`.)

source: The new :c:func:`_beginthreadex` API is used to start threads, and the native thread-local storage functions are now used. (Contributed by Kristján Valur Jónsson; :issue:`3582`.)
uk: Новий API :c:func:`_beginthreadex` використовується для запуску потоків, і тепер використовуються власні функції локального зберігання потоків. (Надав Крістіян Валур Йонссон; :issue:`3582`.)

source: The :func:`os.kill` function now works on Windows. The signal value can be the constants :const:`CTRL_C_EVENT`, :const:`CTRL_BREAK_EVENT`, or any integer. The first two constants will send :kbd:`Control-C` and :kbd:`Control-Break` keystroke events to subprocesses; any other value will use the :c:func:`TerminateProcess` API. (Contributed by Miki Tebeka; :issue:`1220212`.)
uk: Функція :func:`os.kill` тепер працює в Windows. Значенням сигналу можуть бути константи :const:`CTRL_C_EVENT`, :const:`CTRL_BREAK_EVENT` або будь-яке ціле число. Перші дві константи надсилатимуть події натискання клавіш :kbd:`Control-C` і :kbd:`Control-Break` до підпроцесів; будь-яке інше значення використовуватиме API :c:func:`TerminateProcess`. (Надав Мікі Тебека; :issue:`1220212`.)

source: The :func:`os.listdir` function now correctly fails for an empty path. (Fixed by Hirokazu Yamamoto; :issue:`5913`.)
uk: Функція :func:`os.listdir` тепер правильно не працює для порожнього шляху. (Виправлено Хірокадзу Ямамото; :issue:`5913`.)

source: The :mod:`mimelib` module will now read the MIME database from the Windows registry when initializing. (Patch by Gabriel Genellina; :issue:`4969`.)
uk: Модуль :mod:`mimelib` тепер читатиме базу даних MIME з реєстру Windows під час ініціалізації. (Патч від Gabriel Genellina; :issue:`4969`.)

source: Port-Specific Changes: Mac OS X
uk: Зміни, що стосуються порту: Mac OS X

source: The path ``/Library/Python/2.7/site-packages`` is now appended to ``sys.path``, in order to share added packages between the system installation and a user-installed copy of the same version. (Changed by Ronald Oussoren; :issue:`4865`.)
uk: Шлях ``/Library/Python/2.7/site-packages`` тепер додається до ``sys.path``, щоб спільно використовувати додані пакети між інсталяцією системи та копією тієї самої версії, встановленою користувачем. (Змінено Рональдом Оуссореном; :issue:`4865`.)

source: As of 2.7.13, this change was removed. ``/Library/Python/2.7/site-packages``, the site-packages directory used by the Apple-supplied system Python 2.7 is no longer appended to ``sys.path`` for user-installed Pythons such as from the python.org installers. As of macOS 10.12, Apple changed how the system site-packages directory is configured, which could cause installation of pip components, like setuptools, to fail. Packages installed for the system Python will no longer be shared with user-installed Pythons. (:issue:`28440`)
uk: Станом на 2.7.13 цю зміну було видалено. ``/Library/Python/2.7/site-packages``, каталог site-packages, який використовується системою Python 2.7, що надається Apple, більше не додається до ``sys.path`` для Python, встановлених користувачем, наприклад із інсталятори python.org. Починаючи з macOS 10.12, Apple змінила конфігурацію системного каталогу site-packages, що могло призвести до збою встановлення компонентів pip, як-от setuptools. Пакети, встановлені для системного Python, більше не будуть надані іншим Python, встановленим користувачами. (:issue:`28440`)

source: Port-Specific Changes: FreeBSD
uk: Зміни, що стосуються порту: FreeBSD

source: FreeBSD 7.1's :const:`SO_SETFIB` constant, used with :func:`~socket.getsockopt`/:func:`~socket.setsockopt` to select an alternate routing table, is now available in the :mod:`socket` module. (Added by Kyle VanderBeek; :issue:`8235`.)
uk: Константа FreeBSD 7.1 :const:`SO_SETFIB`, яка використовується з :func:`~socket.getsockopt`/:func:`~socket.setsockopt` для вибору альтернативної таблиці маршрутизації, тепер доступна в :mod:`socket` модуль. (Додав Кайл ВандерБік; :issue:`8235`.)

source: Other Changes and Fixes
uk: Інші зміни та виправлення

source: Two benchmark scripts, :file:`iobench` and :file:`ccbench`, were added to the :file:`Tools` directory. :file:`iobench` measures the speed of the built-in file I/O objects returned by :func:`open` while performing various operations, and :file:`ccbench` is a concurrency benchmark that tries to measure computing throughput, thread switching latency, and IO processing bandwidth when performing several tasks using a varying number of threads.
uk: Два сценарії тестування, :file:`iobench` і :file:`ccbench`, було додано до каталогу :file:`Tools`. :file:`iobench` вимірює швидкість вбудованих файлових об’єктів вводу/виводу, які повертає :func:`open` під час виконання різних операцій, а :file:`ccbench` є тестом паралелізму, який намагається виміряти пропускну здатність обчислень, затримка перемикання потоків і пропускна здатність обробки вводу/виводу під час виконання кількох завдань із використанням різної кількості потоків.

source: The :file:`Tools/i18n/msgfmt.py` script now understands plural forms in :file:`.po` files. (Fixed by Martin von Löwis; :issue:`5464`.)
uk: Сценарій :file:`Tools/i18n/msgfmt.py` тепер розуміє форми множини у файлах :file:`.po`. (Виправлено Мартіном фон Льовісом; :issue:`5464`.)

source: When importing a module from a :file:`.pyc` or :file:`.pyo` file with an existing :file:`.py` counterpart, the :attr:`co_filename` attributes of the resulting code objects are overwritten when the original filename is obsolete. This can happen if the file has been renamed, moved, or is accessed through different paths. (Patch by Ziga Seilnacht and Jean-Paul Calderone; :issue:`1180193`.)
uk: Під час імпортування модуля з файлу :file:`.pyc` або :file:`.pyo` з наявним аналогом :file:`.py` атрибути :attr:`co_filename` отриманих об’єктів коду перезаписуються, коли оригінальна назва файлу застаріла. Це може статися, якщо файл було перейменовано, переміщено або доступ до нього здійснюється різними шляхами. (Патч від Ziga Seilnacht і Jean-Paul Calderone; :issue:`1180193`.)

source: The :file:`regrtest.py` script now takes a :option:`!--randseed=` switch that takes an integer that will be used as the random seed for the :option:`!-r` option that executes tests in random order. The :option:`!-r` option also reports the seed that was used (Added by Collin Winter.)
uk: Сценарій :file:`regrtest.py` тепер приймає перемикач :option:`!--randseed=`, який приймає ціле число, яке використовуватиметься як випадкове початкове значення для параметра :option:`!-r`, який виконує тести у довільному порядку. Параметр :option:`!-r` також повідомляє про використане насіння (додано Колліном Вінтером).

source: Another :file:`regrtest.py` switch is :option:`!-j`, which takes an integer specifying how many tests run in parallel. This allows reducing the total runtime on multi-core machines. This option is compatible with several other options, including the :option:`!-R` switch which is known to produce long runtimes. (Added by Antoine Pitrou, :issue:`6152`.) This can also be used with a new :option:`!-F` switch that runs selected tests in a loop until they fail. (Added by Antoine Pitrou; :issue:`7312`.)
uk: Інший перемикач :file:`regrtest.py` — це :option:`!-j`, який приймає ціле число, що вказує, скільки тестів виконується паралельно. Це дозволяє зменшити загальний час роботи на багатоядерних машинах. Ця опція сумісна з кількома іншими опціями, включаючи перемикач :option:`!-R`, який, як відомо, забезпечує тривалий час роботи. (Додано Антуаном Пітру, :issue:`6152`.) Це також можна використовувати з новим перемикачем :option:`!-F`, який запускає вибрані тести в циклі, доки вони не завершаться. (Додав Антуан Пітру; :issue:`7312`.)

source: When executed as a script, the :file:`py_compile.py` module now accepts ``'-'`` as an argument, which will read standard input for the list of filenames to be compiled. (Contributed by Piotr Ożarowski; :issue:`8233`.)
uk: Коли модуль :file:`py_compile.py` виконується як сценарій, тепер приймає ``'-'`` як аргумент, який читатиме стандартний вхід для списку імен файлів, які потрібно скомпілювати. (Надав Пьотр Ожаровський; :issue:`8233`.)

source: Porting to Python 2.7
uk: Перенесення на Python 2.7

source: This section lists previously described changes and other bugfixes that may require changes to your code:
uk: У цьому розділі перераховані раніше описані зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді:

source: The :func:`range` function processes its arguments more consistently; it will now call :meth:`__int__` on non-float, non-integer arguments that are supplied to it. (Fixed by Alexander Belopolsky; :issue:`1533`.)
uk: Функція :func:`range` обробляє свої аргументи більш послідовно; тепер він викличе :meth:`__int__` для аргументів, що не є плаваючими, не цілими, які йому надаються. (Виправлено Олександром Белопольським; :issue:`1533`.)

source: The string :meth:`format` method changed the default precision used for floating-point and complex numbers from 6 decimal places to 12, which matches the precision used by :func:`str`. (Changed by Eric Smith; :issue:`5920`.)
uk: Метод string :meth:`format` змінив стандартну точність, що використовується для чисел з плаваючою комою та комплексних чисел, з 6 знаків після коми на 12, що відповідає точності, яку використовує :func:`str`. (Змінено Еріком Смітом; :issue:`5920`.)

source: Because of an optimization for the :keyword:`with` statement, the special methods :meth:`__enter__` and :meth:`__exit__` must belong to the object's type, and cannot be directly attached to the object's instance. This affects new-style classes (derived from :class:`object`) and C extension types. (:issue:`6101`.)
uk: Через оптимізацію оператора :keyword:`with` спеціальні методи :meth:`__enter__` і :meth:`__exit__` мають належати до типу об’єкта та не можуть бути безпосередньо приєднані до екземпляра об’єкта. Це впливає на класи нового стилю (похідні від :class:`object`) і типи розширень C. (:issue:`6101`.)

source: Due to a bug in Python 2.6, the *exc_value* parameter to :meth:`__exit__` methods was often the string representation of the exception, not an instance. This was fixed in 2.7, so *exc_value* will be an instance as expected. (Fixed by Florent Xicluna; :issue:`7853`.)
uk: Через помилку в Python 2.6 параметр *exc_value* для методів :meth:`__exit__` часто був рядковим представленням винятку, а не екземпляром. Це було виправлено у версії 2.7, тому *exc_value* буде екземпляром, як і очікувалося. (Виправлено Флорентом Ксіклюною; :issue:`7853`.)

source: In the standard library:
uk: У стандартній бібліотеці:

source: Operations with :class:`~datetime.datetime` instances that resulted in a year falling outside the supported range didn't always raise :exc:`OverflowError`. Such errors are now checked more carefully and will now raise the exception. (Reported by Mark Leander, patch by Anand B. Pillai and Alexander Belopolsky; :issue:`7150`.)
uk: Операції з екземплярами :class:`~datetime.datetime`, які призвели до того, що рік вийшов за межі підтримуваного діапазону, не завжди викликали :exc:`OverflowError`. Такі помилки тепер перевіряються більш ретельно, і тепер вони створюють винятки. (Повідомив Марк Леандер, виправлення Ананд Б. Піллаї та Олександр Белопольський; :issue:`7150`.)

source: When using :class:`~decimal.Decimal` instances with a string's :meth:`format` method, the default alignment was previously left-alignment. This has been changed to right-alignment, which might change the output of your programs. (Changed by Mark Dickinson; :issue:`6857`.)
uk: Під час використання екземплярів :class:`~decimal.Decimal` із методом :meth:`format` рядка раніше вирівнювання за замовчуванням було лівим. Це було змінено на вирівнювання за правим краєм, що може змінити вивід ваших програм. (Змінено Марком Дікінсоном; :issue:`6857`.)

source: Comparisons involving a signaling NaN value (or ``sNAN``) now signal :const:`~decimal.InvalidOperation` instead of silently returning a true or false value depending on the comparison operator. Quiet NaN values (or ``NaN``) are now hashable. (Fixed by Mark Dickinson; :issue:`7279`.)
uk: Порівняння, що включають сигнальне значення NaN (або ``sNAN``), тепер сигналізують :const:`~decimal.InvalidOperation` замість мовчки повертати значення true або false залежно від оператора порівняння. Тихі значення NaN (або ``NaN``) тепер можна хешувати. (Виправлено Марком Дікінсоном; :issue:`7279`.)

source: The ElementTree library, :mod:`xml.etree`, no longer escapes ampersands and angle brackets when outputting an XML processing instruction (which looks like `<?xml-stylesheet href="#style1"?>`) or comment (which looks like `<!-- comment -->`). (Patch by Neil Muller; :issue:`2746`.)
uk: Бібліотека ElementTree, :mod:`xml.etree`, більше не пропускає амперсанди та кутові дужки під час виведення інструкції обробки XML (яка виглядає як` <?xml-stylesheet href="#style1"?>`) або коментаря (яка виглядає як` <!-- comment -->`). (Патч Ніла Мюллера; :issue:`2746`.)

source: The :meth:`~StringIO.StringIO.readline` method of :class:`~StringIO.StringIO` objects now does nothing when a negative length is requested, as other file-like objects do. (:issue:`7348`).
uk: Метод :meth:`~StringIO.StringIO.readline` об’єктів :class:`~StringIO.StringIO` тепер нічого не робить, коли запитується від’ємна довжина, як це роблять інші файлоподібні об’єкти. (:issue:`7348`).

source: For C extensions:
uk: Для розширень C:

source: C extensions that use integer format codes with the ``PyArg_Parse*`` family of functions will now raise a :exc:`TypeError` exception instead of triggering a :exc:`DeprecationWarning` (:issue:`5080`).
uk: Розширення C, які використовують коди цілочисельного формату з сімейством функцій ``PyArg_Parse*``, тепер викликатимуть виняток :exc:`TypeError` замість того, щоб запускати :exc:`DeprecationWarning` (:issue:`5080`).

source: Use the new :c:func:`PyOS_string_to_double` function instead of the old :c:func:`PyOS_ascii_strtod` and :c:func:`PyOS_ascii_atof` functions, which are now deprecated.
uk: Використовуйте нову функцію :c:func:`PyOS_string_to_double` замість старих функцій :c:func:`PyOS_ascii_strtod` і :c:func:`PyOS_ascii_atof`, які зараз є застарілими.

source: For applications that embed Python:
uk: Для програм, які вбудовують Python:

source: The :c:func:`PySys_SetArgvEx` function was added, letting applications close a security hole when the existing :c:func:`PySys_SetArgv` function was used. Check whether you're calling :c:func:`PySys_SetArgv` and carefully consider whether the application should be using :c:func:`PySys_SetArgvEx` with *updatepath* set to false.
uk: Було додано функцію :c:func:`PySys_SetArgvEx`, яка дозволяє програмам закрити дірку в безпеці, коли використовується існуюча функція :c:func:`PySys_SetArgv`. Перевірте, чи викликаєте ви :c:func:`PySys_SetArgv`, і уважно обміркуйте, чи має програма використовувати :c:func:`PySys_SetArgvEx` зі значенням false для *updatepath*.

source: New Features Added to Python 2.7 Maintenance Releases
uk: Нові функції, додані до випусків обслуговування Python 2.7

source: New features may be added to Python 2.7 maintenance releases when the situation genuinely calls for it. Any such additions must go through the Python Enhancement Proposal process, and make a compelling case for why they can't be adequately addressed by either adding the new feature solely to Python 3, or else by publishing it on the Python Package Index.
uk: Нові функції можуть бути додані до технічних версій Python 2.7, коли цього справді вимагає ситуація. Будь-які такі доповнення повинні пройти через процес Python Enhancement Proposal і надати переконливий аргумент, чому їх не можна належним чином вирішити, додавши нову функцію виключно до Python 3, або опублікувавши її в індексі пакетів Python.
