Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: What's New in Python 2.7
uk: Що нового в Python 2.7

source: Author
uk: Автор

source: A.M. Kuchling (amk at amk.ca)
uk: A.M. Kuchling (amk в amk.ca)

source: This article explains the new features in Python 2.7. Python 2.7 was released on July 3, 2010.
uk: У цій статті пояснюється нові функції в Python 2.7. Python 2.7 був випущений 3 липня 2010 року.

source: Numeric handling has been improved in many ways, for both floating-point numbers and for the :class:`~decimal.Decimal` class. There are some useful additions to the standard library, such as a greatly enhanced :mod:`unittest` module, the :mod:`argparse` module for parsing command-line options, convenient :class:`~collections.OrderedDict` and :class:`~collections.Counter` classes in the :mod:`collections` module, and many other improvements.
uk: Обробку чисел було покращено багатьма способами, як для чисел з плаваючою комою, так і для класу :class:`~decimal.Decimal`. Є деякі корисні доповнення до стандартної бібліотеки, такі як значно покращений модуль :mod:`unittest`, модуль :mod:`argparse` для аналізу параметрів командного рядка, зручний :class:`~collections.OrderedDict` і :class:`~collections.Counter` класи в модулі :mod:`collections` та багато інших покращень.

source: Python 2.7 is planned to be the last of the 2.x releases, so we worked on making it a good release for the long term. To help with porting to Python 3, several new features from the Python 3.x series have been included in 2.7.
uk: Планується, що Python 2.7 стане останнім випуском 2.x, тому ми працювали над тим, щоб зробити його хорошим випуском у довгостроковій перспективі. Щоб допомогти з перенесенням на Python 3, кілька нових функцій із серії Python 3.x було включено у 2.7.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.7 at https://docs.python.org. If you want to understand the rationale for the design and implementation, refer to the PEP for a particular new feature or the issue on https://bugs.python.org in which a change was discussed. Whenever possible, "What's New in Python" links to the bug/patch item for each change.
uk: Ця стаття не намагається надати повну специфікацію нових функцій, натомість надає зручний огляд. Щоб отримати повну інформацію, зверніться до документації для Python 2.7 за адресою https://docs.python.org. Якщо ви хочете зрозуміти обґрунтування дизайну та реалізації, зверніться до PEP щодо конкретної нової функції або проблеми на https://bugs.python.org, у якій обговорювалася зміна. Коли це можливо, "Що нового в Python" посилається на елемент помилки/виправлення для кожної зміни.

source: The Future for Python 2.x
uk: Майбутнє для Python 2.x

source: Python 2.7 is the last major release in the 2.x series, as the Python maintainers have shifted the focus of their new feature development efforts to the Python 3.x series. This means that while Python 2 continues to receive bug fixes, and to be updated to build correctly on new hardware and versions of supported operated systems, there will be no new full feature releases for the language or standard library.
uk: Python 2.7 є останнім великим випуском серії 2.x, оскільки розробники Python перенесли фокус своїх зусиль щодо розробки нових функцій на серію Python 3.x. Це означає, що в той час як Python 2 продовжує отримувати виправлення помилок і буде оновлюватися для правильного створення на новому апаратному забезпеченні та версіях підтримуваних операційних систем, не буде нових випусків повних функцій для мови або стандартної бібліотеки.

source: However, while there is a large common subset between Python 2.7 and Python 3, and many of the changes involved in migrating to that common subset, or directly to Python 3, can be safely automated, some other changes (notably those associated with Unicode handling) may require careful consideration, and preferably robust automated regression test suites, to migrate effectively.
uk: Однак, хоча між Python 2.7 і Python 3 існує велика спільна підмножина, і багато змін, пов’язаних із переходом до цієї спільної підмножини або безпосередньо до Python 3, можна безпечно автоматизувати, деякі інші зміни (зокрема ті, що пов’язані з обробкою Unicode ) може вимагати ретельного розгляду та, бажано, надійних автоматизованих наборів регресійних тестів для ефективної міграції.

source: This means that Python 2.7 will remain in place for a long time, providing a stable and supported base platform for production systems that have not yet been ported to Python 3. The full expected lifecycle of the Python 2.7 series is detailed in :pep:`373`.
uk: Це означає, що Python 2.7 залишатиметься на місці протягом тривалого часу, забезпечуючи стабільну та підтримувану базову платформу для виробничих систем, які ще не перенесено на Python 3. Повний очікуваний життєвий цикл серії Python 2.7 детально описано в :pep:`373`.

source: Some key consequences of the long-term significance of 2.7 are:
uk: Ось деякі ключові наслідки довгострокового значення 2.7:

source: As noted above, the 2.7 release has a much longer period of maintenance when compared to earlier 2.x versions. Python 2.7 is currently expected to remain supported by the core development team (receiving security updates and other bug fixes) until at least 2020 (10 years after its initial release, compared to the more typical support period of 18--24 months).
uk: Як зазначалося вище, випуск 2.7 має набагато довший період обслуговування порівняно з попередніми версіями 2.x. Наразі очікується, що Python 2.7 підтримуватиметься основною командою розробників (отримаючи оновлення безпеки та інші виправлення помилок) принаймні до 2020 року (через 10 років після початкового випуску порівняно з типовішим періодом підтримки 18–24 місяців).

source: As the Python 2.7 standard library ages, making effective use of the Python Package Index (either directly or via a redistributor) becomes more important for Python 2 users. In addition to a wide variety of third party packages for various tasks, the available packages include backports of new modules and features from the Python 3 standard library that are compatible with Python 2, as well as various tools and libraries that can make it easier to migrate to Python 3. The `Python Packaging User Guide <https://packaging.python.org>`__ provides guidance on downloading and installing software from the Python Package Index.
uk: Оскільки стандартна бібліотека Python 2.7 старіє, ефективне використання індексу пакетів Python (пряме або через розповсюджувач) стає більш важливим для користувачів Python 2. На додаток до широкого спектру пакетів сторонніх розробників для різних завдань, доступні пакети включають бекпорти нових модулів і функцій із стандартної бібліотеки Python 3, які сумісні з Python 2, а також різні інструменти та бібліотеки, які можуть спростити перейдіть на Python 3. `Посібник користувача з упаковки Python <https://packaging.python.org>`__ містить вказівки щодо завантаження та встановлення програмного забезпечення з індексу пакетів Python.

source: While the preferred approach to enhancing Python 2 is now the publication of new packages on the Python Package Index, this approach doesn't necessarily work in all cases, especially those related to network security. In exceptional cases that cannot be handled adequately by publishing new or updated packages on PyPI, the Python Enhancement Proposal process may be used to make the case for adding new features directly to the Python 2 standard library. Any such additions, and the maintenance releases where they were added, will be noted in the :ref:`py27-maintenance-enhancements` section below.
uk: Хоча зараз кращим підходом до покращення Python 2 є публікація нових пакетів у індексі пакетів Python, цей підхід не обов’язково працює у всіх випадках, особливо у випадках, пов’язаних із безпекою мережі. У виняткових випадках, які не можуть бути належним чином оброблені шляхом публікації нових або оновлених пакетів на PyPI, процес Python Enhancement Proposal може бути використаний для аргументації додавання нових функцій безпосередньо до стандартної бібліотеки Python 2. Будь-які такі доповнення та версії обслуговування, де вони були додані, будуть зазначені в розділі :ref:`py27-maintenance-enhancements` нижче.

source: For projects wishing to migrate from Python 2 to Python 3, or for library and framework developers wishing to support users on both Python 2 and Python 3, there are a variety of tools and guides available to help decide on a suitable approach and manage some of the technical details involved. The recommended starting point is the :ref:`pyporting-howto` HOWTO guide.
uk: Для проектів, які бажають перейти з Python 2 на Python 3, або для розробників бібліотек і фреймворків, які бажають підтримувати користувачів як на Python 2, так і на Python 3, доступні різноманітні інструменти та посібники, які допоможуть вибрати відповідний підхід і керувати деякими з технічні деталі. Рекомендованою відправною точкою є :ref:`pyporting-howto` посібник HOWTO.

source: Changes to the Handling of Deprecation Warnings
uk: Зміни в обробці попереджень про припинення підтримки

source: For Python 2.7, a policy decision was made to silence warnings only of interest to developers by default. :exc:`DeprecationWarning` and its descendants are now ignored unless otherwise requested, preventing users from seeing warnings triggered by an application. This change was also made in the branch that became Python 3.2. (Discussed on stdlib-sig and carried out in :issue:`7319`.)
uk: Для Python 2.7 було прийнято політичне рішення за умовчанням вимикати попередження, які цікавлять лише розробників. :exc:`DeprecationWarning` та його нащадки тепер ігноруються, якщо не вказано інше, що запобігає перегляду попереджень, викликаних програмою. Цю зміну також було внесено у гілку, яка стала Python 3.2. (Обговорено на stdlib-sig і виконано в :issue:`7319`.)

source: In previous releases, :exc:`DeprecationWarning` messages were enabled by default, providing Python developers with a clear indication of where their code may break in a future major version of Python.
uk: У попередніх випусках повідомлення :exc:`DeprecationWarning` було ввімкнено за замовчуванням, надаючи розробникам Python чітке вказівку про те, де їхній код може бути зламаний у майбутній основній версії Python.

source: However, there are increasingly many users of Python-based applications who are not directly involved in the development of those applications. :exc:`DeprecationWarning` messages are irrelevant to such users, making them worry about an application that's actually working correctly and burdening application developers with responding to these concerns.
uk: Проте все більше користувачів програм на основі Python не беруть безпосередньої участі в розробці цих програм. Повідомлення :exc:`DeprecationWarning` не мають значення для таких користувачів, змушуючи їх турбуватися про програму, яка справді працює правильно, і обтяжуючи розробників програм реагуванням на ці проблеми.

source: You can re-enable display of :exc:`DeprecationWarning` messages by running Python with the :option:`-Wdefault <-W>` (short form: :option:`-Wd <-W>`) switch, or by setting the :envvar:`PYTHONWARNINGS` environment variable to ``"default"`` (or ``"d"``) before running Python. Python code can also re-enable them by calling ``warnings.simplefilter('default')``.
uk: Ви можете знову ввімкнути відображення повідомлень :exc:`DeprecationWarning`, запустивши Python із перемикачем :option:`-Wdefault <-W>` (коротка форма: :option:`-Wd <-W>`) або встановивши перемикач :envvar:`PYTHONWARNINGS` Перед запуском Python для змінної середовища установіть значення ``"default"`` (або ``"d"``). Код Python також може повторно ввімкнути їх, викликавши ``warnings.simplefilter('default')``.

source: The ``unittest`` module also automatically reenables deprecation warnings when running tests.
uk: Модуль ``unittest`` також автоматично повторно вмикає попередження про застаріле під час виконання тестів.

source: Python 3.1 Features
uk: Функції Python 3.1

source: Much as Python 2.6 incorporated features from Python 3.0, version 2.7 incorporates some of the new features in Python 3.1. The 2.x series continues to provide tools for migrating to the 3.x series.
uk: Подібно до того, як Python 2.6 включив функції з Python 3.0, версія 2.7 містить деякі нові функції в Python 3.1. Серія 2.x продовжує надавати інструменти для переходу на серію 3.x.

source: A partial list of 3.1 features that were backported to 2.7:
uk: Неповний список функцій 3.1, які були перенесені до 2.7:

source: The syntax for set literals (``{1,2,3}`` is a mutable set).
uk: Синтаксис літералів набору (``{1,2}`` є змінним набором).

source: Dictionary and set comprehensions (``{i: i*2 for i in range(3)}``).
uk: Словник і набір розуміння (``{i: i*2 for i in range(3)}``).

source: Multiple context managers in a single :keyword:`with` statement.
uk: Кілька менеджерів контексту в одному операторі :keyword:`with`.

source: A new version of the :mod:`io` library, rewritten in C for performance.
uk: Нова версія бібліотеки :mod:`io`, переписана на C для підвищення продуктивності.

source: The ordered-dictionary type described in :ref:`pep-0372`.
uk: Тип упорядкованого словника, описаний у :ref:`pep-0372`.

source: The new ``","`` format specifier described in :ref:`pep-0378`.
uk: Новий специфікатор формату ``","``, описаний у :ref:`pep-0378`.

source: The :class:`memoryview` object.
uk: Об’єкт :class:`memoryview`.

source: A small subset of the :mod:`importlib` module, `described below <#importlib-section>`__.
uk: Невелика підмножина модуля :mod:`importlib`, `описаного нижче <#importlib-section>`__.

source: The :func:`repr` of a float ``x`` is shorter in many cases: it's now based on the shortest decimal string that's guaranteed to round back to ``x``. As in previous versions of Python, it's guaranteed that ``float(repr(x))`` recovers ``x``.
uk: :func:`repr` числа з плаваючою точкою ``x`` у багатьох випадках коротше: тепер воно базується на найкоротшому десятковому рядку, який гарантовано повертає назад до ``x``. Як і в попередніх версіях Python, гарантовано, що ``float(repr(x))`` відновлює ``x``.

source: Float-to-string and string-to-float conversions are correctly rounded. The :func:`round` function is also now correctly rounded.
uk: Перетворення float-to-string і string-to-float правильно округлені. Функція :func:`round` також тепер правильно округлена.

source: The :c:type:`PyCapsule` type, used to provide a C API for extension modules.
uk: Тип :c:type:`PyCapsule`, який використовується для надання C API для модулів розширення.

source: The :c:func:`PyLong_AsLongAndOverflow` C API function.
uk: Функція C API :c:func:`PyLong_AsLongAndOverflow`.

source: Other new Python3-mode warnings include:
uk: Інші нові попередження режиму Python3 включають:

source: :func:`operator.isCallable` and :func:`operator.sequenceIncludes`, which are not supported in 3.x, now trigger warnings.
uk: :func:`operator.isCallable` і :func:`operator.sequenceIncludes`, які не підтримуються в 3.x, тепер викликають попередження.

source: The :option:`!-3` switch now automatically enables the :option:`!-Qwarn` switch that causes warnings about using classic division with integers and long integers.
uk: Перемикач :option:`!-3` тепер автоматично вмикає перемикач :option:`!-Qwarn`, який викликає попередження про використання класичного ділення на цілі та довгі цілі числа.

source: PEP 372: Adding an Ordered Dictionary to collections
uk: PEP 372: Додавання впорядкованого словника до колекцій

source: Regular Python dictionaries iterate over key/value pairs in arbitrary order. Over the years, a number of authors have written alternative implementations that remember the order that the keys were originally inserted. Based on the experiences from those implementations, 2.7 introduces a new :class:`~collections.OrderedDict` class in the :mod:`collections` module.
uk: Звичайні словники Python перебирають пари ключ/значення в довільному порядку. Протягом багатьох років кілька авторів написали альтернативні реалізації, які запам’ятовують порядок початкового вставлення ключів. Базуючись на досвіді цих реалізацій, 2.7 представляє новий клас :class:`~collections.OrderedDict` в модулі :mod:`collections`.

source: The :class:`~collections.OrderedDict` API provides the same interface as regular dictionaries but iterates over keys and values in a guaranteed order depending on when a key was first inserted::
uk: :class:`~collections.OrderedDict` API надає той самий інтерфейс, що й звичайні словники, але повторює ключі та значення в гарантованому порядку залежно від того, коли ключ було вперше вставлено::

source: If a new entry overwrites an existing entry, the original insertion position is left unchanged::
uk: Якщо новий запис перезаписує існуючий запис, вихідна позиція вставки залишається незмінною::

source: Deleting an entry and reinserting it will move it to the end::
uk: Видалення запису та повторне його вставлення перемістить його в кінець::

source: The :meth:`~collections.OrderedDict.popitem` method has an optional *last* argument that defaults to ``True``. If *last* is true, the most recently added key is returned and removed; if it's false, the oldest key is selected::
uk: Метод :meth:`~collections.OrderedDict.popitem` має додатковий *останній* аргумент, який за умовчанням має значення ``True``. Якщо *last* має значення true, повертається та видаляється останній доданий ключ; якщо він false, вибирається найстаріший ключ::

source: Comparing two ordered dictionaries checks both the keys and values, and requires that the insertion order was the same::
uk: Порівняння двох упорядкованих словників перевіряє як ключі, так і значення, і вимагає, щоб порядок вставки був однаковим:

source: Comparing an :class:`~collections.OrderedDict` with a regular dictionary ignores the insertion order and just compares the keys and values.
uk: Порівняння :class:`~collections.OrderedDict` зі звичайним словником ігнорує порядок вставки та просто порівнює ключі та значення.

source: How does the :class:`~collections.OrderedDict` work? It maintains a doubly-linked list of keys, appending new keys to the list as they're inserted. A secondary dictionary maps keys to their corresponding list node, so deletion doesn't have to traverse the entire linked list and therefore remains O(1).
uk: Як працює :class:`~collections.OrderedDict`? Він підтримує подвійний зв’язаний список ключів, додаючи нові ключі до списку, коли вони вставляються. Вторинний словник відображає ключі на відповідний вузол списку, тому для видалення не потрібно проходити весь пов’язаний список і, отже, залишається O(1).

source: The standard library now supports use of ordered dictionaries in several modules.
uk: Стандартна бібліотека тепер підтримує використання впорядкованих словників у кількох модулях.

source: The :mod:`ConfigParser` module uses them by default, meaning that configuration files can now be read, modified, and then written back in their original order.
uk: Модуль :mod:`ConfigParser` використовує їх за замовчуванням, тобто файли конфігурації тепер можна читати, змінювати та потім записувати назад у вихідному порядку.

source: The :meth:`~collections.somenamedtuple._asdict()` method for :func:`collections.namedtuple` now returns an ordered dictionary with the values appearing in the same order as the underlying tuple indices.
uk: Метод :meth:`~collections.somenamedtuple._asdict()` для :func:`collections.namedtuple` тепер повертає впорядкований словник із значеннями, що з’являються в тому самому порядку, що й базові індекси кортежу.

source: The :mod:`json` module's :class:`~json.JSONDecoder` class constructor was extended with an *object_pairs_hook* parameter to allow :class:`OrderedDict` instances to be built by the decoder. Support was also added for third-party tools like `PyYAML <http://pyyaml.org/>`_.
uk: Конструктор класу :class:`~json.JSONDecoder` модуля :mod:`json` було розширено параметром *object_pairs_hook*, щоб дозволити декодеру створювати екземпляри :class:`OrderedDict`. Також додано підтримку сторонніх інструментів, таких як `PyYAML <http://pyyaml.org/>`_.

source: :pep:`372` - Adding an ordered dictionary to collections
uk: :pep:`372` - Додавання впорядкованого словника до колекцій

source: PEP written by Armin Ronacher and Raymond Hettinger; implemented by Raymond Hettinger.
uk: PEP, написаний Арміном Роначером і Раймондом Геттінгером; реалізований Раймондом Хеттінгером.

source: PEP 378: Format Specifier for Thousands Separator
uk: PEP 378: Специфікатор формату для розділювача тисяч

source: To make program output more readable, it can be useful to add separators to large numbers, rendering them as 18,446,744,073,709,551,616 instead of 18446744073709551616.
uk: Щоб зробити вихідні дані програми більш читабельними, може бути корисно додати роздільники до великих чисел, відображаючи їх як 18,446,744,073,709,551,616 замість 18446744073709551616.

source: The fully general solution for doing this is the :mod:`locale` module, which can use different separators ("," in North America, "." in Europe) and different grouping sizes, but :mod:`locale` is complicated to use and unsuitable for multi-threaded applications where different threads are producing output for different locales.
uk: Повністю загальним рішенням для цього є модуль :mod:`locale`, який може використовувати різні роздільники ("," у Північній Америці, "." у Європі) і різні розміри групування, але :mod:`locale` є складним. для використання та непридатний для багатопоточних програм, де різні потоки створюють вихід для різних локалей.

source: Therefore, a simple comma-grouping mechanism has been added to the mini-language used by the :meth:`str.format` method. When formatting a floating-point number, simply include a comma between the width and the precision::
uk: Таким чином, до міні-мови, яка використовується методом :meth:`str.format`, додано простий механізм групування комами. Під час форматування числа з плаваючою комою просто додайте кому між шириною та точністю::

source: When formatting an integer, include the comma after the width:
uk: Форматуючи ціле число, додайте кому після ширини:

source: This mechanism is not adaptable at all; commas are always used as the separator and the grouping is always into three-digit groups. The comma-formatting mechanism isn't as general as the :mod:`locale` module, but it's easier to use.
uk: Цей механізм взагалі не адаптується; коми завжди використовуються як роздільники, а групування завжди відбувається у тризначні групи. Механізм форматування комами не такий загальний, як модуль :mod:`locale`, але ним простіше користуватися.

source: :pep:`378` - Format Specifier for Thousands Separator
uk: :pep:`378` - Специфікатор формату для розділювача тисяч

source: PEP written by Raymond Hettinger; implemented by Eric Smith.
uk: PEP, написаний Раймондом Геттінгером; реалізований Еріком Смітом.

source: PEP 389: The argparse Module for Parsing Command Lines
uk: PEP 389: Модуль argparse для розбору командних рядків

source: The :mod:`argparse` module for parsing command-line arguments was added as a more powerful replacement for the :mod:`optparse` module.
uk: Модуль :mod:`argparse` для аналізу аргументів командного рядка було додано як більш потужну заміну модулю :mod:`optparse`.
