Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: The :mod:`ctypes` module now always converts ``None`` to a C ``NULL`` pointer for arguments declared as pointers. (Changed by Thomas Heller; :issue:`4606`.) The underlying `libffi library <https://sourceware.org/libffi/>`__ has been updated to version 3.0.9, containing various fixes for different platforms. (Updated by Matthias Klose; :issue:`8142`.)
uk: Модуль :mod:`ctypes` тепер завжди перетворює ``None`` на покажчик C ``NULL`` для аргументів, оголошених як покажчики. (Змінено Томасом Хеллером; :issue:`4606`.) Базову `бібліотеку libffi <https://sourceware.org/libffi/>`__ було оновлено до версії 3.0.9, що містить різні виправлення для різних платформ. (Оновлено Маттіасом Клозе; :issue:`8142`.)

source: New method: the :mod:`datetime` module's :class:`~datetime.timedelta` class gained a :meth:`~datetime.timedelta.total_seconds` method that returns the number of seconds in the duration. (Contributed by Brian Quinlan; :issue:`5788`.)
uk: Новий метод: клас :class:`~datetime.timedelta` модуля :mod:`datetime` отримав метод :meth:`~datetime.timedelta.total_seconds`, який повертає кількість секунд у тривалості. (Надав Браян Квінлан; :issue:`5788`.)

source: New method: the :class:`~decimal.Decimal` class gained a :meth:`~decimal.Decimal.from_float` class method that performs an exact conversion of a floating-point number to a :class:`~decimal.Decimal`. This exact conversion strives for the closest decimal approximation to the floating-point representation's value; the resulting decimal value will therefore still include the inaccuracy, if any. For example, ``Decimal.from_float(0.1)`` returns ``Decimal('0.1000000000000000055511151231257827021181583404541015625')``. (Implemented by Raymond Hettinger; :issue:`4796`.)
uk: Новий метод: клас :class:`~decimal.Decimal` отримав метод класу :meth:`~decimal.Decimal.from_float`, який виконує точне перетворення числа з плаваючою комою в :class:`~decimal.Decimal`. Це точне перетворення прагне до найближчого десяткового наближення до значення представлення з плаваючою комою; тому отримане десяткове значення все одно включатиме похибку, якщо така є. Наприклад, ``Decimal.from_float(0.1)`` повертає ``Decimal('0.1000000000000000055511151231257827021181583404541015625')``. (Реалізовано Raymond Hettinger; :issue:`4796`.)

source: Comparing instances of :class:`~decimal.Decimal` with floating-point numbers now produces sensible results based on the numeric values of the operands. Previously such comparisons would fall back to Python's default rules for comparing objects, which produced arbitrary results based on their type. Note that you still cannot combine :class:`Decimal` and floating-point in other operations such as addition, since you should be explicitly choosing how to convert between float and :class:`~decimal.Decimal`. (Fixed by Mark Dickinson; :issue:`2531`.)
uk: Порівняння екземплярів :class:`~decimal.Decimal` з числами з плаваючою комою тепер дає розумні результати на основі числових значень операндів. Раніше такі порівняння поверталися до стандартних правил Python для порівняння об’єктів, які давали довільні результати на основі їх типу. Зауважте, що ви все ще не можете поєднувати :class:`Decimal` і число з плаваючою точкою в інших операціях, таких як додавання, оскільки вам слід явно вибирати спосіб конвертації між float і :class:`~decimal.Decimal`. (Виправлено Марком Дікінсоном; :issue:`2531`.)

source: The constructor for :class:`~decimal.Decimal` now accepts floating-point numbers (added by Raymond Hettinger; :issue:`8257`) and non-European Unicode characters such as Arabic-Indic digits (contributed by Mark Dickinson; :issue:`6595`).
uk: Конструктор для :class:`~decimal.Decimal` тепер приймає числа з плаваючою комою (додано Raymond Hettinger; :issue:`8257`) і неєвропейські символи Unicode, такі як арабсько-індійські цифри (надано Марком Дікінсоном; : випуск: `6595`).

source: Most of the methods of the :class:`~decimal.Context` class now accept integers as well as :class:`~decimal.Decimal` instances; the only exceptions are the :meth:`~decimal.Context.canonical` and :meth:`~decimal.Context.is_canonical` methods. (Patch by Juan José Conti; :issue:`7633`.)
uk: Більшість методів класу :class:`~decimal.Context` тепер приймають цілі числа, а також екземпляри :class:`~decimal.Decimal`; єдиним винятком є методи :meth:`~decimal.Context.canonical` і :meth:`~decimal.Context.is_canonical`. (Патч від Хуана Хосе Конті; :issue:`7633`.)

source: When using :class:`~decimal.Decimal` instances with a string's :meth:`~str.format` method, the default alignment was previously left-alignment. This has been changed to right-alignment, which is more sensible for numeric types. (Changed by Mark Dickinson; :issue:`6857`.)
uk: Під час використання екземплярів :class:`~decimal.Decimal` із методом :meth:`~str.format` рядка вирівнювання за замовчуванням раніше було лівим. Це було змінено на вирівнювання по правому краю, що є більш розумним для числових типів. (Змінено Марком Дікінсоном; :issue:`6857`.)

source: Comparisons involving a signaling NaN value (or ``sNAN``) now signal :const:`InvalidOperation` instead of silently returning a true or false value depending on the comparison operator. Quiet NaN values (or ``NaN``) are now hashable. (Fixed by Mark Dickinson; :issue:`7279`.)
uk: Порівняння, що включають сигнальне значення NaN (або ``sNAN``), тепер сигналізують :const:`InvalidOperation` замість мовчки повертати значення true або false залежно від оператора порівняння. Тихі значення NaN (або ``NaN``) тепер можна хешувати. (Виправлено Марком Дікінсоном; :issue:`7279`.)

source: The :mod:`difflib` module now produces output that is more compatible with modern :command:`diff`/:command:`patch` tools through one small change, using a tab character instead of spaces as a separator in the header giving the filename. (Fixed by Anatoly Techtonik; :issue:`7585`.)
uk: Модуль :mod:`difflib` тепер створює вивід, який є більш сумісним із сучасними інструментами :command:`diff`/:command:`patch` завдяки одній невеликій зміні, використовуючи символ табуляції замість пробілів як роздільник у заголовку, що дає ім'я файлу. (Виправлено Анатолієм Техтоніком; :issue:`7585`.)

source: The Distutils ``sdist`` command now always regenerates the :file:`MANIFEST` file, since even if the :file:`MANIFEST.in` or :file:`setup.py` files haven't been modified, the user might have created some new files that should be included. (Fixed by Tarek Ziadé; :issue:`8688`.)
uk: Команда Distutils ``sdist`` тепер завжди повторно генерує файл :file:`MANIFEST`, оскільки навіть якщо файли :file:`MANIFEST.in` або :file:`setup.py` не були змінені, користувач міг створити кілька нових файлів, які слід включити. (Виправлено Тареком Зіаде; :issue:`8688`.)

source: The :mod:`doctest` module's :const:`IGNORE_EXCEPTION_DETAIL` flag will now ignore the name of the module containing the exception being tested. (Patch by Lennart Regebro; :issue:`7490`.)
uk: Прапор :const:`IGNORE_EXCEPTION_DETAIL` модуля :mod:`doctest` тепер ігноруватиме назву модуля, що містить виняток, що перевіряється. (Патч від Lennart Regebro; :issue:`7490`.)

source: The :mod:`email` module's :class:`~email.message.Message` class will now accept a Unicode-valued payload, automatically converting the payload to the encoding specified by :attr:`output_charset`. (Added by R. David Murray; :issue:`1368247`.)
uk: Клас :class:`~email.message.Message` модуля :mod:`email` тепер прийматиме корисне навантаження зі значенням Unicode, автоматично перетворюючи корисне навантаження на кодування, визначене :attr:`output_charset`. (Додав Р. Девід Мюррей; :issue:`1368247`.)

source: The :class:`~fractions.Fraction` class now accepts a single float or :class:`~decimal.Decimal` instance, or two rational numbers, as arguments to its constructor. (Implemented by Mark Dickinson; rationals added in :issue:`5812`, and float/decimal in :issue:`8294`.)
uk: Клас :class:`~fractions.Fraction` тепер приймає один екземпляр float або :class:`~decimal.Decimal`, або два раціональних числа, як аргументи свого конструктора. (Реалізовано Марком Дікінсоном; раціональні числа додано в :issue:`5812`, а число з плаваючою точкою/десяткове число в :issue:`8294`.)

source: Ordering comparisons (``<``, ``<=``, ``>``, ``>=``) between fractions and complex numbers now raise a :exc:`TypeError`. This fixes an oversight, making the :class:`~fractions.Fraction` match the other numeric types.
uk: Порядок порівнянь (``<``, ``<=``, ``>``, ``>=``) між дробами та комплексними числами тепер викликає :exc:`TypeError`. Це виправляє недогляд, завдяки чому :class:`~fractions.Fraction` відповідає іншим числовим типам.

source: New class: :class:`~ftplib.FTP_TLS` in the :mod:`ftplib` module provides secure FTP connections using TLS encapsulation of authentication as well as subsequent control and data transfers. (Contributed by Giampaolo Rodola; :issue:`2054`.)
uk: Новий клас: :class:`~ftplib.FTP_TLS` у модулі :mod:`ftplib` забезпечує безпечні FTP-з’єднання за допомогою інкапсуляції TLS для автентифікації, а також подальший контроль і передачу даних. (Надав Джампаоло Родола; :issue:`2054`.)

source: The :meth:`~ftplib.FTP.storbinary` method for binary uploads can now restart uploads thanks to an added *rest* parameter (patch by Pablo Mouzo; :issue:`6845`.)
uk: Метод :meth:`~ftplib.FTP.storbinary` для двійкових завантажень тепер може перезапускати завантаження завдяки доданому параметру *rest* (патч Пабло Музо; :issue:`6845`.)

source: New class decorator: :func:`~functools.total_ordering` in the :mod:`functools` module takes a class that defines an :meth:`__eq__` method and one of :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, or :meth:`__ge__`, and generates the missing comparison methods. Since the :meth:`__cmp__` method is being deprecated in Python 3.x, this decorator makes it easier to define ordered classes. (Added by Raymond Hettinger; :issue:`5479`.)
uk: Новий декоратор класу: :func:`~functools.total_ordering` у модулі :mod:`functools` приймає клас, який визначає метод :meth:`__eq__` та один із :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__` або :meth:`__ge__` та генерує відсутні методи порівняння. Оскільки метод :meth:`__cmp__` застарів у Python 3.x, цей декоратор полегшує визначення впорядкованих класів. (Додав Реймонд Геттінгер; :issue:`5479`.)

source: New function: :func:`~functools.cmp_to_key` will take an old-style comparison function that expects two arguments and return a new callable that can be used as the *key* parameter to functions such as :func:`sorted`, :func:`min` and :func:`max`, etc. The primary intended use is to help with making code compatible with Python 3.x. (Added by Raymond Hettinger.)
uk: Нова функція: :func:`~functools.cmp_to_key` візьме функцію порівняння старого стилю, яка очікує два аргументи, і поверне новий виклик, який можна використовувати як параметр *key* для таких функцій, як :func:`sorted`, :func:`min` і :func:`max` і т. д. Основне призначення полягає в тому, щоб допомогти зробити код сумісним з Python 3.x. (Додав Раймонд Геттінгер.)

source: New function: the :mod:`gc` module's :func:`~gc.is_tracked` returns true if a given instance is tracked by the garbage collector, false otherwise. (Contributed by Antoine Pitrou; :issue:`4688`.)
uk: Нова функція: модуль :mod:`gc` :func:`~gc.is_tracked` повертає true, якщо даний екземпляр відстежується збирачем сміття, і false в іншому випадку. (Надав Антуан Пітру; :issue:`4688`.)

source: The :mod:`gzip` module's :class:`~gzip.GzipFile` now supports the context management protocol, so you can write ``with gzip.GzipFile(...) as f:`` (contributed by Hagen Fürstenau; :issue:`3860`), and it now implements the :class:`io.BufferedIOBase` ABC, so you can wrap it with :class:`io.BufferedReader` for faster processing (contributed by Nir Aides; :issue:`7471`). It's also now possible to override the modification time recorded in a gzipped file by providing an optional timestamp to the constructor. (Contributed by Jacques Frechet; :issue:`4272`.)
uk: :class:`~gzip.GzipFile` модуля :mod:`gzip` тепер підтримує протокол керування контекстом, тому ви можете писати ``with gzip.GzipFile(...) як f:`` (надано Hagen Fürstenau; :issue:`3860`), і тепер він реалізує :class:`io.BufferedIOBase` ABC, тому ви можете обернути його :class:`io.BufferedReader` для швидшої обробки (надано Nir Aides; :issue:`7471`). Також тепер можна змінити час модифікації, записаний у файлі, стиснутому gzip, шляхом надання конструктору додаткової позначки часу. (Надав Жак Фреше; :issue:`4272`.)

source: Files in gzip format can be padded with trailing zero bytes; the :mod:`gzip` module will now consume these trailing bytes. (Fixed by Tadek Pietraszek and Brian Curtin; :issue:`2846`.)
uk: Файли у форматі gzip можуть бути доповнені нульовими байтами в кінці; модуль :mod:`gzip` тепер споживатиме ці кінцеві байти. (Виправлено Tadek Pietraszek і Brian Curtin; :issue:`2846`.)

source: New attribute: the :mod:`hashlib` module now has an :attr:`~hashlib.hashlib.algorithms` attribute containing a tuple naming the supported algorithms. In Python 2.7, ``hashlib.algorithms`` contains ``('md5', 'sha1', 'sha224', 'sha256', 'sha384', 'sha512')``. (Contributed by Carl Chenet; :issue:`7418`.)
uk: Новий атрибут: модуль :mod:`hashlib` тепер має атрибут :attr:`~hashlib.hashlib.algorithms`, який містить кортеж із назвами підтримуваних алгоритмів. У Python 2.7 ``hashlib.algorithms`` містить ``('md5', 'sha1', 'sha224', 'sha256', 'sha384', 'sha512')``. (Надав Карл Чене; :issue:`7418`.)

source: The default :class:`~httplib.HTTPResponse` class used by the :mod:`httplib` module now supports buffering, resulting in much faster reading of HTTP responses. (Contributed by Kristján Valur Jónsson; :issue:`4879`.)
uk: Стандартний клас :class:`~httplib.HTTPResponse`, який використовується модулем :mod:`httplib`, тепер підтримує буферизацію, що призводить до набагато швидшого читання HTTP-відповідей. (Надав Крістіян Валур Йонссон; :issue:`4879`.)

source: The :class:`~httplib.HTTPConnection` and :class:`~httplib.HTTPSConnection` classes now support a *source_address* parameter, a ``(host, port)`` 2-tuple giving the source address that will be used for the connection. (Contributed by Eldon Ziegler; :issue:`3972`.)
uk: Класи :class:`~httplib.HTTPConnection` і :class:`~httplib.HTTPSConnection` тепер підтримують параметр *source_address*, двокортеж ``(хост, порт)``, що вказує адресу джерела, яка буде використана для підключення. (Надав Елдон Зіглер; :issue:`3972`.)

source: The :mod:`ihooks` module now supports relative imports. Note that :mod:`ihooks` is an older module for customizing imports, superseded by the :mod:`imputil` module added in Python 2.0. (Relative import support added by Neil Schemenauer.)
uk: Модуль :mod:`ihooks` тепер підтримує відносний імпорт. Зверніть увагу, що :mod:`ihooks` є старішим модулем для налаштування імпорту, заміненим модулем :mod:`imputil`, доданим у Python 2.0. (Підтримку відносного імпорту додав Ніл Шеменауер.)

source: The :mod:`imaplib` module now supports IPv6 addresses. (Contributed by Derek Morr; :issue:`1655`.)
uk: Модуль :mod:`imaplib` тепер підтримує адреси IPv6. (Надав Дерек Морр; :issue:`1655`.)

source: New function: the :mod:`inspect` module's :func:`~inspect.getcallargs` takes a callable and its positional and keyword arguments, and figures out which of the callable's parameters will receive each argument, returning a dictionary mapping argument names to their values. For example::
uk: Нова функція: модуль :mod:`inspect` :func:`~inspect.getcallargs` приймає виклик, його позиційні та ключові аргументи, а також визначає, який із параметрів викликаного отримає кожен аргумент, повертаючи словник зіставлення імен аргументів їхні цінності. Наприклад::

source: Contributed by George Sakkis; :issue:`3135`.
uk: Внесено Джорджем Саккісом; :issue:`3135`.

source: Updated module: The :mod:`io` library has been upgraded to the version shipped with Python 3.1. For 3.1, the I/O library was entirely rewritten in C and is 2 to 20 times faster depending on the task being performed. The original Python version was renamed to the :mod:`_pyio` module.
uk: Оновлений модуль: бібліотеку :mod:`io` було оновлено до версії, що постачається з Python 3.1. Для версії 3.1 бібліотеку вводу-виводу було повністю переписано мовою C і вона працює у 2-20 разів швидше залежно від завдання, яке виконується. Оригінальна версія Python була перейменована на модуль :mod:`_pyio`.

source: One minor resulting change: the :class:`io.TextIOBase` class now has an :attr:`errors` attribute giving the error setting used for encoding and decoding errors (one of ``'strict'``, ``'replace'``, ``'ignore'``).
uk: Одна незначна результуюча зміна: клас :class:`io.TextIOBase` тепер має атрибут :attr:`errors`, що надає параметр помилки, який використовується для помилок кодування та декодування (один із ``'strict'``, ``'replace ''``, ``'ігнорувати''``).

source: The :class:`io.FileIO` class now raises an :exc:`OSError` when passed an invalid file descriptor. (Implemented by Benjamin Peterson; :issue:`4991`.) The :meth:`~io.IOBase.truncate` method now preserves the file position; previously it would change the file position to the end of the new file. (Fixed by Pascal Chambon; :issue:`6939`.)
uk: Клас :class:`io.FileIO` тепер викликає :exc:`OSError`, коли передається недійсний дескриптор файлу. (Реалізовано Бенджаміном Петерсоном; :issue:`4991`.) Метод :meth:`~io.IOBase.truncate` тепер зберігає позицію файлу; раніше він змінював позицію файлу на кінець нового файлу. (Виправлено Паскалем Шамбоном; :issue:`6939`.)

source: New function: ``itertools.compress(data, selectors)`` takes two iterators. Elements of *data* are returned if the corresponding value in *selectors* is true::
uk: Нова функція: ``itertools.compress(data, selectors)`` використовує два ітератори. Елементи *data* повертаються, якщо відповідне значення в *selectors* має значення true::

source: New function: ``itertools.combinations_with_replacement(iter, r)`` returns all the possible *r*-length combinations of elements from the iterable *iter*. Unlike :func:`~itertools.combinations`, individual elements can be repeated in the generated combinations::
uk: Нова функція: ``itertools.combinations_with_replacement(iter, r)`` повертає всі можливі комбінації елементів довжини *r* з ітерованого *iter*. На відміну від :func:`~itertools.combinations`, окремі елементи можуть повторюватися у згенерованих комбінаціях:

source: Note that elements are treated as unique depending on their position in the input, not their actual values.
uk: Зауважте, що елементи розглядаються як унікальні залежно від їхньої позиції у вхідних даних, а не від фактичних значень.

source: The :func:`itertools.count` function now has a *step* argument that allows incrementing by values other than 1. :func:`~itertools.count` also now allows keyword arguments, and using non-integer values such as floats or :class:`~decimal.Decimal` instances. (Implemented by Raymond Hettinger; :issue:`5032`.)
uk: Функція :func:`itertools.count` тепер має аргумент *step*, який дозволяє збільшувати значення, відмінні від 1. :func:`~itertools.count` також тепер дозволяє використовувати ключові аргументи та використовувати нецілі значення, наприклад числа з плаваючою точкою або :class:`~decimal.Decimal` екземпляри. (Реалізовано Raymond Hettinger; :issue:`5032`.)

source: :func:`itertools.combinations` and :func:`itertools.product` previously raised :exc:`ValueError` for values of *r* larger than the input iterable. This was deemed a specification error, so they now return an empty iterator. (Fixed by Raymond Hettinger; :issue:`4816`.)
uk: :func:`itertools.combinations` і :func:`itertools.product` раніше викликали :exc:`ValueError` для значень *r*, які перевищують ітерацію введення. Це було визнано помилкою специфікації, тому тепер вони повертають порожній ітератор. (Виправлено Раймондом Геттінгером; :issue:`4816`.)

source: Updated module: The :mod:`json` module was upgraded to version 2.0.9 of the simplejson package, which includes a C extension that makes encoding and decoding faster. (Contributed by Bob Ippolito; :issue:`4136`.)
uk: Оновлений модуль: модуль :mod:`json` було оновлено до версії 2.0.9 пакета simplejson, який включає розширення C, яке робить кодування та декодування швидшим. (Надав Боб Іполіто; :issue:`4136`.)

source: To support the new :class:`collections.OrderedDict` type, :func:`json.load` now has an optional *object_pairs_hook* parameter that will be called with any object literal that decodes to a list of pairs. (Contributed by Raymond Hettinger; :issue:`5381`.)
uk: Щоб підтримувати новий тип :class:`collections.OrderedDict`, :func:`json.load` тепер має необов’язковий параметр *object_pairs_hook*, який буде викликатися з будь-яким літералом об’єкта, який декодує список пар. (Надав Реймонд Геттінгер; :issue:`5381`.)

source: The :mod:`mailbox` module's :class:`~mailbox.Maildir` class now records the timestamp on the directories it reads, and only re-reads them if the modification time has subsequently changed. This improves performance by avoiding unneeded directory scans. (Fixed by A.M. Kuchling and Antoine Pitrou; :issue:`1607951`, :issue:`6896`.)
uk: Клас :class:`~mailbox.Maildir` модуля :mod:`mailbox` тепер записує мітку часу в каталогах, які він читає, і перечитує їх, лише якщо час модифікації згодом змінився. Це покращує продуктивність, уникаючи непотрібного сканування каталогу. (Виправлено A.M. Kuchling і Antoine Pitrou; :issue:`1607951`, :issue:`6896`.)

source: New functions: the :mod:`math` module gained :func:`~math.erf` and :func:`~math.erfc` for the error function and the complementary error function, :func:`~math.expm1` which computes ``e**x - 1`` with more precision than using :func:`~math.exp` and subtracting 1, :func:`~math.gamma` for the Gamma function, and :func:`~math.lgamma` for the natural log of the Gamma function. (Contributed by Mark Dickinson and nirinA raseliarison; :issue:`3366`.)
uk: Нові функції: модуль :mod:`math` отримав :func:`~math.erf` і :func:`~math.erfc` для функції помилки та додаткової функції помилки, :func:`~math.expm1` який обчислює ``e**x - 1`` з більшою точністю, ніж використання :func:`~math.exp` і віднімання 1, :func:`~math.gamma` для функції Gamma та :func:`~math.lgamma` для натурального логарифму функції Гамма. (Надано Марком Дікінсоном і nirinA raseliarison; :issue:`3366`.)

source: The :mod:`multiprocessing` module's :class:`Manager*` classes can now be passed a callable that will be called whenever a subprocess is started, along with a set of arguments that will be passed to the callable. (Contributed by lekma; :issue:`5585`.)
uk: Класам :class:`Manager*` модуля :mod:`multiprocessing` тепер можна передати виклик, який буде викликатися кожного разу, коли запускається підпроцес, разом із набором аргументів, які будуть передані викликаному. (Надано lekma; :issue:`5585`.)

source: The :class:`~multiprocessing.Pool` class, which controls a pool of worker processes, now has an optional *maxtasksperchild* parameter. Worker processes will perform the specified number of tasks and then exit, causing the :class:`~multiprocessing.Pool` to start a new worker. This is useful if tasks may leak memory or other resources, or if some tasks will cause the worker to become very large. (Contributed by Charles Cazabon; :issue:`6963`.)
uk: Клас :class:`~multiprocessing.Pool`, який керує пулом робочих процесів, тепер має додатковий параметр *maxtasksperchild*. Робочі процеси виконають вказану кількість завдань, а потім завершаться, у результаті чого :class:`~multiprocessing.Pool` запустить новий робочий процес. Це корисно, якщо завдання можуть втрачати пам’ять чи інші ресурси, або якщо деякі завдання призведуть до того, що робочий файл стане дуже великим. (Надав Чарльз Казабон; :issue:`6963`.)
