Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: The :keyword:`import` statement will no longer try an absolute import if a relative import (e.g. ``from .os import sep``) fails. This fixes a bug, but could possibly break certain :keyword:`!import` statements that were only working by accident. (Fixed by Meador Inge; :issue:`7902`.)
uk: Оператор :keyword:`import` більше не намагатиметься виконати абсолютний імпорт, якщо відносний імпорт (наприклад, ``from .os import sep``) не вдається. Це виправляє помилку, але, можливо, може порушити певні оператори :keyword:`!import`, які працювали лише випадково. (Виправлено Meador Inge; :issue:`7902`.)

source: It's now possible for a subclass of the built-in :class:`unicode` type to override the :meth:`__unicode__` method. (Implemented by Victor Stinner; :issue:`1583863`.)
uk: Тепер підклас вбудованого типу :class:`unicode` може перевизначати метод :meth:`__unicode__`. (Реалізовано Віктором Стіннером; :issue:`1583863`.)

source: The :class:`bytearray` type's :meth:`~bytearray.translate` method now accepts ``None`` as its first argument. (Fixed by Georg Brandl; :issue:`4759`.)
uk: Метод :meth:`~bytearray.translate` типу :class:`bytearray` тепер приймає як перший аргумент ``None``. (Виправлено Георгом Брандлом; :issue:`4759`.)

source: When using ``@classmethod`` and ``@staticmethod`` to wrap methods as class or static methods, the wrapper object now exposes the wrapped function as their :attr:`__func__` attribute. (Contributed by Amaury Forgeot d'Arc, after a suggestion by George Sakkis; :issue:`5982`.)
uk: У разі використання ``@classmethod`` і ``@staticmethod`` для обгортання методів як методів класу або статичних методів, об’єкт-огортка тепер надає обгорнуту функцію як їхній атрибут :attr:`__func__`. (Надано Аморі Форже д'Арк за пропозицією Джорджа Саккіса; :issue:`5982`.)

source: When a restricted set of attributes were set using ``__slots__``, deleting an unset attribute would not raise :exc:`AttributeError` as you would expect. Fixed by Benjamin Peterson; :issue:`7604`.)
uk: Коли обмежений набір атрибутів було встановлено за допомогою ``__slots__``, видалення невстановленого атрибута не викликало б :exc:`AttributeError`, як ви очікували. Виправлено Бенджаміном Петерсоном; :issue:`7604`.)

source: Two new encodings are now supported: "cp720", used primarily for Arabic text; and "cp858", a variant of CP 850 that adds the euro symbol. (CP720 contributed by Alexander Belchenko and Amaury Forgeot d'Arc in :issue:`1616979`; CP858 contributed by Tim Hatch in :issue:`8016`.)
uk: Тепер підтримуються два нових кодування: "cp720", що використовується переважно для арабського тексту; і "cp858", варіант CP 850, який додає символ євро. (CP720 надано Олександром Бельченком і Аморі Форже д'Арком у :issue:`1616979`; CP858 надано Тімом Хетчем у :issue:`8016`.)

source: The :class:`file` object will now set the :attr:`filename` attribute on the :exc:`IOError` exception when trying to open a directory on POSIX platforms (noted by Jan Kaliszewski; :issue:`4764`), and now explicitly checks for and forbids writing to read-only file objects instead of trusting the C library to catch and report the error (fixed by Stefan Krah; :issue:`5677`).
uk: Об’єкт :class:`file` тепер встановлюватиме атрибут :attr:`filename` на виняток :exc:`IOError` під час спроби відкрити каталог на платформах POSIX (відзначено Яном Калішевським; :issue:`4764`) , і тепер явно перевіряє та забороняє запис у файлові об’єкти, призначені лише для читання, замість того, щоб довіряти бібліотеці C виявити та повідомити про помилку (виправлено Стефаном Крахом; :issue:`5677`).

source: The Python tokenizer now translates line endings itself, so the :func:`compile` built-in function now accepts code using any line-ending convention. Additionally, it no longer requires that the code end in a newline.
uk: Токенізатор Python тепер сам перекладає закінчення рядків, тож вбудована функція :func:`compile` тепер приймає код із використанням будь-якої угоди про закінчення рядків. Крім того, більше не потрібно, щоб код закінчувався символом нового рядка.

source: Extra parentheses in function definitions are illegal in Python 3.x, meaning that you get a syntax error from ``def f((x)): pass``. In Python3-warning mode, Python 2.7 will now warn about this odd usage. (Noted by James Lingard; :issue:`7362`.)
uk: Додаткові круглі дужки у визначеннях функцій заборонені в Python 3.x, що означає, що ви отримуєте синтаксичну помилку від ``def f((x)): pass``. У режимі попередження Python3 Python 2.7 тепер попереджатиме про це дивне використання. (Примітив Джеймс Лінгард; :issue:`7362`.)

source: It's now possible to create weak references to old-style class objects. New-style classes were always weak-referenceable. (Fixed by Antoine Pitrou; :issue:`8268`.)
uk: Тепер можна створювати слабкі посилання на об’єкти класу старого стилю. Класи нового стилю завжди мали слабкі посилання. (Виправлено Антуаном Пітру; :issue:`8268`.)

source: When a module object is garbage-collected, the module's dictionary is now only cleared if no one else is holding a reference to the dictionary (:issue:`7140`).
uk: Коли об’єкт модуля збирає сміття, словник модуля тепер очищається, лише якщо ніхто інший не містить посилання на словник (:issue:`7140`).

source: Interpreter Changes
uk: Зміни перекладача

source: A new environment variable, :envvar:`PYTHONWARNINGS`, allows controlling warnings. It should be set to a string containing warning settings, equivalent to those used with the :option:`-W` switch, separated by commas. (Contributed by Brian Curtin; :issue:`7301`.)
uk: Нова змінна середовища, :envvar:`PYTHONWARNINGS`, дозволяє контролювати попередження. Його слід встановити на рядок, що містить параметри попередження, еквівалентні тим, що використовуються з перемикачем :option:`-W`, розділені комами. (Надав Браян Кертін; :issue:`7301`.)

source: For example, the following setting will print warnings every time they occur, but turn warnings from the :mod:`Cookie` module into an error. (The exact syntax for setting an environment variable varies across operating systems and shells.)
uk: Наприклад, наступний параметр друкуватиме попередження кожного разу, коли вони виникають, але перетворюватиме попередження від модуля :mod:`Cookie` на помилку. (Точний синтаксис для встановлення змінної середовища залежить від операційної системи та оболонки.)

source: Optimizations
uk: Оптимізації

source: Several performance enhancements have been added:
uk: Додано кілька покращень продуктивності:

source: A new opcode was added to perform the initial setup for :keyword:`with` statements, looking up the :meth:`__enter__` and :meth:`__exit__` methods. (Contributed by Benjamin Peterson.)
uk: Було додано новий код операції, щоб виконати початкове налаштування операторів :keyword:`with`, шукаючи методи :meth:`__enter__` і :meth:`__exit__`. (Надав Бенджамін Петерсон.)

source: The garbage collector now performs better for one common usage pattern: when many objects are being allocated without deallocating any of them. This would previously take quadratic time for garbage collection, but now the number of full garbage collections is reduced as the number of objects on the heap grows. The new logic only performs a full garbage collection pass when the middle generation has been collected 10 times and when the number of survivor objects from the middle generation exceeds 10% of the number of objects in the oldest generation. (Suggested by Martin von Löwis and implemented by Antoine Pitrou; :issue:`4074`.)
uk: Збирач сміття тепер працює краще для одного загального шаблону використання: коли багато об’єктів виділяється без відміни жодного з них. Раніше це займало квадратичний час для збирання сміття, але тепер кількість повних збирань сміття зменшується, оскільки кількість об’єктів у купі зростає. Нова логіка виконує повне збирання сміття лише тоді, коли середнє покоління було зібрано 10 разів і коли кількість уцілілих об’єктів із середнього покоління перевищує 10% від кількості об’єктів у найстарішому поколінні. (Запропоновано Мартіном фон Льовісом і реалізовано Антуаном Пітру; :issue:`4074`.)

source: The garbage collector tries to avoid tracking simple containers which can't be part of a cycle. In Python 2.7, this is now true for tuples and dicts containing atomic types (such as ints, strings, etc.). Transitively, a dict containing tuples of atomic types won't be tracked either. This helps reduce the cost of each garbage collection by decreasing the number of objects to be considered and traversed by the collector. (Contributed by Antoine Pitrou; :issue:`4688`.)
uk: Збирач сміття намагається уникати відстеження простих контейнерів, які не можуть бути частиною циклу. У Python 2.7 це тепер вірно для кортежів і dicts, що містять атомарні типи (такі як int, strings тощо). Транзитивно, dict, що містить кортежі атомарних типів, також не відстежуватиметься. Це допомагає зменшити вартість кожного збору сміття за рахунок зменшення кількості об’єктів, які розглядаються та обходяться збирачем. (Надав Антуан Пітру; :issue:`4688`.)

source: Long integers are now stored internally either in base ``2**15`` or in base ``2**30``, the base being determined at build time. Previously, they were always stored in base ``2**15``. Using base ``2**30`` gives significant performance improvements on 64-bit machines, but benchmark results on 32-bit machines have been mixed. Therefore, the default is to use base ``2**30`` on 64-bit machines and base ``2**15`` on 32-bit machines; on Unix, there's a new configure option :option:`!--enable-big-digits` that can be used to override this default.
uk: Довгі цілі числа тепер зберігаються внутрішньо або в основі ``2**15``, або в базі ``2**30``, причому база визначається під час створення. Раніше вони завжди зберігалися в базі ``2**15``. Використання бази ``2**30`` дає значне покращення продуктивності на 64-розрядних машинах, але результати порівняльного тестування на 32-розрядних машинах були неоднозначними. Тому за замовчуванням на 64-розрядних машинах використовується основа ``2**30`` і основа ``2**15`` на 32-розрядних машинах; в Unix є новий параметр конфігурації :option:`!--enable-big-digits`, який можна використовувати для заміни цього значення за замовчуванням.

source: Apart from the performance improvements this change should be invisible to end users, with one exception: for testing and debugging purposes there's a new structseq :data:`sys.long_info` that provides information about the internal format, giving the number of bits per digit and the size in bytes of the C type used to store each digit::
uk: Окрім покращення продуктивності, ця зміна має бути непомітною для кінцевих користувачів, за одним винятком: для цілей тестування та налагодження існує новий structseq :data:`sys.long_info`, який надає інформацію про внутрішній формат, надаючи кількість бітів на цифру і розмір у байтах типу C, який використовується для зберігання кожної цифри:

source: (Contributed by Mark Dickinson; :issue:`4258`.)
uk: (Надав Марк Дікінсон; :issue:`4258`.)

source: Another set of changes made long objects a few bytes smaller: 2 bytes smaller on 32-bit systems and 6 bytes on 64-bit. (Contributed by Mark Dickinson; :issue:`5260`.)
uk: Інший набір змін зробив довгі об’єкти на кілька байтів меншими: на 2 байти менше в 32-бітних системах і на 6 байтів у 64-бітних. (Надав Марк Дікінсон; :issue:`5260`.)

source: The division algorithm for long integers has been made faster by tightening the inner loop, doing shifts instead of multiplications, and fixing an unnecessary extra iteration. Various benchmarks show speedups of between 50% and 150% for long integer divisions and modulo operations. (Contributed by Mark Dickinson; :issue:`5512`.) Bitwise operations are also significantly faster (initial patch by Gregory Smith; :issue:`1087418`).
uk: Алгоритм ділення для довгих цілих чисел було зроблено швидшим завдяки посиленню внутрішнього циклу, виконанню зсувів замість множень і виправленню непотрібної додаткової ітерації. Різні контрольні тести показують прискорення від 50% до 150% для довгих цілих ділень і операцій за модулем. (Надано Марком Дікінсоном; :issue:`5512`.) Побітові операції також значно швидші (початковий патч Грегорі Сміта; :issue:`1087418`).

source: The implementation of ``%`` checks for the left-side operand being a Python string and special-cases it; this results in a 1--3% performance increase for applications that frequently use ``%`` with strings, such as templating libraries. (Implemented by Collin Winter; :issue:`5176`.)
uk: Реалізація ``%`` перевіряє, чи лівий операнд є рядком Python, і вводить його в спеціальні регістри; це призводить до збільшення продуктивності на 1--3% для програм, які часто використовують ``%`` з рядками, наприклад бібліотек шаблонів. (Реалізовано Колліном Вінтером; :issue:`5176`.)

source: List comprehensions with an ``if`` condition are compiled into faster bytecode. (Patch by Antoine Pitrou, back-ported to 2.7 by Jeffrey Yasskin; :issue:`4715`.)
uk: Розуміння списків із умовою ``if`` компілюється у швидший байт-код. (Патч Антуана Пітру, перенесено на 2.7 Джеффрі Яскіним; :issue:`4715`.)

source: Converting an integer or long integer to a decimal string was made faster by special-casing base 10 instead of using a generalized conversion function that supports arbitrary bases. (Patch by Gawain Bolton; :issue:`6713`.)
uk: Перетворення цілого або довгого цілого числа в десятковий рядок стало швидшим за допомогою спеціальної бази 10 замість використання узагальненої функції перетворення, яка підтримує довільні основи. (Патч від Гавейна Болтона; :issue:`6713`.)

source: The :meth:`split`, :meth:`replace`, :meth:`rindex`, :meth:`rpartition`, and :meth:`rsplit` methods of string-like types (strings, Unicode strings, and :class:`bytearray` objects) now use a fast reverse-search algorithm instead of a character-by-character scan. This is sometimes faster by a factor of 10. (Added by Florent Xicluna; :issue:`7462` and :issue:`7622`.)
uk: Методи :meth:`split`, :meth:`replace`, :meth:`rindex`, :meth:`rpartition` і :meth:`rsplit` рядкових типів (рядки, рядки Unicode та :class:`bytearray` об’єкти) тепер використовують швидкий алгоритм зворотного пошуку замість посимвольного сканування. Іноді це швидше в 10 разів. (Додав Florent Xicluna; :issue:`7462` і :issue:`7622`.)

source: The :mod:`pickle` and :mod:`cPickle` modules now automatically intern the strings used for attribute names, reducing memory usage of the objects resulting from unpickling. (Contributed by Jake McGuire; :issue:`5084`.)
uk: Модулі :mod:`pickle` і :mod:`cPickle` тепер автоматично інтернують рядки, які використовуються для імен атрибутів, зменшуючи використання пам’яті об’єктів, отриманих у результаті видалення. (Надав Джейк Макгуайр; :issue:`5084`.)

source: The :mod:`cPickle` module now special-cases dictionaries, nearly halving the time required to pickle them. (Contributed by Collin Winter; :issue:`5670`.)
uk: Модуль :mod:`cPickle` тепер використовує словники для спеціальних регістрів, майже вдвічі скорочуючи час, необхідний для їх маринування. (Надав Колін Вінтер; :issue:`5670`.)

source: New and Improved Modules
uk: Нові та вдосконалені модулі

source: As in every release, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the Subversion logs for all the details.
uk: Як і в кожному випуску, стандартна бібліотека Python отримала низку вдосконалень і виправлень помилок. Ось неповний список найбільш помітних змін, відсортованих за алфавітом назв модулів. Зверніться до файлу :file:`Misc/NEWS` у дереві вихідних кодів, щоб отримати більш повний список змін, або перегляньте журнали Subversion, щоб отримати всі деталі.

source: The :mod:`bdb` module's base debugging class :class:`~bdb.Bdb` gained a feature for skipping modules. The constructor now takes an iterable containing glob-style patterns such as ``django.*``; the debugger will not step into stack frames from a module that matches one of these patterns. (Contributed by Maru Newby after a suggestion by Senthil Kumaran; :issue:`5142`.)
uk: Базовий клас налагодження :class:`~bdb.Bdb` модуля :mod:`bdb` отримав можливість пропускати модулі. Конструктор тепер приймає ітераційний елемент, що містить шаблони у стилі glob, такі як ``django.*``; налагоджувач не ввійде в кадри стека з модуля, який відповідає одному з цих шаблонів. (Надано Maru Newby за пропозицією Senthil Kumaran; :issue:`5142`.)

source: The :mod:`binascii` module now supports the buffer API, so it can be used with :class:`memoryview` instances and other similar buffer objects. (Backported from 3.x by Florent Xicluna; :issue:`7703`.)
uk: Модуль :mod:`binascii` тепер підтримує API буфера, тому його можна використовувати з примірниками :class:`memoryview` та іншими подібними об’єктами буфера. (Портпортовано з 3.x Флораном Ксіклюною; :issue:`7703`.)

source: Updated module: the :mod:`bsddb` module has been updated from 4.7.2devel9 to version 4.8.4 of `the pybsddb package <https://www.jcea.es/programacion/pybsddb.htm>`__. The new version features better Python 3.x compatibility, various bug fixes, and adds several new BerkeleyDB flags and methods. (Updated by Jesús Cea Avión; :issue:`8156`. The pybsddb changelog can be read at http://hg.jcea.es/pybsddb/file/tip/ChangeLog.)
uk: Оновлений модуль: модуль :mod:`bsddb` оновлено з 4.7.2devel9 до версії 4.8.4 пакета `pybsddb <https://www.jcea.es/programacion/pybsddb.htm>`__. Нова версія має кращу сумісність з Python 3.x, виправляє різні помилки та додає кілька нових прапорів і методів BerkeleyDB. (Оновлено Jesús Cea Avión; :issue:`8156`. Журнал змін pybsddb можна прочитати за адресою http://hg.jcea.es/pybsddb/file/tip/ChangeLog.)

source: The :mod:`bz2` module's :class:`~bz2.BZ2File` now supports the context management protocol, so you can write ``with bz2.BZ2File(...) as f:``. (Contributed by Hagen Fürstenau; :issue:`3860`.)
uk: Модуль :mod:`bz2` :class:`~bz2.BZ2File` тепер підтримує протокол керування контекстом, тому ви можете писати ``with bz2.BZ2File(...) як f:``. (Надав Hagen Fürstenau; :issue:`3860`.)

source: New class: the :class:`~collections.Counter` class in the :mod:`collections` module is useful for tallying data. :class:`~collections.Counter` instances behave mostly like dictionaries but return zero for missing keys instead of raising a :exc:`KeyError`:
uk: Новий клас: клас :class:`~collections.Counter` у модулі :mod:`collections` корисний для підрахунку даних. Екземпляри :class:`~collections.Counter` поводяться здебільшого як словники, але повертають нуль за відсутні ключі замість того, щоб викликати :exc:`KeyError`:

source: There are three additional :class:`~collections.Counter` methods. :meth:`~collections.Counter.most_common` returns the N most common elements and their counts. :meth:`~collections.Counter.elements` returns an iterator over the contained elements, repeating each element as many times as its count. :meth:`~collections.Counter.subtract` takes an iterable and subtracts one for each element instead of adding; if the argument is a dictionary or another :class:`Counter`, the counts are subtracted. ::
uk: Є три додаткові методи :class:`~collections.Counter`. :meth:`~collections.Counter.most_common` повертає N найпоширеніших елементів та їх кількість. :meth:`~collections.Counter.elements` повертає ітератор над вмістом елементів, повторюючи кожен елемент стільки разів, скільки його кількість. :meth:`~collections.Counter.subtract` приймає iterable і віднімає один для кожного елемента замість додавання; якщо аргументом є словник або інший :class:`Counter`, кількість віднімається. ::

source: Contributed by Raymond Hettinger; :issue:`1696199`.
uk: Надав Реймонд Геттінгер; :issue:`1696199`.

source: New class: :class:`~collections.OrderedDict` is described in the earlier section :ref:`pep-0372`.
uk: Новий клас: :class:`~collections.OrderedDict` описано в попередньому розділі :ref:`pep-0372`.

source: New method: The :class:`~collections.deque` data type now has a :meth:`~collections.deque.count` method that returns the number of contained elements equal to the supplied argument *x*, and a :meth:`~collections.deque.reverse` method that reverses the elements of the deque in-place. :class:`~collections.deque` also exposes its maximum length as the read-only :attr:`~collections.deque.maxlen` attribute. (Both features added by Raymond Hettinger.)
uk: Новий метод: Тип даних :class:`~collections.deque` тепер має метод :meth:`~collections.deque.count`, який повертає кількість елементів, що містяться, що дорівнює наданому аргументу *x*, і :meth:`~collections.deque.reverse` метод, який перевертає елементи deque на місці. :class:`~collections.deque` також показує свою максимальну довжину як атрибут :attr:`~collections.deque.maxlen` лише для читання. (Обидві функції додав Реймонд Геттінгер.)

source: The :class:`~collections.namedtuple` class now has an optional *rename* parameter. If *rename* is true, field names that are invalid because they've been repeated or aren't legal Python identifiers will be renamed to legal names that are derived from the field's position within the list of fields:
uk: Клас :class:`~collections.namedtuple` тепер має додатковий параметр *rename*. Якщо *rename* має значення true, назви полів, які є недійсними через те, що вони повторювалися або не є допустимими ідентифікаторами Python, буде перейменовано на офіційні імена, які походять від позиції поля в списку полів:

source: (Added by Raymond Hettinger; :issue:`1818`.)
uk: (Додав Раймонд Геттінгер; :issue:`1818`.)

source: Finally, the :class:`~collections.Mapping` abstract base class now returns :const:`NotImplemented` if a mapping is compared to another type that isn't a :class:`Mapping`. (Fixed by Daniel Stutzbach; :issue:`8729`.)
uk: Нарешті, :class:`~collections.Mapping` абстрактний базовий клас тепер повертає :const:`NotImplemented`, якщо зіставлення порівнюється з іншим типом, який не є :class:`Mapping`. (Виправлено Даніелем Штуцбахом; :issue:`8729`.)

source: Constructors for the parsing classes in the :mod:`ConfigParser` module now take an *allow_no_value* parameter, defaulting to false; if true, options without values will be allowed. For example::
uk: Конструктори для класів синтаксичного аналізу в модулі :mod:`ConfigParser` тепер приймають параметр *allow_no_value*, за умовчанням значення false; якщо істина, параметри без значень будуть дозволені. Наприклад::

source: (Contributed by Mats Kindahl; :issue:`7005`.)
uk: (Надав Матс Кіндаль; :issue:`7005`.)

source: Deprecated function: :func:`contextlib.nested`, which allows handling more than one context manager with a single :keyword:`with` statement, has been deprecated, because the :keyword:`!with` statement now supports multiple context managers.
uk: Застаріла функція: :func:`contextlib.nested`, яка дозволяє працювати з кількома контекстними менеджерами за допомогою одного оператора :keyword:`with`, застаріла, оскільки оператор :keyword:`!with` тепер підтримує кілька контекстних менеджерів .

source: The :mod:`cookielib` module now ignores cookies that have an invalid version field, one that doesn't contain an integer value. (Fixed by John J. Lee; :issue:`3924`.)
uk: Модуль :mod:`cookielib` тепер ігнорує файли cookie з недійсним полем версії, яке не містить цілого значення. (Виправлено Джоном Дж. Лі; :issue:`3924`.)

source: The :mod:`copy` module's :func:`~copy.deepcopy` function will now correctly copy bound instance methods. (Implemented by Robert Collins; :issue:`1515`.)
uk: Функція :func:`~copy.deepcopy` модуля :mod:`copy` тепер правильно копіюватиме зв’язані методи примірників. (Реалізовано Робертом Коллінзом; :issue:`1515`.)
