Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: In addition to the specific proposals listed below, there is a general exemption allowing new ``-3`` warnings to be added in any Python 2.7 maintenance release.
uk: На додаток до конкретних пропозицій, перелічених нижче, існує загальний виняток, який дозволяє додавати нові попередження ``-3`` до будь-якої версії обслуговування Python 2.7.

source: Two new environment variables for debug mode
uk: Дві нові змінні середовища для режиму налагодження

source: In debug mode, the ``[xxx refs]`` statistic is not written by default, the :envvar:`PYTHONSHOWREFCOUNT` environment variable now must also be set. (Contributed by Victor Stinner; :issue:`31733`.)
uk: У режимі налагодження статистика ``[xxx refs]`` не записується за замовчуванням, змінна середовища :envvar:`PYTHONSHOWREFCOUNT` тепер також має бути встановлена. (Надав Віктор Стіннер; :issue:`31733`.)

source: When Python is compiled with ``COUNT_ALLOC`` defined, allocation counts are no longer dumped by default anymore: the :envvar:`PYTHONSHOWALLOCCOUNT` environment variable must now also be set. Moreover, allocation counts are now dumped into stderr, rather than stdout. (Contributed by Victor Stinner; :issue:`31692`.)
uk: Коли Python скомпільовано з визначеним ``COUNT_ALLOC``, лічильники розподілу більше не скидаються за замовчуванням: змінна середовища :envvar:`PYTHONSHOWALLOCCOUNT` тепер також має бути встановлена. Крім того, підрахунки розподілу тепер скидаються в stderr, а не в stdout. (Надав Віктор Стіннер; :issue:`31692`.)

source: PEP 434: IDLE Enhancement Exception for All Branches
uk: PEP 434: Виняток із покращення IDLE для всіх гілок

source: :pep:`434` describes a general exemption for changes made to the IDLE development environment shipped along with Python. This exemption makes it possible for the IDLE developers to provide a more consistent user experience across all supported versions of Python 2 and 3.
uk: :pep:`434` описує загальний виняток для змін, внесених у середовище розробки IDLE, яке постачається разом із Python. Цей виняток дає змогу розробникам IDLE забезпечувати більш послідовний досвід роботи з усіма підтримуваними версіями Python 2 і 3.

source: For details of any IDLE changes, refer to the NEWS file for the specific release.
uk: Щоб дізнатися більше про будь-які зміни IDLE, зверніться до файлу NEWS для конкретного випуску.

source: PEP 466: Network Security Enhancements for Python 2.7
uk: PEP 466: Покращення безпеки мережі для Python 2.7

source: :pep:`466` describes a number of network security enhancement proposals that have been approved for inclusion in Python 2.7 maintenance releases, with the first of those changes appearing in the Python 2.7.7 release.
uk: :pep:`466` описує низку пропозицій щодо покращення безпеки мережі, які було схвалено для включення до випусків обслуговування Python 2.7, причому перші зміни з’явилися у випуску Python 2.7.7.

source: :pep:`466` related features added in Python 2.7.7:
uk: :pep:`466` пов'язані функції, додані в Python 2.7.7:

source: :func:`hmac.compare_digest` was backported from Python 3 to make a timing attack resistant comparison operation available to Python 2 applications. (Contributed by Alex Gaynor; :issue:`21306`.)
uk: :func:`hmac.compare_digest` було перенесено з Python 3, щоб зробити операцію порівняння, стійку до атак, доступною для програм Python 2. (Надав Алекс Гейнор; :issue:`21306`.)

source: OpenSSL 1.0.1g was upgraded in the official Windows installers published on python.org. (Contributed by Zachary Ware; :issue:`21462`.)
uk: OpenSSL 1.0.1g було оновлено в офіційних інсталяторах Windows, опублікованих на python.org. (Надав Zachary Ware; :issue:`21462`.)

source: :pep:`466` related features added in Python 2.7.8:
uk: :pep:`466` пов'язані функції, додані в Python 2.7.8:

source: :func:`hashlib.pbkdf2_hmac` was backported from Python 3 to make a hashing algorithm suitable for secure password storage broadly available to Python 2 applications. (Contributed by Alex Gaynor; :issue:`21304`.)
uk: :func:`hashlib.pbkdf2_hmac` було перенесено з Python 3, щоб зробити алгоритм хешування, придатним для безпечного зберігання паролів, загальнодоступним для програм Python 2. (Надав Алекс Гейнор; :issue:`21304`.)

source: OpenSSL 1.0.1h was upgraded for the official Windows installers published on python.org. (contributed by Zachary Ware in :issue:`21671` for CVE-2014-0224)
uk: OpenSSL 1.0.1h було оновлено для офіційних інсталяторів Windows, опублікованих на python.org. (надано Zachary Ware у :issue:`21671` для CVE-2014-0224)

source: :pep:`466` related features added in Python 2.7.9:
uk: :pep:`466` пов'язані функції, додані в Python 2.7.9:

source: Most of Python 3.4's :mod:`ssl` module was backported. This means :mod:`ssl` now supports Server Name Indication, TLS1.x settings, access to the platform certificate store, the :class:`~ssl.SSLContext` class, and other features. (Contributed by Alex Gaynor and David Reid; :issue:`21308`.)
uk: Більшість модулів :mod:`ssl` Python 3.4 було перенесено назад. Це означає, що :mod:`ssl` тепер підтримує індикацію імені сервера, налаштування TLS1.x, доступ до сховища сертифікатів платформи, клас :class:`~ssl.SSLContext` та інші функції. (Надано Алексом Гейнором і Девідом Рейдом; :issue:`21308`.)

source: Refer to the "Version added: 2.7.9" notes in the module documentation for specific details.
uk: Зверніться до приміток "Додана версія: 2.7.9" у документації модуля, щоб дізнатися більше.

source: :func:`os.urandom` was changed to cache a file descriptor to ``/dev/urandom`` instead of reopening ``/dev/urandom`` on every call. (Contributed by Alex Gaynor; :issue:`21305`.)
uk: :func:`os.urandom` було змінено, щоб кешувати дескриптор файлу на ``/dev/urandom`` замість повторного відкриття ``/dev/urandom`` під час кожного виклику. (Надав Алекс Гейнор; :issue:`21305`.)

source: :data:`hashlib.algorithms_guaranteed` and :data:`hashlib.algorithms_available` were backported from Python 3 to make it easier for Python 2 applications to select the strongest available hash algorithm. (Contributed by Alex Gaynor in :issue:`21307`)
uk: :data:`hashlib.algorithms_guaranteed` і :data:`hashlib.algorithms_available` було перенесено з Python 3, щоб полегшити програмам Python 2 вибір найнадійнішого доступного алгоритму хешування. (Надав Алекс Гейнор у :issue:`21307`)

source: PEP 477: Backport ensurepip (PEP 453) to Python 2.7
uk: PEP 477: Backport securepip (PEP 453) до Python 2.7

source: :pep:`477` approves the inclusion of the :pep:`453` ensurepip module and the improved documentation that was enabled by it in the Python 2.7 maintenance releases, appearing first in the Python 2.7.9 release.
uk: :pep:`477` схвалює включення модуля :pep:`453` securepip і покращеної документації, яку він увімкнув, у випуски обслуговування Python 2.7, які вперше з’явилися у випуску Python 2.7.9.

source: Bootstrapping pip By Default
uk: За замовчуванням завантажувальний pip

source: The new :mod:`ensurepip` module (defined in :pep:`453`) provides a standard cross-platform mechanism to bootstrap the pip installer into Python installations. The version of ``pip`` included with Python 2.7.9 is ``pip`` 1.5.6, and future 2.7.x maintenance releases will update the bundled version to the latest version of ``pip`` that is available at the time of creating the release candidate.
uk: Новий модуль :mod:`ensurepip` (визначений у :pep:`453`) надає стандартний міжплатформний механізм для завантаження інсталятора pip у інсталяції Python. Версія ``pip``, яка входить до Python 2.7.9, є ``pip`` 1.5.6, і в майбутніх випусках технічного обслуговування 2.7.x оновлюватиметься пакетна версія до останньої версії ``pip``, доступної за адресою час створення реліз-кандидата.

source: By default, the commands ``pip``, ``pipX`` and ``pipX.Y`` will be installed on all platforms (where X.Y stands for the version of the Python installation), along with the ``pip`` Python package and its dependencies.
uk: За замовчуванням команди ``pip``, ``pipX`` і ``pipX.Y`` будуть встановлені на всіх платформах (де X.Y означає версію інсталяції Python), а також ``pip`` Пакет Python і його залежності.

source: For CPython :ref:`source builds on POSIX systems <building-python-on-unix>`, the ``make install`` and ``make altinstall`` commands do not bootstrap ``pip`` by default. This behaviour can be controlled through configure options, and overridden through Makefile options.
uk: Для CPython :ref:`source збірок на системах POSIX <building-python-on-unix>`, команди ``make install`` і ``make altinstall`` не завантажують ``pip`` за замовчуванням. Цю поведінку можна контролювати за допомогою параметрів конфігурації та перевизначати за допомогою параметрів Makefile.

source: On Windows and Mac OS X, the CPython installers now default to installing ``pip`` along with CPython itself (users may opt out of installing it during the installation process). Window users will need to opt in to the automatic ``PATH`` modifications to have ``pip`` available from the command line by default, otherwise it can still be accessed through the Python launcher for Windows as ``py -m pip``.
uk: У Windows і Mac OS X інсталятори CPython тепер за замовчуванням встановлюють ``pip`` разом із самим CPython (користувачі можуть відмовитися від його встановлення під час процесу встановлення). Користувачам Windows потрібно буде ввімкнути автоматичні зміни PATH, щоб за замовчуванням мати pip доступним із командного рядка, інакше до нього можна отримати доступ через засіб запуску Python для Windows за допомогою ``py -m pip``.

source: As `discussed in the PEP`__, platform packagers may choose not to install these commands by default, as long as, when invoked, they provide clear and simple directions on how to install them on that platform (usually using the system package manager).
uk: Як `обговорювалося в PEP`__, пакувальники платформи можуть не встановлювати ці команди за замовчуванням, якщо під час виклику вони надають чіткі та прості вказівки щодо їх встановлення на цій платформі (зазвичай за допомогою системного менеджера пакетів) .

source: Documentation Changes
uk: Зміни в документації

source: As part of this change, the :ref:`installing-index` and :ref:`distributing-index` sections of the documentation have been completely redesigned as short getting started and FAQ documents. Most packaging documentation has now been moved out to the Python Packaging Authority maintained `Python Packaging User Guide <http://packaging.python.org>`__ and the documentation of the individual projects.
uk: У рамках цієї зміни розділи :ref:`installing-index` і :ref:`distributing-index` документації були повністю перероблені як короткі документи про початок роботи та FAQ. Більшість пакетної документації тепер переміщено до Python Packaging Authority, який підтримується `Python Packaging User Guide <http://packaging.python.org>`__ і документація окремих проектів.

source: However, as this migration is currently still incomplete, the legacy versions of those guides remaining available as :ref:`install-index` and :ref:`distutils-index`.
uk: Однак, оскільки ця міграція ще не завершена, застарілі версії цих посібників залишаються доступними як :ref:`install-index` і :ref:`distutils-index`.

source: :pep:`453` -- Explicit bootstrapping of pip in Python installations
uk: :pep:`453` -- Явне початкове завантаження pip у інсталяціях Python

source: PEP written by Donald Stufft and Nick Coghlan, implemented by Donald Stufft, Nick Coghlan, Martin von Löwis and Ned Deily.
uk: PEP, написаний Дональдом Стаффтом і Ніком Когланом, реалізований Дональдом Стаффтом, Ніком Когланом, Мартіном фон Льовісом і Недом Дейлі.

source: PEP 476: Enabling certificate verification by default for stdlib http clients
uk: PEP 476: увімкнення перевірки сертифіката за замовчуванням для http-клієнтів stdlib

source: :pep:`476` updated :mod:`httplib` and modules which use it, such as :mod:`urllib2` and :mod:`xmlrpclib`, to now verify that the server presents a certificate which is signed by a Certificate Authority in the platform trust store and whose hostname matches the hostname being requested by default, significantly improving security for many applications. This change was made in the Python 2.7.9 release.
uk: :pep:`476` оновлено :mod:`httplib` і модулі, які його використовують, такі як :mod:`urllib2` і :mod:`xmlrpclib`, тепер перевіряють, що сервер представляє сертифікат, підписаний сертифікатом Повноваження в довіреному сховищі платформи та чиє ім’я хоста відповідає імені хосту, яке запитується за замовчуванням, що значно покращує безпеку для багатьох програм. Цю зміну було внесено у випуск Python 2.7.9.

source: For applications which require the old previous behavior, they can pass an alternate context::
uk: Для програм, які вимагають старої попередньої поведінки, вони можуть передавати альтернативний контекст::

source: PEP 493: HTTPS verification migration tools for Python 2.7
uk: PEP 493: інструменти міграції перевірки HTTPS для Python 2.7

source: :pep:`493` provides additional migration tools to support a more incremental infrastructure upgrade process for environments containing applications and services relying on the historically permissive processing of server certificates when establishing client HTTPS connections. These additions were made in the Python 2.7.12 release.
uk: :pep:`493` надає додаткові інструменти міграції для підтримки більш поступового процесу оновлення інфраструктури для середовищ, які містять програми та служби, які покладаються на історично дозволену обробку сертифікатів сервера під час встановлення клієнтських з’єднань HTTPS. Ці доповнення були зроблені у випуску Python 2.7.12.

source: These tools are intended for use in cases where affected applications and services can't be modified to explicitly pass a more permissive SSL context when establishing the connection.
uk: Ці інструменти призначені для використання у випадках, коли програми та служби, які постраждали, не можна змінити, щоб явно передавати більш дозволений контекст SSL під час встановлення з’єднання.

source: For applications and services which can't be modified at all, the new ``PYTHONHTTPSVERIFY`` environment variable may be set to ``0`` to revert an entire Python process back to the default permissive behaviour of Python 2.7.8 and earlier.
uk: Для програм і служб, які взагалі неможливо змінити, нова змінна середовища ``PYTHONHTTPSVERIFY`` може бути встановлена на ``0``, щоб повернути весь процес Python назад до дозволеної поведінки за замовчуванням Python 2.7.8 і попередніх версій. .

source: For cases where the connection establishment code can't be modified, but the overall application can be, the new :func:`ssl._https_verify_certificates` function can be used to adjust the default behaviour at runtime.
uk: У випадках, коли код встановлення з’єднання не можна змінити, але загальну програму можна змінити, нову функцію :func:`ssl._https_verify_certificates` можна використовувати для налаштування поведінки за замовчуванням під час виконання.

source: New ``make regen-all`` build target
uk: Нова ціль збірки ``make regen-all``

source: To simplify cross-compilation, and to ensure that CPython can reliably be compiled without requiring an existing version of Python to already be available, the autotools-based build system no longer attempts to implicitly recompile generated files based on file modification times.
uk: Щоб спростити крос-компіляцію та гарантувати, що CPython можна надійно скомпілювати без наявності наявної версії Python, система збирання на основі autotools більше не намагається неявно перекомпілювати згенеровані файли на основі часу модифікації файлу.

source: Instead, a new ``make regen-all`` command has been added to force regeneration of these files when desired (e.g. after an initial version of Python has already been built based on the pregenerated versions).
uk: Натомість додано нову команду ``make regen-all``, щоб примусово повторно генерувати ці файли за бажанням (наприклад, після того, як початкова версія Python вже була створена на основі попередньо згенерованих версій).

source: More selective regeneration targets are also defined - see :source:`Makefile.pre.in` for details.
uk: Також визначено більш вибіркові цілі регенерації - подробиці див. :source:`Makefile.pre.in`.

source: (Contributed by Victor Stinner in :issue:`23404`.)
uk: (Надав Віктор Стіннер у :issue:`23404`.)

source: Removal of ``make touch`` build target
uk: Видалення цілі збірки ``make touch``

source: The ``make touch`` build target previously used to request implicit regeneration of generated files by updating their modification times has been removed.
uk: Ціль збірки ``make touch``, яка раніше використовувалася для запиту неявної регенерації згенерованих файлів шляхом оновлення часу їх модифікації, видалено.

source: It has been replaced by the new ``make regen-all`` target.
uk: Його було замінено новою метою ``make regen-all``.

source: Acknowledgements
uk: Подяки

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Nick Coghlan, Philip Jenvey, Ryan Lovett, R. David Murray, Hugh Secker-Walker.
uk: Автор хотів би подякувати наступним особам за пропозиції, виправлення та допомогу з різними чернетками цієї статті: Ніку Коглану, Філіпу Дженві, Райану Ловетту, Р. Девіду Мюррею, Х’ю Секер-Вокеру.
