Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: :meth:`~unittest.TestCase.assertDictEqual` compares two dictionaries and reports the differences; it's now used by default when you compare two dictionaries using :meth:`~unittest.TestCase.assertEqual`. :meth:`~unittest.TestCase.assertDictContainsSubset` checks whether all of the key/value pairs in *first* are found in *second*.
uk: :meth:`~unittest.TestCase.assertDictEqual` порівнює два словники та повідомляє про відмінності; тепер він використовується за замовчуванням, коли ви порівнюєте два словники за допомогою :meth:`~unittest.TestCase.assertEqual`. :meth:`~unittest.TestCase.assertDictContainsSubset` перевіряє, чи всі пари ключ/значення в *first* знайдені в *second*.

source: :meth:`~unittest.TestCase.assertAlmostEqual` and :meth:`~unittest.TestCase.assertNotAlmostEqual` test whether *first* and *second* are approximately equal. This method can either round their difference to an optionally-specified number of *places* (the default is 7) and compare it to zero, or require the difference to be smaller than a supplied *delta* value.
uk: :meth:`~unittest.TestCase.assertAlmostEqual` і :meth:`~unittest.TestCase.assertNotAlmostEqual` перевіряють, чи *перший* і *другий* приблизно рівні. Цей метод може або округлити їхню різницю до необов’язково вказаної кількості *місцев* (за замовчуванням — 7) і порівняти її до нуля, або вимагати, щоб різниця була меншою за надане *дельта* значення.

source: :meth:`~unittest.TestLoader.loadTestsFromName` properly honors the :attr:`~unittest.TestLoader.suiteClass` attribute of the :class:`~unittest.TestLoader`. (Fixed by Mark Roddy; :issue:`6866`.)
uk: :meth:`~unittest.TestLoader.loadTestsFromName` належним чином враховує атрибут :attr:`~unittest.TestLoader.suiteClass` :class:`~unittest.TestLoader`. (Виправлено Марком Родді; :issue:`6866`.)

source: A new hook lets you extend the :meth:`~unittest.TestCase.assertEqual` method to handle new data types. The :meth:`~unittest.TestCase.addTypeEqualityFunc` method takes a type object and a function. The function will be used when both of the objects being compared are of the specified type. This function should compare the two objects and raise an exception if they don't match; it's a good idea for the function to provide additional information about why the two objects aren't matching, much as the new sequence comparison methods do.
uk: Новий хук дозволяє розширити метод :meth:`~unittest.TestCase.assertEqual` для обробки нових типів даних. Метод :meth:`~unittest.TestCase.addTypeEqualityFunc` приймає об’єкт типу та функцію. Функція буде використана, якщо обидва порівнювані об’єкти належать до вказаного типу. Ця функція має порівняти два об’єкти та викликати виключення, якщо вони не збігаються; доцільно, щоб функція надавала додаткову інформацію про те, чому два об’єкти не збігаються, подібно до нових методів порівняння послідовностей.

source: :func:`unittest.main` now takes an optional ``exit`` argument. If false, :func:`~unittest.main` doesn't call :func:`sys.exit`, allowing :func:`~unittest.main` to be used from the interactive interpreter. (Contributed by J. Pablo Fernández; :issue:`3379`.)
uk: :func:`unittest.main` тепер приймає додатковий аргумент ``вихід``. Якщо false, :func:`~unittest.main` не викликає :func:`sys.exit`, що дозволяє використовувати :func:`~unittest.main` з інтерактивного інтерпретатора. (Надав Дж. Пабло Фернандес; :issue:`3379`.)

source: :class:`~unittest.TestResult` has new :meth:`~unittest.TestResult.startTestRun` and :meth:`~unittest.TestResult.stopTestRun` methods that are called immediately before and after a test run. (Contributed by Robert Collins; :issue:`5728`.)
uk: :class:`~unittest.TestResult` має нові методи :meth:`~unittest.TestResult.startTestRun` і :meth:`~unittest.TestResult.stopTestRun`, які викликаються безпосередньо перед і після виконання тесту. (Надав Роберт Коллінз; :issue:`5728`.)

source: With all these changes, the :file:`unittest.py` was becoming awkwardly large, so the module was turned into a package and the code split into several files (by Benjamin Peterson). This doesn't affect how the module is imported or used.
uk: З усіма цими змінами :file:`unittest.py` ставав незручно великим, тому модуль перетворили на пакет, а код розділили на кілька файлів (автор Бенджамін Петерсон). Це не впливає на імпорт або використання модуля.

source: Describes the new features, how to use them, and the rationale for various design decisions. (By Michael Foord.)
uk: Описує нові функції, способи їх використання та обґрунтування різних дизайнерських рішень. (Автор: Майкл Форд.)

source: Updated module: ElementTree 1.3
uk: Оновлений модуль: ElementTree 1.3

source: The version of the ElementTree library included with Python was updated to version 1.3. Some of the new features are:
uk: Версію бібліотеки ElementTree, яка входить до складу Python, оновлено до версії 1.3. Деякі з нових функцій:

source: The various parsing functions now take a *parser* keyword argument giving an :class:`~xml.etree.ElementTree.XMLParser` instance that will be used. This makes it possible to override the file's internal encoding::
uk: Різні функції аналізу тепер приймають аргумент ключового слова *parser*, що дає екземпляр :class:`~xml.etree.ElementTree.XMLParser`, який буде використано. Це дає змогу змінити внутрішнє кодування файлу:

source: Errors in parsing XML now raise a :exc:`ParseError` exception, whose instances have a :attr:`position` attribute containing a (*line*, *column*) tuple giving the location of the problem.
uk: Помилки під час синтаксичного аналізу XML тепер викликають виняток :exc:`ParseError`, екземпляри якого мають атрибут :attr:`position`, що містить кортеж (*рядок*, *стовпець*), що вказує місце проблеми.

source: ElementTree's code for converting trees to a string has been significantly reworked, making it roughly twice as fast in many cases. The :meth:`ElementTree.write() <xml.etree.ElementTree.ElementTree.write>` and :meth:`Element.write` methods now have a *method* parameter that can be "xml" (the default), "html", or "text". HTML mode will output empty elements as ``<empty></empty>`` instead of ``<empty/>``, and text mode will skip over elements and only output the text chunks. If you set the :attr:`tag` attribute of an element to ``None`` but leave its children in place, the element will be omitted when the tree is written out, so you don't need to do more extensive rearrangement to remove a single element.
uk: Код ElementTree для перетворення дерев у рядок був суттєво перероблений, завдяки чому він у багатьох випадках став приблизно вдвічі швидшим. Методи :meth:`ElementTree.write() <xml.etree.ElementTree.ElementTree.write>` і :meth:`Element.write` тепер мають параметр *method*, який може бути "xml" (за замовчуванням), "html" або "text". У режимі HTML пусті елементи виводитимуться як ``<empty> </empty>`` замість ``<empty/>``, а текстовий режим пропускатиме елементи та виводитиме лише фрагменти тексту. Якщо ви встановите для атрибута :attr:`tag` елемента значення ``None``, але залишите його дочірніх елементів на місці, елемент буде пропущено, коли дерево буде виписано, тому вам не потрібно виконувати більш широке перевпорядкування щоб видалити один елемент.

source: Namespace handling has also been improved. All ``xmlns:<whatever>`` declarations are now output on the root element, not scattered throughout the resulting XML. You can set the default namespace for a tree by setting the :attr:`default_namespace` attribute and can register new prefixes with :meth:`~xml.etree.ElementTree.register_namespace`. In XML mode, you can use the true/false *xml_declaration* parameter to suppress the XML declaration.
uk: Також покращено обробку простору імен. Усі оголошення ``xmlns: <whatever>`` тепер виводяться на кореневий елемент, а не розкидані по результуючому XML. Ви можете встановити простір імен за замовчуванням для дерева, установивши атрибут :attr:`default_namespace`, і можете зареєструвати нові префікси за допомогою :meth:`~xml.etree.ElementTree.register_namespace`. У режимі XML ви можете використовувати параметр *xml_declaration* true/false, щоб приховати декларацію XML.

source: New :class:`~xml.etree.ElementTree.Element` method: :meth:`~xml.etree.ElementTree.Element.extend` appends the items from a sequence to the element's children. Elements themselves behave like sequences, so it's easy to move children from one element to another::
uk: Новий метод :class:`~xml.etree.ElementTree.Element`: :meth:`~xml.etree.ElementTree.Element.extend` додає елементи з послідовності до дочірніх елементів елемента. Самі елементи поводяться як послідовності, тому легко переміщати дітей від одного елемента до іншого:

source: New :class:`Element` method: :meth:`~xml.etree.ElementTree.Element.iter` yields the children of the element as a generator. It's also possible to write ``for child in elem:`` to loop over an element's children. The existing method :meth:`getiterator` is now deprecated, as is :meth:`getchildren` which constructs and returns a list of children.
uk: Новий метод :class:`Element`: :meth:`~xml.etree.ElementTree.Element.iter` дає дочірні елементи елемента як генератор. Також можна написати ``для дочірнього елемента в елементі:``, щоб перейти до дочірніх елементів елемента. Існуючий метод :meth:`getiterator` тепер не підтримується, як і :meth:`getchildren`, який створює та повертає список дітей.

source: New :class:`Element` method: :meth:`~xml.etree.ElementTree.Element.itertext` yields all chunks of text that are descendants of the element. For example::
uk: Новий метод :class:`Element`: :meth:`~xml.etree.ElementTree.Element.itertext` дає всі фрагменти тексту, які є нащадками елемента. Наприклад::

source: Deprecated: using an element as a Boolean (i.e., ``if elem:``) would return true if the element had any children, or false if there were no children. This behaviour is confusing -- ``None`` is false, but so is a childless element? -- so it will now trigger a :exc:`FutureWarning`. In your code, you should be explicit: write ``len(elem) != 0`` if you're interested in the number of children, or ``elem is not None``.
uk: Застаріле: використання елемента як логічного значення (тобто ``if elem:``) повертатиме true, якщо елемент мав дочірніх елементів, або false, якщо дочірніх елементів не було. Така поведінка збиває з пантелику – ``None`` є хибним, але також і бездітний елемент? -- тож тепер ініціюватиме :exc:`FutureWarning`. У вашому коді ви повинні бути чіткими: напишіть ``len(elem) != 0``, якщо вас цікавить кількість дітей, або ``elem не є None``.

source: Fredrik Lundh develops ElementTree and produced the 1.3 version; you can read his article describing 1.3 at https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm. Florent Xicluna updated the version included with Python, after discussions on python-dev and in :issue:`6472`.)
uk: Фредрік Лунд розробляє ElementTree і створив версію 1.3; ви можете прочитати його статтю з описом 1.3 на https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm. Florent Xicluna оновив версію, включену в Python, після обговорень на python-dev і в :issue:`6472`.)

source: Build and C API Changes
uk: Зміни збірки та C API

source: Changes to Python's build process and to the C API include:
uk: Зміни в процесі збирання Python і в API C включають:

source: The latest release of the GNU Debugger, GDB 7, can be `scripted using Python <https://sourceware.org/gdb/current/onlinedocs/gdb/Python.html>`__. When you begin debugging an executable program P, GDB will look for a file named ``P-gdb.py`` and automatically read it. Dave Malcolm contributed a :file:`python-gdb.py` that adds a number of commands useful when debugging Python itself. For example, ``py-up`` and ``py-down`` go up or down one Python stack frame, which usually corresponds to several C stack frames. ``py-print`` prints the value of a Python variable, and ``py-bt`` prints the Python stack trace. (Added as a result of :issue:`8032`.)
uk: Останній випуск GNU Debugger, GDB 7, може бути `написаний за допомогою Python <https://sourceware.org/gdb/current/onlinedocs/gdb/Python.html>`__. Коли ви починаєте налагоджувати виконувану програму P, GDB шукатиме файл із назвою ``P-gdb.py`` і автоматично його читатиме. Дейв Малкольм зробив :file:`python-gdb.py`, який додає ряд команд, корисних під час налагодження самого Python. Наприклад, ``py-up`` і ``py-down`` переміщуються вгору або вниз на один кадр стека Python, який зазвичай відповідає кільком кадрам стеку C. ``py-print`` друкує значення змінної Python, а ``py-bt`` друкує трасування стека Python. (Додано в результаті :issue:`8032`.)

source: If you use the :file:`.gdbinit` file provided with Python, the "pyo" macro in the 2.7 version now works correctly when the thread being debugged doesn't hold the GIL; the macro now acquires it before printing. (Contributed by Victor Stinner; :issue:`3632`.)
uk: Якщо ви використовуєте файл :file:`.gdbinit`, що надається разом з Python, макрос "pyo" у версії 2.7 тепер працює правильно, коли потік, який налагоджується, не містить GIL; тепер макрос отримує його перед друком. (Надав Віктор Стіннер; :issue:`3632`.)

source: :c:func:`Py_AddPendingCall` is now thread-safe, letting any worker thread submit notifications to the main Python thread. This is particularly useful for asynchronous IO operations. (Contributed by Kristján Valur Jónsson; :issue:`4293`.)
uk: :c:func:`Py_AddPendingCall` тепер потокобезпечний, дозволяючи будь-якому робочому потоку надсилати сповіщення до основного потоку Python. Це особливо корисно для асинхронних операцій введення-виведення. (Надав Крістіян Валур Йонссон; :issue:`4293`.)

source: New function: :c:func:`PyCode_NewEmpty` creates an empty code object; only the filename, function name, and first line number are required. This is useful for extension modules that are attempting to construct a more useful traceback stack. Previously such extensions needed to call :c:func:`PyCode_New`, which had many more arguments. (Added by Jeffrey Yasskin.)
uk: Нова функція: :c:func:`PyCode_NewEmpty` створює порожній об’єкт коду; потрібні лише назва файлу, назва функції та номер першого рядка. Це корисно для модулів розширення, які намагаються побудувати більш корисний стек трасування. Раніше такі розширення потребували виклику :c:func:`PyCode_New`, який мав набагато більше аргументів. (Додав Джеффрі Яскін.)

source: New function: :c:func:`PyErr_NewExceptionWithDoc` creates a new exception class, just as the existing :c:func:`PyErr_NewException` does, but takes an extra ``char *`` argument containing the docstring for the new exception class. (Added by 'lekma' on the Python bug tracker; :issue:`7033`.)
uk: Нова функція: :c:func:`PyErr_NewExceptionWithDoc` створює новий клас винятків, як і існуючий :c:func:`PyErr_NewException`, але приймає додатковий аргумент ``char *``, що містить рядок документації для нового класу винятків . (Додано "lekma" у системі відстеження помилок Python; :issue:`7033`.)

source: New function: :c:func:`PyFrame_GetLineNumber` takes a frame object and returns the line number that the frame is currently executing. Previously code would need to get the index of the bytecode instruction currently executing, and then look up the line number corresponding to that address. (Added by Jeffrey Yasskin.)
uk: Нова функція: :c:func:`PyFrame_GetLineNumber` приймає об’єкт фрейму та повертає номер рядка, який кадр зараз виконує. Раніше коду потрібно було отримати індекс інструкції байт-коду, яка зараз виконується, а потім знайти номер рядка, що відповідає цій адресі. (Додав Джеффрі Яскін.)

source: New functions: :c:func:`PyLong_AsLongAndOverflow` and :c:func:`PyLong_AsLongLongAndOverflow` approximates a Python long integer as a C :c:type:`long` or :c:type:`long long`. If the number is too large to fit into the output type, an *overflow* flag is set and returned to the caller. (Contributed by Case Van Horsen; :issue:`7528` and :issue:`7767`.)
uk: Нові функції: :c:func:`PyLong_AsLongAndOverflow` і :c:func:`PyLong_AsLongLongAndOverflow` наближає довге ціле число Python як C :c:type:`long` або :c:type:`long long`. Якщо число занадто велике, щоб поміститися в тип виведення, встановлюється прапорець *overflow* і повертається абоненту. (Надав Кейс Ван Хорсен; :issue:`7528` і :issue:`7767`.)

source: New function: stemming from the rewrite of string-to-float conversion, a new :c:func:`PyOS_string_to_double` function was added. The old :c:func:`PyOS_ascii_strtod` and :c:func:`PyOS_ascii_atof` functions are now deprecated.
uk: Нова функція: була додана нова функція :c:func:`PyOS_string_to_double`, яка випливає з перезапису перетворення рядків у плаваючі. Старі функції :c:func:`PyOS_ascii_strtod` і :c:func:`PyOS_ascii_atof` тепер застаріли.

source: New function: :c:func:`PySys_SetArgvEx` sets the value of ``sys.argv`` and can optionally update ``sys.path`` to include the directory containing the script named by ``sys.argv[0]`` depending on the value of an *updatepath* parameter.
uk: Нова функція: :c:func:`PySys_SetArgvEx` встановлює значення ``sys.argv`` і може додатково оновлювати ``sys.path``, щоб включити каталог, що містить сценарій, названий ``sys.argv[0]`` залежно від значення параметра *updatepath*.

source: This function was added to close a security hole for applications that embed Python. The old function, :c:func:`PySys_SetArgv`, would always update ``sys.path``, and sometimes it would add the current directory. This meant that, if you ran an application embedding Python in a directory controlled by someone else, attackers could put a Trojan-horse module in the directory (say, a file named :file:`os.py`) that your application would then import and run.
uk: Цю функцію було додано, щоб закрити дірку в безпеці програм, які вбудовують Python. Стара функція :c:func:`PySys_SetArgv` завжди оновлювала ``sys.path``, а іноді додавала поточний каталог. Це означало, що якщо ви запускаєте програму, яка вбудовує Python, у каталог, який контролюється кимось іншим, зловмисники можуть розмістити модуль троянського коня в цьому каталозі (скажімо, файл із назвою :file:`os.py`), який потім зробить ваш додаток імпортувати та запускати.

source: If you maintain a C/C++ application that embeds Python, check whether you're calling :c:func:`PySys_SetArgv` and carefully consider whether the application should be using :c:func:`PySys_SetArgvEx` with *updatepath* set to false.
uk: Якщо ви підтримуєте програму C/C++, у якій вбудовано Python, перевірте, чи викликаєте ви :c:func:`PySys_SetArgv`, і уважно обміркуйте, чи має програма використовувати :c:func:`PySys_SetArgvEx` з *updatepath*, встановленим на false .

source: Security issue reported as `CVE-2008-5983 <https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2008-5983>`_; discussed in :issue:`5753`, and fixed by Antoine Pitrou.
uk: Про проблему безпеки повідомлено як `CVE-2008-5983 <https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2008-5983>`_; обговорено в :issue:`5753` та виправлено Антуаном Пітру.

source: New macros: the Python header files now define the following macros: :c:macro:`Py_ISALNUM`, :c:macro:`Py_ISALPHA`, :c:macro:`Py_ISDIGIT`, :c:macro:`Py_ISLOWER`, :c:macro:`Py_ISSPACE`, :c:macro:`Py_ISUPPER`, :c:macro:`Py_ISXDIGIT`, :c:macro:`Py_TOLOWER`, and :c:macro:`Py_TOUPPER`. All of these functions are analogous to the C standard macros for classifying characters, but ignore the current locale setting, because in several places Python needs to analyze characters in a locale-independent way. (Added by Eric Smith; :issue:`5793`.)
uk: Нові макроси: файли заголовків Python тепер визначають такі макроси: :c:macro:`Py_ISALNUM`, :c:macro:`Py_ISALPHA`, :c:macro:`Py_ISDIGIT`, :c:macro:`Py_ISLOWER`, :c:macro:`Py_ISSPACE`, :c:macro:`Py_ISUPPER`, :c:macro:`Py_ISXDIGIT`, :c:macro:`Py_TOLOWER` і :c:macro:`Py_TOUPPER`. Усі ці функції є аналогічними стандартним макросам C для класифікації символів, але ігнорують поточні параметри локалі, оскільки в деяких місцях Python потребує аналізу символів у спосіб, незалежний від локалі. (Додав Ерік Сміт; :issue:`5793`.)

source: Removed function: :c:macro:`PyEval_CallObject` is now only available as a macro. A function version was being kept around to preserve ABI linking compatibility, but that was in 1997; it can certainly be deleted by now. (Removed by Antoine Pitrou; :issue:`8276`.)
uk: Видалена функція: :c:macro:`PyEval_CallObject` тепер доступна лише як макрос. Версія функції зберігалася, щоб зберегти сумісність зв’язування ABI, але це було в 1997 році; його, звичайно, вже можна видалити. (Видалено Антуаном Пітру; :issue:`8276`.)

source: New format codes: the :c:func:`PyFormat_FromString`, :c:func:`PyFormat_FromStringV`, and :c:func:`PyErr_Format` functions now accept ``%lld`` and ``%llu`` format codes for displaying C's :c:type:`long long` types. (Contributed by Mark Dickinson; :issue:`7228`.)
uk: Нові коди форматів: функції :c:func:`PyFormat_FromString`, :c:func:`PyFormat_FromStringV` і :c:func:`PyErr_Format` тепер приймають коди форматів ``%lld`` і ``%llu`` для відображення типів C :c:type:`long long`. (Надав Марк Дікінсон; :issue:`7228`.)

source: The complicated interaction between threads and process forking has been changed. Previously, the child process created by :func:`os.fork` might fail because the child is created with only a single thread running, the thread performing the :func:`os.fork`. If other threads were holding a lock, such as Python's import lock, when the fork was performed, the lock would still be marked as "held" in the new process. But in the child process nothing would ever release the lock, since the other threads weren't replicated, and the child process would no longer be able to perform imports.
uk: Змінено складну взаємодію між потоками та розгалуженням процесу. Раніше дочірній процес, створений :func:`os.fork`, міг вийти з ладу, оскільки дочірній процес створюється лише з одним запущеним потоком, потік, який виконує :func:`os.fork`. Якби інші потоки утримували блокування, наприклад блокування імпорту Python, під час виконання розгалуження блокування все одно було б позначено як "утримано" в новому процесі. Але в дочірньому процесі ніщо ніколи не зніме блокування, оскільки інші потоки не були репліковані, і дочірній процес більше не зможе виконувати імпорт.

source: Python 2.7 acquires the import lock before performing an :func:`os.fork`, and will also clean up any locks created using the :mod:`threading` module. C extension modules that have internal locks, or that call :c:func:`fork()` themselves, will not benefit from this clean-up.
uk: Python 2.7 отримує блокування імпорту перед виконанням :func:`os.fork`, а також очищає будь-які блокування, створені за допомогою модуля :mod:`threading`. Модулі розширення C, які мають внутрішні блокування або самі викликають :c:func:`fork()`, не матимуть користі від цього очищення.

source: (Fixed by Thomas Wouters; :issue:`1590864`.)
uk: (Виправлено Томасом Воутерсом; :issue:`1590864`.)

source: The :c:func:`Py_Finalize` function now calls the internal :func:`threading._shutdown` function; this prevents some exceptions from being raised when an interpreter shuts down. (Patch by Adam Olsen; :issue:`1722344`.)
uk: Функція :c:func:`Py_Finalize` тепер викликає внутрішню функцію :func:`threading._shutdown`; це запобігає виникненню деяких винятків, коли інтерпретатор вимикається. (Патч від Адама Олсена; :issue:`1722344`.)

source: When using the :c:type:`PyMemberDef` structure to define attributes of a type, Python will no longer let you try to delete or set a :const:`T_STRING_INPLACE` attribute.
uk: У разі використання структури :c:type:`PyMemberDef` для визначення атрибутів типу Python більше не дозволить вам спробувати видалити або встановити атрибут :const:`T_STRING_INPLACE`.
