Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: The :mod:`nntplib` module now supports IPv6 addresses. (Contributed by Derek Morr; :issue:`1664`.)
uk: Модуль :mod:`nntplib` тепер підтримує адреси IPv6. (Надав Дерек Морр; :issue:`1664`.)

source: New functions: the :mod:`os` module wraps the following POSIX system calls: :func:`~os.getresgid` and :func:`~os.getresuid`, which return the real, effective, and saved GIDs and UIDs; :func:`~os.setresgid` and :func:`~os.setresuid`, which set real, effective, and saved GIDs and UIDs to new values; :func:`~os.initgroups`, which initialize the group access list for the current process. (GID/UID functions contributed by Travis H.; :issue:`6508`. Support for initgroups added by Jean-Paul Calderone; :issue:`7333`.)
uk: Нові функції: модуль :mod:`os` обгортає наступні системні виклики POSIX: :func:`~os.getresgid` і :func:`~os.getresuid`, які повертають справжні, ефективні та збережені GID та UID. ; :func:`~os.setresgid` і :func:`~os.setresuid`, які встановлюють реальні, ефективні та збережені GID та UID на нові значення; :func:`~os.initgroups`, які ініціалізують список доступу групи для поточного процесу. (Функції GID/UID надав Тревіс Х.; :issue:`6508`. Підтримку початкових груп додав Жан-Поль Кальдероне; :issue:`7333`.)

source: The :func:`os.fork` function now re-initializes the import lock in the child process; this fixes problems on Solaris when :func:`~os.fork` is called from a thread. (Fixed by Zsolt Cserna; :issue:`7242`.)
uk: Функція :func:`os.fork` тепер повторно ініціалізує блокування імпорту в дочірньому процесі; це вирішує проблеми в Solaris, коли :func:`~os.fork` викликається з потоку. (Виправлено Жолтом Черною; :issue:`7242`.)

source: In the :mod:`os.path` module, the :func:`~os.path.normpath` and :func:`~os.path.abspath` functions now preserve Unicode; if their input path is a Unicode string, the return value is also a Unicode string. (:meth:`~os.path.normpath` fixed by Matt Giuca in :issue:`5827`; :meth:`~os.path.abspath` fixed by Ezio Melotti in :issue:`3426`.)
uk: У модулі :mod:`os.path` функції :func:`~os.path.normpath` і :func:`~os.path.abspath` тепер зберігають Unicode; якщо їхній вхідний шлях є рядком Unicode, значення, що повертається, також є рядком Unicode. (:meth:`~os.path.normpath` виправлено Метом Джукою в :issue:`5827`; :meth:`~os.path.abspath` виправлено Еціо Мелотті в :issue:`3426`.)

source: The :mod:`pydoc` module now has help for the various symbols that Python uses. You can now do ``help('<<')`` or ``help('@')``, for example. (Contributed by David Laban; :issue:`4739`.)
uk: Модуль :mod:`pydoc` тепер має довідку для різних символів, які використовує Python. Тепер ви можете, наприклад, виконати ``help('<<')`` або ``help('@')``. (Надав Девід Лабан; :issue:`4739`.)

source: The :mod:`re` module's :func:`~re.split`, :func:`~re.sub`, and :func:`~re.subn` now accept an optional *flags* argument, for consistency with the other functions in the module. (Added by Gregory P. Smith.)
uk: Модулі :mod:`re` :func:`~re.split`, :func:`~re.sub` і :func:`~re.subn` тепер приймають необов’язковий аргумент *flags* для узгодженості з інші функції в модулі. (Додав Грегорі П. Сміт.)

source: New function: :func:`~runpy.run_path` in the :mod:`runpy` module will execute the code at a provided *path* argument. *path* can be the path of a Python source file (:file:`example.py`), a compiled bytecode file (:file:`example.pyc`), a directory (:file:`./package/`), or a zip archive (:file:`example.zip`). If a directory or zip path is provided, it will be added to the front of ``sys.path`` and the module :mod:`__main__` will be imported. It's expected that the directory or zip contains a :file:`__main__.py`; if it doesn't, some other :file:`__main__.py` might be imported from a location later in ``sys.path``. This makes more of the machinery of :mod:`runpy` available to scripts that want to mimic the way Python's command line processes an explicit path name. (Added by Nick Coghlan; :issue:`6816`.)
uk: Нова функція: :func:`~runpy.run_path` у модулі :mod:`runpy` виконає код за наданим аргументом *path*. *шлях* може бути шляхом до вихідного файлу Python (:file:`example.py`), скомпільованого файлу байт-коду (:file:`example.pyc`), каталогу (:file:`./package/` ), або архів zip (:file:`example.zip`). Якщо вказано каталог або шлях до zip-архіву, його буде додано на початку ``sys.path``, а модуль :mod:`__main__` буде імпортовано. Очікується, що каталог або zip містить :file:`__main__.py`; якщо цього не відбувається, якийсь інший :file:`__main__.py` може бути імпортовано з розташування пізніше в ``sys.path``. Це робить більшу частину механізму :mod:`runpy` доступною для сценаріїв, які хочуть імітувати те, як командний рядок Python обробляє явне ім’я шляху. (Додав Нік Коглан; :issue:`6816`.)

source: New function: in the :mod:`shutil` module, :func:`~shutil.make_archive` takes a filename, archive type (zip or tar-format), and a directory path, and creates an archive containing the directory's contents. (Added by Tarek Ziadé.)
uk: Нова функція: у модулі :mod:`shutil` :func:`~shutil.make_archive` приймає назву файлу, тип архіву (формат zip або tar) і шлях до каталогу та створює архів із вмістом каталогу. (Додав Тарек Зіаде.)

source: :mod:`shutil`'s :func:`~shutil.copyfile` and :func:`~shutil.copytree` functions now raise a :exc:`~shutil.SpecialFileError` exception when asked to copy a named pipe. Previously the code would treat named pipes like a regular file by opening them for reading, and this would block indefinitely. (Fixed by Antoine Pitrou; :issue:`3002`.)
uk: Функції :mod:`shutil` :func:`~shutil.copyfile` і :func:`~shutil.copytree` тепер викликають виняток :exc:`~shutil.SpecialFileError`, коли запитують скопіювати іменований канал. Раніше код розглядав іменовані канали як звичайний файл, відкриваючи їх для читання, і це блокувало на невизначений термін. (Виправлено Антуаном Пітру; :issue:`3002`.)

source: The :mod:`signal` module no longer re-installs the signal handler unless this is truly necessary, which fixes a bug that could make it impossible to catch the EINTR signal robustly. (Fixed by Charles-Francois Natali; :issue:`8354`.)
uk: Модуль :mod:`signal` більше не перевстановлює обробник сигналу, якщо це не справді необхідно, що виправляє помилку, яка могла зробити неможливим надійне перехоплення сигналу EINTR. (Виправлено Чарльзом-Франсуа Наталі; :issue:`8354`.)

source: New functions: in the :mod:`site` module, three new functions return various site- and user-specific paths. :func:`~site.getsitepackages` returns a list containing all global site-packages directories, :func:`~site.getusersitepackages` returns the path of the user's site-packages directory, and :func:`~site.getuserbase` returns the value of the :envvar:`USER_BASE` environment variable, giving the path to a directory that can be used to store data. (Contributed by Tarek Ziadé; :issue:`6693`.)
uk: Нові функції: у модулі :mod:`site` три нові функції повертають різні шляхи для сайту та користувача. :func:`~site.getsitepackages` повертає список, що містить усі глобальні каталоги пакетів сайту, :func:`~site.getusersitepackages` повертає шлях до каталогу пакетів сайту користувача, а :func:`~site.getuserbase` повертає значення змінної середовища :envvar:`USER_BASE`, надаючи шлях до каталогу, який можна використовувати для зберігання даних. (Надав Тарек Зіаде; :issue:`6693`.)

source: The :mod:`site` module now reports exceptions occurring when the :mod:`sitecustomize` module is imported, and will no longer catch and swallow the :exc:`KeyboardInterrupt` exception. (Fixed by Victor Stinner; :issue:`3137`.)
uk: Модуль :mod:`site` тепер повідомляє про винятки, що виникають під час імпорту модуля :mod:`sitecustomize`, і більше не буде перехоплювати та ковтати виняток :exc:`KeyboardInterrupt`. (Виправлено Віктором Стіннером; :issue:`3137`.)

source: The :func:`~socket.create_connection` function gained a *source_address* parameter, a ``(host, port)`` 2-tuple giving the source address that will be used for the connection. (Contributed by Eldon Ziegler; :issue:`3972`.)
uk: Функція :func:`~socket.create_connection` отримала параметр *source_address*, двокортеж ``(хост, порт)``, що вказує адресу джерела, яка використовуватиметься для підключення. (Надав Елдон Зіглер; :issue:`3972`.)

source: The :meth:`~socket.socket.recv_into` and :meth:`~socket.socket.recvfrom_into` methods will now write into objects that support the buffer API, most usefully the :class:`bytearray` and :class:`memoryview` objects. (Implemented by Antoine Pitrou; :issue:`8104`.)
uk: Методи :meth:`~socket.socket.recv_into` і :meth:`~socket.socket.recvfrom_into` тепер записуватимуть в об’єкти, які підтримують API буфера, найбільш корисні :class:`bytearray` і об'єкти :class:`memoryview`. (Реалізовано Антуаном Пітру; :issue:`8104`.)

source: The :mod:`SocketServer` module's :class:`~SocketServer.TCPServer` class now supports socket timeouts and disabling the Nagle algorithm. The :attr:`~SocketServer.TCPServer.disable_nagle_algorithm` class attribute defaults to ``False``; if overridden to be true, new request connections will have the TCP_NODELAY option set to prevent buffering many small sends into a single TCP packet. The :attr:`~SocketServer.BaseServer.timeout` class attribute can hold a timeout in seconds that will be applied to the request socket; if no request is received within that time, :meth:`~SocketServer.BaseServer.handle_timeout` will be called and :meth:`~SocketServer.BaseServer.handle_request` will return. (Contributed by Kristján Valur Jónsson; :issue:`6192` and :issue:`6267`.)
uk: Клас :mod:`SocketServer` модуля :class:`~SocketServer.TCPServer` тепер підтримує тайм-аути сокетів і відключення алгоритму Nagle. Атрибут класу :attr:`~SocketServer.TCPServer.disable_nagle_algorithm` за умовчанням має значення ``False``; якщо перевизначено, щоб бути істинним, для нових з’єднань запитів буде встановлено параметр TCP_NODELAY, щоб запобігти буферизації багатьох невеликих відправлень в один пакет TCP. Атрибут класу :attr:`~SocketServer.BaseServer.timeout` може містити тайм-аут у секундах, який буде застосовано до сокета запиту; якщо протягом цього часу не буде отримано жодного запиту, буде викликано :meth:`~SocketServer.BaseServer.handle_timeout` і повернеться :meth:`~SocketServer.BaseServer.handle_request`. (Надав Крістіан Валур Йонссон; :issue:`6192` і :issue:`6267`.)

source: Updated module: the :mod:`sqlite3` module has been updated to version 2.6.0 of the `pysqlite package <https://github.com/ghaering/pysqlite>`__. Version 2.6.0 includes a number of bugfixes, and adds the ability to load SQLite extensions from shared libraries. Call the ``enable_load_extension(True)`` method to enable extensions, and then call :meth:`~sqlite3.Connection.load_extension` to load a particular shared library. (Updated by Gerhard Häring.)
uk: Оновлений модуль: модуль :mod:`sqlite3` оновлено до версії 2.6.0 `пакета pysqlite <https://github.com/ghaering/pysqlite>`__. Версія 2.6.0 містить низку виправлень помилок і додає можливість завантажувати розширення SQLite із спільних бібліотек. Викличте метод ``enable_load_extension(True)``, щоб увімкнути розширення, а потім викличте :meth:`~sqlite3.Connection.load_extension`, щоб завантажити певну спільну бібліотеку. (Оновлено Герхардом Херінгом.)

source: The :mod:`ssl` module's :class:`~ssl.SSLSocket` objects now support the buffer API, which fixed a test suite failure (fix by Antoine Pitrou; :issue:`7133`) and automatically set OpenSSL's :c:macro:`SSL_MODE_AUTO_RETRY`, which will prevent an error code being returned from :meth:`recv` operations that trigger an SSL renegotiation (fix by Antoine Pitrou; :issue:`8222`).
uk: Об’єкти :class:`~ssl.SSLSocket` модуля :mod:`ssl` тепер підтримують API буфера, який виправив помилку набору тестів (виправлено Антуаном Пітру; :issue:`7133`) і автоматично встановив OpenSSL :c:macro:`SSL_MODE_AUTO_RETRY`, який запобігатиме поверненню коду помилки з операцій :meth:`recv`, які запускають повторне узгодження SSL (виправлено Антуаном Пітру; :issue:`8222`).

source: The :func:`ssl.wrap_socket` constructor function now takes a *ciphers* argument that's a string listing the encryption algorithms to be allowed; the format of the string is described `in the OpenSSL documentation <https://www.openssl.org/docs/manmaster/man1/ciphers.html#CIPHER-LIST-FORMAT>`__. (Added by Antoine Pitrou; :issue:`8322`.)
uk: Функція-конструктор :func:`ssl.wrap_socket` тепер приймає аргумент *ciphers*, який є рядком із переліком дозволених алгоритмів шифрування; формат рядка описано `в документації OpenSSL <https://www.openssl.org/docs/manmaster/man1/ciphers.html#CIPHER-LIST-FORMAT>`__. (Додав Antoine Pitrou; :issue:`8322`.)

source: Another change makes the extension load all of OpenSSL's ciphers and digest algorithms so that they're all available. Some SSL certificates couldn't be verified, reporting an "unknown algorithm" error. (Reported by Beda Kosata, and fixed by Antoine Pitrou; :issue:`8484`.)
uk: Інша зміна змушує розширення завантажувати всі шифри та алгоритми дайджесту OpenSSL, щоб усі вони були доступними. Деякі сертифікати SSL не вдалося перевірити, повідомляючи про помилку "невідомий алгоритм". (Повідомив Беда Косата та виправив Антуан Пітру; :issue:`8484`.)

source: The version of OpenSSL being used is now available as the module attributes :data:`ssl.OPENSSL_VERSION` (a string), :data:`ssl.OPENSSL_VERSION_INFO` (a 5-tuple), and :data:`ssl.OPENSSL_VERSION_NUMBER` (an integer). (Added by Antoine Pitrou; :issue:`8321`.)
uk: Версія OpenSSL, яка використовується, тепер доступна як атрибути модуля: :data:`ssl.OPENSSL_VERSION` (рядок), :data:`ssl.OPENSSL_VERSION_INFO` (кортеж із 5) і :data:`ssl.OPENSSL_VERSION_NUMBER` (ціле число). (Додав Антуан Пітру; :issue:`8321`.)

source: The :mod:`struct` module will no longer silently ignore overflow errors when a value is too large for a particular integer format code (one of ``bBhHiIlLqQ``); it now always raises a :exc:`struct.error` exception. (Changed by Mark Dickinson; :issue:`1523`.) The :func:`~struct.pack` function will also attempt to use :meth:`__index__` to convert and pack non-integers before trying the :meth:`__int__` method or reporting an error. (Changed by Mark Dickinson; :issue:`8300`.)
uk: Модуль :mod:`struct` більше не ігноруватиме помилки переповнення, коли значення надто велике для певного коду цілочисельного формату (один із ``bBhHiIlLqQ``); тепер він завжди викликає виняток :exc:`struct.error`. (Змінено Марком Дікінсоном; :issue:`1523`.) Функція :func:`~struct.pack` також спробує використати :meth:`__index__` для перетворення та упаковки нецілих чисел, перш ніж спробувати :meth:`__int__` або повідомлення про помилку. (Змінено Марком Дікінсоном; :issue:`8300`.)

source: New function: the :mod:`subprocess` module's :func:`~subprocess.check_output` runs a command with a specified set of arguments and returns the command's output as a string when the command runs without error, or raises a :exc:`~subprocess.CalledProcessError` exception otherwise.
uk: Нова функція: модуль :mod:`subprocess` :func:`~subprocess.check_output` виконує команду з указаним набором аргументів і повертає результат команди як рядок, коли команда виконується без помилок, або викликає Виняток :exc:`~subprocess.CalledProcessError` інакше.

source: (Contributed by Gregory P. Smith.)
uk: (Надав Грегорі П. Сміт.)

source: The :mod:`subprocess` module will now retry its internal system calls on receiving an :const:`EINTR` signal. (Reported by several people; final patch by Gregory P. Smith in :issue:`1068268`.)
uk: Модуль :mod:`subprocess` тепер повторюватиме свої внутрішні системні виклики після отримання сигналу :const:`EINTR`. (Повідомлено кількома людьми; останній патч Грегорі П. Смітом у :issue:`1068268`.)

source: New function: :func:`~symtable.Symbol.is_declared_global` in the :mod:`symtable` module returns true for variables that are explicitly declared to be global, false for ones that are implicitly global. (Contributed by Jeremy Hylton.)
uk: Нова функція: :func:`~symtable.Symbol.is_declared_global` у модулі :mod:`symtable` повертає true для змінних, які явно оголошені як глобальні, і false для змінних, які неявно є глобальними. (Надав Джеремі Гілтон.)

source: The :mod:`syslog` module will now use the value of ``sys.argv[0]`` as the identifier instead of the previous default value of ``'python'``. (Changed by Sean Reifschneider; :issue:`8451`.)
uk: Модуль :mod:`syslog` тепер використовуватиме значення ``sys.argv[0]`` як ідентифікатор замість попереднього значення за замовчуванням ``'python'``. (Змінено Шоном Райфшнайдером; :issue:`8451`.)

source: The ``sys.version_info`` value is now a named tuple, with attributes named :attr:`major`, :attr:`minor`, :attr:`micro`, :attr:`releaselevel`, and :attr:`serial`. (Contributed by Ross Light; :issue:`4285`.)
uk: Значення ``sys.version_info`` тепер є іменованим кортежем з атрибутами :attr:`major`, :attr:`minor`, :attr:`micro`, :attr:`releaselevel` і :attr:`serial`. (Надав Росс Лайт; :issue:`4285`.)

source: :func:`sys.getwindowsversion` also returns a named tuple, with attributes named :attr:`major`, :attr:`minor`, :attr:`build`, :attr:`platform`, :attr:`service_pack`, :attr:`service_pack_major`, :attr:`service_pack_minor`, :attr:`suite_mask`, and :attr:`product_type`. (Contributed by Brian Curtin; :issue:`7766`.)
uk: :func:`sys.getwindowsversion` також повертає іменований кортеж з атрибутами під назвою :attr:`major`, :attr:`minor`, :attr:`build`, :attr:`platform`, :attr:`service_pack`, :attr:`service_pack_major`, :attr:`service_pack_minor`, :attr:`suite_mask` і :attr:`product_type`. (Надав Браян Кертін; :issue:`7766`.)

source: The :mod:`tarfile` module's default error handling has changed, to no longer suppress fatal errors. The default error level was previously 0, which meant that errors would only result in a message being written to the debug log, but because the debug log is not activated by default, these errors go unnoticed. The default error level is now 1, which raises an exception if there's an error. (Changed by Lars Gustäbel; :issue:`7357`.)
uk: Стандартну обробку помилок модуля :mod:`tarfile` було змінено, і більше не пригнічуються фатальні помилки. Раніше рівень помилок за замовчуванням був 0, що означало, що помилки призводили лише до запису повідомлення в журнал налагодження, але оскільки журнал налагодження не активовано за замовчуванням, ці помилки залишаються непоміченими. Рівень помилки за замовчуванням тепер становить 1, що викликає виняток у разі виникнення помилки. (Змінено Ларсом Густебелем; :issue:`7357`.)

source: :mod:`tarfile` now supports filtering the :class:`~tarfile.TarInfo` objects being added to a tar file. When you call :meth:`~tarfile.TarFile.add`, you may supply an optional *filter* argument that's a callable. The *filter* callable will be passed the :class:`~tarfile.TarInfo` for every file being added, and can modify and return it. If the callable returns ``None``, the file will be excluded from the resulting archive. This is more powerful than the existing *exclude* argument, which has therefore been deprecated. (Added by Lars Gustäbel; :issue:`6856`.) The :class:`~tarfile.TarFile` class also now supports the context management protocol. (Added by Lars Gustäbel; :issue:`7232`.)
uk: :mod:`tarfile` тепер підтримує фільтрацію об’єктів :class:`~tarfile.TarInfo`, які додаються до файлу tar. Коли ви викликаєте :meth:`~tarfile.TarFile.add`, ви можете надати додатковий аргумент *filter*, який можна викликати. Викликаний *filter* отримуватиме :class:`~tarfile.TarInfo` для кожного файлу, який додається, і зможе змінювати та повертати його. Якщо виклик повертає ``None``, файл буде виключено з отриманого архіву. Це потужніший аргумент, ніж існуючий аргумент *exclude*, який, отже, застарів. (Додав Ларс Густебель; :issue:`6856`.) Клас :class:`~tarfile.TarFile` тепер також підтримує протокол керування контекстом. (Додав Ларс Густебель; :issue:`7232`.)

source: The :meth:`~threading.Event.wait` method of the :class:`threading.Event` class now returns the internal flag on exit. This means the method will usually return true because :meth:`~threading.Event.wait` is supposed to block until the internal flag becomes true. The return value will only be false if a timeout was provided and the operation timed out. (Contributed by Tim Lesher; :issue:`1674032`.)
uk: Метод :meth:`~threading.Event.wait` класу :class:`threading.Event` тепер повертає внутрішній прапор під час виходу. Це означає, що метод зазвичай повертатиме true, оскільки :meth:`~threading.Event.wait` має блокуватися, доки внутрішній прапор не стане істинним. Повернене значення буде false, лише якщо було надано тайм-аут і час очікування операції минув. (Надав Тім Лешер; :issue:`1674032`.)

source: The Unicode database provided by the :mod:`unicodedata` module is now used internally to determine which characters are numeric, whitespace, or represent line breaks. The database also includes information from the :file:`Unihan.txt` data file (patch by Anders Chrigström and Amaury Forgeot d'Arc; :issue:`1571184`) and has been updated to version 5.2.0 (updated by Florent Xicluna; :issue:`8024`).
uk: База даних Юнікод, надана модулем :mod:`unicodedata`, тепер використовується внутрішньо, щоб визначити, які символи є цифрами, пробілами чи представляють розриви рядків. База даних також містить інформацію з файлу даних :file:`Unihan.txt` (патч від Anders Chrigström і Amaury Forgeot d'Arc; :issue:`1571184`) і була оновлена до версії 5.2.0 (оновлено Florent Xicluna ; :issue:`8024`).

source: The :mod:`urlparse` module's :func:`~urlparse.urlsplit` now handles unknown URL schemes in a fashion compliant with :rfc:`3986`: if the URL is of the form ``"<something>://..."``, the text before the ``://`` is treated as the scheme, even if it's a made-up scheme that the module doesn't know about. This change may break code that worked around the old behaviour. For example, Python 2.6.4 or 2.5 will return the following:
uk: Модуль :mod:`urlparse` :func:`~urlparse.urlsplit` тепер обробляє невідомі схеми URL відповідно до :rfc:`3986`: якщо URL має форму ``" <something> ://.. ."``, текст перед ``://`` розглядається як схема, навіть якщо це вигадана схема, про яку модуль не знає. Ця зміна може порушити код, який обійшов стару поведінку. Наприклад, Python 2.6.4 або 2.5 поверне наступне:

source: Python 2.7 (and Python 2.6.5) will return:
uk: Python 2.7 (і Python 2.6.5) поверне:

source: (Python 2.7 actually produces slightly different output, since it returns a named tuple instead of a standard tuple.)
uk: (Python 2.7 фактично створює дещо інший вихід, оскільки він повертає іменований кортеж замість стандартного кортежу.)

source: The :mod:`urlparse` module also supports IPv6 literal addresses as defined by :rfc:`2732` (contributed by Senthil Kumaran; :issue:`2987`).
uk: Модуль :mod:`urlparse` також підтримує буквальні адреси IPv6, як визначено :rfc:`2732` (надано Senthil Kumaran; :issue:`2987`).

source: New class: the :class:`~weakref.WeakSet` class in the :mod:`weakref` module is a set that only holds weak references to its elements; elements will be removed once there are no references pointing to them. (Originally implemented in Python 3.x by Raymond Hettinger, and backported to 2.7 by Michael Foord.)
uk: Новий клас: клас :class:`~weakref.WeakSet` у модулі :mod:`weakref` — це набір, який містить лише слабкі посилання на свої елементи; елементи буде видалено, якщо на них не буде посилань. (Спочатку реалізовано в Python 3.x Реймондом Геттінгером і перенесено до версії 2.7 Майклом Фордом.)
