Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: The ElementTree library, :mod:`xml.etree`, no longer escapes ampersands and angle brackets when outputting an XML processing instruction (which looks like ``<?xml-stylesheet href="#style1"?>``) or comment (which looks like ``<!-- comment -->``). (Patch by Neil Muller; :issue:`2746`.)
uk: Бібліотека ElementTree, :mod:`xml.etree`, більше не пропускає амперсанди та кутові дужки під час виведення інструкції обробки XML (яка виглядає як ``<?xml-stylesheet href="#style1"?>``) або коментаря (яка виглядає як ``<!-- comment -->``). (Патч Ніла Мюллера; :issue:`2746`.)

source: The XML-RPC client and server, provided by the :mod:`xmlrpclib` and :mod:`SimpleXMLRPCServer` modules, have improved performance by supporting HTTP/1.1 keep-alive and by optionally using gzip encoding to compress the XML being exchanged. The gzip compression is controlled by the :attr:`encode_threshold` attribute of :class:`SimpleXMLRPCRequestHandler`, which contains a size in bytes; responses larger than this will be compressed. (Contributed by Kristján Valur Jónsson; :issue:`6267`.)
uk: Клієнт і сервер XML-RPC, які надаються модулями :mod:`xmlrpclib` і :mod:`SimpleXMLRPCServer`, мають покращену продуктивність завдяки підтримці HTTP/1.1 Keep-Alive і додатковому використанню кодування gzip для стиснення XML, яким обмінюються. Стиснення gzip контролюється атрибутом :attr:`encode_threshold` :class:`SimpleXMLRPCRequestHandler`, який містить розмір у байтах; відповіді, більші за цей, будуть стиснуті. (Надав Крістіян Валур Йонссон; :issue:`6267`.)

source: The :mod:`zipfile` module's :class:`~zipfile.ZipFile` now supports the context management protocol, so you can write ``with zipfile.ZipFile(...) as f:``. (Contributed by Brian Curtin; :issue:`5511`.)
uk: Модуль :mod:`zipfile` :class:`~zipfile.ZipFile` тепер підтримує протокол керування контекстом, тому ви можете писати ``with zipfile.ZipFile(...) як f:``. (Надав Браян Кертін; :issue:`5511`.)

source: :mod:`zipfile` now also supports archiving empty directories and extracts them correctly. (Fixed by Kuba Wieczorek; :issue:`4710`.) Reading files out of an archive is faster, and interleaving :meth:`~zipfile.ZipFile.read` and :meth:`~zipfile.ZipFile.readline` now works correctly. (Contributed by Nir Aides; :issue:`7610`.)
uk: :mod:`zipfile` тепер також підтримує архівування порожніх каталогів і розпаковує їх правильно. (Виправлено Kuba Wieczorek; :issue:`4710`.) Читання файлів з архіву відбувається швидше, а чергування :meth:`~zipfile.ZipFile.read` і :meth:`~zipfile.ZipFile.readline` тепер працює правильно. (Надано Nir Aides; :issue:`7610`.)

source: The :func:`~zipfile.is_zipfile` function now accepts a file object, in addition to the path names accepted in earlier versions. (Contributed by Gabriel Genellina; :issue:`4756`.)
uk: Функція :func:`~zipfile.is_zipfile` тепер приймає об’єкт файлу на додаток до імен шляхів, прийнятих у попередніх версіях. (Надав Габріель Генелліна; :issue:`4756`.)

source: The :meth:`~zipfile.ZipFile.writestr` method now has an optional *compress_type* parameter that lets you override the default compression method specified in the :class:`~zipfile.ZipFile` constructor. (Contributed by Ronald Oussoren; :issue:`6003`.)
uk: Метод :meth:`~zipfile.ZipFile.writestr` тепер має необов’язковий параметр *compress_type*, який дозволяє перевизначити метод стиснення за замовчуванням, указаний у конструкторі :class:`~zipfile.ZipFile`. (Надав Рональд Оуссорен; :issue:`6003`.)

source: New module: importlib
uk: Новий модуль: importlib

source: Python 3.1 includes the :mod:`importlib` package, a re-implementation of the logic underlying Python's :keyword:`import` statement. :mod:`importlib` is useful for implementors of Python interpreters and to users who wish to write new importers that can participate in the import process. Python 2.7 doesn't contain the complete :mod:`importlib` package, but instead has a tiny subset that contains a single function, :func:`~importlib.import_module`.
uk: Python 3.1 включає пакет :mod:`importlib`, повторну реалізацію логіки, що лежить в основі оператора :keyword:`import` Python. :mod:`importlib` корисний для розробників інтерпретаторів Python і для користувачів, які хочуть написати нові імпортери, які можуть брати участь у процесі імпорту. Python 2.7 не містить повного пакета :mod:`importlib`, натомість має крихітну підмножину, яка містить одну функцію, :func:`~importlib.import_module`.

source: ``import_module(name, package=None)`` imports a module. *name* is a string containing the module or package's name. It's possible to do relative imports by providing a string that begins with a ``.`` character, such as ``..utils.errors``. For relative imports, the *package* argument must be provided and is the name of the package that will be used as the anchor for the relative import. :func:`~importlib.import_module` both inserts the imported module into ``sys.modules`` and returns the module object.
uk: ``import_module(name, package=None)`` імпортує модуль. *name* — це рядок, що містить назву модуля або пакета. Можна виконати відносний імпорт, надавши рядок, який починається із символу ``.``, наприклад ``..utils.errors``. Для відносного імпорту потрібно вказати аргумент *package*, який є назвою пакета, який використовуватиметься як прив’язка для відносного імпорту. :func:`~importlib.import_module` вставляє імпортований модуль у ``sys.modules`` і повертає об’єкт модуля.

source: Here are some examples::
uk: Ось кілька прикладів:

source: :mod:`importlib` was implemented by Brett Cannon and introduced in Python 3.1.
uk: :mod:`importlib` був реалізований Бреттом Кенноном і представлений у Python 3.1.

source: New module: sysconfig
uk: Новий модуль: sysconfig

source: The :mod:`sysconfig` module has been pulled out of the Distutils package, becoming a new top-level module in its own right. :mod:`sysconfig` provides functions for getting information about Python's build process: compiler switches, installation paths, the platform name, and whether Python is running from its source directory.
uk: Модуль :mod:`sysconfig` було вилучено з пакета Distutils, ставши власним новим модулем верхнього рівня. :mod:`sysconfig` надає функції для отримання інформації про процес збирання Python: перемикачі компілятора, шляхи встановлення, ім’я платформи та те, чи працює Python із вихідного каталогу.

source: Some of the functions in the module are:
uk: Деякі функції в модулі:

source: :func:`~sysconfig.get_config_var` returns variables from Python's Makefile and the :file:`pyconfig.h` file.
uk: :func:`~sysconfig.get_config_var` повертає змінні з Makefile Python і файлу :file:`pyconfig.h`.

source: :func:`~sysconfig.get_config_vars` returns a dictionary containing all of the configuration variables.
uk: :func:`~sysconfig.get_config_vars` повертає словник, що містить усі змінні конфігурації.

source: :func:`~sysconfig.get_path` returns the configured path for a particular type of module: the standard library, site-specific modules, platform-specific modules, etc.
uk: :func:`~sysconfig.get_path` повертає налаштований шлях для певного типу модуля: стандартної бібліотеки, модулів для сайту, модулів для платформи тощо.

source: :func:`~sysconfig.is_python_build` returns true if you're running a binary from a Python source tree, and false otherwise.
uk: :func:`~sysconfig.is_python_build` повертає true, якщо ви запускаєте двійковий файл із вихідного дерева Python, і false в іншому випадку.

source: Consult the :mod:`sysconfig` documentation for more details and for a complete list of functions.
uk: Зверніться до документації :mod:`sysconfig`, щоб дізнатися більше та отримати повний список функцій.

source: The Distutils package and :mod:`sysconfig` are now maintained by Tarek Ziadé, who has also started a Distutils2 package (source repository at https://hg.python.org/distutils2/) for developing a next-generation version of Distutils.
uk: Пакет Distutils і :mod:`sysconfig` тепер обслуговуються Тареком Зіаде, який також запустив пакет Distutils2 (сховище вихідних кодів за адресою https://hg.python.org/distutils2/) для розробки версії Distutils наступного покоління. .

source: ttk: Themed Widgets for Tk
uk: ttk: тематичні віджети для Tk

source: Tcl/Tk 8.5 includes a set of themed widgets that re-implement basic Tk widgets but have a more customizable appearance and can therefore more closely resemble the native platform's widgets. This widget set was originally called Tile, but was renamed to Ttk (for "themed Tk") on being added to Tcl/Tck release 8.5.
uk: Tcl/Tk 8.5 містить набір тематичних віджетів, які повторно реалізують основні віджети Tk, але мають більш настроюваний вигляд і тому можуть більше нагадувати віджети рідної платформи. Цей набір віджетів спочатку називався Tile, але був перейменований на Ttk (для "тематичних Tk") після додавання до випуску Tcl/Tck 8.5.

source: To learn more, read the :mod:`ttk` module documentation. You may also wish to read the Tcl/Tk manual page describing the Ttk theme engine, available at https://www.tcl.tk/man/tcl8.5/TkCmd/ttk_intro.htm. Some screenshots of the Python/Ttk code in use are at https://code.google.com/archive/p/python-ttk/wikis/Screenshots.wiki.
uk: Щоб дізнатися більше, прочитайте документацію модуля :mod:`ttk`. Ви також можете прочитати довідкову сторінку Tcl/Tk з описом механізму створення тем Ttk, доступну за адресою https://www.tcl.tk/man/tcl8.5/TkCmd/ttk_intro.htm. Деякі знімки екрана використовуваного коду Python/Ttk можна знайти на https://code.google.com/archive/p/python-ttk/wikis/Screenshots.wiki.

source: The :mod:`ttk` module was written by Guilherme Polo and added in :issue:`2983`. An alternate version called ``Tile.py``, written by Martin Franklin and maintained by Kevin Walzer, was proposed for inclusion in :issue:`2618`, but the authors argued that Guilherme Polo's work was more comprehensive.
uk: Модуль :mod:`ttk` був написаний Гільєрме Поло та доданий у :issue:`2983`. Альтернативну версію під назвою ``Tile.py``, написану Мартіном Франкліном і підтримувану Кевіном Волзером, було запропоновано включити в :issue:`2618`, але автори стверджували, що робота Гільєрме Поло була більш повною.

source: Updated module: unittest
uk: Оновлений модуль: unittest

source: The :mod:`unittest` module was greatly enhanced; many new features were added. Most of these features were implemented by Michael Foord, unless otherwise noted. The enhanced version of the module is downloadable separately for use with Python versions 2.4 to 2.6, packaged as the :mod:`unittest2` package, from https://pypi.org/project/unittest2.
uk: Модуль :mod:`unittest` було значно вдосконалено; було додано багато нових функцій. Якщо не зазначено інше, більшість із цих функцій реалізував Майкл Форд. Розширену версію модуля можна завантажити окремо для використання з версіями Python від 2.4 до 2.6, упакованими як пакет :mod:`unittest2`, з https://pypi.org/project/unittest2.

source: When used from the command line, the module can automatically discover tests. It's not as fancy as `py.test <http://pytest.org>`__ or `nose <https://nose.readthedocs.io/>`__, but provides a simple way to run tests kept within a set of package directories. For example, the following command will search the :file:`test/` subdirectory for any importable test files named ``test*.py``::
uk: При використанні з командного рядка модуль може автоматично виявляти тести. Він не такий модний, як `py.test <http://pytest.org>`__ або `nose <https://nose.readthedocs.io/>`__, але забезпечує простий спосіб запуску тестів, які зберігаються в наборі каталогів пакетів. Наприклад, наступна команда шукатиме у підкаталозі :file:`test/` будь-які імпортовані тестові файли з назвою ``test*.py``::

source: Consult the :mod:`unittest` module documentation for more details. (Developed in :issue:`6001`.)
uk: Щоб дізнатися більше, зверніться до документації модуля :mod:`unittest`. (Розроблено в :issue:`6001`.)

source: The :func:`~unittest.main` function supports some other new options:
uk: Функція :func:`~unittest.main` підтримує деякі інші нові параметри:

source: :option:`-b <unittest -b>` or :option:`!--buffer` will buffer the standard output and standard error streams during each test. If the test passes, any resulting output will be discarded; on failure, the buffered output will be displayed.
uk: :option:`-b <unittest -b>` або :option:`!--buffer` буферизує стандартний вихід і стандартні потоки помилок під час кожного тесту. Якщо тест пройдено, будь-які отримані результати будуть відхилені; у разі помилки буде відображено буферизований вихід.

source: :option:`-c <unittest -c>` or :option:`!--catch` will cause the control-C interrupt to be handled more gracefully. Instead of interrupting the test process immediately, the currently running test will be completed and then the partial results up to the interruption will be reported. If you're impatient, a second press of control-C will cause an immediate interruption.
uk: :option:`-c <unittest -c>` або :option:`!--catch` призведе до того, що переривання control-C оброблятиметься більш витончено. Замість негайного переривання процесу тестування поточний тест буде завершено, а потім буде повідомлено про часткові результати до моменту переривання. Якщо ви нетерплячі, повторне натискання Control-C призведе до негайної перерви.

source: This control-C handler tries to avoid causing problems when the code being tested or the tests being run have defined a signal handler of their own, by noticing that a signal handler was already set and calling it. If this doesn't work for you, there's a :func:`~unittest.removeHandler` decorator that can be used to mark tests that should have the control-C handling disabled.
uk: Цей обробник control-C намагається уникнути проблем, коли код, що тестується, або тести, що виконуються, визначили власний обробник сигналу, помічаючи, що обробник сигналу вже встановлено, і викликає його. Якщо це не працює для вас, є декоратор :func:`~unittest.removeHandler`, який можна використовувати для позначення тестів, для яких слід вимкнено обробку control-C.

source: :option:`-f <unittest -f>` or :option:`!--failfast` makes test execution stop immediately when a test fails instead of continuing to execute further tests. (Suggested by Cliff Dyer and implemented by Michael Foord; :issue:`8074`.)
uk: :option:`-f <unittest -f>` або :option:`!--failfast` негайно припиняє виконання тесту, коли тест не вдається, замість того, щоб продовжувати виконання подальших тестів. (Запропоновано Кліффом Даєром і реалізовано Майклом Фордом; :issue:`8074`.)

source: The progress messages now show 'x' for expected failures and 'u' for unexpected successes when run in verbose mode. (Contributed by Benjamin Peterson.)
uk: Повідомлення про перебіг тепер показують "x" для очікуваних помилок і "u" для неочікуваних успіхів під час запуску в докладному режимі. (Надав Бенджамін Петерсон.)

source: Test cases can raise the :exc:`~unittest.SkipTest` exception to skip a test (:issue:`1034053`).
uk: Тестові випадки можуть викликати виключення :exc:`~unittest.SkipTest`, щоб пропустити тест (:issue:`1034053`).

source: The error messages for :meth:`~unittest.TestCase.assertEqual`, :meth:`~unittest.TestCase.assertTrue`, and :meth:`~unittest.TestCase.assertFalse` failures now provide more information. If you set the :attr:`~unittest.TestCase.longMessage` attribute of your :class:`~unittest.TestCase` classes to true, both the standard error message and any additional message you provide will be printed for failures. (Added by Michael Foord; :issue:`5663`.)
uk: Повідомлення про помилки для помилок :meth:`~unittest.TestCase.assertEqual`, :meth:`~unittest.TestCase.assertTrue` і :meth:`~unittest.TestCase.assertFalse` тепер надають більше інформації. Якщо ви встановите атрибут :attr:`~unittest.TestCase.longMessage` ваших класів :class:`~unittest.TestCase` як true, стандартне повідомлення про помилку та будь-яке додаткове повідомлення, яке ви надасте, буде надруковано для помилок. (Додав Майкл Форд; :issue:`5663`.)

source: The :meth:`~unittest.TestCase.assertRaises` method now returns a context handler when called without providing a callable object to run. For example, you can write this::
uk: Метод :meth:`~unittest.TestCase.assertRaises` тепер повертає обробник контексту під час виклику без надання об’єкта для запуску. Наприклад, ви можете написати це::

source: (Implemented by Antoine Pitrou; :issue:`4444`.)
uk: (Реалізовано Антуаном Пітру; :issue:`4444`.)

source: Module- and class-level setup and teardown fixtures are now supported. Modules can contain :func:`~unittest.setUpModule` and :func:`~unittest.tearDownModule` functions. Classes can have :meth:`~unittest.TestCase.setUpClass` and :meth:`~unittest.TestCase.tearDownClass` methods that must be defined as class methods (using ``@classmethod`` or equivalent). These functions and methods are invoked when the test runner switches to a test case in a different module or class.
uk: Тепер підтримуються пристрої налаштування та демонтажу на рівні модуля та класу. Модулі можуть містити функції :func:`~unittest.setUpModule` і :func:`~unittest.tearDownModule`. Класи можуть мати методи :meth:`~unittest.TestCase.setUpClass` і :meth:`~unittest.TestCase.tearDownClass`, які мають бути визначені як методи класу (використовуючи ``@classmethod`` або еквівалент). Ці функції та методи викликаються, коли виконавець тесту перемикається на тестовий приклад в іншому модулі чи класі.

source: The methods :meth:`~unittest.TestCase.addCleanup` and :meth:`~unittest.TestCase.doCleanups` were added. :meth:`~unittest.TestCase.addCleanup` lets you add cleanup functions that will be called unconditionally (after :meth:`~unittest.TestCase.setUp` if :meth:`~unittest.TestCase.setUp` fails, otherwise after :meth:`~unittest.TestCase.tearDown`). This allows for much simpler resource allocation and deallocation during tests (:issue:`5679`).
uk: Додано методи :meth:`~unittest.TestCase.addCleanup` і :meth:`~unittest.TestCase.doCleanups`. :meth:`~unittest.TestCase.addCleanup` дозволяє додавати функції очищення, які будуть викликані безумовно (після :meth:`~unittest.TestCase.setUp`, якщо :meth:`~unittest.TestCase.setUp` не вдається, інакше після :meth:`~unittest.TestCase.tearDown`). Це дозволяє набагато простіше розподіляти та звільняти ресурси під час тестування (:issue:`5679`).

source: A number of new methods were added that provide more specialized tests. Many of these methods were written by Google engineers for use in their test suites; Gregory P. Smith, Michael Foord, and GvR worked on merging them into Python's version of :mod:`unittest`.
uk: Було додано ряд нових методів, які забезпечують більш спеціалізовані тести. Багато з цих методів були написані інженерами Google для використання в їхніх наборах тестів; Грегорі П. Сміт, Майкл Форд і GvR працювали над їх об’єднанням у версію Python :mod:`unittest`.

source: :meth:`~unittest.TestCase.assertIsNone` and :meth:`~unittest.TestCase.assertIsNotNone` take one expression and verify that the result is or is not ``None``.
uk: :meth:`~unittest.TestCase.assertIsNone` і :meth:`~unittest.TestCase.assertIsNotNone` беруть один вираз і перевіряють, чи є результат ``None``.

source: :meth:`~unittest.TestCase.assertIs` and :meth:`~unittest.TestCase.assertIsNot` take two values and check whether the two values evaluate to the same object or not. (Added by Michael Foord; :issue:`2578`.)
uk: :meth:`~unittest.TestCase.assertIs` і :meth:`~unittest.TestCase.assertIsNot` приймають два значення та перевіряють, чи обидва значення обчислюються для одного об’єкта чи ні. (Додав Майкл Форд; :issue:`2578`.)

source: :meth:`~unittest.TestCase.assertIsInstance` and :meth:`~unittest.TestCase.assertNotIsInstance` check whether the resulting object is an instance of a particular class, or of one of a tuple of classes. (Added by Georg Brandl; :issue:`7031`.)
uk: :meth:`~unittest.TestCase.assertIsInstance` і :meth:`~unittest.TestCase.assertNotIsInstance` перевіряють, чи є отриманий об’єкт екземпляром певного класу чи одного з кортежу класів. (Додав Георг Брандл; :issue:`7031`.)

source: :meth:`~unittest.TestCase.assertGreater`, :meth:`~unittest.TestCase.assertGreaterEqual`, :meth:`~unittest.TestCase.assertLess`, and :meth:`~unittest.TestCase.assertLessEqual` compare two quantities.
uk: :meth:`~unittest.TestCase.assertGreater`, :meth:`~unittest.TestCase.assertGreaterEqual`, :meth:`~unittest.TestCase.assertLess`, and :meth:`~unittest.TestCase.assertLessEqual` порівнюють два значення.

source: :meth:`~unittest.TestCase.assertMultiLineEqual` compares two strings, and if they're not equal, displays a helpful comparison that highlights the differences in the two strings. This comparison is now used by default when Unicode strings are compared with :meth:`~unittest.TestCase.assertEqual`.
uk: :meth:`~unittest.TestCase.assertMultiLineEqual` порівнює два рядки, і якщо вони не рівні, відображає корисне порівняння, яке підкреслює відмінності в двох рядках. Це порівняння тепер використовується за замовчуванням, коли рядки Unicode порівнюються з :meth:`~unittest.TestCase.assertEqual`.

source: :meth:`~unittest.TestCase.assertRegexpMatches` and :meth:`~unittest.TestCase.assertNotRegexpMatches` checks whether the first argument is a string matching or not matching the regular expression provided as the second argument (:issue:`8038`).
uk: :meth:`~unittest.TestCase.assertRegexpMatches` і :meth:`~unittest.TestCase.assertNotRegexpMatches` перевіряє, чи відповідає перший аргумент рядку регулярному виразу, наданому як другий аргумент (:issue:`8038`). ).

source: :meth:`~unittest.TestCase.assertRaisesRegexp` checks whether a particular exception is raised, and then also checks that the string representation of the exception matches the provided regular expression.
uk: :meth:`~unittest.TestCase.assertRaisesRegexp` перевіряє, чи виникає певний виняток, а потім також перевіряє, чи рядкове представлення виключення відповідає наданому регулярному виразу.

source: :meth:`~unittest.TestCase.assertIn` and :meth:`~unittest.TestCase.assertNotIn` tests whether *first* is or is not in *second*.
uk: :meth:`~unittest.TestCase.assertIn` і :meth:`~unittest.TestCase.assertNotIn` перевіряє, чи є *first* у *second* чи ні.

source: :meth:`~unittest.TestCase.assertItemsEqual` tests whether two provided sequences contain the same elements.
uk: :meth:`~unittest.TestCase.assertItemsEqual` перевіряє, чи дві надані послідовності містять однакові елементи.

source: :meth:`~unittest.TestCase.assertSetEqual` compares whether two sets are equal, and only reports the differences between the sets in case of error.
uk: :meth:`~unittest.TestCase.assertSetEqual` порівнює, чи рівні два набори, і повідомляє про відмінності між наборами лише в разі помилки.

source: Similarly, :meth:`~unittest.TestCase.assertListEqual` and :meth:`~unittest.TestCase.assertTupleEqual` compare the specified types and explain any differences without necessarily printing their full values; these methods are now used by default when comparing lists and tuples using :meth:`~unittest.TestCase.assertEqual`. More generally, :meth:`~unittest.TestCase.assertSequenceEqual` compares two sequences and can optionally check whether both sequences are of a particular type.
uk: Подібним чином :meth:`~unittest.TestCase.assertListEqual` і :meth:`~unittest.TestCase.assertTupleEqual` порівнюють вказані типи та пояснюють будь-які відмінності, не обов’язково друкуючи їхні повні значення; ці методи тепер використовуються за замовчуванням під час порівняння списків і кортежів за допомогою :meth:`~unittest.TestCase.assertEqual`. Загалом, :meth:`~unittest.TestCase.assertSequenceEqual` порівнює дві послідовності та за бажанням може перевірити, чи обидві послідовності належать до певного типу.
