Repository: python/python-docs-uk
Catalog: whatsnew/2.7.po
Languages: uk

source: This means Python now supports three different modules for parsing command-line arguments: :mod:`getopt`, :mod:`optparse`, and :mod:`argparse`. The :mod:`getopt` module closely resembles the C library's :c:func:`getopt` function, so it remains useful if you're writing a Python prototype that will eventually be rewritten in C. :mod:`optparse` becomes redundant, but there are no plans to remove it because there are many scripts still using it, and there's no automated way to update these scripts. (Making the :mod:`argparse` API consistent with :mod:`optparse`'s interface was discussed but rejected as too messy and difficult.)
uk: Це означає, що тепер Python підтримує три різні модулі для аналізу аргументів командного рядка: :mod:`getopt`, :mod:`optparse` і :mod:`argparse`. Модуль :mod:`getopt` дуже нагадує функцію :c:func:`getopt` бібліотеки C, тому він залишається корисним, якщо ви пишете прототип Python, який згодом буде переписано на C. :mod:`optparse` стає зайвий, але немає планів його видалення, оскільки багато сценаріїв все ще використовують його, і немає автоматичного способу оновлення цих сценаріїв. (Створення API :mod:`argparse` узгодженого з інтерфейсом :mod:`optparse` обговорювалося, але було відхилено як надто брудне та складне.)

source: In short, if you're writing a new script and don't need to worry about compatibility with earlier versions of Python, use :mod:`argparse` instead of :mod:`optparse`.
uk: Коротше кажучи, якщо ви пишете новий сценарій і вам не потрібно турбуватися про сумісність із попередніми версіями Python, використовуйте :mod:`argparse` замість :mod:`optparse`.

source: Here's an example::
uk: Ось приклад::

source: Unless you override it, :option:`!-h` and :option:`!--help` switches are automatically added, and produce neatly formatted output::
uk: Якщо ви не заміните його, перемикачі :option:`!-h` і :option:`!--help` додаються автоматично та створюють акуратно відформатований вихід::

source: As with :mod:`optparse`, the command-line switches and arguments are returned as an object with attributes named by the *dest* parameters::
uk: Як і у випадку з :mod:`optparse`, ключі та аргументи командного рядка повертаються як об’єкт з атрибутами, названими параметрами *dest*::

source: :mod:`argparse` has much fancier validation than :mod:`optparse`; you can specify an exact number of arguments as an integer, 0 or more arguments by passing ``'*'``, 1 or more by passing ``'+'``, or an optional argument with ``'?'``. A top-level parser can contain sub-parsers to define subcommands that have different sets of switches, as in ``svn commit``, ``svn checkout``, etc. You can specify an argument's type as :class:`~argparse.FileType`, which will automatically open files for you and understands that ``'-'`` means standard input or output.
uk: :mod:`argparse` має набагато кращу перевірку, ніж :mod:`optparse`; ви можете вказати точну кількість аргументів у вигляді цілого числа, 0 або більше аргументів, передавши ``'*'``, 1 або більше, передавши ``'+'``, або необов'язковий аргумент за допомогою ``'?'``. Парсер верхнього рівня може містити суб-парсери для визначення підкоманд, які мають різні набори перемикачів, як-от ``svn commit``, ``svn checkout`` тощо. Ви можете вказати тип аргументу як :class:`~argparse.FileType`, який автоматично відкриватиме для вас файли та розуміє, що ``'-'`` означає стандартне введення або виведення.

source: :mod:`argparse` documentation
uk: :mod:`argparse` документація

source: The documentation page of the argparse module.
uk: Сторінка документації модуля argparse.

source: Part of the Python documentation, describing how to convert code that uses :mod:`optparse`.
uk: Частина документації Python, яка описує, як конвертувати код, який використовує :mod:`optparse`.

source: :pep:`389` - argparse - New Command Line Parsing Module
uk: :pep:`389` - argparse - Новий модуль аналізу командного рядка

source: PEP written and implemented by Steven Bethard.
uk: PEP написаний і реалізований Стівеном Бетардом.

source: PEP 391: Dictionary-Based Configuration For Logging
uk: PEP 391: Конфігурація на основі словника для журналювання

source: The :mod:`logging` module is very flexible; applications can define a tree of logging subsystems, and each logger in this tree can filter out certain messages, format them differently, and direct messages to a varying number of handlers.
uk: Модуль :mod:`logging` дуже гнучкий; Програми можуть визначати дерево підсистем журналювання, і кожен реєстратор у цьому дереві може фільтрувати певні повідомлення, форматувати їх по-різному та направляти повідомлення до різної кількості обробників.

source: All this flexibility can require a lot of configuration. You can write Python statements to create objects and set their properties, but a complex set-up requires verbose but boring code. :mod:`logging` also supports a :func:`~logging.fileConfig` function that parses a file, but the file format doesn't support configuring filters, and it's messier to generate programmatically.
uk: Уся ця гнучкість може вимагати багато налаштувань. Ви можете писати оператори Python для створення об’єктів і встановлення їхніх властивостей, але для складного налаштування потрібен багатослівний, але нудний код. :mod:`logging` також підтримує функцію :func:`~logging.fileConfig`, яка аналізує файл, але формат файлу не підтримує налаштування фільтрів, і програмно генерувати його складніше.

source: Python 2.7 adds a :func:`~logging.dictConfig` function that uses a dictionary to configure logging. There are many ways to produce a dictionary from different sources: construct one with code; parse a file containing JSON; or use a YAML parsing library if one is installed. For more information see :ref:`logging-config-api`.
uk: Python 2.7 додає функцію :func:`~logging.dictConfig`, яка використовує словник для налаштування журналювання. Існує багато способів створення словника з різних джерел: створити словник за допомогою коду; розібрати файл, що містить JSON; або використовуйте бібліотеку аналізу YAML, якщо вона встановлена. Для отримання додаткової інформації див. :ref:`logging-config-api`.

source: The following example configures two loggers, the root logger and a logger named "network". Messages sent to the root logger will be sent to the system log using the syslog protocol, and messages to the "network" logger will be written to a :file:`network.log` file that will be rotated once the log reaches 1MB.
uk: У наступному прикладі налаштовуються два реєстратори, кореневий реєстратор і реєстратор під назвою "мережа". Повідомлення, надіслані до кореневого реєстратора, надсилатимуться до системного журналу за допомогою протоколу системного журналу, а повідомлення до "мережевого" реєстратора записуватимуться у файл :file:`network.log`, який буде обертатися, коли розмір журналу досягне 1 МБ.

source: Three smaller enhancements to the :mod:`logging` module, all implemented by Vinay Sajip, are:
uk: Три менші вдосконалення модуля :mod:`logging`, усі реалізовані Вінаєм Саджипом, це:

source: The :class:`~logging.handlers.SysLogHandler` class now supports syslogging over TCP. The constructor has a *socktype* parameter giving the type of socket to use, either :const:`socket.SOCK_DGRAM` for UDP or :const:`socket.SOCK_STREAM` for TCP. The default protocol remains UDP.
uk: Клас :class:`~logging.handlers.SysLogHandler` тепер підтримує ведення системного журналу через TCP. Конструктор має параметр *socktype*, що вказує тип сокета для використання: :const:`socket.SOCK_DGRAM` для UDP або :const:`socket.SOCK_STREAM` для TCP. Стандартним протоколом залишається UDP.

source: :class:`~logging.Logger` instances gained a :meth:`~logging.Logger.getChild` method that retrieves a descendant logger using a relative path. For example, once you retrieve a logger by doing ``log = getLogger('app')``, calling ``log.getChild('network.listen')`` is equivalent to ``getLogger('app.network.listen')``.
uk: Екземпляри :class:`~logging.Logger` отримали метод :meth:`~logging.Logger.getChild`, який отримує реєстратор-нащадок за допомогою відносного шляху. Наприклад, якщо ви отримуєте реєстратор за допомогою ``log = getLogger('app')``, виклик ``log.getChild('network.listen')`` еквівалентний ``getLogger('app.network. слухай')``.

source: The :class:`~logging.LoggerAdapter` class gained an :meth:`~logging.LoggerAdapter.isEnabledFor` method that takes a *level* and returns whether the underlying logger would process a message of that level of importance.
uk: Клас :class:`~logging.LoggerAdapter` отримав метод :meth:`~logging.LoggerAdapter.isEnabledFor`, який приймає *рівень* і повертає інформацію про те, чи обробить основний реєстратор повідомлення такого рівня важливості.

source: :pep:`391` - Dictionary-Based Configuration For Logging
uk: :pep:`391` - Конфігурація для журналювання на основі словника

source: PEP written and implemented by Vinay Sajip.
uk: PEP написаний і реалізований Вінаєм Саджипом.

source: PEP 3106: Dictionary Views
uk: PEP 3106: Перегляди словника

source: The dictionary methods :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` are different in Python 3.x. They return an object called a :dfn:`view` instead of a fully materialized list.
uk: Методи словника :meth:`~dict.keys`, :meth:`~dict.values` і :meth:`~dict.items` відрізняються в Python 3.x. Вони повертають об’єкт під назвою :dfn:`view` замість повністю матеріалізованого списку.

source: It's not possible to change the return values of :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` in Python 2.7 because too much code would break. Instead the 3.x versions were added under the new names :meth:`~dict.viewkeys`, :meth:`~dict.viewvalues`, and :meth:`~dict.viewitems`.
uk: Неможливо змінити значення, що повертаються :meth:`~dict.keys`, :meth:`~dict.values` і :meth:`~dict.items` у Python 2.7, тому що забагато коду порушить роботу. Замість цього було додано версії 3.x під новими назвами :meth:`~dict.viewkeys`, :meth:`~dict.viewvalues` і :meth:`~dict.viewitems`.

source: Views can be iterated over, but the key and item views also behave like sets. The ``&`` operator performs intersection, and ``|`` performs a union::
uk: Подання можна повторювати, але подання ключів і елементів також поводяться як набори. Оператор ``&`` виконує перетин, а ``|`` виконує об’єднання::

source: The view keeps track of the dictionary and its contents change as the dictionary is modified::
uk: Перегляд відстежує словник і його вміст змінюється, коли словник змінюється::

source: However, note that you can't add or remove keys while you're iterating over the view::
uk: Однак зауважте, що ви не можете додавати або видаляти ключі під час перегляду перегляду::

source: You can use the view methods in Python 2.x code, and the 2to3 converter will change them to the standard :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` methods.
uk: Ви можете використовувати методи перегляду в коді Python 2.x, а конвертер 2to3 змінить їх на стандартні :meth:`~dict.keys`, :meth:`~dict.values` і Методи :meth:`~dict.items`.

source: :pep:`3106` - Revamping dict.keys(), .values() and .items()
uk: :pep:`3106` - Перебудова dict.keys(), .values() і .items()

source: PEP written by Guido van Rossum. Backported to 2.7 by Alexandre Vassalotti; :issue:`1967`.
uk: PEP, написаний Гвідо ван Россумом. Перенесено до 2.7 Александром Вассалотті; :issue:`1967`.

source: PEP 3137: The memoryview Object
uk: PEP 3137: об’єкт memoryview

source: The :class:`memoryview` object provides a view of another object's memory content that matches the :class:`bytes` type's interface.
uk: Об’єкт :class:`memoryview` забезпечує перегляд вмісту пам’яті іншого об’єкта, який відповідає інтерфейсу типу :class:`bytes`.

source: The content of the view can be converted to a string of bytes or a list of integers:
uk: Вміст подання можна перетворити на рядок байтів або список цілих чисел:

source: :class:`memoryview` objects allow modifying the underlying object if it's a mutable object.
uk: Об’єкти :class:`memoryview` дозволяють змінювати базовий об’єкт, якщо він змінний.

source: :pep:`3137` - Immutable Bytes and Mutable Buffer
uk: :pep:`3137` - Незмінні байти та змінний буфер

source: PEP written by Guido van Rossum. Implemented by Travis Oliphant, Antoine Pitrou and others. Backported to 2.7 by Antoine Pitrou; :issue:`2396`.
uk: PEP, написаний Гвідо ван Россумом. Реалізовано Тревісом Оліфантом, Антуаном Пітру та іншими. Повернено до 2.7 Антуаном Пітру; :issue:`2396`.

source: Other Language Changes
uk: Інші зміни мови

source: Some smaller changes made to the core Python language are:
uk: Деякі менші зміни, внесені до основної мови Python:

source: The syntax for set literals has been backported from Python 3.x. Curly brackets are used to surround the contents of the resulting mutable set; set literals are distinguished from dictionaries by not containing colons and values. ``{}`` continues to represent an empty dictionary; use ``set()`` for an empty set.
uk: Синтаксис літералів набору було перенесено з Python 3.x. Фігурні дужки використовуються для обведення вмісту отриманого змінного набору; Літерали набору відрізняються від словників тим, що вони не містять двокрапки та значень. ``{}`` продовжує представляти порожній словник; використовуйте ``set()`` для порожнього набору.

source: Backported by Alexandre Vassalotti; :issue:`2335`.
uk: Підтримано Александром Вассалотті; :issue:`2335`.

source: Dictionary and set comprehensions are another feature backported from 3.x, generalizing list/generator comprehensions to use the literal syntax for sets and dictionaries.
uk: Розуміння словників і наборів — ще одна функція, портована з версії 3.x, яка узагальнює розуміння списків/генераторів для використання літерального синтаксису для наборів і словників.

source: Backported by Alexandre Vassalotti; :issue:`2333`.
uk: Підтримано Александром Вассалотті; :issue:`2333`.

source: The :keyword:`with` statement can now use multiple context managers in one statement. Context managers are processed from left to right and each one is treated as beginning a new :keyword:`!with` statement. This means that::
uk: Оператор :keyword:`with` тепер може використовувати кілька менеджерів контексту в одному операторі. Менеджери контексту обробляються зліва направо, і кожен з них розглядається як початок нового оператора :keyword:`!with`. Це означає що::

source: is equivalent to::
uk: еквівалентно::

source: The :func:`contextlib.nested` function provides a very similar function, so it's no longer necessary and has been deprecated.
uk: Функція :func:`contextlib.nested` надає дуже схожу функцію, тому вона більше не потрібна і є застарілою.

source: (Proposed in https://codereview.appspot.com/53094; implemented by Georg Brandl.)
uk: (Запропоновано в https://codereview.appspot.com/53094; реалізовано Георгом Брандлом.)

source: Conversions between floating-point numbers and strings are now correctly rounded on most platforms. These conversions occur in many different places: :func:`str` on floats and complex numbers; the :class:`float` and :class:`complex` constructors; numeric formatting; serializing and deserializing floats and complex numbers using the :mod:`marshal`, :mod:`pickle` and :mod:`json` modules; parsing of float and imaginary literals in Python code; and :class:`~decimal.Decimal`-to-float conversion.
uk: Перетворення між числами з плаваючою комою та рядками тепер правильно округлені на більшості платформ. Ці перетворення відбуваються в багатьох різних місцях: :func:`str` для чисел з плаваючою точкою та комплексних чисел; конструктори :class:`float` і :class:`complex`; форматування чисел; серіалізація та десеріалізація плаваючих і комплексних чисел за допомогою модулів :mod:`marshal`, :mod:`pickle` і :mod:`json`; розбір літералів з плаваючою точкою та уявних літералів у коді Python; і перетворення з :class:`~decimal.Decimal` в число з плаваючою точкою.

source: Related to this, the :func:`repr` of a floating-point number *x* now returns a result based on the shortest decimal string that's guaranteed to round back to *x* under correct rounding (with round-half-to-even rounding mode). Previously it gave a string based on rounding x to 17 decimal digits.
uk: Пов’язано з цим, :func:`repr` числа з плаваючою комою *x* тепер повертає результат на основі найкоротшого десяткового рядка, який гарантовано повертається до *x* за правильного округлення (з округленням від половини до- рівномірний режим округлення). Раніше він давав рядок на основі округлення x до 17 десяткових цифр.

source: The rounding library responsible for this improvement works on Windows and on Unix platforms using the gcc, icc, or suncc compilers. There may be a small number of platforms where correct operation of this code cannot be guaranteed, so the code is not used on such systems. You can find out which code is being used by checking :data:`sys.float_repr_style`, which will be ``short`` if the new code is in use and ``legacy`` if it isn't.
uk: Бібліотека округлення, відповідальна за це вдосконалення, працює на платформах Windows і Unix за допомогою компіляторів gcc, icc або suncc. Може існувати невелика кількість платформ, на яких коректна робота цього коду не може бути гарантована, тому код не використовується в таких системах. Ви можете дізнатися, який код використовується, перевіривши :data:`sys.float_repr_style`, який буде ``short``, якщо новий код використовується, і ``legacy``, якщо він не використовується.

source: Implemented by Eric Smith and Mark Dickinson, using David Gay's :file:`dtoa.c` library; :issue:`7117`.
uk: Реалізовано Еріком Смітом і Марком Дікінсоном, використовуючи бібліотеку :file:`dtoa.c` Девіда Гея; :issue:`7117`.

source: Conversions from long integers and regular integers to floating point now round differently, returning the floating-point number closest to the number. This doesn't matter for small integers that can be converted exactly, but for large numbers that will unavoidably lose precision, Python 2.7 now approximates more closely. For example, Python 2.6 computed the following::
uk: Перетворення довгих цілих і звичайних цілих чисел у числа з плаваючою комою тепер округлюються по-різному, повертаючи найближче до числа число з плаваючою комою. Це не має значення для малих цілих чисел, які можна точно перетворити, але для великих чисел, які неминуче втратять точність, Python 2.7 тепер наближається точніше. Наприклад, Python 2.6 обчислив наступне:

source: Python 2.7's floating-point result is larger, but much closer to the true value::
uk: Результат Python 2.7 з плаваючою комою більший, але набагато ближчий до справжнього значення::

source: (Implemented by Mark Dickinson; :issue:`3166`.)
uk: (Реалізовано Марком Дікінсоном; :issue:`3166`.)

source: Integer division is also more accurate in its rounding behaviours. (Also implemented by Mark Dickinson; :issue:`1811`.)
uk: Цілочисельне ділення також є більш точним у своїй поведінці округлення. (Також реалізовано Марком Дікінсоном; :issue:`1811`.)

source: Implicit coercion for complex numbers has been removed; the interpreter will no longer ever attempt to call a :meth:`__coerce__` method on complex objects. (Removed by Meador Inge and Mark Dickinson; :issue:`5211`.)
uk: Неявний примус для комплексних чисел видалено; інтерпретатор більше ніколи не намагатиметься викликати метод :meth:`__coerce__` для складних об’єктів. (Видалено Меадор Інґе та Марком Дікінсоном; :issue:`5211`.)

source: The :meth:`str.format` method now supports automatic numbering of the replacement fields. This makes using :meth:`str.format` more closely resemble using ``%s`` formatting::
uk: Метод :meth:`str.format` тепер підтримує автоматичну нумерацію полів заміни. Це робить використання :meth:`str.format` більш схожим на використання ``%s`` форматування::

source: The auto-numbering takes the fields from left to right, so the first ``{...}`` specifier will use the first argument to :meth:`str.format`, the next specifier will use the next argument, and so on. You can't mix auto-numbering and explicit numbering -- either number all of your specifier fields or none of them -- but you can mix auto-numbering and named fields, as in the second example above. (Contributed by Eric Smith; :issue:`5237`.)
uk: Автоматична нумерація виконує поля зліва направо, тому перший специфікатор ``{...}`` використовуватиме перший аргумент :meth:`str.format`, наступний специфікатор використовуватиме наступний аргумент, а так далі. Ви не можете змішувати автоматичну нумерацію та явну нумерацію — або пронумеруйте всі поля специфікаторів, або жодне з них — але ви можете поєднувати автоматичну нумерацію та іменовані поля, як у другому прикладі вище. (Надав Ерік Сміт; :issue:`5237`.)

source: Complex numbers now correctly support usage with :func:`format`, and default to being right-aligned. Specifying a precision or comma-separation applies to both the real and imaginary parts of the number, but a specified field width and alignment is applied to the whole of the resulting ``1.5+3j`` output. (Contributed by Eric Smith; :issue:`1588` and :issue:`7988`.)
uk: Комплексні числа тепер правильно підтримують використання з :func:`format` і за замовчуванням вирівнюються по правому краю. Вказівка точності або розділення комами застосовується як до дійсної, так і до уявної частин числа, але задана ширина поля та вирівнювання застосовуються до всього результуючого результату ``1,5+3j``. (Надав Ерік Сміт; :issue:`1588` і :issue:`7988`.)

source: The 'F' format code now always formats its output using uppercase characters, so it will now produce 'INF' and 'NAN'. (Contributed by Eric Smith; :issue:`3382`.)
uk: Код формату "F" тепер завжди форматує вихідні дані за допомогою символів у верхньому регістрі, тому тепер він створюватиме "INF" і "NAN". (Надав Ерік Сміт; :issue:`3382`.)

source: A low-level change: the :meth:`object.__format__` method now triggers a :exc:`PendingDeprecationWarning` if it's passed a format string, because the :meth:`__format__` method for :class:`object` converts the object to a string representation and formats that. Previously the method silently applied the format string to the string representation, but that could hide mistakes in Python code. If you're supplying formatting information such as an alignment or precision, presumably you're expecting the formatting to be applied in some object-specific way. (Fixed by Eric Smith; :issue:`7994`.)
uk: Зміна низького рівня: метод :meth:`object.__format__` тепер запускає :exc:`PendingDeprecationWarning`, якщо передано рядок формату, оскільки метод :meth:`__format__` для :class:`object` перетворює об'єкт до рядкового представлення та форматує це. Раніше метод мовчки застосовував рядок формату до представлення рядка, але це могло приховати помилки в коді Python. Якщо ви надаєте інформацію про форматування, таку як вирівнювання або точність, імовірно, ви очікуєте, що форматування буде застосовано певним чином, що стосується конкретного об’єкта. (Виправлено Еріком Смітом; :issue:`7994`.)

source: The :func:`int` and :func:`long` types gained a ``bit_length`` method that returns the number of bits necessary to represent its argument in binary::
uk: Типи :func:`int` і :func:`long` отримали метод ``bit_length``, який повертає кількість бітів, необхідних для представлення свого аргументу в двійковому вигляді::

source: (Contributed by Fredrik Johansson and Victor Stinner; :issue:`3439`.)
uk: (Надано Фредріком Йоханссоном і Віктором Стіннером; :issue:`3439`.)
