Repository: python/python-docs-uk
Catalog: whatsnew/2_4.po
Languages: uk

source: :const:`None` is now a constant; code that binds a new value to the name ``None`` is now a syntax error. (Contributed by Raymond Hettinger.)
uk: :const:`None` тепер константа; код, який прив’язує нове значення до імені ``None``, тепер є синтаксичною помилкою. (Надав Реймонд Геттінгер.)

source: Optimizations
uk: Оптимізації

source: The inner loops for list and tuple slicing were optimized and now run about one-third faster. The inner loops for dictionaries were also optimized, resulting in performance boosts for :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues`, and :meth:`iteritems`. (Contributed by Raymond Hettinger.)
uk: Внутрішні цикли для нарізки списків і кортежів оптимізовано і тепер працюють приблизно на третину швидше. Внутрішні цикли для словників також були оптимізовані, що призвело до підвищення продуктивності для :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues` та :meth:`iteritems`. (Надав Реймонд Геттінгер.)

source: The machinery for growing and shrinking lists was optimized for speed and for space efficiency. Appending and popping from lists now runs faster due to more efficient code paths and less frequent use of the underlying system :c:func:`realloc`. List comprehensions also benefit. :meth:`list.extend` was also optimized and no longer converts its argument into a temporary list before extending the base list. (Contributed by Raymond Hettinger.)
uk: Обладнання для збільшення та скорочення списків було оптимізовано з точки зору швидкості та економії місця. Додавання та видалення зі списків тепер виконується швидше завдяки більш ефективним шляхам коду та менш частому використанню основної системи :c:func:`realloc`. Розуміння списків також корисне. :meth:`list.extend` також оптимізовано і більше не перетворює свій аргумент у тимчасовий список перед розширенням базового списку. (Надав Реймонд Геттінгер.)

source: :func:`list`, :func:`tuple`, :func:`map`, :func:`filter`, and :func:`zip` now run several times faster with non-sequence arguments that supply a :meth:`__len__` method. (Contributed by Raymond Hettinger.)
uk: :func:`list`, :func:`tuple`, :func:`map`, :func:`filter` і :func:`zip` тепер працюють у кілька разів швидше з непослідовними аргументами, які надають :meth:`__len__` метод. (Надав Реймонд Геттінгер.)

source: The methods :meth:`list.__getitem__`, :meth:`dict.__getitem__`, and :meth:`dict.__contains__` are now implemented as :class:`method_descriptor` objects rather than :class:`wrapper_descriptor` objects. This form of access doubles their performance and makes them more suitable for use as arguments to functionals: ``map(mydict.__getitem__, keylist)``. (Contributed by Raymond Hettinger.)
uk: Методи :meth:`list.__getitem__`, :meth:`dict.__getitem__` і :meth:`dict.__contains__` тепер реалізовано як об’єкти :class:`method_descriptor`, а не як об’єкти :class:`wrapper_descriptor`. Ця форма доступу подвоює їх продуктивність і робить їх більш придатними для використання як аргументів функціоналу: ``map(mydict.__getitem__, keylist)``. (Надав Реймонд Геттінгер.)

source: Added a new opcode, ``LIST_APPEND``, that simplifies the generated bytecode for list comprehensions and speeds them up by about a third. (Contributed by Raymond Hettinger.)
uk: Додано новий код операції, ``LIST_APPEND``, який спрощує згенерований байт-код для розуміння списків і прискорює їх приблизно на третину. (Надав Реймонд Геттінгер.)

source: The peephole bytecode optimizer has been improved to produce shorter, faster bytecode; remarkably, the resulting bytecode is more readable. (Enhanced by Raymond Hettinger.)
uk: Оптимізатор байт-коду peephole було вдосконалено для створення коротшого та швидшого байт-коду; примітно, що отриманий байт-код більш читабельний. (Покращено Раймондом Геттінгером.)

source: String concatenations in statements of the form ``s = s + "abc"`` and ``s += "abc"`` are now performed more efficiently in certain circumstances. This optimization won't be present in other Python implementations such as Jython, so you shouldn't rely on it; using the :meth:`join` method of strings is still recommended when you want to efficiently glue a large number of strings together. (Contributed by Armin Rigo.)
uk: Конкатенації рядків у операторах у формі ``s = s + "abc"`` та ``s += "abc"`` тепер виконуються більш ефективно за певних обставин. Ця оптимізація не буде присутня в інших реалізаціях Python, таких як Jython, тому вам не слід покладатися на неї; використання методу рядків :meth:`join` все ще рекомендується, якщо ви хочете ефективно склеїти велику кількість рядків. (Надав Армін Ріго.)

source: The net result of the 2.4 optimizations is that Python 2.4 runs the pystone benchmark around 5% faster than Python 2.3 and 35% faster than Python 2.2. (pystone is not a particularly good benchmark, but it's the most commonly used measurement of Python's performance. Your own applications may show greater or smaller benefits from Python 2.4.)
uk: Кінцевим результатом оптимізації 2.4 є те, що Python 2.4 виконує тест pystone приблизно на 5% швидше, ніж Python 2.3, і на 35% швидше, ніж Python 2.2. (pystone не є особливо хорошим тестом, але це найбільш часто використовуваний метод вимірювання продуктивності Python. Ваші власні програми можуть продемонструвати більшу чи меншу користь від Python 2.4.)

source: New, Improved, and Deprecated Modules
uk: Нові, покращені та застарілі модулі

source: As usual, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the CVS logs for all the details.
uk: Як завжди, стандартна бібліотека Python отримала низку вдосконалень і виправлень помилок. Ось неповний список найбільш помітних змін, відсортованих за алфавітом назв модулів. Зверніться до файлу :file:`Misc/NEWS` у дереві вихідних кодів, щоб отримати більш повний список змін, або перегляньте журнали CVS, щоб отримати всі деталі.

source: The :mod:`base64` module now has more complete :rfc:`3548` support for Base64, Base32, and Base16 encoding and decoding, including optional case folding and optional alternative alphabets. (Contributed by Barry Warsaw.)
uk: Модуль :mod:`base64` тепер має більш повну підтримку :rfc:`3548` кодування та декодування Base64, Base32 і Base16, включаючи необов’язкове згортання регістру та альтернативні алфавіти. (Надав Баррі Варшау.)

source: The :mod:`bisect` module now has an underlying C implementation for improved performance. (Contributed by Dmitry Vasiliev.)
uk: Модуль :mod:`bisect` тепер має базову реалізацію C для покращення продуктивності. (Надав Дмитро Васильєв.)

source: The CJKCodecs collections of East Asian codecs, maintained by Hye-Shik Chang, was integrated into 2.4. The new encodings are:
uk: Колекції кодеків Східної Азії CJKCodecs, які підтримує Hye-Shik Chang, були інтегровані у 2.4. Нові кодування:

source: Chinese (PRC): gb2312, gbk, gb18030, big5hkscs, hz
uk: Китайська (КНР): gb2312, gbk, gb18030, big5hkscs, hz

source: Chinese (ROC): big5, cp950
uk: Китайська (ROC): big5, cp950

source: Japanese: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,
uk: Японська: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,

source: Korean: cp949, euc-kr, johab, iso-2022-kr
uk: Корейська: cp949, euc-kr, johab, iso-2022-kr

source: Some other new encodings were added: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154, and TIS-620.
uk: Додано деякі інші нові кодування: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154 і TIS-620.

source: The UTF-8 and UTF-16 codecs now cope better with receiving partial input. Previously the :class:`StreamReader` class would try to read more data, making it impossible to resume decoding from the stream. The :meth:`read` method will now return as much data as it can and future calls will resume decoding where previous ones left off. (Implemented by Walter Dörwald.)
uk: Кодеки UTF-8 і UTF-16 тепер краще справляються з отриманням часткового введення. Раніше клас :class:`StreamReader` намагався прочитати більше даних, унеможливлюючи відновлення декодування з потоку. Метод :meth:`read` тепер повертатиме стільки даних, скільки зможе, а майбутні виклики відновлюватимуть декодування там, де зупинилися попередні. (Реалізовано Вальтером Дьорвальдом.)

source: There is a new :mod:`collections` module for various specialized collection datatypes. Currently it contains just one type, :class:`deque`, a double-ended queue that supports efficiently adding and removing elements from either end::
uk: Існує новий модуль :mod:`collections` для різних спеціалізованих типів даних колекції. Наразі він містить лише один тип, :class:`deque`, двосторонню чергу, яка підтримує ефективне додавання та видалення елементів з будь-якого кінця::

source: Several modules, such as the :mod:`Queue` and :mod:`threading` modules, now take advantage of :class:`collections.deque` for improved performance. (Contributed by Raymond Hettinger.)
uk: Кілька модулів, наприклад модулі :mod:`Queue` і :mod:`threading`, тепер використовують переваги :class:`collections.deque` для покращення продуктивності. (Надав Реймонд Геттінгер.)

source: The :mod:`curses` module now supports the ncurses extension :func:`use_default_colors`. On platforms where the terminal supports transparency, this makes it possible to use a transparent background. (Contributed by Jörg Lehmann.)
uk: Модуль :mod:`curses` тепер підтримує розширення ncurses :func:`use_default_colors`. На платформах, де термінал підтримує прозорість, це дає змогу використовувати прозорий фон. (Надав Йорг Леманн.)

source: The :mod:`difflib` module now includes an :class:`HtmlDiff` class that creates an HTML table showing a side by side comparison of two versions of a text. (Contributed by Dan Gass.)
uk: Модуль :mod:`difflib` тепер містить клас :class:`HtmlDiff`, який створює HTML-таблицю, що показує пліч-о-пліч порівняння двох версій тексту. (Надав Ден Гасс.)

source: The :mod:`email` package was updated to version 3.0, which dropped various deprecated APIs and removes support for Python versions earlier than 2.3. The 3.0 version of the package uses a new incremental parser for MIME messages, available in the :mod:`email.FeedParser` module. The new parser doesn't require reading the entire message into memory, and doesn't raise exceptions if a message is malformed; instead it records any problems in the :attr:`defect` attribute of the message. (Developed by Anthony Baxter, Barry Warsaw, Thomas Wouters, and others.)
uk: Пакет :mod:`email` було оновлено до версії 3.0, у якій усунено різні застарілі API та припинено підтримку версій Python, раніших за 2.3. Версія пакета 3.0 використовує новий інкрементальний аналізатор для повідомлень MIME, доступний у модулі :mod:`email.FeedParser`. Новий синтаксичний аналізатор не вимагає читання всього повідомлення в пам’ять і не викликає винятків, якщо повідомлення неправильно сформоване; замість цього він записує всі проблеми в атрибуті :attr:`defect` повідомлення. (Розроблено Ентоні Бакстером, Баррі Варсоу, Томасом Воутерсом та іншими.)

source: The :mod:`heapq` module has been converted to C. The resulting tenfold improvement in speed makes the module suitable for handling high volumes of data. In addition, the module has two new functions :func:`nlargest` and :func:`nsmallest` that use heaps to find the N largest or smallest values in a dataset without the expense of a full sort. (Contributed by Raymond Hettinger.)
uk: Модуль :mod:`heapq` було перетворено на C. Десятикратне підвищення швидкості робить модуль придатним для роботи з великими обсягами даних. Крім того, модуль має дві нові функції :func:`nlargest` і :func:`nsmallest`, які використовують купи для пошуку N найбільших або найменших значень у наборі даних без витрат на повне сортування. (Надав Реймонд Геттінгер.)

source: The :mod:`imaplib` module now supports IMAP's THREAD command (contributed by Yves Dionne) and new :meth:`deleteacl` and :meth:`myrights` methods (contributed by Arnaud Mazin).
uk: Модуль :mod:`imaplib` тепер підтримує команду THREAD IMAP (надано Yves Dionne) і нові методи :meth:`deleteacl` і :meth:`myrights` (надано Arnaud Mazin).

source: The :mod:`itertools` module gained a ``groupby(iterable[, *func*])`` function. *iterable* is something that can be iterated over to return a stream of elements, and the optional *func* parameter is a function that takes an element and returns a key value; if omitted, the key is simply the element itself. :func:`groupby` then groups the elements into subsequences which have matching values of the key, and returns a series of 2-tuples containing the key value and an iterator over the subsequence.
uk: Модуль :mod:`itertools` отримав функцію ``groupby(iterable[, *func*])``. *iterable* — це те, що можна повторити, щоб повернути потік елементів, а необов’язковий параметр *func* — це функція, яка приймає елемент і повертає значення ключа; якщо опущено, ключ - це просто сам елемент. Потім :func:`groupby` групує елементи в підпослідовності, які мають відповідні значення ключа, і повертає серію 2-кортежів, що містять значення ключа та ітератор над підпослідовністю.

source: Here's an example to make this clearer. The *key* function simply returns whether a number is even or odd, so the result of :func:`groupby` is to return consecutive runs of odd or even numbers. ::
uk: Ось приклад, щоб це було зрозуміліше. Функція *key* просто повертає, чи є число парним чи непарним, тому результатом :func:`groupby` є повернення послідовних циклів парних чи непарних чисел. ::

source: :func:`groupby` is typically used with sorted input. The logic for :func:`groupby` is similar to the Unix ``uniq`` filter which makes it handy for eliminating, counting, or identifying duplicate elements::
uk: :func:`groupby` зазвичай використовується з відсортованим введенням. Логіка для :func:`groupby` подібна до фільтра Unix ``uniq``, що робить його зручним для видалення, підрахунку або ідентифікації повторюваних елементів:

source: (Contributed by Hye-Shik Chang.)
uk: (Надано Hye-Shik Chang.)

source: :mod:`itertools` also gained a function named ``tee(iterator, N)`` that returns *N* independent iterators that replicate *iterator*. If *N* is omitted, the default is 2. ::
uk: :mod:`itertools` також отримав функцію під назвою ``tee(iterator, N)``, яка повертає *N* незалежних ітераторів, які копіюють *iterator*. Якщо *N* опущено, за замовчуванням буде 2. ::

source: Note that :func:`tee` has to keep copies of the values returned by the iterator; in the worst case, it may need to keep all of them. This should therefore be used carefully if the leading iterator can run far ahead of the trailing iterator in a long stream of inputs. If the separation is large, then you might as well use :func:`list` instead. When the iterators track closely with one another, :func:`tee` is ideal. Possible applications include bookmarking, windowing, or lookahead iterators. (Contributed by Raymond Hettinger.)
uk: Зауважте, що :func:`tee` має зберігати копії значень, які повертає ітератор; у гіршому випадку, можливо, доведеться зберегти їх усі. Тому це слід використовувати обережно, якщо провідний ітератор може працювати набагато попереду кінцевого ітератора в довгому потоці вхідних даних. Якщо розділення велике, ви також можете використати замість нього :func:`list`. Коли ітератори тісно відстежують один одного, :func:`tee` є ідеальним. Можливі програми включають закладки, вікна або ітератори з попереднім переглядом. (Надав Реймонд Геттінгер.)

source: Some keyword arguments were added to the :mod:`logging` package's :func:`basicConfig` function to simplify log configuration. The default behavior is to log messages to standard error, but various keyword arguments can be specified to log to a particular file, change the logging format, or set the logging level. For example::
uk: До функції :func:`basicConfig` пакета :mod:`logging` було додано деякі аргументи ключових слів, щоб спростити налаштування журналу. Поведінка за замовчуванням — реєстрація повідомлень до стандартної помилки, але можна вказати різні ключові аргументи для реєстрації в певному файлі, зміни формату журналювання або встановлення рівня журналювання. Наприклад::

source: Other additions to the :mod:`logging` package include a ``log(level, msg)`` convenience method, as well as a :class:`TimedRotatingFileHandler` class that rotates its log files at a timed interval. The module already had :class:`RotatingFileHandler`, which rotated logs once the file exceeded a certain size. Both classes derive from a new :class:`BaseRotatingHandler` class that can be used to implement other rotating handlers.
uk: Інші доповнення до пакета :mod:`logging` включають зручний метод ``log(level, msg)``, а також клас :class:`TimedRotatingFileHandler`, який обертає свої файли журналу з певним інтервалом. Модуль уже мав :class:`RotatingFileHandler`, який обертав журнали, коли файл перевищував певний розмір. Обидва класи походять від нового класу :class:`BaseRotatingHandler`, який можна використовувати для реалізації інших обертових обробників.

source: (Changes implemented by Vinay Sajip.)
uk: (Зміни внесено Вінаєм Саджипом.)

source: The :mod:`marshal` module now shares interned strings on unpacking a data structure. This may shrink the size of certain pickle strings, but the primary effect is to make :file:`.pyc` files significantly smaller. (Contributed by Martin von Löwis.)
uk: Модуль :mod:`marshal` тепер ділиться вбудованими рядками під час розпакування структури даних. Це може зменшити розмір певних рядків pickle, але основний ефект полягає в тому, щоб зробити файли :file:`.pyc` значно меншими. (Надав Мартін фон Льовіс.)

source: Two new functions were added to the :mod:`operator` module, ``attrgetter(attr)`` and ``itemgetter(index)``. Both functions return callables that take a single argument and return the corresponding attribute or item; these callables make excellent data extractors when used with :func:`map` or :func:`sorted`. For example::
uk: До модуля :mod:`operator` додано дві нові функції, ``attrgetter(attr)`` та ``itemgetter(index)``. Обидві функції повертають виклики, які приймають один аргумент і повертають відповідний атрибут або елемент; ці виклики створюють чудові екстрактори даних при використанні з :func:`map` або :func:`sorted`. Наприклад::

source: The :mod:`optparse` module was updated in various ways. The module now passes its messages through :func:`gettext.gettext`, making it possible to internationalize Optik's help and error messages. Help messages for options can now include the string ``'%default'``, which will be replaced by the option's default value. (Contributed by Greg Ward.)
uk: Модуль :mod:`optparse` було оновлено різними способами. Тепер модуль передає свої повідомлення через :func:`gettext.gettext`, що робить можливим інтернаціоналізацію довідки та повідомлень про помилки Optik. Повідомлення довідки для параметрів тепер можуть містити рядок ``'%default``, який буде замінено значенням параметра за замовчуванням. (Надав Грег Ворд.)

source: A new ``urandom(n)`` function was added to the :mod:`os` module, returning a string containing *n* bytes of random data. This function provides access to platform-specific sources of randomness such as :file:`/dev/urandom` on Linux or the Windows CryptoAPI. (Contributed by Trevor Perrin.)
uk: До модуля :mod:`os` було додано нову функцію ``urandom(n)``, яка повертає рядок, що містить *n* байтів випадкових даних. Ця функція надає доступ до специфічних для платформи джерел випадковості, таких як :file:`/dev/urandom` у Linux або Windows CryptoAPI. (Надано Тревором Перріном.)

source: Another new function: ``os.path.lexists(path)`` returns true if the file specified by *path* exists, whether or not it's a symbolic link. This differs from the existing ``os.path.exists(path)`` function, which returns false if *path* is a symlink that points to a destination that doesn't exist. (Contributed by Beni Cherniavsky.)
uk: Ще одна нова функція: ``os.path.lexists(path)`` повертає true, якщо файл, визначений *path*, існує, незалежно від того, чи є це символічним посиланням. Це відрізняється від існуючої функції ``os.path.exists(path)``, яка повертає false, якщо *path* є символічним посиланням, яке вказує на пункт призначення, якого не існує. (Надав Бені Чернявський.)

source: A new :func:`getsid` function was added to the :mod:`posix` module that underlies the :mod:`os` module. (Contributed by J. Raynor.)
uk: Нову функцію :func:`getsid` було додано до модуля :mod:`posix`, який лежить в основі модуля :mod:`os`. (Надав Дж. Рейнор.)

source: The :mod:`poplib` module now supports POP over SSL. (Contributed by Hector Urtubia.)
uk: Модуль :mod:`poplib` тепер підтримує POP через SSL. (Надав Гектор Уртубія.)

source: The :mod:`profile` module can now profile C extension functions. (Contributed by Nick Bastin.)
uk: Модуль :mod:`profile` тепер може профілювати функції розширення C. (Надав Нік Бастін.)

source: The :mod:`random` module has a new method called ``getrandbits(N)`` that returns a long integer *N* bits in length. The existing :meth:`randrange` method now uses :meth:`getrandbits` where appropriate, making generation of arbitrarily large random numbers more efficient. (Contributed by Raymond Hettinger.)
uk: Модуль :mod:`random` має новий метод під назвою ``getrandbits(N)``, який повертає довге ціле число *N* біт. Існуючий метод :meth:`randrange` тепер використовує :meth:`getrandbits`, де це доречно, що робить генерацію довільно великих випадкових чисел більш ефективною. (Надав Реймонд Геттінгер.)

source: The regular expression language accepted by the :mod:`re` module was extended with simple conditional expressions, written as ``(?(group)A|B)``. *group* is either a numeric group ID or a group name defined with ``(?P<group>...)`` earlier in the expression. If the specified group matched, the regular expression pattern *A* will be tested against the string; if the group didn't match, the pattern *B* will be used instead. (Contributed by Gustavo Niemeyer.)
uk: Мова регулярних виразів, прийнята модулем :mod:`re`, була розширена простими умовними виразами, написаними як ``(?(group)A|B)``. *group* — це числовий ідентифікатор групи або назва групи, визначена за допомогою ``(?P <group> ...)`` раніше у виразі. Якщо вказана група збігається, шаблон регулярного виразу *A* буде перевірено на відповідність рядку; якщо група не збігається, замість неї буде використано шаблон *B*. (Надав Густаво Німейєр.)
