Repository: python/python-docs-uk
Catalog: whatsnew/2_4.po
Languages: uk

source: The :mod:`re` module is also no longer recursive, thanks to a massive amount of work by Gustavo Niemeyer. In a recursive regular expression engine, certain patterns result in a large amount of C stack space being consumed, and it was possible to overflow the stack. For example, if you matched a 30000-byte string of ``a`` characters against the expression ``(a|b)+``, one stack frame was consumed per character. Python 2.3 tried to check for stack overflow and raise a :exc:`RuntimeError` exception, but certain patterns could sidestep the checking and if you were unlucky Python could segfault. Python 2.4's regular expression engine can match this pattern without problems.
uk: Модуль :mod:`re` також більше не є рекурсивним, завдяки величезній кількості роботи Густаво Німейєра. У механізмі рекурсивних регулярних виразів певні шаблони призводять до використання великої кількості стеку C, і стек може бути переповнений. Наприклад, якщо ви зіставили 30000-байтовий рядок символів ``a`` із виразом ``(a|b)+``, один кадр стека споживався на символ. Python 2.3 намагався перевірити переповнення стеку та викликати виняток :exc:`RuntimeError`, але певні шаблони могли обійти перевірку, і якщо вам не пощастило, Python міг стати segfault. Механізм регулярних виразів Python 2.4 може без проблем відповідати цьому шаблону.

source: The :mod:`signal` module now performs tighter error-checking on the parameters to the :func:`signal.signal` function. For example, you can't set a handler on the :const:`SIGKILL` signal; previous versions of Python would quietly accept this, but 2.4 will raise a :exc:`RuntimeError` exception.
uk: Модуль :mod:`signal` тепер виконує ретельнішу перевірку параметрів функції :func:`signal.signal` на помилки. Наприклад, ви не можете встановити обробник для сигналу :const:`SIGKILL`; попередні версії Python спокійно прийняли це, але 2.4 викличе виняток :exc:`RuntimeError`.

source: Two new functions were added to the :mod:`socket` module. :func:`socketpair` returns a pair of connected sockets and ``getservbyport(port)`` looks up the service name for a given port number. (Contributed by Dave Cole and Barry Warsaw.)
uk: До модуля :mod:`socket` додано дві нові функції. :func:`socketpair` повертає пару підключених сокетів, а ``getservbyport(port)`` шукає назву служби для даного номера порту. (Надано Дейвом Коулом і Баррі Варшау.)

source: The :func:`sys.exitfunc` function has been deprecated. Code should be using the existing :mod:`atexit` module, which correctly handles calling multiple exit functions. Eventually :func:`sys.exitfunc` will become a purely internal interface, accessed only by :mod:`atexit`.
uk: Функція :func:`sys.exitfunc` застаріла. У коді має використовуватися існуючий модуль :mod:`atexit`, який правильно обробляє виклик кількох функцій виходу. Згодом :func:`sys.exitfunc` стане суто внутрішнім інтерфейсом, доступ до якого буде мати лише :mod:`atexit`.

source: The :mod:`tarfile` module now generates GNU-format tar files by default. (Contributed by Lars Gustäbel.)
uk: Модуль :mod:`tarfile` тепер за замовчуванням створює файли tar у форматі GNU. (Надав Ларс Густебель.)

source: The :mod:`threading` module now has an elegantly simple way to support thread-local data. The module contains a :class:`local` class whose attribute values are local to different threads. ::
uk: Модуль :mod:`threading` тепер має елегантно простий спосіб підтримки локальних даних потоку. Модуль містить клас :class:`local`, значення атрибутів якого є локальними для різних потоків. ::

source: Other threads can assign and retrieve their own values for the :attr:`number` and :attr:`url` attributes. You can subclass :class:`local` to initialize attributes or to add methods. (Contributed by Jim Fulton.)
uk: Інші потоки можуть призначати та отримувати власні значення для атрибутів :attr:`number` і :attr:`url`. Ви можете створити підклас :class:`local`, щоб ініціалізувати атрибути або додати методи. (Надав Джим Фултон.)

source: The :mod:`timeit` module now automatically disables periodic garbage collection during the timing loop. This change makes consecutive timings more comparable. (Contributed by Raymond Hettinger.)
uk: Модуль :mod:`timeit` тепер автоматично вимикає періодичне збирання сміття під час циклу синхронізації. Ця зміна робить послідовні таймінги більш порівнянними. (Надав Реймонд Геттінгер.)

source: The :mod:`weakref` module now supports a wider variety of objects including Python functions, class instances, sets, frozensets, deques, arrays, files, sockets, and regular expression pattern objects. (Contributed by Raymond Hettinger.)
uk: Модуль :mod:`weakref` тепер підтримує більшу різноманітність об’єктів, включаючи функції Python, екземпляри класів, набори, заморожені набори, дві версії, масиви, файли, сокети та шаблони регулярних виразів. (Надав Реймонд Геттінгер.)

source: The :mod:`mpz`, :mod:`rotor`, and :mod:`xreadlines` modules have been removed.
uk: Модулі :mod:`mpz`, :mod:`rotor` і :mod:`xreadlines` видалено.

source: In order to store cookies across sessions, two implementations of cookie jars are provided: one that stores cookies in the Netscape format so applications can use the Mozilla or Lynx cookie files, and one that stores cookies in the same format as the Perl libwww library.
uk: Щоб зберігати файли cookie протягом сеансів, передбачено дві реалізації файлів cookie: один, який зберігає файли cookie у форматі Netscape, щоб програми могли використовувати файли cookie Mozilla або Lynx, і інший, який зберігає файли cookie у тому самому форматі, що й бібліотека Perl libwww.

source: This module was contributed by John J. Lee.
uk: Цей модуль створено Джоном Дж. Лі.

source: The :mod:`doctest` module underwent considerable refactoring thanks to Edward Loper and Tim Peters. Testing can still be as simple as running :func:`doctest.testmod`, but the refactorings allow customizing the module's operation in various ways
uk: Модуль :mod:`doctest` зазнав значного рефакторингу завдяки Едварду Лоперу та Тіму Пітерсу. Тестування може бути таким же простим, як запуск :func:`doctest.testmod`, але рефакторинг дозволяє налаштувати роботу модуля різними способами

source: The new :class:`DocTestFinder` class extracts the tests from a given object's docstrings::
uk: Новий клас :class:`DocTestFinder` витягує тести з рядків документації даного об’єкта::

source: The new :class:`DocTestRunner` class then runs individual tests and can produce a summary of the results::
uk: Потім новий клас :class:`DocTestRunner` запускає окремі тести та може створювати зведення результатів:

source: The above example produces the following output::
uk: Наведений вище приклад дає такий вихід:

source: :class:`DocTestRunner` uses an instance of the :class:`OutputChecker` class to compare the expected output with the actual output. This class takes a number of different flags that customize its behaviour; ambitious users can also write a completely new subclass of :class:`OutputChecker`.
uk: :class:`DocTestRunner` використовує екземпляр класу :class:`OutputChecker` для порівняння очікуваного результату з фактичним результатом. Цей клас приймає кілька різних прапорів, які налаштовують його поведінку; амбітні користувачі також можуть написати абсолютно новий підклас :class:`OutputChecker`.

source: The default output checker provides a number of handy features. For example, with the :const:`doctest.ELLIPSIS` option flag, an ellipsis (``...``) in the expected output matches any substring, making it easier to accommodate outputs that vary in minor ways::
uk: Засіб перевірки виводу за замовчуванням надає ряд зручних функцій. Наприклад, з прапорцем опції :const:`doctest.ELLIPSIS` три крапки (``...``) в очікуваному виведенні відповідають будь-якому підрядку, що полегшує розміщення виходів, які незначно відрізняються:

source: Another special string, ``<BLANKLINE>``, matches a blank line::
uk: Інший спеціальний рядок, ``<BLANKLINE>``, відповідає порожньому рядку::

source: Another new capability is producing a diff-style display of the output by specifying the :const:`doctest.REPORT_UDIFF` (unified diffs), :const:`doctest.REPORT_CDIFF` (context diffs), or :const:`doctest.REPORT_NDIFF` (delta-style) option flags. For example::
uk: Іншою новою можливістю є створення відображення вихідних даних у стилі відмінностей, вказуючи :const:`doctest.REPORT_UDIFF` (уніфіковані відмінності), :const:`doctest.REPORT_CDIFF` (контекстні відмінності) або :const:`doctest.REPORT_NDIFF` (дельта-стиль) позначки параметрів. Наприклад::

source: Running the above function's tests with :const:`doctest.REPORT_UDIFF` specified, you get the following output:
uk: Запустивши тести наведеної вище функції з указаним :const:`doctest.REPORT_UDIFF`, ви отримаєте такий результат:

source: Build and C API Changes
uk: Зміни збірки та C API

source: Some of the changes to Python's build process and to the C API are:
uk: Деякі зміни в процесі збирання Python і в API C:

source: Three new convenience macros were added for common return values from extension functions: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE`, and :c:macro:`Py_RETURN_FALSE`. (Contributed by Brett Cannon.)
uk: Додано три нові зручні макроси для типових значень, що повертаються функціями розширення: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE` і :c:macro:`Py_RETURN_FALSE`. (Надав Бретт Кеннон.)

source: A new function, ``PyTuple_Pack(N, obj1, obj2, ..., objN)``, constructs tuples from a variable length argument list of Python objects. (Contributed by Raymond Hettinger.)
uk: Нова функція, ``PyTuple_Pack(N, obj1, obj2, ..., objN)``, створює кортежі зі списку аргументів змінної довжини об’єктів Python. (Надав Реймонд Геттінгер.)

source: A new function, ``PyDict_Contains(d, k)``, implements fast dictionary lookups without masking exceptions raised during the look-up process. (Contributed by Raymond Hettinger.)
uk: Нова функція, ``PyDict_Contains(d, k)``, реалізує швидкий пошук у словнику без маскування винятків, які виникають під час процесу пошуку. (Надав Реймонд Геттінгер.)

source: A new function, :c:func:`PyArg_VaParseTupleAndKeywords`, is the same as :c:func:`PyArg_ParseTupleAndKeywords` but takes a :c:type:`va_list` instead of a number of arguments. (Contributed by Greg Chapman.)
uk: Нова функція, :c:func:`PyArg_VaParseTupleAndKeywords`, така сама, як :c:func:`PyArg_ParseTupleAndKeywords`, але приймає :c:type:`va_list` замість кількох аргументів. (Надав Грег Чепмен.)

source: Python can now be built with additional profiling for the interpreter itself, intended as an aid to people developing the Python core. Providing :option:`!--enable-profiling` to the :program:`configure` script will let you profile the interpreter with :program:`gprof`, and providing the :option:`!--with-tsc` switch enables profiling using the Pentium's Time-Stamp-Counter register. Note that the :option:`!--with-tsc` switch is slightly misnamed, because the profiling feature also works on the PowerPC platform, though that processor architecture doesn't call that register "the TSC register". (Contributed by Jeremy Hylton.)
uk: Тепер Python можна створювати з додатковим профілюванням для самого інтерпретатора, призначеного як допомога людям, які розробляють ядро Python. Надання :option:`!--enable-profiling` сценарію :program:`configure` дозволить вам профілювати інтерпретатор за допомогою :program:`gprof` і надання перемикача :option:`!--with-tsc` дозволяє профілювання за допомогою реєстру Time-Stamp-Counter Pentium. Зауважте, що перемикач :option:`!--with-tsc` трохи неправильно названо, тому що функція профілювання також працює на платформі PowerPC, хоча ця архітектура процесора не називає цей регістр "реєстром TSC". (Надав Джеремі Гілтон.)

source: Port-Specific Changes
uk: Зміни, що стосуються порту

source: The Windows port now builds under MSVC++ 7.1 as well as version 6. (Contributed by Martin von Löwis.)
uk: Порт Windows тепер створено під MSVC++ 7.1, а також версію 6. (Надано Мартіном фон Льовісом.)

source: Porting to Python 2.4
uk: Перенесення на Python 2.4

source: This section lists previously described changes that may require changes to your code:
uk: У цьому розділі перераховано описані раніше зміни, які можуть потребувати змін у вашому коді:

source: Left shifts and hexadecimal/octal constants that are too large no longer trigger a :exc:`FutureWarning` and return a value limited to 32 or 64 bits; instead they return a long integer.
uk: Зрушення вліво та шістнадцяткові/вісімкові константи, які є занадто великими, більше не викликають :exc:`FutureWarning` і повертають значення, обмежене 32 або 64 бітами; замість цього вони повертають довге ціле число.

source: The :func:`zip` built-in function and :func:`itertools.izip` now return an empty list instead of raising a :exc:`TypeError` exception if called with no arguments.
uk: Вбудована функція :func:`zip` і :func:`itertools.izip` тепер повертають порожній список замість того, щоб викликати виняток :exc:`TypeError`, якщо викликати її без аргументів.

source: You can no longer compare the :class:`date` and :class:`~datetime.datetime` instances provided by the :mod:`datetime` module. Two instances of different classes will now always be unequal, and relative comparisons (``<``, ``>``) will raise a :exc:`TypeError`.
uk: Ви більше не можете порівнювати екземпляри :class:`date` і :class:`~datetime.datetime`, надані модулем :mod:`datetime`. Два екземпляри різних класів тепер завжди будуть нерівними, а відносні порівняння (``<``, ``>``) викличуть :exc:`TypeError`.

source: :func:`LexicalHandler.startDTD` used to receive the public and system IDs in the wrong order. This has been corrected; applications relying on the wrong order need to be fixed.
uk: :func:`LexicalHandler.startDTD` використовувався для отримання публічних і системних ідентифікаторів у неправильному порядку. Це було виправлено; потрібно виправити програми, які використовують неправильний порядок.

source: :func:`fcntl.ioctl` now warns if the *mutate* argument is omitted and relevant.
uk: :func:`fcntl.ioctl` тепер попереджає, якщо аргумент *mutate* пропущений і доречний.

source: The :mod:`tarfile` module now generates GNU-format tar files by default.
uk: Модуль :mod:`tarfile` тепер за замовчуванням створює файли tar у форматі GNU.

source: :const:`None` is now a constant; code that binds a new value to the name ``None`` is now a syntax error.
uk: :const:`None` тепер константа; код, який прив’язує нове значення до імені ``None``, тепер є синтаксичною помилкою.

source: The :func:`signals.signal` function now raises a :exc:`RuntimeError` exception for certain illegal values; previously these errors would pass silently. For example, you can no longer set a handler on the :const:`SIGKILL` signal.
uk: Функція :func:`signals.signal` тепер викликає виключення :exc:`RuntimeError` для певних недозволених значень; раніше ці помилки проходили мовчки. Наприклад, ви більше не можете встановити обробник для сигналу :const:`SIGKILL`.

source: Acknowledgements
uk: Подяки

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Koray Can, Hye-Shik Chang, Michael Dyck, Raymond Hettinger, Brian Hurt, Hamish Lawson, Fredrik Lundh, Sean Reifschneider, Sadruddin Rejeb.
uk: Автор хотів би подякувати наступним особам за пропозиції, виправлення та допомогу з різними чернетками цієї статті: Корай Кан, Хе-Шік Чанг, Майкл Дайк, Реймонд Геттінгер, Браян Херт, Хеміш Лоусон, Фредрік Лунд, Шон Рейфшнайдер, Садруддін Реджеб.

source: universal newlines
uk: універсальні символи нового рядка
