Repository: python/python-docs-uk
Catalog: whatsnew/2_4.po
Languages: uk

source: What's New in Python 2.4
uk: Що нового в Python 2.4

source: Author
uk: Автор

source: This article explains the new features in Python 2.4.1, released on March 30, 2005.
uk: У цій статті пояснюються нові функції Python 2.4.1, випущеного 30 березня 2005 року.

source: Python 2.4 is a medium-sized release. It doesn't introduce as many changes as the radical Python 2.2, but introduces more features than the conservative 2.3 release. The most significant new language features are function decorators and generator expressions; most other changes are to the standard library.
uk: Python 2.4 — випуск середнього розміру. Він не вносить стільки змін, як радикальний Python 2.2, але пропонує більше функцій, ніж консервативний випуск 2.3. Найважливішими новими можливостями мови є декоратори функцій і вирази-генератори; більшість інших змін стосуються стандартної бібліотеки.

source: According to the CVS change logs, there were 481 patches applied and 502 bugs fixed between Python 2.3 and 2.4. Both figures are likely to be underestimates.
uk: Згідно з журналами змін CVS, було застосовано 481 патч і 502 виправлені помилки між Python 2.3 і 2.4. Обидві цифри, ймовірно, занижені.

source: This article doesn't attempt to provide a complete specification of every single new feature, but instead provides a brief introduction to each feature. For full details, you should refer to the documentation for Python 2.4, such as the Python Library Reference and the Python Reference Manual. Often you will be referred to the PEP for a particular new feature for explanations of the implementation and design rationale.
uk: Ця стаття не намагається надати повну специфікацію кожної окремої нової функції, а натомість містить короткий вступ до кожної функції. Щоб отримати повну інформацію, зверніться до документації для Python 2.4, наприклад довідника бібліотеки Python і довідкового посібника Python. Часто вас направлять до PEP щодо конкретної нової функції для пояснень реалізації та обґрунтування дизайну.

source: PEP 218: Built-In Set Objects
uk: PEP 218: Вбудовані об’єкти

source: Python 2.3 introduced the :mod:`sets` module. C implementations of set data types have now been added to the Python core as two new built-in types, ``set(iterable)`` and ``frozenset(iterable)``. They provide high speed operations for membership testing, for eliminating duplicates from sequences, and for mathematical operations like unions, intersections, differences, and symmetric differences. ::
uk: Python 2.3 представив модуль :mod:`sets`. Реалізації C типів даних set тепер додано до ядра Python у вигляді двох нових вбудованих типів, ``set(iterable)`` і ``frozenset(iterable)``. Вони забезпечують високу швидкість виконання операцій для тестування членства, для усунення дублікатів із послідовностей і для математичних операцій, таких як об’єднання, перетини, різниці та симетричні різниці. ::

source: The :func:`frozenset` type is an immutable version of :func:`set`. Since it is immutable and hashable, it may be used as a dictionary key or as a member of another set.
uk: Тип :func:`frozenset` є незмінною версією :func:`set`. Оскільки він незмінний і хешується, його можна використовувати як ключ словника або як член іншого набору.

source: The :mod:`sets` module remains in the standard library, and may be useful if you wish to subclass the :class:`Set` or :class:`ImmutableSet` classes. There are currently no plans to deprecate the module.
uk: Модуль :mod:`sets` залишається в стандартній бібліотеці та може бути корисним, якщо ви бажаєте створити підклас класів :class:`Set` або :class:`ImmutableSet`. Наразі немає планів припинення підтримки модуля.

source: :pep:`218` - Adding a Built-In Set Object Type
uk: :pep:`218` - Додавання вбудованого типу об'єкта Set

source: Originally proposed by Greg Wilson and ultimately implemented by Raymond Hettinger.
uk: Спочатку запропонований Грегом Вілсоном і остаточно реалізований Реймондом Геттінгером.

source: PEP 237: Unifying Long Integers and Integers
uk: PEP 237: Об’єднання довгих і цілих чисел

source: The lengthy transition process for this PEP, begun in Python 2.2, takes another step forward in Python 2.4. In 2.3, certain integer operations that would behave differently after int/long unification triggered :exc:`FutureWarning` warnings and returned values limited to 32 or 64 bits (depending on your platform). In 2.4, these expressions no longer produce a warning and instead produce a different result that's usually a long integer.
uk: Тривалий процес переходу для цього PEP, розпочатий у Python 2.2, робить ще один крок вперед у Python 2.4. У версії 2.3 певні цілочисельні операції, які поводилися б інакше після об’єднання int/long, викликали попередження :exc:`FutureWarning` і повертали значення, обмежені 32 або 64 бітами (залежно від вашої платформи). У версії 2.4 ці вирази більше не створюють попередження, а натомість створюють інший результат, який зазвичай є довгим цілим числом.

source: The problematic expressions are primarily left shifts and lengthy hexadecimal and octal constants. For example, ``2 << 32`` results in a warning in 2.3, evaluating to 0 on 32-bit platforms. In Python 2.4, this expression now returns the correct answer, 8589934592.
uk: Проблемними виразами є, перш за все, зрушення вліво та довгі шістнадцяткові та вісімкові константи. Наприклад, ``2 << 32`` призводить до попередження у 2.3, оцінюючи 0 на 32-розрядних платформах. У Python 2.4 цей вираз тепер повертає правильну відповідь, 8589934592.

source: :pep:`237` - Unifying Long Integers and Integers
uk: :pep:`237` - Об'єднання довгих і цілих чисел

source: Original PEP written by Moshe Zadka and GvR. The changes for 2.4 were implemented by Kalle Svensson.
uk: Оригінальний PEP, написаний Моше Цадка та GvR. Зміни у версії 2.4 вніс Калле Свенссон.

source: PEP 289: Generator Expressions
uk: PEP 289: Генератор виразів

source: instead of ::
uk: замість ::

source: The first form is more concise and perhaps more readable, but if you're dealing with a large number of link objects you'd have to write the second form to avoid having all link objects in memory at the same time.
uk: Перша форма більш лаконічна і, можливо, більш читабельна, але якщо ви маєте справу з великою кількістю об’єктів посилань, вам доведеться написати другу форму, щоб уникнути одночасного зберігання всіх об’єктів посилань у пам’яті.

source: Generator expressions work similarly to list comprehensions but don't materialize the entire list; instead they create a generator that will return elements one by one. The above example could be written as::
uk: Вирази генератора працюють так само, як і розуміння списків, але не матеріалізують весь список; натомість вони створюють генератор, який повертатиме елементи один за одним. Наведений вище приклад можна записати так:

source: Generator expressions always have to be written inside parentheses, as in the above example. The parentheses signalling a function call also count, so if you want to create an iterator that will be immediately passed to a function you could write::
uk: Вирази-генератори завжди мають бути записані в круглих дужках, як у прикладі вище. Дужки, що сигналізують про виклик функції, також враховуються, тому, якщо ви хочете створити ітератор, який буде негайно передано функції, ви можете написати::

source: Generator expressions differ from list comprehensions in various small ways. Most notably, the loop variable (*obj* in the above example) is not accessible outside of the generator expression. List comprehensions leave the variable assigned to its last value; future versions of Python will change this, making list comprehensions match generator expressions in this respect.
uk: Вирази генератора відрізняються від розуміння списків кількома дрібницями. Зокрема, змінна циклу (*obj* у наведеному вище прикладі) недоступна поза виразом генератора. Розуміння списків залишає змінну присвоєною її останньому значенню; майбутні версії Python змінять це, зробивши розуміння списку відповідним виразам генератора в цьому відношенні.

source: :pep:`289` - Generator Expressions
uk: :pep:`289` - Генератор виразів

source: Proposed by Raymond Hettinger and implemented by Jiwon Seo with early efforts steered by Hye-Shik Chang.
uk: Запропоновано Raymond Hettinger і реалізовано Jiwon Seo з ранніми зусиллями під керівництвом Hye-Shik Chang.

source: PEP 292: Simpler String Substitutions
uk: PEP 292: Простіші заміни рядків

source: Some new classes in the standard library provide an alternative mechanism for substituting variables into strings; this style of substitution may be better for applications where untrained users need to edit templates.
uk: Деякі нові класи в стандартній бібліотеці забезпечують альтернативний механізм для підстановки змінних у рядки; цей стиль заміни може бути кращим для додатків, де ненавченим користувачам потрібно редагувати шаблони.

source: The usual way of substituting variables by name is the ``%`` operator::
uk: Звичайним способом заміни змінних за іменем є оператор ``%``::

source: When writing the template string, it can be easy to forget the ``i`` or ``s`` after the closing parenthesis. This isn't a big problem if the template is in a Python module, because you run the code, get an "Unsupported format character" :exc:`ValueError`, and fix the problem. However, consider an application such as Mailman where template strings or translations are being edited by users who aren't aware of the Python language. The format string's syntax is complicated to explain to such users, and if they make a mistake, it's difficult to provide helpful feedback to them.
uk: Під час написання рядка шаблону може бути легко забути ``i`` або ``s`` після закриваючої дужки. Це не є великою проблемою, якщо шаблон міститься в модулі Python, тому що ви запускаєте код, отримуєте "Символ непідтримуваного формату" :exc:`ValueError` і вирішуєте проблему. Однак розгляньте такий додаток, як Mailman, у якому рядки шаблону або переклади редагуються користувачами, які не знають мови Python. Синтаксис форматного рядка складно пояснити таким користувачам, і якщо вони роблять помилку, їм важко надати корисний відгук.

source: PEP 292 adds a :class:`Template` class to the :mod:`string` module that uses ``$`` to indicate a substitution::
uk: PEP 292 додає клас :class:`Template` до модуля :mod:`string`, який використовує ``$`` для позначення заміни::

source: If a key is missing from the dictionary, the :meth:`substitute` method will raise a :exc:`KeyError`. There's also a :meth:`safe_substitute` method that ignores missing keys::
uk: Якщо в словнику відсутній ключ, метод :meth:`substitute` викличе :exc:`KeyError`. Існує також метод :meth:`safe_substitute`, який ігнорує відсутні ключі::

source: :pep:`292` - Simpler String Substitutions
uk: :pep:`292` - Простіші підстановки рядків

source: Written and implemented by Barry Warsaw.
uk: Написав і реалізував Баррі Варшау.

source: PEP 318: Decorators for Functions and Methods
uk: PEP 318: Декоратори для функцій і методів

source: Python 2.2 extended Python's object model by adding static methods and class methods, but it didn't extend Python's syntax to provide any new way of defining static or class methods. Instead, you had to write a :keyword:`def` statement in the usual way, and pass the resulting method to a :func:`staticmethod` or :func:`classmethod` function that would wrap up the function as a method of the new type. Your code would look like this::
uk: Python 2.2 розширив об’єктну модель Python, додавши статичні методи та методи класу, але не розширив синтаксис Python, щоб надати новий спосіб визначення статичних методів або методів класу. Замість цього вам потрібно було написати оператор :keyword:`def` у звичайний спосіб і передати отриманий метод у функцію :func:`staticmethod` або :func:`classmethod`, яка завершувала б функцію як метод новий тип. Ваш код виглядатиме так::

source: If the method was very long, it would be easy to miss or forget the :func:`classmethod` invocation after the function body.
uk: Якби метод був дуже довгим, було б легко пропустити або забути виклик :func:`classmethod` після тіла функції.

source: The intention was always to add some syntax to make such definitions more readable, but at the time of 2.2's release a good syntax was not obvious. Today a good syntax *still* isn't obvious but users are asking for easier access to the feature; a new syntactic feature has been added to meet this need.
uk: Намір завжди полягав у тому, щоб додати певний синтаксис, щоб зробити такі визначення більш читабельними, але на момент випуску версії 2.2 хороший синтаксис не був очевидним. Сьогодні хороший синтаксис *все ще* неочевидний, але користувачі просять полегшити доступ до функції; для задоволення цієї потреби додано нову синтаксичну функцію.

source: The new feature is called "function decorators". The name comes from the idea that :func:`classmethod`, :func:`staticmethod`, and friends are storing additional information on a function object; they're *decorating* functions with more details.
uk: Нова функція називається "декоратори функцій". Назва походить від ідеї, що :func:`classmethod`, :func:`staticmethod` та друзі зберігають додаткову інформацію про об’єкт функції; вони *прикрашають* функції більшою кількістю деталей.

source: The notation borrows from Java and uses the ``'@'`` character as an indicator. Using the new syntax, the example above would be written::
uk: Позначення запозичено з Java і використовує символ ``'@'`` як індикатор. Використовуючи новий синтаксис, приклад вище буде написаний::

source: The ``@classmethod`` is shorthand for the ``meth=classmethod(meth)`` assignment. More generally, if you have the following::
uk: ``@classmethod`` є скороченням для ``meth=classmethod(meth)`` призначення. Загалом, якщо у вас є:

source: It's equivalent to the following pre-decorator code::
uk: Це еквівалентно такому попередньому коду декоратора::

source: Decorators must come on the line before a function definition, one decorator per line, and can't be on the same line as the def statement, meaning that ``@A def f(): ...`` is illegal. You can only decorate function definitions, either at the module level or inside a class; you can't decorate class definitions.
uk: Декоратори мають бути в рядку перед визначенням функції, по одному декоратору на рядок, і не можуть бути в одному рядку з інструкцією def, тобто ``@A def f(): ...`` є незаконним. Ви можете лише прикрашати визначення функцій на рівні модуля або всередині класу; ви не можете прикрасити визначення класу.

source: A decorator is just a function that takes the function to be decorated as an argument and returns either the same function or some new object. The return value of the decorator need not be callable (though it typically is), unless further decorators will be applied to the result. It's easy to write your own decorators. The following simple example just sets an attribute on the function object::
uk: Декоратор — це лише функція, яка приймає декоровану функцію як аргумент і повертає або ту саму функцію, або новий об’єкт. Значення, що повертається декоратором, не повинно бути викликаним (хоча зазвичай це так), якщо до результату не будуть застосовані інші декоратори. Легко написати власні декоратори. Наступний простий приклад просто встановлює атрибут для об’єкта функції::

source: As a slightly more realistic example, the following decorator checks that the supplied argument is an integer::
uk: Як трохи більш реалістичний приклад, наступний декоратор перевіряє, що наданий аргумент є цілим числом:

source: An example in :pep:`318` contains a fancier version of this idea that lets you both specify the required type and check the returned type.
uk: Приклад у :pep:`318` містить моднішу версію цієї ідеї, яка дозволяє як вказати необхідний тип, так і перевірити повернутий тип.

source: Decorator functions can take arguments. If arguments are supplied, your decorator function is called with only those arguments and must return a new decorator function; this function must take a single function and return a function, as previously described. In other words, ``@A @B @C(args)`` becomes::
uk: Функції-декоратори можуть приймати аргументи. Якщо надано аргументи, ваша функція-декоратор викликається лише з цими аргументами та має повернути нову функцію-декоратор; ця функція повинна приймати одну функцію та повертати функцію, як описано раніше. Іншими словами, ``@A @B @C(args)`` стає:

source: Getting this right can be slightly brain-bending, but it's not too difficult.
uk: Зробити це правильно може трохи заморочити мозок, але це не надто складно.

source: :pep:`318` - Decorators for Functions, Methods and Classes
uk: :pep:`318` - Декоратори для функцій, методів і класів

source: Written by Kevin D. Smith, Jim Jewett, and Skip Montanaro. Several people wrote patches implementing function decorators, but the one that was actually checked in was patch #979728, written by Mark Russell.
uk: Автори: Кевін Д. Сміт, Джим Джеветт і Скіп Монтанаро. Кілька людей написали патчі, що реалізують декоратори функцій, але фактично зареєстровано патч №979728, написаний Марком Расселом.

source: This Wiki page contains several examples of decorators.
uk: Ця сторінка Wiki містить кілька прикладів декораторів.

source: PEP 322: Reverse Iteration
uk: PEP 322: Зворотна ітерація

source: A new built-in function, ``reversed(seq)``, takes a sequence and returns an iterator that loops over the elements of the sequence in reverse order. ::
uk: Нова вбудована функція, ``reversed(seq)``, приймає послідовність і повертає ітератор, який перебирає елементи послідовності у зворотному порядку. ::

source: Compared to extended slicing, such as ``range(1,4)[::-1]``, :func:`reversed` is easier to read, runs faster, and uses substantially less memory.
uk: Порівняно з розширеним нарізанням, таким як ``range(1,4)[::-1]``, :func:`reversed` легше читати, працює швидше та використовує значно менше пам’яті.

source: Note that :func:`reversed` only accepts sequences, not arbitrary iterators. If you want to reverse an iterator, first convert it to a list with :func:`list`. ::
uk: Зауважте, що :func:`reversed` приймає лише послідовності, а не довільні ітератори. Якщо ви хочете змінити ітератор, спочатку перетворіть його на список за допомогою :func:`list`. ::

source: :pep:`322` - Reverse Iteration
uk: :pep:`322` - Зворотна ітерація

source: Written and implemented by Raymond Hettinger.
uk: Написаний і реалізований Раймондом Геттінгером.

source: PEP 324: New subprocess Module
uk: PEP 324: Новий модуль підпроцесу

source: *args* is commonly a sequence of strings that will be the arguments to the program executed as the subprocess. (If the *shell* argument is true, *args* can be a string which will then be passed on to the shell for interpretation, just as :func:`os.system` does.)
uk: *args* зазвичай є послідовністю рядків, які будуть аргументами програми, що виконується як підпроцес. (Якщо аргумент *shell* має значення true, *args* може бути рядком, який потім буде передано в оболонку для інтерпретації, як це робить :func:`os.system`.)

source: *stdin*, *stdout*, and *stderr* specify what the subprocess's input, output, and error streams will be. You can provide a file object or a file descriptor, or you can use the constant ``subprocess.PIPE`` to create a pipe between the subprocess and the parent.
uk: *stdin*, *stdout* і *stderr* визначають, якими будуть вхідні, вихідні та помилкові потоки підпроцесу. Ви можете надати файловий об’єкт або дескриптор файлу, або ви можете використовувати константу ``subprocess.PIPE`` для створення каналу між підпроцесом і батьківським процесом.

source: The constructor has a number of handy options:
uk: Конструктор має ряд зручних опцій:

source: *close_fds* requests that all file descriptors be closed before running the subprocess.
uk: *close_fds* просить закрити всі файлові дескриптори перед запуском підпроцесу.

source: *cwd* specifies the working directory in which the subprocess will be executed (defaulting to whatever the parent's working directory is).
uk: *cwd* визначає робочий каталог, у якому виконуватиметься підпроцес (за замовчуванням це будь-який робочий каталог батьківського процесу).

source: *env* is a dictionary specifying environment variables.
uk: *env* — це словник, який визначає змінні середовища.

source: *preexec_fn* is a function that gets called before the child is started.
uk: *preexec_fn* — це функція, яка викликається перед запуском дочірнього елемента.

source: *universal_newlines* opens the child's input and output using Python's :term:`universal newlines` feature.
uk: *universal_newlines* відкриває введення та виведення дочірнього елемента за допомогою функції Python :term:`universal newlines`.

source: Once you've created the :class:`Popen` instance, you can call its :meth:`wait` method to pause until the subprocess has exited, :meth:`poll` to check if it's exited without pausing, or ``communicate(data)`` to send the string *data* to the subprocess's standard input. ``communicate(data)`` then reads any data that the subprocess has sent to its standard output or standard error, returning a tuple ``(stdout_data, stderr_data)``.
uk: Створивши екземпляр :class:`Popen`, ви можете викликати його метод :meth:`wait`, щоб призупинити підпроцес, доки підпроцес не завершить роботу, :meth:`poll`, щоб перевірити, чи він вийшов без паузи, або ``communicate(data)``, щоб надіслати рядок *data* на стандартний вхід підпроцесу. ``communicate(data)`` потім зчитує всі дані, які підпроцес надіслав на свій стандартний вихід або стандартну помилку, повертаючи кортеж ``(stdout_data, stderr_data)``.

source: :func:`call` is a shortcut that passes its arguments along to the :class:`Popen` constructor, waits for the command to complete, and returns the status code of the subprocess. It can serve as a safer analog to :func:`os.system`::
uk: :func:`call` — це ярлик, який передає свої аргументи конструктору :class:`Popen`, очікує на завершення команди та повертає код статусу підпроцесу. Він може служити безпечнішим аналогом :func:`os.system`::

source: The command is invoked without use of the shell. If you really do want to use the shell, you can add ``shell=True`` as a keyword argument and provide a string instead of a sequence::
uk: Команда викликається без використання оболонки. Якщо ви дійсно хочете використовувати оболонку, ви можете додати ``shell=True`` як ключовий аргумент і надати рядок замість послідовності::

source: The PEP takes various examples of shell and Python code and shows how they'd be translated into Python code that uses :mod:`subprocess`. Reading this section of the PEP is highly recommended.
uk: PEP бере різні приклади оболонки та коду Python і показує, як вони можуть бути переведені в код Python, який використовує :mod:`subprocess`. Настійно рекомендується прочитати цей розділ PEP.

source: :pep:`324` - subprocess - New process module
uk: :pep:`324` - підпроцес - Новий модуль процесу

source: Written and implemented by Peter Åstrand, with assistance from Fredrik Lundh and others.
uk: Написано та реалізовано Пітером Естрандом за сприяння Фредріка Лунда та інших.

source: PEP 327: Decimal Data Type
uk: PEP 327: десятковий тип даних

source: Why is Decimal needed?
uk: Навіщо потрібен Decimal?

source: The limitations arise from the representation used for floating-point numbers. FP numbers are made up of three components:
uk: Обмеження виникають через представлення чисел з плаваючою комою. Номери FP складаються з трьох компонентів:

source: The sign, which is positive or negative.
uk: Знак, який є позитивним чи негативним.
