Repository: python/python-docs-uk
Catalog: whatsnew/2_4.po
Languages: uk

source: The mantissa, which is a single-digit binary number followed by a fractional part. For example, ``1.01`` in base-2 notation is ``1 + 0/2 + 1/4``, or 1.25 in decimal notation.
uk: Мантиса, яка є одноцифровим двійковим числом, після якого йде дробова частина. Наприклад, "1,01" у нотації з основою 2 — це "1 + 0/2 + 1/4" або 1,25 у десятковій системі числення.

source: The exponent, which tells where the decimal point is located in the number represented.
uk: Експонента, яка вказує, де в представленому числі розташована кома.

source: For example, the number 1.25 has positive sign, a mantissa value of 1.01 (in binary), and an exponent of 0 (the decimal point doesn't need to be shifted). The number 5 has the same sign and mantissa, but the exponent is 2 because the mantissa is multiplied by 4 (2 to the power of the exponent 2); 1.25 \* 4 equals 5.
uk: Наприклад, число 1,25 має додатний знак, значення мантиси 1,01 (у двійковій системі) і експоненту 0 (десяткову кому не потрібно зміщувати). Число 5 має той самий знак і мантису, але показник степеня дорівнює 2, оскільки мантиса множиться на 4 (2 у ступені степеня 2); 1,25 \* 4 дорівнює 5.

source: Sometimes you can see this inaccuracy when the number is printed::
uk: Іноді ви можете побачити цю неточність, коли надруковано номер:

source: The inaccuracy isn't always visible when you print the number because the FP-to-decimal-string conversion is provided by the C library, and most C libraries try to produce sensible output. Even if it's not displayed, however, the inaccuracy is still there and subsequent operations can magnify the error.
uk: Неточність не завжди помітна, коли ви друкуєте число, тому що перетворення FP-рядка в десятковий рядок забезпечується бібліотекою C, і більшість бібліотек C намагаються створити розумний результат. Однак навіть якщо вона не відображається, неточність все одно існує, і наступні операції можуть збільшити помилку.

source: For many applications this doesn't matter. If I'm plotting points and displaying them on my monitor, the difference between 1.1 and 1.1000000000000001 is too small to be visible. Reports often limit output to a certain number of decimal places, and if you round the number to two or three or even eight decimal places, the error is never apparent. However, for applications where it does matter, it's a lot of work to implement your own custom arithmetic routines.
uk: Для багатьох програм це не має значення. Якщо я малюю точки та відображаю їх на моніторі, різниця між 1,1 і 1,1000000000000001 надто мала, щоб її було видно. Звіти часто обмежують виведення певною кількістю знаків після коми, і якщо округлити число до двох, трьох або навіть восьми знаків після коми, помилка ніколи не буде очевидною. Однак для додатків, де це має значення, реалізація власних користувацьких арифметичних процедур вимагає багато роботи.

source: Hence, the :class:`Decimal` type was created.
uk: Таким чином, був створений тип :class:`Decimal`.

source: The :class:`Decimal` type
uk: Тип :class:`Decimal`

source: A new module, :mod:`decimal`, was added to Python's standard library. It contains two classes, :class:`Decimal` and :class:`Context`. :class:`Decimal` instances represent numbers, and :class:`Context` instances are used to wrap up various settings such as the precision and default rounding mode.
uk: Новий модуль, :mod:`decimal`, було додано до стандартної бібліотеки Python. Він містить два класи, :class:`Decimal` і :class:`Context`. Екземпляри :class:`Decimal` представляють числа, а екземпляри :class:`Context` використовуються для завершення різних налаштувань, таких як точність і режим округлення за замовчуванням.

source: :class:`Decimal` instances are immutable, like regular Python integers and FP numbers; once it's been created, you can't change the value an instance represents. :class:`Decimal` instances can be created from integers or strings::
uk: :class:`Decimal` екземпляри незмінні, як і звичайні цілі числа Python і числа FP; після того, як його було створено, ви не можете змінити значення, яке представляє екземпляр. :class:`Decimal` екземпляри можна створити з цілих чисел або рядків::

source: You can also provide tuples containing the sign, the mantissa represented as a tuple of decimal digits, and the exponent::
uk: Ви також можете надати кортежі, що містять знак, мантису, представлену як кортеж десяткових цифр, і експоненту:

source: Cautionary note: the sign bit is a Boolean value, so 0 is positive and 1 is negative.
uk: Застереження: знаковий біт є логічним значенням, тому 0 є позитивним, а 1 – негативним.

source: Converting from floating-point numbers poses a bit of a problem: should the FP number representing 1.1 turn into the decimal number for exactly 1.1, or for 1.1 plus whatever inaccuracies are introduced? The decision was to dodge the issue and leave such a conversion out of the API. Instead, you should convert the floating-point number into a string using the desired precision and pass the string to the :class:`Decimal` constructor::
uk: Перетворення чисел із плаваючою комою створює певну проблему: чи число FP, що представляє 1,1, має перетворитися на десяткове число для точного 1,1 чи для 1,1 плюс будь-які неточності, які вводяться? Рішення полягало в тому, щоб уникнути проблеми та залишити таке перетворення поза API. Натомість вам слід перетворити число з плаваючою комою на рядок із потрібною точністю та передати рядок у конструктор :class:`Decimal`::

source: Once you have :class:`Decimal` instances, you can perform the usual mathematical operations on them. One limitation: exponentiation requires an integer exponent::
uk: Коли у вас є екземпляри :class:`Decimal`, ви можете виконувати над ними звичайні математичні операції. Одне обмеження: для піднесення до степеня потрібен цілий показник:

source: You can combine :class:`Decimal` instances with integers, but not with floating-point numbers::
uk: Ви можете комбінувати екземпляри :class:`Decimal` з цілими числами, але не з числами з плаваючою комою::

source: :class:`Decimal` numbers can be used with the :mod:`math` and :mod:`cmath` modules, but note that they'll be immediately converted to floating-point numbers before the operation is performed, resulting in a possible loss of precision and accuracy. You'll also get back a regular floating-point number and not a :class:`Decimal`. ::
uk: :class:`Decimal` числа можна використовувати з модулями :mod:`math` і :mod:`cmath`, але зауважте, що вони будуть негайно перетворені на числа з плаваючою комою перед виконанням операції, що призведе до можлива втрата точності та акуратності. Ви також отримаєте звичайне число з плаваючою комою, а не :class:`Decimal`. ::

source: :class:`Decimal` instances have a :meth:`sqrt` method that returns a :class:`Decimal`, but if you need other things such as trigonometric functions you'll have to implement them. ::
uk: Екземпляри :class:`Decimal` мають метод :meth:`sqrt`, який повертає :class:`Decimal`, але якщо вам потрібні інші речі, такі як тригонометричні функції, вам доведеться їх реалізувати. ::

source: The :class:`Context` type
uk: Тип :class:`Context`

source: Instances of the :class:`Context` class encapsulate several settings for decimal operations:
uk: Екземпляри класу :class:`Context` інкапсулюють кілька параметрів для десяткових операцій:

source: :attr:`prec` is the precision, the number of decimal places.
uk: :attr:`prec` — це точність, кількість знаків після коми.

source: :attr:`rounding` specifies the rounding mode. The :mod:`decimal` module has constants for the various possibilities: :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN`, and various others.
uk: :attr:`rounding` вказує режим округлення. Модуль :mod:`decimal` має константи для різних можливостей: :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN` та інші.

source: :attr:`traps` is a dictionary specifying what happens on encountering certain error conditions: either an exception is raised or a value is returned. Some examples of error conditions are division by zero, loss of precision, and overflow.
uk: :attr:`traps` — це словник, який визначає, що відбувається, коли трапляються певні умови помилки: або виникає виняткова ситуація, або повертається значення. Деякі приклади помилок: ділення на нуль, втрата точності та переповнення.

source: There's a thread-local default context available by calling :func:`getcontext`; you can change the properties of this context to alter the default precision, rounding, or trap handling. The following example shows the effect of changing the precision of the default context::
uk: Існує локальний контекст потоку за замовчуванням, доступний за допомогою виклику :func:`getcontext`; ви можете змінити властивості цього контексту, щоб змінити точність за замовчуванням, округлення або обробку перехоплень. У наступному прикладі показано вплив зміни точності контексту за замовчуванням:

source: The default action for error conditions is selectable; the module can either return a special value such as infinity or not-a-number, or exceptions can be raised::
uk: Дію за умовчанням для умов помилки можна вибрати; модуль може або повертати спеціальне значення, наприклад нескінченність або не-число, або можуть бути викликані винятки::

source: The :class:`Context` instance also has various methods for formatting numbers such as :meth:`to_eng_string` and :meth:`to_sci_string`.
uk: Екземпляр :class:`Context` також має різні методи форматування чисел, наприклад :meth:`to_eng_string` і :meth:`to_sci_string`.

source: For more information, see the documentation for the :mod:`decimal` module, which includes a quick-start tutorial and a reference.
uk: Для отримання додаткової інформації перегляньте документацію до модуля :mod:`decimal`, яка містить короткий посібник і довідку.

source: :pep:`327` - Decimal Data Type
uk: :pep:`327` - десятковий тип даних

source: Written by Facundo Batista and implemented by Facundo Batista, Eric Price, Raymond Hettinger, Aahz, and Tim Peters.
uk: Написаний Факундо Батістою та реалізований Факундо Батістою, Еріком Прайсом, Реймондом Геттінгером, Аазом і Тімом Пітерсом.

source: The article uses Fortran code to illustrate many of the problems that floating-point inaccuracy can cause.
uk: У статті використовується код Fortran, щоб проілюструвати багато проблем, до яких може призвести неточність числа з плаваючою комою.

source: A description of a decimal-based representation. This representation is being proposed as a standard, and underlies the new Python decimal type. Much of this material was written by Mike Cowlishaw, designer of the Rexx language.
uk: Опис десяткового представлення. Це представлення пропонується як стандарт і лежить в основі нового десяткового типу Python. Значну частину цього матеріалу написав Майк Коулішоу, розробник мови Rexx.

source: PEP 328: Multi-line Imports
uk: PEP 328: Багаторядковий імпорт

source: One language change is a small syntactic tweak aimed at making it easier to import many names from a module. In a ``from module import names`` statement, *names* is a sequence of names separated by commas. If the sequence is very long, you can either write multiple imports from the same module, or you can use backslashes to escape the line endings like this::
uk: Одна зміна мови — це невелике синтаксичне налаштування, спрямоване на полегшення імпорту багатьох імен із модуля. У операторі ``from module import names`` *names* — це послідовність імен, розділених комами. Якщо послідовність дуже довга, ви можете або написати кілька імпортів з одного модуля, або ви можете використовувати зворотні похилі риски, щоб уникнути закінчення рядків, як це::

source: The syntactic change in Python 2.4 simply allows putting the names within parentheses. Python ignores newlines within a parenthesized expression, so the backslashes are no longer needed::
uk: Синтаксичні зміни в Python 2.4 просто дозволяють поміщати імена в дужки. Python ігнорує нові рядки у виразі в дужках, тому зворотна похила риска більше не потрібна::

source: The PEP also proposes that all :keyword:`import` statements be absolute imports, with a leading ``.`` character to indicate a relative import. This part of the PEP was not implemented for Python 2.4, but was completed for Python 2.5.
uk: PEP також пропонує, щоб усі оператори :keyword:`import` були абсолютними імпортами, із символом ``.`` на початку, який вказує на відносний імпорт. Ця частина PEP не була реалізована для Python 2.4, але була завершена для Python 2.5.

source: :pep:`328` - Imports: Multi-Line and Absolute/Relative
uk: :pep:`328` - Імпорт: багаторядковий і абсолютний/відносний

source: Written by Aahz. Multi-line imports were implemented by Dima Dorfman.
uk: Написав Ааз. Багаторядковий імпорт реалізував Діма Дорфман.

source: PEP 331: Locale-Independent Float/String Conversions
uk: PEP 331: Незалежне від мови перетворення Float/String

source: The :mod:`locale` modules lets Python software select various conversions and display conventions that are localized to a particular country or language. However, the module was careful to not change the numeric locale because various functions in Python's implementation required that the numeric locale remain set to the ``'C'`` locale. Often this was because the code was using the C library's :c:func:`atof` function.
uk: Модулі :mod:`locale` дозволяють програмному забезпеченню Python вибирати різні перетворення та відображати конвенції, які локалізовані для певної країни чи мови. Однак модуль був обережним, щоб не змінити числову локаль, оскільки різні функції в реалізації Python вимагали, щоб числова локаль залишалася встановленою на ``'C''`` локалі. Часто це було тому, що код використовував функцію :c:func:`atof` бібліотеки C.

source: Not setting the numeric locale caused trouble for extensions that used third-party C libraries, however, because they wouldn't have the correct locale set. The motivating example was GTK+, whose user interface widgets weren't displaying numbers in the current locale.
uk: Однак відсутність числової локалі спричиняла проблеми для розширень, які використовували сторонні бібліотеки C, оскільки вони не мали правильного налаштування локалі. Мотивуючим прикладом був GTK+, віджети інтерфейсу користувача якого не відображали числа в поточній локалі.

source: The solution described in the PEP is to add three new functions to the Python API that perform ASCII-only conversions, ignoring the locale setting:
uk: Рішення, описане в PEP, полягає в додаванні трьох нових функцій до API Python, які виконують перетворення лише ASCII, ігноруючи налаштування мови:

source: :pep:`331` - Locale-Independent Float/String Conversions
uk: :pep:`331` - Незалежне від мови перетворення Float/String

source: Written by Christian R. Reis, and implemented by Gustavo Carneiro.
uk: Написаний Крістіаном Р. Рейсом, реалізований Густаво Карнейро.

source: Other Language Changes
uk: Інші зміни мови

source: Here are all of the changes that Python 2.4 makes to the core Python language.
uk: Ось усі зміни, які Python 2.4 вносить у основну мову Python.

source: Decorators for functions and methods were added (:pep:`318`).
uk: Додано декоратори для функцій і методів (:pep:`318`).

source: Built-in :func:`set` and :func:`frozenset` types were added (:pep:`218`). Other new built-ins include the ``reversed(seq)`` function (:pep:`322`).
uk: Додано вбудовані типи :func:`set` і :func:`frozenset` (:pep:`218`). Інші нові вбудовані функції включають функцію ``reversed(seq)`` (:pep:`322`).

source: Generator expressions were added (:pep:`289`).
uk: Додано генератор виразів (:pep:`289`).

source: Certain numeric expressions no longer return values restricted to 32 or 64 bits (:pep:`237`).
uk: Деякі числові вирази більше не повертають значення, обмежені 32 або 64 бітами (:pep:`237`).

source: You can now put parentheses around the list of names in a ``from module import names`` statement (:pep:`328`).
uk: Тепер ви можете взяти дужки навколо списку імен у операторі ``from module import names`` (:pep:`328`).

source: The :meth:`dict.update` method now accepts the same argument forms as the :class:`dict` constructor. This includes any mapping, any iterable of key/value pairs, and keyword arguments. (Contributed by Raymond Hettinger.)
uk: Метод :meth:`dict.update` тепер приймає ті самі форми аргументів, що й конструктор :class:`dict`. Це включає будь-яке відображення, будь-яке повторення пар ключ/значення та аргументи ключового слова. (Надав Реймонд Геттінгер.)

source: The string methods :meth:`ljust`, :meth:`rjust`, and :meth:`center` now take an optional argument for specifying a fill character other than a space. (Contributed by Raymond Hettinger.)
uk: Рядкові методи :meth:`ljust`, :meth:`rjust` і :meth:`center` тепер приймають необов’язковий аргумент для визначення символу заповнення, відмінного від пробілу. (Надав Реймонд Геттінгер.)

source: Strings also gained an :meth:`rsplit` method that works like the :meth:`split` method but splits from the end of the string. (Contributed by Sean Reifschneider.) ::
uk: Рядки також отримали метод :meth:`rsplit`, який працює як метод :meth:`split`, але розділяється з кінця рядка. (Надав Шон Райфшнайдер.) ::

source: Three keyword parameters, *cmp*, *key*, and *reverse*, were added to the :meth:`sort` method of lists. These parameters make some common usages of :meth:`sort` simpler. All of these parameters are optional.
uk: Три параметри ключових слів, *cmp*, *key* і *reverse*, було додано до методу :meth:`sort` списків. Ці параметри спрощують деякі типові використання :meth:`sort`. Усі ці параметри є необов’язковими.

source: For the *cmp* parameter, the value should be a comparison function that takes two parameters and returns -1, 0, or +1 depending on how the parameters compare. This function will then be used to sort the list. Previously this was the only parameter that could be provided to :meth:`sort`.
uk: Для параметра *cmp* значенням має бути функція порівняння, яка приймає два параметри та повертає -1, 0 або +1 залежно від того, як параметри порівнюються. Потім ця функція буде використана для сортування списку. Раніше це був єдиний параметр, який можна було надати для :meth:`sort`.

source: *key* should be a single-parameter function that takes a list element and returns a comparison key for the element. The list is then sorted using the comparison keys. The following example sorts a list case-insensitively::
uk: *key* має бути функцією з одним параметром, яка приймає елемент списку та повертає ключ порівняння для елемента. Потім список сортується за допомогою ключів порівняння. Наступний приклад сортує список без урахування регістру::

source: The last example, which uses the *cmp* parameter, is the old way to perform a case-insensitive sort. It works but is slower than using a *key* parameter. Using *key* calls :meth:`lower` method once for each element in the list while using *cmp* will call it twice for each comparison, so using *key* saves on invocations of the :meth:`lower` method.
uk: Останній приклад, у якому використовується параметр *cmp*, є старим способом виконання сортування без урахування регістру. Це працює, але повільніше, ніж використання параметра *key*. Використання *key* викликає метод :meth:`lower` один раз для кожного елемента в списку, тоді як використання *cmp* викликає його двічі для кожного порівняння, тому використання *key* економить на викликах методу :meth:`lower`.

source: For simple key functions and comparison functions, it is often possible to avoid a :keyword:`lambda` expression by using an unbound method instead. For example, the above case-insensitive sort is best written as::
uk: Для простих ключових функцій і функцій порівняння часто можна уникнути виразу :keyword:`lambda`, використовуючи натомість незв’язаний метод. Наприклад, наведене вище сортування без урахування регістру найкраще записати як::

source: Finally, the *reverse* parameter takes a Boolean value. If the value is true, the list will be sorted into reverse order. Instead of ``L.sort(); L.reverse()``, you can now write ``L.sort(reverse=True)``.
uk: Нарешті, параметр *reverse* приймає логічне значення. Якщо значення має значення true, список буде відсортовано у зворотному порядку. Замість ``L.sort(); L.reverse()``, тепер ви можете написати ``L.sort(reverse=True)``.

source: The results of sorting are now guaranteed to be stable. This means that two entries with equal keys will be returned in the same order as they were input. For example, you can sort a list of people by name, and then sort the list by age, resulting in a list sorted by age where people with the same age are in name-sorted order.
uk: Результати сортування тепер гарантовано стабільні. Це означає, що два записи з однаковими ключами буде повернено в тому ж порядку, у якому вони були введені. Наприклад, ви можете відсортувати список людей за іменами, а потім відсортувати список за віком, у результаті чого вийде список, відсортований за віком, де люди одного віку розташовані в порядку за іменами.

source: (All changes to :meth:`sort` contributed by Raymond Hettinger.)
uk: (Усі зміни до :meth:`sort` внесено Раймондом Геттінгером.)

source: There is a new built-in function ``sorted(iterable)`` that works like the in-place :meth:`list.sort` method but can be used in expressions. The differences are:
uk: Існує нова вбудована функція ``sorted(iterable)``, яка працює як метод in-place :meth:`list.sort`, але її можна використовувати у виразах. Відмінності:

source: the input may be any iterable;
uk: вхід може бути будь-яким ітерованим;

source: a newly formed copy is sorted, leaving the original intact; and
uk: новосформовану копію сортують, залишаючи оригінал недоторканим; і

source: the expression returns the new sorted copy
uk: вираз повертає нову відсортовану копію

source: (Contributed by Raymond Hettinger.)
uk: (Надав Реймонд Геттінгер.)

source: Integer operations will no longer trigger an :exc:`OverflowWarning`. The :exc:`OverflowWarning` warning will disappear in Python 2.5.
uk: Цілочисельні операції більше не викликатимуть :exc:`OverflowWarning`. Попередження :exc:`OverflowWarning` зникне в Python 2.5.

source: The interpreter gained a new switch, :option:`-m`, that takes a name, searches for the corresponding module on ``sys.path``, and runs the module as a script. For example, you can now run the Python profiler with ``python -m profile``. (Contributed by Nick Coghlan.)
uk: Інтерпретатор отримав новий перемикач, :option:`-m`, який приймає назву, шукає відповідний модуль у ``sys.path`` і запускає модуль як сценарій. Наприклад, тепер ви можете запустити профайлер Python за допомогою ``python -m profile``. (Надав Нік Коглан.)

source: The ``eval(expr, globals, locals)`` and ``execfile(filename, globals, locals)`` functions and the ``exec`` statement now accept any mapping type for the *locals* parameter. Previously this had to be a regular Python dictionary. (Contributed by Raymond Hettinger.)
uk: Функції ``eval(expr, globals, locals)`` і ``execfile(filename, globals, locals)`` і оператор ``exec`` тепер приймають будь-який тип зіставлення для параметра *locals*. Раніше це мав бути звичайний словник Python. (Надав Реймонд Геттінгер.)

source: The :func:`zip` built-in function and :func:`itertools.izip` now return an empty list if called with no arguments. Previously they raised a :exc:`TypeError` exception. This makes them more suitable for use with variable length argument lists::
uk: Вбудована функція :func:`zip` і :func:`itertools.izip` тепер повертають порожній список, якщо викликаються без аргументів. Раніше вони викликали виняток :exc:`TypeError`. Це робить їх більш придатними для використання зі списками аргументів змінної довжини:
