Repository: python/python-docs-uk
Catalog: whatsnew/3.0.po
Languages: uk

source: What's New In Python 3.0
uk: Що нового в Python 3.0

source: Author
uk: Автор

source: This article explains the new features in Python 3.0, compared to 2.6. Python 3.0, also known as "Python 3000" or "Py3K", is the first ever *intentionally backwards incompatible* Python release. Python 3.0 was released on December 3, 2008. There are more changes than in a typical release, and more that are important for all Python users. Nevertheless, after digesting the changes, you'll find that Python really hasn't changed all that much -- by and large, we're mostly fixing well-known annoyances and warts, and removing a lot of old cruft.
uk: У цій статті пояснюється нові функції в Python 3.0 порівняно з 2.6. Python 3.0, також відомий як "Python 3000" або "Py3K", є першим випуском Python *навмисно зворотно несумісним*. Python 3.0 було випущено 3 грудня 2008 року. Є більше змін, ніж у типовому випуску, і більше, що є важливим для всіх користувачів Python. Проте, проаналізувавши зміни, ви побачите, що Python справді не дуже змінився — загалом, ми здебільшого виправляємо добре відомі недоліки та бородавки, а також видаляємо багато старих недоліків.

source: This article doesn't attempt to provide a complete specification of all new features, but instead tries to give a convenient overview. For full details, you should refer to the documentation for Python 3.0, and/or the many PEPs referenced in the text. If you want to understand the complete implementation and design rationale for a particular feature, PEPs usually have more details than the regular documentation; but note that PEPs usually are not kept up-to-date once a feature has been fully implemented.
uk: Ця стаття не намагається надати повну специфікацію всіх нових функцій, а натомість намагається дати зручний огляд. Щоб отримати повну інформацію, зверніться до документації для Python 3.0 та/або багатьох PEP, на які посилаються в тексті. Якщо ви хочете зрозуміти повну реалізацію та обґрунтування розробки певної функції, PEP зазвичай містять більше деталей, ніж звичайна документація; але зауважте, що PEP зазвичай не оновлюються після повного впровадження функції.

source: Due to time constraints this document is not as complete as it should have been. As always for a new release, the ``Misc/NEWS`` file in the source distribution contains a wealth of detailed information about every small thing that was changed.
uk: Через обмеження часу цей документ не такий повний, як мав би бути. Як завжди для нових випусків, файл ``Misc/NEWS`` у вихідному дистрибутиві містить велику кількість детальної інформації про кожну дрібницю, яку було змінено.

source: Common Stumbling Blocks
uk: Поширені камені спотикання

source: This section lists those few changes that are most likely to trip you up if you're used to Python 2.5.
uk: У цьому розділі перераховано ті кілька змін, які, швидше за все, вас збентежать, якщо ви звикли до Python 2.5.

source: Print Is A Function
uk: Друк — це функція

source: The ``print`` statement has been replaced with a :func:`print` function, with keyword arguments to replace most of the special syntax of the old ``print`` statement (:pep:`3105`). Examples::
uk: Інструкцію ``print`` було замінено функцією :func:`print` із ключовими аргументами для заміни більшості спеціального синтаксису старого ``інструкції ``print`` (:pep:`3105`). Приклади::

source: You can also customize the separator between items, e.g.::
uk: Ви також можете налаштувати роздільник між елементами, наприклад::

source: which produces:
uk: який виробляє:

source: Note:
uk: Примітка:

source: The :func:`print` function doesn't support the "softspace" feature of the old ``print`` statement. For example, in Python 2.x, ``print "A\n", "B"`` would write ``"A\nB\n"``; but in Python 3.0, ``print("A\n", "B")`` writes ``"A\n B\n"``.
uk: Функція :func:`print` не підтримує функцію "softspace" старого оператора ``print``. Наприклад, у Python 2.x ``print "A\n", "B"`` буде писати ``"A\nB\n"``; але в Python 3.0 ``print("A\n", "B")`` пише ``"A\n B\n"``.

source: Initially, you'll be finding yourself typing the old ``print x`` a lot in interactive mode. Time to retrain your fingers to type ``print(x)`` instead!
uk: Спочатку вам доведеться часто в інтерактивному режимі вводити старий ``print x``. Час перенавчити свої пальці вводити ``print(x)`` замість цього!

source: When using the ``2to3`` source-to-source conversion tool, all ``print`` statements are automatically converted to :func:`print` function calls, so this is mostly a non-issue for larger projects.
uk: Під час використання інструменту перетворення джерела в джерело ``2to3`` усі оператори ``print`` автоматично перетворюються на виклики функцій :func:`print`, тому це здебільшого не є проблемою для великих проектів.

source: Views And Iterators Instead Of Lists
uk: Перегляди та ітератори замість списків

source: Some well-known APIs no longer return lists:
uk: Деякі відомі API більше не повертають списки:

source: :class:`dict` methods :meth:`dict.keys`, :meth:`dict.items` and :meth:`dict.values` return "views" instead of lists. For example, this no longer works: ``k = d.keys(); k.sort()``. Use ``k = sorted(d)`` instead (this works in Python 2.5 too and is just as efficient).
uk: Методи :class:`dict` :meth:`dict.keys`, :meth:`dict.items` і :meth:`dict.values` повертають "перегляди" замість списків. Наприклад, це більше не працює: ``k = d.keys(); k.sort()``. Замість цього використовуйте ``k = sorted(d)`` (це також працює в Python 2.5 і є таким же ефективним).

source: Also, the :meth:`dict.iterkeys`, :meth:`dict.iteritems` and :meth:`dict.itervalues` methods are no longer supported.
uk: Крім того, методи :meth:`dict.iterkeys`, :meth:`dict.iteritems` і :meth:`dict.itervalues` більше не підтримуються.

source: :func:`map` and :func:`filter` return iterators. If you really need a list and the input sequences are all of equal length, a quick fix is to wrap :func:`map` in :func:`list`, e.g. ``list(map(...))``, but a better fix is often to use a list comprehension (especially when the original code uses :keyword:`lambda`), or rewriting the code so it doesn't need a list at all. Particularly tricky is :func:`map` invoked for the side effects of the function; the correct transformation is to use a regular :keyword:`for` loop (since creating a list would just be wasteful).
uk: :func:`map` і :func:`filter` повертають ітератори. Якщо вам справді потрібен список і всі вхідні послідовності мають однакову довжину, швидким виправленням є обернути :func:`map` у :func:`list`, наприклад. ``list(map(...))``, але кращим виправленням часто є використання розуміння списку (особливо, коли вихідний код використовує :keyword:`lambda`), або переписування коду, щоб він не потребував взагалі список. Особливо складним є виклик :func:`map` для побічних ефектів функції; правильним перетворенням є використання звичайного циклу :keyword:`for` (оскільки створення списку буде марнотратним).

source: If the input sequences are not of equal length, :func:`map` will stop at the termination of the shortest of the sequences. For full compatibility with :func:`map` from Python 2.x, also wrap the sequences in :func:`itertools.zip_longest`, e.g. ``map(func, *sequences)`` becomes ``list(map(func, itertools.zip_longest(*sequences)))``.
uk: Якщо вхідні послідовності не мають однакову довжину, :func:`map` зупиниться на кінці найкоротшої послідовності. Для повної сумісності з :func:`map` з Python 2.x також оберніть послідовності в :func:`itertools.zip_longest`, наприклад. ``map(func, *sequences)`` стає ``list(map(func, itertools.zip_longest(*sequences)))``.

source: :func:`range` now behaves like :func:`xrange` used to behave, except it works with values of arbitrary size. The latter no longer exists.
uk: :func:`range` тепер поводиться як :func:`xrange`, за винятком того, що він працює зі значеннями довільного розміру. Останнього вже не існує.

source: :func:`zip` now returns an iterator.
uk: :func:`zip` тепер повертає ітератор.

source: Ordering Comparisons
uk: Упорядкування порівнянь

source: Python 3.0 has simplified the rules for ordering comparisons:
uk: Python 3.0 спростив правила впорядкування порівнянь:

source: The ordering comparison operators (``<``, ``<=``, ``>=``, ``>``) raise a TypeError exception when the operands don't have a meaningful natural ordering. Thus, expressions like ``1 < ''``, ``0 > None`` or ``len <= len`` are no longer valid, and e.g. ``None < None`` raises :exc:`TypeError` instead of returning ``False``. A corollary is that sorting a heterogeneous list no longer makes sense -- all the elements must be comparable to each other. Note that this does not apply to the ``==`` and ``!=`` operators: objects of different incomparable types always compare unequal to each other.
uk: Оператори порівняння порядку (``<``, ``<=``, ``> =``, ``>``) викликають виняток TypeError, коли операнди не мають значущого природного порядку. Таким чином, такі вирази, як ``1 < ''``, ``0 > None`` або ``len <= len`` більше не є дійсними, і, наприклад, ``None < None`` викликає :exc:`TypeError` замість повернення ``False``. Як наслідок, сортування гетерогенного списку більше не має сенсу — усі елементи мають бути порівнюваними між собою. Зауважте, що це не стосується операторів ``==`` і ``!=``: об’єкти різних непорівнюваних типів завжди порівнюються нерівномірно.

source: :meth:`builtin.sorted` and :meth:`list.sort` no longer accept the *cmp* argument providing a comparison function. Use the *key* argument instead. N.B. the *key* and *reverse* arguments are now "keyword-only".
uk: :meth:`builtin.sorted` і :meth:`list.sort` більше не приймають аргумент *cmp*, що забезпечує функцію порівняння. Замість цього використовуйте аргумент *key*. N.B. аргументи *key* і *reverse* тепер є "лише ключовими словами".

source: The :func:`cmp` function should be treated as gone, and the :meth:`__cmp__` special method is no longer supported. Use :meth:`__lt__` for sorting, :meth:`__eq__` with :meth:`__hash__`, and other rich comparisons as needed. (If you really need the :func:`cmp` functionality, you could use the expression ``(a > b) - (a < b)`` as the equivalent for ``cmp(a, b)``.)
uk: Функцію :func:`cmp` слід розглядати як зниклу, а спеціальний метод :meth:`__cmp__` більше не підтримується. Використовуйте :meth:`__lt__` для сортування, :meth:`__eq__` з :meth:`__hash__` та інші детальні порівняння за потреби. (Якщо вам справді потрібна функція :func:`cmp`, ви можете використати вираз ``(a > b) - (a < b)`` як еквівалент ``cmp(a, b)``.)

source: Integers
uk: Цілі числа

source: :pep:`237`: Essentially, :class:`long` renamed to :class:`int`. That is, there is only one built-in integral type, named :class:`int`; but it behaves mostly like the old :class:`long` type.
uk: :pep:`237`: По суті, :class:`long` перейменовано на :class:`int`. Тобто, існує лише один вбудований інтегральний тип з назвою :class:`int`; але він поводиться здебільшого як старий тип :class:`long`.

source: :pep:`238`: An expression like ``1/2`` returns a float. Use ``1//2`` to get the truncating behavior. (The latter syntax has existed for years, at least since Python 2.2.)
uk: :pep:`238`: Вираз на кшталт ``1/2`` повертає число з плаваючою точкою. Використовуйте ``1//2``, щоб отримати режим скорочення. (Останній синтаксис існував роками, принаймні з Python 2.2.)

source: The :data:`sys.maxint` constant was removed, since there is no longer a limit to the value of integers. However, :data:`sys.maxsize` can be used as an integer larger than any practical list or string index. It conforms to the implementation's "natural" integer size and is typically the same as :data:`sys.maxint` in previous releases on the same platform (assuming the same build options).
uk: Константу :data:`sys.maxint` було видалено, оскільки більше немає обмежень на значення цілих чисел. Однак :data:`sys.maxsize` можна використовувати як ціле число, більше за будь-який практичний список або рядковий індекс. Він відповідає "природному" цілочисельному розміру реалізації та зазвичай такий самий, як :data:`sys.maxint` у попередніх випусках на тій самій платформі (припускаючи ті самі параметри збірки).

source: The :func:`repr` of a long integer doesn't include the trailing ``L`` anymore, so code that unconditionally strips that character will chop off the last digit instead. (Use :func:`str` instead.)
uk: :func:`repr` довгого цілого числа більше не включає завершальний ``L``, тому код, який беззастережно видаляє цей символ, замість цього відсікає останню цифру. (Натомість використовуйте :func:`str`.)

source: Octal literals are no longer of the form ``0720``; use ``0o720`` instead.
uk: Вісімкові літерали більше не мають форми ``0720``; замість цього використовуйте ``0o720``.

source: Text Vs. Data Instead Of Unicode Vs. 8-bit
uk: Текст Vs. Дані замість Unicode Vs. 8-бітний

source: Everything you thought you knew about binary data and Unicode has changed.
uk: Усе, що ви думали знати про двійкові дані та Юнікод, змінилося.

source: Python 3.0 uses the concepts of *text* and (binary) *data* instead of Unicode strings and 8-bit strings. All text is Unicode; however *encoded* Unicode is represented as binary data. The type used to hold text is :class:`str`, the type used to hold data is :class:`bytes`. The biggest difference with the 2.x situation is that any attempt to mix text and data in Python 3.0 raises :exc:`TypeError`, whereas if you were to mix Unicode and 8-bit strings in Python 2.x, it would work if the 8-bit string happened to contain only 7-bit (ASCII) bytes, but you would get :exc:`UnicodeDecodeError` if it contained non-ASCII values. This value-specific behavior has caused numerous sad faces over the years.
uk: Python 3.0 використовує поняття *текст* і (двійкові) *дані* замість рядків Unicode і 8-бітних рядків. Весь текст є Unicode; однак *закодований* Unicode представлений як двійкові дані. Для зберігання тексту використовується тип :class:`str`, а для зберігання даних — :class:`bytes`. Найбільша відмінність із ситуацією 2.x полягає в тому, що будь-яка спроба змішати текст і дані в Python 3.0 викликає :exc:`TypeError`, тоді як якби ви змішали Unicode та 8-бітні рядки в Python 2.x, це спрацювало б якщо 8-бітний рядок містив лише 7-бітні (ASCII) байти, але ви отримаєте :exc:`UnicodeDecodeError`, якщо він містив значення, відмінні від ASCII. Ця ціннісна поведінка викликала багато сумних облич протягом багатьох років.

source: As a consequence of this change in philosophy, pretty much all code that uses Unicode, encodings or binary data most likely has to change. The change is for the better, as in the 2.x world there were numerous bugs having to do with mixing encoded and unencoded text. To be prepared in Python 2.x, start using :class:`unicode` for all unencoded text, and :class:`str` for binary or encoded data only. Then the ``2to3`` tool will do most of the work for you.
uk: Як наслідок цієї зміни у філософії, майже весь код, який використовує Unicode, кодування або двійкові дані, швидше за все, має змінитися. Зміна на краще, оскільки у світі 2.x було багато помилок, пов’язаних зі змішуванням кодованого та незакодованого тексту. Щоб підготуватися до Python 2.x, почніть використовувати :class:`unicode` для всього незакодованого тексту та :class:`str` лише для двійкових або закодованих даних. Тоді інструмент ``2to3`` зробить більшу частину роботи за вас.

source: You can no longer use ``u"..."`` literals for Unicode text. However, you must use ``b"..."`` literals for binary data.
uk: Ви більше не можете використовувати літерали ``u"..."`` для тексту Unicode. Однак ви повинні використовувати літерали ``b"..."`` для двійкових даних.

source: As the :class:`str` and :class:`bytes` types cannot be mixed, you must always explicitly convert between them. Use :meth:`str.encode` to go from :class:`str` to :class:`bytes`, and :meth:`bytes.decode` to go from :class:`bytes` to :class:`str`. You can also use ``bytes(s, encoding=...)`` and ``str(b, encoding=...)``, respectively.
uk: Оскільки типи :class:`str` і :class:`bytes` не можна змішувати, ви завжди повинні явно конвертувати між ними. Використовуйте :meth:`str.encode` для переходу від :class:`str` до :class:`bytes` і :meth:`bytes.decode` для переходу від :class:`bytes` до :class:`str`. Ви також можете використовувати ``bytes(s, encoding=...)`` та ``str(b, encoding=...)`` відповідно.

source: Like :class:`str`, the :class:`bytes` type is immutable. There is a separate *mutable* type to hold buffered binary data, :class:`bytearray`. Nearly all APIs that accept :class:`bytes` also accept :class:`bytearray`. The mutable API is based on :class:`collections.MutableSequence`.
uk: Як і :class:`str`, тип :class:`bytes` є незмінним. Існує окремий *змінний* тип для зберігання буферизованих двійкових даних, :class:`bytearray`. Майже всі API, які приймають :class:`bytes`, також приймають :class:`bytearray`. Змінний API заснований на :class:`collections.MutableSequence`.

source: All backslashes in raw string literals are interpreted literally. This means that ``'\U'`` and ``'\u'`` escapes in raw strings are not treated specially. For example, ``r'\u20ac'`` is a string of 6 characters in Python 3.0, whereas in 2.6, ``ur'\u20ac'`` was the single "euro" character. (Of course, this change only affects raw string literals; the euro character is ``'\u20ac'`` in Python 3.0.)
uk: Усі зворотні косі риски в необроблених рядкових літералах інтерпретуються буквально. Це означає, що екранування ``'\U'`` і ``'\u'`` у необроблених рядках не обробляються спеціально. Наприклад, ``r'\u20ac`` — це рядок із 6 символів у Python 3.0, тоді як у 2.6 ``ur'\u20ac`` був одним символом "євро". (Звичайно, ця зміна стосується лише необроблених рядкових літералів; у Python 3.0 символом євро є ``'\u20ac'``.)

source: The built-in :class:`basestring` abstract type was removed. Use :class:`str` instead. The :class:`str` and :class:`bytes` types don't have functionality enough in common to warrant a shared base class. The ``2to3`` tool (see below) replaces every occurrence of :class:`basestring` with :class:`str`.
uk: Вбудований :class:`basestring` абстрактний тип було видалено. Замість цього використовуйте :class:`str`. Типи :class:`str` і :class:`bytes` не мають достатньо спільних функціональних можливостей, щоб гарантувати спільний базовий клас. Інструмент ``2to3`` (див. нижче) замінює кожне входження :class:`basestring` на :class:`str`.

source: Files opened as text files (still the default mode for :func:`open`) always use an encoding to map between strings (in memory) and bytes (on disk). Binary files (opened with a ``b`` in the mode argument) always use bytes in memory. This means that if a file is opened using an incorrect mode or encoding, I/O will likely fail loudly, instead of silently producing incorrect data. It also means that even Unix users will have to specify the correct mode (text or binary) when opening a file. There is a platform-dependent default encoding, which on Unixy platforms can be set with the ``LANG`` environment variable (and sometimes also with some other platform-specific locale-related environment variables). In many cases, but not all, the system default is UTF-8; you should never count on this default. Any application reading or writing more than pure ASCII text should probably have a way to override the encoding. There is no longer any need for using the encoding-aware streams in the :mod:`codecs` module.
uk: Файли, відкриті як текстові файли (досі стандартний режим для :func:`open`), завжди використовують кодування для відображення між рядками (у пам’яті) та байтами (на диску). Двійкові файли (відкриті за допомогою ``b`` в аргументі mode) завжди використовують байти в пам’яті. Це означає, що якщо файл відкрито з використанням неправильного режиму або кодування, введення-виведення, ймовірно, голосно завершиться помилкою, замість того, щоб мовчки видати неправильні дані. Це також означає, що навіть користувачі Unix повинні будуть вказати правильний режим (текстовий або двійковий) під час відкриття файлу. Існує залежне від платформи кодування за замовчуванням, яке на платформах Unixy можна встановити за допомогою змінної середовища ``LANG`` (і іноді також за допомогою деяких інших змінних середовища, пов’язаних із місцевими стандартами). У багатьох випадках, але не у всіх, системою за замовчуванням є UTF-8; ви ніколи не повинні розраховувати на це замовчування. Будь-яка програма, яка читає або записує більше ніж чистий текст ASCII, ймовірно, повинна мати спосіб заміни кодування. Більше немає необхідності використовувати потоки з урахуванням кодування в модулі :mod:`codecs`.

source: The initial values of :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr` are now unicode-only text files (i.e., they are instances of :class:`io.TextIOBase`). To read and write bytes data with these streams, you need to use their :data:`io.TextIOBase.buffer` attribute.
uk: Початкові значення :data:`sys.stdin`, :data:`sys.stdout` і :data:`sys.stderr` тепер є текстовими файлами лише у кодуванні Юнікод (тобто вони є екземплярами :class:`io. TextIOBase`). Щоб читати та записувати дані байтів за допомогою цих потоків, вам потрібно використовувати їхній атрибут :data:`io.TextIOBase.buffer`.

source: Filenames are passed to and returned from APIs as (Unicode) strings. This can present platform-specific problems because on some platforms filenames are arbitrary byte strings. (On the other hand, on Windows filenames are natively stored as Unicode.) As a work-around, most APIs (e.g. :func:`open` and many functions in the :mod:`os` module) that take filenames accept :class:`bytes` objects as well as strings, and a few APIs have a way to ask for a :class:`bytes` return value. Thus, :func:`os.listdir` returns a list of :class:`bytes` instances if the argument is a :class:`bytes` instance, and :func:`os.getcwdb` returns the current working directory as a :class:`bytes` instance. Note that when :func:`os.listdir` returns a list of strings, filenames that cannot be decoded properly are omitted rather than raising :exc:`UnicodeError`.
uk: Імена файлів передаються та повертаються з API як рядки (Unicode). Це може спричинити проблеми, пов’язані з певною платформою, оскільки на деяких платформах імена файлів є довільними рядками байтів. (З іншого боку, у Windows імена файлів зберігаються у форматі Юнікод.) Як обхідний шлях, більшість API (наприклад, :func:`open` і багато функцій у модулі :mod:`os`), які приймають імена файлів, приймають: об’єкти :class:`bytes`, а також рядки, а кілька API мають спосіб запитувати значення, що повертається :class:`bytes`. Таким чином, :func:`os.listdir` повертає список екземплярів :class:`bytes`, якщо аргумент є екземпляром :class:`bytes`, а :func:`os.getcwdb` повертає поточний робочий каталог як екземпляр :class:`bytes`. Зауважте, що коли :func:`os.listdir` повертає список рядків, імена файлів, які не можна правильно розшифрувати, пропускаються, а не викликають :exc:`UnicodeError`.

source: Some system APIs like :data:`os.environ` and :data:`sys.argv` can also present problems when the bytes made available by the system is not interpretable using the default encoding. Setting the ``LANG`` variable and rerunning the program is probably the best approach.
uk: Деякі системні API, як-от :data:`os.environ` і :data:`sys.argv`, також можуть створювати проблеми, коли байти, доступні системою, не можна інтерпретувати за допомогою стандартного кодування. Встановлення змінної ``LANG`` і повторний запуск програми є, ймовірно, найкращим підходом.
