Repository: python/python-docs-uk
Catalog: whatsnew/3.0.po
Languages: uk

source: Cleanup of the :mod:`thread` module: :func:`acquire_lock` and :func:`release_lock` are gone; use :func:`acquire` and :func:`release` instead.
uk: Очищення модуля :mod:`thread`: :func:`acquire_lock` і :func:`release_lock` зникли; замість цього використовуйте :func:`acquire` і :func:`release`.

source: Cleanup of the :mod:`random` module: removed the :func:`jumpahead` API.
uk: Очищення модуля :mod:`random`: видалено API :func:`jumpahead`.

source: The :mod:`new` module is gone.
uk: Модуль :mod:`new` зник.

source: The functions :func:`os.tmpnam`, :func:`os.tempnam` and :func:`os.tmpfile` have been removed in favor of the :mod:`tempfile` module.
uk: Функції :func:`os.tmpnam`, :func:`os.tempnam` і :func:`os.tmpfile` було видалено на користь модуля :mod:`tempfile`.

source: The :mod:`tokenize` module has been changed to work with bytes. The main entry point is now :func:`tokenize.tokenize`, instead of generate_tokens.
uk: Модуль :mod:`tokenize` змінено для роботи з байтами. Головною точкою входу тепер є :func:`tokenize.tokenize` замість generate_tokens.

source: :data:`string.letters` and its friends (:data:`string.lowercase` and :data:`string.uppercase`) are gone. Use :data:`string.ascii_letters` etc. instead. (The reason for the removal is that :data:`string.letters` and friends had locale-specific behavior, which is a bad idea for such attractively-named global "constants".)
uk: :data:`string.letters` і його друзі (:data:`string.lowercase` і :data:`string.uppercase`) зникли. Замість цього використовуйте :data:`string.ascii_letters` тощо. (Причина видалення полягає в тому, що :data:`string.letters` і друзі мали поведінку, залежну від локалі, що є поганою ідеєю для таких привабливих імен глобальних "констант".)

source: Renamed module :mod:`__builtin__` to :mod:`builtins` (removing the underscores, adding an 's'). The :data:`__builtins__` variable found in most global namespaces is unchanged. To modify a builtin, you should use :mod:`builtins`, not :data:`__builtins__`!
uk: Змінено назву модуля :mod:`__builtin__` на :mod:`builtins` (видалення підкреслення, додавання 's'). Змінна :data:`__builtins__`, що міститься в більшості глобальних просторів імен, не змінюється. Щоб змінити вбудований модуль, ви повинні використовувати :mod:`builtins`, а не :data:`__builtins__`!

source: :pep:`3101`: A New Approach To String Formatting
uk: :pep:`3101`: Новий підхід до форматування рядків

source: A new system for built-in string formatting operations replaces the ``%`` string formatting operator. (However, the ``%`` operator is still supported; it will be deprecated in Python 3.1 and removed from the language at some later time.) Read :pep:`3101` for the full scoop.
uk: Нова система для вбудованих операцій форматування рядка замінює оператор форматування рядка ``%``. (Однак оператор ``%`` все ще підтримується; він буде застарілим у Python 3.1 і пізніше буде видалено з мови.) Прочитайте :pep:`3101`, щоб отримати повну інформацію.

source: Changes To Exceptions
uk: Зміни винятків

source: The APIs for raising and catching exception have been cleaned up and new powerful features added:
uk: Було очищено API для виклику та перехоплення винятків і додано нові потужні функції:

source: :pep:`352`: All exceptions must be derived (directly or indirectly) from :exc:`BaseException`. This is the root of the exception hierarchy. This is not new as a recommendation, but the *requirement* to inherit from :exc:`BaseException` is new. (Python 2.6 still allowed classic classes to be raised, and placed no restriction on what you can catch.) As a consequence, string exceptions are finally truly and utterly dead.
uk: :pep:`352`: усі винятки мають бути отримані (прямо чи опосередковано) з :exc:`BaseException`. Це корінь ієрархії винятків. Це не нова рекомендація, але *вимога* для успадкування від :exc:`BaseException` є новою. (Python 2.6 все ще дозволяв створювати класичні класи та не накладав обмежень на те, що ви можете перехопити.) Як наслідок, виключення рядків остаточно по-справжньому й повністю мертві.

source: Almost all exceptions should actually derive from :exc:`Exception`; :exc:`BaseException` should only be used as a base class for exceptions that should only be handled at the top level, such as :exc:`SystemExit` or :exc:`KeyboardInterrupt`. The recommended idiom for handling all exceptions except for this latter category is to use :keyword:`except` :exc:`Exception`.
uk: Майже всі винятки насправді мають походити від :exc:`Exception`; :exc:`BaseException` слід використовувати лише як базовий клас для винятків, які слід обробляти лише на верхньому рівні, наприклад :exc:`SystemExit` або :exc:`KeyboardInterrupt`. Рекомендована ідіома для обробки всіх винятків, крім цієї останньої категорії, полягає в використанні :keyword:`except` :exc:`Exception`.

source: :exc:`StandardError` was removed.
uk: :exc:`StandardError` видалено.

source: Exceptions no longer behave as sequences. Use the :attr:`args` attribute instead.
uk: Винятки більше не діють як послідовності. Натомість використовуйте атрибут :attr:`args`.

source: :pep:`3109`: Raising exceptions. You must now use :samp:`raise {Exception}({args})` instead of :samp:`raise {Exception}, {args}`. Additionally, you can no longer explicitly specify a traceback; instead, if you *have* to do this, you can assign directly to the :attr:`__traceback__` attribute (see below).
uk: :pep:`3109`: Створення винятків. Тепер ви повинні використовувати :samp:`raise {Exception}({args})` замість :samp:`raise {Exception}, {args}`. Крім того, ви більше не можете явно вказати відстеження; натомість, якщо вам *потрібно* це зробити, ви можете призначити безпосередньо атрибуту :attr:`__traceback__` (див. нижче).

source: :pep:`3110`: Catching exceptions. You must now use :samp:`except {SomeException} as {variable}` instead of :samp:`except {SomeException}, {variable}`. Moreover, the *variable* is explicitly deleted when the :keyword:`except` block is left.
uk: :pep:`3110`: Перехоплення винятків. Тепер ви повинні використовувати :samp:`крім {SomeException} як {variable}` замість :samp:`крім {SomeException}, {variable}`. Крім того, *змінна* явно видаляється, коли залишається блок :keyword:`except`.

source: :pep:`3134`: Exception chaining. There are two cases: implicit chaining and explicit chaining. Implicit chaining happens when an exception is raised in an :keyword:`except` or :keyword:`finally` handler block. This usually happens due to a bug in the handler block; we call this a *secondary* exception. In this case, the original exception (that was being handled) is saved as the :attr:`__context__` attribute of the secondary exception. Explicit chaining is invoked with this syntax::
uk: :pep:`3134`: ланцюжок винятків. Є два випадки: неявне з’єднання та явне з’єднання. Неявне з’єднання відбувається, коли виникає виняток у блоці обробки :keyword:`except` або :keyword:`finally`. Зазвичай це відбувається через помилку в блоці обробки; ми називаємо це *вторинним* винятком. У цьому випадку вихідний виняток (який оброблявся) зберігається як атрибут :attr:`__context__` вторинного виключення. Явне ланцюжок викликається з таким синтаксисом::

source: (where *primary_exception* is any expression that produces an exception object, probably an exception that was previously caught). In this case, the primary exception is stored on the :attr:`__cause__` attribute of the secondary exception. The traceback printed when an unhandled exception occurs walks the chain of :attr:`__cause__` and :attr:`__context__` attributes and prints a separate traceback for each component of the chain, with the primary exception at the top. (Java users may recognize this behavior.)
uk: (де *primary_exception* — це будь-який вираз, який створює об’єкт винятку, ймовірно, виняток, який був раніше перехоплений). У цьому випадку первинний виняток зберігається в атрибуті :attr:`__cause__` вторинного виключення. Зворотне відстеження, яке друкується, коли виникає необроблена виняткова ситуація, проходить по ланцюжку атрибутів :attr:`__cause__` і :attr:`__context__` і друкує окреме відстеження для кожного компонента ланцюжка з основним винятком у верхній частині. (Користувачі Java можуть розпізнати цю поведінку.)

source: :pep:`3134`: Exception objects now store their traceback as the :attr:`__traceback__` attribute. This means that an exception object now contains all the information pertaining to an exception, and there are fewer reasons to use :func:`sys.exc_info` (though the latter is not removed).
uk: :pep:`3134`: Об’єкти винятків тепер зберігають свою трасування як атрибут :attr:`__traceback__`. Це означає, що об’єкт винятку тепер містить всю інформацію, що стосується винятку, і є менше причин для використання :func:`sys.exc_info` (хоча останній не видаляється).

source: A few exception messages are improved when Windows fails to load an extension module. For example, ``error code 193`` is now ``%1 is not a valid Win32 application``. Strings now deal with non-English locales.
uk: Покращено кілька повідомлень про винятки, коли Windows не вдається завантажити модуль розширення. Наприклад, ``код помилки 193`` тепер ``%1 не є дійсною програмою Win32``. Рядки тепер мають справу з неанглійськими локалями.

source: Miscellaneous Other Changes
uk: Інші інші зміни

source: Operators And Special Methods
uk: Оператори та спеціальні методи

source: ``!=`` now returns the opposite of ``==``, unless ``==`` returns :data:`NotImplemented`.
uk: ``!=`` тепер повертає протилежність ``==``, якщо ``==`` не повертає :data:`NotImplemented`.

source: The concept of "unbound methods" has been removed from the language. When referencing a method as a class attribute, you now get a plain function object.
uk: Поняття "незв'язаних методів" було видалено з мови. Посилаючись на метод як на атрибут класу, тепер ви отримуєте звичайний об’єкт функції.

source: :meth:`__getslice__`, :meth:`__setslice__` and :meth:`__delslice__` were killed. The syntax ``a[i:j]`` now translates to ``a.__getitem__(slice(i, j))`` (or :meth:`__setitem__` or :meth:`__delitem__`, when used as an assignment or deletion target, respectively).
uk: :meth:`__getslice__`, :meth:`__setslice__` і :meth:`__delslice__` були вбиті. Синтаксис ``a[i:j]`` тепер перекладається на ``a.__getitem__(slice(i, j))`` (або :meth:`__setitem__` або :meth:`__delitem__`, коли використовується як ціль призначення або видалення відповідно).

source: :pep:`3114`: the standard :meth:`next` method has been renamed to :meth:`~iterator.__next__`.
uk: :pep:`3114`: стандартний метод :meth:`next` було перейменовано на :meth:`~iterator.__next__`.

source: The :meth:`__oct__` and :meth:`__hex__` special methods are removed -- :func:`oct` and :func:`hex` use :meth:`__index__` now to convert the argument to an integer.
uk: Спеціальні методи :meth:`__oct__` і :meth:`__hex__` видалено -- :func:`oct` і :func:`hex` тепер використовують :meth:`__index__` для перетворення аргументу в ціле число.

source: Removed support for :attr:`__members__` and :attr:`__methods__`.
uk: Видалено підтримку :attr:`__members__` і :attr:`__methods__`.

source: The function attributes named :attr:`func_X` have been renamed to use the :data:`__X__` form, freeing up these names in the function attribute namespace for user-defined attributes. To wit, :attr:`func_closure`, :attr:`func_code`, :attr:`func_defaults`, :attr:`func_dict`, :attr:`func_doc`, :attr:`func_globals`, :attr:`func_name` were renamed to :attr:`__closure__`, :attr:`__code__`, :attr:`__defaults__`, :attr:`~object.__dict__`, :attr:`__doc__`, :attr:`__globals__`, :attr:`~definition.__name__`, respectively.
uk: Атрибути функції з назвою :attr:`func_X` було перейменовано, щоб використовувати форму :data:`__X__`, звільнивши ці імена в просторі імен атрибутів функції для атрибутів, визначених користувачем. Зокрема, :attr:`func_closure`, :attr:`func_code`, :attr:`func_defaults`, :attr:`func_dict`, :attr:`func_doc`, :attr:`func_globals`, :attr:`func_name` були перейменовані на :attr:`__closure__`, :attr:`__code__`, :attr:`__defaults__`, :attr:`~object.__dict__`, :attr:`__doc__`, :attr:`__globals__`, :attr:`~definition.__name__` відповідно.

source: :meth:`__nonzero__` is now :meth:`__bool__`.
uk: :meth:`__nonzero__` тепер :meth:`__bool__`.

source: Builtins
uk: Вбудовані

source: :pep:`3135`: New :func:`super`. You can now invoke :func:`super` without arguments and (assuming this is in a regular instance method defined inside a :keyword:`class` statement) the right class and instance will automatically be chosen. With arguments, the behavior of :func:`super` is unchanged.
uk: :pep:`3135`: Нове :func:`super`. Тепер ви можете викликати :func:`super` без аргументів і (припускаючи, що це в звичайному методі екземпляра, визначеному всередині оператора :keyword:`class`) правильний клас і екземпляр будуть вибрані автоматично. З аргументами поведінка :func:`super` не змінюється.

source: :pep:`3111`: :func:`raw_input` was renamed to :func:`input`. That is, the new :func:`input` function reads a line from :data:`sys.stdin` and returns it with the trailing newline stripped. It raises :exc:`EOFError` if the input is terminated prematurely. To get the old behavior of :func:`input`, use ``eval(input())``.
uk: :pep:`3111`: :func:`raw_input` було перейменовано на :func:`input`. Тобто нова функція :func:`input` зчитує рядок із :data:`sys.stdin` і повертає його без кінцевого символу нового рядка. Він викликає :exc:`EOFError`, якщо введення завершується передчасно. Щоб отримати стару поведінку :func:`input`, використовуйте ``eval(input())``.

source: A new built-in function :func:`next` was added to call the :meth:`~iterator.__next__` method on an object.
uk: Додано нову вбудовану функцію :func:`next` для виклику методу :meth:`~iterator.__next__` для об’єкта.

source: The :func:`round` function rounding strategy and return type have changed. Exact halfway cases are now rounded to the nearest even result instead of away from zero. (For example, ``round(2.5)`` now returns ``2`` rather than ``3``.) ``round(x[, n])`` now delegates to ``x.__round__([n])`` instead of always returning a float. It generally returns an integer when called with a single argument and a value of the same type as ``x`` when called with two arguments.
uk: Змінено стратегію округлення функції :func:`round` і тип повернення. Точні половинні випадки тепер округлюються до найближчого парного результату замість нуля. (Наприклад, ``round(2.5)`` тепер повертає ``2``, а не ``3``.) ``round(x[, n])`` тепер делегує ``x.__round__([ n])`` замість того, щоб завжди повертати число з плаваючою точкою. Зазвичай він повертає ціле число, якщо викликається з одним аргументом, і значення того самого типу, що й ``x``, коли викликається з двома аргументами.

source: Moved :func:`intern` to :func:`sys.intern`.
uk: Переміщено :func:`intern` до :func:`sys.intern`.

source: Removed: :func:`apply`. Instead of ``apply(f, args)`` use ``f(*args)``.
uk: Видалено: :func:`apply`. Замість ``apply(f, args)`` використовуйте ``f(*args)``.

source: Removed :func:`callable`. Instead of ``callable(f)`` you can use ``isinstance(f, collections.Callable)``. The :func:`operator.isCallable` function is also gone.
uk: Видалено :func:`callable`. Замість ``callable(f)`` ви можете використовувати ``isinstance(f, collections.Callable)``. Функція :func:`operator.isCallable` також зникла.

source: Removed :func:`coerce`. This function no longer serves a purpose now that classic classes are gone.
uk: Видалено :func:`coerce`. Ця функція більше не служить меті, оскільки класичні класи зникли.

source: Removed :func:`execfile`. Instead of ``execfile(fn)`` use ``exec(open(fn).read())``.
uk: Видалено :func:`execfile`. Замість ``execfile(fn)`` використовуйте ``exec(open(fn).read())``.

source: Removed the :class:`file` type. Use :func:`open`. There are now several different kinds of streams that open can return in the :mod:`io` module.
uk: Видалено тип :class:`file`. Використовуйте :func:`open`. Зараз існує кілька різних типів потоків, які відкриваються і можуть повертатися в модулі :mod:`io`.

source: Removed :func:`reduce`. Use :func:`functools.reduce` if you really need it; however, 99 percent of the time an explicit :keyword:`for` loop is more readable.
uk: Видалено :func:`reduce`. Використовуйте :func:`functools.reduce`, якщо вам це дійсно потрібно; однак у 99% випадків явний цикл :keyword:`for` читабельніший.

source: Removed :func:`reload`. Use :func:`imp.reload`.
uk: Видалено :func:`reload`. Використовуйте :func:`imp.reload`.

source: Removed. :meth:`dict.has_key` -- use the :keyword:`in` operator instead.
uk: Видалено. :meth:`dict.has_key` -- замість цього використовуйте оператор :keyword:`in`.

source: Build and C API Changes
uk: Зміни збірки та C API

source: Due to time constraints, here is a *very* incomplete list of changes to the C API.
uk: Через обмеження часу ось *дуже* неповний список змін до C API.

source: Support for several platforms was dropped, including but not limited to Mac OS 9, BeOS, RISCOS, Irix, and Tru64.
uk: Було припинено підтримку кількох платформ, зокрема Mac OS 9, BeOS, RISCOS, Irix і Tru64.

source: :pep:`3118`: New Buffer API.
uk: :pep:`3118`: Новий API буфера.

source: :pep:`3121`: Extension Module Initialization & Finalization.
uk: :pep:`3121`: Ініціалізація та завершення модуля розширення.

source: :pep:`3123`: Making :c:macro:`PyObject_HEAD` conform to standard C.
uk: :pep:`3123`: Приведення :c:macro:`PyObject_HEAD` до стандарту C.

source: No more C API support for restricted execution.
uk: Більше немає підтримки C API для обмеженого виконання.

source: :c:func:`PyNumber_Coerce`, :c:func:`PyNumber_CoerceEx`, :c:func:`PyMember_Get`, and :c:func:`PyMember_Set` C APIs are removed.
uk: :c:func:`PyNumber_Coerce`, :c:func:`PyNumber_CoerceEx`, :c:func:`PyMember_Get` і :c:func:`PyMember_Set` API C видалено.

source: New C API :c:func:`PyImport_ImportModuleNoBlock`, works like :c:func:`PyImport_ImportModule` but won't block on the import lock (returning an error instead).
uk: Новий C API :c:func:`PyImport_ImportModuleNoBlock`, працює як :c:func:`PyImport_ImportModule`, але не блокує блокування імпорту (натомість повертає помилку).

source: Renamed the boolean conversion C-level slot and method: ``nb_nonzero`` is now ``nb_bool``.
uk: Перейменовано слот і метод логічного перетворення C-рівня: ``nb_nonzero`` тепер ``nb_bool``.

source: Removed :c:macro:`METH_OLDARGS` and :c:macro:`WITH_CYCLE_GC` from the C API.
uk: Видалено :c:macro:`METH_OLDARGS` і :c:macro:`WITH_CYCLE_GC` з C API.

source: Performance
uk: Продуктивність

source: The net result of the 3.0 generalizations is that Python 3.0 runs the pystone benchmark around 10% slower than Python 2.5. Most likely the biggest cause is the removal of special-casing for small integers. There's room for improvement, but it will happen after 3.0 is released!
uk: Кінцевим результатом узагальнень 3.0 є те, що Python 3.0 виконує тест pystone приблизно на 10% повільніше, ніж Python 2.5. Швидше за все, найбільшою причиною є видалення спеціального регістра для малих цілих чисел. Є місце для вдосконалення, але це станеться після випуску 3.0!

source: Porting To Python 3.0
uk: Перенесення на Python 3.0

source: For porting existing Python 2.5 or 2.6 source code to Python 3.0, the best strategy is the following:
uk: Для перенесення існуючого вихідного коду Python 2.5 або 2.6 на Python 3.0 найкраща стратегія така:

source: (Prerequisite:) Start with excellent test coverage.
uk: (Обов’язкова умова:) Почніть із чудового тестового покриття.

source: Port to Python 2.6. This should be no more work than the average port from Python 2.x to Python 2.(x+1). Make sure all your tests pass.
uk: Порт на Python 2.6. Це повинно бути не більше роботи, ніж середнє перенесення з Python 2.x на Python 2. (x+1). Переконайтеся, що всі ваші тести пройдені.

source: (Still using 2.6:) Turn on the :option:`!-3` command line switch. This enables warnings about features that will be removed (or change) in 3.0. Run your test suite again, and fix code that you get warnings about until there are no warnings left, and all your tests still pass.
uk: (Досі використовується 2.6:) Увімкніть перемикач командного рядка :option:`!-3`. Це вмикає попередження про функції, які буде видалено (або змінено) у версії 3.0. Знову запустіть набір тестів і виправте код, про який ви отримуєте попередження, доки попередження не зникнуть, і всі ваші тести все одно пройдуть.

source: Run the ``2to3`` source-to-source translator over your source code tree. (See :ref:`2to3-reference` for more on this tool.) Run the result of the translation under Python 3.0. Manually fix up any remaining issues, fixing problems until all tests pass again.
uk: Запустіть перекладач ``2to3`` з джерела в джерело над вашим деревом вихідного коду. (Див. :ref:`2to3-reference`, щоб дізнатися більше про цей інструмент.) Запустіть результат перекладу під Python 3.0. Вручну вирішуйте проблеми, що залишилися, виправляючи проблеми, доки всі тести не пройдуть знову.

source: It is not recommended to try to write source code that runs unchanged under both Python 2.6 and 3.0; you'd have to use a very contorted coding style, e.g. avoiding ``print`` statements, metaclasses, and much more. If you are maintaining a library that needs to support both Python 2.6 and Python 3.0, the best approach is to modify step 3 above by editing the 2.6 version of the source code and running the ``2to3`` translator again, rather than editing the 3.0 version of the source code.
uk: Не рекомендується намагатися написати вихідний код, який працює без змін під Python 2.6 і 3.0; вам доведеться використовувати дуже спотворений стиль кодування, напр. уникнення операторів ``print``, метакласів і багато іншого. Якщо ви підтримуєте бібліотеку, яка має підтримувати як Python 2.6, так і Python 3.0, найкращим підходом є змінити крок 3 вище, відредагувавши версію вихідного коду 2.6 і знову запустивши перекладач ``2to3`` замість редагування Версія вихідного коду 3.0.

source: For porting C extensions to Python 3.0, please see :ref:`cporting-howto`.
uk: Для перенесення розширень C на Python 3.0 див. :ref:`cporting-howto`.
