Repository: python/python-docs-uk
Catalog: whatsnew/3.0.po
Languages: uk

source: :pep:`3138`: The :func:`repr` of a string no longer escapes non-ASCII characters. It still escapes control characters and code points with non-printable status in the Unicode standard, however.
uk: :pep:`3138`: :func:`repr` рядка більше не екранує символи, відмінні від ASCII. Однак у стандарті Юнікод він все ще уникає контрольних символів і кодових точок зі статусом "недрукований".

source: :pep:`3120`: The default source encoding is now UTF-8.
uk: :pep:`3120`: Стандартне кодування джерела тепер UTF-8.

source: :pep:`3131`: Non-ASCII letters are now allowed in identifiers. (However, the standard library remains ASCII-only with the exception of contributor names in comments.)
uk: :pep:`3131`: Літери, відмінні від ASCII, тепер дозволені в ідентифікаторах. (Однак стандартна бібліотека залишається лише ASCII, за винятком імен учасників у коментарях.)

source: The :mod:`StringIO` and :mod:`cStringIO` modules are gone. Instead, import the :mod:`io` module and use :class:`io.StringIO` or :class:`io.BytesIO` for text and data respectively.
uk: Модулі :mod:`StringIO` і :mod:`cStringIO` зникли. Натомість імпортуйте модуль :mod:`io` і використовуйте :class:`io.StringIO` або :class:`io.BytesIO` для тексту та даних відповідно.

source: See also the :ref:`unicode-howto`, which was updated for Python 3.0.
uk: Дивіться також :ref:`unicode-howto`, який було оновлено для Python 3.0.

source: Overview Of Syntax Changes
uk: Огляд змін синтаксису

source: This section gives a brief overview of every *syntactic* change in Python 3.0.
uk: У цьому розділі подано короткий огляд усіх *синтаксичних* змін у Python 3.0.

source: New Syntax
uk: Новий синтаксис

source: :pep:`3107`: Function argument and return value annotations. This provides a standardized way of annotating a function's parameters and return value. There are no semantics attached to such annotations except that they can be introspected at runtime using the :attr:`__annotations__` attribute. The intent is to encourage experimentation through metaclasses, decorators or frameworks.
uk: :pep:`3107`: Аргумент функції та анотації значення, що повертається. Це забезпечує стандартизований спосіб анотування параметрів функції та значення, що повертається. Немає жодної семантики, пов’язаної з такими анотаціями, за винятком того, що їх можна перевірити під час виконання за допомогою атрибута :attr:`__annotations__`. Мета полягає в тому, щоб заохотити експериментувати за допомогою метакласів, декораторів або фреймворків.

source: :pep:`3102`: Keyword-only arguments. Named parameters occurring after ``*args`` in the parameter list *must* be specified using keyword syntax in the call. You can also use a bare ``*`` in the parameter list to indicate that you don't accept a variable-length argument list, but you do have keyword-only arguments.
uk: :pep:`3102`: аргументи лише для ключових слів. Іменовані параметри, що виникають після ``*args`` у списку параметрів *повинні* вказуватися за допомогою синтаксису ключового слова під час виклику. Ви також можете використовувати голий ``*`` у списку параметрів, щоб вказати, що ви не приймаєте список аргументів змінної довжини, але у вас є аргументи лише для ключових слів.

source: Keyword arguments are allowed after the list of base classes in a class definition. This is used by the new convention for specifying a metaclass (see next section), but can be used for other purposes as well, as long as the metaclass supports it.
uk: Аргументи ключових слів дозволені після списку базових класів у визначенні класу. Це використовується новою конвенцією для визначення метакласу (див. наступний розділ), але також може використовуватися для інших цілей, якщо метаклас це підтримує.

source: :pep:`3104`: :keyword:`nonlocal` statement. Using ``nonlocal x`` you can now assign directly to a variable in an outer (but non-global) scope. :keyword:`!nonlocal` is a new reserved word.
uk: :pep:`3104`: :keyword:`nonlocal` оператор. Використовуючи ``nonlocal x``, тепер ви можете призначати безпосередньо змінній у зовнішній (але не глобальній) області. :keyword:`!nonlocal` — нове зарезервоване слово.

source: :pep:`3132`: Extended Iterable Unpacking. You can now write things like ``a, b, *rest = some_sequence``. And even ``*rest, a = stuff``. The ``rest`` object is always a (possibly empty) list; the right-hand side may be any iterable. Example::
uk: :pep:`3132`: Розширене ітераційне розпакування. Тепер ви можете писати такі речі, як ``a, b, *rest = some_sequence``. І навіть ``*rest, a = stuff``. Об'єкт ``rest`` завжди є (можливо, порожнім) списком; права частина може бути будь-якою ітерованою. Приклад::

source: This sets *a* to ``0``, *b* to ``4``, and *rest* to ``[1, 2, 3]``.
uk: Це встановлює *a* на ``0``, *b* на ``4``, а *rest* на ``[1, 2, 3]``.

source: Dictionary comprehensions: ``{k: v for k, v in stuff}`` means the same thing as ``dict(stuff)`` but is more flexible. (This is :pep:`274` vindicated. :-)
uk: Розуміння словника: ``{k: v for k, v in stuff}`` означає те саме, що ``dict(stuff)``, але є більш гнучким. (Це :pep:`274` підтверджено. :-)

source: Set literals, e.g. ``{1, 2}``. Note that ``{}`` is an empty dictionary; use ``set()`` for an empty set. Set comprehensions are also supported; e.g., ``{x for x in stuff}`` means the same thing as ``set(stuff)`` but is more flexible.
uk: Встановіть літерали, напр. ``{1, 2}``. Зауважте, що ``{}`` є порожнім словником; використовуйте ``set()`` для порожнього набору. Також підтримується розуміння набору; наприклад, ``{x for x in stuff}`` означає те саме, що ``set(stuff)``, але є більш гнучким.

source: New octal literals, e.g. ``0o720`` (already in 2.6). The old octal literals (``0720``) are gone.
uk: Нові вісімкові літерали, напр. ``0o720`` (вже у 2.6). Старі вісімкові літерали (``0720``) зникли.

source: New binary literals, e.g. ``0b1010`` (already in 2.6), and there is a new corresponding built-in function, :func:`bin`.
uk: Нові бінарні літерали, напр. ``0b1010`` (вже у 2.6), і є нова відповідна вбудована функція, :func:`bin`.

source: Bytes literals are introduced with a leading ``b`` or ``B``, and there is a new corresponding built-in function, :func:`bytes`.
uk: Байтові літерали представлено з ``b`` або ``B`` на початку, і є нова відповідна вбудована функція, :func:`bytes`.

source: Changed Syntax
uk: Змінений синтаксис

source: :pep:`3109` and :pep:`3134`: new :keyword:`raise` statement syntax: :samp:`raise [{expr} [from {expr}]]`. See below.
uk: :pep:`3109` і :pep:`3134`: новий синтаксис оператора :keyword:`raise`: :samp:`raise [{expr} [з {expr}]]`. Дивіться нижче.

source: :keyword:`!as` and :keyword:`with` are now reserved words. (Since 2.6, actually.)
uk: :keyword:`!as` і :keyword:`with` тепер зарезервовані слова. (Насправді з 2.6.)

source: ``True``, ``False``, and ``None`` are reserved words. (2.6 partially enforced the restrictions on ``None`` already.)
uk: ``True``, ``False`` і ``None`` є зарезервованими словами. (2.6 вже частково застосував обмеження на ``None``.)

source: Change from :keyword:`except` *exc*, *var* to :keyword:`!except` *exc* :keyword:`!as` *var*. See :pep:`3110`.
uk: Змінити з :keyword:`except` *exc*, *var* на :keyword:`!except` *exc* :keyword:`!as` *var*. Дивіться :pep:`3110`.

source: :pep:`3115`: New Metaclass Syntax. Instead of::
uk: :pep:`3115`: Новий синтаксис метакласу. Замість::

source: you must now use::
uk: тепер ви повинні використовувати::

source: The module-global :data:`__metaclass__` variable is no longer supported. (It was a crutch to make it easier to default to new-style classes without deriving every class from :class:`object`.)
uk: Змінна module-global :data:`__metaclass__` більше не підтримується. (Це була милиця, щоб полегшити за замовчуванням класи нового стилю без отримання кожного класу від :class:`object`.)

source: List comprehensions no longer support the syntactic form :samp:`[... for {var} in {item1}, {item2}, ...]`. Use :samp:`[... for {var} in ({item1}, {item2}, ...)]` instead. Also note that list comprehensions have different semantics: they are closer to syntactic sugar for a generator expression inside a :func:`list` constructor, and in particular the loop control variables are no longer leaked into the surrounding scope.
uk: Розуміння списків більше не підтримує синтаксичну форму :samp:`[... для {var} в {item1}, {item2}, ...]`. Замість цього використовуйте :samp:`[... для {var} в ({item1}, {item2}, ...)]`. Також зауважте, що розуміння списків має іншу семантику: вони ближчі до синтаксичного цукру для виразу генератора всередині конструктора :func:`list`, і, зокрема, керуючі змінні циклу більше не просочуються в навколишню область.

source: The *ellipsis* (``...``) can be used as an atomic expression anywhere. (Previously it was only allowed in slices.) Also, it *must* now be spelled as ``...``. (Previously it could also be spelled as ``. . .``, by a mere accident of the grammar.)
uk: *Еліпсис* (``...``) можна використовувати як атомарний вираз будь-де. (Раніше це було дозволено лише у фрагментах.) Крім того, тепер *потрібно* писати як ``...``. (Раніше це також могло бути написане як ``...``, просто через випадковість граматики.)

source: Removed Syntax
uk: Видалений синтаксис

source: :pep:`3113`: Tuple parameter unpacking removed. You can no longer write ``def foo(a, (b, c)): ...``. Use ``def foo(a, b_c): b, c = b_c`` instead.
uk: :pep:`3113`: вилучено розпакування параметрів кортежу. Ви більше не можете писати ``def foo(a, (b, c)): ...``. Замість цього використовуйте ``def foo(a, b_c): b, c = b_c``.

source: Removed backticks (use :func:`repr` instead).
uk: Видалено зворотні галочки (замість цього використовуйте :func:`repr`).

source: Removed ``<>`` (use ``!=`` instead).
uk: Видалено ``<>`` (замість цього використовуйте ``!=``).

source: Removed keyword: :func:`exec` is no longer a keyword; it remains as a function. (Fortunately the function syntax was also accepted in 2.x.) Also note that :func:`exec` no longer takes a stream argument; instead of ``exec(f)`` you can use ``exec(f.read())``.
uk: Видалено ключове слово: :func:`exec` більше не є ключовим словом; воно залишається як функція. (На щастя, синтаксис функції також був прийнятий у 2.x.) Також зауважте, що :func:`exec` більше не приймає аргумент потоку; замість ``exec(f)`` ви можете використовувати ``exec(f.read())``.

source: Integer literals no longer support a trailing ``l`` or ``L``.
uk: Цілі літерали більше не підтримують кінцеві ``l`` або ``L``.

source: String literals no longer support a leading ``u`` or ``U``.
uk: Рядкові літерали більше не підтримують початок ``u`` або ``U``.

source: The :keyword:`from` *module* :keyword:`import` ``*`` syntax is only allowed at the module level, no longer inside functions.
uk: Синтаксис :keyword:`from` *module* :keyword:`import` ``*`` дозволений лише на рівні модуля, більше не всередині функцій.

source: The only acceptable syntax for relative imports is :samp:`from .[{module}] import {name}`. All :keyword:`import` forms not starting with ``.`` are interpreted as absolute imports. (:pep:`328`)
uk: Єдиним прийнятним синтаксисом для відносного імпорту є :samp:`from .[{module}] import {name}`. Усі форми :keyword:`import`, які не починаються з ``.``, інтерпретуються як абсолютні імпорти. (:pep:`328`)

source: Classic classes are gone.
uk: Класичні заняття зникли.

source: Changes Already Present In Python 2.6
uk: Зміни вже присутні в Python 2.6

source: Since many users presumably make the jump straight from Python 2.5 to Python 3.0, this section reminds the reader of new features that were originally designed for Python 3.0 but that were back-ported to Python 2.6. The corresponding sections in :ref:`whats-new-in-2.6` should be consulted for longer descriptions.
uk: Оскільки багато користувачів, ймовірно, переходять прямо з Python 2.5 на Python 3.0, цей розділ нагадує читачеві про нові функції, які спочатку були розроблені для Python 3.0, але які були перенесені на Python 2.6. Додаткові описи можна знайти у відповідних розділах :ref:`whats-new-in-2.6`.

source: :ref:`pep-0343`. The :keyword:`with` statement is now a standard feature and no longer needs to be imported from the :mod:`__future__`. Also check out :ref:`new-26-context-managers` and :ref:`new-module-contextlib`.
uk: :ref:`pep-0343`. Оператор :keyword:`with` тепер є стандартною функцією, і його більше не потрібно імпортувати з :mod:`__future__`. Також перегляньте :ref:`new-26-context-managers` і :ref:`new-module-contextlib`.

source: :ref:`pep-0366`. This enhances the usefulness of the :option:`-m` option when the referenced module lives in a package.
uk: :ref:`pep-0366`. Це підвищує корисність опції :option:`-m`, коли модуль, на який посилається, живе в пакеті.

source: :ref:`pep-3101`. Note: the 2.6 description mentions the :meth:`format` method for both 8-bit and Unicode strings. In 3.0, only the :class:`str` type (text strings with Unicode support) supports this method; the :class:`bytes` type does not. The plan is to eventually make this the only API for string formatting, and to start deprecating the ``%`` operator in Python 3.1.
uk: :ref:`pep-3101`. Примітка: в описі 2.6 згадується метод :meth:`format` як для 8-бітних рядків, так і для рядків Unicode. У версії 3.0 тільки тип :class:`str` (текстові рядки з підтримкою Unicode) підтримує цей метод; тип :class:`bytes` не має. План полягає в тому, щоб згодом зробити це єдиним API для форматування рядків і почати не підтримувати оператор ``%`` у Python 3.1.

source: :ref:`pep-3105`. This is now a standard feature and no longer needs to be imported from :mod:`__future__`. More details were given above.
uk: :ref:`pep-3105`. Тепер це стандартна функція, і її більше не потрібно імпортувати з :mod:`__future__`. Детальніше було наведено вище.

source: :ref:`pep-3110`. The :keyword:`except` *exc* :keyword:`!as` *var* syntax is now standard and :keyword:`!except` *exc*, *var* is no longer supported. (Of course, the :keyword:`!as` *var* part is still optional.)
uk: :ref:`pep-3110`. Синтаксис :keyword:`except` *exc* :keyword:`!as` *var* тепер є стандартним, а :keyword:`!except` *exc*, *var* більше не підтримується. (Звичайно, частина :keyword:`!as` *var* все ще необов’язкова.)

source: :ref:`pep-3112`. The ``b"..."`` string literal notation (and its variants like ``b'...'``, ``b"""..."""``, and ``br"..."``) now produces a literal of type :class:`bytes`.
uk: :ref:`pep-3112`. Нотація рядкового літералу ``b"..."`` (і його варіанти, такі як ``b'...'``, ``b"""..."""`` і ``br" ..."``) тепер створює літерал типу :class:`bytes`.

source: :ref:`pep-3116`. The :mod:`io` module is now the standard way of doing file I/O. The built-in :func:`open` function is now an alias for :func:`io.open` and has additional keyword arguments *encoding*, *errors*, *newline* and *closefd*. Also note that an invalid *mode* argument now raises :exc:`ValueError`, not :exc:`IOError`. The binary file object underlying a text file object can be accessed as :attr:`f.buffer` (but beware that the text object maintains a buffer of itself in order to speed up the encoding and decoding operations).
uk: :ref:`pep-3116`. Модуль :mod:`io` тепер є стандартним способом здійснення файлового введення/виведення. Вбудована функція :func:`open` тепер є псевдонімом для :func:`io.open` і має додаткові ключові аргументи *encoding*, *errors*, *newline* і *closefd*. Також зауважте, що недійсний аргумент *mode* тепер викликає :exc:`ValueError`, а не :exc:`IOError`. До бінарного файлового об’єкта, що лежить в основі текстового файлового об’єкта, можна отримати доступ як :attr:`f.buffer` (але пам’ятайте, що текстовий об’єкт підтримує сам буфер, щоб пришвидшити операції кодування та декодування).

source: :ref:`pep-3118`. The old builtin :func:`buffer` is now really gone; the new builtin :func:`memoryview` provides (mostly) similar functionality.
uk: :ref:`pep-3118`. Старий вбудований :func:`buffer` тепер справді зник; новий вбудований :func:`memoryview` забезпечує (в основному) подібну функціональність.

source: :ref:`pep-3119`. The :mod:`abc` module and the ABCs defined in the :mod:`collections` module plays a somewhat more prominent role in the language now, and built-in collection types like :class:`dict` and :class:`list` conform to the :class:`collections.MutableMapping` and :class:`collections.MutableSequence` ABCs, respectively.
uk: :ref:`pep-3119`. Модуль :mod:`abc` і ABC, визначені в модулі :mod:`collections`, тепер відіграють дещо помітнішу роль у мові, а також такі вбудовані типи колекцій, як :class:`dict` і :class:`list` відповідає ABC :class:`collections.MutableMapping` і :class:`collections.MutableSequence` відповідно.

source: :ref:`pep-3127`. As mentioned above, the new octal literal notation is the only one supported, and binary literals have been added.
uk: :ref:`pep-3127`. Як згадувалося вище, нова нотація вісімкових літералів є єдиною, що підтримується, і додано двійкові літерали.

source: :ref:`pep-3141`. The :mod:`numbers` module is another new use of ABCs, defining Python's "numeric tower". Also note the new :mod:`fractions` module which implements :class:`numbers.Rational`.
uk: :ref:`pep-3141`. Модуль :mod:`numbers` є ще одним новим використанням ABC, що визначає "числову вежу" Python. Також зверніть увагу на новий модуль :mod:`fractions`, який реалізує :class:`numbers.Rational`.

source: Library Changes
uk: Зміни бібліотеки

source: Due to time constraints, this document does not exhaustively cover the very extensive changes to the standard library. :pep:`3108` is the reference for the major changes to the library. Here's a capsule review:
uk: Через обмеження часу цей документ не вичерпно охоплює дуже великі зміни стандартної бібліотеки. :pep:`3108` є посиланням на основні зміни в бібліотеці. Ось огляд капсули:

source: Many old modules were removed. Some, like :mod:`gopherlib` (no longer used) and :mod:`md5` (replaced by :mod:`hashlib`), were already deprecated by :pep:`4`. Others were removed as a result of the removal of support for various platforms such as Irix, BeOS and Mac OS 9 (see :pep:`11`). Some modules were also selected for removal in Python 3.0 due to lack of use or because a better replacement exists. See :pep:`3108` for an exhaustive list.
uk: Багато старих модулів було видалено. Деякі, як-от :mod:`gopherlib` (більше не використовується) і :mod:`md5` (замінений на :mod:`hashlib`), вже були застарілими :pep:`4`. Інші були видалені в результаті припинення підтримки різних платформ, таких як Irix, BeOS і Mac OS 9 (див. :pep:`11`). Деякі модулі також було вибрано для видалення в Python 3.0 через відсутність використання або через те, що існує краща заміна. Перегляньте :pep:`3108` для вичерпного списку.

source: The :mod:`bsddb3` package was removed because its presence in the core standard library has proved over time to be a particular burden for the core developers due to testing instability and Berkeley DB's release schedule. However, the package is alive and well, externally maintained at https://www.jcea.es/programacion/pybsddb.htm.
uk: Пакет :mod:`bsddb3` було вилучено, оскільки його присутність у базовій стандартній бібліотеці з часом виявилася особливим тягарем для розробників ядра через нестабільність тестування та графік випуску Berkeley DB. Однак пакет живий і здоровий, підтримується зовні за адресою https://www.jcea.es/programacion/pybsddb.htm.

source: Some modules were renamed because their old name disobeyed :pep:`8`, or for various other reasons. Here's the list:
uk: Деякі модулі були перейменовані через те, що їхня стара назва не відповідала :pep:`8`, або з інших причин. Ось список:

source: Old Name
uk: Стара назва

source: New Name
uk: Нова назва

source: configparser
uk: аналізатор конфігурації

source: Queue
uk: Чергу

source: queue
uk: чергу

source: socketserver
uk: сокетсервер

source: markupbase
uk: база розмітки

source: repr
uk: репр

source: A common pattern in Python 2.x is to have one version of a module implemented in pure Python, with an optional accelerated version implemented as a C extension; for example, :mod:`pickle` and :mod:`cPickle`. This places the burden of importing the accelerated version and falling back on the pure Python version on each user of these modules. In Python 3.0, the accelerated versions are considered implementation details of the pure Python versions. Users should always import the standard version, which attempts to import the accelerated version and falls back to the pure Python version. The :mod:`pickle` / :mod:`cPickle` pair received this treatment. The :mod:`profile` module is on the list for 3.1. The :mod:`StringIO` module has been turned into a class in the :mod:`io` module.
uk: Загальним шаблоном у Python 2.x є одна версія модуля, реалізована на чистому Python, з додатковою прискореною версією, реалізованою як розширення C; наприклад, :mod:`pickle` і :mod:`cPickle`. Це покладає тягар імпортування прискореної версії та повернення до чистої версії Python на кожного користувача цих модулів. У Python 3.0 прискорені версії вважаються деталями реалізації чистих версій Python. Користувачам слід завжди імпортувати стандартну версію, яка намагається імпортувати прискорену версію та повертається до чистої версії Python. Пара :mod:`pickle` / :mod:`cPickle` отримала таку обробку. Модуль :mod:`profile` є в списку для 3.1. Модуль :mod:`StringIO` було перетворено на клас у модулі :mod:`io`.

source: Some related modules have been grouped into packages, and usually the submodule names have been simplified. The resulting new packages are:
uk: Деякі пов’язані модулі були згруповані в пакети, і зазвичай назви підмодулів були спрощені. Отримані нові пакети:

source: :mod:`tkinter` (all :mod:`Tkinter`-related modules except :mod:`turtle`). The target audience of :mod:`turtle` doesn't really care about :mod:`tkinter`. Also note that as of Python 2.6, the functionality of :mod:`turtle` has been greatly enhanced.
uk: :mod:`tkinter` (усі пов’язані з :mod:`Tkinter` модулі, крім :mod:`turtle`). Цільова аудиторія :mod:`turtle` не дуже дбає про :mod:`tkinter`. Також зауважте, що починаючи з Python 2.6, функціональність :mod:`turtle` була значно розширена.

source: Some other changes to standard library modules, not covered by :pep:`3108`:
uk: Деякі інші зміни до модулів стандартної бібліотеки, не охоплені :pep:`3108`:

source: Killed :mod:`sets`. Use the built-in :func:`set` class.
uk: Убитий :mod:`sets`. Використовуйте вбудований клас :func:`set`.

source: Cleanup of the :mod:`sys` module: removed :func:`sys.exitfunc`, :func:`sys.exc_clear`, :data:`sys.exc_type`, :data:`sys.exc_value`, :data:`sys.exc_traceback`. (Note that :data:`sys.last_type` etc. remain.)
uk: Очищення модуля :mod:`sys`: видалено :func:`sys.exitfunc`, :func:`sys.exc_clear`, :data:`sys.exc_type`, :data:`sys.exc_value`, :data:`sys.exc_traceback`. (Зверніть увагу, що :data:`sys.last_type` тощо залишаються.)

source: Cleanup of the :class:`array.array` type: the :meth:`read` and :meth:`write` methods are gone; use :meth:`fromfile` and :meth:`tofile` instead. Also, the ``'c'`` typecode for array is gone -- use either ``'b'`` for bytes or ``'u'`` for Unicode characters.
uk: Очищення типу :class:`array.array`: методи :meth:`read` і :meth:`write` зникли; замість цього використовуйте :meth:`fromfile` і :meth:`tofile`. Крім того, код типу ``'c'`` для масиву зник — використовуйте ``'b'`` для байтів або ``'u'`` для символів Unicode.

source: Cleanup of the :mod:`operator` module: removed :func:`sequenceIncludes` and :func:`isCallable`.
uk: Очищення модуля :mod:`operator`: видалено :func:`sequenceIncludes` і :func:`isCallable`.
