Repository: python/python-docs-uk
Catalog: whatsnew/3.10.po
Languages: uk

source: What's New In Python 3.10
uk: Що нового в Python 3.10

source: Release
uk: Реліз

source: Date
uk: Дата

source: Editor
uk: редактор

source: This article explains the new features in Python 3.10, compared to 3.9. Python 3.10 was released on October 4, 2021. For full details, see the :ref:`changelog <changelog>`.
uk: У цій статті пояснюється нові функції в Python 3.10 порівняно з 3.9. Python 3.10 було випущено 4 жовтня 2021 року. Щоб отримати повну інформацію, перегляньте :ref:`журнал змін <changelog>`.

source: Summary -- Release highlights
uk: Підсумок – основні моменти випуску

source: New syntax features:
uk: Нові функції синтаксису:

source: :pep:`634`, Structural Pattern Matching: Specification
uk: :pep:`634`, Зіставлення структурних шаблонів: Специфікація

source: :pep:`635`, Structural Pattern Matching: Motivation and Rationale
uk: :pep:`635`, Зіставлення структурних шаблонів: мотивація та обґрунтування

source: :pep:`636`, Structural Pattern Matching: Tutorial
uk: :pep:`636`, Зіставлення структурних шаблонів: підручник

source: :issue:`12782`, Parenthesized context managers are now officially allowed.
uk: :issue:`12782`, Менеджери контексту в дужках тепер офіційно дозволені.

source: New features in the standard library:
uk: Нові можливості стандартної бібліотеки:

source: :pep:`618`, Add Optional Length-Checking To zip.
uk: :pep:`618`, Додайте опціональну перевірку довжини до zip.

source: Interpreter improvements:
uk: Покращення перекладача:

source: :pep:`626`, Precise line numbers for debugging and other tools.
uk: :pep:`626`, точні номери рядків для налагодження та інших інструментів.

source: New typing features:
uk: Нові функції набору тексту:

source: :pep:`604`, Allow writing union types as X | Y
uk: :pep:`604`, Дозволити запис типів об’єднань як X | Ю

source: :pep:`613`, Explicit Type Aliases
uk: :pep:`613`, Явні псевдоніми типу

source: :pep:`612`, Parameter Specification Variables
uk: :pep:`612`, Змінні специфікації параметрів

source: Important deprecations, removals or restrictions:
uk: Важливі застарілі, видалення або обмеження:

source: :pep:`644`, Require OpenSSL 1.1.1 or newer
uk: :pep:`644`, Потрібен OpenSSL 1.1.1 або новіший

source: :pep:`632`, Deprecate distutils module.
uk: :pep:`632`, Вилучити модуль distutils.

source: :pep:`623`, Deprecate and prepare for the removal of the wstr member in PyUnicodeObject.
uk: :pep:`623`, Застаріло та підготуйтеся до видалення члена wstr у PyUnicodeObject.

source: :pep:`624`, Remove Py_UNICODE encoder APIs
uk: :pep:`624`, Видалити API кодувальника Py_UNICODE

source: :pep:`597`, Add optional EncodingWarning
uk: :pep:`597`, Додайте необов’язкове попередження про кодування

source: New Features
uk: Нові можливості

source: Parenthesized context managers
uk: Менеджери контексту в дужках

source: Using enclosing parentheses for continuation across multiple lines in context managers is now supported. This allows formatting a long collection of context managers in multiple lines in a similar way as it was previously possible with import statements. For instance, all these examples are now valid:
uk: Тепер підтримується використання круглих дужок для продовження в кількох рядках у контекстних менеджерах. Це дозволяє форматувати довгу колекцію контекстних менеджерів у кількох рядках подібним чином, як це було раніше можливо за допомогою операторів імпорту. Наприклад, тепер дійсні всі ці приклади:

source: it is also possible to use a trailing comma at the end of the enclosed group:
uk: також можна використовувати кінцеву кому в кінці закритої групи:

source: This new syntax uses the non LL(1) capacities of the new parser. Check :pep:`617` for more details.
uk: Цей новий синтаксис використовує можливості нового парсера, відмінні від LL(1). Щоб дізнатися більше, перевірте :pep:`617`.

source: (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`12782` and :issue:`40334`.)
uk: (Надано Гвідо ван Россумом, Пабло Галіндо та Лісандросом Ніколау в :issue:`12782` і :issue:`40334`.)

source: Better error messages
uk: Кращі повідомлення про помилки

source: When parsing code that contains unclosed parentheses or brackets the interpreter now includes the location of the unclosed bracket of parentheses instead of displaying *SyntaxError: unexpected EOF while parsing* or pointing to some incorrect location. For instance, consider the following code (notice the unclosed '{'):
uk: Під час синтаксичного аналізу коду, який містить незакриті дужки або дужки, інтерпретатор тепер включає розташування незакритих дужок замість відображення *SyntaxError: unexpected EOF while parsing* або вказівки на деяке неправильне розташування. Наприклад, розглянемо такий код (зверніть увагу на незакритий '{'):

source: Previous versions of the interpreter reported confusing places as the location of the syntax error:
uk: Попередні версії інтерпретатора повідомляли про незрозумілі місця як розташування синтаксичної помилки:

source: but in Python 3.10 a more informative error is emitted:
uk: але в Python 3.10 видається більш інформативна помилка:

source: In a similar way, errors involving unclosed string literals (single and triple quoted) now point to the start of the string instead of reporting EOF/EOL.
uk: Подібним чином помилки, пов’язані з незакритими рядковими літералами (в одинарних і потрійних лапках), тепер вказують на початок рядка, а не повідомляють EOF/EOL.

source: These improvements are inspired by previous work in the PyPy interpreter.
uk: Ці вдосконалення натхненні попередньою роботою над інтерпретатором PyPy.

source: (Contributed by Pablo Galindo in :issue:`42864` and Batuhan Taskaya in :issue:`40176`.)
uk: (Надано Пабло Галіндо в :issue:`42864` і Батухан Таская в :issue:`40176`.)

source: :exc:`SyntaxError` exceptions raised by the interpreter will now highlight the full error range of the expression that constitutes the syntax error itself, instead of just where the problem is detected. In this way, instead of displaying (before Python 3.10):
uk: Винятки :exc:`SyntaxError`, викликані інтерпретатором, тепер висвітлюватимуть повний діапазон помилок виразу, який становить саму синтаксичну помилку, а не лише місце виявлення проблеми. Таким чином, замість відображення (до Python 3.10):

source: now Python 3.10 will display the exception as:
uk: тепер Python 3.10 відображатиме виняток як:

source: This improvement was contributed by Pablo Galindo in :issue:`43914`.
uk: Це вдосконалення вніс Пабло Галіндо в :issue:`43914`.

source: A considerable amount of new specialized messages for :exc:`SyntaxError` exceptions have been incorporated. Some of the most notable ones are as follows:
uk: Було включено значну кількість нових спеціалізованих повідомлень для винятків :exc:`SyntaxError`. Ось деякі з найпомітніших:

source: Missing ``:`` before blocks:
uk: Відсутній ``:`` перед блоками:

source: (Contributed by Pablo Galindo in :issue:`42997`)
uk: (Надав Пабло Галіндо в :issue:`42997`)

source: Unparenthesised tuples in comprehensions targets:
uk: Кортежі без дужок у цілях розуміння:

source: (Contributed by Pablo Galindo in :issue:`43017`)
uk: (Надав Пабло Галіндо в :issue:`43017`)

source: Missing commas in collection literals and between expressions:
uk: Відсутні коми в літералах колекції та між виразами:

source: (Contributed by Pablo Galindo in :issue:`43822`)
uk: (Надав Пабло Галіндо в :issue:`43822`)

source: Multiple Exception types without parentheses:
uk: Кілька типів винятків без дужок:

source: (Contributed by Pablo Galindo in :issue:`43149`)
uk: (Надав Пабло Галіндо в :issue:`43149`)

source: Missing ``:`` and values in dictionary literals:
uk: Відсутні ``:`` і значення в літералах словника:

source: (Contributed by Pablo Galindo in :issue:`43823`)
uk: (Надав Пабло Галіндо в :issue:`43823`)

source: ``try`` blocks without ``except`` or ``finally`` blocks:
uk: блоки ``try`` без блоків ``except`` або ``finally``:

source: (Contributed by Pablo Galindo in :issue:`44305`)
uk: (Надав Пабло Галіндо в :issue:`44305`)

source: Usage of ``=`` instead of ``==`` in comparisons:
uk: Використання ``=`` замість ``==`` у порівняннях:

source: (Contributed by Pablo Galindo in :issue:`43797`)
uk: (Надав Пабло Галіндо в :issue:`43797`)

source: Usage of ``*`` in f-strings:
uk: Використання ``*`` у f-рядках:

source: (Contributed by Pablo Galindo in :issue:`41064`)
uk: (Надав Пабло Галіндо в :issue:`41064`)

source: Many :exc:`IndentationError` exceptions now have more context regarding what kind of block was expecting an indentation, including the location of the statement:
uk: Багато винятків :exc:`IndentationError` тепер мають більше контексту щодо того, який тип блоку очікував відступу, включаючи розташування оператора:

source: When printing :exc:`AttributeError`, :c:func:`PyErr_Display` will offer suggestions of similar attribute names in the object that the exception was raised from:
uk: Під час друку :exc:`AttributeError`, :c:func:`PyErr_Display` запропонує подібні назви атрибутів в об’єкті, з якого було викликано виключення:

source: (Contributed by Pablo Galindo in :issue:`38530`.)
uk: (Надав Пабло Галіндо в :issue:`38530`.)

source: Notice this won't work if :c:func:`PyErr_Display` is not called to display the error which can happen if some other custom error display function is used. This is a common scenario in some REPLs like IPython.
uk: Зауважте, що це не працюватиме, якщо :c:func:`PyErr_Display` не викликається для відображення помилки, що може статися, якщо використовується якась інша функція відображення помилок. Це поширений сценарій у деяких REPL, таких як IPython.

source: When printing :exc:`NameError` raised by the interpreter, :c:func:`PyErr_Display` will offer suggestions of similar variable names in the function that the exception was raised from:
uk: Під час друку :exc:`NameError`, викликаного інтерпретатором, :c:func:`PyErr_Display` запропонує пропозиції подібних імен змінних у функції, з якої було викликано виняток:

source: Notice this won't work if :c:func:`PyErr_Display` is not called to display the error, which can happen if some other custom error display function is used. This is a common scenario in some REPLs like IPython.
uk: Зауважте, що це не спрацює, якщо :c:func:`PyErr_Display` не викликається для відображення помилки, що може статися, якщо використовується інша функція відображення помилок. Це поширений сценарій у деяких REPL, таких як IPython.

source: PEP 626: Precise line numbers for debugging and other tools
uk: PEP 626: точні номери рядків для налагодження та інших інструментів

source: PEP 626 brings more precise and reliable line numbers for debugging, profiling and coverage tools. Tracing events, with the correct line number, are generated for all lines of code executed and only for lines of code that are executed.
uk: PEP 626 надає більш точні та надійні номери рядків для інструментів налагодження, профілювання та покриття. Події трасування з правильним номером рядка генеруються для всіх виконаних рядків коду та лише для рядків коду, які виконуються.

source: The ``f_lineno`` attribute of frame objects will always contain the expected line number.
uk: Атрибут ``f_lineno`` об’єктів кадру завжди міститиме очікуваний номер рядка.

source: The ``co_lnotab`` attribute of code objects is deprecated and will be removed in 3.12. Code that needs to convert from offset to line number should use the new ``co_lines()`` method instead.
uk: Атрибут ``co_lnotab`` об'єктів коду застарів і буде видалено в 3.12. Код, який потребує перетворення зсуву на номер рядка, має замість цього використовувати новий метод ``co_lines()``.

source: PEP 634: Structural Pattern Matching
uk: PEP 634: Зіставлення структурних шаблонів

source: Structural pattern matching has been added in the form of a *match statement* and *case statements* of patterns with associated actions. Patterns consist of sequences, mappings, primitive data types as well as class instances. Pattern matching enables programs to extract information from complex data types, branch on the structure of data, and apply specific actions based on different forms of data.
uk: Зіставлення структурних шаблонів було додано у формі *операторів відповідності* та *операторів case* шаблонів із пов’язаними діями. Патерни складаються з послідовностей, відображень, примітивних типів даних, а також екземплярів класу. Зіставлення шаблонів дозволяє програмам отримувати інформацію зі складних типів даних, розгалужувати структуру даних і застосовувати певні дії на основі різних форм даних.

source: Syntax and operations
uk: Синтаксис та операції

source: The generic syntax of pattern matching is::
uk: Загальний синтаксис зіставлення шаблонів:

source: A match statement takes an expression and compares its value to successive patterns given as one or more case blocks. Specifically, pattern matching operates by:
uk: Інструкція збігу приймає вираз і порівнює його значення з послідовними шаблонами, поданими як один або більше блоків регістру. Зокрема, зіставлення шаблонів працює за допомогою:

source: using data with type and shape (the ``subject``)
uk: використання даних із типом і формою (``тема``)

source: evaluating the ``subject`` in the ``match`` statement
uk: оцінка ``підмета`` в ``match`` заяві

source: comparing the subject with each pattern in a ``case`` statement from top to bottom until a match is confirmed.
uk: порівняння суб’єкта з кожним шаблоном у операторі ``case`` зверху вниз, доки відповідність не буде підтверджено.

source: executing the action associated with the pattern of the confirmed match
uk: виконання дії, пов’язаної з шаблоном підтвердженого збігу

source: If an exact match is not confirmed, the last case, a wildcard ``_``, if provided, will be used as the matching case. If an exact match is not confirmed and a wildcard case does not exist, the entire match block is a no-op.
uk: Якщо точний збіг не підтверджено, останній регістр, символ підстановки ``_``, якщо він наданий, буде використано як відповідний регістр. Якщо точний збіг не підтверджено, а регістр символів підстановки не існує, весь блок збігів є безопераційним.

source: Declarative approach
uk: Декларативний підхід

source: Readers may be aware of pattern matching through the simple example of matching a subject (data object) to a literal (pattern) with the switch statement found in C, Java or JavaScript (and many other languages). Often the switch statement is used for comparison of an object/expression with case statements containing literals.
uk: Читачі можуть знати про зіставлення шаблонів на простому прикладі зіставлення суб’єкта (об’єкта даних) з літералом (шаблоном) за допомогою оператора switch, знайденого в C, Java чи JavaScript (і багатьох інших мовах). Часто оператор switch використовується для порівняння об’єкта/виразу з операторами case, що містять літерали.

source: More powerful examples of pattern matching can be found in languages such as Scala and Elixir. With structural pattern matching, the approach is "declarative" and explicitly states the conditions (the patterns) for data to match.
uk: Більш потужні приклади зіставлення шаблонів можна знайти в таких мовах, як Scala та Elixir. При зіставленні структурних шаблонів підхід є "декларативним" і явно визначає умови (шаблони) для збігу даних.

source: While an "imperative" series of instructions using nested "if" statements could be used to accomplish something similar to structural pattern matching, it is less clear than the "declarative" approach. Instead the "declarative" approach states the conditions to meet for a match and is more readable through its explicit patterns. While structural pattern matching can be used in its simplest form comparing a variable to a literal in a case statement, its true value for Python lies in its handling of the subject's type and shape.
uk: Хоча "імперативна" серія інструкцій із використанням вкладених операторів "if" може бути використана для виконання чогось подібного до зіставлення структурного шаблону, вона менш зрозуміла, ніж "декларативний" підхід. Натомість "декларативний" підхід визначає умови, які необхідно виконати для збігу, і його легше читати через його явні шаблони. У той час як зіставлення структурних шаблонів можна використовувати в його найпростішій формі, порівнюючи змінну з літералом у операторі case, його справжня цінність для Python полягає в його обробці типу та форми суб’єкта.

source: Simple pattern: match to a literal
uk: Простий шаблон: відповідність літералу

source: Let's look at this example as pattern matching in its simplest form: a value, the subject, being matched to several literals, the patterns. In the example below, ``status`` is the subject of the match statement. The patterns are each of the case statements, where literals represent request status codes. The associated action to the case is executed after a match::
uk: Давайте розглянемо цей приклад як зіставлення шаблону в його найпростішій формі: значення, суб’єкт, який зіставляється з кількома літералами, шаблонами. У наведеному нижче прикладі ``status`` є предметом оператора відповідності. Шаблони є кожним із операторів case, де літерали представляють коди статусу запиту. Пов’язана дія з інцидентом виконується після збігу::

source: If the above function is passed a ``status`` of 418, "I'm a teapot" is returned. If the above function is passed a ``status`` of 500, the case statement with ``_`` will match as a wildcard, and "Something's wrong with the internet" is returned. Note the last block: the variable name, ``_``, acts as a *wildcard* and insures the subject will always match. The use of ``_`` is optional.
uk: Якщо наведеній вище функції передається ``статус`` 418, повертається "Я чайник". Якщо наведеній вище функції передано ``статус`` 500, оператор case з ``_`` відповідатиме як символ підстановки, і буде повернено "Щось не так з Інтернетом". Зверніть увагу на останній блок: назва змінної, ``_``, діє як *знак підстановки* і гарантує, що тема завжди збігатиметься. Використання ``_`` необов'язкове.

source: You can combine several literals in a single pattern using ``|`` ("or")::
uk: Ви можете поєднати кілька літералів в одному шаблоні за допомогою ``|`` ("або")::

source: Behavior without the wildcard
uk: Поведінка без символу підстановки

source: If we modify the above example by removing the last case block, the example becomes::
uk: Якщо ми змінимо наведений вище приклад, видаливши останній блок case, приклад стане::

source: Without the use of ``_`` in a case statement, a match may not exist. If no match exists, the behavior is a no-op. For example, if ``status`` of 500 is passed, a no-op occurs.
uk: Без використання ``_`` в операторі case збіг може не існувати. Якщо відповідності немає, поведінка є безопераційною. Наприклад, якщо передано ``статус`` 500, виникає помилка.

source: Patterns with a literal and variable
uk: Патерни з літералом і змінною

source: Patterns can look like unpacking assignments, and a pattern may be used to bind variables. In this example, a data point can be unpacked to its x-coordinate and y-coordinate::
uk: Патерни можуть виглядати як завдання розпакування, і шаблон може використовуватися для зв’язування змінних. У цьому прикладі точку даних можна розпакувати до її координати x і y:

source: The first pattern has two literals, ``(0, 0)``, and may be thought of as an extension of the literal pattern shown above. The next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
uk: Перший шаблон містить два літерали, ``(0, 0)``, і його можна вважати розширенням літерального шаблону, показаного вище. Наступні два шаблони поєднують літерал і змінну, а змінна *зв’язує* значення з теми (``точка``). Четвертий шаблон фіксує два значення, що робить його концептуально подібним до призначення розпакування ``(x, y) = point``.

source: Patterns and classes
uk: Шаблони та класи

source: If you are using classes to structure your data, you can use as a pattern the class name followed by an argument list resembling a constructor. This pattern has the ability to capture class attributes into variables::
uk: Якщо ви використовуєте класи для структурування своїх даних, ви можете використовувати як шаблон назву класу, за якою слідує список аргументів, схожий на конструктор. Цей шаблон має можливість захоплювати атрибути класу в змінні::

source: Patterns with positional parameters
uk: Патерни з позиційними параметрами

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
uk: Ви можете використовувати позиційні параметри з деякими вбудованими класами, які забезпечують порядок для своїх атрибутів (наприклад, класи даних). Ви також можете визначити конкретну позицію для атрибутів у шаблонах, встановивши спеціальний атрибут ``__match_args__`` у своїх класах. Якщо для нього встановлено значення ("x", "y"), усі наступні шаблони еквівалентні (і всі прив'язують атрибут ``y`` до змінної ``var``):

source: Nested patterns
uk: Вкладені візерунки

source: Patterns can be arbitrarily nested. For example, if our data is a short list of points, it could be matched like this::
uk: Візерунки можуть бути довільно вкладеними. Наприклад, якщо наші дані є коротким списком точок, їх можна зіставити так:

source: Complex patterns and the wildcard
uk: Складні візерунки та символ підстановки

source: To this point, the examples have used ``_`` alone in the last case statement. A wildcard can be used in more complex patterns, such as ``('error', code, _)``. For example::
uk: До цього моменту приклади використовували лише ``_`` в останньому операторі case. Символ узагальнення можна використовувати в більш складних шаблонах, наприклад ``('помилка', код, _)``. Наприклад::

source: In the above case, ``test_variable`` will match for ('error', code, 100) and ('error', code, 800).
uk: У наведеному вище випадку ``test_variable`` відповідатиме ('error', code, 100) і ('error', code, 800).

source: Guard
uk: Охоронець

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
uk: Ми можемо додати умову ``if`` до шаблону, відомого як "guard". Якщо guard false, ``match`` переходить до наступного блоку case. Зауважте, що захоплення значення відбувається до оцінки захисника:

source: Other Key Features
uk: Інші ключові функції

source: Several other key features:
uk: Кілька інших ключових функцій:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. Technically, the subject must be a sequence. Therefore, an important exception is that patterns don't match iterators. Also, to prevent a common mistake, sequence patterns don't match strings.
uk: Подібно до завдань розпакування, шаблони кортежу та списку мають однакове значення та фактично відповідають довільним послідовностям. Технічно предмет має бути послідовністю. Таким чином, важливим винятком є те, що шаблони не відповідають ітераторам. Також, щоб запобігти типовій помилці, шаблони послідовності не збігаються з рядками.
