Repository: python/python-docs-uk
Catalog: whatsnew/3.10.po
Languages: uk

source: Sequence patterns support wildcards: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to wildcards in unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
uk: Шаблони послідовності підтримують символи підстановки: ``[x, y, *rest]`` і ``(x, y, *rest)`` працюють подібно до символів підстановки під час розпакування призначень. Ім’я після ``*`` також може бути ``_``, тому ``(x, y, *_)`` відповідає послідовності принаймні двох елементів без зв’язування решти елементів.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dict. Unlike sequence patterns, extra keys are ignored. A wildcard ``**rest`` is also supported. (But ``**_`` would be redundant, so is not allowed.)
uk: Шаблони зіставлення: ``{"bandwidth": b, "latency": l}`` фіксує значення ``"bandwidth"`` і ``"latency"`` з dict. На відміну від шаблонів послідовності, додаткові ключі ігноруються. Також підтримується символ підстановки ``**rest``. (Але ``**_`` буде зайвим, тому не дозволено.)

source: Subpatterns may be captured using the ``as`` keyword::
uk: Підшаблони можуть бути захоплені за допомогою ключового слова ``as``::

source: This binds x1, y1, x2, y2 like you would expect without the ``as`` clause, and p2 to the entire second item of the subject.
uk: Це прив’язує x1, y1, x2, y2, як ви очікуєте без пропозиції ``as``, і p2 до всього другого елемента теми.

source: Most literals are compared by equality. However, the singletons ``True``, ``False`` and ``None`` are compared by identity.
uk: Більшість літералів порівнюються за рівністю. Однак синглетони ``True``, ``False`` і ``None`` порівнюються за тотожністю.

source: Named constants may be used in patterns. These named constants must be dotted names to prevent the constant from being interpreted as a capture variable::
uk: У шаблонах можна використовувати іменовані константи. Ці іменовані константи повинні бути розділені крапками, щоб запобігти інтерпретації константи як змінної захоплення:

source: For the full specification see :pep:`634`. Motivation and rationale are in :pep:`635`, and a longer tutorial is in :pep:`636`.
uk: Повну специфікацію див. :pep:`634`. Мотивація та обґрунтування знаходяться в :pep:`635`, а довший підручник у :pep:`636`.

source: Optional ``EncodingWarning`` and ``encoding="locale"`` option
uk: Додатковий параметр ``EncodingWarning`` і ``encoding="locale"``

source: The default encoding of :class:`TextIOWrapper` and :func:`open` is platform and locale dependent. Since UTF-8 is used on most Unix platforms, omitting ``encoding`` option when opening UTF-8 files (e.g. JSON, YAML, TOML, Markdown) is a very common bug. For example::
uk: Стандартне кодування :class:`TextIOWrapper` і :func:`open` залежить від платформи та локалі. Оскільки UTF-8 використовується на більшості платформ Unix, пропуск параметра ``encoding`` під час відкриття файлів UTF-8 (наприклад, JSON, YAML, TOML, Markdown) є дуже поширеною помилкою. Наприклад::

source: To find this type of bug, an optional ``EncodingWarning`` is added. It is emitted when :data:`sys.flags.warn_default_encoding <sys.flags>` is true and locale-specific default encoding is used.
uk: Щоб знайти цей тип помилки, додається необов’язкове ``EncodingWarning``. Він видається, коли :data:`sys.flags.warn_default_encoding <sys.flags>` має значення true і використовується кодування за замовчуванням, що залежить від локалі.

source: ``-X warn_default_encoding`` option and :envvar:`PYTHONWARNDEFAULTENCODING` are added to enable the warning.
uk: Опція ``-X warn_default_encoding`` і :envvar:`PYTHONWARNDEFAULTENCODING` додано, щоб увімкнути попередження.

source: See :ref:`io-text-encoding` for more information.
uk: Перегляньте :ref:`io-text-encoding` для отримання додаткової інформації.

source: New Features Related to Type Hints
uk: Нові функції, пов’язані з підказками типу

source: This section covers major changes affecting :pep:`484` type hints and the :mod:`typing` module.
uk: У цьому розділі розглядаються основні зміни, що стосуються підказок типу :pep:`484` і модуля :mod:`typing`.

source: PEP 604: New Type Union Operator
uk: PEP 604: Оператор союзу нового типу

source: A new type union operator was introduced which enables the syntax ``X | Y``. This provides a cleaner way of expressing 'either type X or type Y' instead of using :data:`typing.Union`, especially in type hints.
uk: Було представлено новий оператор об’єднання типу, який увімкнув синтаксис ``X | Y``. Це забезпечує чіткіший спосіб вираження "або типу X, або типу Y" замість використання :data:`typing.Union`, особливо у підказках типу.

source: In previous versions of Python, to apply a type hint for functions accepting arguments of multiple types, :data:`typing.Union` was used::
uk: У попередніх версіях Python для застосування підказки типу для функцій, які приймають аргументи кількох типів, використовувався :data:`typing.Union`::

source: Type hints can now be written in a more succinct manner::
uk: Підказки щодо типів тепер можна писати стисло:

source: This new syntax is also accepted as the second argument to :func:`isinstance` and :func:`issubclass`::
uk: Цей новий синтаксис також приймається як другий аргумент для :func:`isinstance` і :func:`issubclass`::

source: See :ref:`types-union` and :pep:`604` for more details.
uk: Дивіться :ref:`types-union` і :pep:`604` для отримання додаткової інформації.

source: (Contributed by Maggie Moss and Philippe Prados in :issue:`41428`, with additions by Yurii Karabas and Serhiy Storchaka in :issue:`44490`.)
uk: (Надано Меггі Мосс і Філіпом Прадосом у :issue:`41428`, з доповненнями Юрія Карабаса та Сергія Сторчака в :issue:`44490`.)

source: PEP 612: Parameter Specification Variables
uk: PEP 612: Змінні специфікації параметрів

source: Two new options to improve the information provided to static type checkers for :pep:`484`\ 's ``Callable`` have been added to the :mod:`typing` module.
uk: До модуля :mod:`typing` було додано дві нові опції для покращення інформації, що надається до засобів перевірки статичних типів для :pep:`484`\ ``Callable``.

source: The first is the parameter specification variable. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. Examples of usage can be found in :class:`typing.ParamSpec`. Previously, there was no easy way to type annotate dependency of parameter types in such a precise manner.
uk: Перша - це змінна специфікації параметра. Вони використовуються для пересилання типів параметрів одного викликаного до іншого викликаного — шаблон, який зазвичай зустрічається у функціях вищого порядку та декораторах. Приклади використання можна знайти в :class:`typing.ParamSpec`. Раніше не було простого способу ввести анотацію залежності типів параметрів таким точним способом.

source: The second option is the new ``Concatenate`` operator. It's used in conjunction with parameter specification variables to type annotate a higher order callable which adds or removes parameters of another callable. Examples of usage can be found in :class:`typing.Concatenate`.
uk: Другий варіант — новий оператор ``Concatenate``. Він використовується в поєднанні зі змінними специфікації параметрів для введення анотації до викликаного вищого порядку, який додає або видаляє параметри іншого викликаного. Приклади використання можна знайти в :class:`typing.Concatenate`.

source: See :class:`typing.Callable`, :class:`typing.ParamSpec`, :class:`typing.Concatenate`, :class:`typing.ParamSpecArgs`, :class:`typing.ParamSpecKwargs`, and :pep:`612` for more details.
uk: Див. :class:`typing.Callable`, :class:`typing.ParamSpec`, :class:`typing.Concatenate`, :class:`typing.ParamSpecArgs`, :class:`typing.ParamSpecKwargs` і :pep:`612`, щоб дізнатися більше.

source: (Contributed by Ken Jin in :issue:`41559`, with minor enhancements by Jelle Zijlstra in :issue:`43783`. PEP written by Mark Mendoza.)
uk: (Надано Кеном Джином у :issue:`41559`, з незначними вдосконаленнями Джелле Зійлстра в :issue:`43783`. PEP написав Марк Мендоза.)

source: PEP 613: TypeAlias
uk: PEP 613: Псевдонім типу

source: :pep:`484` introduced the concept of type aliases, only requiring them to be top-level unannotated assignments. This simplicity sometimes made it difficult for type checkers to distinguish between type aliases and ordinary assignments, especially when forward references or invalid types were involved. Compare::
uk: :pep:`484` представив концепцію псевдонімів типів, лише вимагаючи, щоб вони були неанотованими призначеннями верхнього рівня. Ця простота іноді ускладнювала перевірку типів розрізняти псевдоніми типів і звичайні призначення, особливо коли були задіяні прямі посилання або недійсні типи. Порівняти::

source: Now the :mod:`typing` module has a special value :data:`TypeAlias` which lets you declare type aliases more explicitly::
uk: Тепер модуль :mod:`typing` має спеціальне значення :data:`TypeAlias`, яке дозволяє декларувати псевдоніми типів більш явно:

source: See :pep:`613` for more details.
uk: Дивіться :pep:`613` для більш детальної інформації.

source: (Contributed by Mikhail Golubev in :issue:`41923`.)
uk: (Надав Михайло Голубєв у :issue:`41923`.)

source: PEP 647: User-Defined Type Guards
uk: PEP 647: Охоронці типу, визначені користувачем

source: :data:`TypeGuard` has been added to the :mod:`typing` module to annotate type guard functions and improve information provided to static type checkers during type narrowing. For more information, please see :data:`TypeGuard`\ 's documentation, and :pep:`647`.
uk: :data:`TypeGuard` додано до модуля :mod:`typing`, щоб анотувати функції захисту типів і покращити інформацію, що надається до засобів перевірки статичних типів під час звуження типу. Щоб дізнатися більше, перегляньте документацію :data:`TypeGuard`\ і :pep:`647`.

source: (Contributed by Ken Jin and Guido van Rossum in :issue:`43766`. PEP written by Eric Traut.)
uk: (Надано Кеном Джином і Гвідо ван Россумом у :issue:`43766`. PEP написав Ерік Траут.)

source: Other Language Changes
uk: Інші зміни мови

source: The :class:`int` type has a new method :meth:`int.bit_count`, returning the number of ones in the binary expansion of a given integer, also known as the population count. (Contributed by Niklas Fiekas in :issue:`29882`.)
uk: Тип :class:`int` має новий метод :meth:`int.bit_count`, який повертає кількість одиниць у двійковому розширенні даного цілого числа, також відоме як кількість населення. (Надав Ніклас Фієкас у :issue:`29882`.)

source: The views returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` now all have a ``mapping`` attribute that gives a :class:`types.MappingProxyType` object wrapping the original dictionary. (Contributed by Dennis Sweeney in :issue:`40890`.)
uk: Представлення, що повертаються :meth:`dict.keys`, :meth:`dict.values` і :meth:`dict.items`, тепер усі мають атрибут ``mapping``, який дає :class:`types.MappingProxyType` об’єкт, що обгортає оригінальний словник. (Надав Денніс Суїні в :issue:`40890`.)

source: :pep:`618`: The :func:`zip` function now has an optional ``strict`` flag, used to require that all the iterables have an equal length.
uk: :pep:`618`: функція :func:`zip` тепер має додатковий прапорець ``strict``, який використовується для вимоги, щоб усі ітеровані елементи мали однакову довжину.

source: Builtin and extension functions that take integer arguments no longer accept :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). (Contributed by Serhiy Storchaka in :issue:`37999`.)
uk: Вбудовані функції та функції розширення, які приймають цілі аргументи, більше не приймають :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s та інші об’єкти, які можна перетворити на цілі числа лише з втратою (наприклад, що мають метод :meth:`~object.__int__`, але не мають методу :meth:`~object.__index__`). (Надав Сергій Сторчака в :issue:`37999`.)

source: If :func:`object.__ipow__` returns :const:`NotImplemented`, the operator will correctly fall back to :func:`object.__pow__` and :func:`object.__rpow__` as expected. (Contributed by Alex Shkop in :issue:`38302`.)
uk: Якщо :func:`object.__ipow__` повертає :const:`NotImplemented`, оператор правильно повернеться до :func:`object.__pow__` і :func:`object.__rpow__`, як очікувалося. (Надав Алекс Шкоп у :issue:`38302`.)

source: Assignment expressions can now be used unparenthesized within set literals and set comprehensions, as well as in sequence indexes (but not slices).
uk: Вирази присвоєння тепер можна використовувати без дужок у літералах набору та розуміння набору, а також в індексах послідовності (але не в зрізах).

source: Functions have a new ``__builtins__`` attribute which is used to look for builtin symbols when a function is executed, instead of looking into ``__globals__['__builtins__']``. The attribute is initialized from ``__globals__["__builtins__"]`` if it exists, else from the current builtins. (Contributed by Mark Shannon in :issue:`42990`.)
uk: Функції мають новий атрибут ``__builtins__``, який використовується для пошуку вбудованих символів під час виконання функції замість перегляду ``__globals__['__builtins__']``. Атрибут ініціалізується з ``__globals__["__builtins__"]``, якщо він існує, інакше з поточних вбудованих елементів. (Надав Марк Шеннон у :issue:`42990`.)

source: Two new builtin functions -- :func:`aiter` and :func:`anext` have been added to provide asynchronous counterparts to :func:`iter` and :func:`next`, respectively. (Contributed by Joshua Bronson, Daniel Pope, and Justin Wang in :issue:`31861`.)
uk: Дві нові вбудовані функції -- :func:`aiter` і :func:`anext` були додані, щоб забезпечити асинхронні відповідники :func:`iter` і :func:`next` відповідно. (Надано Джошуа Бронсоном, Деніелом Поупом і Джастіном Вангом у :issue:`31861`.)

source: Static methods (:func:`@staticmethod <staticmethod>`) and class methods (:func:`@classmethod <classmethod>`) now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__``, ``__annotations__``) and have a new ``__wrapped__`` attribute. Moreover, static methods are now callable as regular functions. (Contributed by Victor Stinner in :issue:`43682`.)
uk: Статичні методи (:func:`@staticmethod <staticmethod>`) і методи класу (:func:`@classmethod <classmethod>`) тепер успадковують атрибути методу (``__module__``, ``__name__``, ``__qualname__``, ``__doc__``, ``__annotations__``) і мають новий атрибут ``__wrapped__``. Крім того, статичні методи тепер можна викликати як звичайні функції. (Надав Віктор Стіннер у :issue:`43682`.)

source: Annotations for complex targets (everything beside ``simple name`` targets defined by :pep:`526`) no longer cause any runtime effects with ``from __future__ import annotations``. (Contributed by Batuhan Taskaya in :issue:`42737`.)
uk: Анотації для складних цілей (усі, окрім цілей ``простих імен``, визначених :pep:`526`) більше не викликають жодних ефектів під час виконання з ``from __future__ import anotations``. (Надано Batuhan Taskaya в :issue:`42737`.)

source: Class and module objects now lazy-create empty annotations dicts on demand. The annotations dicts are stored in the object’s ``__dict__`` for backwards compatibility. This improves the best practices for working with ``__annotations__``; for more information, please see :ref:`annotations-howto`. (Contributed by Larry Hastings in :issue:`43901`.)
uk: Об’єкти класів і модулів тепер відкладено створюють порожні анотації dicts на вимогу. Анотації dicts зберігаються в об’єкті ``__dict__`` для зворотної сумісності. Це покращує найкращі методи роботи з ``__annotations__``; для отримання додаткової інформації див. :ref:`annotations-howto`. (Надано Ларрі Гастінгсом у :issue:`43901`.)

source: Annotations consist of ``yield``, ``yield from``, ``await`` or named expressions are now forbidden under ``from __future__ import annotations`` due to their side effects. (Contributed by Batuhan Taskaya in :issue:`42725`.)
uk: Анотації, що складаються з ``yield``, ``yield from``, ``await`` або іменовані вирази тепер заборонені в ``from __future__ import анотаціях`` через їхні побічні ефекти. (Надано Batuhan Taskaya в :issue:`42725`.)

source: Usage of unbound variables, ``super()`` and other expressions that might alter the processing of symbol table as annotations are now rendered effectless under ``from __future__ import annotations``. (Contributed by Batuhan Taskaya in :issue:`42725`.)
uk: Використання незв’язаних змінних, ``super()`` та інших виразів, які можуть змінити обробку таблиці символів як анотацій, тепер стає неефективним у ``from __future__ import anotations``. (Надано Batuhan Taskaya в :issue:`42725`.)

source: Hashes of NaN values of both :class:`float` type and :class:`decimal.Decimal` type now depend on object identity. Formerly, they always hashed to ``0`` even though NaN values are not equal to one another. This caused potentially quadratic runtime behavior due to excessive hash collisions when creating dictionaries and sets containing multiple NaNs. (Contributed by Raymond Hettinger in :issue:`43475`.)
uk: Хеші значень NaN як типу :class:`float`, так і типу :class:`decimal.Decimal` тепер залежать від ідентичності об’єкта. Раніше вони завжди хешувалися до ``0``, навіть якщо значення NaN не дорівнюють одне одному. Це спричинило потенційно квадратичну поведінку під час виконання через надмірні хеш-колізії під час створення словників і наборів, що містять кілька NaN. (Надав Реймонд Геттінгер у :issue:`43475`.)

source: A :exc:`SyntaxError` (instead of a :exc:`NameError`) will be raised when deleting the :const:`__debug__` constant. (Contributed by Dong-hee Na in :issue:`45000`.)
uk: Під час видалення константи :const:`__debug__` виникне :exc:`SyntaxError` (замість :exc:`NameError`). (Надав Dong-hee Na у :issue:`45000`.)

source: :exc:`SyntaxError` exceptions now have ``end_lineno`` and ``end_offset`` attributes. They will be ``None`` if not determined. (Contributed by Pablo Galindo in :issue:`43914`.)
uk: Винятки :exc:`SyntaxError` тепер мають атрибути ``end_lineno`` і ``end_offset``. Вони будуть ``None``, якщо не визначено. (Надав Пабло Галіндо в :issue:`43914`.)

source: New Modules
uk: Нові модулі

source: None yet.
uk: Поки немає.

source: Improved Modules
uk: Покращені модулі

source: Add missing :meth:`~asyncio.events.AbstractEventLoop.connect_accepted_socket` method. (Contributed by Alex Grönholm in :issue:`41332`.)
uk: Додайте відсутній метод :meth:`~asyncio.events.AbstractEventLoop.connect_accepted_socket`. (Надав Алекс Грьонхольм у :issue:`41332`.)

source: Misleading phrase "optional arguments" was replaced with "options" in argparse help. Some tests might require adaptation if they rely on exact output match. (Contributed by Raymond Hettinger in :issue:`9694`.)
uk: Оманливу фразу "необов’язкові аргументи" було замінено на "параметри" в довідці argparse. Деякі тести можуть вимагати адаптації, якщо вони покладаються на точну вихідну відповідність. (Надав Реймонд Геттінгер у :issue:`9694`.)

source: array
uk: масив

source: The :meth:`~array.array.index` method of :class:`array.array` now has optional *start* and *stop* parameters. (Contributed by Anders Lorentsen and Zackery Spytz in :issue:`31956`.)
uk: Метод :meth:`~array.array.index` :class:`array.array` тепер має додаткові параметри *start* і *stop*. (Надано Андерсом Лоренценом і Закері Шпітцем у :issue:`31956`.)

source: These modules have been marked as deprecated in their module documentation since Python 3.6. An import-time :class:`DeprecationWarning` has now been added to all three of these modules.
uk: Починаючи з Python 3.6, ці модулі позначені як застарілі в документації модулів. До всіх цих трьох модулів тепер додано :class:`DeprecationWarning` під час імпорту.

source: base64
uk: база64

source: Add :func:`base64.b32hexencode` and :func:`base64.b32hexdecode` to support the Base32 Encoding with Extended Hex Alphabet.
uk: Додайте :func:`base64.b32hexencode` і :func:`base64.b32hexdecode` для підтримки кодування Base32 із розширеним шістнадцятковим алфавітом.

source: Add :meth:`~bdb.Breakpoint.clearBreakpoints` to reset all set breakpoints. (Contributed by Irit Katriel in :issue:`24160`.)
uk: Додайте :meth:`~bdb.Breakpoint.clearBreakpoints`, щоб скинути всі встановлені точки зупину. (Надано Іріт Катріель у :issue:`24160`.)

source: bisect
uk: ділимо навпіл

source: Added the possibility of providing a *key* function to the APIs in the :mod:`bisect` module. (Contributed by Raymond Hettinger in :issue:`4356`.)
uk: Додано можливість надання функції *key* для API в модулі :mod:`bisect`. (Надав Реймонд Геттінгер у :issue:`4356`.)

source: codecs
uk: кодеки

source: Add a :func:`codecs.unregister` function to unregister a codec search function. (Contributed by Hai Shi in :issue:`41842`.)
uk: Додайте функцію :func:`codecs.unregister`, щоб скасувати реєстрацію функції пошуку кодеків. (Надав Хай Ши в :issue:`41842`.)

source: collections.abc
uk: колекції.abc

source: The ``__args__`` of the :ref:`parameterized generic <types-genericalias>` for :class:`collections.abc.Callable` are now consistent with :data:`typing.Callable`. :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Note that a :exc:`TypeError` may be raised for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9. (Contributed by Ken Jin in :issue:`42195`.)
uk: ``__args__`` :ref:`параметризованого загального <types-genericalias>` для :class:`collections.abc.Callable` тепер узгоджується з :data:`typing.Callable`. :class:`collections.abc.Callable` generic тепер зводить параметри типу, подібно до того, що зараз робить :data:`typing.Callable`. Це означає, що ``collections.abc.Callable[[int, str], str]`` матиме ``__args__`` ``(int, str, str)``; раніше це було ``([int, str], str)``. Щоб дозволити цю зміну, :class:`types.GenericAlias` тепер можна створювати підкласи, і підклас повертатиметься під час підписки типу :class:`collections.abc.Callable`. Зауважте, що помилка :exc:`TypeError` може виникнути через неприпустимі форми параметризації :class:`collections.abc.Callable`, які могли пройти мовчки в Python 3.9. (Надав Кен Джин у :issue:`42195`.)

source: Add a :func:`contextlib.aclosing` context manager to safely close async generators and objects representing asynchronously released resources. (Contributed by Joongi Kim and John Belmonte in :issue:`41229`.)
uk: Додайте менеджер контексту :func:`contextlib.aclosing`, щоб безпечно закривати асинхронні генератори та об’єкти, що представляють асинхронно звільнені ресурси. (Надано Джунгі Кімом і Джоном Бельмонте в :issue:`41229`.)

source: Add asynchronous context manager support to :func:`contextlib.nullcontext`. (Contributed by Tom Gringauz in :issue:`41543`.)
uk: Додайте підтримку диспетчера асинхронного контексту до :func:`contextlib.nullcontext`. (Надав Том Грінгауз у :issue:`41543`.)

source: Add :class:`AsyncContextDecorator`, for supporting usage of async context managers as decorators.
uk: Додайте :class:`AsyncContextDecorator` для підтримки використання менеджерів асинхронного контексту як декораторів.

source: curses
uk: прокльони
