Repository: python/python-docs-uk
Catalog: whatsnew/3.10.po
Languages: uk

source: The ``loop`` parameter has been removed from most of :mod:`asyncio`\ 's :doc:`high-level API <../library/asyncio-api-index>` following deprecation in Python 3.8.
uk: Параметр ``loop`` було видалено з більшості :mod:`asyncio`\ :doc:`високорівневого API <../library/asyncio-api-index>` після застарілої версії Python 3.8.

source: A coroutine that currently looks like this::
uk: Співпрограма, яка зараз виглядає так::

source: Should be replaced with this::
uk: Слід замінити на це::

source: If ``foo()`` was specifically designed *not* to run in the current thread's running event loop (e.g. running in another thread's event loop), consider using :func:`asyncio.run_coroutine_threadsafe` instead.
uk: Якщо ``foo()`` був спеціально розроблений *не* для виконання в поточному циклі подій поточного потоку (наприклад, у циклі подій іншого потоку), подумайте про використання замість нього :func:`asyncio.run_coroutine_threadsafe`.

source: The :data:`types.FunctionType` constructor now inherits the current builtins if the *globals* dictionary has no ``"__builtins__"`` key, rather than using ``{"None": None}`` as builtins: same behavior as :func:`eval` and :func:`exec` functions. Defining a function with ``def function(...): ...`` in Python is not affected, globals cannot be overridden with this syntax: it also inherits the current builtins. (Contributed by Victor Stinner in :issue:`42990`.)
uk: Конструктор :data:`types.FunctionType` тепер успадковує поточні вбудовані елементи, якщо словник *globals* не має ключа ``"__builtins__"``, а не використовує ``{"None": None}`` як вбудовані елементи: те саме як функції :func:`eval` і :func:`exec`. Визначення функції за допомогою ``def function(...): ...`` у Python не впливає, глобальні значення не можна перевизначити за допомогою цього синтаксису: він також успадковує поточні вбудовані компоненти. (Надав Віктор Стіннер у :issue:`42990`.)

source: Changes in the C API
uk: Зміни в C API

source: The C API functions ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags``, ``PyNode_Compile`` and the type used by these functions, ``struct _node``, were removed due to the switch to the new PEG parser.
uk: Функції C API ``Parser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``Parser_SimpleParseFileFlags``, ``PyNode_Compile`` і тип, який використовується цими функціями, ``struct _node``, були видалені через перехід до новий аналізатор PEG.

source: Source should be now be compiled directly to a code object using, for example, :c:func:`Py_CompileString`. The resulting code object can then be evaluated using, for example, :c:func:`PyEval_EvalCode`.
uk: Початковий код тепер має бути скомпільований безпосередньо в об’єкт коду за допомогою, наприклад, :c:func:`Py_CompileString`. Потім отриманий об’єкт коду можна оцінити за допомогою, наприклад, :c:func:`PyEval_EvalCode`.

source: Specifically:
uk: зокрема:

source: A call to ``PyParser_SimpleParseStringFlags`` followed by ``PyNode_Compile`` can be replaced by calling :c:func:`Py_CompileString`.
uk: Виклик ``Parser_SimpleParseStringFlags`` з наступним ``PyNode_Compile`` можна замінити викликом :c:func:`Py_CompileString`.

source: There is no direct replacement for ``PyParser_SimpleParseFileFlags``. To compile code from a ``FILE *`` argument, you will need to read the file in C and pass the resulting buffer to :c:func:`Py_CompileString`.
uk: Немає прямої заміни для ``PyParser_SimpleParseFileFlags``. Щоб скомпілювати код із аргументу ``FILE *``, вам потрібно буде прочитати файл на C і передати отриманий буфер до :c:func:`Py_CompileString`.

source: To compile a file given a ``char *`` filename, explicitly open the file, read it and compile the result. One way to do this is using the :py:mod:`io` module with :c:func:`PyImport_ImportModule`, :c:func:`PyObject_CallMethod`, :c:func:`PyBytes_AsString` and :c:func:`Py_CompileString`, as sketched below. (Declarations and error handling are omitted.) ::
uk: Щоб скомпілювати файл із назвою ``char *``, явно відкрийте файл, прочитайте його та скомпілюйте результат. Одним із способів зробити це є використання модуля :py:mod:`io` з :c:func:`PyImport_ImportModule`, :c:func:`PyObject_CallMethod`, :c:func:`PyBytes_AsString` і :c:func:`Py_CompileString`, як показано нижче. (Оголошення та обробка помилок опущено.) ::

source: For ``FrameObject`` objects, the ``f_lasti`` member now represents a wordcode offset instead of a simple offset into the bytecode string. This means that this number needs to be multiplied by 2 to be used with APIs that expect a byte offset instead (like :c:func:`PyCode_Addr2Line` for example). Notice as well that the ``f_lasti`` member of ``FrameObject`` objects is not considered stable: please use :c:func:`PyFrame_GetLineNumber` instead.
uk: Для об’єктів ``FrameObject`` член ``f_lasti`` тепер представляє зсув wordcode замість простого зміщення в рядку байт-коду. Це означає, що це число потрібно помножити на 2, щоб використовувати його з API, які замість цього очікують зміщення байтів (наприклад, :c:func:`PyCode_Addr2Line`). Також зауважте, що член ``f_lasti`` об’єктів ``FrameObject`` не вважається стабільним: використовуйте замість нього :c:func:`PyFrame_GetLineNumber`.

source: CPython bytecode changes
uk: Зміни байт-коду CPython

source: The ``MAKE_FUNCTION`` instruction now accepts either a dict or a tuple of strings as the function's annotations. (Contributed by Yurii Karabas and Inada Naoki in :issue:`42202`)
uk: Інструкція ``MAKE_FUNCTION`` тепер приймає або dict, або кортеж рядків як анотації функції. (Надано Юрієм Карабасом та Інадою Наокі в :issue:`42202`)

source: Build Changes
uk: Зміни збірки

source: :pep:`644`: Python now requires OpenSSL 1.1.1 or newer. OpenSSL 1.0.2 is no longer supported. (Contributed by Christian Heimes in :issue:`43669`.)
uk: :pep:`644`: Python тепер вимагає OpenSSL 1.1.1 або новішої версії. OpenSSL 1.0.2 більше не підтримується. (Надав Крістіан Хеймс у :issue:`43669`.)

source: The C99 functions :c:func:`snprintf` and :c:func:`vsnprintf` are now required to build Python. (Contributed by Victor Stinner in :issue:`36020`.)
uk: Функції C99 :c:func:`snprintf` і :c:func:`vsnprintf` тепер потрібні для створення Python. (Надав Віктор Стіннер у :issue:`36020`.)

source: :mod:`sqlite3` requires SQLite 3.7.15 or higher. (Contributed by Sergey Fedoseev and Erlend E. Aasland in :issue:`40744` and :issue:`40810`.)
uk: :mod:`sqlite3` вимагає SQLite 3.7.15 або новішої версії. (Надано Сергієм Федосєєвим та Ерлендом Е. Асландом у :issue:`40744` та :issue:`40810`.)

source: The :mod:`atexit` module must now always be built as a built-in module. (Contributed by Victor Stinner in :issue:`42639`.)
uk: Модуль :mod:`atexit` тепер завжди має створюватися як вбудований модуль. (Надав Віктор Стіннер у :issue:`42639`.)

source: Add :option:`--disable-test-modules` option to the ``configure`` script: don't build nor install test modules. (Contributed by Xavier de Gaye, Thomas Petazzoni and Peixing Xin in :issue:`27640`.)
uk: Додайте параметр :option:`--disable-test-modules` до сценарію ``configure``: не створюйте та не встановлюйте тестові модулі. (Надано Ксав’є де Гає, Томасом Петаццоні та Пейсін Сінь у :issue:`27640`.)

source: Add :option:`--with-wheel-pkg-dir=PATH option <--with-wheel-pkg-dir>` to the ``./configure`` script. If specified, the :mod:`ensurepip` module looks for ``setuptools`` and ``pip`` wheel packages in this directory: if both are present, these wheel packages are used instead of ensurepip bundled wheel packages.
uk: Додайте параметр :option:`--with-wheel-pkg-dir=PATH <--with-wheel-pkg-dir>` до сценарію ``./configure``. Якщо вказано, модуль :mod:`ensurepip` шукає пакети коліс ``setuptools`` і ``pip`` у цьому каталозі: якщо обидва присутні, ці пакунки колеса використовуються замість пакетів колес гарантійpip.

source: Some Linux distribution packaging policies recommend against bundling dependencies. For example, Fedora installs wheel packages in the ``/usr/share/python-wheels/`` directory and don't install the ``ensurepip._bundled`` package.
uk: Деякі політики упаковки дистрибутивів Linux рекомендують не об’єднувати залежності. Наприклад, Fedora встановлює пакети коліс у каталог ``/usr/share/python-wheels/`` і не встановлює пакет ``ensurepip._bundled``.

source: (Contributed by Victor Stinner in :issue:`42856`.)
uk: (Надав Віктор Стіннер у :issue:`42856`.)

source: Add a new :option:`configure --without-static-libpython option <--without-static-libpython>` to not build the ``libpythonMAJOR.MINOR.a`` static library and not install the ``python.o`` object file.
uk: Додайте нову опцію :option:`configure --without-static-libpython <--without-static-libpython>`, щоб не створювати статичну бібліотеку ``libpythonMAJOR.MINOR.a`` і не встановлювати об’єктний файл ``python.o``.

source: (Contributed by Victor Stinner in :issue:`43103`.)
uk: (Надав Віктор Стіннер у :issue:`43103`.)

source: The ``configure`` script now uses the ``pkg-config`` utility, if available, to detect the location of Tcl/Tk headers and libraries. As before, those locations can be explicitly specified with the :option:`--with-tcltk-includes` and :option:`--with-tcltk-libs` configuration options. (Contributed by Manolis Stamatogiannakis in :issue:`42603`.)
uk: Скрипт ``configure`` тепер використовує утиліту ``pkg-config`` якщо вона доступна, для визначення розташування заголовків Tcl/Tk і бібліотек. Як і раніше, ці розташування можна явно вказати за допомогою параметрів конфігурації :option:`--with-tcltk-includes` і :option:`--with-tcltk-libs`. (Надав Manolis Stamatogiannakis в :issue:`42603`.)

source: Add :option:`--with-openssl-rpath` option to ``configure`` script. The option simplifies building Python with a custom OpenSSL installation, e.g. ``./configure --with-openssl=/path/to/openssl --with-openssl-rpath=auto``. (Contributed by Christian Heimes in :issue:`43466`.)
uk: Додайте параметр :option:`--with-openssl-rpath` до сценарію ``configure``. Цей параметр спрощує створення Python за допомогою індивідуальної інсталяції OpenSSL, наприклад. ``./configure --with-openssl=/path/to/openssl --with-openssl-rpath=auto``. (Надав Крістіан Хеймс у :issue:`43466`.)

source: C API Changes
uk: Зміни C API

source: PEP 652: Maintaining the Stable ABI
uk: PEP 652: Підтримка стабільного ABI

source: The Stable ABI (Application Binary Interface) for extension modules or embedding Python is now explicitly defined. :ref:`stable` describes C API and ABI stability guarantees along with best practices for using the Stable ABI.
uk: Стабільний ABI (двійковий інтерфейс програми) для модулів розширення або вбудовування Python тепер визначено явно. :ref:`stable` описує гарантії стабільності C API та ABI разом із найкращими методами використання стабільного ABI.

source: (Contributed by Petr Viktorin in :pep:`652` and :issue:`43795`.)
uk: (Надав Петр Вікторін у :pep:`652` і :issue:`43795`.)

source: The result of :c:func:`PyNumber_Index` now always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``. (Contributed by Serhiy Storchaka in :issue:`40792`.)
uk: Результат :c:func:`PyNumber_Index` тепер завжди має точний тип :class:`int`. Раніше результат міг бути екземпляром підкласу ``int``. (Надав Сергій Сторчака в :issue:`40792`.)

source: Add a new :c:member:`~PyConfig.orig_argv` member to the :c:type:`PyConfig` structure: the list of the original command line arguments passed to the Python executable. (Contributed by Victor Stinner in :issue:`23427`.)
uk: Додайте новий член :c:member:`~PyConfig.orig_argv` до структури :c:type:`PyConfig`: список оригінальних аргументів командного рядка, переданих у виконуваний файл Python. (Надав Віктор Стіннер у :issue:`23427`.)

source: The :c:func:`PyDateTime_DATE_GET_TZINFO` and :c:func:`PyDateTime_TIME_GET_TZINFO` macros have been added for accessing the ``tzinfo`` attributes of :class:`datetime.datetime` and :class:`datetime.time` objects. (Contributed by Zackery Spytz in :issue:`30155`.)
uk: Додано макроси :c:func:`PyDateTime_DATE_GET_TZINFO` і :c:func:`PyDateTime_TIME_GET_TZINFO` для доступу до атрибутів ``tzinfo`` об'єктів :class:`datetime.datetime` і :class:`datetime.time` . (Надав Закері Шпітц у :issue:`30155`.)

source: Add a :c:func:`PyCodec_Unregister` function to unregister a codec search function. (Contributed by Hai Shi in :issue:`41842`.)
uk: Додайте функцію :c:func:`PyCodec_Unregister`, щоб скасувати реєстрацію функції пошуку кодеків. (Надав Хай Ши в :issue:`41842`.)

source: The :c:func:`PyIter_Send` function was added to allow sending value into iterator without raising ``StopIteration`` exception. (Contributed by Vladimir Matveev in :issue:`41756`.)
uk: Функцію :c:func:`PyIter_Send` було додано, щоб дозволити надсилати значення в ітератор без виклику винятку ``StopIteration``. (Надав Володимир Матвєєв у :issue:`41756`.)

source: Add :c:func:`PyUnicode_AsUTF8AndSize` to the limited C API. (Contributed by Alex Gaynor in :issue:`41784`.)
uk: Додайте :c:func:`PyUnicode_AsUTF8AndSize` до обмеженого C API. (Надав Алекс Гейнор у :issue:`41784`.)

source: Add :c:func:`PyModule_AddObjectRef` function: similar to :c:func:`PyModule_AddObject` but don't steal a reference to the value on success. (Contributed by Victor Stinner in :issue:`1635741`.)
uk: Додайте функцію :c:func:`PyModule_AddObjectRef`: схожу на :c:func:`PyModule_AddObject`, але не викрадайте посилання на значення в разі успіху. (Надав Віктор Стіннер у :issue:`1635741`.)

source: Add :c:func:`Py_NewRef` and :c:func:`Py_XNewRef` functions to increment the reference count of an object and return the object. (Contributed by Victor Stinner in :issue:`42262`.)
uk: Додайте функції :c:func:`Py_NewRef` і :c:func:`Py_XNewRef`, щоб збільшити кількість посилань на об’єкт і повернути об’єкт. (Надав Віктор Стіннер у :issue:`42262`.)

source: The :c:func:`PyType_FromSpecWithBases` and :c:func:`PyType_FromModuleAndSpec` functions now accept a single class as the *bases* argument. (Contributed by Serhiy Storchaka in :issue:`42423`.)
uk: Функції :c:func:`PyType_FromSpecWithBases` і :c:func:`PyType_FromModuleAndSpec` тепер приймають один клас як аргумент *bases*. (Надав Сергій Сторчака в :issue:`42423`.)

source: The :c:func:`PyType_FromModuleAndSpec` function now accepts NULL ``tp_doc`` slot. (Contributed by Hai Shi in :issue:`41832`.)
uk: Функція :c:func:`PyType_FromModuleAndSpec` тепер приймає NULL слот ``tp_doc``. (Надав Хай Ши в :issue:`41832`.)

source: The :c:func:`PyType_GetSlot` function can accept :ref:`static types <static-types>`. (Contributed by Hai Shi and Petr Viktorin in :issue:`41073`.)
uk: Функція :c:func:`PyType_GetSlot` може приймати :ref:`статичні типи <static-types>`. (Надано Хай Ши та Петром Вікторіним у :issue:`41073`.)

source: Add a new :c:func:`PySet_CheckExact` function to the C-API to check if an object is an instance of :class:`set` but not an instance of a subtype. (Contributed by Pablo Galindo in :issue:`43277`.)
uk: Додайте нову функцію :c:func:`PySet_CheckExact` до C-API, щоб перевірити, чи є об’єкт екземпляром :class:`set`, але не екземпляром підтипу. (Надав Пабло Галіндо в :issue:`43277`.)

source: Add :c:func:`PyErr_SetInterruptEx` which allows passing a signal number to simulate. (Contributed by Antoine Pitrou in :issue:`43356`.)
uk: Додайте :c:func:`PyErr_SetInterruptEx`, який дозволяє передавати номер сигналу для моделювання. (Надав Антуан Пітру в :issue:`43356`.)

source: The limited C API is now supported if :ref:`Python is built in debug mode <debug-build>` (if the ``Py_DEBUG`` macro is defined). In the limited C API, the :c:func:`Py_INCREF` and :c:func:`Py_DECREF` functions are now implemented as opaque function calls, rather than accessing directly the :c:member:`PyObject.ob_refcnt` member, if Python is built in debug mode and the ``Py_LIMITED_API`` macro targets Python 3.10 or newer. It became possible to support the limited C API in debug mode because the :c:type:`PyObject` structure is the same in release and debug mode since Python 3.8 (see :issue:`36465`).
uk: Обмежений C API тепер підтримується, якщо :ref:`Python зібрано в режимі налагодження <debug-build>` (якщо визначено макрос ``Py_DEBUG``). В обмеженому API C функції :c:func:`Py_INCREF` і :c:func:`Py_DECREF` тепер реалізовано як непрозорі виклики функцій, а не звертаються безпосередньо до члена :c:member:`PyObject.ob_refcnt`, якщо Python створено в режимі налагодження, а макрос ``Py_LIMITED_API`` націлений на Python 3.10 або новішу версію. Стало можливим підтримувати обмежений C API у режимі налагодження, оскільки структура :c:type:`PyObject` є однаковою в режимі випуску та налагодження, починаючи з Python 3.8 (див. :issue:`36465`).

source: The limited C API is still not supported in the :option:`--with-trace-refs` special build (``Py_TRACE_REFS`` macro). (Contributed by Victor Stinner in :issue:`43688`.)
uk: Обмежений C API досі не підтримується у спеціальній збірці :option:`--with-trace-refs` (макрос ``Py_TRACE_REFS``). (Надав Віктор Стіннер у :issue:`43688`.)

source: Add the :c:func:`Py_Is(x, y) <Py_Is>` function to test if the *x* object is the *y* object, the same as ``x is y`` in Python. Add also the :c:func:`Py_IsNone`, :c:func:`Py_IsTrue`, :c:func:`Py_IsFalse` functions to test if an object is, respectively, the ``None`` singleton, the ``True`` singleton or the ``False`` singleton. (Contributed by Victor Stinner in :issue:`43753`.)
uk: Додайте функцію :c:func:`Py_Is(x, y) <Py_Is>`, щоб перевірити, чи є об’єкт *x* об’єктом *y*, так само, як ``x is y`` у Python. Додайте також функції :c:func:`Py_IsNone`, :c:func:`Py_IsTrue`, :c:func:`Py_IsFalse`, щоб перевірити, чи є об’єкт відповідно синглетом ``None``, ``True`` singleton або ``False`` singleton. (Надав Віктор Стіннер у :issue:`43753`.)

source: Add new functions to control the garbage collector from C code: :c:func:`PyGC_Enable()`, :c:func:`PyGC_Disable()`, :c:func:`PyGC_IsEnabled()`. These functions allow to activate, deactivate and query the state of the garbage collector from C code without having to import the :mod:`gc` module.
uk: Додайте нові функції для керування збирачем сміття з коду C: :c:func:`PyGC_Enable()`, :c:func:`PyGC_Disable()`, :c:func:`PyGC_IsEnabled()`. Ці функції дозволяють активувати, деактивувати та запитувати стан збирача сміття з коду C без необхідності імпортувати модуль :mod:`gc`.

source: Add a new :c:data:`Py_TPFLAGS_DISALLOW_INSTANTIATION` type flag to disallow creating type instances. (Contributed by Victor Stinner in :issue:`43916`.)
uk: Додайте новий прапор типу :c:data:`Py_TPFLAGS_DISALLOW_INSTANTIATION`, щоб заборонити створення екземплярів типу. (Надав Віктор Стіннер у :issue:`43916`.)

source: Add a new :c:data:`Py_TPFLAGS_IMMUTABLETYPE` type flag for creating immutable type objects: type attributes cannot be set nor deleted. (Contributed by Victor Stinner and Erlend E. Aasland in :issue:`43908`.)
uk: Додайте новий прапор типу :c:data:`Py_TPFLAGS_IMMUTABLETYPE` для створення об’єктів незмінного типу: атрибути типу не можна встановити або видалити. (Надано Віктором Стіннером та Ерлендом Е. Асландом у :issue:`43908`.)

source: The ``PY_SSIZE_T_CLEAN`` macro must now be defined to use :c:func:`PyArg_ParseTuple` and :c:func:`Py_BuildValue` formats which use ``#``: ``es#``, ``et#``, ``s#``, ``u#``, ``y#``, ``z#``, ``U#`` and ``Z#``. See :ref:`Parsing arguments and building values <arg-parsing>` and the :pep:`353`. (Contributed by Victor Stinner in :issue:`40943`.)
uk: Тепер макрос ``PY_SSIZE_T_CLEAN`` має бути визначений для використання форматів :c:func:`PyArg_ParseTuple` і :c:func:`Py_BuildValue`, які використовують ``#``: ``es#``, ``et# ``, ``s#``, ``u#``, ``y#``, ``z#``, ``U#`` і ``Z#``. Перегляньте :ref:`Аргументи розбору та значення побудови <arg-parsing>` і :pep:`353`. (Надав Віктор Стіннер у :issue:`40943`.)

source: Since :c:func:`Py_REFCNT()` is changed to the inline static function, ``Py_REFCNT(obj) = new_refcnt`` must be replaced with ``Py_SET_REFCNT(obj, new_refcnt)``: see :c:func:`Py_SET_REFCNT()` (available since Python 3.9). For backward compatibility, this macro can be used::
uk: Оскільки :c:func:`Py_REFCNT()` змінено на вбудовану статичну функцію, ``Py_REFCNT(obj) = new_refcnt`` потрібно замінити на ``Py_SET_REFCNT(obj, new_refcnt)``: див. :c:func:`Py_SET_REFCNT()` (доступний з Python 3.9). Для зворотної сумісності можна використовувати цей макрос:

source: (Contributed by Victor Stinner in :issue:`39573`.)
uk: (Надав Віктор Стіннер у :issue:`39573`.)

source: Calling :c:func:`PyDict_GetItem` without :term:`GIL` held had been allowed for historical reason. It is no longer allowed. (Contributed by Victor Stinner in :issue:`40839`.)
uk: Виклик :c:func:`PyDict_GetItem` без утримання :term:`GIL` був дозволений з історичних причин. Це більше не дозволено. (Надав Віктор Стіннер у :issue:`40839`.)

source: ``PyUnicode_FromUnicode(NULL, size)`` and ``PyUnicode_FromStringAndSize(NULL, size)`` raise ``DeprecationWarning`` now. Use :c:func:`PyUnicode_New` to allocate Unicode object without initial data. (Contributed by Inada Naoki in :issue:`36346`.)
uk: ``PyUnicode_FromUnicode(NULL, розмір)`` і ``PyUnicode_FromStringAndSize(NULL, розмір)`` викликають ``DeprecationWarning`` зараз. Використовуйте :c:func:`PyUnicode_New`, щоб виділити об’єкт Unicode без початкових даних. (Надано Інадою Наокі в :issue:`36346`.)

source: The private ``_PyUnicode_Name_CAPI`` structure of the PyCapsule API ``unicodedata.ucnhash_CAPI`` has been moved to the internal C API. (Contributed by Victor Stinner in :issue:`42157`.)
uk: Приватну структуру ``_PyUnicode_Name_CAPI`` API PyCapsule ``unicodedata.ucnhash_CAPI`` було переміщено до внутрішнього API C. (Надав Віктор Стіннер у :issue:`42157`.)

source: :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome` and :c:func:`Py_GetProgramName` functions now return ``NULL`` if called before :c:func:`Py_Initialize` (before Python is initialized). Use the new :ref:`Python Initialization Configuration API <init-config>` to get the :ref:`Python Path Configuration. <init-path-config>`. (Contributed by Victor Stinner in :issue:`42260`.)
uk: :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome` і :c:func:`Py_GetProgramName` тепер повертають ``NULL``, якщо викликані перед :c:func:`Py_Initialize` (до ініціалізації Python). Використовуйте новий :ref:`API налаштування ініціалізації Python <init-config>`, щоб отримати :ref:`Налаштування шляху Python. <init-path-config>`. (Надав Віктор Стіннер у :issue:`42260`.)

source: :c:func:`PyList_SET_ITEM`, :c:func:`PyTuple_SET_ITEM` and :c:func:`PyCell_SET` macros can no longer be used as l-value or r-value. For example, ``x = PyList_SET_ITEM(a, b, c)`` and ``PyList_SET_ITEM(a, b, c) = x`` now fail with a compiler error. It prevents bugs like ``if (PyList_SET_ITEM (a, b, c) < 0) ...`` test. (Contributed by Zackery Spytz and Victor Stinner in :issue:`30459`.)
uk: Макроси :c:func:`PyList_SET_ITEM`, :c:func:`PyTuple_SET_ITEM` і :c:func:`PyCell_SET` більше не можна використовувати як l-значення або r-значення. Наприклад, ``x = PyList_SET_ITEM(a, b, c)`` і ``PyList_SET_ITEM(a, b, c) = x`` тепер не вдаються з помилкою компілятора. Це запобігає помилкам, таким як ``if (PyList_SET_ITEM (a, b, c) < 0) ...`` тест. (Надано Zackery Spytz і Victor Stinner у :issue:`30459`.)
