Repository: python/python-docs-uk
Catalog: whatsnew/3.10.po
Languages: uk

source: The various ``load_module()`` methods of :mod:`importlib` have been documented as deprecated since Python 3.6, but will now also trigger a :exc:`DeprecationWarning`. Use :meth:`~importlib.abc.Loader.exec_module` instead. (Contributed by Brett Cannon in :issue:`26131`.)
uk: Різні методи ``load_module()`` :mod:`importlib` були задокументовані як застарілі, починаючи з Python 3.6, але тепер вони також викликають :exc:`DeprecationWarning`. Замість цього використовуйте :meth:`~importlib.abc.Loader.exec_module`. (Надав Бретт Кеннон у :issue:`26131`.)

source: :meth:`zimport.zipimporter.load_module` has been deprecated in preference for :meth:`~zipimport.zipimporter.exec_module`. (Contributed by Brett Cannon in :issue:`26131`.)
uk: :meth:`zimport.zipimporter.load_module` не підтримується як перевага для :meth:`~zipimport.zipimporter.exec_module`. (Надав Бретт Кеннон у :issue:`26131`.)

source: The use of :meth:`~importlib.abc.Loader.load_module` by the import system now triggers an :exc:`ImportWarning` as :meth:`~importlib.abc.Loader.exec_module` is preferred. (Contributed by Brett Cannon in :issue:`26131`.)
uk: Використання :meth:`~importlib.abc.Loader.load_module` системою імпорту тепер викликає :exc:`ImportWarning`, оскільки :meth:`~importlib.abc.Loader.exec_module` є кращим. (Надав Бретт Кеннон у :issue:`26131`.)

source: The use of :meth:`importlib.abc.MetaPathFinder.find_module` and :meth:`importlib.abc.PathEntryFinder.find_module` by the import system now trigger an :exc:`ImportWarning` as :meth:`importlib.abc.MetaPathFinder.find_spec` and :meth:`importlib.abc.PathEntryFinder.find_spec` are preferred, respectively. You can use :func:`importlib.util.spec_from_loader` to help in porting. (Contributed by Brett Cannon in :issue:`42134`.)
uk: Використання :meth:`importlib.abc.MetaPathFinder.find_module` і :meth:`importlib.abc.PathEntryFinder.find_module` системою імпорту тепер викликає :exc:`ImportWarning` як :meth:`importlib.abc. MetaPathFinder.find_spec` і :meth:`importlib.abc.PathEntryFinder.find_spec` є кращими відповідно. Ви можете використовувати :func:`importlib.util.spec_from_loader`, щоб допомогти у перенесенні. (Надано Бреттом Кенноном у :issue:`42134`.)

source: The use of :meth:`importlib.abc.PathEntryFinder.find_loader` by the import system now triggers an :exc:`ImportWarning` as :meth:`importlib.abc.PathEntryFinder.find_spec` is preferred. You can use :func:`importlib.util.spec_from_loader` to help in porting. (Contributed by Brett Cannon in :issue:`43672`.)
uk: Використання :meth:`importlib.abc.PathEntryFinder.find_loader` системою імпорту тепер викликає :exc:`ImportWarning`, оскільки :meth:`importlib.abc.PathEntryFinder.find_spec` є кращим. Ви можете використовувати :func:`importlib.util.spec_from_loader`, щоб допомогти у перенесенні. (Надано Бреттом Кенноном у :issue:`43672`.)

source: The various implementations of :meth:`importlib.abc.MetaPathFinder.find_module` ( :meth:`importlib.machinery.BuiltinImporter.find_module`, :meth:`importlib.machinery.FrozenImporter.find_module`, :meth:`importlib.machinery.WindowsRegistryFinder.find_module`, :meth:`importlib.machinery.PathFinder.find_module`, :meth:`importlib.abc.MetaPathFinder.find_module` ), :meth:`importlib.abc.PathEntryFinder.find_module` ( :meth:`importlib.machinery.FileFinder.find_module` ), and :meth:`importlib.abc.PathEntryFinder.find_loader` ( :meth:`importlib.machinery.FileFinder.find_loader` ) now raise :exc:`DeprecationWarning` and are slated for removal in Python 3.12 (previously they were documented as deprecated in Python 3.4). (Contributed by Brett Cannon in :issue:`42135`.)
uk: Різні реалізації :meth:`importlib.abc.MetaPathFinder.find_module` ( :meth:`importlib.machinery.BuiltinImporter.find_module`, :meth:`importlib.machinery.FrozenImporter.find_module`, :meth:`importlib.machinery .WindowsRegistryFinder.find_module`, :meth:`importlib.machinery.PathFinder.find_module`, :meth:`importlib.abc.MetaPathFinder.find_module` , :meth:`importlib.abc.PathEntryFinder.find_module` ( :meth:`importlib.machinery.FileFinder.find_module` ) і :meth:`importlib.abc.PathEntryFinder.find_loader` ( :meth:`importlib.machinery.FileFinder.find_loader` ) тепер викликають :exc:`DeprecationWarning` і планується для видалення у Python 3.12 (раніше вони були задокументовані як застарілі в Python 3.4). (Надано Бреттом Кенноном у :issue:`42135`.)

source: :class:`importlib.abc.Finder` is deprecated (including its sole method, :meth:`~importlib.abc.Finder.find_module`). Both :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder` no longer inherit from the class. Users should inherit from one of these two classes as appropriate instead. (Contributed by Brett Cannon in :issue:`42135`.)
uk: :class:`importlib.abc.Finder` застаріло (включаючи його єдиний метод, :meth:`~importlib.abc.Finder.find_module`). І :class:`importlib.abc.MetaPathFinder`, і :class:`importlib.abc.PathEntryFinder` більше не успадковують від класу. Натомість користувачі повинні успадковувати один із цих двох класів. (Надано Бреттом Кенноном у :issue:`42135`.)

source: The deprecations of :mod:`imp`, :func:`importlib.find_loader`, :func:`importlib.util.set_package_wrapper`, :func:`importlib.util.set_loader_wrapper`, :func:`importlib.util.module_for_loader`, :class:`pkgutil.ImpImporter`, and :class:`pkgutil.ImpLoader` have all been updated to list Python 3.12 as the slated version of removal (they began raising :exc:`DeprecationWarning` in previous versions of Python). (Contributed by Brett Cannon in :issue:`43720`.)
uk: Застарілі :mod:`imp`, :func:`importlib.find_loader`, :func:`importlib.util.set_package_wrapper`, :func:`importlib.util.set_loader_wrapper`, :func:`importlib.util.module_for_loader`, :class:`pkgutil.ImpImporter` і :class:`pkgutil.ImpLoader` оновлено, щоб указати Python 3.12 як планову версію видалення (вони почали викликати :exc:`DeprecationWarning` у попередніх версіях Python). . (Надано Бреттом Кенноном у :issue:`43720`.)

source: The import system now uses the ``__spec__`` attribute on modules before falling back on :meth:`~importlib.abc.Loader.module_repr` for a module's ``__repr__()`` method. Removal of the use of ``module_repr()`` is scheduled for Python 3.12. (Contributed by Brett Cannon in :issue:`42137`.)
uk: Система імпорту тепер використовує атрибут ``__spec__`` для модулів перед поверненням до :meth:`~importlib.abc.Loader.module_repr` для методу ``__repr__()`` модуля. Видалення використання ``module_repr()`` заплановано для Python 3.12. (Надано Бреттом Кенноном у :issue:`42137`.)

source: :meth:`importlib.abc.Loader.module_repr`, :meth:`importlib.machinery.FrozenLoader.module_repr`, and :meth:`importlib.machinery.BuiltinLoader.module_repr` are deprecated and slated for removal in Python 3.12. (Contributed by Brett Cannon in :issue:`42136`.)
uk: :meth:`importlib.abc.Loader.module_repr`, :meth:`importlib.machinery.FrozenLoader.module_repr` і :meth:`importlib.machinery.BuiltinLoader.module_repr` застаріли та планується для видалення в Python 3.12. (Надав Бретт Кеннон у :issue:`42136`.)

source: ``sqlite3.OptimizedUnicode`` has been undocumented and obsolete since Python 3.3, when it was made an alias to :class:`str`. It is now deprecated, scheduled for removal in Python 3.12. (Contributed by Erlend E. Aasland in :issue:`42264`.)
uk: ``sqlite3.OptimizedUnicode`` був незадокументованим і застарілим з Python 3.3, коли його було зроблено псевдонімом :class:`str`. Зараз він застарів, планується його видалення в Python 3.12. (Надав Erlend E. Aasland у :issue:`42264`.)

source: :func:`asyncio.get_event_loop` now emits a deprecation warning if there is no running event loop. In the future it will be an alias of :func:`~asyncio.get_running_loop`. :mod:`asyncio` functions which implicitly create :class:`~asyncio.Future` or :class:`~asyncio.Task` objects now emit a deprecation warning if there is no running event loop and no explicit *loop* argument is passed: :func:`~asyncio.ensure_future`, :func:`~asyncio.wrap_future`, :func:`~asyncio.gather`, :func:`~asyncio.shield`, :func:`~asyncio.as_completed` and constructors of :class:`~asyncio.Future`, :class:`~asyncio.Task`, :class:`~asyncio.StreamReader`, :class:`~asyncio.StreamReaderProtocol`. (Contributed by Serhiy Storchaka in :issue:`39529`.)
uk: :func:`asyncio.get_event_loop` тепер видає попередження про застаріле, якщо немає запущеного циклу подій. У майбутньому це буде псевдонім :func:`~asyncio.get_running_loop`. Функції :mod:`asyncio`, які неявно створюють об’єкти :class:`~asyncio.Future` або :class:`~asyncio.Task`, тепер видають попередження про застаріле, якщо не виконується цикл подій і немає явного аргументу *loop* передано: :func:`~asyncio.ensure_future`, :func:`~asyncio.wrap_future`, :func:`~asyncio.gather`, :func:`~asyncio.shield`, :func:`~asyncio.as_completed` і конструктори :class:`~asyncio.Future`, :class:`~asyncio.Task`, :class:`~asyncio.StreamReader`, :class:`~asyncio.StreamReaderProtocol`. (Надав Сергій Сторчака в :issue:`39529`.)

source: The undocumented built-in function ``sqlite3.enable_shared_cache`` is now deprecated, scheduled for removal in Python 3.12. Its use is strongly discouraged by the SQLite3 documentation. See `the SQLite3 docs <https://sqlite.org/c3ref/enable_shared_cache.html>`_ for more details. If a shared cache must be used, open the database in URI mode using the ``cache=shared`` query parameter. (Contributed by Erlend E. Aasland in :issue:`24464`.)
uk: Недокументована вбудована функція ``sqlite3.enable_shared_cache`` тепер застаріла, її планується видалити в Python 3.12. Його використання настійно не рекомендується документацією SQLite3. Перегляньте `документи SQLite3 <https://sqlite.org/c3ref/enable_shared_cache.html>`_ для отримання додаткової інформації. Якщо потрібно використовувати спільний кеш, відкрийте базу даних у режимі URI за допомогою параметра запиту ``cache=shared``. (Надав Erlend E. Aasland у :issue:`24464`.)

source: The following ``threading`` methods are now deprecated:
uk: Наступні методи ``потоковості`` тепер застаріли:

source: (Contributed by Jelle Zijlstra in :issue:`21574`.)
uk: (Надав by Jelle Zijlstra в :issue:`21574`.)

source: :meth:`pathlib.Path.link_to` is deprecated and slated for removal in Python 3.12. Use :meth:`pathlib.Path.hardlink_to` instead. (Contributed by Barney Gale in :issue:`39950`.)
uk: :meth:`pathlib.Path.link_to` не підтримується та планується для видалення в Python 3.12. Натомість використовуйте :meth:`pathlib.Path.hardlink_to`. (Надано Барні Гейлом у :issue:`39950`.)

source: ``cgi.log()`` is deprecated and slated for removal in Python 3.12. (Contributed by Inada Naoki in :issue:`41139`.)
uk: ``cgi.log()`` застарів і планується для видалення в Python 3.12. (Надано Інадою Наокі в :issue:`41139`.)

source: The following :mod:`ssl` features have been deprecated since Python 3.6, Python 3.7, or OpenSSL 1.1.0 and will be removed in 3.11:
uk: Наступні функції :mod:`ssl` застаріли з Python 3.6, Python 3.7 або OpenSSL 1.1.0 і будуть видалені в 3.11:

source: :data:`~ssl.OP_NO_SSLv2`, :data:`~ssl.OP_NO_SSLv3`, :data:`~ssl.OP_NO_TLSv1`, :data:`~ssl.OP_NO_TLSv1_1`, :data:`~ssl.OP_NO_TLSv1_2`, and :data:`~ssl.OP_NO_TLSv1_3` are replaced by :attr:`sslSSLContext.minimum_version` and :attr:`sslSSLContext.maximum_version`.
uk: :data:`~ssl.OP_NO_SSLv2`, :data:`~ssl.OP_NO_SSLv3`, :data:`~ssl.OP_NO_TLSv1`, :data:`~ssl.OP_NO_TLSv1_1`, :data:`~ssl.OP_NO_TLSv1_2`, і :data:`~ssl.OP_NO_TLSv1_3` замінюються на :attr:`sslSSLContext.minimum_version` і :attr:`sslSSLContext.maximum_version`.

source: :data:`~ssl.PROTOCOL_SSLv2`, :data:`~ssl.PROTOCOL_SSLv3`, :data:`~ssl.PROTOCOL_SSLv23`, :data:`~ssl.PROTOCOL_TLSv1`, :data:`~ssl.PROTOCOL_TLSv1_1`, :data:`~ssl.PROTOCOL_TLSv1_2`, and :data:`~ssl.PROTOCOL_TLS` are deprecated in favor of :data:`~ssl.PROTOCOL_TLS_CLIENT` and :data:`~ssl.PROTOCOL_TLS_SERVER`
uk: :data:`~ssl.PROTOCOL_SSLv2`, :data:`~ssl.PROTOCOL_SSLv3`, :data:`~ssl.PROTOCOL_SSLv23`, :data:`~ssl.PROTOCOL_TLSv1`, :data:`~ssl.PROTOCOL_TLSv1_1`, :data:`~ssl.PROTOCOL_TLSv1_2` і :data:`~ssl.PROTOCOL_TLS` застаріли на користь :data:`~ssl.PROTOCOL_TLS_CLIENT` і :data:`~ssl.PROTOCOL_TLS_SERVER`

source: :func:`~ssl.wrap_socket` is replaced by :meth:`ssl.SSLContext.wrap_socket`
uk: :func:`~ssl.wrap_socket` замінюється на :meth:`ssl.SSLContext.wrap_socket`

source: NPN features like :meth:`ssl.SSLSocket.selected_npn_protocol` and :meth:`ssl.SSLContext.set_npn_protocols` are replaced by ALPN.
uk: Такі функції NPN, як :meth:`ssl.SSLSocket.selected_npn_protocol` і :meth:`ssl.SSSLContext.set_npn_protocols`, замінено на ALPN.

source: The threading debug (:envvar:`PYTHONTHREADDEBUG` environment variable) is deprecated in Python 3.10 and will be removed in Python 3.12. This feature requires a :ref:`debug build of Python <debug-build>`. (Contributed by Victor Stinner in :issue:`44584`.)
uk: Налагодження потоків (:envvar:`PYTHONTHREADDEBUG` змінна середовища) застаріло в Python 3.10 і буде видалено в Python 3.12. Для цієї функції потрібна :ref:`налагоджувальна збірка Python <debug-build>`. (Надав Віктор Стіннер у :issue:`44584`.)

source: Importing from the ``typing.io`` and ``typing.re`` submodules will now emit :exc:`DeprecationWarning`. These submodules will be removed in a future version of Python. Anything belonging to these submodules should be imported directly from :mod:`typing` instead. (Contributed by Sebastian Rittau in :issue:`38291`)
uk: Імпорт із субмодулів ``typing.io`` і ``typing.re`` тепер видасть :exc:`DeprecationWarning`. Ці підмодулі буде видалено в наступній версії Python. Все, що належить до цих підмодулів, слід імпортувати безпосередньо з :mod:`typing`. (Надав Себастьян Ріттау в :issue:`38291`)

source: Removed
uk: Видалено

source: Removed special methods ``__int__``, ``__float__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__rfloordiv__``, ``__rmod__`` and ``__rdivmod__`` of the :class:`complex` class. They always raised a :exc:`TypeError`. (Contributed by Serhiy Storchaka in :issue:`41974`.)
uk: Видалено спеціальні методи ``__int__``, ``__float__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__rfloordiv__``, ``__rmod__`` та ``__rdivmod__`` класу :class:`complex`. Вони завжди викликали :exc:`TypeError`. (Надав Сергій Сторчака в :issue:`41974`.)

source: The ``ParserBase.error()`` method from the private and undocumented ``_markupbase`` module has been removed. :class:`html.parser.HTMLParser` is the only subclass of ``ParserBase`` and its ``error()`` implementation was already removed in Python 3.5. (Contributed by Berker Peksag in :issue:`31844`.)
uk: Метод ``ParserBase.error()`` із приватного та недокументованого модуля ``_markupbase`` видалено. :class:`html.parser.HTMLParser` є єдиним підкласом ``ParserBase``, і його реалізацію ``error()`` уже було видалено в Python 3.5. (Надано Berker Peksag у :issue:`31844`.)

source: Removed the ``unicodedata.ucnhash_CAPI`` attribute which was an internal PyCapsule object. The related private ``_PyUnicode_Name_CAPI`` structure was moved to the internal C API. (Contributed by Victor Stinner in :issue:`42157`.)
uk: Видалено атрибут ``unicodedata.ucnhash_CAPI``, який був внутрішнім об’єктом PyCapsule. Відповідну приватну структуру ``_PyUnicode_Name_CAPI`` було переміщено до внутрішнього C API. (Надав Віктор Стіннер у :issue:`42157`.)

source: Removed the ``parser`` module, which was deprecated in 3.9 due to the switch to the new PEG parser, as well as all the C source and header files that were only being used by the old parser, including ``node.h``, ``parser.h``, ``graminit.h`` and ``grammar.h``.
uk: Видалено модуль ``парсер``, який був застарілим у версії 3.9 через перехід на новий синтаксичний аналізатор PEG, а також усі вихідні файли C і файли заголовків, які використовувалися лише старим парсером, включаючи ``node.h ``, ``parser.h``, ``graminit.h`` і ``grammar.h``.

source: Removed the Public C API functions ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags`` and ``PyNode_Compile`` that were deprecated in 3.9 due to the switch to the new PEG parser.
uk: Видалено публічні функції API C ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``Parser_SimpleParseFileFlags`` і ``PyNode_Compile``, які були застарілими в 3.9 через перехід на новий аналізатор PEG.

source: Removed the ``formatter`` module, which was deprecated in Python 3.4. It is somewhat obsolete, little used, and not tested. It was originally scheduled to be removed in Python 3.6, but such removals were delayed until after Python 2.7 EOL. Existing users should copy whatever classes they use into their code. (Contributed by Dong-hee Na and Terry J. Reedy in :issue:`42299`.)
uk: Видалено модуль ``formatter``, який був застарілим у Python 3.4. Він дещо застарів, мало використовується і не перевірений. Спочатку було заплановано його видалення в Python 3.6, але такі видалення було відкладено до закінчення Python 2.7 EOL. Існуючі користувачі повинні скопіювати будь-які класи, які вони використовують, у свій код. (Надано Dong-hee Na та Terry J. Reedy у :issue:`42299`.)

source: Removed the :c:func:`PyModule_GetWarningsModule` function that was useless now due to the _warnings module was converted to a builtin module in 2.6. (Contributed by Hai Shi in :issue:`42599`.)
uk: Видалено функцію :c:func:`PyModule_GetWarningsModule`, яка зараз була марною, оскільки модуль _warnings було перетворено на вбудований модуль у 2.6. (Надав Хай Ши в :issue:`42599`.)

source: Remove deprecated aliases to :ref:`collections-abstract-base-classes` from the :mod:`collections` module. (Contributed by Victor Stinner in :issue:`37324`.)
uk: Видаліть застарілі псевдоніми для :ref:`collections-abstract-base-classes` з модуля :mod:`collections`. (Надав Віктор Стіннер у :issue:`37324`.)

source: The ``loop`` parameter has been removed from most of :mod:`asyncio`\ 's :doc:`high-level API <../library/asyncio-api-index>` following deprecation in Python 3.8. The motivation behind this change is multifold:
uk: Параметр ``loop`` було видалено з більшості :mod:`asyncio`\ :doc:`високорівневого API <../library/asyncio-api-index>` після застарілої версії Python 3.8. Мотивація цієї зміни багатогранна:

source: This simplifies the high-level API.
uk: Це спрощує API високого рівня.

source: The functions in the high-level API have been implicitly getting the current thread's running event loop since Python 3.7. There isn't a need to pass the event loop to the API in most normal use cases.
uk: Починаючи з Python 3.7, функції високорівневого API неявно отримують поточний цикл подій поточного потоку. У більшості звичайних випадків використання циклу подій до API не потрібно передавати.

source: Event loop passing is error-prone especially when dealing with loops running in different threads.
uk: Передача циклу подій схильна до помилок, особливо коли йдеться про цикли, що виконуються в різних потоках.

source: Note that the low-level API will still accept ``loop``. See :ref:`changes-python-api` for examples of how to replace existing code.
uk: Зауважте, що API низького рівня все одно прийматиме ``цикл``. Перегляньте :ref:`changes-python-api` приклади того, як замінити існуючий код.

source: (Contributed by Yurii Karabas, Andrew Svetlov, Yury Selivanov and Kyle Stanley in :issue:`42392`.)
uk: (Надано Юрієм Карабасом, Ендрю Свєтловим, Юрієм Селівановим і Кайлом Стенлі в :issue:`42392`.)

source: Porting to Python 3.10
uk: Перенесення на Python 3.10

source: This section lists previously described changes and other bugfixes that may require changes to your code.
uk: У цьому розділі наведено описані раніше зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді.

source: Changes in the Python syntax
uk: Зміни в синтаксисі Python

source: Deprecation warning is now emitted when compiling previously valid syntax if the numeric literal is immediately followed by a keyword (like in ``0in x``). In future releases it will be changed to syntax warning, and finally to a syntax error. To get rid of the warning and make the code compatible with future releases just add a space between the numeric literal and the following keyword. (Contributed by Serhiy Storchaka in :issue:`43833`).
uk: Попередження про застаріле тепер видається під час компіляції раніше дійсного синтаксису, якщо числовий літерал безпосередньо слідує за ключовим словом (як у ``0in x``). У наступних випусках воно буде змінено на синтаксичне попередження та, нарешті, на синтаксичну помилку. Щоб позбутися попередження та зробити код сумісним з майбутніми випусками, просто додайте пробіл між числовим літералом і наступним ключовим словом. (Надав Сергій Сторчака в :issue:`43833`).

source: Changes in the Python API
uk: Зміни в API Python

source: The *etype* parameters of the :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only`, and :func:`~traceback.print_exception` functions in the :mod:`traceback` module have been renamed to *exc*. (Contributed by Zackery Spytz and Matthias Bussonnier in :issue:`26389`.)
uk: Параметри *etype* функцій :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only` і :func:`~traceback.print_exception` у модулі :mod:`traceback` перейменовано до *exc*. (Надано Zackery Spytz і Matthias Bussonnier у :issue:`26389`.)

source: :mod:`atexit`: At Python exit, if a callback registered with :func:`atexit.register` fails, its exception is now logged. Previously, only some exceptions were logged, and the last exception was always silently ignored. (Contributed by Victor Stinner in :issue:`42639`.)
uk: :mod:`atexit`: під час виходу з Python, якщо зворотний виклик, зареєстрований за допомогою :func:`atexit.register`, не вдається, його виняткова ситуація тепер реєструється. Раніше реєструвалися лише деякі винятки, а останній виняток завжди мовчки ігнорувався. (Надав Віктор Стіннер у :issue:`42639`.)

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. Furthermore, :exc:`TypeError` may be raised for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9. (Contributed by Ken Jin in :issue:`42195`.)
uk: :class:`collections.abc.Callable` generic тепер зводить параметри типу, подібно до того, що зараз робить :data:`typing.Callable`. Це означає, що ``collections.abc.Callable[[int, str], str]`` матиме ``__args__`` ``(int, str, str)``; раніше це було ``([int, str], str)``. Код, який отримує доступ до аргументів через :func:`typing.get_args` або ``__args__``, повинен враховувати цю зміну. Крім того, помилка :exc:`TypeError` може виникнути через неприпустимі форми параметризації :class:`collections.abc.Callable`, які могли пройти мовчки в Python 3.9. (Надав Кен Джин у :issue:`42195`.)

source: :meth:`socket.htons` and :meth:`socket.ntohs` now raise :exc:`OverflowError` instead of :exc:`DeprecationWarning` if the given parameter will not fit in a 16-bit unsigned integer. (Contributed by Erlend E. Aasland in :issue:`42393`.)
uk: :meth:`socket.htons` і :meth:`socket.ntohs` тепер викликають :exc:`OverflowError` замість :exc:`DeprecationWarning`, якщо заданий параметр не вміщується в 16-бітне ціле число без знаку. (Надав Erlend E. Aasland у :issue:`42393`.)
