Repository: python/python-docs-uk
Catalog: whatsnew/3.10.po
Languages: uk

source: The extended color functions added in ncurses 6.1 will be used transparently by :func:`curses.color_content`, :func:`curses.init_color`, :func:`curses.init_pair`, and :func:`curses.pair_content`. A new function, :func:`curses.has_extended_color_support`, indicates whether extended color support is provided by the underlying ncurses library. (Contributed by Jeffrey Kintscher and Hans Petter Jansson in :issue:`36982`.)
uk: Розширені функції кольору, додані в ncurses 6.1, прозоро використовуватимуться :func:`curses.color_content`, :func:`curses.init_color`, :func:`curses.init_pair` і :func:`curses.pair_content`. Нова функція, :func:`curses.has_extended_color_support`, вказує, чи надається розширена підтримка кольорів базовою бібліотекою ncurses. (Надано Джеффрі Кінтчером і Гансом Петтером Янссоном у :issue:`36982`.)

source: The ``BUTTON5_*`` constants are now exposed in the :mod:`curses` module if they are provided by the underlying curses library. (Contributed by Zackery Spytz in :issue:`39273`.)
uk: Константи ``BUTTON5_*`` тепер доступні в модулі :mod:`curses`, якщо вони надаються основною бібліотекою curses. (Надав Закері Шпітц у :issue:`39273`.)

source: dataclasses
uk: класи даних

source: Added ``slots`` parameter in :func:`dataclasses.dataclass` decorator. (Contributed by Yurii Karabas in :issue:`42269`)
uk: Додано параметр ``slots`` в декоратор :func:`dataclasses.dataclass`. (Надав Юрій Карабас у :issue:`42269`)

source: Keyword-only fields
uk: Поля лише для ключових слів

source: dataclasses now supports fields that are keyword-only in the generated __init__ method. There are a number of ways of specifying keyword-only fields.
uk: dataclasses тепер підтримує поля, які є лише ключовими словами у створеному методі __init__. Існує кілька способів визначення полів лише для ключових слів.

source: You can say that every field is keyword-only:
uk: Можна сказати, що кожне поле є лише ключовим словом:

source: Both ``name`` and ``birthday`` are keyword-only parameters to the generated __init__ method.
uk: І ``name``, і ``birthday`` є параметрами лише для ключових слів для згенерованого методу __init__.

source: You can specify keyword-only on a per-field basis:
uk: Ви можете вказати лише ключове слово для кожного поля:

source: Here only ``birthday`` is keyword-only. If you set ``kw_only`` on individual fields, be aware that there are rules about re-ordering fields due to keyword-only fields needing to follow non-keyword-only fields. See the full dataclasses documentation for details.
uk: Тут лише ``день народження`` є лише ключовим словом. Якщо ви встановлюєте ``kw_only`` для окремих полів, майте на увазі, що існують правила щодо зміни порядку полів, оскільки поля, які містять лише ключові слова, мають слідувати полям, які не містять лише ключових слів. Дивіться повну документацію класів даних для деталей.

source: You can also specify that all fields following a KW_ONLY marker are keyword-only. This will probably be the most common usage:
uk: Ви також можете вказати, що всі поля після маркера KW_ONLY є лише ключовими словами. Ймовірно, це буде найпоширенішим використанням:

source: Here, ``z`` and ``t`` are keyword-only parameters, while ``x`` and ``y`` are not. (Contributed by Eric V. Smith in :issue:`43532`)
uk: Тут ``z`` і ``t`` є параметрами лише для ключових слів, тоді як ``x`` і ``y`` ні. (Надав Ерік В. Сміт у :issue:`43532`)

source: The entire ``distutils`` package is deprecated, to be removed in Python 3.12. Its functionality for specifying package builds has already been completely replaced by third-party packages ``setuptools`` and ``packaging``, and most other commonly used APIs are available elsewhere in the standard library (such as :mod:`platform`, :mod:`shutil`, :mod:`subprocess` or :mod:`sysconfig`). There are no plans to migrate any other functionality from ``distutils``, and applications that are using other functions should plan to make private copies of the code. Refer to :pep:`632` for discussion.
uk: Весь пакет ``distutils`` застарів, його буде видалено в Python 3.12. Його функціональні можливості для вказівки збірок пакунків уже повністю замінено пакетами сторонніх розробників ``setuptools`` і ``packaging``, а більшість інших поширених API доступні в інших місцях стандартної бібліотеки (наприклад, :mod:`platform` , :mod:`shutil`, :mod:`subprocess` або :mod:`sysconfig`). Немає планів переміщення будь-якої іншої функціональності з ``distutils``, і програми, які використовують інші функції, повинні планувати створення приватних копій коду. Зверніться до :pep:`632` для обговорення.

source: The ``bdist_wininst`` command deprecated in Python 3.8 has been removed. The ``bdist_wheel`` command is now recommended to distribute binary packages on Windows. (Contributed by Victor Stinner in :issue:`42802`.)
uk: Команду ``bdist_wininst``, яка застаріла в Python 3.8, видалено. Команда ``bdist_wheel`` тепер рекомендована для розповсюдження двійкових пакетів у Windows. (Надав Віктор Стіннер у :issue:`42802`.)

source: When a module does not define ``__loader__``, fall back to ``__spec__.loader``. (Contributed by Brett Cannon in :issue:`42133`.)
uk: Якщо модуль не визначає ``__loader__``, поверніться до ``__spec__.loader``. (Надано Бреттом Кенноном у :issue:`42133`.)

source: encodings
uk: кодування

source: :func:`encodings.normalize_encoding` now ignores non-ASCII characters. (Contributed by Hai Shi in :issue:`39337`.)
uk: :func:`encodings.normalize_encoding` тепер ігнорує символи, відмінні від ASCII. (Надав Хай Ши в :issue:`39337`.)

source: fileinput
uk: введення файлу

source: Add *encoding* and *errors* parameters in :func:`fileinput.input` and :class:`fileinput.FileInput`. (Contributed by Inada Naoki in :issue:`43712`.)
uk: Додайте параметри *encoding* і *errors* у :func:`fileinput.input` і :class:`fileinput.FileInput`. (Надано Інадою Наокі в :issue:`43712`.)

source: :func:`fileinput.hook_compressed` now returns :class:`TextIOWrapper` object when *mode* is "r" and file is compressed, like uncompressed files. (Contributed by Inada Naoki in :issue:`5758`.)
uk: :func:`fileinput.hook_compressed` тепер повертає об’єкт :class:`TextIOWrapper`, коли *mode* має значення "r" і файл стиснутий, як і нестиснені файли. (Надано Інадою Наокі в :issue:`5758`.)

source: faulthandler
uk: обробник помилок

source: The :mod:`faulthandler` module now detects if a fatal error occurs during a garbage collector collection. (Contributed by Victor Stinner in :issue:`44466`.)
uk: Модуль :mod:`faulthandler` тепер виявляє, якщо під час збирання сміття виникає фатальна помилка. (Надав Віктор Стіннер у :issue:`44466`.)

source: Add audit hooks for :func:`gc.get_objects`, :func:`gc.get_referrers` and :func:`gc.get_referents`. (Contributed by Pablo Galindo in :issue:`43439`.)
uk: Додайте перехоплювачі аудиту для :func:`gc.get_objects`, :func:`gc.get_referrers` і :func:`gc.get_referents`. (Надав Пабло Галіндо в :issue:`43439`.)

source: glob
uk: глоб

source: Add the *root_dir* and *dir_fd* parameters in :func:`~glob.glob` and :func:`~glob.iglob` which allow to specify the root directory for searching. (Contributed by Serhiy Storchaka in :issue:`38144`.)
uk: Додайте параметри *root_dir* і *dir_fd* у :func:`~glob.glob` і :func:`~glob.iglob`, які дозволяють вказати кореневий каталог для пошуку. (Надав Сергій Сторчака в :issue:`38144`.)

source: hashlib
uk: хешліб

source: The hashlib module requires OpenSSL 1.1.1 or newer. (Contributed by Christian Heimes in :pep:`644` and :issue:`43669`.)
uk: Модуль hashlib вимагає OpenSSL 1.1.1 або новішої версії. (Надав Крістіан Хаймес у :pep:`644` і :issue:`43669`.)

source: The hashlib module has preliminary support for OpenSSL 3.0.0. (Contributed by Christian Heimes in :issue:`38820` and other issues.)
uk: Модуль hashlib має попередню підтримку OpenSSL 3.0.0. (Надано Крістіаном Хеймсом у :issue:`38820` та інших випусках.)

source: The pure-Python fallback of :func:`~hashlib.pbkdf2_hmac` is deprecated. In the future PBKDF2-HMAC will only be available when Python has been built with OpenSSL support. (Contributed by Christian Heimes in :issue:`43880`.)
uk: Резервна версія чистого Python :func:`~hashlib.pbkdf2_hmac` застаріла. У майбутньому PBKDF2-HMAC буде доступний лише тоді, коли Python буде створено з підтримкою OpenSSL. (Надав Крістіан Хеймс у :issue:`43880`.)

source: The hmac module now uses OpenSSL's HMAC implementation internally. (Contributed by Christian Heimes in :issue:`40645`.)
uk: Модуль hmac тепер використовує внутрішню реалізацію HMAC OpenSSL. (Надав Крістіан Хеймс у :issue:`40645`.)

source: IDLE and idlelib
uk: IDLE і idlelib

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
uk: Зробити IDLE викликом :func:`sys.excepthook` (якщо запускається без '-n'). Хуки користувача раніше ігнорувалися. (Надав Кен Хілтон у :issue:`43008`.)

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
uk: Перевпорядкування діалогового вікна налаштувань. Розділіть вкладку Загальні на вкладки Windows і Shell/Ed. Перемістіть джерела довідки, які розширюють меню "Довідка", на вкладку "Розширення". Звільніть місце для нових параметрів і скоротіть діалогове вікно. Останнє робить діалог краще адаптованим до маленьких екранів. (Надано Террі Джен Ріді в :issue:`40468`.) Перемістіть налаштування відступу з вкладки "Шрифт" на нову вкладку Windows. (Надано Марком Розманом і Террі Джен Ріді в :issue:`33962`.)

source: The changes above were backported to a 3.9 maintenance release.
uk: Зазначені вище зміни було перенесено до версії 3.9 для обслуговування.

source: Add a Shell sidebar. Move the primary prompt ('>>>') to the sidebar. Add secondary prompts ('...') to the sidebar. Left click and optional drag selects one or more lines of text, as with the editor line number sidebar. Right click after selecting text lines displays a context menu with 'copy with prompts'. This zips together prompts from the sidebar with lines from the selected text. This option also appears on the context menu for the text. (Contributed by Tal Einat in :issue:`37903`.)
uk: Додайте бічну панель Shell. Перемістіть основну підказку ('>>>') на бічну панель. Додайте додаткові підказки ('...') на бічну панель. Клацання лівою кнопкою миші та необов’язкове перетягування виділяє один або кілька рядків тексту, як і на бічній панелі номерів рядків редактора. Клацання правою кнопкою миші після вибору текстових рядків відображає контекстне меню з "копіювати з підказками". Це об’єднує підказки з бічної панелі з рядками з виділеного тексту. Цей параметр також відображається в контекстному меню для тексту. (Надав Тал Ейнат у :issue:`37903`.)

source: Use spaces instead of tabs to indent interactive code. This makes interactive code entries 'look right'. Making this feasible was a major motivation for adding the shell sidebar. (Contributed by Terry Jan Reedy in :issue:`37892`.)
uk: Використовуйте пробіли замість табуляції, щоб зробити відступ інтерактивного коду. Завдяки цьому інтерактивні записи коду виглядають правильно. Зробити це можливим було основною мотивацією для додавання бічної панелі оболонки. (Надав Террі Ян Ріді в :issue:`37892`.)

source: Highlight the new :ref:`soft keywords <soft-keywords>` :keyword:`match`, :keyword:`case <match>`, and :keyword:`_ <wildcard-patterns>` in pattern-matching statements. However, this highlighting is not perfect and will be incorrect in some rare cases, including some ``_``-s in ``case`` patterns. (Contributed by Tal Einat in :issue:`44010`.)
uk: Виділіть нові :ref:`м’які ключові слова <soft-keywords>` :keyword:`match`, :keyword:`case <match>` і :keyword:`_ <wildcard-patterns>` в операторах зіставлення шаблонів. Однак це підсвічування не є ідеальним і буде неправильним у деяких рідкісних випадках, включаючи деякі ``_``-s у шаблонах ``case``. (Надав Тал Ейнат у :issue:`44010`.)

source: New in 3.10 maintenance releases.
uk: Нове у випусках обслуговування 3.10.

source: Apply syntax highlighting to `.pyi` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
uk: Застосуйте підсвічування синтаксису до файлів `.pyi`. (Надано Алексом Вейгудом і Террі Джен Ріді в :issue:`45447`.)

source: Feature parity with ``importlib_metadata`` 4.6 (`history <https://importlib-metadata.readthedocs.io/en/latest/history.html>`_).
uk: Парність функцій із ``importlib_metadata`` 4.6 (`історія <https://importlib-metadata.readthedocs.io/en/latest/history.html>`_).

source: :ref:`importlib.metadata entry points <entry-points>` now provide a nicer experience for selecting entry points by group and name through a new :class:`importlib.metadata.EntryPoints` class. See the Compatibility Note in the docs for more info on the deprecation and usage.
uk: :ref:`точки входу importlib.metadata <entry-points>` тепер забезпечують кращий досвід для вибору точок входу за групою та назвою за допомогою нового класу :class:`importlib.metadata.EntryPoints`. Див. Примітку щодо сумісності в документах, щоб дізнатися більше про застаріле та використання.

source: Added :func:`importlib.metadata.packages_distributions` for resolving top-level Python modules and packages to their :class:`importlib.metadata.Distribution`.
uk: Додано :func:`importlib.metadata.packages_distributions` для вирішення модулів і пакетів Python верхнього рівня в їх :class:`importlib.metadata.Distribution`.

source: inspect
uk: оглядати

source: Add :func:`inspect.get_annotations`, which safely computes the annotations defined on an object. It works around the quirks of accessing the annotations on various types of objects, and makes very few assumptions about the object it examines. :func:`inspect.get_annotations` can also correctly un-stringize stringized annotations. :func:`inspect.get_annotations` is now considered best practice for accessing the annotations dict defined on any Python object; for more information on best practices for working with annotations, please see :ref:`annotations-howto`. Relatedly, :func:`inspect.signature`, :func:`inspect.Signature.from_callable`, and :func:`inspect.Signature.from_function` now call :func:`inspect.get_annotations` to retrieve annotations. This means :func:`inspect.signature` and :func:`inspect.Signature.from_callable` can also now un-stringize stringized annotations. (Contributed by Larry Hastings in :issue:`43817`.)
uk: Додайте :func:`inspect.get_annotations`, який безпечно обчислює анотації, визначені для об’єкта. Він усуває особливості доступу до анотацій для різних типів об’єктів і робить дуже мало припущень щодо об’єкта, який він досліджує. :func:`inspect.get_annotations` також може правильно видаляти рядкові анотації. :func:`inspect.get_annotations` тепер вважається найкращою практикою для доступу до dict анотацій, визначених у будь-якому об’єкті Python; для отримання додаткової інформації про найкращі методи роботи з анотаціями, будь ласка, перегляньте :ref:`annotations-howto`. Відповідно, :func:`inspect.signature`, :func:`inspect.Signature.from_callable` і :func:`inspect.Signature.from_function` тепер викликають :func:`inspect.get_annotations` для отримання анотацій. Це означає, що :func:`inspect.signature` і :func:`inspect.Signature.from_callable` тепер також можуть скасовувати рядкові анотації. (Надано Ларрі Гастінгсом у :issue:`43817`.)

source: Add :func:`itertools.pairwise()`. (Contributed by Raymond Hettinger in :issue:`38200`.)
uk: Додайте :func:`itertools.pairwise()`. (Надав Реймонд Геттінгер у :issue:`38200`.)

source: linecache
uk: лінійний кеш

source: os
uk: ос

source: Add :func:`os.cpu_count()` support for VxWorks RTOS. (Contributed by Peixing Xin in :issue:`41440`.)
uk: Додайте підтримку :func:`os.cpu_count()` для VxWorks RTOS. (Надано Peixing Xin у :issue:`41440`.)

source: Add a new function :func:`os.eventfd` and related helpers to wrap the ``eventfd2`` syscall on Linux. (Contributed by Christian Heimes in :issue:`41001`.)
uk: Додайте нову функцію :func:`os.eventfd` і відповідні помічники, щоб завершити системний виклик ``eventfd2`` у Linux. (Надав Крістіан Хеймс у :issue:`41001`.)

source: Add :func:`os.splice()` that allows to move data between two file descriptors without copying between kernel address space and user address space, where one of the file descriptors must refer to a pipe. (Contributed by Pablo Galindo in :issue:`41625`.)
uk: Додайте :func:`os.splice()`, який дозволяє переміщувати дані між двома файловими дескрипторами без копіювання між адресним простором ядра та адресним простором користувача, де один із файлових дескрипторів має посилатися на канал. (Надав Пабло Галіндо в :issue:`41625`.)

source: Add :data:`~os.O_EVTONLY`, :data:`~os.O_FSYNC`, :data:`~os.O_SYMLINK` and :data:`~os.O_NOFOLLOW_ANY` for macOS. (Contributed by Dong-hee Na in :issue:`43106`.)
uk: Додайте :data:`~os.O_EVTONLY`, :data:`~os.O_FSYNC`, :data:`~os.O_SYMLINK` і :data:`~os.O_NOFOLLOW_ANY` для macOS. (Надав Dong-hee Na у :issue:`43106`.)

source: :func:`os.path.realpath` now accepts a *strict* keyword-only argument. When set to ``True``, :exc:`OSError` is raised if a path doesn't exist or a symlink loop is encountered. (Contributed by Barney Gale in :issue:`43757`.)
uk: :func:`os.path.realpath` тепер приймає *суворий* аргумент лише для ключового слова. Якщо встановлено значення ``True``, :exc:`OSError` викликається, якщо шлях не існує або виникає цикл символічного посилання. (Надано Барні Гейлом у :issue:`43757`.)

source: Add slice support to :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contributed by Joshua Cannon in :issue:`35498`)
uk: Додайте підтримку фрагментів до :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Надав Джошуа Кеннон у :issue:`35498`)

source: Add negative indexing support to :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contributed by Yaroslav Pankovych in :issue:`21041`)
uk: Додайте підтримку негативного індексування до :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Надав Ярослав Панкович у :issue:`21041`)

source: Add :meth:`Path.hardlink_to <pathlib.Path.hardlink_to>` method that supersedes :meth:`~pathlib.Path.link_to`. The new method has the same argument order as :meth:`~pathlib.Path.symlink_to`. (Contributed by Barney Gale in :issue:`39950`.)
uk: Додайте метод :meth:`Path.hardlink_to <pathlib.Path.hardlink_to>`, який замінює :meth:`~pathlib.Path.link_to`. Новий метод має той самий порядок аргументів, що й :meth:`~pathlib.Path.symlink_to`. (Надано Барні Гейлом у :issue:`39950`.)

source: :meth:`pathlib.Path.stat` and :meth:`~pathlib.Path.chmod` now accept a *follow_symlinks* keyword-only argument for consistency with corresponding functions in the :mod:`os` module. (Contributed by Barney Gale in :issue:`39906`.)
uk: :meth:`pathlib.Path.stat` і :meth:`~pathlib.Path.chmod` тепер приймають *follow_symlinks* лише ключовий аргумент для узгодженості з відповідними функціями в модулі :mod:`os`. (Надано Барні Гейлом у :issue:`39906`.)

source: platform
uk: платформа

source: Add :func:`platform.freedesktop_os_release()` to retrieve operation system identification from `freedesktop.org os-release <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ standard file. (Contributed by Christian Heimes in :issue:`28468`)
uk: Додайте :func:`platform.freedesktop_os_release()`, щоб отримати ідентифікатор операційної системи зі стандартного файлу `freedesktop.org os-release <https://www.freedesktop.org/software/systemd/man/os-release.html>`_. (Надав Крістіан Хеймс у :issue:`28468`)

source: :func:`pprint.pprint` now accepts a new ``underscore_numbers`` keyword argument. (Contributed by sblondon in :issue:`42914`.)
uk: :func:`pprint.pprint` тепер приймає новий аргумент ключового слова ``underscore_numbers``. (Надав sblondon у :issue:`42914`.)

source: :mod:`pprint` can now pretty-print :class:`dataclasses.dataclass` instances. (Contributed by Lewis Gaul in :issue:`43080`.)
uk: :mod:`pprint` тепер може красиво друкувати екземпляри :class:`dataclasses.dataclass`. (Надано Льюїсом Голом у :issue:`43080`.)

source: Add ``--quiet`` option to command-line interface of :mod:`py_compile`. (Contributed by Gregory Schevchenko in :issue:`38731`.)
uk: Додайте параметр ``--quiet`` до інтерфейсу командного рядка :mod:`py_compile`. (Надав Григорій Шевченко в :issue:`38731`.)

source: Add an ``end_lineno`` attribute to the ``Function`` and ``Class`` objects in the tree returned by :func:`pyclbr.readline` and :func:`pyclbr.readline_ex`. It matches the existing (start) ``lineno``. (Contributed by Aviral Srivastava in :issue:`38307`.)
uk: Додайте атрибут ``end_lineno`` до об’єктів ``Function`` і ``Class`` у дереві, що повертається :func:`pyclbr.readline` і :func:`pyclbr.readline_ex`. Він відповідає існуючому (початку) ``lineno``. (Надано Aviral Srivastava в :issue:`38307`.)

source: shelve
uk: полиця

source: The :mod:`shelve` module now uses :data:`pickle.DEFAULT_PROTOCOL` by default instead of :mod:`pickle` protocol ``3`` when creating shelves. (Contributed by Zackery Spytz in :issue:`34204`.)
uk: Модуль :mod:`shelve` тепер використовує :data:`pickle.DEFAULT_PROTOCOL` за замовчуванням замість :mod:`pickle` протоколу ``3`` під час створення полиць. (Надав Закері Шпітц у :issue:`34204`.)

source: statistics
uk: статистика

source: Add :func:`~statistics.covariance`, Pearson's :func:`~statistics.correlation`, and simple :func:`~statistics.linear_regression` functions. (Contributed by Tymoteusz Wołodźko in :issue:`38490`.)
uk: Додайте :func:`~statistics.covariance`, :func:`~statistics.correlation` Пірсона та прості функції :func:`~statistics.linear_regression`. (Надав Тимотеуш Володзько в :issue:`38490`.)

source: site
uk: сайт

source: socket
uk: гніздо

source: The exception :exc:`socket.timeout` is now an alias of :exc:`TimeoutError`. (Contributed by Christian Heimes in :issue:`42413`.)
uk: Виняток :exc:`socket.timeout` тепер є псевдонімом :exc:`TimeoutError`. (Надав Крістіан Хеймс у :issue:`42413`.)

source: Add option to create MPTCP sockets with ``IPPROTO_MPTCP`` (Contributed by Rui Cunha in :issue:`43571`.)
uk: Додайте параметр для створення сокетів MPTCP за допомогою ``IPPROTO_MPTCP`` (надано Rui Cunha в :issue:`43571`.)

source: Add ``IP_RECVTOS`` option to receive the type of service (ToS) or DSCP/ECN fields (Contributed by Georg Sauthoff in :issue:`44077`.)
uk: Додайте параметр ``IP_RECVTOS``, щоб отримати тип послуги (ToS) або поля DSCP/ECN (Надано Георгом Саутхоффом у :issue:`44077`.)

source: The ssl module requires OpenSSL 1.1.1 or newer. (Contributed by Christian Heimes in :pep:`644` and :issue:`43669`.)
uk: Модуль ssl вимагає OpenSSL 1.1.1 або новішої версії. (Надав Крістіан Хаймес у :pep:`644` і :issue:`43669`.)

source: The ssl module has preliminary support for OpenSSL 3.0.0 and new option :data:`~ssl.OP_IGNORE_UNEXPECTED_EOF`. (Contributed by Christian Heimes in :issue:`38820`, :issue:`43794`, :issue:`43788`, :issue:`43791`, :issue:`43799`, :issue:`43920`, :issue:`43789`, and :issue:`43811`.)
uk: Модуль ssl має попередню підтримку OpenSSL 3.0.0 і нову опцію :data:`~ssl.OP_IGNORE_UNEXPECTED_EOF`. (Надав Крістіан Хаймес у :issue:`38820`, :issue:`43794`, :issue:`43788`, :issue:`43791`, :issue:`43799`, :issue:`43920`, :issue:`43789` і :issue:`43811`.)
