Repository: python/python-docs-uk
Catalog: whatsnew/3.10.po
Languages: uk

source: Deprecated function and use of deprecated constants now result in a :exc:`DeprecationWarning`. :attr:`ssl.SSLContext.options` has :data:`~ssl.OP_NO_SSLv2` and :data:`~ssl.OP_NO_SSLv3` set by default and therefore cannot warn about setting the flag again. The :ref:`deprecation section <whatsnew310-deprecated>` has a list of deprecated features. (Contributed by Christian Heimes in :issue:`43880`.)
uk: Застаріла функція та використання застарілих констант тепер призводять до :exc:`DeprecationWarning`. :attr:`ssl.SSSLContext.options` має :data:`~ssl.OP_NO_SSLv2` і :data:`~ssl.OP_NO_SSLv3` встановлені за замовчуванням і тому не може попередити про повторне встановлення прапора. У розділі :ref:`deprecation <whatsnew310-deprecated>` міститься список застарілих функцій. (Надав Крістіан Хеймс у :issue:`43880`.)

source: The ssl module now has more secure default settings. Ciphers without forward secrecy or SHA-1 MAC are disabled by default. Security level 2 prohibits weak RSA, DH, and ECC keys with less than 112 bits of security. :class:`~ssl.SSLContext` defaults to minimum protocol version TLS 1.2. Settings are based on Hynek Schlawack's research. (Contributed by Christian Heimes in :issue:`43998`.)
uk: Модуль ssl тепер має більш безпечні налаштування за замовчуванням. Шифри без прямої секретності або SHA-1 MAC вимкнено за замовчуванням. Рівень безпеки 2 забороняє слабкі ключі RSA, DH і ECC з менш ніж 112 бітами безпеки. :class:`~ssl.SSLContext` за умовчанням має мінімальну версію протоколу TLS 1.2. Налаштування засновані на дослідженнях Hynek Schlawack. (Надав Крістіан Хеймс у :issue:`43998`.)

source: The deprecated protocols SSL 3.0, TLS 1.0, and TLS 1.1 are no longer officially supported. Python does not block them actively. However OpenSSL build options, distro configurations, vendor patches, and cipher suites may prevent a successful handshake.
uk: Застарілі протоколи SSL 3.0, TLS 1.0 і TLS 1.1 більше не підтримуються офіційно. Python не блокує їх активно. Однак параметри збірки OpenSSL, конфігурації дистрибутива, патчі постачальника та набори шифрів можуть перешкодити успішному рукостисканню.

source: Add a *timeout* parameter to the :func:`ssl.get_server_certificate` function. (Contributed by Zackery Spytz in :issue:`31870`.)
uk: Додайте параметр *timeout* до функції :func:`ssl.get_server_certificate`. (Надав Закері Шпітц у :issue:`31870`.)

source: The ssl module uses heap-types and multi-phase initialization. (Contributed by Christian Heimes in :issue:`42333`.)
uk: Модуль ssl використовує типи купи та багатофазову ініціалізацію. (Надав Крістіан Хеймс у :issue:`42333`.)

source: A new verify flag :data:`~ssl.VERIFY_X509_PARTIAL_CHAIN` has been added. (Contributed by l0x in :issue:`40849`.)
uk: Додано новий прапор перевірки :data:`~ssl.VERIFY_X509_PARTIAL_CHAIN`. (Надано l0x у :issue:`40849`.)

source: Add audit events for :func:`~sqlite3.connect/handle`, :meth:`~sqlite3.Connection.enable_load_extension`, and :meth:`~sqlite3.Connection.load_extension`. (Contributed by Erlend E. Aasland in :issue:`43762`.)
uk: Додайте події аудиту для :func:`~sqlite3.connect/handle`, :meth:`~sqlite3.Connection.enable_load_extension` і :meth:`~sqlite3.Connection.load_extension`. (Надав Erlend E. Aasland у :issue:`43762`.)

source: sys
uk: система

source: Add :data:`sys.orig_argv` attribute: the list of the original command line arguments passed to the Python executable. (Contributed by Victor Stinner in :issue:`23427`.)
uk: Додайте атрибут :data:`sys.orig_argv`: список початкових аргументів командного рядка, переданих у виконуваний файл Python. (Надав Віктор Стіннер у :issue:`23427`.)

source: Add :data:`sys.stdlib_module_names`, containing the list of the standard library module names. (Contributed by Victor Stinner in :issue:`42955`.)
uk: Додайте :data:`sys.stdlib_module_names`, що містить список імен модулів стандартної бібліотеки. (Надав Віктор Стіннер у :issue:`42955`.)

source: :func:`_thread.interrupt_main` now takes an optional signal number to simulate (the default is still :data:`signal.SIGINT`). (Contributed by Antoine Pitrou in :issue:`43356`.)
uk: :func:`_thread.interrupt_main` тепер приймає додатковий номер сигналу для імітації (за замовчуванням все ще :data:`signal.SIGINT`). (Надав Антуан Пітру в :issue:`43356`.)

source: threading
uk: різьблення

source: Add :func:`threading.gettrace` and :func:`threading.getprofile` to retrieve the functions set by :func:`threading.settrace` and :func:`threading.setprofile` respectively. (Contributed by Mario Corchero in :issue:`42251`.)
uk: Додайте :func:`threading.gettrace` і :func:`threading.getprofile`, щоб отримати функції, встановлені :func:`threading.settrace` і :func:`threading.setprofile` відповідно. (Надав Маріо Корчеро в :issue:`42251`.)

source: Add :data:`threading.__excepthook__` to allow retrieving the original value of :func:`threading.excepthook` in case it is set to a broken or a different value. (Contributed by Mario Corchero in :issue:`42308`.)
uk: Додайте :data:`threading.__excepthook__`, щоб дозволити отримати початкове значення :func:`threading.excepthook` у випадку, якщо для нього встановлено пошкоджене або інше значення. (Надав Маріо Корчеро в :issue:`42308`.)

source: traceback
uk: простежити

source: The :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only`, and :func:`~traceback.print_exception` functions can now take an exception object as a positional-only argument. (Contributed by Zackery Spytz and Matthias Bussonnier in :issue:`26389`.)
uk: Функції :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only` і :func:`~traceback.print_exception` тепер можуть приймати об’єкт винятку лише як позиційний аргумент. (Надано Zackery Spytz і Matthias Bussonnier у :issue:`26389`.)

source: types
uk: види

source: Reintroduce the :data:`types.EllipsisType`, :data:`types.NoneType` and :data:`types.NotImplementedType` classes, providing a new set of types readily interpretable by type checkers. (Contributed by Bas van Beek in :issue:`41810`.)
uk: Знову представити класи :data:`types.EllipsisType`, :data:`types.NoneType` і :data:`types.NotImplementedType`, надаючи новий набір типів, які легко інтерпретуються засобами перевірки типів. (Надав Бас ван Бік у :issue:`41810`.)

source: typing
uk: введення тексту

source: For major changes, see :ref:`new-feat-related-type-hints`.
uk: Для основних змін див. :ref:`new-feat-related-type-hints`.

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
uk: Поведінку :class:`typing.Literal` було змінено, щоб вона відповідала :pep:`586` і відповідала поведінці засобів перевірки статичних типів, указаних у PEP.

source: ``Literal`` now de-duplicates parameters.
uk: ``Літерал`` тепер усуває дублікати параметрів.

source: Equality comparisons between ``Literal`` objects are now order independent.
uk: Порівняння рівності між об’єктами ``Literal`` тепер не залежить від порядку.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
uk: ``Літеральні`` порівняння тепер поважають типи. Наприклад, ``Literal[0] == Literal[False]``, попередньо оцінене як ``True``. Тепер це ``False``. Для підтримки цієї зміни внутрішній кеш типів тепер підтримує розрізняючі типи.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with unhashable parameters will not throw an error::
uk: Об’єкти ``Literal`` тепер створюватимуть виняток :exc:`TypeError` під час порівняння рівності, якщо будь-який з їхніх параметрів не :term:`hashable`. Зауважте, що оголошення ``Literal`` з нехешованими параметрами не викличе помилку:

source: (Contributed by Yurii Karabas in :issue:`42345`.)
uk: (Надав Юрій Карабас у :issue:`42345`.)

source: Add new function :func:`typing.is_typeddict` to introspect if an annotation is a :class:`typing.TypedDict`. (Contributed by Patrick Reader in :issue:`41792`)
uk: Додайте нову функцію :func:`typing.is_typeddict`, щоб перевірити, чи є анотація :class:`typing.TypedDict`. (Надав Патрік Рідер у :issue:`41792`)

source: Subclasses of ``typing.Protocol`` which only have data variables declared will now raise a ``TypeError`` when checked with ``isinstance`` unless they are decorated with :func:`runtime_checkable`. Previously, these checks passed silently. Users should decorate their subclasses with the :func:`runtime_checkable` decorator if they want runtime protocols. (Contributed by Yurii Karabas in :issue:`38908`)
uk: Підкласи ``typing.Protocol``, які мають лише оголошені змінні даних, тепер викличуть ``TypeError`` під час перевірки ``isinstance``, якщо вони не прикрашені :func:`runtime_checkable`. Раніше ці перевірки проходили мовчки. Користувачі повинні прикрасити свої підкласи декоратором :func:`runtime_checkable`, якщо їм потрібні протоколи виконання. (Надав Юрій Карабас у :issue:`38908`)

source: Importing from the ``typing.io`` and ``typing.re`` submodules will now emit :exc:`DeprecationWarning`. These submodules have been deprecated since Python 3.8 and will be removed in a future version of Python. Anything belonging to those submodules should be imported directly from :mod:`typing` instead. (Contributed by Sebastian Rittau in :issue:`38291`)
uk: Імпорт із субмодулів ``typing.io`` і ``typing.re`` тепер видасть :exc:`DeprecationWarning`. Ці підмодулі застаріли з Python 3.8 і будуть видалені в наступній версії Python. Усе, що належить до цих підмодулів, слід імпортувати безпосередньо з :mod:`typing`. (Надав Себастьян Ріттау в :issue:`38291`)

source: Add new method :meth:`~unittest.TestCase.assertNoLogs` to complement the existing :meth:`~unittest.TestCase.assertLogs`. (Contributed by Kit Yan Choi in :issue:`39385`.)
uk: Додайте новий метод :meth:`~unittest.TestCase.assertNoLogs`, щоб доповнити існуючий :meth:`~unittest.TestCase.assertLogs`. (Надав Кіт Ян Чой у :issue:`39385`.)

source: Python versions earlier than Python 3.10 allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
uk: Версії Python, раніші за Python 3.10, дозволяли використовувати як ``;``, так і ``&`` як роздільники параметрів запиту в :func:`urllib.parse.parse_qs` і :func:`urllib.parse.parse_qsl`. З міркувань безпеки та для відповідності новим рекомендаціям W3C це було змінено, щоб дозволити лише один роздільний ключ із ``&`` за замовчуванням. Ця зміна також впливає на :func:`cgi.parse` і :func:`cgi.parse_multipart`, оскільки вони використовують уражені функції внутрішньо. Щоб дізнатися більше, перегляньте відповідну документацію. (Надано Адамом Ґолдшмідтом, Сентилом Кумараном і Кеном Джином у :issue:`42967`.)

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :issue:`43882`)
uk: Наявність символів нового рядка або табуляції в частинах URL-адреси дозволяє здійснювати деякі форми атак. Відповідно до специфікації WHATWG, яка оновлює :rfc:`3986`, символи нового рядка ASCII ``\n``, ``\r`` і табуляції ``\t`` видаляються з URL-адреси аналізатором у :mod:`urllib.parse` запобігання таким атакам. Символи видалення контролюються новою змінною рівня модуля ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Див :issue:`43882`)

source: Add a :class:`~xml.sax.handler.LexicalHandler` class to the :mod:`xml.sax.handler` module. (Contributed by Jonathan Gossage and Zackery Spytz in :issue:`35018`.)
uk: Додайте клас :class:`~xml.sax.handler.LexicalHandler` до модуля :mod:`xml.sax.handler`. (Надано Джонатаном Госседжем і Закері Шпітцем у :issue:`35018`.)

source: Add methods related to :pep:`451`: :meth:`~zipimport.zipimporter.find_spec`, :meth:`zipimport.zipimporter.create_module`, and :meth:`zipimport.zipimporter.exec_module`. (Contributed by Brett Cannon in :issue:`42131`.)
uk: Додайте методи, пов’язані з :pep:`451`: :meth:`~zipimport.zipimporter.find_spec`, :meth:`zipimport.zipimporter.create_module` і :meth:`zipimport.zipimporter.exec_module`. (Надано Бреттом Кенноном у :issue:`42131`.)

source: Add :meth:`~zipimport.zipimporter.invalidate_caches` method. (Contributed by Desmond Cheong in :issue:`14678`.)
uk: Додайте метод :meth:`~zipimport.zipimporter.invalidate_caches`. (Надав Десмонд Чеонг у :issue:`14678`.)

source: Optimizations
uk: Оптимізації

source: Constructors :func:`str`, :func:`bytes` and :func:`bytearray` are now faster (around 30--40% for small objects). (Contributed by Serhiy Storchaka in :issue:`41334`.)
uk: Конструктори :func:`str`, :func:`bytes` і :func:`bytearray` тепер швидші (близько 30--40% для малих об’єктів). (Надав Сергій Сторчака в :issue:`41334`.)

source: The :mod:`runpy` module now imports fewer modules. The ``python3 -m module-name`` command startup time is 1.4x faster in average. On Linux, ``python3 -I -m module-name`` imports 69 modules on Python 3.9, whereas it only imports 51 modules (-18) on Python 3.10. (Contributed by Victor Stinner in :issue:`41006` and :issue:`41718`.)
uk: Модуль :mod:`runpy` тепер імпортує менше модулів. Час запуску команди ``python3 -m назва модуля`` в середньому в 1,4 рази швидший. У Linux ``python3 -I -m назва-модуля`` імпортує 69 модулів у Python 3.9, тоді як у Python 3.10 він імпортує лише 51 модуль (-18). (Надав Віктор Стіннер у :issue:`41006` і :issue:`41718`.)

source: The ``LOAD_ATTR`` instruction now uses new "per opcode cache" mechanism. It is about 36% faster now for regular attributes and 44% faster for slots. (Contributed by Pablo Galindo and Yury Selivanov in :issue:`42093` and Guido van Rossum in :issue:`42927`, based on ideas implemented originally in PyPy and MicroPython.)
uk: Інструкція ``LOAD_ATTR`` тепер використовує новий механізм "кешу коду операції". Це приблизно на 36% швидше для звичайних атрибутів і на 44% швидше для слотів. (Надано Пабло Галіндо та Юрієм Селівановим у :issue:`42093` та Гвідо ван Россумом у :issue:`42927`, на основі ідей, спочатку реалізованих у PyPy та MicroPython.)

source: When building Python with :option:`--enable-optimizations` now ``-fno-semantic-interposition`` is added to both the compile and link line. This speeds builds of the Python interpreter created with :option:`--enable-shared` with ``gcc`` by up to 30%. See `this article <https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/>`_ for more details. (Contributed by Victor Stinner and Pablo Galindo in :issue:`38980`.)
uk: Під час створення Python за допомогою :option:`--enable-optimizations` тепер ``-fno-semantic-interposition`` додається до рядка компіляції та посилання. Це прискорює збірки інтерпретатора Python, створеного за допомогою :option:`--enable-shared` з ``gcc``, до 30%. Перегляньте `цю статтю <https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/>`_ для отримання додаткової інформації. (Надано Віктором Стіннером і Пабло Галіндо в :issue:`38980`.)

source: Use a new output buffer management code for :mod:`bz2` / :mod:`lzma` / :mod:`zlib` modules, and add ``.readall()`` function to ``_compression.DecompressReader`` class. bz2 decompression is now 1.09x ~ 1.17x faster, lzma decompression 1.20x ~ 1.32x faster, ``GzipFile.read(-1)`` 1.11x ~ 1.18x faster. (Contributed by Ma Lin, reviewed by Gregory P. Smith, in :issue:`41486`)
uk: Використовуйте новий код керування вихідним буфером для модулів :mod:`bz2` / :mod:`lzma` / :mod:`zlib` і додайте функцію ``.readall()`` до класу ``_compression.DecompressReader`` . Декомпресія bz2 тепер швидша в 1,09x ~ 1,17x, декомпресія lzma — у 1,20x ~ 1,32x, ``GzipFile.read(-1)`` — у 1,11x ~ 1,18x швидше. (Надав Ма Лін, рецензував Грегорі П. Сміт, у :issue:`41486`)

source: When using stringized annotations, annotations dicts for functions are no longer created when the function is created. Instead, they are stored as a tuple of strings, and the function object lazily converts this into the annotations dict on demand. This optimization cuts the CPU time needed to define an annotated function by half. (Contributed by Yurii Karabas and Inada Naoki in :issue:`42202`)
uk: У разі використання рядкових анотацій диктофони анотацій для функцій більше не створюються під час створення функції. Замість цього вони зберігаються як кортеж рядків, а об’єкт функції ліниво перетворює це в dict анотацій на вимогу. Ця оптимізація вдвічі скорочує час процесора, необхідний для визначення анотованої функції. (Надано Юрієм Карабасом та Інадою Наокі в :issue:`42202`)

source: Substring search functions such as ``str1 in str2`` and ``str2.find(str1)`` now sometimes use Crochemore & Perrin's "Two-Way" string searching algorithm to avoid quadratic behavior on long strings. (Contributed by Dennis Sweeney in :issue:`41972`)
uk: Функції пошуку підрядків, такі як ``str1 in str2`` і ``str2.find(str1)``, тепер іноді використовують "двосторонній" алгоритм пошуку рядків Crochemore & Perrin, щоб уникнути квадратичної поведінки довгих рядків. (Надав Денніс Суїні в :issue:`41972`)

source: Add micro-optimizations to ``_PyType_Lookup()`` to improve type attribute cache lookup performance in the common case of cache hits. This makes the interpreter 1.04 times faster on average. (Contributed by Dino Viehland in :issue:`43452`)
uk: Додайте мікрооптимізацію до ``_PyType_Lookup()``, щоб покращити продуктивність пошуку атрибутів типу в кеші у звичайному випадку звернень до кешу. Це робить перекладач у середньому в 1,04 рази швидшим. (Надав Діно Віланд у :issue:`43452`)

source: The following built-in functions now support the faster :pep:`590` vectorcall calling convention: :func:`map`, :func:`filter`, :func:`reversed`, :func:`bool` and :func:`float`. (Contributed by Dong-hee Na and Jeroen Demeyer in :issue:`43575`, :issue:`43287`, :issue:`41922`, :issue:`41873` and :issue:`41870`)
uk: Наступні вбудовані функції тепер підтримують швидший режим виклику векторних викликів :pep:`590`: :func:`map`, :func:`filter`, :func:`reversed`, :func:`bool` і :func:`float`. (Надано Dong-hee Na та Jeroen Demeyer у :issue:`43575`, :issue:`43287`, :issue:`41922`, :issue:`41873` та :issue:`41870`)

source: :class:`BZ2File` performance is improved by removing internal ``RLock``. This makes :class:`BZ2File` thread unsafe in the face of multiple simultaneous readers or writers, just like its equivalent classes in :mod:`gzip` and :mod:`lzma` have always been. (Contributed by Inada Naoki in :issue:`43785`).
uk: Продуктивність :class:`BZ2File` покращено шляхом видалення внутрішнього ``RLock``. Це робить потік :class:`BZ2File` небезпечним перед обличчям кількох одночасних читачів або записувачів, як завжди були його еквівалентні класи в :mod:`gzip` і :mod:`lzma`. (Надано Інадою Наокі в :issue:`43785`).

source: Deprecated
uk: Застаріле

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). Starting in this release, a deprecation warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In future releases it will be changed to syntax warning, and finally to syntax error. (Contributed by Serhiy Storchaka in :issue:`43833`).
uk: Наразі Python приймає числові літерали, за якими слідують ключові слова, наприклад ``0in x``, ``1or x``, ``0if 1else 2``. Він допускає незрозумілі та неоднозначні вирази, такі як ``[0x1 для x в y]`` (що можна інтерпретувати як ``[0x1 для x в y]`` або ``[0x1f або x в y]``). Починаючи з цього випуску, якщо за числовим літералом безпосередньо слідує одне з ключових слів :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` і :keyword:`or`. У наступних випусках його буде змінено на синтаксичне попередження та, нарешті, на синтаксичну помилку. (Надав Сергій Сторчака в :issue:`43833`).

source: Starting in this release, there will be a concerted effort to begin cleaning up old import semantics that were kept for Python 2.7 compatibility. Specifically, :meth:`~importlib.abc.PathEntryFinder.find_loader`/:meth:`~importlib.abc.Finder.find_module` (superseded by :meth:`~importlib.abc.Finder.find_spec`), :meth:`~importlib.abc.Loader.load_module` (superseded by :meth:`~importlib.abc.Loader.exec_module`), :meth:`~importlib.abc.Loader.module_repr` (which the import system takes care of for you), the ``__package__`` attribute (superseded by ``__spec__.parent``), the ``__loader__`` attribute (superseded by ``__spec__.loader``), and the ``__cached__`` attribute (superseded by ``__spec__.cached``) will slowly be removed (as well as other classes and methods in :mod:`importlib`). :exc:`ImportWarning` and/or :exc:`DeprecationWarning` will be raised as appropriate to help identify code which needs updating during this transition.
uk: Починаючи з цього випуску, будуть узгоджені зусилля, щоб розпочати очищення старої семантики імпорту, яка була збережена для сумісності з Python 2.7. Зокрема, :meth:`~importlib.abc.PathEntryFinder.find_loader`/:meth:`~importlib.abc.Finder.find_module` (замінено :meth:`~importlib.abc.Finder.find_spec`), :meth:`~importlib.abc.Loader.load_module` (замінений :meth:`~importlib.abc.Loader.exec_module`), :meth:`~importlib.abc.Loader.module_repr` (про який дбає система імпорту ви), атрибут ``__package__`` (замінений ``__spec__.parent``), атрибут ``__loader__`` (замінений ``__spec__.loader``) і ``__cached__`` атрибут ( замінений на ``__spec__.cached``) буде повільно видалено (як і інші класи та методи в :mod:`importlib`). :exc:`ImportWarning` та/або :exc:`DeprecationWarning` буде піднято відповідно, щоб допомогти визначити код, який потребує оновлення під час цього переходу.

source: The entire ``distutils`` namespace is deprecated, to be removed in Python 3.12. Refer to the :ref:`module changes <distutils-deprecated>` section for more information.
uk: Весь простір імен ``distutils`` застарів, його буде видалено в Python 3.12. Зверніться до розділу :ref:`зміни модуля <distutils-deprecated>` для отримання додаткової інформації.

source: Non-integer arguments to :func:`random.randrange` are deprecated. The :exc:`ValueError` is deprecated in favor of a :exc:`TypeError`. (Contributed by Serhiy Storchaka and Raymond Hettinger in :issue:`37319`.)
uk: Нецілочисельні аргументи :func:`random.randrange` застаріли. Помилка :exc:`ValueError` застаріла на користь :exc:`TypeError`. (Надано Сергієм Сторчакою та Раймондом Геттінгером у :issue:`37319`.)
