Repository: python/python-docs-uk
Catalog: whatsnew/3.10.po
Languages: uk

source: The non-limited API files ``odictobject.h``, ``parser_interface.h``, ``picklebufobject.h``, ``pyarena.h``, ``pyctype.h``, ``pydebug.h``, ``pyfpe.h``, and ``pytime.h`` have been moved to the ``Include/cpython`` directory. These files must not be included directly, as they are already included in ``Python.h``: :ref:`Include Files <api-includes>`. If they have been included directly, consider including ``Python.h`` instead. (Contributed by Nicholas Sim in :issue:`35134`)
uk: Необмежені файли API ``odictobject.h``, ``parser_interface.h``, ``picklebufobject.h``, ``pyarena.h``, ``pyctype.h``, ``pydebug. h``, ``pyfpe.h`` і ``pytime.h`` переміщено до каталогу ``Include/cpython``. Ці файли не можна включати безпосередньо, оскільки вони вже включені в ``Python.h``: :ref:`Включити файли <api-includes>`. Якщо їх було включено напряму, подумайте про те, щоб натомість включити ``Python.h``. (Надав Ніколас Сім у :issue:`35134`)

source: Use the :c:data:`Py_TPFLAGS_IMMUTABLETYPE` type flag to create immutable type objects. Do not rely on :c:data:`Py_TPFLAGS_HEAPTYPE` to decide if a type object is mutable or not; check if :c:data:`Py_TPFLAGS_IMMUTABLETYPE` is set instead. (Contributed by Victor Stinner and Erlend E. Aasland in :issue:`43908`.)
uk: Використовуйте позначку типу :c:data:`Py_TPFLAGS_IMMUTABLETYPE` для створення об’єктів незмінного типу. Не покладайтеся на :c:data:`Py_TPFLAGS_HEAPTYPE`, щоб вирішити, чи є об’єкт типу змінним чи ні; перевірте, чи замість цього встановлено :c:data:`Py_TPFLAGS_IMMUTABLETYPE`. (Надано Віктором Стіннером та Ерлендом Е. Асландом у :issue:`43908`.)

source: The undocumented function ``Py_FrozenMain`` has been removed from the limited API. The function is mainly useful for custom builds of Python. (Contributed by Petr Viktorin in :issue:`26241`)
uk: Недокументовану функцію ``Py_FrozenMain`` було видалено з обмеженого API. Ця функція в основному корисна для нестандартних збірок Python. (Надав Петро Вікторін у :issue:`26241`)

source: The ``PyUnicode_InternImmortal()`` function is now deprecated and will be removed in Python 3.12: use :c:func:`PyUnicode_InternInPlace` instead. (Contributed by Victor Stinner in :issue:`41692`.)
uk: Функція ``PyUnicode_InternImmortal()`` тепер застаріла та буде видалена в Python 3.12: замість неї використовуйте :c:func:`PyUnicode_InternInPlace`. (Надав Віктор Стіннер у :issue:`41692`.)

source: Removed ``Py_UNICODE_str*`` functions manipulating ``Py_UNICODE*`` strings. (Contributed by Inada Naoki in :issue:`41123`.)
uk: Видалено функції ``Py_UNICODE_str*``, які маніпулюють рядками ``Py_UNICODE*``. (Надано Інадою Наокі в :issue:`41123`.)

source: ``Py_UNICODE_strlen``: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
uk: ``Py_UNICODE_strlen``: використовуйте :c:func:`PyUnicode_GetLength` або :c:macro:`PyUnicode_GET_LENGTH`

source: ``Py_UNICODE_strcat``: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
uk: ``Py_UNICODE_strcat``: використовуйте :c:func:`PyUnicode_CopyCharacters` або :c:func:`PyUnicode_FromFormat`

source: ``Py_UNICODE_strcpy``, ``Py_UNICODE_strncpy``: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
uk: ``Py_UNICODE_strcpy``, ``Py_UNICODE_strncpy``: використовуйте :c:func:`PyUnicode_CopyCharacters` або :c:func:`PyUnicode_Substring`

source: ``Py_UNICODE_strcmp``: use :c:func:`PyUnicode_Compare`
uk: ``Py_UNICODE_strcmp``: використовуйте :c:func:`PyUnicode_Compare`

source: ``Py_UNICODE_strncmp``: use :c:func:`PyUnicode_Tailmatch`
uk: ``Py_UNICODE_strncmp``: використовуйте :c:func:`PyUnicode_Tailmatch`

source: ``Py_UNICODE_strchr``, ``Py_UNICODE_strrchr``: use :c:func:`PyUnicode_FindChar`
uk: ``Py_UNICODE_strchr``, ``Py_UNICODE_strrchr``: використовуйте :c:func:`PyUnicode_FindChar`

source: Removed ``PyUnicode_GetMax()``. Please migrate to new (:pep:`393`) APIs. (Contributed by Inada Naoki in :issue:`41103`.)
uk: Видалено ``PyUnicode_GetMax()``. Будь ласка, перейдіть на нові (:pep:`393`) API. (Надано Інадою Наокі в :issue:`41103`.)

source: Removed ``PyLong_FromUnicode()``. Please migrate to :c:func:`PyLong_FromUnicodeObject`. (Contributed by Inada Naoki in :issue:`41103`.)
uk: Видалено ``PyLong_FromUnicode()``. Будь ласка, перейдіть до :c:func:`PyLong_FromUnicodeObject`. (Надано Інадою Наокі в :issue:`41103`.)

source: Removed ``PyUnicode_AsUnicodeCopy()``. Please use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString` (Contributed by Inada Naoki in :issue:`41103`.)
uk: Видалено ``PyUnicode_AsUnicodeCopy()``. Будь ласка, використовуйте :c:func:`PyUnicode_AsUCS4Copy` або :c:func:`PyUnicode_AsWideCharString` (Надано Інадою Наокі в :issue:`41103`.)

source: Removed ``_Py_CheckRecursionLimit`` variable: it has been replaced by ``ceval.recursion_limit`` of the :c:type:`PyInterpreterState` structure. (Contributed by Victor Stinner in :issue:`41834`.)
uk: Видалено змінну ``_Py_CheckRecursionLimit``: її було замінено ``ceval.recursion_limit`` структури :c:type:`PyInterpreterState`. (Надав Віктор Стіннер у :issue:`41834`.)

source: Removed undocumented macros ``Py_ALLOW_RECURSION`` and ``Py_END_ALLOW_RECURSION`` and the ``recursion_critical`` field of the :c:type:`PyInterpreterState` structure. (Contributed by Serhiy Storchaka in :issue:`41936`.)
uk: Видалено недокументовані макроси ``Py_ALLOW_RECURSION`` і ``Py_END_ALLOW_RECURSION``, а також поле ``recursion_critical`` структури :c:type:`PyInterpreterState`. (Надав Сергій Сторчака в :issue:`41936`.)

source: Removed the undocumented ``PyOS_InitInterrupts()`` function. Initializing Python already implicitly installs signal handlers: see :c:member:`PyConfig.install_signal_handlers`. (Contributed by Victor Stinner in :issue:`41713`.)
uk: Видалено недокументовану функцію ``PyOS_InitInterrupts()``. Ініціалізація Python вже неявно встановлює обробники сигналів: див. :c:member:`PyConfig.install_signal_handlers`. (Надав Віктор Стіннер у :issue:`41713`.)

source: Remove the ``PyAST_Validate()`` function. It is no longer possible to build a AST object (``mod_ty`` type) with the public C API. The function was already excluded from the limited C API (:pep:`384`). (Contributed by Victor Stinner in :issue:`43244`.)
uk: Видаліть функцію ``PyAST_Validate()``. Більше неможливо створити об’єкт AST (тип ``mod_ty``) за допомогою загальнодоступного C API. Функцію вже було виключено з обмеженого C API (:pep:`384`). (Надав Віктор Стіннер у :issue:`43244`.)

source: Remove the ``symtable.h`` header file and the undocumented functions:
uk: Видаліть файл заголовка ``symtable.h`` і недокументовані функції:

source: The ``Py_SymtableString()`` function was part the stable ABI by mistake but it could not be used, because the ``symtable.h`` header file was excluded from the limited C API.
uk: Функція ``Py_SymtableString()`` була частиною стабільного ABI помилково, але її не можна було використовувати, оскільки файл заголовка ``symtable.h`` було виключено з обмеженого C API.

source: Use Python :mod:`symtable` module instead. (Contributed by Victor Stinner in :issue:`43244`.)
uk: Натомість використовуйте модуль Python :mod:`symtable`. (Надав Віктор Стіннер у :issue:`43244`.)

source: Remove :c:func:`PyOS_ReadlineFunctionPointer` from the limited C API headers and from ``python3.dll``, the library that provides the stable ABI on Windows. Since the function takes a ``FILE*`` argument, its ABI stability cannot be guaranteed. (Contributed by Petr Viktorin in :issue:`43868`.)
uk: Видаліть :c:func:`PyOS_ReadlineFunctionPointer` з обмежених заголовків C API і з ``python3.dll``, бібліотеки, яка забезпечує стабільний ABI у Windows. Оскільки функція приймає аргумент ``FILE*``, її стабільність ABI не може бути гарантована. (Надав Петро Вікторін у :issue:`43868`.)

source: Remove ``ast.h``, ``asdl.h``, and ``Python-ast.h`` header files. These functions were undocumented and excluded from the limited C API. Most names defined by these header files were not prefixed by ``Py`` and so could create names conflicts. For example, ``Python-ast.h`` defined a ``Yield`` macro which was conflict with the ``Yield`` name used by the Windows ``<winbase.h>`` header. Use the Python :mod:`ast` module instead. (Contributed by Victor Stinner in :issue:`43244`.)
uk: Видаліть файли заголовків ``ast.h``, ``asdl.h`` і ``Python-ast.h``. Ці функції були недокументовані та виключені з обмеженого C API. Більшість імен, визначених цими файлами заголовків, не мали префікса ``Py`` і тому могли спричиняти конфлікти імен. Наприклад, ``Python-ast.h`` визначив макрос ``Yield``, який конфліктував з назвою ``Yield``, що використовується заголовком Windows ``<winbase.h>``. Натомість використовуйте модуль Python :mod:`ast`. (Надав Віктор Стіннер у :issue:`43244`.)

source: Remove the compiler and parser functions using ``struct _mod`` type, because the public AST C API was removed:
uk: Видаліть функції компілятора та аналізатора за допомогою типу ``struct _mod``, оскільки загальнодоступний API AST C було видалено:

source: These functions were undocumented and excluded from the limited C API. (Contributed by Victor Stinner in :issue:`43244`.)
uk: Ці функції були недокументовані та виключені з обмеженого C API. (Надав Віктор Стіннер у :issue:`43244`.)

source: Remove the ``pyarena.h`` header file with functions:
uk: Видаліть заголовний файл ``pyarena.h`` із функціями:

source: These functions were undocumented, excluded from the limited C API, and were only used internally by the compiler. (Contributed by Victor Stinner in :issue:`43244`.)
uk: Ці функції були незадокументовані, виключені з обмеженого API C і використовувалися лише внутрішньо компілятором. (Надав Віктор Стіннер у :issue:`43244`.)

source: The ``PyThreadState.use_tracing`` member has been removed to optimize Python. (Contributed by Mark Shannon in :issue:`43760`.)
uk: Для оптимізації Python було видалено член ``PyThreadState.use_tracing``. (Надав Марк Шеннон у :issue:`43760`.)
