Repository: python/python-docs-uk
Catalog: whatsnew/3.2.po
Languages: uk

source: To help write classes with rich comparison methods, a new decorator :func:`functools.total_ordering` will use existing equality and inequality methods to fill in the remaining methods.
uk: Щоб допомогти писати класи з розширеними методами порівняння, новий декоратор :func:`functools.total_ordering` використовуватиме існуючі методи рівності та нерівності для заповнення решти методів.

source: For example, supplying *__eq__* and *__lt__* will enable :func:`~functools.total_ordering` to fill-in *__le__*, *__gt__* and *__ge__*::
uk: Наприклад, введення *__eq__* і *__lt__* дозволить :func:`~functools.total_ordering` заповнити *__le__*, *__gt__* і *__ge__*::

source: With the *total_ordering* decorator, the remaining comparison methods are filled in automatically.
uk: За допомогою декоратора *total_ordering* решта методів порівняння заповнюється автоматично.

source: (Contributed by Raymond Hettinger.)
uk: (Надав Реймонд Геттінгер.)

source: To aid in porting programs from Python 2, the :func:`functools.cmp_to_key` function converts an old-style comparison function to modern :term:`key function`:
uk: Щоб допомогти у перенесенні програм із Python 2, функція :func:`functools.cmp_to_key` перетворює стару функцію порівняння на сучасну :term:`key function`:

source: For sorting examples and a brief sorting tutorial, see the `Sorting HowTo <https://wiki.python.org/moin/HowTo/Sorting/>`_ tutorial.
uk: Приклади сортування та короткий посібник із сортування див. у посібнику `Sorting HowTo <https://wiki.python.org/moin/HowTo/Sorting/>`_.

source: The :mod:`itertools` module has a new :func:`~itertools.accumulate` function modeled on APL's *scan* operator and Numpy's *accumulate* function:
uk: Модуль :mod:`itertools` має нову функцію :func:`~itertools.accumulate`, створену на основі оператора *scan* APL і функції *accumulate* Numpy:

source: For an example using :func:`~itertools.accumulate`, see the :ref:`examples for the random module <random-examples>`.
uk: Для прикладу використання :func:`~itertools.accumulate` див. :ref:`приклади для випадкового модуля <random-examples>`.

source: (Contributed by Raymond Hettinger and incorporating design suggestions from Mark Dickinson.)
uk: (Надано Реймондом Геттінгером і враховано пропозиції щодо дизайну Марка Дікінсона.)

source: collections
uk: колекції

source: The :class:`collections.Counter` class now has two forms of in-place subtraction, the existing *-=* operator for `saturating subtraction <https://en.wikipedia.org/wiki/Saturation_arithmetic>`_ and the new :meth:`~collections.Counter.subtract` method for regular subtraction. The former is suitable for `multisets <https://en.wikipedia.org/wiki/Multiset>`_ which only have positive counts, and the latter is more suitable for use cases that allow negative counts:
uk: Клас :class:`collections.Counter` тепер має дві форми віднімання на місці, наявний оператор *-=* для `насиченого віднімання <https://en.wikipedia.org/wiki/Saturation_arithmetic>`_ і новий метод :meth:`~collections.Counter.subtract` для звичайне віднімання. Перший підходить для `мультимножин <https://en.wikipedia.org/wiki/Multiset>`_, які мають лише позитивні підрахунки, а другий більше підходить для випадків використання, які дозволяють негативні підрахунки:

source: The :class:`collections.OrderedDict` class has a new method :meth:`~collections.OrderedDict.move_to_end` which takes an existing key and moves it to either the first or last position in the ordered sequence.
uk: Клас :class:`collections.OrderedDict` має новий метод :meth:`~collections.OrderedDict.move_to_end`, який бере наявний ключ і переміщує його на першу чи останню позицію в упорядкованій послідовності.

source: The default is to move an item to the last position. This is equivalent of renewing an entry with ``od[k] = od.pop(k)``.
uk: За замовчуванням елемент переміщується на останню позицію. Це еквівалентно оновленню запису за допомогою ``od[k] = od.pop(k)``.

source: A fast move-to-end operation is useful for resequencing entries. For example, an ordered dictionary can be used to track order of access by aging entries from the oldest to the most recently accessed.
uk: Операція швидкого переходу до кінця корисна для зміни послідовності записів. Наприклад, упорядкований словник можна використовувати для відстеження порядку доступу шляхом старіння записів від найстаріших до найновіших.

source: The :class:`collections.deque` class grew two new methods :meth:`~collections.deque.count` and :meth:`~collections.deque.reverse` that make them more substitutable for :class:`list` objects:
uk: У класі :class:`collections.deque` з’явилися два нові методи :meth:`~collections.deque.count` і :meth:`~collections.deque.reverse`, що робить їх більш доступними для об’єктів :class:`list` :

source: threading
uk: різьблення

source: The :mod:`threading` module has a new :class:`~threading.Barrier` synchronization class for making multiple threads wait until all of them have reached a common barrier point. Barriers are useful for making sure that a task with multiple preconditions does not run until all of the predecessor tasks are complete.
uk: Модуль :mod:`threading` має новий клас синхронізації :class:`~threading.Barrier` для того, щоб кілька потоків чекали, поки всі вони досягнуть спільної точки перешкоди. Бар’єри корисні для забезпечення того, щоб завдання з кількома попередніми умовами не запускалося, доки не будуть виконані всі завдання-попередники.

source: Barriers can work with an arbitrary number of threads. This is a generalization of a `Rendezvous <https://en.wikipedia.org/wiki/Synchronous_rendezvous>`_ which is defined for only two threads.
uk: Бар'єри можуть працювати з довільною кількістю потоків. Це узагальнення `Rendezvous <https://en.wikipedia.org/wiki/Synchronous_rendezvous>`_, яке визначено лише для двох потоків.

source: Implemented as a two-phase cyclic barrier, :class:`~threading.Barrier` objects are suitable for use in loops. The separate *filling* and *draining* phases assure that all threads get released (drained) before any one of them can loop back and re-enter the barrier. The barrier fully resets after each cycle.
uk: Реалізовані як двофазний циклічний бар’єр, об’єкти :class:`~threading.Barrier` підходять для використання в циклах. Окремі фази *заповнення* та *виливання* гарантують, що всі потоки будуть звільнені (осушені) до того, як будь-який з них зможе повернутися назад і знову увійти в бар’єр. Після кожного циклу бар’єр повністю скидається.

source: Example of using barriers::
uk: Приклад використання бар'єрів::

source: In this example, the barrier enforces a rule that votes cannot be counted at any polling site until all polls are closed. Notice how a solution with a barrier is similar to one with :meth:`threading.Thread.join`, but the threads stay alive and continue to do work (summarizing ballots) after the barrier point is crossed.
uk: У цьому прикладі бар’єр забезпечує виконання правила, згідно з яким голоси не можуть бути підраховані на жодній виборчій дільниці, доки всі виборчі дільниці не будуть закриті. Зверніть увагу, що рішення з бар’єром схоже на рішення з :meth:`threading.Thread.join`, але потоки залишаються живими та продовжують виконувати роботу (підсумовуючи бюлетені) після перетину точки бар’єру.

source: If any of the predecessor tasks can hang or be delayed, a barrier can be created with an optional *timeout* parameter. Then if the timeout period elapses before all the predecessor tasks reach the barrier point, all waiting threads are released and a :exc:`~threading.BrokenBarrierError` exception is raised::
uk: Якщо будь-яке з попередніх завдань може зависати або відкладатися, можна створити бар’єр за допомогою додаткового параметра *timeout*. Потім, якщо період очікування мине до того, як усі завдання-попередники досягнуть точки бар’єру, усі потоки, що очікують, звільняються та виникає виняток :exc:`~threading.BrokenBarrierError`::

source: In this example, the barrier enforces a more robust rule. If some election sites do not finish before midnight, the barrier times-out and the ballots are sealed and deposited in a queue for later handling.
uk: У цьому прикладі бар’єр забезпечує більш надійне правило. Якщо деякі виборчі дільниці не закінчуються до опівночі, шлагбаум закінчується, а бюлетені запечатуються та залишаються в черзі для подальшої обробки.

source: See `Barrier Synchronization Patterns <http://osl.cs.illinois.edu/media/papers/karmani-2009-barrier_synchronization_pattern.pdf>`_ for more examples of how barriers can be used in parallel computing. Also, there is a simple but thorough explanation of barriers in `The Little Book of Semaphores <https://greenteapress.com/semaphores/LittleBookOfSemaphores.pdf>`_, *section 3.6*.
uk: Перегляньте `Шаблони синхронізації бар’єрів <http://osl.cs.illinois.edu/media/papers/karmani-2009-barrier_synchronization_pattern.pdf>`_, щоб дізнатися більше про те, як можна використовувати бар’єри в паралельних обчисленнях. Крім того, є просте, але докладне пояснення бар’єрів у `Маленькій книзі семафорів <https://greenteapress.com/semaphores/LittleBookOfSemaphores.pdf>`_, *розділ 3.6*.

source: (Contributed by Kristján Valur Jónsson with an API review by Jeffrey Yasskin in :issue:`8777`.)
uk: (Надав Крістіян Валур Йонссон із оглядом API Джеффрі Яскіним у :issue:`8777`.)

source: datetime and time
uk: дата, час і час

source: The :mod:`datetime` module has a new type :class:`~datetime.timezone` that implements the :class:`~datetime.tzinfo` interface by returning a fixed UTC offset and timezone name. This makes it easier to create timezone-aware datetime objects::
uk: Модуль :mod:`datetime` має новий тип :class:`~datetime.timezone`, який реалізує інтерфейс :class:`~datetime.tzinfo` шляхом повернення фіксованого зміщення UTC і назви часового поясу. Це полегшує створення об’єктів datetime з урахуванням часового поясу:

source: Also, :class:`~datetime.timedelta` objects can now be multiplied by :class:`float` and divided by :class:`float` and :class:`int` objects. And :class:`~datetime.timedelta` objects can now divide one another.
uk: Крім того, об’єкти :class:`~datetime.timedelta` тепер можна помножити на :class:`float` і розділити на об’єкти :class:`float` і :class:`int`. І об’єкти :class:`~datetime.timedelta` тепер можуть розділяти один одного.

source: The :meth:`datetime.date.strftime` method is no longer restricted to years after 1900. The new supported year range is from 1000 to 9999 inclusive.
uk: Метод :meth:`datetime.date.strftime` більше не обмежується роками після 1900. Новий підтримуваний діапазон років становить від 1000 до 9999 включно.

source: Whenever a two-digit year is used in a time tuple, the interpretation has been governed by :attr:`time.accept2dyear`. The default is ``True`` which means that for a two-digit year, the century is guessed according to the POSIX rules governing the ``%y`` strptime format.
uk: Щоразу, коли в кортежі часу використовується двозначний рік, інтерпретація регулюється :attr:`time.accept2dyear`. Типовим значенням є ``True``, що означає, що для двозначного року століття вгадується відповідно до правил POSIX, які регулюють формат strptime ``%y``.

source: Starting with Py3.2, use of the century guessing heuristic will emit a :exc:`DeprecationWarning`. Instead, it is recommended that :attr:`time.accept2dyear` be set to ``False`` so that large date ranges can be used without guesswork::
uk: Починаючи з Py3.2, використання евристики вгадування століття видасть :exc:`DeprecationWarning`. Замість цього рекомендується встановити :attr:`time.accept2dyear` на ``False``, щоб можна було використовувати великі діапазони дат без припущень:

source: Several functions now have significantly expanded date ranges. When :attr:`time.accept2dyear` is false, the :func:`time.asctime` function will accept any year that fits in a C int, while the :func:`time.mktime` and :func:`time.strftime` functions will accept the full range supported by the corresponding operating system functions.
uk: Кілька функцій тепер мають значно розширені діапазони дат. Якщо :attr:`time.accept2dyear` має значення false, функція :func:`time.asctime` прийматиме будь-який рік, який вміщується в C int, тоді як :func:`time.mktime` і :func:`time. функції strftime` прийматимуть повний діапазон, що підтримується відповідними функціями операційної системи.

source: (Contributed by Alexander Belopolsky and Victor Stinner in :issue:`1289118`, :issue:`5094`, :issue:`6641`, :issue:`2706`, :issue:`1777412`, :issue:`8013`, and :issue:`10827`.)
uk: (Надано Олександром Бєлопольським та Віктором Стіннером у :issue:`1289118`, :issue:`5094`, :issue:`6641`, :issue:`2706`, :issue:`1777412`, :issue:`8013` і :issue:`10827`.)

source: math
uk: математика

source: The :mod:`math` module has been updated with six new functions inspired by the C99 standard.
uk: Модуль :mod:`math` було оновлено шістьма новими функціями, натхненними стандартом C99.

source: The :func:`~math.isfinite` function provides a reliable and fast way to detect special values. It returns ``True`` for regular numbers and ``False`` for *Nan* or *Infinity*:
uk: Функція :func:`~math.isfinite` забезпечує надійний і швидкий спосіб визначення спеціальних значень. Він повертає ``True`` для звичайних чисел і ``False`` для *Nan* або *Infinity*:

source: The :func:`~math.expm1` function computes ``e**x-1`` for small values of *x* without incurring the loss of precision that usually accompanies the subtraction of nearly equal quantities:
uk: Функція :func:`~math.expm1` обчислює ``e**x-1`` для малих значень *x* без втрати точності, яка зазвичай супроводжує віднімання майже рівних величин:

source: The :func:`~math.erf` function computes a probability integral or `Gaussian error function <https://en.wikipedia.org/wiki/Error_function>`_. The complementary error function, :func:`~math.erfc`, is ``1 - erf(x)``:
uk: Функція :func:`~math.erf` обчислює інтеграл ймовірності або `функцію помилки Гауса <https://en.wikipedia.org/wiki/Error_function>`_. Додатковою функцією помилок, :func:`~math.erfc`, є ``1 - erf(x)``:

source: The :func:`~math.gamma` function is a continuous extension of the factorial function. See https://en.wikipedia.org/wiki/Gamma_function for details. Because the function is related to factorials, it grows large even for small values of *x*, so there is also a :func:`~math.lgamma` function for computing the natural logarithm of the gamma function:
uk: Функція :func:`~math.gamma` є безперервним розширенням функції факториалу. Див. https://en.wikipedia.org/wiki/Gamma_function, щоб дізнатися більше. Оскільки функція пов’язана з факториалами, вона збільшується навіть для малих значень *x*, тому існує також функція :func:`~math.lgamma` для обчислення натурального логарифма гамма-функції:

source: (Contributed by Mark Dickinson.)
uk: (Надав Марк Дікінсон.)

source: abc
uk: абв

source: The :mod:`abc` module now supports :func:`~abc.abstractclassmethod` and :func:`~abc.abstractstaticmethod`.
uk: Модуль :mod:`abc` тепер підтримує :func:`~abc.abstractclassmethod` і :func:`~abc.abstractstaticmethod`.

source: These tools make it possible to define an :term:`abstract base class` that requires a particular :func:`classmethod` or :func:`staticmethod` to be implemented::
uk: Ці інструменти дають змогу визначити :term:`abstract base class`, який потребує реалізації конкретного :func:`classmethod` або :func:`staticmethod`::

source: (Patch submitted by Daniel Urban; :issue:`5867`.)
uk: (Патч надіслав Даніель Урбан; :issue:`5867`.)

source: The :class:`io.BytesIO` has a new method, :meth:`~io.BytesIO.getbuffer`, which provides functionality similar to :func:`memoryview`. It creates an editable view of the data without making a copy. The buffer's random access and support for slice notation are well-suited to in-place editing::
uk: :class:`io.BytesIO` має новий метод, :meth:`~io.BytesIO.getbuffer`, який забезпечує функції, подібні до :func:`memoryview`. Він створює редагований вигляд даних без копіювання. Довільний доступ до буфера та підтримка нотації фрагментів добре підходять для редагування на місці:

source: (Contributed by Antoine Pitrou in :issue:`5506`.)
uk: (Надав Антуан Пітру в :issue:`5506`.)

source: When writing a :meth:`__repr__` method for a custom container, it is easy to forget to handle the case where a member refers back to the container itself. Python's builtin objects such as :class:`list` and :class:`set` handle self-reference by displaying "..." in the recursive part of the representation string.
uk: Під час написання методу :meth:`__repr__` для спеціального контейнера легко забути обробити випадок, коли член повертається до самого контейнера. Вбудовані об’єкти Python, такі як :class:`list` і :class:`set` обробляють самопосилання, відображаючи "..." у рекурсивній частині рядка представлення.

source: To help write such :meth:`__repr__` methods, the :mod:`reprlib` module has a new decorator, :func:`~reprlib.recursive_repr`, for detecting recursive calls to :meth:`__repr__` and substituting a placeholder string instead::
uk: Щоб полегшити написання таких методів :meth:`__repr__`, модуль :mod:`reprlib` має новий декоратор, :func:`~reprlib.recursive_repr`, для виявлення рекурсивних викликів :meth:`__repr__` і заміни заповнювача рядок замість цього::

source: (Contributed by Raymond Hettinger in :issue:`9826` and :issue:`9840`.)
uk: (Надано Реймондом Геттінгером у :issue:`9826` та :issue:`9840`.)

source: logging
uk: лісозаготівля

source: In addition to dictionary-based configuration described above, the :mod:`logging` package has many other improvements.
uk: Окрім описаної вище конфігурації на основі словника, пакет :mod:`logging` має багато інших покращень.

source: The logging documentation has been augmented by a :ref:`basic tutorial <logging-basic-tutorial>`\, an :ref:`advanced tutorial <logging-advanced-tutorial>`\, and a :ref:`cookbook <logging-cookbook>` of logging recipes. These documents are the fastest way to learn about logging.
uk: Документацію з журналювання було доповнено :ref:`основним підручником <logging-basic-tutorial>`\, :ref:`розширеним підручником <logging-advanced-tutorial>`\ і :ref:`кулінарною книгою <logging-cookbook>` з рецептами журналювання. Ці документи є найшвидшим способом дізнатися про лісозаготівлю.

source: The :func:`logging.basicConfig` set-up function gained a *style* argument to support three different types of string formatting. It defaults to "%" for traditional %-formatting, can be set to "{" for the new :meth:`str.format` style, or can be set to "$" for the shell-style formatting provided by :class:`string.Template`. The following three configurations are equivalent::
uk: Функція налаштування :func:`logging.basicConfig` отримала аргумент *style* для підтримки трьох різних типів форматування рядків. За замовчуванням для традиційного форматування %-formatting встановлено значення "%", можна встановити значення "{" для нового стилю :meth:`str.format` або значення "$" для форматування стилю оболонки, яке надає :class:`string.Template`. Наступні три конфігурації еквівалентні:

source: If no configuration is set-up before a logging event occurs, there is now a default configuration using a :class:`~logging.StreamHandler` directed to :attr:`sys.stderr` for events of ``WARNING`` level or higher. Formerly, an event occurring before a configuration was set-up would either raise an exception or silently drop the event depending on the value of :attr:`logging.raiseExceptions`. The new default handler is stored in :attr:`logging.lastResort`.
uk: Якщо жодна конфігурація не налаштована до того, як відбудеться подія журналювання, тепер існує конфігурація за замовчуванням із використанням :class:`~logging.StreamHandler`, спрямованого на :attr:`sys.stderr` для подій рівня ``WARNING`` або вище. Раніше подія, яка відбувалася до налаштування конфігурації, викликала виняток або мовчки видаляла подію залежно від значення :attr:`logging.raiseExceptions`. Новий обробник за замовчуванням зберігається в :attr:`logging.lastResort`.

source: The use of filters has been simplified. Instead of creating a :class:`~logging.Filter` object, the predicate can be any Python callable that returns ``True`` or ``False``.
uk: Використання фільтрів спрощено. Замість створення об’єкта :class:`~logging.Filter` предикатом може бути будь-який виклик Python, який повертає ``True`` або ``False``.

source: There were a number of other improvements that add flexibility and simplify configuration. See the module documentation for a full listing of changes in Python 3.2.
uk: З’явилася низка інших покращень, які додають гнучкості та спрощують налаштування. Перегляньте документацію модуля, щоб отримати повний список змін у Python 3.2.

source: The :mod:`csv` module now supports a new dialect, :class:`~csv.unix_dialect`, which applies quoting for all fields and a traditional Unix style with ``'\n'`` as the line terminator. The registered dialect name is ``unix``.
uk: Модуль :mod:`csv` тепер підтримує новий діалект, :class:`~csv.unix_dialect`, який застосовує лапки для всіх полів і традиційний стиль Unix із ``'\n'`` як символ закінчення рядка. Зареєстрована діалектна назва ``unix``.

source: The :class:`csv.DictWriter` has a new method, :meth:`~csv.DictWriter.writeheader` for writing-out an initial row to document the field names::
uk: :class:`csv.DictWriter` має новий метод, :meth:`~csv.DictWriter.writeheader` для запису початкового рядка для документування назв полів:

source: (New dialect suggested by Jay Talbot in :issue:`5975`, and the new method suggested by Ed Abraham in :issue:`1537721`.)
uk: (Новий діалект, запропонований Джеєм Телботом у :issue:`5975`, і новий метод, запропонований Едом Абрахамом у :issue:`1537721`.)

source: There is a new and slightly mind-blowing tool :class:`~contextlib.ContextDecorator` that is helpful for creating a :term:`context manager` that does double duty as a function decorator.
uk: Існує новий і трохи приголомшливий інструмент :class:`~contextlib.ContextDecorator`, який корисний для створення :term:`context manager`, який виконує подвійну функцію як декоратор функції.

source: As a convenience, this new functionality is used by :func:`~contextlib.contextmanager` so that no extra effort is needed to support both roles.
uk: Для зручності ця нова функціональність використовується :func:`~contextlib.contextmanager`, тому не потрібно докладати додаткових зусиль для підтримки обох ролей.

source: The basic idea is that both context managers and function decorators can be used for pre-action and post-action wrappers. Context managers wrap a group of statements using a :keyword:`with` statement, and function decorators wrap a group of statements enclosed in a function. So, occasionally there is a need to write a pre-action or post-action wrapper that can be used in either role.
uk: Основна ідея полягає в тому, що як менеджери контексту, так і декоратори функцій можна використовувати для обгорток до і після дії. Менеджери контексту обгортають групу операторів за допомогою оператора :keyword:`with`, а декоратори функцій обгортають групу операторів, укладених у функцію. Отже, іноді виникає потреба написати обгортку до або після дії, яку можна використовувати в обох ролях.

source: For example, it is sometimes useful to wrap functions or groups of statements with a logger that can track the time of entry and time of exit. Rather than writing both a function decorator and a context manager for the task, the :func:`~contextlib.contextmanager` provides both capabilities in a single definition::
uk: Наприклад, іноді корисно обернути функції або групи операторів за допомогою реєстратора, який може відстежувати час входу та час виходу. Замість того, щоб писати як декоратор функції, так і менеджер контексту для завдання, :func:`~contextlib.contextmanager` надає обидві можливості в одному визначенні:
