Repository: python/python-docs-uk
Catalog: whatsnew/3.2.po
Languages: uk

source: A number of smaller features were also introduced, like support for specifying encoding in read operations, specifying fallback values for get-functions, or reading directly from dictionaries and strings.
uk: Також було введено низку менших функцій, як-от підтримка визначення кодування в операціях читання, визначення резервних значень для функцій get або читання безпосередньо зі словників і рядків.

source: (All changes contributed by Łukasz Langa.)
uk: (Усі зміни внесено Łukasz Langa.)

source: A number of usability improvements were made for the :mod:`urllib.parse` module.
uk: Для модуля :mod:`urllib.parse` було зроблено ряд покращень зручності використання.

source: The :func:`~urllib.parse.urlparse` function now supports `IPv6 <https://en.wikipedia.org/wiki/IPv6>`_ addresses as described in :rfc:`2732`:
uk: Функція :func:`~urllib.parse.urlparse` тепер підтримує адреси `IPv6 <https://en.wikipedia.org/wiki/IPv6>`_, як описано в :rfc:`2732`:

source: The :func:`~urllib.parse.urldefrag` function now returns a :term:`named tuple`::
uk: Функція :func:`~urllib.parse.urldefrag` тепер повертає :term:`named tuple`::

source: And, the :func:`~urllib.parse.urlencode` function is now much more flexible, accepting either a string or bytes type for the *query* argument. If it is a string, then the *safe*, *encoding*, and *error* parameters are sent to :func:`~urllib.parse.quote_plus` for encoding::
uk: Крім того, функція :func:`~urllib.parse.urlencode` тепер набагато гнучкіша, вона приймає рядковий або байтовий тип для аргументу *query*. Якщо це рядок, параметри *safe*, *encoding* і *error* надсилаються до :func:`~urllib.parse.quote_plus` для кодування::

source: As detailed in :ref:`parsing-ascii-encoded-bytes`, all the :mod:`urllib.parse` functions now accept ASCII-encoded byte strings as input, so long as they are not mixed with regular strings. If ASCII-encoded byte strings are given as parameters, the return types will also be an ASCII-encoded byte strings:
uk: Як описано в :ref:`parsing-ascii-encoded-bytes`, усі функції :mod:`urllib.parse` тепер приймають рядки байтів у кодуванні ASCII як вхідні дані, якщо вони не змішуються зі звичайними рядками. Якщо рядки байтів у кодуванні ASCII подано як параметри, типи повернення також будуть рядками байтів у кодуванні ASCII:

source: (Work by Nick Coghlan, Dan Mahn, and Senthil Kumaran in :issue:`2987`, :issue:`5468`, and :issue:`9873`.)
uk: (Робота Ніка Коглана, Дена Мана та Сентіла Кумарана в :issue:`2987`, :issue:`5468` та :issue:`9873`.)

source: mailbox
uk: поштова скринька

source: Thanks to a concerted effort by R. David Murray, the :mod:`mailbox` module has been fixed for Python 3.2. The challenge was that mailbox had been originally designed with a text interface, but email messages are best represented with :class:`bytes` because various parts of a message may have different encodings.
uk: Завдяки спільним зусиллям Р. Девіда Мюррея модуль :mod:`mailbox` було виправлено для Python 3.2. Проблема полягала в тому, що поштова скринька спочатку була розроблена з текстовим інтерфейсом, але повідомлення електронної пошти найкраще представлено за допомогою :class:`bytes`, оскільки різні частини повідомлення можуть мати різне кодування.

source: The solution harnessed the :mod:`email` package's binary support for parsing arbitrary email messages. In addition, the solution required a number of API changes.
uk: Рішення використовувало бінарну підтримку пакета :mod:`email` для аналізу довільних повідомлень електронної пошти. Крім того, рішення вимагало низки змін API.

source: As expected, the :meth:`~mailbox.Mailbox.add` method for :class:`mailbox.Mailbox` objects now accepts binary input.
uk: Як і очікувалося, метод :meth:`~mailbox.Mailbox.add` для об’єктів :class:`mailbox.Mailbox` тепер приймає двійкове введення.

source: :class:`~io.StringIO` and text file input are deprecated. Also, string input will fail early if non-ASCII characters are used. Previously it would fail when the email was processed in a later step.
uk: :class:`~io.StringIO` та введення текстового файлу застаріли. Крім того, введення рядка буде невдалим раніше, якщо використовуються символи, відмінні від ASCII. Раніше це не вдавалося, коли електронний лист оброблявся на наступному кроці.

source: There is also support for binary output. The :meth:`~mailbox.Mailbox.get_file` method now returns a file in the binary mode (where it used to incorrectly set the file to text-mode). There is also a new :meth:`~mailbox.Mailbox.get_bytes` method that returns a :class:`bytes` representation of a message corresponding to a given *key*.
uk: Також є підтримка двійкового виведення. Метод :meth:`~mailbox.Mailbox.get_file` тепер повертає файл у бінарному режимі (де раніше він неправильно встановлював файл у текстовому режимі). Існує також новий метод :meth:`~mailbox.Mailbox.get_bytes`, який повертає :class:`bytes` представлення повідомлення, що відповідає даному *ключу*.

source: It is still possible to get non-binary output using the old API's :meth:`~mailbox.Mailbox.get_string` method, but that approach is not very useful. Instead, it is best to extract messages from a :class:`~mailbox.Message` object or to load them from binary input.
uk: Все ще можна отримати небінарний вихід за допомогою методу :meth:`~mailbox.Mailbox.get_string` старого API, але цей підхід не дуже корисний. Натомість найкраще видобувати повідомлення з об’єкта :class:`~mailbox.Message` або завантажувати їх із двійкового введення.

source: (Contributed by R. David Murray, with efforts from Steffen Daode Nurpmeso and an initial patch by Victor Stinner in :issue:`9124`.)
uk: (Надано Р. Девідом Мюрреєм, зусиллями Штеффена Даоде Нурпмезо та початкового патча Віктора Стіннера в :issue:`9124`.)

source: The demonstration code for the :mod:`turtle` module was moved from the *Demo* directory to main library. It includes over a dozen sample scripts with lively displays. Being on :attr:`sys.path`, it can now be run directly from the command-line:
uk: Демонстраційний код для модуля :mod:`turtle` переміщено з каталогу *Demo* до основної бібліотеки. Він містить понад дюжину зразків сценаріїв із яскравими дисплеями. Перебуваючи на :attr:`sys.path`, тепер його можна запускати безпосередньо з командного рядка:

source: (Moved from the Demo directory by Alexander Belopolsky in :issue:`10199`.)
uk: (Переміщено з каталогу Demo Олександром Бєлопольським у :issue:`10199`.)

source: Multi-threading
uk: Багатопотоковість

source: The mechanism for serializing execution of concurrently running Python threads (generally known as the :term:`GIL` or Global Interpreter Lock) has been rewritten. Among the objectives were more predictable switching intervals and reduced overhead due to lock contention and the number of ensuing system calls. The notion of a "check interval" to allow thread switches has been abandoned and replaced by an absolute duration expressed in seconds. This parameter is tunable through :func:`sys.setswitchinterval()`. It currently defaults to 5 milliseconds.
uk: Механізм серіалізації виконання одночасно запущених потоків Python (загальновідомий як :term:`GIL` або глобальне блокування інтерпретатора) було переписано. Серед цілей були більш передбачувані інтервали перемикання та зменшення накладних витрат через конфлікт блокувань і кількість наступних системних викликів. Поняття "інтервал перевірки", щоб дозволити перемикання потоків, було залишено та замінено абсолютною тривалістю, вираженою в секундах. Цей параметр можна налаштувати через :func:`sys.setswitchinterval()`. Зараз за замовчуванням 5 мілісекунд.

source: Additional details about the implementation can be read from a `python-dev mailing-list message <https://mail.python.org/pipermail/python-dev/2009-October/093321.html>`_ (however, "priority requests" as exposed in this message have not been kept for inclusion).
uk: Додаткові відомості про реалізацію можна прочитати в `повідомленні списку розсилки python-dev <https://mail.python.org/pipermail/python-dev/2009-October/093321.html>`_ (однак "пріоритетні запити", представлені в цьому повідомленні, не були збережені для включення).

source: (Contributed by Antoine Pitrou.)
uk: (Надав Антуан Пітру.)

source: Regular and recursive locks now accept an optional *timeout* argument to their :meth:`~threading.Lock.acquire` method. (Contributed by Antoine Pitrou; :issue:`7316`.)
uk: Звичайні та рекурсивні блокування тепер приймають додатковий аргумент *timeout* для свого методу :meth:`~threading.Lock.acquire`. (Надав Антуан Пітру; :issue:`7316`.)

source: Similarly, :meth:`threading.Semaphore.acquire` also gained a *timeout* argument. (Contributed by Torsten Landschoff; :issue:`850728`.)
uk: Так само :meth:`threading.Semaphore.acquire` також отримав аргумент *timeout*. (Надав Торстен Ландшофф; :issue:`850728`.)

source: Regular and recursive lock acquisitions can now be interrupted by signals on platforms using Pthreads. This means that Python programs that deadlock while acquiring locks can be successfully killed by repeatedly sending SIGINT to the process (by pressing :kbd:`Ctrl+C` in most shells). (Contributed by Reid Kleckner; :issue:`8844`.)
uk: Регулярне та рекурсивне отримання блокувань тепер може бути перервано сигналами на платформах, які використовують Pthreads. Це означає, що програми Python, які блокуються під час отримання блокувань, можна успішно припинити, багаторазово надсилаючи SIGINT процесу (натиснувши :kbd:`Ctrl+C` у більшості оболонок). (Надав Рейд Клекнер; :issue:`8844`.)

source: Optimizations
uk: Оптимізації

source: A number of small performance enhancements have been added:
uk: Було додано ряд невеликих покращень продуктивності:

source: Python's peephole optimizer now recognizes patterns such ``x in {1, 2, 3}`` as being a test for membership in a set of constants. The optimizer recasts the :class:`set` as a :class:`frozenset` and stores the pre-built constant.
uk: Оптимізатор peephole Python тепер розпізнає шаблони, такі як ``x in {1, 2}`` як тест на приналежність до набору констант. Оптимізатор перетворює :class:`set` як :class:`frozenset` і зберігає попередньо зібрану константу.

source: Now that the speed penalty is gone, it is practical to start writing membership tests using set-notation. This style is both semantically clear and operationally fast::
uk: Тепер, коли покарання за швидкістю зникло, можна почати писати тести на приналежність за допомогою нотації набору. Цей стиль і семантично зрозумілий, і операційно швидкий:

source: (Patch and additional tests contributed by Dave Malcolm; :issue:`6690`).
uk: (Патч і додаткові тести надав Дейв Малкольм; :issue:`6690`).

source: Serializing and unserializing data using the :mod:`pickle` module is now several times faster.
uk: Серіалізація та десеріалізація даних за допомогою модуля :mod:`pickle` тепер у кілька разів швидша.

source: (Contributed by Alexandre Vassalotti, Antoine Pitrou and the Unladen Swallow team in :issue:`9410` and :issue:`3873`.)
uk: (Надано Александром Вассалотті, Антуаном Пітру та командою Unladen Swallow у :issue:`9410` та :issue:`3873`.)

source: The `Timsort algorithm <https://en.wikipedia.org/wiki/Timsort>`_ used in :meth:`list.sort` and :func:`sorted` now runs faster and uses less memory when called with a :term:`key function`. Previously, every element of a list was wrapped with a temporary object that remembered the key value associated with each element. Now, two arrays of keys and values are sorted in parallel. This saves the memory consumed by the sort wrappers, and it saves time lost to delegating comparisons.
uk: `Алгоритм Timsort <https://en.wikipedia.org/wiki/Timsort>`_, який використовується в :meth:`list.sort` і :func:`sorted`, тепер працює швидше та використовує менше пам’яті під час виклику з :term:`key function`. Раніше кожен елемент списку обгортався тимчасовим об’єктом, який запам’ятовував значення ключа, пов’язане з кожним елементом. Тепер два масиви ключів і значень сортуються паралельно. Це економить пам’ять, яку споживають обгортки сортування, і економить час, втрачений на делегування порівнянь.

source: (Patch by Daniel Stutzbach in :issue:`9915`.)
uk: (Патч Даніеля Штуцбаха в :issue:`9915`.)

source: JSON decoding performance is improved and memory consumption is reduced whenever the same string is repeated for multiple keys. Also, JSON encoding now uses the C speedups when the ``sort_keys`` argument is true.
uk: Продуктивність декодування JSON покращується, а споживання пам’яті зменшується щоразу, коли той самий рядок повторюється для кількох ключів. Крім того, кодування JSON тепер використовує прискорення C, якщо аргумент ``sort_keys`` має значення true.

source: (Contributed by Antoine Pitrou in :issue:`7451` and by Raymond Hettinger and Antoine Pitrou in :issue:`10314`.)
uk: (Надано Антуаном Пітру в :issue:`7451` та Раймондом Геттінгером і Антуаном Пітру в :issue:`10314`.)

source: Recursive locks (created with the :func:`threading.RLock` API) now benefit from a C implementation which makes them as fast as regular locks, and between 10x and 15x faster than their previous pure Python implementation.
uk: Рекурсивні блокування (створені за допомогою API :func:`threading.RLock`) тепер мають переваги від реалізації C, яка робить їх такими ж швидкими, як і звичайні блокування, і в 10-15 разів швидшими, ніж їхня попередня реалізація на чистому Python.

source: (Contributed by Antoine Pitrou; :issue:`3001`.)
uk: (Надав Антуан Пітру; :issue:`3001`.)

source: The fast-search algorithm in stringlib is now used by the :meth:`split`, :meth:`rsplit`, :meth:`splitlines` and :meth:`replace` methods on :class:`bytes`, :class:`bytearray` and :class:`str` objects. Likewise, the algorithm is also used by :meth:`rfind`, :meth:`rindex`, :meth:`rsplit` and :meth:`rpartition`.
uk: Алгоритм швидкого пошуку в stringlib тепер використовується методами :meth:`split`, :meth:`rsplit`, :meth:`splitlines` і :meth:`replace` для :class:`bytes`, об’єкти :class:`bytearray` і :class:`str`. Подібним чином алгоритм також використовується :meth:`rfind`, :meth:`rindex`, :meth:`rsplit` і :meth:`rpartition`.

source: (Patch by Florent Xicluna in :issue:`7622` and :issue:`7462`.)
uk: (Патч від Florent Xicluna в :issue:`7622` і :issue:`7462`.)

source: Integer to string conversions now work two "digits" at a time, reducing the number of division and modulo operations.
uk: Перетворення цілого числа в рядок тепер працюють з двома "цифрами" одночасно, зменшуючи кількість операцій ділення та модуля.

source: (:issue:`6713` by Gawain Bolton, Mark Dickinson, and Victor Stinner.)
uk: (:issue:`6713`, Гавейн Болтон, Марк Дікінсон і Віктор Стіннер.)

source: There were several other minor optimizations. Set differencing now runs faster when one operand is much larger than the other (patch by Andress Bennetts in :issue:`8685`). The :meth:`array.repeat` method has a faster implementation (:issue:`1569291` by Alexander Belopolsky). The :class:`BaseHTTPRequestHandler` has more efficient buffering (:issue:`3709` by Andrew Schaaf). The :func:`operator.attrgetter` function has been sped-up (:issue:`10160` by Christos Georgiou). And :class:`ConfigParser` loads multi-line arguments a bit faster (:issue:`7113` by Łukasz Langa).
uk: Було ще кілька незначних оптимізацій. Розрізнення наборів тепер працює швидше, коли один операнд значно більший за інший (патч від Андресса Беннетса в :issue:`8685`). Метод :meth:`array.repeat` має швидшу реалізацію (:issue:`1569291` від Alexander Belopolsky). :class:`BaseHTTPRequestHandler` має більш ефективну буферизацію (:issue:`3709` від Ендрю Шаафа). Функцію :func:`operator.attrgetter` було пришвидшено (:issue:`10160` від Christos Georgiou). А :class:`ConfigParser` завантажує багаторядкові аргументи трохи швидше (:issue:`7113` від Łukasz Langa).

source: Python has been updated to `Unicode 6.0.0 <http://unicode.org/versions/Unicode6.0.0/>`_. The update to the standard adds over 2,000 new characters including `emoji <https://en.wikipedia.org/wiki/Emoji>`_ symbols which are important for mobile phones.
uk: Python оновлено до `Unicode 6.0.0 <http://unicode.org/versions/Unicode6.0.0/>`_. Оновлення стандарту додає понад 2000 нових символів, включаючи символи `emoji <https://en.wikipedia.org/wiki/Emoji>`_, які важливі для мобільних телефонів.

source: In addition, the updated standard has altered the character properties for two Kannada characters (U+0CF1, U+0CF2) and one New Tai Lue numeric character (U+19DA), making the former eligible for use in identifiers while disqualifying the latter. For more information, see `Unicode Character Database Changes <http://www.unicode.org/versions/Unicode6.0.0/#Database_Changes>`_.
uk: Крім того, оновлений стандарт змінив властивості символів для двох символів каннади (U+0CF1, U+0CF2) і одного числового символу нового тайлу (U+19DA), зробивши перший придатним для використання в ідентифікаторах, а другий дискваліфіковано. Щоб отримати додаткові відомості, перегляньте `Зміни бази даних символів Unicode <http://www.unicode.org/versions/Unicode6.0.0/#Database_Changes>`_.

source: Codecs
uk: Кодеки

source: Support was added for *cp720* Arabic DOS encoding (:issue:`1616979`).
uk: Додано підтримку *cp720* арабського кодування DOS (:issue:`1616979`).

source: MBCS encoding no longer ignores the error handler argument. In the default strict mode, it raises an :exc:`UnicodeDecodeError` when it encounters an undecodable byte sequence and an :exc:`UnicodeEncodeError` for an unencodable character.
uk: Кодування MBCS більше не ігнорує аргумент обробника помилок. У строгому режимі за замовчуванням він викликає :exc:`UnicodeDecodeError`, коли зустрічає некодовану послідовність байтів, і :exc:`UnicodeEncodeError` для некодованого символу.

source: The MBCS codec supports ``'strict'`` and ``'ignore'`` error handlers for decoding, and ``'strict'`` and ``'replace'`` for encoding.
uk: Кодек MBCS підтримує ``'strict'`` і ``'ignore''`` обробники помилок для декодування, ``'strict'`` і ``'replace'`` для кодування.

source: To emulate Python3.1 MBCS encoding, select the ``'ignore'`` handler for decoding and the ``'replace'`` handler for encoding.
uk: Щоб емулювати кодування Python3.1 MBCS, виберіть обробник ``'ignore'`` для декодування та ``'replace'`` обробник для кодування.

source: On Mac OS X, Python decodes command line arguments with ``'utf-8'`` rather than the locale encoding.
uk: У Mac OS X Python декодує аргументи командного рядка за допомогою ``'utf-8''`` замість кодування локалі.

source: By default, :mod:`tarfile` uses ``'utf-8'`` encoding on Windows (instead of ``'mbcs'``) and the ``'surrogateescape'`` error handler on all operating systems.
uk: За замовчуванням :mod:`tarfile` використовує кодування ``'utf-8'`` у Windows (замість ``'mbcs'``) і ``'surrogateescape'`` обробник помилок у всіх операційних системах.

source: Documentation
uk: Документація

source: The documentation continues to be improved.
uk: Документація продовжує вдосконалюватися.

source: A table of quick links has been added to the top of lengthy sections such as :ref:`built-in-funcs`. In the case of :mod:`itertools`, the links are accompanied by tables of cheatsheet-style summaries to provide an overview and memory jog without having to read all of the docs.
uk: Таблицю швидких посилань було додано до верхньої частини довгих розділів, таких як :ref:`built-in-funcs`. У випадку :mod:`itertools` посилання супроводжуються таблицями підсумків у стилі шпаргалок, щоб надати огляд і пам’ять без необхідності читати всі документи.

source: In some cases, the pure Python source code can be a helpful adjunct to the documentation, so now many modules now feature quick links to the latest version of the source code. For example, the :mod:`functools` module documentation has a quick link at the top labeled:
uk: У деяких випадках чистий вихідний код Python може бути корисним доповненням до документації, тому тепер багато модулів тепер мають швидкі посилання на останню версію вихідного коду. Наприклад, документація модуля :mod:`functools` має швидке посилання вгорі з позначкою:

source: **Source code** :source:`Lib/functools.py`.
uk: **Вихідний код** :source:`Lib/functools.py`.

source: (Contributed by Raymond Hettinger; see `rationale <https://rhettinger.wordpress.com/2011/01/28/open-your-source-more/>`_.)
uk: (Надав Реймонд Хеттінгер; див. `обґрунтування <https://rhettinger.wordpress.com/2011/01/28/open-your-source-more/>`_.)

source: The docs now contain more examples and recipes. In particular, :mod:`re` module has an extensive section, :ref:`re-examples`. Likewise, the :mod:`itertools` module continues to be updated with new :ref:`itertools-recipes`.
uk: Документи тепер містять більше прикладів і рецептів. Зокрема, модуль :mod:`re` має великий розділ :ref:`re-examples`. Так само модуль :mod:`itertools` продовжує оновлюватися новими :ref:`itertools-recipes`.

source: The :mod:`datetime` module now has an auxiliary implementation in pure Python. No functionality was changed. This just provides an easier-to-read alternate implementation.
uk: Модуль :mod:`datetime` тепер має допоміжну реалізацію на чистому Python. Функціональність не змінена. Це просто забезпечує легшу для читання альтернативну реалізацію.

source: (Contributed by Alexander Belopolsky in :issue:`9528`.)
uk: (Надав Олександр Бєлопольський у :issue:`9528`.)

source: The unmaintained :file:`Demo` directory has been removed. Some demos were integrated into the documentation, some were moved to the :file:`Tools/demo` directory, and others were removed altogether.
uk: Непідтримуваний каталог :file:`Demo` було видалено. Деякі демонстрації було інтегровано в документацію, деякі переміщено до каталогу :file:`Tools/demo`, а інші взагалі видалено.

source: (Contributed by Georg Brandl in :issue:`7962`.)
uk: (Надав Георг Брандл у :issue:`7962`.)

source: IDLE
uk: ПРОСТОЮЧИЙ

source: The format menu now has an option to clean source files by stripping trailing whitespace.
uk: У меню форматування тепер є опція очищення вихідних файлів шляхом видалення кінцевих пробілів.

source: (Contributed by Raymond Hettinger; :issue:`5150`.)
uk: (Надав Реймонд Геттінгер; :issue:`5150`.)

source: IDLE on Mac OS X now works with both Carbon AquaTk and Cocoa AquaTk.
uk: IDLE на Mac OS X тепер працює як з Carbon AquaTk, так і з Cocoa AquaTk.

source: (Contributed by Kevin Walzer, Ned Deily, and Ronald Oussoren; :issue:`6075`.)
uk: (Надано Кевіном Волзером, Недом Дейлі та Рональдом Усореном; :issue:`6075`.)

source: Code Repository
uk: Репозиторій коду

source: In addition to the existing Subversion code repository at http://svn.python.org there is now a `Mercurial <https://www.mercurial-scm.org/>`_ repository at https://hg.python.org/\ .
uk: На додаток до існуючого репозиторію коду Subversion на http://svn.python.org тепер існує сховище `Mercurial <https://www.mercurial-scm.org/>`_ на https://hg.python.org/\ .

source: After the 3.2 release, there are plans to switch to Mercurial as the primary repository. This distributed version control system should make it easier for members of the community to create and share external changesets. See :pep:`385` for details.
uk: Після випуску 3.2 планується перехід на Mercurial як основний репозиторій. Ця розподілена система контролю версій має спростити членам спільноти створення зовнішніх наборів змін і обмін ними. Подробиці див. :pep:`385`.

source: To learn to use the new version control system, see the `Quick Start <https://www.mercurial-scm.org/wiki/QuickStart>`_ or the `Guide to Mercurial Workflows <https://www.mercurial-scm.org/guide>`_.
uk: Щоб навчитися користуватися новою системою контролю версій, перегляньте `Швидкий старт <https://www.mercurial-scm.org/wiki/QuickStart>`_ або `Посібник із робочих процесів Mercurial <https://www.mercurial-scm.org/guide>`_.

source: Build and C API Changes
uk: Зміни збірки та C API
