Repository: python/python-docs-uk
Catalog: whatsnew/3.2.po
Languages: uk

source: String formatting for :func:`format` and :meth:`str.format` gained new capabilities for the format character **#**. Previously, for integers in binary, octal, or hexadecimal, it caused the output to be prefixed with '0b', '0o', or '0x' respectively. Now it can also handle floats, complex, and Decimal, causing the output to always have a decimal point even when no digits follow it.
uk: Форматування рядка для :func:`format` і :meth:`str.format` отримало нові можливості для символу форматування **#**. Раніше для цілих чисел у двійковій, вісімковій чи шістнадцятковій системі виводу ставився префікс "0b", "0o" або "0x" відповідно. Тепер він також може обробляти числа з плаваючою точкою, комплексні та десяткові числа, завдяки чому вивід завжди матиме десяткову крапку, навіть якщо за нею не йде жодна цифра.

source: (Suggested by Mark Dickinson and implemented by Eric Smith in :issue:`7094`.)
uk: (Запропоновано Марком Дікінсоном і реалізовано Еріком Смітом у :issue:`7094`.)

source: There is also a new :meth:`str.format_map` method that extends the capabilities of the existing :meth:`str.format` method by accepting arbitrary :term:`mapping` objects. This new method makes it possible to use string formatting with any of Python's many dictionary-like objects such as :class:`~collections.defaultdict`, :class:`~shelve.Shelf`, :class:`~configparser.ConfigParser`, or :mod:`dbm`. It is also useful with custom :class:`dict` subclasses that normalize keys before look-up or that supply a :meth:`__missing__` method for unknown keys::
uk: Існує також новий метод :meth:`str.format_map`, який розширює можливості існуючого методу :meth:`str.format`, приймаючи довільні об’єкти :term:`mapping`. Цей новий метод дає змогу використовувати форматування рядка з будь-яким із багатьох словникових об’єктів Python, таких як :class:`~collections.defaultdict`, :class:`~shelve.Shelf`, :class:`~configparser.ConfigParser` , або :mod:`dbm`. Це також корисно з власними підкласами :class:`dict`, які нормалізують ключі перед пошуком або надають метод :meth:`__missing__` для невідомих ключів::

source: (Suggested by Raymond Hettinger and implemented by Eric Smith in :issue:`6081`.)
uk: (Запропоновано Raymond Hettinger і реалізовано Eric Smith у :issue:`6081`.)

source: The interpreter can now be started with a quiet option, ``-q``, to prevent the copyright and version information from being displayed in the interactive mode. The option can be introspected using the :attr:`sys.flags` attribute:
uk: Інтерпретатор тепер можна запустити з тихою опцією ``-q``, щоб запобігти відображенню інформації про авторські права та версію в інтерактивному режимі. Опцію можна перевірити за допомогою атрибута :attr:`sys.flags`:

source: (Contributed by Marcin Wojdyr in :issue:`1772833`).
uk: (Надав Марчін Войдир у :issue:`1772833`).

source: The :func:`hasattr` function works by calling :func:`getattr` and detecting whether an exception is raised. This technique allows it to detect methods created dynamically by :meth:`__getattr__` or :meth:`__getattribute__` which would otherwise be absent from the class dictionary. Formerly, *hasattr* would catch any exception, possibly masking genuine errors. Now, *hasattr* has been tightened to only catch :exc:`AttributeError` and let other exceptions pass through::
uk: Функція :func:`hasattr` працює, викликаючи :func:`getattr` і виявляючи, чи виникає виняткова ситуація. Ця техніка дозволяє виявляти методи, створені динамічно :meth:`__getattr__` або :meth:`__getattribute__`, які інакше були б відсутні у словнику класу. Раніше *hasattr* перехоплював будь-які винятки, можливо, маскуючи справжні помилки. Тепер *hasattr* було посилено, щоб перехоплювати лише :exc:`AttributeError` і пропускати інші винятки:

source: (Discovered by Yury Selivanov and fixed by Benjamin Peterson; :issue:`9666`.)
uk: (Виявлено Юрієм Селівановим і виправлено Бенджаміном Петерсоном; :issue:`9666`.)

source: The :func:`str` of a float or complex number is now the same as its :func:`repr`. Previously, the :func:`str` form was shorter but that just caused confusion and is no longer needed now that the shortest possible :func:`repr` is displayed by default:
uk: :func:`str` числа з плаваючою точкою або комплексного числа тепер збігається з його :func:`repr`. Раніше форма :func:`str` була коротшою, але це лише викликало плутанину, і тепер вона більше не потрібна, оскільки найкоротша можлива :func:`repr` відображається за замовчуванням:

source: (Proposed and implemented by Mark Dickinson; :issue:`9337`.)
uk: (Запропоновано та реалізовано Марком Дікінсоном; :issue:`9337`.)

source: :class:`memoryview` objects now have a :meth:`~memoryview.release()` method and they also now support the context management protocol. This allows timely release of any resources that were acquired when requesting a buffer from the original object.
uk: Об’єкти :class:`memoryview` тепер мають метод :meth:`~memoryview.release()` і тепер вони також підтримують протокол керування контекстом. Це дозволяє своєчасно звільнити будь-які ресурси, отримані під час запиту буфера з вихідного об’єкта.

source: (Added by Antoine Pitrou; :issue:`9757`.)
uk: (Додав Антуан Пітру; :issue:`9757`.)

source: Previously it was illegal to delete a name from the local namespace if it occurs as a free variable in a nested block::
uk: Раніше було заборонено видаляти ім’я з локального простору імен, якщо воно зустрічається як вільна змінна у вкладеному блоці::

source: This is now allowed. Remember that the target of an :keyword:`except` clause is cleared, so this code which used to work with Python 2.6, raised a :exc:`SyntaxError` with Python 3.1 and now works again::
uk: Тепер це дозволено. Пам’ятайте, що ціль речення :keyword:`except` очищено, тому цей код, який раніше працював з Python 2.6, викликав :exc:`SyntaxError` з Python 3.1 і тепер знову працює::

source: (See :issue:`4617`.)
uk: (Див. :issue:`4617`.)

source: The internal :c:type:`structsequence` tool now creates subclasses of tuple. This means that C structures like those returned by :func:`os.stat`, :func:`time.gmtime`, and :attr:`sys.version_info` now work like a :term:`named tuple` and now work with functions and methods that expect a tuple as an argument. This is a big step forward in making the C structures as flexible as their pure Python counterparts:
uk: Внутрішній інструмент :c:type:`structsequence` тепер створює підкласи кортежу. Це означає, що структури C, такі як ті, що повертаються :func:`os.stat`, :func:`time.gmtime` і :attr:`sys.version_info` тепер працюють як :term:`named tuple` і тепер працюють з функціями та методами, які очікують кортеж як аргумент. Це великий крок вперед у тому, щоб зробити структури C такими ж гнучкими, як і їхні чисті аналоги Python:

source: (Suggested by Arfrever Frehtes Taifersar Arahesis and implemented by Benjamin Peterson in :issue:`8413`.)
uk: (Запропоновано Arfrever Frehtes Taifersar Arahesis і реалізовано Бенджаміном Петерсоном у :issue:`8413`.)

source: Warnings are now easier to control using the :envvar:`PYTHONWARNINGS` environment variable as an alternative to using ``-W`` at the command line:
uk: Тепер попередженнями легше керувати за допомогою змінної середовища :envvar:`PYTHONWARNINGS` як альтернативи використанню ``-W`` у командному рядку:

source: (Suggested by Barry Warsaw and implemented by Philip Jenvey in :issue:`7301`.)
uk: (Запропоновано Barry Warsaw і реалізовано Philip Jenvey у :issue:`7301`.)

source: A new warning category, :exc:`ResourceWarning`, has been added. It is emitted when potential issues with resource consumption or cleanup are detected. It is silenced by default in normal release builds but can be enabled through the means provided by the :mod:`warnings` module, or on the command line.
uk: Додано нову категорію попереджень :exc:`ResourceWarning`. Випускається, коли виявляються потенційні проблеми із споживанням ресурсів або очищенням. За замовчуванням у звичайних збірках випуску його вимкнено, але його можна ввімкнути за допомогою засобів, наданих модулем :mod:`warnings`, або в командному рядку.

source: A :exc:`ResourceWarning` is issued at interpreter shutdown if the :data:`gc.garbage` list isn't empty, and if :attr:`gc.DEBUG_UNCOLLECTABLE` is set, all uncollectable objects are printed. This is meant to make the programmer aware that their code contains object finalization issues.
uk: :exc:`ResourceWarning` видається під час завершення роботи інтерпретатора, якщо список :data:`gc.garbage` не порожній, і якщо встановлено :attr:`gc.DEBUG_UNCOLLECTABLE`, друкуються всі об’єкти, які неможливо зібрати. Це має на меті повідомити програмісту, що його код містить проблеми з фіналізацією об’єктів.

source: A :exc:`ResourceWarning` is also issued when a :term:`file object` is destroyed without having been explicitly closed. While the deallocator for such object ensures it closes the underlying operating system resource (usually, a file descriptor), the delay in deallocating the object could produce various issues, especially under Windows. Here is an example of enabling the warning from the command line:
uk: :exc:`ResourceWarning` також видається, коли :term:`file object` знищується без явного закриття. Хоча засіб звільнення для такого об’єкта гарантує, що він закриває основний ресурс операційної системи (зазвичай, дескриптор файлу), затримка звільнення об’єкта може спричинити різні проблеми, особливо під Windows. Ось приклад увімкнення попередження з командного рядка:

source: (Added by Antoine Pitrou and Georg Brandl in :issue:`10093` and :issue:`477863`.)
uk: (Додано Антуаном Пітру та Георгом Брандлом у :issue:`10093` та :issue:`477863`.)

source: :class:`range` objects now support *index* and *count* methods. This is part of an effort to make more objects fully implement the :class:`collections.Sequence` :term:`abstract base class`. As a result, the language will have a more uniform API. In addition, :class:`range` objects now support slicing and negative indices, even with values larger than :attr:`sys.maxsize`. This makes *range* more interoperable with lists::
uk: Об’єкти :class:`range` тепер підтримують методи *index* і *count*. Це частина зусиль, щоб більше об’єктів повністю реалізовували :class:`collections.Sequence` :term:`abstract base class`. У результаті мова матиме більш уніфікований API. Крім того, об’єкти :class:`range` тепер підтримують нарізку та негативні індекси, навіть зі значеннями, більшими за :attr:`sys.maxsize`. Це робить *range* більш сумісним зі списками::

source: (Contributed by Daniel Stutzbach in :issue:`9213`, by Alexander Belopolsky in :issue:`2690`, and by Nick Coghlan in :issue:`10889`.)
uk: (Надано Даніелем Штуцбахом у :issue:`9213`, Олександром Бєлопольським у :issue:`2690` та Ніком Когланом у :issue:`10889`.)

source: The :func:`callable` builtin function from Py2.x was resurrected. It provides a concise, readable alternative to using an :term:`abstract base class` in an expression like ``isinstance(x, collections.Callable)``:
uk: Вбудовану функцію :func:`callable` з Py2.x було відроджено. Він надає стислу, зрозумілу альтернативу використанню :term:`abstract base class` у виразі на зразок ``isinstance(x, collections.Callable)``:

source: (See :issue:`10518`.)
uk: (Див. :issue:`10518`.)

source: Python's import mechanism can now load modules installed in directories with non-ASCII characters in the path name. This solved an aggravating problem with home directories for users with non-ASCII characters in their usernames.
uk: Механізм імпорту Python тепер може завантажувати модулі, встановлені в каталогах із символами, відмінними від ASCII, у імені шляху. Це вирішило серйозну проблему з домашніми каталогами для користувачів із символами, відмінними від ASCII, у їхніх іменах користувачів.

source: (Required extensive work by Victor Stinner in :issue:`9425`.)
uk: (Потрібна велика робота Віктора Стіннера в :issue:`9425`.)

source: New, Improved, and Deprecated Modules
uk: Нові, покращені та застарілі модулі

source: Python's standard library has undergone significant maintenance efforts and quality improvements.
uk: Стандартна бібліотека Python зазнала значних зусиль з обслуговування та покращення якості.

source: The biggest news for Python 3.2 is that the :mod:`email` package, :mod:`mailbox` module, and :mod:`nntplib` modules now work correctly with the bytes/text model in Python 3. For the first time, there is correct handling of messages with mixed encodings.
uk: Найбільшою новиною для Python 3.2 є те, що пакет :mod:`email`, модуль :mod:`mailbox` і модулі :mod:`nntplib` тепер коректно працюють із моделлю байт/текст у Python 3. Вперше , існує правильна обробка повідомлень із змішаним кодуванням.

source: Throughout the standard library, there has been more careful attention to encodings and text versus bytes issues. In particular, interactions with the operating system are now better able to exchange non-ASCII data using the Windows MBCS encoding, locale-aware encodings, or UTF-8.
uk: У стандартній бібліотеці більше уваги приділялося кодуванням і питанням тексту та байтів. Зокрема, під час взаємодії з операційною системою тепер краще обмінюватися даними, відмінними від ASCII, за допомогою кодування Windows MBCS, кодування з урахуванням локалі або UTF-8.

source: Another significant win is the addition of substantially better support for *SSL* connections and security certificates.
uk: Ще однією важливою перевагою є додавання значно кращої підтримки з’єднань *SSL* і сертифікатів безпеки.

source: In addition, more classes now implement a :term:`context manager` to support convenient and reliable resource clean-up using a :keyword:`with` statement.
uk: Крім того, більше класів тепер реалізують :term:`context manager` для підтримки зручного та надійного очищення ресурсів за допомогою оператора :keyword:`with`.

source: email
uk: електронною поштою

source: The usability of the :mod:`email` package in Python 3 has been mostly fixed by the extensive efforts of R. David Murray. The problem was that emails are typically read and stored in the form of :class:`bytes` rather than :class:`str` text, and they may contain multiple encodings within a single email. So, the email package had to be extended to parse and generate email messages in bytes format.
uk: Зручність використання пакета :mod:`email` у Python 3 була здебільшого виправлена завдяки значним зусиллям Р. Девіда Мюррея. Проблема полягала в тому, що електронні листи зазвичай читаються та зберігаються у формі :class:`bytes`, а не :class:`str` тексту, і вони можуть містити кілька кодувань в одному електронному листі. Отже, пакет електронної пошти потрібно було розширити для аналізу та генерації повідомлень електронної пошти у форматі байтів.

source: New functions :func:`~email.message_from_bytes` and :func:`~email.message_from_binary_file`, and new classes :class:`~email.parser.BytesFeedParser` and :class:`~email.parser.BytesParser` allow binary message data to be parsed into model objects.
uk: Нові функції :func:`~email.message_from_bytes` і :func:`~email.message_from_binary_file`, а також нові класи :class:`~email.parser.BytesFeedParser` і :class:`~email.parser.BytesParser` дозволяють двійковий код дані повідомлення, які потрібно розібрати в об’єкти моделі.

source: Given bytes input to the model, :meth:`~email.message.Message.get_payload` will by default decode a message body that has a :mailheader:`Content-Transfer-Encoding` of *8bit* using the charset specified in the MIME headers and return the resulting string.
uk: З урахуванням байтів, введених у модель, :meth:`~email.message.Message.get_payload` за замовчуванням декодує тіло повідомлення, яке має :mailheader:`Content-Transfer-Encoding` *8bit*, використовуючи набір символів, указаний у заголовки MIME та повертає результуючий рядок.

source: Given bytes input to the model, :class:`~email.generator.Generator` will convert message bodies that have a :mailheader:`Content-Transfer-Encoding` of *8bit* to instead have a *7bit* :mailheader:`Content-Transfer-Encoding`.
uk: Враховуючи байти, введені в модель, :class:`~email.generator.Generator` перетворить тіла повідомлень, які мають :mailheader:`Content-Transfer-Encoding` *8bit*, на *7bit* :mailheader:`Content-Transfer-Encoding`.

source: Headers with unencoded non-ASCII bytes are deemed to be :rfc:`2047`\ -encoded using the *unknown-8bit* character set.
uk: Заголовки з незакодованими не-ASCII байтами вважаються :rfc:`2047`\ -кодованими з використанням набору символів *unknown-8bit*.

source: A new class :class:`~email.generator.BytesGenerator` produces bytes as output, preserving any unchanged non-ASCII data that was present in the input used to build the model, including message bodies with a :mailheader:`Content-Transfer-Encoding` of *8bit*.
uk: Новий клас :class:`~email.generator.BytesGenerator` створює байти як вихідні дані, зберігаючи будь-які незмінені дані, що не належать до ASCII, які були присутні у вхідних даних, використаних для побудови моделі, включаючи тіла повідомлень із :mailheader:`Content-Transfer-Encoding` з *8bit*.

source: The :mod:`smtplib` :class:`~smtplib.SMTP` class now accepts a byte string for the *msg* argument to the :meth:`~smtplib.SMTP.sendmail` method, and a new method, :meth:`~smtplib.SMTP.send_message` accepts a :class:`~email.message.Message` object and can optionally obtain the *from_addr* and *to_addrs* addresses directly from the object.
uk: Клас :mod:`smtplib` :class:`~smtplib.SMTP` тепер приймає рядок байтів для аргументу *msg* для методу :meth:`~smtplib.SMTP.sendmail` і новий метод :meth:`~smtplib.SMTP.send_message` приймає об’єкт :class:`~email.message.Message` і за бажанням може отримати адреси *from_addr* і *to_addrs* безпосередньо з об’єкта.

source: (Proposed and implemented by R. David Murray, :issue:`4661` and :issue:`10321`.)
uk: (Запропоновано та реалізовано Р. Девідом Мюрреєм, :issue:`4661` і :issue:`10321`.)

source: elementtree
uk: дерево елементів

source: The :mod:`xml.etree.ElementTree` package and its :mod:`xml.etree.cElementTree` counterpart have been updated to version 1.3.
uk: Пакет :mod:`xml.etree.ElementTree` та його аналог :mod:`xml.etree.cElementTree` оновлено до версії 1.3.

source: Several new and useful functions and methods have been added:
uk: Додано кілька нових корисних функцій і методів:

source: :func:`xml.etree.ElementTree.fromstringlist` which builds an XML document from a sequence of fragments
uk: :func:`xml.etree.ElementTree.fromstringlist`, який створює XML-документ із послідовності фрагментів

source: :func:`xml.etree.ElementTree.register_namespace` for registering a global namespace prefix
uk: :func:`xml.etree.ElementTree.register_namespace` для реєстрації префікса глобального простору імен

source: :func:`xml.etree.ElementTree.tostringlist` for string representation including all sublists
uk: :func:`xml.etree.ElementTree.tostringlist` для представлення рядків, включаючи всі підсписки

source: :meth:`xml.etree.ElementTree.Element.extend` for appending a sequence of zero or more elements
uk: :meth:`xml.etree.ElementTree.Element.extend` для додавання послідовності з нуля або більше елементів

source: :meth:`xml.etree.ElementTree.Element.iterfind` searches an element and subelements
uk: :meth:`xml.etree.ElementTree.Element.iterfind` шукає елемент і піделементи

source: :meth:`xml.etree.ElementTree.Element.itertext` creates a text iterator over an element and its subelements
uk: :meth:`xml.etree.ElementTree.Element.itertext` створює текстовий ітератор над елементом і його піделементами

source: :meth:`xml.etree.ElementTree.TreeBuilder.end` closes the current element
uk: :meth:`xml.etree.ElementTree.TreeBuilder.end` закриває поточний елемент

source: :meth:`xml.etree.ElementTree.TreeBuilder.doctype` handles a doctype declaration
uk: :meth:`xml.etree.ElementTree.TreeBuilder.doctype` обробляє декларацію doctype

source: Two methods have been deprecated:
uk: Два методи застаріли:

source: :meth:`xml.etree.ElementTree.getchildren` use ``list(elem)`` instead.
uk: :meth:`xml.etree.ElementTree.getchildren` замість цього використовуйте ``list(elem)``.

source: :meth:`xml.etree.ElementTree.getiterator` use ``Element.iter`` instead.
uk: :meth:`xml.etree.ElementTree.getiterator` замість цього використовуйте ``Element.iter``.

source: For details of the update, see `Introducing ElementTree <https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm>`_ on Fredrik Lundh's website.
uk: Докладні відомості про оновлення див. у розділі `Introducing ElementTree <https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm>`_ на веб-сайті Фредріка Лунда.

source: (Contributed by Florent Xicluna and Fredrik Lundh, :issue:`6472`.)
uk: (Надано Florent Xicluna та Fredrik Lundh, :issue:`6472`.)

source: The :mod:`functools` module includes a new decorator for caching function calls. :func:`functools.lru_cache` can save repeated queries to an external resource whenever the results are expected to be the same.
uk: Модуль :mod:`functools` містить новий декоратор для кешування викликів функцій. :func:`functools.lru_cache` може зберігати повторювані запити до зовнішнього ресурсу щоразу, коли очікується, що результати будуть однаковими.

source: For example, adding a caching decorator to a database query function can save database accesses for popular searches:
uk: Наприклад, додавання декоратора кешування до функції запиту до бази даних може зберегти доступ до бази даних для популярних пошуків:

source: To help with choosing an effective cache size, the wrapped function is instrumented for tracking cache statistics:
uk: Щоб допомогти з вибором ефективного розміру кешу, загорнута функція обладнана для відстеження статистики кешу:

source: If the phonelist table gets updated, the outdated contents of the cache can be cleared with:
uk: Якщо таблиця списку телефонів оновлюється, застарілий вміст кешу можна очистити за допомогою:

source: (Contributed by Raymond Hettinger and incorporating design ideas from Jim Baker, Miki Tebeka, and Nick Coghlan; see `recipe 498245 <https://code.activestate.com/recipes/498245>`_\, `recipe 577479 <https://code.activestate.com/recipes/577479>`_\, :issue:`10586`, and :issue:`10593`.)
uk: (Надано Реймондом Геттінгером і використано дизайнерські ідеї Джима Бейкера, Мікі Тебеки та Ніка Коглана; див. `recipe 498245 <https://code.activestate.com/recipes/498245>`_\, `recipe 577479 <https://code.activestate.com/recipes/577479>`_\, :issue:`10586` і :issue:`10593`.)

source: The :func:`functools.wraps` decorator now adds a :attr:`__wrapped__` attribute pointing to the original callable function. This allows wrapped functions to be introspected. It also copies :attr:`__annotations__` if defined. And now it also gracefully skips over missing attributes such as :attr:`__doc__` which might not be defined for the wrapped callable.
uk: Декоратор :func:`functools.wraps` тепер додає атрибут :attr:`__wrapped__`, який вказує на вихідну функцію, яку можна викликати. Це дозволяє інтроспектувати загорнуті функції. Він також копіює :attr:`__annotations__`, якщо визначено. І тепер він також витончено пропускає відсутні атрибути, такі як :attr:`__doc__`, які можуть бути не визначені для загорнутого виклику.

source: In the above example, the cache can be removed by recovering the original function:
uk: У наведеному вище прикладі кеш можна видалити, відновивши вихідну функцію:

source: (By Nick Coghlan and Terrence Cole; :issue:`9567`, :issue:`3445`, and :issue:`8814`.)
uk: (Автори Нік Коглан і Терренс Коул; :issue:`9567`, :issue:`3445` і :issue:`8814`.)
