Repository: python/python-docs-uk
Catalog: whatsnew/3.2.po
Languages: uk

source: Changes to Python's build process and to the C API include:
uk: Зміни в процесі збирання Python і в API C включають:

source: The *idle*, *pydoc* and *2to3* scripts are now installed with a version-specific suffix on ``make altinstall`` (:issue:`10679`).
uk: Сценарії *idle*, *pydoc* і *2to3* тепер інстальовано з суфіксом версії на ``make altinstall`` (:issue:`10679`).

source: The C functions that access the Unicode Database now accept and return characters from the full Unicode range, even on narrow unicode builds (Py_UNICODE_TOLOWER, Py_UNICODE_ISDECIMAL, and others). A visible difference in Python is that :func:`unicodedata.numeric` now returns the correct value for large code points, and :func:`repr` may consider more characters as printable.
uk: Функції C, які звертаються до бази даних Unicode, тепер приймають і повертають символи з повного діапазону Unicode, навіть у вузьких збірках Unicode (Py_UNICODE_TOLOWER, Py_UNICODE_ISDECIMAL та інші). Видима відмінність у Python полягає в тому, що :func:`unicodedata.numeric` тепер повертає правильне значення для великих кодових точок, а :func:`repr` може вважати більше символів придатними для друку.

source: (Reported by Bupjoe Lee and fixed by Amaury Forgeot D'Arc; :issue:`5127`.)
uk: (Повідомив Bupjoe Lee та виправив Amaury Forgeot D'Arc; :issue:`5127`.)

source: Computed gotos are now enabled by default on supported compilers (which are detected by the configure script). They can still be disabled selectively by specifying ``--without-computed-gotos``.
uk: Обчислені gotos тепер увімкнено за замовчуванням у підтримуваних компіляторах (які визначаються сценарієм конфігурації). Їх все ще можна вибірково вимкнути, вказавши ``--without-computed-gotos``.

source: (Contributed by Antoine Pitrou; :issue:`9203`.)
uk: (Надав Антуан Пітру; :issue:`9203`.)

source: The option ``--with-wctype-functions`` was removed. The built-in unicode database is now used for all functions.
uk: Опцію ``--with-wctype-functions`` видалено. Тепер для всіх функцій використовується вбудована база даних Unicode.

source: (Contributed by Amaury Forgeot D'Arc; :issue:`9210`.)
uk: (Надано Amaury Forgeot D'Arc; :issue:`9210`.)

source: Hash values are now values of a new type, :c:type:`Py_hash_t`, which is defined to be the same size as a pointer. Previously they were of type long, which on some 64-bit operating systems is still only 32 bits long. As a result of this fix, :class:`set` and :class:`dict` can now hold more than ``2**32`` entries on builds with 64-bit pointers (previously, they could grow to that size but their performance degraded catastrophically).
uk: Хеш-значення тепер є значеннями нового типу, :c:type:`Py_hash_t`, який визначено таким самим розміром, що й покажчик. Раніше вони мали тип long, який у деяких 64-розрядних операційних системах досі має лише 32 біти. У результаті цього виправлення :class:`set` і :class:`dict` тепер можуть містити більше ``2**32`` записів у збірках із 64-розрядними покажчиками (раніше вони могли збільшуватися до такого розміру але їх продуктивність катастрофічно погіршилася).

source: (Suggested by Raymond Hettinger and implemented by Benjamin Peterson; :issue:`9778`.)
uk: (Запропоновано Raymond Hettinger і реалізовано Benjamin Peterson; :issue:`9778`.)

source: A new macro :c:macro:`Py_VA_COPY` copies the state of the variable argument list. It is equivalent to C99 *va_copy* but available on all Python platforms (:issue:`2443`).
uk: Новий макрос :c:macro:`Py_VA_COPY` копіює стан списку аргументів змінної. Він еквівалентний C99 *va_copy*, але доступний на всіх платформах Python (:issue:`2443`).

source: A new C API function :c:func:`PySys_SetArgvEx` allows an embedded interpreter to set :attr:`sys.argv` without also modifying :attr:`sys.path` (:issue:`5753`).
uk: Нова функція C API :c:func:`PySys_SetArgvEx` дозволяє вбудованому інтерпретатору встановлювати :attr:`sys.argv` без зміни :attr:`sys.path` (:issue:`5753`).

source: :c:macro:`PyEval_CallObject` is now only available in macro form. The function declaration, which was kept for backwards compatibility reasons, is now removed -- the macro was introduced in 1997 (:issue:`8276`).
uk: :c:macro:`PyEval_CallObject` тепер доступний лише у формі макросу. Оголошення функції, яке було збережено з міркувань зворотної сумісності, тепер видалено — макрос було представлено в 1997 році (:issue:`8276`).

source: There is a new function :c:func:`PyLong_AsLongLongAndOverflow` which is analogous to :c:func:`PyLong_AsLongAndOverflow`. They both serve to convert Python :class:`int` into a native fixed-width type while providing detection of cases where the conversion won't fit (:issue:`7767`).
uk: Існує нова функція :c:func:`PyLong_AsLongLongAndOverflow`, яка є аналогом :c:func:`PyLong_AsLongAndOverflow`. Обидва вони служать для перетворення Python :class:`int` на рідний тип із фіксованою шириною, забезпечуючи виявлення випадків, коли перетворення не підходить (:issue:`7767`).

source: The :c:func:`PyUnicode_CompareWithASCIIString` function now returns *not equal* if the Python string is *NUL* terminated.
uk: Функція :c:func:`PyUnicode_CompareWithASCIIString` тепер повертає *не дорівнює*, якщо рядок Python завершується *NUL*.

source: There is a new function :c:func:`PyErr_NewExceptionWithDoc` that is like :c:func:`PyErr_NewException` but allows a docstring to be specified. This lets C exceptions have the same self-documenting capabilities as their pure Python counterparts (:issue:`7033`).
uk: Існує нова функція :c:func:`PyErr_NewExceptionWithDoc`, яка схожа на :c:func:`PyErr_NewException`, але дозволяє вказати рядок документа. Це дозволяє виняткам C мати ті самі можливості самодокументування, що й їхні чисті відповідники Python (:issue:`7033`).

source: When compiled with the ``--with-valgrind`` option, the pymalloc allocator will be automatically disabled when running under Valgrind. This gives improved memory leak detection when running under Valgrind, while taking advantage of pymalloc at other times (:issue:`2422`).
uk: При компіляції з опцією ``--with-valgrind`` розподільник pymalloc буде автоматично вимкнено під час роботи під Valgrind. Це забезпечує покращене виявлення витоку пам’яті під час роботи під Valgrind, водночас користуючись перевагами pymalloc в інший час (:issue:`2422`).

source: Removed the ``O?`` format from the *PyArg_Parse* functions. The format is no longer used and it had never been documented (:issue:`8837`).
uk: Видалено формат ``O?`` з функцій *PyArg_Parse*. Формат більше не використовується і ніколи не був задокументований (:issue:`8837`).

source: There were a number of other small changes to the C-API. See the :source:`Misc/NEWS` file for a complete list.
uk: У C-API було внесено ряд інших невеликих змін. Повний список див. у файлі :source:`Misc/NEWS`.

source: Also, there were a number of updates to the Mac OS X build, see :source:`Mac/BuildScript/README.txt` for details. For users running a 32/64-bit build, there is a known problem with the default Tcl/Tk on Mac OS X 10.6. Accordingly, we recommend installing an updated alternative such as `ActiveState Tcl/Tk 8.5.9 <https://www.activestate.com/activetcl/downloads>`_\. See https://www.python.org/download/mac/tcltk/ for additional details.
uk: Крім того, було багато оновлень збірки Mac OS X, подробиці див. :source:`Mac/BuildScript/README.txt`. Для користувачів, які використовують 32/64-бітну збірку, існує відома проблема з Tcl/Tk за замовчуванням у Mac OS X 10.6. Відповідно, ми рекомендуємо встановити оновлену альтернативу, наприклад `ActiveState Tcl/Tk 8.5.9 <https://www.activestate.com/activetcl/downloads>`_\. Дивіться https://www.python.org/download/mac/tcltk/ для отримання додаткової інформації.

source: Porting to Python 3.2
uk: Перенесення на Python 3.2

source: This section lists previously described changes and other bugfixes that may require changes to your code:
uk: У цьому розділі перераховані раніше описані зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді:

source: The :mod:`configparser` module has a number of clean-ups. The major change is to replace the old :class:`ConfigParser` class with long-standing preferred alternative :class:`SafeConfigParser`. In addition there are a number of smaller incompatibilities:
uk: Модуль :mod:`configparser` має ряд очищення. Основна зміна полягає в заміні старого класу :class:`ConfigParser` на давню бажану альтернативу :class:`SafeConfigParser`. Крім того, існує ряд менших несумісностей:

source: The interpolation syntax is now validated on :meth:`~configparser.ConfigParser.get` and :meth:`~configparser.ConfigParser.set` operations. In the default interpolation scheme, only two tokens with percent signs are valid: ``%(name)s`` and ``%%``, the latter being an escaped percent sign.
uk: Синтаксис інтерполяції тепер перевірено в операціях :meth:`~configparser.ConfigParser.get` і :meth:`~configparser.ConfigParser.set`. У стандартній схемі інтерполяції дійсні лише два токени зі знаками відсотка: ``%(name)s`` і ``%%``, причому останній є екранованим знаком відсотка.

source: The :meth:`~configparser.ConfigParser.set` and :meth:`~configparser.ConfigParser.add_section` methods now verify that values are actual strings. Formerly, unsupported types could be introduced unintentionally.
uk: Методи :meth:`~configparser.ConfigParser.set` і :meth:`~configparser.ConfigParser.add_section` тепер перевіряють, чи значення є фактичними рядками. Раніше непідтримувані типи могли бути введені ненавмисно.

source: Duplicate sections or options from a single source now raise either :exc:`~configparser.DuplicateSectionError` or :exc:`~configparser.DuplicateOptionError`. Formerly, duplicates would silently overwrite a previous entry.
uk: Дубльовані розділи або параметри з одного джерела тепер викликають :exc:`~configparser.DuplicateSectionError` або :exc:`~configparser.DuplicateOptionError`. Раніше дублікати мовчки перезаписували попередній запис.

source: Inline comments are now disabled by default so now the **;** character can be safely used in values.
uk: Вбудовані коментарі тепер вимкнено за замовчуванням, тому тепер символ **;** можна безпечно використовувати у значеннях.

source: Comments now can be indented. Consequently, for **;** or **#** to appear at the start of a line in multiline values, it has to be interpolated. This keeps comment prefix characters in values from being mistaken as comments.
uk: Коментарі тепер можна робити з відступом. Отже, щоб **;** або **#** з’явилися на початку рядка в багаторядкових значеннях, їх потрібно інтерпольувати. Це запобігає помилковому сприйняттю префіксів коментарів у значеннях як коментарі.

source: ``""`` is now a valid value and is no longer automatically converted to an empty string. For empty strings, use ``"option ="`` in a line.
uk: ``""`` тепер є дійсним значенням і більше не перетворюється автоматично на порожній рядок. Для порожніх рядків використовуйте ``"option ="`` у рядку.

source: The :mod:`nntplib` module was reworked extensively, meaning that its APIs are often incompatible with the 3.1 APIs.
uk: Модуль :mod:`nntplib` було значно перероблено, що означає, що його API часто несумісні з API 3.1.

source: :class:`bytearray` objects can no longer be used as filenames; instead, they should be converted to :class:`bytes`.
uk: :class:`bytearray` об’єкти більше не можна використовувати як імена файлів; натомість їх слід перетворити на :class:`bytes`.

source: The :meth:`array.tostring` and :meth:`array.fromstring` have been renamed to :meth:`array.tobytes` and :meth:`array.frombytes` for clarity. The old names have been deprecated. (See :issue:`8990`.)
uk: Для ясності :meth:`array.tostring` і :meth:`array.fromstring` перейменовано на :meth:`array.tobytes` і :meth:`array.frombytes`. Старі назви застаріли. (Див. :issue:`8990`.)

source: ``PyArg_Parse*()`` functions:
uk: Функції ``PyArg_Parse*()``:

source: "t#" format has been removed: use "s#" or "s*" instead
uk: Формат "t#" видалено: замість нього використовуйте "s#" або "s*".

source: "w" and "w#" formats has been removed: use "w*" instead
uk: Формати "w" і "w#" видалено: замість них використовуйте "w*".

source: The :c:type:`PyCObject` type, deprecated in 3.1, has been removed. To wrap opaque C pointers in Python objects, the :c:type:`PyCapsule` API should be used instead; the new type has a well-defined interface for passing typing safety information and a less complicated signature for calling a destructor.
uk: Тип :c:type:`PyCObject`, застарілий у версії 3.1, було видалено. Щоб обернути непрозорі вказівники C в об’єкти Python, натомість слід використовувати API :c:type:`PyCapsule`; новий тип має чітко визначений інтерфейс для передачі інформації про безпеку введення та менш складний підпис для виклику деструктора.

source: The :func:`sys.setfilesystemencoding` function was removed because it had a flawed design.
uk: Функцію :func:`sys.setfilesystemencoding` було видалено, оскільки вона мала недоліки.

source: The :func:`random.seed` function and method now salt string seeds with an sha512 hash function. To access the previous version of *seed* in order to reproduce Python 3.1 sequences, set the *version* argument to *1*, ``random.seed(s, version=1)``.
uk: Функція та метод :func:`random.seed` тепер додають початкові значення рядка за допомогою хеш-функції sha512. Щоб отримати доступ до попередньої версії *seed* для відтворення послідовностей Python 3.1, установіть аргумент *version* на *1*, ``random.seed(s, version=1)``.

source: The previously deprecated :func:`string.maketrans` function has been removed in favor of the static methods :meth:`bytes.maketrans` and :meth:`bytearray.maketrans`. This change solves the confusion around which types were supported by the :mod:`string` module. Now, :class:`str`, :class:`bytes`, and :class:`bytearray` each have their own **maketrans** and **translate** methods with intermediate translation tables of the appropriate type.
uk: Раніше застарілу функцію :func:`string.maketrans` було видалено на користь статичних методів :meth:`bytes.maketrans` і :meth:`bytearray.maketrans`. Ця зміна вирішує плутанину навколо того, які типи підтримувалися модулем :mod:`string`. Тепер :class:`str`, :class:`bytes` і :class:`bytearray` кожен має власні методи **maketrans** і **translate** із проміжними таблицями перекладу відповідного типу.

source: (Contributed by Georg Brandl; :issue:`5675`.)
uk: (Надав Георг Брандл; :issue:`5675`.)

source: The previously deprecated :func:`contextlib.nested` function has been removed in favor of a plain :keyword:`with` statement which can accept multiple context managers. The latter technique is faster (because it is built-in), and it does a better job finalizing multiple context managers when one of them raises an exception::
uk: Раніше застарілу функцію :func:`contextlib.nested` було вилучено на користь простого оператора :keyword:`with`, який може приймати кілька менеджерів контексту. Останній метод є швидшим (оскільки він вбудований), і він краще завершує роботу з кількома контекстними менеджерами, коли один із них викликає виняток:

source: (Contributed by Georg Brandl and Mattias Brändström; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)
uk: (Надано Георгом Брандлом і Маттіасом Брендстремом; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)

source: :func:`struct.pack` now only allows bytes for the ``s`` string pack code. Formerly, it would accept text arguments and implicitly encode them to bytes using UTF-8. This was problematic because it made assumptions about the correct encoding and because a variable-length encoding can fail when writing to fixed length segment of a structure.
uk: :func:`struct.pack` тепер дозволяє лише байти для коду пакета рядків ``s``. Раніше він приймав текстові аргументи та неявно кодував їх у байти за допомогою UTF-8. Це було проблематично, оскільки воно робило припущення щодо правильного кодування та тому, що кодування змінної довжини може вийти з ладу під час запису в сегмент структури фіксованої довжини.

source: Code such as ``struct.pack('<6sHHBBB', 'GIF87a', x, y)`` should be rewritten with to use bytes instead of text, ``struct.pack('<6sHHBBB', b'GIF87a', x, y)``.
uk: Такий код, як ``struct.pack('<6sHHBBB', 'GIF87a', x, y)`` слід переписати, щоб використовувати байти замість тексту, ``struct.pack('<6sHHBBB', b'GIF87a' , x, y)``.

source: (Discovered by David Beazley and fixed by Victor Stinner; :issue:`10783`.)
uk: (Виявлено Девідом Бізлі та виправлено Віктором Стіннером; :issue:`10783`.)

source: The :class:`xml.etree.ElementTree` class now raises an :exc:`xml.etree.ElementTree.ParseError` when a parse fails. Previously it raised an :exc:`xml.parsers.expat.ExpatError`.
uk: Клас :class:`xml.etree.ElementTree` тепер викликає помилку :exc:`xml.etree.ElementTree.ParseError`, коли синтаксичний аналіз не вдається. Раніше це викликало :exc:`xml.parsers.expat.ExpatError`.

source: The new, longer :func:`str` value on floats may break doctests which rely on the old output format.
uk: Нове, довше значення :func:`str` у числах з плаваючою точкою може порушити doctests, які покладаються на старий формат виводу.

source: In :class:`subprocess.Popen`, the default value for *close_fds* is now ``True`` under Unix; under Windows, it is ``True`` if the three standard streams are set to ``None``, ``False`` otherwise. Previously, *close_fds* was always ``False`` by default, which produced difficult to solve bugs or race conditions when open file descriptors would leak into the child process.
uk: У :class:`subprocess.Popen` стандартним значенням для *close_fds* тепер є ``True`` під Unix; під Windows це ``True``, якщо для трьох стандартних потоків встановлено значення ``None``, ``False`` інакше. Раніше *close_fds* за замовчуванням завжди мав значення ``False``, що створювало проблеми, які важко було вирішити, або змагання, коли дескриптори відкритого файлу потрапляли в дочірній процес.

source: Support for legacy HTTP 0.9 has been removed from :mod:`urllib.request` and :mod:`http.client`. Such support is still present on the server side (in :mod:`http.server`).
uk: Підтримку застарілого HTTP 0.9 було видалено з :mod:`urllib.request` і :mod:`http.client`. Така підтримка все ще присутня на стороні сервера (у :mod:`http.server`).

source: (Contributed by Antoine Pitrou, :issue:`10711`.)
uk: (Надав Антуан Пітру, :issue:`10711`.)

source: SSL sockets in timeout mode now raise :exc:`socket.timeout` when a timeout occurs, rather than a generic :exc:`~ssl.SSLError`.
uk: SSL-сокети в режимі тайм-ауту тепер викликають :exc:`socket.timeout`, коли відбувається тайм-аут, а не загальну :exc:`~ssl.SSLError`.

source: (Contributed by Antoine Pitrou, :issue:`10272`.)
uk: (Надав Антуан Пітру, :issue:`10272`.)

source: The misleading functions :c:func:`PyEval_AcquireLock()` and :c:func:`PyEval_ReleaseLock()` have been officially deprecated. The thread-state aware APIs (such as :c:func:`PyEval_SaveThread()` and :c:func:`PyEval_RestoreThread()`) should be used instead.
uk: Функції, що вводять в оману :c:func:`PyEval_AcquireLock()` і :c:func:`PyEval_ReleaseLock()` офіційно визнано застарілими. Замість цього слід використовувати API, що визначають стан потоку (такі як :c:func:`PyEval_SaveThread()` і :c:func:`PyEval_RestoreThread()`).

source: Due to security risks, :func:`asyncore.handle_accept` has been deprecated, and a new function, :func:`asyncore.handle_accepted`, was added to replace it.
uk: Через ризики безпеці :func:`asyncore.handle_accept` застаріло, і на його заміну додано нову функцію :func:`asyncore.handle_accepted`.

source: (Contributed by Giampaolo Rodola in :issue:`6706`.)
uk: (Надав Джампаоло Родола в :issue:`6706`.)

source: Due to the new :term:`GIL` implementation, :c:func:`PyEval_InitThreads()` cannot be called before :c:func:`Py_Initialize()` anymore.
uk: Завдяки новій реалізації :term:`GIL`, :c:func:`PyEval_InitThreads()` більше не можна викликати до :c:func:`Py_Initialize()`.
