Repository: python/python-docs-uk
Catalog: whatsnew/3.2.po
Languages: uk

source: :class:`http.client.HTTPSConnection`, :class:`urllib.request.HTTPSHandler` and :func:`urllib.request.urlopen` now take optional arguments to allow for server certificate checking against a set of Certificate Authorities, as recommended in public uses of HTTPS.
uk: :class:`http.client.HTTPSConnection`, :class:`urllib.request.HTTPSHandler` і :func:`urllib.request.urlopen` тепер приймають додаткові аргументи, щоб дозволити перевірку сертифіката сервера за набором центрів сертифікації, як рекомендовано для публічного використання HTTPS.

source: (Added by Antoine Pitrou, :issue:`9003`.)
uk: (Додав Антуан Пітру, :issue:`9003`.)

source: imaplib
uk: імапліб

source: Support for explicit TLS on standard IMAP4 connections has been added through the new :mod:`imaplib.IMAP4.starttls` method.
uk: Підтримку явного TLS у стандартних підключеннях IMAP4 додано за допомогою нового методу :mod:`imaplib.IMAP4.starttls`.

source: (Contributed by Lorenzo M. Catucci and Antoine Pitrou, :issue:`4471`.)
uk: (Надано Лоренцо М. Катуччі та Антуаном Пітру, :issue:`4471`.)

source: There were a number of small API improvements in the :mod:`http.client` module. The old-style HTTP 0.9 simple responses are no longer supported and the *strict* parameter is deprecated in all classes.
uk: У модулі :mod:`http.client` було внесено ряд невеликих покращень API. Прості відповіді HTTP 0.9 старого стилю більше не підтримуються, а параметр *strict* застарів у всіх класах.

source: The :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` classes now have a *source_address* parameter for a (host, port) tuple indicating where the HTTP connection is made from.
uk: Класи :class:`~http.client.HTTPConnection` і :class:`~http.client.HTTPSConnection` тепер мають параметр *source_address* для кортежу (хост, порт), який вказує, звідки здійснюється HTTP-з’єднання.

source: Support for certificate checking and HTTPS virtual hosts were added to :class:`~http.client.HTTPSConnection`.
uk: До :class:`~http.client.HTTPSConnection` додано підтримку перевірки сертифікатів і віртуальних хостів HTTPS.

source: The :meth:`~http.client.HTTPConnection.request` method on connection objects allowed an optional *body* argument so that a :term:`file object` could be used to supply the content of the request. Conveniently, the *body* argument now also accepts an :term:`iterable` object so long as it includes an explicit ``Content-Length`` header. This extended interface is much more flexible than before.
uk: Метод :meth:`~http.client.HTTPConnection.request` для об’єктів підключення допускав необов’язковий аргумент *body*, щоб :term:`file object` міг використовуватися для надання вмісту запиту. Зручно те, що аргумент *body* тепер також приймає об’єкт :term:`iterable`, якщо він містить явний заголовок ``Content-Length``. Цей розширений інтерфейс набагато гнучкіший, ніж раніше.

source: To establish an HTTPS connection through a proxy server, there is a new :meth:`~http.client.HTTPConnection.set_tunnel` method that sets the host and port for HTTP Connect tunneling.
uk: Для встановлення з’єднання HTTPS через проксі-сервер існує новий метод :meth:`~http.client.HTTPConnection.set_tunnel`, який встановлює хост і порт для тунелювання HTTP-з’єднання.

source: To match the behavior of :mod:`http.server`, the HTTP client library now also encodes headers with ISO-8859-1 (Latin-1) encoding. It was already doing that for incoming headers, so now the behavior is consistent for both incoming and outgoing traffic. (See work by Armin Ronacher in :issue:`10980`.)
uk: Щоб відповідати поведінці :mod:`http.server`, клієнтська бібліотека HTTP тепер також кодує заголовки з кодуванням ISO-8859-1 (Latin-1). Він уже робив це для вхідних заголовків, тому тепер поведінка узгоджена як для вхідного, так і для вихідного трафіку. (Див. роботу Арміна Ронашера в :issue:`10980`.)

source: The unittest module has a number of improvements supporting test discovery for packages, easier experimentation at the interactive prompt, new testcase methods, improved diagnostic messages for test failures, and better method names.
uk: Модуль unittest має ряд удосконалень, які підтримують виявлення тестів для пакетів, спрощені експерименти в інтерактивному запиті, нові методи тестування, покращені діагностичні повідомлення про помилки тестів і кращі назви методів.

source: The command-line call ``python -m unittest`` can now accept file paths instead of module names for running specific tests (:issue:`10620`). The new test discovery can find tests within packages, locating any test importable from the top-level directory. The top-level directory can be specified with the `-t` option, a pattern for matching files with ``-p``, and a directory to start discovery with ``-s``:
uk: Виклик командного рядка ``python -m unittest`` тепер може приймати шляхи до файлів замість імен модулів для виконання певних тестів (:issue:`10620`). Нове виявлення тестів може знаходити тести в пакетах, виявляючи будь-які тести, імпортовані з каталогу верхнього рівня. Каталог верхнього рівня можна вказати за допомогою параметра ``-t``, шаблон для відповідності файлів ``-p``, а каталог для початку виявлення ``-s``:

source: (Contributed by Michael Foord.)
uk: (Надав Майкл Форд.)

source: Experimentation at the interactive prompt is now easier because the :class:`unittest.case.TestCase` class can now be instantiated without arguments:
uk: Експериментувати в інтерактивній підказці тепер легше, оскільки екземпляр класу :class:`unittest.case.TestCase` тепер можна створювати без аргументів:

source: The :mod:`unittest` module has two new methods, :meth:`~unittest.TestCase.assertWarns` and :meth:`~unittest.TestCase.assertWarnsRegex` to verify that a given warning type is triggered by the code under test::
uk: Модуль :mod:`unittest` має два нові методи, :meth:`~unittest.TestCase.assertWarns` і :meth:`~unittest.TestCase.assertWarnsRegex` для перевірки того, що певний тип попередження викликано кодом, що тестується ::

source: (Contributed by Antoine Pitrou, :issue:`9754`.)
uk: (Надав Антуан Пітру, :issue:`9754`.)

source: Another new method, :meth:`~unittest.TestCase.assertCountEqual` is used to compare two iterables to determine if their element counts are equal (whether the same elements are present with the same number of occurrences regardless of order)::
uk: Інший новий метод, :meth:`~unittest.TestCase.assertCountEqual`, використовується для порівняння двох ітерацій, щоб визначити, чи є їх кількість елементів рівною (чи однакові елементи присутні з однаковою кількістю входжень незалежно від порядку):

source: A principal feature of the unittest module is an effort to produce meaningful diagnostics when a test fails. When possible, the failure is recorded along with a diff of the output. This is especially helpful for analyzing log files of failed test runs. However, since diffs can sometime be voluminous, there is a new :attr:`~unittest.TestCase.maxDiff` attribute that sets maximum length of diffs displayed.
uk: Основною особливістю модуля unittest є спроба створити значущу діагностику, коли тест не вдається. Якщо це можливо, помилка записується разом із різницею виходу. Це особливо корисно для аналізу файлів журналу невдалих тестів. Однак, оскільки відмінності іноді можуть бути об’ємними, існує новий атрибут :attr:`~unittest.TestCase.maxDiff`, який встановлює максимальну довжину відображених відмінностей.

source: In addition, the method names in the module have undergone a number of clean-ups.
uk: Крім того, назви методів у модулі зазнали ряду очищень.

source: For example, :meth:`~unittest.TestCase.assertRegex` is the new name for :meth:`~unittest.TestCase.assertRegexpMatches` which was misnamed because the test uses :func:`re.search`, not :func:`re.match`. Other methods using regular expressions are now named using short form "Regex" in preference to "Regexp" -- this matches the names used in other unittest implementations, matches Python's old name for the :mod:`re` module, and it has unambiguous camel-casing.
uk: Наприклад, :meth:`~unittest.TestCase.assertRegex` є новою назвою для :meth:`~unittest.TestCase.assertRegexpMatches`, яке було неправильно названо, оскільки тест використовує :func:`re.search`, а не :func:`re.match`. Інші методи, які використовують регулярні вирази, тепер називаються за допомогою короткої форми "Regex" замість "Regexp" — це відповідає назвам, які використовуються в інших реалізаціях unittest, відповідає старій назві Python для модуля :mod:`re` і має однозначне значення верблюжий кожух.

source: (Contributed by Raymond Hettinger and implemented by Ezio Melotti.)
uk: (Надано Реймондом Геттінгером і реалізовано Еціо Мелотті.)

source: To improve consistency, some long-standing method aliases are being deprecated in favor of the preferred names:
uk: Щоб покращити узгодженість, деякі давні псевдоніми методів застаріли на користь бажаних імен:

source: Old Name
uk: Стара назва

source: Preferred Name
uk: Бажане ім'я

source: Likewise, the ``TestCase.fail*`` methods deprecated in Python 3.1 are expected to be removed in Python 3.3. Also see the :ref:`deprecated-aliases` section in the :mod:`unittest` documentation.
uk: Так само очікується, що методи ``TestCase.fail*``, застарілі в Python 3.1, будуть видалені в Python 3.3. Також перегляньте розділ :ref:`deprecated-aliases` в документації :mod:`unittest`.

source: (Contributed by Ezio Melotti; :issue:`9424`.)
uk: (Надав Еціо Мелотті; :issue:`9424`.)

source: The :meth:`~unittest.TestCase.assertDictContainsSubset` method was deprecated because it was misimplemented with the arguments in the wrong order. This created hard-to-debug optical illusions where tests like ``TestCase().assertDictContainsSubset({'a':1, 'b':2}, {'a':1})`` would fail.
uk: Метод :meth:`~unittest.TestCase.assertDictContainsSubset` визнано застарілим, оскільки його неправильно реалізовано з аргументами в неправильному порядку. Це створювало оптичні ілюзії, які важко налагодити, коли такі тести, як ``TestCase().assertDictContainsSubset({'a':1, 'b':2}, {'a':1})`` не давали результатів.

source: random
uk: випадковий

source: The integer methods in the :mod:`random` module now do a better job of producing uniform distributions. Previously, they computed selections with ``int(n*random())`` which had a slight bias whenever *n* was not a power of two. Now, multiple selections are made from a range up to the next power of two and a selection is kept only when it falls within the range ``0 <= x < n``. The functions and methods affected are :func:`~random.randrange`, :func:`~random.randint`, :func:`~random.choice`, :func:`~random.shuffle` and :func:`~random.sample`.
uk: Цілочисельні методи в модулі :mod:`random` тепер краще справляються зі створенням рівномірних розподілів. Раніше вони обчислювали вибірку за допомогою ``int(n*random())``, яка мала невелике зміщення щоразу, коли *n* не було ступенем двійки. Тепер вибір робиться з діапазону до наступного ступеня двійки, і вибір зберігається лише тоді, коли він потрапляє в діапазон ``0 <= x < n``. Зазначені функції та методи: :func:`~random.randrange`, :func:`~random.randint`, :func:`~random.choice`, :func:`~random.shuffle` і :func:`~випадкова.вибірка`.

source: (Contributed by Raymond Hettinger; :issue:`9025`.)
uk: (Надав Реймонд Геттінгер; :issue:`9025`.)

source: poplib
uk: попліб

source: :class:`~poplib.POP3_SSL` class now accepts a *context* parameter, which is a :class:`ssl.SSLContext` object allowing bundling SSL configuration options, certificates and private keys into a single (potentially long-lived) structure.
uk: Клас :class:`~poplib.POP3_SSL` тепер приймає параметр *context*, який є об’єктом :class:`ssl.SSLContext`, який дозволяє об’єднувати параметри конфігурації SSL, сертифікати та приватні ключі в єдину (потенційно довговічну) структуру .

source: (Contributed by Giampaolo Rodolà; :issue:`8807`.)
uk: (Надав Джампаоло Родола; :issue:`8807`.)

source: asyncore
uk: несиндром

source: :class:`asyncore.dispatcher` now provides a :meth:`~asyncore.dispatcher.handle_accepted()` method returning a `(sock, addr)` pair which is called when a connection has actually been established with a new remote endpoint. This is supposed to be used as a replacement for old :meth:`~asyncore.dispatcher.handle_accept()` and avoids the user to call :meth:`~asyncore.dispatcher.accept()` directly.
uk: :class:`asyncore.dispatcher` тепер надає метод :meth:`~asyncore.dispatcher.handle_accepted()`, який повертає пару `(sock, addr)`, яка викликається, коли фактично встановлено з’єднання з новою віддаленою кінцевою точкою . Передбачається, що це буде використовуватись як заміна старого :meth:`~asyncore.dispatcher.handle_accept()` і уникає користувача безпосередньо викликати :meth:`~asyncore.dispatcher.accept()`.

source: (Contributed by Giampaolo Rodolà; :issue:`6706`.)
uk: (Надав Джампаоло Родола; :issue:`6706`.)

source: tempfile
uk: тимчасовий файл

source: The :mod:`tempfile` module has a new context manager, :class:`~tempfile.TemporaryDirectory` which provides easy deterministic cleanup of temporary directories::
uk: Модуль :mod:`tempfile` має новий контекстний менеджер, :class:`~tempfile.TemporaryDirectory`, який забезпечує легке детерміноване очищення тимчасових каталогів:

source: (Contributed by Neil Schemenauer and Nick Coghlan; :issue:`5178`.)
uk: (Надано Нілом Шеменауером і Ніком Когланом; :issue:`5178`.)

source: inspect
uk: оглядати

source: The :mod:`inspect` module has a new function :func:`~inspect.getgeneratorstate` to easily identify the current state of a generator-iterator::
uk: Модуль :mod:`inspect` має нову функцію :func:`~inspect.getgeneratorstate` для легкої ідентифікації поточного стану генератора-ітератора::

source: (Contributed by Rodolpho Eckhardt and Nick Coghlan, :issue:`10220`.)
uk: (Надано Родольфо Екхардтом і Ніком Когланом, :issue:`10220`.)

source: To support lookups without the possibility of activating a dynamic attribute, the :mod:`inspect` module has a new function, :func:`~inspect.getattr_static`. Unlike :func:`hasattr`, this is a true read-only search, guaranteed not to change state while it is searching::
uk: Для підтримки пошуку без можливості активації динамічного атрибута модуль :mod:`inspect` має нову функцію :func:`~inspect.getattr_static`. На відміну від :func:`hasattr`, це справжній пошук лише для читання, який гарантовано не змінює стан під час пошуку::

source: The :mod:`pydoc` module now provides a much-improved web server interface, as well as a new command-line option ``-b`` to automatically open a browser window to display that server:
uk: Модуль :mod:`pydoc` тепер надає значно покращений інтерфейс веб-сервера, а також новий параметр командного рядка ``-b`` для автоматичного відкриття вікна браузера для відображення цього сервера:

source: (Contributed by Ron Adam; :issue:`2001`.)
uk: (Надав Рон Адам; :issue:`2001`.)

source: dis
uk: дис

source: The :mod:`dis` module gained two new functions for inspecting code, :func:`~dis.code_info` and :func:`~dis.show_code`. Both provide detailed code object information for the supplied function, method, source code string or code object. The former returns a string and the latter prints it::
uk: Модуль :mod:`dis` отримав дві нові функції для перевірки коду, :func:`~dis.code_info` і :func:`~dis.show_code`. Обидва надають детальну інформацію про об’єкт коду для наданої функції, методу, рядка вихідного коду або об’єкта коду. Перший повертає рядок, а другий друкує його::

source: In addition, the :func:`~dis.dis` function now accepts string arguments so that the common idiom ``dis(compile(s, '', 'eval'))`` can be shortened to ``dis(s)``::
uk: Крім того, функція :func:`~dis.dis` тепер приймає рядкові аргументи, щоб загальну ідіому ``dis(compile(s, '', 'eval'))`` можна було скоротити до ``dis(s) )``::

source: Taken together, these improvements make it easier to explore how CPython is implemented and to see for yourself what the language syntax does under-the-hood.
uk: У сукупності ці вдосконалення полегшують вивчення того, як реалізовано CPython, і на власні очі побачити, що робить синтаксис мови під капотом.

source: (Contributed by Nick Coghlan in :issue:`9147`.)
uk: (Надав Нік Коглан у :issue:`9147`.)

source: All database modules now support the :meth:`get` and :meth:`setdefault` methods.
uk: Усі модулі бази даних тепер підтримують методи :meth:`get` і :meth:`setdefault`.

source: (Suggested by Ray Allen in :issue:`9523`.)
uk: (Запропоновано Реєм Алленом у :issue:`9523`.)

source: A new type, :class:`ctypes.c_ssize_t` represents the C :c:type:`ssize_t` datatype.
uk: Новий тип :class:`ctypes.c_ssize_t` представляє тип даних C :c:type:`ssize_t`.

source: site
uk: сайт

source: The :mod:`site` module has three new functions useful for reporting on the details of a given Python installation.
uk: Модуль :mod:`site` має три нові функції, корисні для звітування про деталі певної інсталяції Python.

source: :func:`~site.getsitepackages` lists all global site-packages directories.
uk: :func:`~site.getsitepackages` містить список усіх глобальних каталогів пакетів сайту.

source: :func:`~site.getuserbase` reports on the user's base directory where data can be stored.
uk: :func:`~site.getuserbase` повідомляє про базовий каталог користувача, де можуть зберігатися дані.

source: :func:`~site.getusersitepackages` reveals the user-specific site-packages directory path.
uk: :func:`~site.getusersitepackages` показує шлях до каталогу пакетів сайтів для користувача.

source: Conveniently, some of site's functionality is accessible directly from the command-line:
uk: Зручно те, що деякі функції сайту доступні безпосередньо з командного рядка:

source: (Contributed by Tarek Ziadé in :issue:`6693`.)
uk: (Надав Тарек Зіаде в :issue:`6693`.)

source: The new :mod:`sysconfig` module makes it straightforward to discover installation paths and configuration variables that vary across platforms and installations.
uk: Новий модуль :mod:`sysconfig` дозволяє легко знаходити шляхи встановлення та змінні конфігурації, які різняться залежно від платформи та встановлення.

source: The module offers access simple access functions for platform and version information:
uk: Модуль пропонує прості функції доступу до інформації про платформу та версію:

source: :func:`~sysconfig.get_platform` returning values like *linux-i586* or *macosx-10.6-ppc*.
uk: :func:`~sysconfig.get_platform` повертає такі значення, як *linux-i586* або *macosx-10.6-ppc*.

source: :func:`~sysconfig.get_python_version` returns a Python version string such as "3.2".
uk: :func:`~sysconfig.get_python_version` повертає рядок версії Python, наприклад "3.2".

source: It also provides access to the paths and variables corresponding to one of seven named schemes used by :mod:`distutils`. Those include *posix_prefix*, *posix_home*, *posix_user*, *nt*, *nt_user*, *os2*, *os2_home*:
uk: Він також надає доступ до шляхів і змінних, що відповідають одній із семи названих схем, які використовує :mod:`distutils`. До них належать *posix_prefix*, *posix_home*, *posix_user*, *nt*, *nt_user*, *os2*, *os2_home*:

source: :func:`~sysconfig.get_paths` makes a dictionary containing installation paths for the current installation scheme.
uk: :func:`~sysconfig.get_paths` створює словник, що містить шляхи встановлення для поточної схеми встановлення.

source: :func:`~sysconfig.get_config_vars` returns a dictionary of platform specific variables.
uk: :func:`~sysconfig.get_config_vars` повертає словник специфічних змінних платформи.

source: There is also a convenient command-line interface:
uk: Також є зручний інтерфейс командного рядка:

source: (Moved out of Distutils by Tarek Ziadé.)
uk: (Виведено з Distutils Тареком Зіаде.)

source: The :mod:`pdb` debugger module gained a number of usability improvements:
uk: Модуль налагоджувача :mod:`pdb` отримав низку покращень зручності використання:

source: :file:`pdb.py` now has a ``-c`` option that executes commands as given in a :file:`.pdbrc` script file.
uk: :file:`pdb.py` тепер має опцію ``-c``, яка виконує команди, подані у файлі сценарію :file:`.pdbrc`.

source: A :file:`.pdbrc` script file can contain ``continue`` and ``next`` commands that continue debugging.
uk: Файл сценарію :file:`.pdbrc` може містити команди ``continue`` і ``next``, які продовжують налагодження.

source: The :class:`Pdb` class constructor now accepts a *nosigint* argument.
uk: Конструктор класу :class:`Pdb` тепер приймає аргумент *nosigint*.

source: New commands: ``l(list)``, ``ll(long list)`` and ``source`` for listing source code.
uk: Нові команди: ``l(list)``, ``ll(long list)`` і ``source`` для переліку вихідного коду.

source: New commands: ``display`` and ``undisplay`` for showing or hiding the value of an expression if it has changed.
uk: Нові команди: ``display`` і ``undisplay`` для показу або приховання значення виразу, якщо воно змінилося.

source: New command: ``interact`` for starting an interactive interpreter containing the global and local names found in the current scope.
uk: Нова команда: ``interact`` для запуску інтерактивного інтерпретатора, що містить глобальні та локальні імена, знайдені в поточній області.

source: Breakpoints can be cleared by breakpoint number.
uk: Точки зупину можна очистити за номером точки зупину.

source: (Contributed by Georg Brandl, Antonio Cuni and Ilya Sandler.)
uk: (Надано Георгом Брандлом, Антоніо Куні та Іллею Сендлером.)

source: configparser
uk: аналізатор конфігурації

source: The :mod:`configparser` module was modified to improve usability and predictability of the default parser and its supported INI syntax. The old :class:`ConfigParser` class was removed in favor of :class:`SafeConfigParser` which has in turn been renamed to :class:`~configparser.ConfigParser`. Support for inline comments is now turned off by default and section or option duplicates are not allowed in a single configuration source.
uk: Модуль :mod:`configparser` було змінено, щоб покращити зручність і передбачуваність синтаксичного аналізатора за замовчуванням і його підтримуваного синтаксису INI. Старий клас :class:`ConfigParser` було видалено на користь :class:`SafeConfigParser`, який, у свою чергу, було перейменовано на :class:`~configparser.ConfigParser`. Підтримку вбудованих коментарів тепер вимкнено за замовчуванням, а дублікати розділів або параметрів не допускаються в одному джерелі конфігурації.

source: Config parsers gained a new API based on the mapping protocol::
uk: Конфігураційні аналізатори отримали новий API на основі протоколу відображення:

source: The new API is implemented on top of the classical API, so custom parser subclasses should be able to use it without modifications.
uk: Новий API реалізовано поверх класичного API, тому користувацькі підкласи парсерів повинні мати можливість використовувати його без змін.

source: The INI file structure accepted by config parsers can now be customized. Users can specify alternative option/value delimiters and comment prefixes, change the name of the *DEFAULT* section or switch the interpolation syntax.
uk: Тепер можна налаштувати структуру INI-файлу, прийняту аналізаторами конфігурації. Користувачі можуть вказати альтернативні роздільники параметрів/значень і префікси коментарів, змінити назву розділу *DEFAULT* або змінити синтаксис інтерполяції.

source: There is support for pluggable interpolation including an additional interpolation handler :class:`~configparser.ExtendedInterpolation`::
uk: Існує підтримка вбудованої інтерполяції, включаючи додатковий обробник інтерполяції :class:`~configparser.ExtendedInterpolation`::
