Repository: python/python-docs-uk
Catalog: whatsnew/3.2.po
Languages: uk

source: What's New In Python 3.2
uk: Що нового в Python 3.2

source: Author
uk: Автор

source: This article explains the new features in Python 3.2 as compared to 3.1. Python 3.2 was released on February 20, 2011. It focuses on a few highlights and gives a few examples. For full details, see the `Misc/NEWS <https://github.com/python/cpython/blob/076ca6c3c8df3030307e548d9be792ce3c1c6eea/Misc/NEWS>`_ file.
uk: У цій статті пояснюється нові функції в Python 3.2 порівняно з 3.1. Python 3.2 було випущено 20 лютого 2011 року. Він зосереджений на кількох основних моментах і надає кілька прикладів. Щоб отримати повну інформацію, перегляньте файл `Misc/NEWS <https://github.com/python/cpython/blob/076ca6c3c8df3030307e548d9be792ce3c1c6eea/Misc/NEWS>`_.

source: :pep:`392` - Python 3.2 Release Schedule
uk: :pep:`392` - Графік випуску Python 3.2

source: PEP 384: Defining a Stable ABI
uk: PEP 384: Визначення стабільного ABI

source: In the past, extension modules built for one Python version were often not usable with other Python versions. Particularly on Windows, every feature release of Python required rebuilding all extension modules that one wanted to use. This requirement was the result of the free access to Python interpreter internals that extension modules could use.
uk: У минулому модулі розширення, створені для однієї версії Python, часто не можна було використовувати з іншими версіями Python. Зокрема, у Windows кожен випуск функції Python вимагав перебудови всіх модулів розширення, які потрібно було використовувати. Ця вимога була результатом вільного доступу до внутрішніх елементів інтерпретатора Python, які могли використовувати модулі розширення.

source: With Python 3.2, an alternative approach becomes available: extension modules which restrict themselves to a limited API (by defining Py_LIMITED_API) cannot use many of the internals, but are constrained to a set of API functions that are promised to be stable for several releases. As a consequence, extension modules built for 3.2 in that mode will also work with 3.3, 3.4, and so on. Extension modules that make use of details of memory structures can still be built, but will need to be recompiled for every feature release.
uk: З Python 3.2 стає доступним альтернативний підхід: модулі розширення, які обмежуються обмеженим API (шляхом визначення Py_LIMITED_API), не можуть використовувати багато внутрішніх компонентів, але обмежені набором функцій API, які обіцяють бути стабільними для кількох випусків. Як наслідок, модулі розширення, створені для 3.2 у цьому режимі, також працюватимуть з 3.3, 3.4 тощо. Модулі розширення, які використовують деталі структур пам’яті, все ще можуть бути створені, але їх потрібно буде перекомпілювати для кожного випуску функції.

source: :pep:`384` - Defining a Stable ABI
uk: :pep:`384` - Визначення стабільного ABI

source: PEP written by Martin von Löwis.
uk: PEP, написаний Мартіном фон Льовісом.

source: PEP 389: Argparse Command Line Parsing Module
uk: PEP 389: Модуль аналізу командного рядка Argparse

source: A new module for command line parsing, :mod:`argparse`, was introduced to overcome the limitations of :mod:`optparse` which did not provide support for positional arguments (not just options), subcommands, required options and other common patterns of specifying and validating options.
uk: Новий модуль для синтаксичного аналізу командного рядка, :mod:`argparse`, було представлено, щоб подолати обмеження :mod:`optparse`, які не забезпечували підтримку позиційних аргументів (не лише параметрів), підкоманд, необхідних параметрів та інших поширених шаблонів визначення та перевірки параметрів.

source: This module has already had widespread success in the community as a third-party module. Being more fully featured than its predecessor, the :mod:`argparse` module is now the preferred module for command-line processing. The older module is still being kept available because of the substantial amount of legacy code that depends on it.
uk: Цей модуль уже мав широкий успіх у спільноті як сторонній модуль. Оскільки модуль :mod:`argparse` є більш повнофункціональним, ніж його попередник, він тепер є кращим модулем для обробки командного рядка. Старіший модуль все ще залишається доступним через значну кількість застарілого коду, який залежить від нього.

source: Here's an annotated example parser showing features like limiting results to a set of choices, specifying a *metavar* in the help screen, validating that one or more positional arguments is present, and making a required option::
uk: Ось анотований приклад синтаксичного аналізатора, який показує такі функції, як обмеження результатів набором варіантів, визначення *metavar* на екрані довідки, перевірка наявності одного чи кількох позиційних аргументів і створення необхідної опції::

source: Example of calling the parser on a command string::
uk: Приклад виклику синтаксичного аналізатора за командним рядком::

source: Example of the parser's automatically generated help::
uk: Приклад автоматично створеної довідки парсера::

source: An especially nice :mod:`argparse` feature is the ability to define subparsers, each with their own argument patterns and help displays::
uk: Особливо приємною функцією :mod:`argparse` є можливість визначати підпарсери, кожен зі своїми власними шаблонами аргументів і довідкою:

source: :pep:`389` - New Command Line Parsing Module
uk: :pep:`389` - Новий модуль аналізу командного рядка

source: PEP written by Steven Bethard.
uk: PEP, написаний Стівеном Бетардом.

source: :ref:`upgrading-optparse-code` for details on the differences from :mod:`optparse`.
uk: :ref:`upgrading-optparse-code` для детальної інформації про відмінності від :mod:`optparse`.

source: PEP 391: Dictionary Based Configuration for Logging
uk: PEP 391: Конфігурація на основі словника для журналювання

source: The :mod:`logging` module provided two kinds of configuration, one style with function calls for each option or another style driven by an external file saved in a :mod:`ConfigParser` format. Those options did not provide the flexibility to create configurations from JSON or YAML files, nor did they support incremental configuration, which is needed for specifying logger options from a command line.
uk: Модуль :mod:`logging` надав два види конфігурації: один стиль із викликами функцій для кожного параметра або інший стиль, керований зовнішнім файлом, збереженим у форматі :mod:`ConfigParser`. Ці параметри не забезпечували гнучкості для створення конфігурацій із файлів JSON або YAML, а також не підтримували інкрементну конфігурацію, яка потрібна для вказівки параметрів журналу з командного рядка.

source: To support a more flexible style, the module now offers :func:`logging.config.dictConfig` for specifying logging configuration with plain Python dictionaries. The configuration options include formatters, handlers, filters, and loggers. Here's a working example of a configuration dictionary::
uk: Щоб підтримувати більш гнучкий стиль, модуль тепер пропонує :func:`logging.config.dictConfig` для визначення конфігурації журналювання за допомогою простих словників Python. Опції конфігурації включають засоби форматування, обробники, фільтри та реєстратори. Ось робочий приклад словника конфігурації::

source: If that dictionary is stored in a file called :file:`conf.json`, it can be loaded and called with code like this::
uk: Якщо цей словник зберігається у файлі під назвою :file:`conf.json`, його можна завантажити та викликати за допомогою такого коду:

source: :pep:`391` - Dictionary Based Configuration for Logging
uk: :pep:`391` - Конфігурація для журналювання на основі словника

source: PEP written by Vinay Sajip.
uk: PEP, написаний Вінаєм Саджипом.

source: PEP 3148: The ``concurrent.futures`` module
uk: PEP 3148: модуль ``concurrent.futures``

source: Code for creating and managing concurrency is being collected in a new top-level namespace, *concurrent*. Its first member is a *futures* package which provides a uniform high-level interface for managing threads and processes.
uk: Код для створення паралелізму та керування ним збирається в новому просторі імен верхнього рівня *concurrent*. Його першим членом є пакет *futures*, який забезпечує єдиний інтерфейс високого рівня для керування потоками та процесами.

source: The design for :mod:`concurrent.futures` was inspired by the *java.util.concurrent* package. In that model, a running call and its result are represented by a :class:`~concurrent.futures.Future` object that abstracts features common to threads, processes, and remote procedure calls. That object supports status checks (running or done), timeouts, cancellations, adding callbacks, and access to results or exceptions.
uk: Дизайн для :mod:`concurrent.futures` був натхненний пакетом *java.util.concurrent*. У цій моделі запущений виклик і його результат представлені об’єктом :class:`~concurrent.futures.Future`, який абстрагує функції, спільні для потоків, процесів і віддалених викликів процедур. Цей об’єкт підтримує перевірки статусу (запущено або виконано), тайм-аути, скасування, додавання зворотних викликів і доступ до результатів або винятків.

source: The primary offering of the new module is a pair of executor classes for launching and managing calls. The goal of the executors is to make it easier to use existing tools for making parallel calls. They save the effort needed to setup a pool of resources, launch the calls, create a results queue, add time-out handling, and limit the total number of threads, processes, or remote procedure calls.
uk: Основною пропозицією нового модуля є пара класів виконавців для запуску викликів і керування ними. Мета виконавців — спростити використання існуючих інструментів для здійснення паралельних викликів. Вони економлять зусилля, необхідні для налаштування пулу ресурсів, запуску викликів, створення черги результатів, додавання обробки тайм-ауту та обмеження загальної кількості потоків, процесів або віддалених викликів процедур.

source: Ideally, each application should share a single executor across multiple components so that process and thread limits can be centrally managed. This solves the design challenge that arises when each component has its own competing strategy for resource management.
uk: В ідеалі кожна програма має спільно використовувати одного виконавця для кількох компонентів, щоб можна було централізовано керувати обмеженнями процесів і потоків. Це вирішує проблему проектування, яка виникає, коли кожен компонент має власну конкуруючу стратегію управління ресурсами.

source: Both classes share a common interface with three methods: :meth:`~concurrent.futures.Executor.submit` for scheduling a callable and returning a :class:`~concurrent.futures.Future` object; :meth:`~concurrent.futures.Executor.map` for scheduling many asynchronous calls at a time, and :meth:`~concurrent.futures.Executor.shutdown` for freeing resources. The class is a :term:`context manager` and can be used in a :keyword:`with` statement to assure that resources are automatically released when currently pending futures are done executing.
uk: Обидва класи мають спільний інтерфейс із трьома методами: :meth:`~concurrent.futures.Executor.submit` для планування виклику та повернення об’єкта :class:`~concurrent.futures.Future`; :meth:`~concurrent.futures.Executor.map` для планування багатьох асинхронних викликів одночасно та :meth:`~concurrent.futures.Executor.shutdown` для звільнення ресурсів. Цей клас є :term:`context manager` і може використовуватися в операторі :keyword:`with`, щоб гарантувати автоматичне звільнення ресурсів після завершення виконання незавершених ф’ючерсів.

source: A simple of example of :class:`~concurrent.futures.ThreadPoolExecutor` is a launch of four parallel threads for copying files::
uk: Простий приклад :class:`~concurrent.futures.ThreadPoolExecutor` — це запуск чотирьох паралельних потоків для копіювання файлів::

source: :pep:`3148` - Futures -- Execute Computations Asynchronously
uk: :pep:`3148` - Ф'ючерси - асинхронне виконання обчислень

source: PEP written by Brian Quinlan.
uk: PEP, написаний Браяном Квінланом.

source: :ref:`Code for Threaded Parallel URL reads<threadpoolexecutor-example>`, an example using threads to fetch multiple web pages in parallel.
uk: :ref:`Код для потокової паралельної URL-адреси читає <threadpoolexecutor-example>`, приклад використання потоків для отримання кількох веб-сторінок паралельно.

source: :ref:`Code for computing prime numbers in parallel<processpoolexecutor-example>`, an example demonstrating :class:`~concurrent.futures.ProcessPoolExecutor`.
uk: :ref:`Код для паралельного обчислення простих чисел <processpoolexecutor-example>`, приклад, що демонструє :class:`~concurrent.futures.ProcessPoolExecutor`.

source: PEP 3147: PYC Repository Directories
uk: PEP 3147: Каталоги сховищ PYC

source: Python's scheme for caching bytecode in *.pyc* files did not work well in environments with multiple Python interpreters. If one interpreter encountered a cached file created by another interpreter, it would recompile the source and overwrite the cached file, thus losing the benefits of caching.
uk: Схема Python для кешування байт-коду у файлах *.pyc* погано працювала в середовищах із кількома інтерпретаторами Python. Якщо один інтерпретатор зустріне кешований файл, створений іншим інтерпретатором, він перекомпілює джерело та перезапише кешований файл, таким чином втрачаючи переваги кешування.

source: The issue of "pyc fights" has become more pronounced as it has become commonplace for Linux distributions to ship with multiple versions of Python. These conflicts also arise with CPython alternatives such as Unladen Swallow.
uk: Питання "бій pyc" стало більш помітним, оскільки дистрибутиви Linux стали звичайними для доставки з декількома версіями Python. Ці конфлікти також виникають з альтернативами CPython, такими як Unladen Swallow.

source: To solve this problem, Python's import machinery has been extended to use distinct filenames for each interpreter. Instead of Python 3.2 and Python 3.3 and Unladen Swallow each competing for a file called "mymodule.pyc", they will now look for "mymodule.cpython-32.pyc", "mymodule.cpython-33.pyc", and "mymodule.unladen10.pyc". And to prevent all of these new files from cluttering source directories, the *pyc* files are now collected in a "__pycache__" directory stored under the package directory.
uk: Щоб вирішити цю проблему, механізм імпорту Python було розширено для використання різних імен файлів для кожного інтерпретатора. Замість того, щоб Python 3.2, Python 3.3 і Unladen Swallow змагалися за файл під назвою "mymodule.pyc", тепер вони шукатимуть "mymodule.cpython-32.pyc", "mymodule.cpython-33.pyc" і "mymodule". .unladen10.pyc". І щоб усі ці нові файли не захаращували вихідні каталоги, файли *pyc* тепер зібрані в каталозі "__pycache__", який зберігається в каталозі пакетів.

source: Aside from the filenames and target directories, the new scheme has a few aspects that are visible to the programmer:
uk: Крім імен файлів і цільових каталогів, нова схема має кілька аспектів, які бачать програмісти:

source: Imported modules now have a :attr:`__cached__` attribute which stores the name of the actual file that was imported:
uk: Імпортовані модулі тепер мають атрибут :attr:`__cached__`, який зберігає назву фактичного файлу, який було імпортовано:

source: The tag that is unique to each interpreter is accessible from the :mod:`imp` module:
uk: Тег, унікальний для кожного інтерпретатора, доступний з модуля :mod:`imp`:

source: Scripts that try to deduce source filename from the imported file now need to be smarter. It is no longer sufficient to simply strip the "c" from a ".pyc" filename. Instead, use the new functions in the :mod:`imp` module:
uk: Сценарії, які намагаються вивести назву вихідного файлу з імпортованого файлу, тепер мають бути розумнішими. Більше недостатньо просто видалити букву "c" із імені файлу ".pyc". Замість цього використовуйте нові функції в модулі :mod:`imp`:

source: The :mod:`py_compile` and :mod:`compileall` modules have been updated to reflect the new naming convention and target directory. The command-line invocation of *compileall* has new options: ``-i`` for specifying a list of files and directories to compile and ``-b`` which causes bytecode files to be written to their legacy location rather than *__pycache__*.
uk: Модулі :mod:`py_compile` і :mod:`compileall` оновлено, щоб відобразити нову угоду про іменування та цільовий каталог. Виклик *compileall* у командному рядку має нові параметри: ``-i`` для вказівки списку файлів і каталогів для компіляції та ``-b``, який змушує файли байт-коду записуватися в їх старе розташування, а не в *__pycache__*.

source: The :mod:`importlib.abc` module has been updated with new :term:`abstract base classes <abstract base class>` for loading bytecode files. The obsolete ABCs, :class:`~importlib.abc.PyLoader` and :class:`~importlib.abc.PyPycLoader`, have been deprecated (instructions on how to stay Python 3.1 compatible are included with the documentation).
uk: Модуль :mod:`importlib.abc` було оновлено новими :term:`абстрактними базовими класами <abstract base class>` для завантаження файлів байт-кодів. Застарілі ABC, :class:`~importlib.abc.PyLoader` і :class:`~importlib.abc.PyPycLoader`, стали застарілими (інструкції щодо того, як залишатися сумісними з Python 3.1, включено до документації).

source: :pep:`3147` - PYC Repository Directories
uk: :pep:`3147` - Каталоги репозиторіїв PYC

source: PEP written by Barry Warsaw.
uk: PEP, автор Баррі Варшау.

source: PEP 3149: ABI Version Tagged .so Files
uk: PEP 3149: файли .so з тегами версії ABI

source: The PYC repository directory allows multiple bytecode cache files to be co-located. This PEP implements a similar mechanism for shared object files by giving them a common directory and distinct names for each version.
uk: Каталог сховища PYC дозволяє одночасно розміщувати кілька файлів кешу байт-кодів. Цей PEP реалізує подібний механізм для файлів спільних об’єктів, надаючи їм загальний каталог і окремі імена для кожної версії.

source: The common directory is "pyshared" and the file names are made distinct by identifying the Python implementation (such as CPython, PyPy, Jython, etc.), the major and minor version numbers, and optional build flags (such as "d" for debug, "m" for pymalloc, "u" for wide-unicode). For an arbitrary package "foo", you may see these files when the distribution package is installed::
uk: Загальний каталог є "pyshared", а назви файлів відрізняються ідентифікацією реалізації Python (наприклад, CPython, PyPy, Jython тощо), номерами основної та другорядної версій і необов’язковими прапорцями збірки (наприклад, "d" для debug, "m" для pymalloc, "u" для широкого юнікоду). Для довільного пакета "foo" ви можете побачити ці файли, коли встановлено дистрибутивний пакет:

source: In Python itself, the tags are accessible from functions in the :mod:`sysconfig` module::
uk: У самому Python теги доступні з функцій у модулі :mod:`sysconfig`::

source: :pep:`3149` - ABI Version Tagged .so Files
uk: :pep:`3149` - файли .so з тегами версії ABI

source: PEP 3333: Python Web Server Gateway Interface v1.0.1
uk: PEP 3333: Інтерфейс шлюзу веб-сервера Python v1.0.1

source: This informational PEP clarifies how bytes/text issues are to be handled by the WSGI protocol. The challenge is that string handling in Python 3 is most conveniently handled with the :class:`str` type even though the HTTP protocol is itself bytes oriented.
uk: Цей інформаційний PEP пояснює, як протокол WSGI має обробляти проблеми з байтами/текстом. Проблема полягає в тому, що обробку рядків у Python 3 найзручніше обробляти за допомогою типу :class:`str`, хоча сам протокол HTTP орієнтований на байти.

source: The PEP differentiates so-called *native strings* that are used for request/response headers and metadata versus *byte strings* which are used for the bodies of requests and responses.
uk: PEP розрізняє так звані *власні рядки*, які використовуються для заголовків запитів/відповідей і метаданих, від *байтових рядків*, які використовуються для тіл запитів і відповідей.

source: The *native strings* are always of type :class:`str` but are restricted to code points between *U+0000* through *U+00FF* which are translatable to bytes using *Latin-1* encoding. These strings are used for the keys and values in the environment dictionary and for response headers and statuses in the :func:`start_response` function. They must follow :rfc:`2616` with respect to encoding. That is, they must either be *ISO-8859-1* characters or use :rfc:`2047` MIME encoding.
uk: *Власні рядки* завжди мають тип :class:`str`, але обмежені кодовими точками від *U+0000* до *U+00FF*, які можна перевести в байти за допомогою кодування *Latin-1*. Ці рядки використовуються для ключів і значень у словнику середовища та для заголовків відповідей і статусів у функції :func:`start_response`. Вони повинні відповідати :rfc:`2616` щодо кодування. Тобто вони мають бути символами *ISO-8859-1* або використовувати кодування MIME :rfc:`2047`.

source: For developers porting WSGI applications from Python 2, here are the salient points:
uk: Для розробників, які портують програми WSGI з Python 2, ось основні моменти:

source: If the app already used strings for headers in Python 2, no change is needed.
uk: Якщо програма вже використовувала рядки для заголовків у Python 2, змінювати не потрібно.

source: If instead, the app encoded output headers or decoded input headers, then the headers will need to be re-encoded to Latin-1. For example, an output header encoded in utf-8 was using ``h.encode('utf-8')`` now needs to convert from bytes to native strings using ``h.encode('utf-8').decode('latin-1')``.
uk: Якщо замість цього програма закодувала вихідні заголовки або декодувала вхідні заголовки, тоді заголовки потрібно буде повторно закодувати в Latin-1. Наприклад, вихідний заголовок, закодований у utf-8, використовував ``h.encode('utf-8')``, тепер потребує конвертації з байтів у власні рядки за допомогою ``h.encode('utf-8'). decode('latin-1')``.

source: Values yielded by an application or sent using the :meth:`write` method must be byte strings. The :func:`start_response` function and environ must use native strings. The two cannot be mixed.
uk: Значення, отримані програмою або надіслані за допомогою методу :meth:`write`, мають бути рядками байтів. Функція :func:`start_response` і середовище мають використовувати рідні рядки. Те двоє не можна змішувати.

source: For server implementers writing CGI-to-WSGI pathways or other CGI-style protocols, the users must to be able access the environment using native strings even though the underlying platform may have a different convention. To bridge this gap, the :mod:`wsgiref` module has a new function, :func:`wsgiref.handlers.read_environ` for transcoding CGI variables from :attr:`os.environ` into native strings and returning a new dictionary.
uk: Для розробників серверів, які пишуть шляхи CGI-to-WSGI або інші протоколи в стилі CGI, користувачі повинні мати доступ до середовища за допомогою власних рядків, навіть якщо основна платформа може мати іншу конвенцію. Щоб подолати цю прогалину, модуль :mod:`wsgiref` має нову функцію, :func:`wsgiref.handlers.read_environ` для перекодування змінних CGI з :attr:`os.environ` у рідні рядки та повернення нового словника.

source: :pep:`3333` - Python Web Server Gateway Interface v1.0.1
uk: :pep:`3333` - Інтерфейс шлюзу веб-сервера Python v1.0.1

source: PEP written by Phillip Eby.
uk: PEP, написаний Філіпом Ебі.

source: Other Language Changes
uk: Інші зміни мови

source: Some smaller changes made to the core Python language are:
uk: Деякі менші зміни, внесені до основної мови Python:
