Repository: python/python-docs-uk
Catalog: whatsnew/3.2.po
Languages: uk

source: Formerly, this would have only been usable as a context manager::
uk: Раніше це можна було використовувати лише як контекстний менеджер::

source: Now, it can be used as a decorator as well::
uk: Тепер його можна використовувати і як декоратор:

source: Trying to fulfill two roles at once places some limitations on the technique. Context managers normally have the flexibility to return an argument usable by a :keyword:`with` statement, but there is no parallel for function decorators.
uk: Спроба виконувати дві ролі одночасно накладає деякі обмеження на техніку. Менеджери контексту зазвичай мають гнучкість для повернення аргументу, який можна використовувати оператором :keyword:`with`, але немає аналогії для декораторів функцій.

source: In the above example, there is not a clean way for the *track_entry_and_exit* context manager to return a logging instance for use in the body of enclosed statements.
uk: У наведеному вище прикладі немає чистого способу для менеджера контексту *track_entry_and_exit* повернути примірник журналювання для використання в тілі вкладених операторів.

source: (Contributed by Michael Foord in :issue:`9110`.)
uk: (Надав Майкл Форд у :issue:`9110`.)

source: decimal and fractions
uk: десятковий і дробовий

source: Mark Dickinson crafted an elegant and efficient scheme for assuring that different numeric datatypes will have the same hash value whenever their actual values are equal (:issue:`8188`)::
uk: Марк Дікінсон розробив елегантну та ефективну схему, яка гарантує, що різні типи числових даних матимуть однакове хеш-значення, якщо їхні фактичні значення рівні (:issue:`8188`):

source: Some of the hashing details are exposed through a new attribute, :attr:`sys.hash_info`, which describes the bit width of the hash value, the prime modulus, the hash values for *infinity* and *nan*, and the multiplier used for the imaginary part of a number:
uk: Деякі деталі хешування доступні через новий атрибут :attr:`sys.hash_info`, який описує бітову ширину хеш-значення, простий модуль, хеш-значення для *infinity* і *nan* і множник використовується для уявної частини числа:

source: An early decision to limit the inter-operability of various numeric types has been relaxed. It is still unsupported (and ill-advised) to have implicit mixing in arithmetic expressions such as ``Decimal('1.1') + float('1.1')`` because the latter loses information in the process of constructing the binary float. However, since existing floating point value can be converted losslessly to either a decimal or rational representation, it makes sense to add them to the constructor and to support mixed-type comparisons.
uk: Попереднє рішення щодо обмеження сумісності різних числових типів було послаблено. Досі не підтримується (і є недоцільним) мати неявне змішування в арифметичних виразах, таких як ``Decimal('1.1') + float('1.1')``, оскільки останній втрачає інформацію в процесі побудови двійкового float. Однак, оскільки існуюче значення з плаваючою комою можна без втрат перетворити в десяткове чи раціональне представлення, має сенс додати їх до конструктора та підтримувати порівняння змішаного типу.

source: The :class:`decimal.Decimal` constructor now accepts :class:`float` objects directly so there in no longer a need to use the :meth:`~decimal.Decimal.from_float` method (:issue:`8257`).
uk: Конструктор :class:`decimal.Decimal` тепер приймає об’єкти :class:`float` безпосередньо, тому більше не потрібно використовувати метод :meth:`~decimal.Decimal.from_float` (:issue:`8257`) .

source: Mixed type comparisons are now fully supported so that :class:`~decimal.Decimal` objects can be directly compared with :class:`float` and :class:`fractions.Fraction` (:issue:`2531` and :issue:`8188`).
uk: Порівняння змішаних типів тепер повністю підтримуються, тому об’єкти :class:`~decimal.Decimal` можна безпосередньо порівнювати з :class:`float` і :class:`fractions.Fraction` (:issue:`2531` і :issue:`8188`).

source: Similar changes were made to :class:`fractions.Fraction` so that the :meth:`~fractions.Fraction.from_float()` and :meth:`~fractions.Fraction.from_decimal` methods are no longer needed (:issue:`8294`):
uk: Подібні зміни було внесено до :class:`fractions.Fraction`, тому методи :meth:`~fraction.Fraction.from_float()` і :meth:`~fractions.Fraction.from_decimal` більше не потрібні (:issue:`8294`):

source: Another useful change for the :mod:`decimal` module is that the :attr:`Context.clamp` attribute is now public. This is useful in creating contexts that correspond to the decimal interchange formats specified in IEEE 754 (see :issue:`8540`).
uk: Ще одна корисна зміна для модуля :mod:`decimal` полягає в тому, що атрибут :attr:`Context.clamp` тепер відкритий. Це корисно для створення контекстів, які відповідають десятковим форматам обміну, визначеним у IEEE 754 (див. :issue:`8540`).

source: (Contributed by Mark Dickinson and Raymond Hettinger.)
uk: (Надано Марком Дікінсоном і Реймондом Геттінгером.)

source: The :class:`ftplib.FTP` class now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the FTP connection when done::
uk: Клас :class:`ftplib.FTP` тепер підтримує протокол керування контекстом для безумовного використання винятків :exc:`socket.error` і закриття з’єднання FTP після завершення:

source: Other file-like objects such as :class:`mmap.mmap` and :func:`fileinput.input` also grew auto-closing context managers::
uk: Інші файлоподібні об’єкти, такі як :class:`mmap.mmap` і :func:`fileinput.input` також розширили менеджери контексту автоматичного закриття::

source: (Contributed by Tarek Ziadé and Giampaolo Rodolà in :issue:`4972`, and by Georg Brandl in :issue:`8046` and :issue:`1286`.)
uk: (Надано Тареком Зіаде та Джампаоло Родола у :issue:`4972` та Георгом Брандлом у :issue:`8046` та :issue:`1286`.)

source: The :class:`~ftplib.FTP_TLS` class now accepts a *context* parameter, which is a :class:`ssl.SSLContext` object allowing bundling SSL configuration options, certificates and private keys into a single (potentially long-lived) structure.
uk: Клас :class:`~ftplib.FTP_TLS` тепер приймає параметр *context*, який є об’єктом :class:`ssl.SSLContext`, що дозволяє об’єднувати параметри конфігурації SSL, сертифікати та закриті ключі в єдиний (потенційно довготривалий) структура.

source: (Contributed by Giampaolo Rodolà; :issue:`8806`.)
uk: (Надав Джампаоло Родола; :issue:`8806`.)

source: popen
uk: відкрити

source: The :func:`os.popen` and :func:`subprocess.Popen` functions now support :keyword:`with` statements for auto-closing of the file descriptors.
uk: Функції :func:`os.popen` і :func:`subprocess.Popen` тепер підтримують оператори :keyword:`with` для автоматичного закриття дескрипторів файлів.

source: (Contributed by Antoine Pitrou and Brian Curtin in :issue:`7461` and :issue:`10554`.)
uk: (Надано Антуаном Пітру та Браяном Кертіном у :issue:`7461` та :issue:`10554`.)

source: select
uk: вибрати

source: The :mod:`select` module now exposes a new, constant attribute, :attr:`~select.PIPE_BUF`, which gives the minimum number of bytes which are guaranteed not to block when :func:`select.select` says a pipe is ready for writing.
uk: Модуль :mod:`select` тепер надає новий постійний атрибут, :attr:`~select.PIPE_BUF`, який надає мінімальну кількість байтів, які гарантовано не блокуються, коли :func:`select.select` каже труба готова до письма.

source: (Available on Unix systems. Patch by Sébastien Sablé in :issue:`9862`)
uk: (Доступно в системах Unix. Патч Себастьєна Сабле в :issue:`9862`)

source: gzip and zipfile
uk: gzip і zipfile

source: :class:`gzip.GzipFile` now implements the :class:`io.BufferedIOBase` :term:`abstract base class` (except for ``truncate()``). It also has a :meth:`~gzip.GzipFile.peek` method and supports unseekable as well as zero-padded file objects.
uk: :class:`gzip.GzipFile` тепер реалізує :class:`io.BufferedIOBase` :term:`abstract base class` (крім ``truncate()``). Він також має метод :meth:`~gzip.GzipFile.peek` і підтримує об’єкти файлів, які не можна шукати, а також об’єкти з нульовим доповненням.

source: The :mod:`gzip` module also gains the :func:`~gzip.compress` and :func:`~gzip.decompress` functions for easier in-memory compression and decompression. Keep in mind that text needs to be encoded as :class:`bytes` before compressing and decompressing:
uk: Модуль :mod:`gzip` також отримує функції :func:`~gzip.compress` і :func:`~gzip.decompress` для полегшення стиснення та розпакування в пам’яті. Майте на увазі, що текст має бути закодований як :class:`bytes` перед стисненням і розпакуванням:

source: (Contributed by Anand B. Pillai in :issue:`3488`; and by Antoine Pitrou, Nir Aides and Brian Curtin in :issue:`9962`, :issue:`1675951`, :issue:`7471` and :issue:`2846`.)
uk: (Надано Анандом Б. Піллаєм у :issue:`3488`; і Антуаном Пітру, Ніром Ейдесом і Браяном Кертіном у :issue:`9962`, :issue:`1675951`, :issue:`7471` та :issue: "2846".)

source: Also, the :class:`zipfile.ZipExtFile` class was reworked internally to represent files stored inside an archive. The new implementation is significantly faster and can be wrapped in an :class:`io.BufferedReader` object for more speedups. It also solves an issue where interleaved calls to *read* and *readline* gave the wrong results.
uk: Крім того, клас :class:`zipfile.ZipExtFile` було внутрішньо перероблено для представлення файлів, що зберігаються в архіві. Нова реалізація є значно швидшою та може бути упакована в об’єкт :class:`io.BufferedReader` для більшого прискорення. Це також вирішує проблему, через яку чергувані виклики *read* і *readline* давали неправильні результати.

source: (Patch submitted by Nir Aides in :issue:`7610`.)
uk: (Патч надіслано Nir Aides у :issue:`7610`.)

source: The :class:`~tarfile.TarFile` class can now be used as a context manager. In addition, its :meth:`~tarfile.TarFile.add` method has a new option, *filter*, that controls which files are added to the archive and allows the file metadata to be edited.
uk: Клас :class:`~tarfile.TarFile` тепер можна використовувати як менеджер контексту. Крім того, його метод :meth:`~tarfile.TarFile.add` має новий параметр, *filter*, який контролює, які файли додаються до архіву, і дозволяє редагувати метадані файлу.

source: The new *filter* option replaces the older, less flexible *exclude* parameter which is now deprecated. If specified, the optional *filter* parameter needs to be a :term:`keyword argument`. The user-supplied filter function accepts a :class:`~tarfile.TarInfo` object and returns an updated :class:`~tarfile.TarInfo` object, or if it wants the file to be excluded, the function can return ``None``::
uk: Новий параметр *фільтр* замінює старіший, менш гнучкий параметр *exclude*, який зараз є застарілим. Якщо вказано, необов’язковий параметр *filter* має бути аргументом ключового слова (:term:`keyword argument`). Функція фільтра, надана користувачем, приймає об’єкт :class:`~tarfile.TarInfo` і повертає оновлений об’єкт :class:`~tarfile.TarInfo`, або якщо вона хоче, щоб файл було виключено, функція може повернути ``None``::

source: (Proposed by Tarek Ziadé and implemented by Lars Gustäbel in :issue:`6856`.)
uk: (Запропоновано Тареком Зіаді та реалізовано Ларсом Густебелем у :issue:`6856`.)

source: hashlib
uk: хешліб

source: The :mod:`hashlib` module has two new constant attributes listing the hashing algorithms guaranteed to be present in all implementations and those available on the current implementation::
uk: Модуль :mod:`hashlib` має два нові постійні атрибути, які перераховують алгоритми хешування, які гарантовано присутні в усіх реалізаціях, і доступні в поточній реалізації:

source: (Suggested by Carl Chenet in :issue:`7418`.)
uk: (Запропоновано Карлом Чене в :issue:`7418`.)

source: ast
uk: аст

source: The :mod:`ast` module has a wonderful a general-purpose tool for safely evaluating expression strings using the Python literal syntax. The :func:`ast.literal_eval` function serves as a secure alternative to the builtin :func:`eval` function which is easily abused. Python 3.2 adds :class:`bytes` and :class:`set` literals to the list of supported types: strings, bytes, numbers, tuples, lists, dicts, sets, booleans, and ``None``.
uk: Модуль :mod:`ast` має чудовий інструмент загального призначення для безпечної оцінки рядків виразів за допомогою синтаксису літералів Python. Функція :func:`ast.literal_eval` служить безпечною альтернативою вбудованій функції :func:`eval`, якою легко зловживати. Python 3.2 додає літерали :class:`bytes` і :class:`set` до списку підтримуваних типів: рядки, байти, числа, кортежі, списки, dicts, набори, логічні значення та ``None``.

source: (Implemented by Benjamin Peterson and Georg Brandl.)
uk: (Реалізовано Бенджаміном Петерсоном і Георгом Брандлом.)

source: os
uk: ос

source: Different operating systems use various encodings for filenames and environment variables. The :mod:`os` module provides two new functions, :func:`~os.fsencode` and :func:`~os.fsdecode`, for encoding and decoding filenames:
uk: Різні операційні системи використовують різні кодування для імен файлів і змінних середовища. Модуль :mod:`os` надає дві нові функції, :func:`~os.fsencode` і :func:`~os.fsdecode`, для кодування та декодування імен файлів:

source: Some operating systems allow direct access to encoded bytes in the environment. If so, the :attr:`os.supports_bytes_environ` constant will be true.
uk: Деякі операційні системи дозволяють прямий доступ до закодованих байтів у середовищі. Якщо так, константа :attr:`os.supports_bytes_environ` буде істинною.

source: For direct access to encoded environment variables (if available), use the new :func:`os.getenvb` function or use :data:`os.environb` which is a bytes version of :data:`os.environ`.
uk: Для прямого доступу до закодованих змінних середовища (якщо доступно) використовуйте нову функцію :func:`os.getenvb` або використовуйте :data:`os.environb`, яка є байтовою версією :data:`os.environ`.

source: (Contributed by Victor Stinner.)
uk: (Надав Віктор Стіннер.)

source: shutil
uk: шутил

source: The :func:`shutil.copytree` function has two new options:
uk: Функція :func:`shutil.copytree` має дві нові опції:

source: *ignore_dangling_symlinks*: when ``symlinks=False`` so that the function copies a file pointed to by a symlink, not the symlink itself. This option will silence the error raised if the file doesn't exist.
uk: *ignore_dangling_symlinks*: коли ``symlinks=False``, щоб функція копіювала файл, на який вказує символічне посилання, а не саме символічне посилання. Цей параметр заглушить повідомлення про помилку, якщо файл не існує.

source: *copy_function*: is a callable that will be used to copy files. :func:`shutil.copy2` is used by default.
uk: *copy_function*: це виклик, який використовуватиметься для копіювання файлів. :func:`shutil.copy2` використовується за умовчанням.

source: (Contributed by Tarek Ziadé.)
uk: (Надав Тарек Зіаде.)

source: In addition, the :mod:`shutil` module now supports :ref:`archiving operations <archiving-operations>` for zipfiles, uncompressed tarfiles, gzipped tarfiles, and bzipped tarfiles. And there are functions for registering additional archiving file formats (such as xz compressed tarfiles or custom formats).
uk: Крім того, модуль :mod:`shutil` тепер підтримує :ref:`операції архівування <archiving-operations>` для файлів zip, нестиснутих tar-файлів, tar-файлів gzip і tar-файлів bzip. Існують функції для реєстрації додаткових форматів архівних файлів (таких як стиснуті tar-файли xz або спеціальні формати).

source: The principal functions are :func:`~shutil.make_archive` and :func:`~shutil.unpack_archive`. By default, both operate on the current directory (which can be set by :func:`os.chdir`) and on any sub-directories. The archive filename needs to be specified with a full pathname. The archiving step is non-destructive (the original files are left unchanged).
uk: Основними функціями є :func:`~shutil.make_archive` і :func:`~shutil.unpack_archive`. За замовчуванням обидва працюють з поточним каталогом (який можна встановити за допомогою :func:`os.chdir`) і будь-якими підкаталогами. Ім’я файлу архіву має бути вказано з повним шляхом. Етап архівування є неруйнівним (оригінальні файли залишаються без змін).

source: The :mod:`sqlite3` module was updated to pysqlite version 2.6.0. It has two new capabilities.
uk: Модуль :mod:`sqlite3` оновлено до версії pysqlite 2.6.0. Він має дві нові можливості.

source: The :attr:`sqlite3.Connection.in_transit` attribute is true if there is an active transaction for uncommitted changes.
uk: Атрибут :attr:`sqlite3.Connection.in_transit` має значення true, якщо є активна транзакція для незафіксованих змін.

source: The :meth:`sqlite3.Connection.enable_load_extension` and :meth:`sqlite3.Connection.load_extension` methods allows you to load SQLite extensions from ".so" files. One well-known extension is the fulltext-search extension distributed with SQLite.
uk: Методи :meth:`sqlite3.Connection.enable_load_extension` і :meth:`sqlite3.Connection.load_extension` дозволяють завантажувати розширення SQLite з файлів ".so". Одним із відомих розширень є розширення повнотекстового пошуку, що поширюється разом із SQLite.

source: (Contributed by R. David Murray and Shashwat Anand; :issue:`8845`.)
uk: (Надано Р. Девідом Мюрреєм і Шашватом Анандом; :issue:`8845`.)

source: A new :mod:`html` module was introduced with only a single function, :func:`~html.escape`, which is used for escaping reserved characters from HTML markup:
uk: Представлено новий модуль :mod:`html` лише з однією функцією, :func:`~html.escape`, яка використовується для екранування зарезервованих символів із розмітки HTML:

source: socket
uk: гніздо

source: The :mod:`socket` module has two new improvements.
uk: Модуль :mod:`socket` має два нових покращення.

source: Socket objects now have a :meth:`~socket.socket.detach()` method which puts the socket into closed state without actually closing the underlying file descriptor. The latter can then be reused for other purposes. (Added by Antoine Pitrou; :issue:`8524`.)
uk: Об’єкти Socket тепер мають метод :meth:`~socket.socket.detach()`, який переводить сокет у закритий стан без фактичного закриття основного дескриптора файлу. Останній потім можна повторно використовувати для інших цілей. (Додав Антуан Пітру; :issue:`8524`.)

source: :func:`socket.create_connection` now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the socket when done. (Contributed by Giampaolo Rodolà; :issue:`9794`.)
uk: :func:`socket.create_connection` тепер підтримує протокол керування контекстом для безумовного використання винятків :exc:`socket.error` і закриття сокета після завершення. (Надав Джампаоло Родола; :issue:`9794`.)

source: The :mod:`ssl` module added a number of features to satisfy common requirements for secure (encrypted, authenticated) internet connections:
uk: Модуль :mod:`ssl` додав низку функцій, щоб задовольнити загальні вимоги до безпечних (зашифрованих, автентифікованих) інтернет-з’єднань:

source: A new class, :class:`~ssl.SSLContext`, serves as a container for persistent SSL data, such as protocol settings, certificates, private keys, and various other options. It includes a :meth:`~ssl.SSLContext.wrap_socket` for creating an SSL socket from an SSL context.
uk: Новий клас, :class:`~ssl.SSLContext`, служить контейнером для постійних даних SSL, таких як налаштування протоколу, сертифікати, приватні ключі та різні інші параметри. Він містить :meth:`~ssl.SSLContext.wrap_socket` для створення SSL-сокета з контексту SSL.

source: A new function, :func:`ssl.match_hostname`, supports server identity verification for higher-level protocols by implementing the rules of HTTPS (from :rfc:`2818`) which are also suitable for other protocols.
uk: Нова функція, :func:`ssl.match_hostname`, підтримує перевірку ідентичності сервера для протоколів вищого рівня, реалізуючи правила HTTPS (від :rfc:`2818`), які також підходять для інших протоколів.

source: The :func:`ssl.wrap_socket` constructor function now takes a *ciphers* argument. The *ciphers* string lists the allowed encryption algorithms using the format described in the `OpenSSL documentation <https://www.openssl.org/docs/manmaster/man1/ciphers.html#CIPHER-LIST-FORMAT>`__.
uk: Функція-конструктор :func:`ssl.wrap_socket` тепер приймає аргумент *ciphers*. Рядок *ciphers* містить список дозволених алгоритмів шифрування з використанням формату, описаного в `документації OpenSSL <https://www.openssl.org/docs/manmaster/man1/ciphers.html#CIPHER-LIST-FORMAT>`__.

source: When linked against recent versions of OpenSSL, the :mod:`ssl` module now supports the Server Name Indication extension to the TLS protocol, allowing multiple "virtual hosts" using different certificates on a single IP port. This extension is only supported in client mode, and is activated by passing the *server_hostname* argument to :meth:`ssl.SSLContext.wrap_socket`.
uk: При зв’язуванні з останніми версіями OpenSSL модуль :mod:`ssl` тепер підтримує розширення індикації імені сервера для протоколу TLS, дозволяючи кільком "віртуальним хостам" використовувати різні сертифікати на одному IP-порту. Це розширення підтримується лише в режимі клієнта та активується шляхом передачі аргументу *server_hostname* до :meth:`ssl.SSLContext.wrap_socket`.

source: Various options have been added to the :mod:`ssl` module, such as :data:`~ssl.OP_NO_SSLv2` which disables the insecure and obsolete SSLv2 protocol.
uk: До модуля :mod:`ssl` додано різні параметри, наприклад :data:`~ssl.OP_NO_SSLv2`, який вимикає небезпечний і застарілий протокол SSLv2.

source: The extension now loads all the OpenSSL ciphers and digest algorithms. If some SSL certificates cannot be verified, they are reported as an "unknown algorithm" error.
uk: Розширення тепер завантажує всі шифри OpenSSL і алгоритми дайджесту. Якщо деякі сертифікати SSL неможливо перевірити, вони повідомляються як помилка "невідомий алгоритм".

source: The version of OpenSSL being used is now accessible using the module attributes :data:`ssl.OPENSSL_VERSION` (a string), :data:`ssl.OPENSSL_VERSION_INFO` (a 5-tuple), and :data:`ssl.OPENSSL_VERSION_NUMBER` (an integer).
uk: Версія OpenSSL, яка використовується, тепер доступна за допомогою атрибутів модуля: :data:`ssl.OPENSSL_VERSION` (рядок), :data:`ssl.OPENSSL_VERSION_INFO` (кортеж з 5) і :data:`ssl.OPENSSL_VERSION_NUMBER` (ціле число).

source: (Contributed by Antoine Pitrou in :issue:`8850`, :issue:`1589`, :issue:`8322`, :issue:`5639`, :issue:`4870`, :issue:`8484`, and :issue:`8321`.)
uk: (Надав Антуан Пітру в :issue:`8850`, :issue:`1589`, :issue:`8322`, :issue:`5639`, :issue:`4870`, :issue:`8484` та :issue:`8321`.)

source: The :mod:`nntplib` module has a revamped implementation with better bytes and text semantics as well as more practical APIs. These improvements break compatibility with the nntplib version in Python 3.1, which was partly dysfunctional in itself.
uk: Модуль :mod:`nntplib` має оновлену реалізацію з кращими байтами та текстовою семантикою, а також більш практичними API. Ці вдосконалення порушують сумісність із версією nntplib у Python 3.1, яка сама по собі була частково нефункціональною.

source: Support for secure connections through both implicit (using :class:`nntplib.NNTP_SSL`) and explicit (using :meth:`nntplib.NNTP.starttls`) TLS has also been added.
uk: Також додано підтримку безпечних з’єднань через неявний (з використанням :class:`nntplib.NNTP_SSL`) і явний (з використанням :meth:`nntplib.NNTP.starttls`) TLS.

source: (Contributed by Antoine Pitrou in :issue:`9360` and Andrew Vant in :issue:`1926`.)
uk: (Надано Антуаном Пітру в :issue:`9360` та Ендрю Вантом у :issue:`1926`.)

source: certificates
uk: сертифікати
