Repository: python/python-docs-uk
Catalog: whatsnew/3.3.po
Languages: uk

source: What's New In Python 3.3
uk: Що нового в Python 3.3

source: This article explains the new features in Python 3.3, compared to 3.2. Python 3.3 was released on September 29, 2012. For full details, see the `changelog <https://docs.python.org/3.3/whatsnew/changelog.html>`_.
uk: У цій статті пояснюється нові функції в Python 3.3 порівняно з 3.2. Python 3.3 було випущено 29 вересня 2012 року. Щоб отримати повну інформацію, перегляньте `журнал змін <https://docs.python.org/3.3/whatsnew/changelog.html>`_.

source: :pep:`398` - Python 3.3 Release Schedule
uk: :pep:`398` - Графік випуску Python 3.3

source: Summary -- Release highlights
uk: Підсумок – основні моменти випуску

source: New syntax features:
uk: Нові функції синтаксису:

source: New ``yield from`` expression for :ref:`generator delegation <pep-380>`.
uk: Новий вираз ``yield from`` для :ref:`генератора делегування <pep-380>`.

source: The ``u'unicode'`` syntax is accepted again for :class:`str` objects.
uk: Синтаксис ``u'unicode'`` знову приймається для об'єктів :class:`str`.

source: New library modules:
uk: Нові бібліотечні модулі:

source: :mod:`faulthandler` (helps debugging low-level crashes)
uk: :mod:`faulthandler` (допомагає налагодити низькорівневі збої)

source: :mod:`ipaddress` (high-level objects representing IP addresses and masks)
uk: :mod:`ipaddress` (об'єкти високого рівня, що представляють IP-адреси та маски)

source: :mod:`lzma` (compress data using the XZ / LZMA algorithm)
uk: :mod:`lzma` (стиснення даних за допомогою алгоритму XZ / LZMA)

source: :mod:`unittest.mock` (replace parts of your system under test with mock objects)
uk: :mod:`unittest.mock` (замінити частини вашої тестованої системи на макетні об’єкти)

source: :mod:`venv` (Python :ref:`virtual environments <pep-405>`, as in the popular ``virtualenv`` package)
uk: :mod:`venv` (Python :ref:`віртуальні середовища <pep-405>`, як у популярному пакеті ``virtualenv``)

source: New built-in features:
uk: Нові вбудовані функції:

source: Reworked :ref:`I/O exception hierarchy <pep-3151>`.
uk: Перероблено :ref:`ієрархію винятків вводу/виводу <pep-3151>`.

source: Implementation improvements:
uk: Покращення реалізації:

source: Rewritten :ref:`import machinery <importlib>` based on :mod:`importlib`.
uk: Переписано :ref:`import machinery <importlib>` на основі :mod:`importlib`.

source: More compact :ref:`unicode strings <pep-393>`.
uk: Більш компактні :ref:`рядки Unicode <pep-393>`.

source: More compact :ref:`attribute dictionaries <pep-412>`.
uk: Більш компактні :ref:`словники атрибутів <pep-412>`.

source: Significantly Improved Library Modules:
uk: Значно вдосконалені бібліотечні модулі:

source: C Accelerator for the :ref:`decimal <new-decimal>` module.
uk: C Прискорювач для модуля :ref:`decimal <new-decimal>`.

source: Better unicode handling in the :ref:`email <new-email>` module (:term:`provisional <provisional package>`).
uk: Краще оброблення Юнікоду в модулі :ref:`email <new-email>` (:term:`provisional <provisional package>`).

source: Security improvements:
uk: Покращення безпеки:

source: Hash randomization is switched on by default.
uk: Хеш-рандомізація ввімкнена за замовчуванням.

source: Please read on for a comprehensive list of user-facing changes.
uk: Будь ласка, прочитайте повний список змін, які стосуються користувача.

source: PEP 405: Virtual Environments
uk: PEP 405: Віртуальні середовища

source: Virtual environments help create separate Python setups while sharing a system-wide base install, for ease of maintenance. Virtual environments have their own set of private site packages (i.e. locally-installed libraries), and are optionally segregated from the system-wide site packages. Their concept and implementation are inspired by the popular ``virtualenv`` third-party package, but benefit from tighter integration with the interpreter core.
uk: Віртуальні середовища допомагають створювати окремі налаштування Python, водночас спільно користуючись загальносистемною базовою інсталяцією для спрощення обслуговування. Віртуальні середовища мають власний набір приватних пакетів сайту (тобто локально встановлених бібліотек) і, за бажанням, відокремлюються від пакетів сайту для всієї системи. Їхня концепція та реалізація ґрунтуються на популярному сторонньому пакеті ``virtualenv``, але виграють від більш тісної інтеграції з ядром інтерпретатора.

source: This PEP adds the :mod:`venv` module for programmatic access, and the ``pyvenv`` script for command-line access and administration. The Python interpreter checks for a ``pyvenv.cfg``, file whose existence signals the base of a virtual environment's directory tree.
uk: Цей PEP додає модуль :mod:`venv` для програмного доступу та сценарій ``pyvenv`` для доступу до командного рядка та адміністрування. Інтерпретатор Python перевіряє наявність файла ``pyvenv.cfg``, існування якого сигналізує про основу дерева каталогів віртуального середовища.

source: :pep:`405` - Python Virtual Environments
uk: :pep:`405` - Віртуальні середовища Python

source: PEP written by Carl Meyer; implementation by Carl Meyer and Vinay Sajip
uk: PEP, написаний Карлом Майєром; реалізація Карла Мейєра та Віная Саджипа

source: PEP 420: Implicit Namespace Packages
uk: PEP 420: неявні пакети простору імен

source: Native support for package directories that don't require ``__init__.py`` marker files and can automatically span multiple path segments (inspired by various third party approaches to namespace packages, as described in :pep:`420`)
uk: Вбудована підтримка каталогів пакунків, які не потребують файлів маркерів ``__init__.py`` і можуть автоматично охоплювати кілька сегментів шляху (навіяні різними сторонніми підходами до пакетів простору імен, як описано в :pep:`420`)

source: :pep:`420` - Implicit Namespace Packages
uk: :pep:`420` - неявні пакети простору імен

source: PEP written by Eric V. Smith; implementation by Eric V. Smith and Barry Warsaw
uk: PEP, написаний Еріком В. Смітом; виконання Еріком В. Смітом і Баррі Варшау

source: PEP 3118: New memoryview implementation and buffer protocol documentation
uk: PEP 3118: Нова реалізація memoryview і документація протоколу буфера

source: The implementation of :pep:`3118` has been significantly improved.
uk: Реалізацію :pep:`3118` було значно покращено.

source: The new memoryview implementation comprehensively fixes all ownership and lifetime issues of dynamically allocated fields in the Py_buffer struct that led to multiple crash reports. Additionally, several functions that crashed or returned incorrect results for non-contiguous or multi-dimensional input have been fixed.
uk: Нова реалізація memoryview комплексно виправляє всі проблеми власності та терміну служби динамічно розподілених полів у структурі Py_buffer, які призвели до кількох звітів про збої. Крім того, було виправлено кілька функцій, які виходили з ладу або повертали неправильні результати для несуміжного або багатовимірного введення.

source: The memoryview object now has a PEP-3118 compliant getbufferproc() that checks the consumer's request type. Many new features have been added, most of them work in full generality for non-contiguous arrays and arrays with suboffsets.
uk: Об’єкт memoryview тепер має сумісний з PEP-3118 getbufferproc(), який перевіряє тип запиту споживача. Було додано багато нових функцій, більшість із яких працюють у повному обсязі для несуміжних масивів і масивів із підзсувами.

source: The documentation has been updated, clearly spelling out responsibilities for both exporters and consumers. Buffer request flags are grouped into basic and compound flags. The memory layout of non-contiguous and multi-dimensional NumPy-style arrays is explained.
uk: Документацію оновлено, чітко прописані обов’язки як експортерів, так і споживачів. Прапори запиту буфера згруповані в основні та складені прапори. Пояснюється розташування пам’яті несуміжних і багатовимірних масивів у стилі NumPy.

source: Features
uk: особливості

source: All native single character format specifiers in struct module syntax (optionally prefixed with '@') are now supported.
uk: Тепер підтримуються всі рідні специфікатори односимвольного формату в синтаксисі модуля struct (за бажанням із префіксом "@").

source: With some restrictions, the cast() method allows changing of format and shape of C-contiguous arrays.
uk: З деякими обмеженнями метод cast() дозволяє змінювати формат і форму C-суміжних масивів.

source: Multi-dimensional list representations are supported for any array type.
uk: Представлення багатовимірного списку підтримуються для будь-якого типу масиву.

source: Multi-dimensional comparisons are supported for any array type.
uk: Багатовимірні порівняння підтримуються для будь-якого типу масиву.

source: One-dimensional memoryviews of hashable (read-only) types with formats B, b or c are now hashable. (Contributed by Antoine Pitrou in :issue:`13411`.)
uk: Одновимірні представлення пам’яті хешованих типів (тільки для читання) з форматами B, b або c тепер хешуються. (Надав Антуан Пітру в :issue:`13411`.)

source: Arbitrary slicing of any 1-D arrays type is supported. For example, it is now possible to reverse a memoryview in O(1) by using a negative step.
uk: Підтримується довільне нарізання будь-яких типів 1-D масивів. Наприклад, тепер можна змінити відображення пам’яті в O(1) за допомогою негативного кроку.

source: API changes
uk: Зміни API

source: The maximum number of dimensions is officially limited to 64.
uk: Максимальна кількість вимірів офіційно обмежена 64.

source: The representation of empty shape, strides and suboffsets is now an empty tuple instead of ``None``.
uk: Представлення порожньої форми, кроків і підзсувів тепер є порожнім кортежем замість "Немає".

source: Accessing a memoryview element with format 'B' (unsigned bytes) now returns an integer (in accordance with the struct module syntax). For returning a bytes object the view must be cast to 'c' first.
uk: Доступ до елемента memoryview у форматі "B" (байти без знаку) тепер повертає ціле число (відповідно до синтаксису модуля struct). Для повернення об’єкта bytes спочатку має бути приведено до 'c'.

source: memoryview comparisons now use the logical structure of the operands and compare all array elements by value. All format strings in struct module syntax are supported. Views with unrecognised format strings are still permitted, but will always compare as unequal, regardless of view contents.
uk: Порівняння memoryview тепер використовує логічну структуру операндів і порівнює всі елементи масиву за значенням. Підтримуються всі рядки формату в синтаксисі модуля struct. Перегляди з нерозпізнаними рядками формату все ще дозволені, але завжди порівнюватимуться як нерівні, незалежно від вмісту подання.

source: For further changes see `Build and C API Changes`_ and `Porting C code`_.
uk: Щоб отримати додаткові зміни, перегляньте `Зміни в API збірки та C`_ і `Перенесення коду C`_.

source: (Contributed by Stefan Krah in :issue:`10181`.)
uk: (Надав Стефан Крах у :issue:`10181`.)

source: :pep:`3118` - Revising the Buffer Protocol
uk: :pep:`3118` - Перегляд буферного протоколу

source: PEP 393: Flexible String Representation
uk: PEP 393: Гнучке представлення рядків

source: The Unicode string type is changed to support multiple internal representations, depending on the character with the largest Unicode ordinal (1, 2, or 4 bytes) in the represented string. This allows a space-efficient representation in common cases, but gives access to full UCS-4 on all systems. For compatibility with existing APIs, several representations may exist in parallel; over time, this compatibility should be phased out.
uk: Тип рядка Unicode змінено для підтримки кількох внутрішніх представлень залежно від символу з найбільшим порядковим номером Unicode (1, 2 або 4 байти) у представленому рядку. Це забезпечує економічне представлення у звичайних випадках, але дає доступ до повного UCS-4 у всіх системах. Для сумісності з існуючими API кілька представлень можуть існувати паралельно; з часом ця сумісність має бути припинена.

source: On the Python side, there should be no downside to this change.
uk: З боку Python ця зміна не повинна мати ніяких недоліків.

source: On the C API side, :pep:`393` is fully backward compatible. The legacy API should remain available at least five years. Applications using the legacy API will not fully benefit of the memory reduction, or - worse - may use a bit more memory, because Python may have to maintain two versions of each string (in the legacy format and in the new efficient storage).
uk: З боку C API :pep:`393` повністю сумісний із попередніми версіями. Застарілий API має бути доступним щонайменше п’ять років. Програми, які використовують застарілий API, не отримають повної вигоди від зменшення обсягу пам’яті або, що ще гірше, можуть використовувати трохи більше пам’яті, оскільки Python, можливо, доведеться підтримувати дві версії кожного рядка (у застарілому форматі та в новому ефективному сховищі).

source: Functionality
uk: Функціональність

source: Changes introduced by :pep:`393` are the following:
uk: Зміни, внесені :pep:`393`:

source: Python now always supports the full range of Unicode code points, including non-BMP ones (i.e. from ``U+0000`` to ``U+10FFFF``). The distinction between narrow and wide builds no longer exists and Python now behaves like a wide build, even under Windows.
uk: Тепер Python завжди підтримує повний діапазон кодових точок Unicode, включно з кодами, що не є BMP (тобто від ``U+0000`` до ``U+10FFFF``). Різниця між вузькими та широкими збірками більше не існує, і Python тепер поводиться як широка збірка, навіть під Windows.

source: With the death of narrow builds, the problems specific to narrow builds have also been fixed, for example:
uk: Зі смертю вузьких збірок проблеми, характерні для вузьких збірок, також були виправлені, наприклад:

source: :func:`len` now always returns 1 for non-BMP characters, so ``len('\U0010FFFF') == 1``;
uk: :func:`len` тепер завжди повертає 1 для не-BMP символів, тому ``len('\U0010FFFF') == 1``;

source: surrogate pairs are not recombined in string literals, so ``'\uDBFF\uDFFF' != '\U0010FFFF'``;
uk: сурогатні пари не комбінуються повторно в рядкових літералах, тому ``'\uDBFF\uDFFF' != '\U0010FFFF'``;

source: indexing or slicing non-BMP characters returns the expected value, so ``'\U0010FFFF'[0]`` now returns ``'\U0010FFFF'`` and not ``'\uDBFF'``;
uk: індексація або нарізка символів, відмінних від BMP, повертає очікуване значення, тому ``'\U0010FFFF'[0]`` тепер повертає ``'\U0010FFFF'``, а не ``'\uDBFF'``;

source: all other functions in the standard library now correctly handle non-BMP code points.
uk: усі інші функції стандартної бібліотеки тепер правильно обробляють точки коду, відмінні від BMP.

source: The value of :data:`sys.maxunicode` is now always ``1114111`` (``0x10FFFF`` in hexadecimal). The :c:func:`PyUnicode_GetMax` function still returns either ``0xFFFF`` or ``0x10FFFF`` for backward compatibility, and it should not be used with the new Unicode API (see :issue:`13054`).
uk: Значення :data:`sys.maxunicode` тепер завжди ``1114111`` (``0x10FFFF`` у шістнадцятковій системі). Функція :c:func:`PyUnicode_GetMax` усе ще повертає або ``0xFFFF``, або ``0x10FFFF`` для зворотної сумісності, і її не слід використовувати з новим API Unicode (див. :issue:`13054`).

source: The :file:`./configure` flag ``--with-wide-unicode`` has been removed.
uk: Прапорець ``--with-wide-unicode`` у :file:`./configure` видалено.

source: Performance and resource usage
uk: Продуктивність і використання ресурсів

source: The storage of Unicode strings now depends on the highest code point in the string:
uk: Зберігання рядків Unicode тепер залежить від найвищої кодової точки в рядку:

source: pure ASCII and Latin1 strings (``U+0000-U+00FF``) use 1 byte per code point;
uk: чисті рядки ASCII і Latin1 (``U+0000-U+00FF``) використовують 1 байт на кодову точку;

source: BMP strings (``U+0000-U+FFFF``) use 2 bytes per code point;
uk: Рядки BMP (``U+0000-U+FFFF``) використовують 2 байти на кодову точку;

source: non-BMP strings (``U+10000-U+10FFFF``) use 4 bytes per code point.
uk: не-BMP-рядки (``U+10000-U+10FFFF``) використовують 4 байти на кодову точку.

source: The net effect is that for most applications, memory usage of string storage should decrease significantly - especially compared to former wide unicode builds - as, in many cases, strings will be pure ASCII even in international contexts (because many strings store non-human language data, such as XML fragments, HTTP headers, JSON-encoded data, etc.). We also hope that it will, for the same reasons, increase CPU cache efficiency on non-trivial applications. The memory usage of Python 3.3 is two to three times smaller than Python 3.2, and a little bit better than Python 2.7, on a Django benchmark (see the PEP for details).
uk: Чистий ефект полягає в тому, що для більшості програм використання пам’яті для зберігання рядків має значно зменшитися – особливо порівняно з колишніми широкими збірками Unicode – оскільки в багатьох випадках рядки будуть чистим ASCII навіть у міжнародних контекстах (оскільки багато рядків зберігають нелюдську мову дані, наприклад фрагменти XML, заголовки HTTP, дані в кодуванні JSON тощо). Ми також сподіваємося, що це з тих самих причин підвищить ефективність кешу ЦП у нетривіальних програмах. Використання пам’яті Python 3.3 у два-три рази менше, ніж Python 3.2, і трохи краще, ніж Python 2.7, за порівняльним тестом Django (докладніше див. у PEP).

source: :pep:`393` - Flexible String Representation
uk: :pep:`393` - Гнучке представлення рядків

source: PEP written by Martin von Löwis; implementation by Torsten Becker and Martin von Löwis.
uk: PEP, написаний Мартіном фон Льовісом; виконання Торстеном Беккером і Мартіном фон Льовісом.

source: PEP 397: Python Launcher for Windows
uk: PEP 397: програма запуску Python для Windows

source: The Python 3.3 Windows installer now includes a ``py`` launcher application that can be used to launch Python applications in a version independent fashion.
uk: Інсталятор Python 3.3 Windows тепер містить програму запуску ``py``, яку можна використовувати для запуску програм Python незалежно від версії.

source: This launcher is invoked implicitly when double-clicking ``*.py`` files. If only a single Python version is installed on the system, that version will be used to run the file. If multiple versions are installed, the most recent version is used by default, but this can be overridden by including a Unix-style "shebang line" in the Python script.
uk: Цей засіб запуску неявно викликається під час подвійного клацання файлів ``*.py``. Якщо в системі встановлено лише одну версію Python, для запуску файлу використовуватиметься ця версія. Якщо встановлено декілька версій, за замовчуванням використовується найновіша версія, але це можна замінити, включивши в сценарій Python рядок shebang у стилі Unix.

source: The launcher can also be used explicitly from the command line as the ``py`` application. Running ``py`` follows the same version selection rules as implicitly launching scripts, but a more specific version can be selected by passing appropriate arguments (such as ``-3`` to request Python 3 when Python 2 is also installed, or ``-2.6`` to specifically request an earlier Python version when a more recent version is installed).
uk: Засіб запуску також можна використовувати явно з командного рядка як програму ``py``. Запуск ``py`` дотримується тих самих правил вибору версії, що й неявний запуск сценаріїв, але більш конкретну версію можна вибрати шляхом передачі відповідних аргументів (наприклад, ``-3`` для запиту Python 3, коли Python 2 також встановлено, або ``-2.6`` для спеціального запиту попередньої версії Python, коли встановлено новішу версію).

source: In addition to the launcher, the Windows installer now includes an option to add the newly installed Python to the system PATH. (Contributed by Brian Curtin in :issue:`3561`.)
uk: Окрім засобу запуску, інсталятор Windows тепер містить опцію додавання щойно встановленого Python до системного ШЛЯХУ. (Надав Браян Кертін у :issue:`3561`.)

source: :pep:`397` - Python Launcher for Windows
uk: :pep:`397` - програма запуску Python для Windows

source: PEP written by Mark Hammond and Martin v. Löwis; implementation by Vinay Sajip.
uk: PEP, написаний Марком Хаммондом і Мартіном проти Льовіса; виконання Вінай Саджип.

source: Launcher documentation: :ref:`launcher`
uk: Документація програми запуску: :ref:`launcher`

source: Installer PATH modification: :ref:`windows-path-mod`
uk: Модифікація PATH інсталятора: :ref:`windows-path-mod`

source: PEP 3151: Reworking the OS and IO exception hierarchy
uk: PEP 3151: переробка ієрархії винятків ОС та вводу-виводу

source: The hierarchy of exceptions raised by operating system errors is now both simplified and finer-grained.
uk: Ієрархія винятків, викликаних помилками операційної системи, тепер є спрощеною та детальнішою.

source: You don't have to worry anymore about choosing the appropriate exception type between :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`mmap.error`, :exc:`socket.error` or :exc:`select.error`. All these exception types are now only one: :exc:`OSError`. The other names are kept as aliases for compatibility reasons.
uk: Вам більше не потрібно турбуватися про вибір відповідного типу винятку між :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`mmap.error`, :exc:`socket.error` або :exc:`select.error`. Усі типи винятків тепер лише один: :exc:`OSError`. Інші імена зберігаються як псевдоніми з міркувань сумісності.

source: Also, it is now easier to catch a specific error condition. Instead of inspecting the ``errno`` attribute (or ``args[0]``) for a particular constant from the :mod:`errno` module, you can catch the adequate :exc:`OSError` subclass. The available subclasses are the following:
uk: Крім того, тепер простіше виявити конкретну умову помилки. Замість того, щоб перевіряти атрибут ``errno`` (або ``args[0]``) для певної константи з модуля :mod:`errno`, ви можете зловити відповідний підклас :exc:`OSError`. Доступні наступні підкласи:

source: And the :exc:`ConnectionError` itself has finer-grained subclasses:
uk: А сам :exc:`ConnectionError` має більш детальні підкласи:

source: :exc:`BrokenPipeError`
uk: :exc:`Помилка BrokenPipeError`

source: Thanks to the new exceptions, common usages of the :mod:`errno` can now be avoided. For example, the following code written for Python 3.2::
uk: Завдяки новим виняткам тепер можна уникнути звичайного використання :mod:`errno`. Наприклад, наступний код, написаний для Python 3.2::

source: can now be written without the :mod:`errno` import and without manual inspection of exception attributes::
uk: тепер можна записати без імпорту :mod:`errno` і без ручної перевірки атрибутів винятків:

source: :pep:`3151` - Reworking the OS and IO Exception Hierarchy
uk: :pep:`3151` - Переробка ієрархії винятків ОС та вводу-виводу

source: PEP written and implemented by Antoine Pitrou
uk: PEP написаний і реалізований Антуаном Пітру

source: PEP 380: Syntax for Delegating to a Subgenerator
uk: PEP 380: Синтаксис для делегування субгенератору
