Repository: python/python-docs-uk
Catalog: whatsnew/3.3.po
Languages: uk

source: The ``rjust()``, ``ljust()``, and ``center()`` methods of :class:`bytes` and :class:`bytearray` now accept a :class:`bytearray` for the ``fill`` argument. (Contributed by Petri Lehtinen in :issue:`12380`.)
uk: Методи ``rjust()``, ``ljust()`` і ``center()`` :class:`bytes` і :class:`bytearray` тепер приймають :class:`bytearray` для аргумент ``fill``. (Надав Петрі Лехтінен у :issue:`12380`.)

source: New methods have been added to :class:`list` and :class:`bytearray`: ``copy()`` and ``clear()`` (:issue:`10516`). Consequently, :class:`~collections.abc.MutableSequence` now also defines a :meth:`~collections.abc.MutableSequence.clear` method (:issue:`11388`).
uk: До :class:`list` і :class:`bytearray` додано нові методи: ``copy()`` і ``clear()`` (:issue:`10516`). Отже, :class:`~collections.abc.MutableSequence` тепер також визначає метод :meth:`~collections.abc.MutableSequence.clear` (:issue:`11388`).

source: Raw bytes literals can now be written ``rb"..."`` as well as ``br"..."``.
uk: Необроблені байтові літерали тепер можна записати ``rb"..."``, а також ``br"..."``.

source: (Contributed by Antoine Pitrou in :issue:`13748`.)
uk: (Надав Антуан Пітру в :issue:`13748`.)

source: :meth:`dict.setdefault` now does only one lookup for the given key, making it atomic when used with built-in types.
uk: :meth:`dict.setdefault` тепер виконує лише один пошук для даного ключа, що робить його атомарним при використанні з вбудованими типами.

source: (Contributed by Filip Gruszczyński in :issue:`13521`.)
uk: (Надав Філіп Грущинський у :issue:`13521`.)

source: The error messages produced when a function call does not match the function signature have been significantly improved.
uk: Повідомлення про помилки, які видаються, коли виклик функції не відповідає сигнатурі функції, було значно покращено.

source: (Contributed by Benjamin Peterson.)
uk: (Надав Бенджамін Петерсон.)

source: A Finer-Grained Import Lock
uk: Точне блокування імпорту

source: Previous versions of CPython have always relied on a global import lock. This led to unexpected annoyances, such as deadlocks when importing a module would trigger code execution in a different thread as a side-effect. Clumsy workarounds were sometimes employed, such as the :c:func:`PyImport_ImportModuleNoBlock` C API function.
uk: Попередні версії CPython завжди покладалися на глобальне блокування імпорту. Це призвело до неочікуваних проблем, наприклад, взаємоблокування під час імпортування модуля викликало б виконання коду в іншому потоці як побічний ефект. Інколи використовувалися незграбні обхідні шляхи, наприклад функція C API :c:func:`PyImport_ImportModuleNoBlock`.

source: In Python 3.3, importing a module takes a per-module lock. This correctly serializes importation of a given module from multiple threads (preventing the exposure of incompletely initialized modules), while eliminating the aforementioned annoyances.
uk: У Python 3.3 імпортування модуля потребує блокування кожного модуля. Це правильно серіалізує імпорт певного модуля з кількох потоків (запобігаючи виявленню неповністю ініціалізованих модулів), одночасно усуваючи вищезгадані незручності.

source: (Contributed by Antoine Pitrou in :issue:`9260`.)
uk: (Надав Антуан Пітру в :issue:`9260`.)

source: Builtin functions and types
uk: Вбудовані функції та типи

source: :func:`open` gets a new *opener* parameter: the underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). It can be used to use custom flags like :data:`os.O_CLOEXEC` for example. The ``'x'`` mode was added: open for exclusive creation, failing if the file already exists.
uk: :func:`open` отримує новий параметр *opener*: базовий файловий дескриптор для об’єкта файлу отримується шляхом виклику *opener* за допомогою (*file*, *flags*). Його можна використовувати, наприклад, для використання спеціальних прапорів, таких як :data:`os.O_CLOEXEC`. Додано режим ``'x``: відкритий для ексклюзивного створення, не вдається, якщо файл уже існує.

source: :func:`print`: added the *flush* keyword argument. If the *flush* keyword argument is true, the stream is forcibly flushed.
uk: :func:`print`: додано аргумент ключового слова *flush*. Якщо аргумент ключового слова *flush* має значення true, потік примусово очищається.

source: :func:`hash`: hash randomization is enabled by default, see :meth:`object.__hash__` and :envvar:`PYTHONHASHSEED`.
uk: :func:`hash`: рандомізація хешу ввімкнена за замовчуванням, див. :meth:`object.__hash__` і :envvar:`PYTHONHASHSEED`.

source: The :class:`str` type gets a new :meth:`~str.casefold` method: return a casefolded copy of the string, casefolded strings may be used for caseless matching. For example, ``'ß'.casefold()`` returns ``'ss'``.
uk: Тип :class:`str` отримує новий метод :meth:`~str.casefold`: повертає згорнуту копію рядка, згорнуті рядки можна використовувати для зіставлення без регістру. Наприклад, ``'ß'.casefold()`` повертає ``'ss'``.

source: The sequence documentation has been substantially rewritten to better explain the binary/text sequence distinction and to provide specific documentation sections for the individual builtin sequence types (:issue:`4966`).
uk: Документацію послідовності було суттєво переписано, щоб краще пояснити різницю між двійковою та текстовою послідовністю та надати окремі розділи документації для окремих вбудованих типів послідовностей (:issue:`4966`).

source: New Modules
uk: Нові модулі

source: faulthandler
uk: обробник помилок

source: This new debug module :mod:`faulthandler` contains functions to dump Python tracebacks explicitly, on a fault (a crash like a segmentation fault), after a timeout, or on a user signal. Call :func:`faulthandler.enable` to install fault handlers for the :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS`, and :const:`SIGILL` signals. You can also enable them at startup by setting the :envvar:`PYTHONFAULTHANDLER` environment variable or by using :option:`-X` ``faulthandler`` command line option.
uk: Цей новий модуль налагодження :mod:`faulthandler` містить функції для явного створення дампу трасування Python у разі помилки (збій, як помилка сегментації), після тайм-ауту або за сигналом користувача. Викличте :func:`faulthandler.enable`, щоб установити обробники помилок для :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` і :const:`SIGILL` сигнали. Ви також можете ввімкнути їх під час запуску, встановивши змінну середовища :envvar:`PYTHONFAULTHANDLER` або використовуючи параметр командного рядка :option:`-X` ``faulthandler``.

source: Example of a segmentation fault on Linux:
uk: Приклад помилки сегментації в Linux:

source: ipaddress
uk: IP-адреса

source: The new :mod:`ipaddress` module provides tools for creating and manipulating objects representing IPv4 and IPv6 addresses, networks and interfaces (i.e. an IP address associated with a specific IP subnet).
uk: Новий модуль :mod:`ipaddress` надає інструменти для створення та керування об’єктами, що представляють адреси IPv4 та IPv6, мережі та інтерфейси (тобто IP-адресу, пов’язану з певною підмережею IP).

source: (Contributed by Google and Peter Moody in :pep:`3144`.)
uk: (Надано Google і Пітером Муді в :pep:`3144`.)

source: The newly-added :mod:`lzma` module provides data compression and decompression using the LZMA algorithm, including support for the ``.xz`` and ``.lzma`` file formats.
uk: Нещодавно доданий модуль :mod:`lzma` забезпечує стиснення та розпакування даних за допомогою алгоритму LZMA, включаючи підтримку форматів файлів ``.xz`` і ``.lzma``.

source: (Contributed by Nadeem Vawda and Per Øyvind Karlsen in :issue:`6715`.)
uk: (Надім Вавда та Пер Ойвінд Карлсен у :issue:`6715`.)

source: Improved Modules
uk: Покращені модулі

source: abc
uk: абв

source: Improved support for abstract base classes containing descriptors composed with abstract methods. The recommended approach to declaring abstract descriptors is now to provide :attr:`__isabstractmethod__` as a dynamically updated property. The built-in descriptors have been updated accordingly.
uk: Покращена підтримка абстрактних базових класів, що містять дескриптори, складені за допомогою абстрактних методів. Рекомендованим підходом до оголошення абстрактних дескрипторів тепер є надання :attr:`__isabstractmethod__` як динамічно оновлюваної властивості. Вбудовані дескриптори були відповідно оновлені.

source: :class:`abc.abstractproperty` has been deprecated, use :class:`property` with :func:`abc.abstractmethod` instead.
uk: :class:`abc.abstractproperty` застаріло, замість цього використовуйте :class:`property` з :func:`abc.abstractmethod`.

source: :class:`abc.abstractclassmethod` has been deprecated, use :class:`classmethod` with :func:`abc.abstractmethod` instead.
uk: :class:`abc.abstractclassmethod` застаріло, замість нього використовуйте :class:`classmethod` з :func:`abc.abstractmethod`.

source: :class:`abc.abstractstaticmethod` has been deprecated, use :class:`staticmethod` with :func:`abc.abstractmethod` instead.
uk: :class:`abc.abstractstaticmethod` застарів, замість нього використовуйте :class:`staticmethod` з :func:`abc.abstractmethod`.

source: (Contributed by Darren Dale in :issue:`11610`.)
uk: (Надав Даррен Дейл у :issue:`11610`.)

source: :meth:`abc.ABCMeta.register` now returns the registered subclass, which means it can now be used as a class decorator (:issue:`10868`).
uk: :meth:`abc.ABCMeta.register` тепер повертає зареєстрований підклас, що означає, що тепер його можна використовувати як декоратор класу (:issue:`10868`).

source: array
uk: масив

source: The :mod:`array` module supports the :c:type:`long long` type using ``q`` and ``Q`` type codes.
uk: Модуль :mod:`array` підтримує тип :c:type:`long long` за допомогою кодів типу ``q`` і ``Q``.

source: (Contributed by Oren Tirosh and Hirokazu Yamamoto in :issue:`1172711`.)
uk: (Надано Ореном Тірошем і Хірокадзу Ямамото в :issue:`1172711`.)

source: base64
uk: база64

source: ASCII-only Unicode strings are now accepted by the decoding functions of the :mod:`base64` modern interface. For example, ``base64.b64decode('YWJj')`` returns ``b'abc'``. (Contributed by Catalin Iacob in :issue:`13641`.)
uk: Функції декодування сучасного інтерфейсу :mod:`base64` тепер приймають рядки Unicode лише для ASCII. Наприклад, ``base64.b64decode('YWJj')`` повертає ``b'abc``. (Надав Каталін Якоб у :issue:`13641`.)

source: In addition to the binary objects they normally accept, the ``a2b_`` functions now all also accept ASCII-only strings as input. (Contributed by Antoine Pitrou in :issue:`13637`.)
uk: На додаток до двійкових об’єктів, які вони зазвичай приймають, усі функції ``a2b_`` тепер також приймають як вхідні рядки лише ASCII. (Надав Антуан Пітру в :issue:`13637`.)

source: The :mod:`bz2` module has been rewritten from scratch. In the process, several new features have been added:
uk: Модуль :mod:`bz2` було переписано з нуля. У процесі було додано кілька нових функцій:

source: New :func:`bz2.open` function: open a bzip2-compressed file in binary or text mode.
uk: Нова функція :func:`bz2.open`: відкриває файл, стиснутий за допомогою bzip2, у двійковому або текстовому режимі.

source: :class:`bz2.BZ2File` can now read from and write to arbitrary file-like objects, by means of its constructor's *fileobj* argument.
uk: :class:`bz2.BZ2File` тепер може читати та записувати довільні файлоподібні об’єкти за допомогою аргументу *fileobj* свого конструктора.

source: (Contributed by Nadeem Vawda in :issue:`5863`.)
uk: (Надім Вавда в :issue:`5863`.)

source: :class:`bz2.BZ2File` and :func:`bz2.decompress` can now decompress multi-stream inputs (such as those produced by the :program:`pbzip2` tool). :class:`bz2.BZ2File` can now also be used to create this type of file, using the ``'a'`` (append) mode.
uk: :class:`bz2.BZ2File` і :func:`bz2.decompress` тепер можуть розпакувати багатопотокові вхідні дані (наприклад, створені інструментом :program:`pbzip2`). :class:`bz2.BZ2File` тепер також можна використовувати для створення цього типу файлу, використовуючи режим ``'a'`` (додавання).

source: (Contributed by Nir Aides in :issue:`1625`.)
uk: (Надано Nir Aides у :issue:`1625`.)

source: :class:`bz2.BZ2File` now implements all of the :class:`io.BufferedIOBase` API, except for the :meth:`detach` and :meth:`truncate` methods.
uk: :class:`bz2.BZ2File` тепер реалізує всі API :class:`io.BufferedIOBase`, крім методів :meth:`detach` і :meth:`truncate`.

source: codecs
uk: кодеки

source: The :mod:`~encodings.mbcs` codec has been rewritten to handle correctly ``replace`` and ``ignore`` error handlers on all Windows versions. The :mod:`~encodings.mbcs` codec now supports all error handlers, instead of only ``replace`` to encode and ``ignore`` to decode.
uk: Кодек :mod:`~encodings.mbcs` було переписано для правильної обробки обробників помилок ``replace`` та ``ignore`` у всіх версіях Windows. Кодек :mod:`~encodings.mbcs` тепер підтримує всі обробники помилок, замість лише ``replace`` для кодування та ``ignore`` для декодування.

source: A new Windows-only codec has been added: ``cp65001`` (:issue:`13216`). It is the Windows code page 65001 (Windows UTF-8, ``CP_UTF8``). For example, it is used by ``sys.stdout`` if the console output code page is set to cp65001 (e.g., using ``chcp 65001`` command).
uk: Додано новий кодек лише для Windows: ``cp65001`` (:issue:`13216`). Це кодова сторінка Windows 65001 (Windows UTF-8, ``CP_UTF8``). Наприклад, він використовується ``sys.stdout``, якщо для кодової сторінки консолі встановлено значення cp65001 (наприклад, за допомогою команди ``chcp 65001``).

source: Multibyte CJK decoders now resynchronize faster. They only ignore the first byte of an invalid byte sequence. For example, ``b'\xff\n'.decode('gb2312', 'replace')`` now returns a ``\n`` after the replacement character.
uk: Багатобайтові декодери CJK тепер повторно синхронізуються швидше. Вони ігнорують лише перший байт недійсної послідовності байтів. Наприклад, ``b'\xff\n'.decode('gb2312', 'replace')`` тепер повертає ``\n`` після символу заміни.

source: Incremental CJK codec encoders are no longer reset at each call to their encode() methods. For example::
uk: Інкрементні кодеки CJK більше не скидаються під час кожного виклику методів encode(). Наприклад::

source: This example gives ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` with older Python versions.
uk: Цей приклад дає ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} До побачення.''`` зі старішими версіями Python.

source: The ``unicode_internal`` codec has been deprecated.
uk: Кодек ``unicode_internal`` застарів.

source: collections
uk: колекції

source: Addition of a new :class:`~collections.ChainMap` class to allow treating a number of mappings as a single unit. (Written by Raymond Hettinger for :issue:`11089`, made public in :issue:`11297`.)
uk: Додано новий клас :class:`~collections.ChainMap`, щоб дозволити обробляти кілька відображень як єдине ціле. (Написано Реймондом Геттінгером для :issue:`11089`, оприлюднено в :issue:`11297`.)

source: The abstract base classes have been moved in a new :mod:`collections.abc` module, to better differentiate between the abstract and the concrete collections classes. Aliases for ABCs are still present in the :mod:`collections` module to preserve existing imports. (:issue:`11085`)
uk: Базові абстрактні класи переміщено в новий модуль :mod:`collections.abc`, щоб краще розрізняти абстрактні та конкретні класи колекцій. Псевдоніми для ABC все ще присутні в модулі :mod:`collections`, щоб зберегти існуючий імпорт. (:issue:`11085`)

source: The :class:`~collections.Counter` class now supports the unary ``+`` and ``-`` operators, as well as the in-place operators ``+=``, ``-=``, ``|=``, and ``&=``. (Contributed by Raymond Hettinger in :issue:`13121`.)
uk: Клас :class:`~collections.Counter` тепер підтримує унарні оператори ``+`` і ``-``, а також оператори на місці ``+=``, ``-=``, ``|=`` і ``&=``. (Надав Раймонд Геттінгер у :issue:`13121`.)

source: :class:`~contextlib.ExitStack` now provides a solid foundation for programmatic manipulation of context managers and similar cleanup functionality. Unlike the previous ``contextlib.nested`` API (which was deprecated and removed), the new API is designed to work correctly regardless of whether context managers acquire their resources in their ``__init__`` method (for example, file objects) or in their ``__enter__`` method (for example, synchronisation objects from the :mod:`threading` module).
uk: :class:`~contextlib.ExitStack` тепер забезпечує міцну основу для програмного маніпулювання менеджерами контексту та подібними функціями очищення. На відміну від попереднього API ``contextlib.nested`` (який був застарілим і видалений), новий API розроблено для правильної роботи незалежно від того, чи менеджери контексту отримують свої ресурси в своєму методі ``__init__`` (наприклад, файлові об’єкти). або в їх методі ``__enter__`` (наприклад, об’єкти синхронізації з модуля :mod:`threading`).

source: crypt
uk: склеп

source: Addition of salt and modular crypt format (hashing method) and the :func:`~crypt.mksalt` function to the :mod:`crypt` module.
uk: Додано сіль і модульний формат крипти (метод хешування) і функцію :func:`~crypt.mksalt` до модуля :mod:`crypt`.

source: curses
uk: прокльони

source: If the :mod:`curses` module is linked to the ncursesw library, use Unicode functions when Unicode strings or characters are passed (e.g. :c:func:`waddwstr`), and bytes functions otherwise (e.g. :c:func:`waddstr`).
uk: Якщо модуль :mod:`curses` пов’язано з бібліотекою ncursesw, використовуйте функції Unicode, коли передаються рядки або символи Unicode (наприклад, :c:func:`waddwstr`), і функції bytes в іншому випадку (наприклад, :c:func:`waddstr`).

source: Use the locale encoding instead of ``utf-8`` to encode Unicode strings.
uk: Використовуйте кодування мови замість ``utf-8`` для кодування рядків Unicode.

source: :class:`curses.window` has a new :attr:`curses.window.encoding` attribute.
uk: :class:`curses.window` має новий атрибут :attr:`curses.window.encoding`.

source: The :class:`curses.window` class has a new :meth:`~curses.window.get_wch` method to get a wide character
uk: Клас :class:`curses.window` має новий метод :meth:`~curses.window.get_wch` для отримання широкого символу

source: The :mod:`curses` module has a new :meth:`~curses.unget_wch` function to push a wide character so the next :meth:`~curses.window.get_wch` will return it
uk: Модуль :mod:`curses` має нову функцію :meth:`~curses.unget_wch`, яка надсилає широкий символ, щоб наступний :meth:`~curses.window.get_wch` повертав його

source: (Contributed by Iñigo Serna in :issue:`6755`.)
uk: (Надав Іньїго Серна в :issue:`6755`.)

source: datetime
uk: дата, час

source: Equality comparisons between naive and aware :class:`~datetime.datetime` instances now return :const:`False` instead of raising :exc:`TypeError` (:issue:`15006`).
uk: Порівняння рівності між простими та обізнаними екземплярами :class:`~datetime.datetime` тепер повертає :const:`False` замість того, щоб викликати :exc:`TypeError` (:issue:`15006`).

source: New :meth:`datetime.datetime.timestamp` method: Return POSIX timestamp corresponding to the :class:`~datetime.datetime` instance.
uk: Новий метод :meth:`datetime.datetime.timestamp`: повертає позначку часу POSIX, що відповідає екземпляру :class:`~datetime.datetime`.

source: The :meth:`datetime.datetime.strftime` method supports formatting years older than 1000.
uk: Метод :meth:`datetime.datetime.strftime` підтримує форматування років старше 1000.

source: The :meth:`datetime.datetime.astimezone` method can now be called without arguments to convert datetime instance to the system timezone.
uk: Метод :meth:`datetime.datetime.astimezone` тепер можна викликати без аргументів для перетворення екземпляра datetime у системний часовий пояс.

source: decimal
uk: десятковий

source: :issue:`7652` - integrate fast native decimal arithmetic.
uk: :issue:`7652` - інтегрувати швидку власну десяткову арифметику.

source: C-module and libmpdec written by Stefan Krah.
uk: C-module і libmpdec, написані Stefan Krah.

source: The new C version of the decimal module integrates the high speed libmpdec library for arbitrary precision correctly-rounded decimal floating point arithmetic. libmpdec conforms to IBM's General Decimal Arithmetic Specification.
uk: Нова версія десяткового модуля C інтегрує високошвидкісну бібліотеку libmpdec для правильно округленої десяткової арифметики з плаваючою комою довільної точності. libmpdec відповідає Загальній специфікації десяткової арифметики IBM.

source: Performance gains range from 10x for database applications to 100x for numerically intensive applications. These numbers are expected gains for standard precisions used in decimal floating point arithmetic. Since the precision is user configurable, the exact figures may vary. For example, in integer bignum arithmetic the differences can be significantly higher.
uk: Підвищення продуктивності коливається від 10 разів для додатків баз даних до 100 разів для інтенсивних програм. Ці числа є очікуваними приростами для стандартної точності, яка використовується в десятковій арифметиці з плаваючою комою. Оскільки точність налаштовується користувачем, точні цифри можуть відрізнятися. Наприклад, у цілочисельній арифметиці bignum відмінності можуть бути значно вищими.

source: The following table is meant as an illustration. Benchmarks are available at http://www.bytereef.org/mpdecimal/quickstart.html.
uk: Наступна таблиця призначена для ілюстрації. Еталонні показники доступні за адресою http://www.bytereef.org/mpdecimal/quickstart.html.

source: _decimal
uk: _десятковий

source: speedup
uk: прискорювати

source: pi
uk: пі

source: 42.02s
uk: 42,02с

source: 0.345s
uk: 0,345с

source: telco
uk: телекомунікаційна компанія

source: 172.19s
uk: 172,19с

source: 5.68s
uk: 5,68с

source: 3.57s
uk: 3,57с

source: 0.29s
uk: 0,29 с

source: The :exc:`~decimal.FloatOperation` signal optionally enables stricter semantics for mixing floats and Decimals.
uk: Сигнал :exc:`~decimal.FloatOperation` додатково вмикає суворішу семантику для змішування чисел з плаваючою точкою та десяткових знаків.

source: If Python is compiled without threads, the C version automatically disables the expensive thread local context machinery. In this case, the variable :data:`~decimal.HAVE_THREADS` is set to ``False``.
uk: Якщо Python скомпільовано без потоків, версія C автоматично вимикає дорогий механізм локального контексту потоків. У цьому випадку змінна :data:`~decimal.HAVE_THREADS` має значення ``False``.

source: The C module has the following context limits, depending on the machine architecture:
uk: Модуль C має такі контекстні обмеження, залежно від архітектури машини:

source: 32-bit
uk: 32-розрядний

source: 64-bit
uk: 64-розрядний

source: In the context templates (:class:`~decimal.DefaultContext`, :class:`~decimal.BasicContext` and :class:`~decimal.ExtendedContext`) the magnitude of :attr:`~decimal.Context.Emax` and :attr:`~decimal.Context.Emin` has changed to :const:`999999`.
uk: У шаблонах контексту (:class:`~decimal.DefaultContext`, :class:`~decimal.BasicContext` і :class:`~decimal.ExtendedContext`) величина :attr:`~decimal.Context.Emax` і :attr:`~decimal.Context.Emin` змінено на :const:`999999`.
