Repository: python/python-docs-uk
Catalog: whatsnew/3.3.po
Languages: uk

source: The :class:`~decimal.Decimal` constructor in decimal.py does not observe the context limits and converts values with arbitrary exponents or precision exactly. Since the C version has internal limits, the following scheme is used: If possible, values are converted exactly, otherwise :exc:`~decimal.InvalidOperation` is raised and the result is NaN. In the latter case it is always possible to use :meth:`~decimal.Context.create_decimal` in order to obtain a rounded or inexact value.
uk: Конструктор :class:`~decimal.Decimal` у decimal.py не дотримується контекстних обмежень і точно перетворює значення з довільним показником ступеня чи точністю. Оскільки версія C має внутрішні обмеження, використовується така схема: якщо можливо, значення перетворюються точно, інакше :exc:`~decimal.InvalidOperation` викликається, і результатом є NaN. В останньому випадку завжди можна використовувати :meth:`~decimal.Context.create_decimal`, щоб отримати округлене або неточне значення.

source: The power function in decimal.py is always correctly-rounded. In the C version, it is defined in terms of the correctly-rounded :meth:`~decimal.Decimal.exp` and :meth:`~decimal.Decimal.ln` functions, but the final result is only "almost always correctly rounded".
uk: Степенева функція decimal.py завжди округлюється правильно. У версії C це визначено в термінах правильно округлених функцій :meth:`~decimal.Decimal.exp` і :meth:`~decimal.Decimal.ln`, але кінцевий результат лише "майже завжди правильний". округлий".

source: In the C version, the context dictionary containing the signals is a :class:`~collections.abc.MutableMapping`. For speed reasons, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` always refer to the same :class:`~collections.abc.MutableMapping` that the context was initialized with. If a new signal dictionary is assigned, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` are updated with the new values, but they do not reference the RHS dictionary.
uk: У версії C контекстний словник, що містить сигнали, є :class:`~collections.abc.MutableMapping`. З міркувань швидкості :attr:`~decimal.Context.flags` і :attr:`~decimal.Context.traps` завжди посилаються на той самий :class:`~collections.abc.MutableMapping`, яким було ініціалізовано контекст. Якщо призначено новий словник сигналів, :attr:`~decimal.Context.flags` і :attr:`~decimal.Context.traps` оновлюються новими значеннями, але вони не посилаються на словник RHS.

source: Pickling a :class:`~decimal.Context` produces a different output in order to have a common interchange format for the Python and C versions.
uk: Видалення :class:`~decimal.Context` створює інший вихід, щоб мати загальний формат обміну для версій Python і C.

source: The order of arguments in the :class:`~decimal.Context` constructor has been changed to match the order displayed by :func:`repr`.
uk: Порядок аргументів у конструкторі :class:`~decimal.Context` змінено відповідно до порядку, який відображає :func:`repr`.

source: The ``watchexp`` parameter in the :meth:`~decimal.Decimal.quantize` method is deprecated.
uk: Параметр ``watchexp`` у методі :meth:`~decimal.Decimal.quantize` застарів.

source: email
uk: електронною поштою

source: Policy Framework
uk: Рамкова політика

source: The email package now has a :mod:`~email.policy` framework. A :class:`~email.policy.Policy` is an object with several methods and properties that control how the email package behaves. The primary policy for Python 3.3 is the :class:`~email.policy.Compat32` policy, which provides backward compatibility with the email package in Python 3.2. A ``policy`` can be specified when an email message is parsed by a :mod:`~email.parser`, or when a :class:`~email.message.Message` object is created, or when an email is serialized using a :mod:`~email.generator`. Unless overridden, a policy passed to a ``parser`` is inherited by all the ``Message`` object and sub-objects created by the ``parser``. By default a ``generator`` will use the policy of the ``Message`` object it is serializing. The default policy is :data:`~email.policy.compat32`.
uk: Пакет електронної пошти тепер має структуру :mod:`~email.policy`. :class:`~email.policy.Policy` — це об’єкт із кількома методами та властивостями, які контролюють поведінку пакета електронної пошти. Основною політикою для Python 3.3 є політика :class:`~email.policy.Compat32`, яка забезпечує зворотну сумісність із пакетом електронної пошти в Python 3.2. ``Політику`` можна вказати, коли повідомлення електронної пошти аналізується :mod:`~email.parser`, або коли створюється об’єкт :class:`~email.message.Message`, або коли електронний лист серіалізовано за допомогою :mod:`~email.generator`. Якщо політика, передана аналізатору, не перевизначена, успадковується всіма об’єктами Message і підоб’єктами, створеними синтаксичним аналізатором. За замовчуванням ``генератор`` використовуватиме політику об’єкта ``Message``, який він серіалізує. Політика за умовчанням: :data:`~email.policy.compat32`.

source: The minimum set of controls implemented by all ``policy`` objects are:
uk: Мінімальний набір елементів керування, реалізований усіма об’єктами ``policy``:

source: max_line_length
uk: максимальна_довжина_рядка

source: The maximum length, excluding the linesep character(s), individual lines may have when a ``Message`` is serialized. Defaults to 78.
uk: Максимальна довжина окремих рядків, за винятком символів рядків, може бути у серіалізованому ``повідомленні``. За замовчуванням 78.

source: The character used to separate individual lines when a ``Message`` is serialized. Defaults to ``\n``.
uk: Символ, який використовується для розділення окремих рядків, коли ``Message`` серіалізується. За замовчуванням ``\n``.

source: ``7bit`` or ``8bit``. ``8bit`` applies only to a ``Bytes`` ``generator``, and means that non-ASCII may be used where allowed by the protocol (or where it exists in the original input).
uk: ``7bit`` або ``8bit``. ``8bit`` застосовується лише до ``генератора`` ``Bytes`` і означає, що не-ASCII може використовуватися там, де це дозволено протоколом (або там, де воно існує у вихідному введенні).

source: raise_on_defect
uk: підвищення_на_дефект

source: Causes a ``parser`` to raise error when defects are encountered instead of adding them to the ``Message`` object's ``defects`` list.
uk: Примушує ``аналізатор`` викликати помилку, коли трапляються дефекти, замість того, щоб додавати їх до списку ``дефектів`` об'єкта ``Message``.

source: A new policy instance, with new settings, is created using the :meth:`~email.policy.Policy.clone` method of policy objects. ``clone`` takes any of the above controls as keyword arguments. Any control not specified in the call retains its default value. Thus you can create a policy that uses ``\r\n`` linesep characters like this::
uk: Новий екземпляр політики з новими налаштуваннями створюється за допомогою методу об’єктів політики :meth:`~email.policy.Policy.clone`. ``clone`` приймає будь-який із наведених вище елементів керування як аргумент ключового слова. Будь-який елемент керування, не вказаний у виклику, зберігає значення за замовчуванням. Таким чином, ви можете створити політику, яка використовує символи рядка ``\r\n``, як це:

source: Policies can be used to make the generation of messages in the format needed by your application simpler. Instead of having to remember to specify ``linesep='\r\n'`` in all the places you call a ``generator``, you can specify it once, when you set the policy used by the ``parser`` or the ``Message``, whichever your program uses to create ``Message`` objects. On the other hand, if you need to generate messages in multiple forms, you can still specify the parameters in the appropriate ``generator`` call. Or you can have custom policy instances for your different cases, and pass those in when you create the ``generator``.
uk: Політики можна використовувати для спрощення створення повідомлень у форматі, необхідному вашій програмі. Замість того, щоб не забувати вказувати ``linesep='\r\n'`` у всіх місцях, які ви називаєте ``генератором``, ви можете вказати його один раз, коли ви встановлюєте політику, яку використовує ``'парсер'`` або ``Message``, залежно від того, що ваша програма використовує для створення об’єктів ``Message``. З іншого боку, якщо вам потрібно генерувати повідомлення в кількох формах, ви можете вказати параметри у відповідному виклику ``generator``. Або ви можете мати спеціальні екземпляри політики для різних випадків і передати їх під час створення ``генератора``.

source: Provisional Policy with New Header API
uk: Попередня політика з новим API заголовка

source: While the policy framework is worthwhile all by itself, the main motivation for introducing it is to allow the creation of new policies that implement new features for the email package in a way that maintains backward compatibility for those who do not use the new policies. Because the new policies introduce a new API, we are releasing them in Python 3.3 as a :term:`provisional policy <provisional package>`. Backwards incompatible changes (up to and including removal of the code) may occur if deemed necessary by the core developers.
uk: Незважаючи на те, що структура політики сама по собі варта уваги, головною мотивацією для її впровадження є можливість створення нових політик, які реалізують нові функції для пакета електронної пошти таким чином, щоб підтримувати зворотну сумісність для тих, хто не використовує нові політики. Оскільки нові політики вводять новий API, ми випускаємо їх у Python 3.3 як :term:`попередню політику <provisional package>`. Зворотні несумісні зміни (аж до видалення коду) можуть відбуватися, якщо основні розробники вважають це за потрібне.

source: The new policies are instances of :class:`~email.policy.EmailPolicy`, and add the following additional controls:
uk: Нові політики є екземплярами :class:`~email.policy.EmailPolicy` і додають такі додаткові елементи керування:

source: Controls whether or not headers parsed by a :mod:`~email.parser` are refolded by the :mod:`~email.generator`. It can be ``none``, ``long``, or ``all``. The default is ``long``, which means that source headers with a line longer than ``max_line_length`` get refolded. ``none`` means no line get refolded, and ``all`` means that all lines get refolded.
uk: Контролює, чи заголовки, які розбираються :mod:`~email.parser`, повторно згортаються :mod:`~email.generator`. Це може бути ``none``, ``long`` або ``all``. Типовим значенням є ``long``, що означає, що вихідні заголовки з рядком, довшим за ``max_line_length``, згортаються повторно. ``none`` означає, що жоден рядок не буде повторно згорнутий, а ``all`` означає, що всі рядки будуть повторно згорнуті.

source: A callable that take a ``name`` and ``value`` and produces a custom header object.
uk: Викликається, що приймає ``ім’я`` і ``значення`` і створює спеціальний об’єкт заголовка.

source: The ``header_factory`` is the key to the new features provided by the new policies. When one of the new policies is used, any header retrieved from a ``Message`` object is an object produced by the ``header_factory``, and any time you set a header on a ``Message`` it becomes an object produced by ``header_factory``. All such header objects have a ``name`` attribute equal to the header name. Address and Date headers have additional attributes that give you access to the parsed data of the header. This means you can now do things like this::
uk: ``header_factory`` є ключем до нових функцій, наданих новими політиками. Коли використовується одна з нових політик, будь-який заголовок, отриманий з об’єкта ``Message``, є об’єктом, створеним ``header_factory``, і щоразу, коли ви встановлюєте заголовок ``Message``, він стає об’єктом створений ``header_factory``. Усі такі об’єкти заголовка мають атрибут ``name``, що дорівнює імені заголовка. Заголовки Address і Date мають додаткові атрибути, які надають вам доступ до проаналізованих даних заголовка. Це означає, що тепер ви можете робити такі речі:

source: You will note that the unicode display name is automatically encoded as ``utf-8`` when the message is serialized, but that when the header is accessed directly, you get the unicode version. This eliminates any need to deal with the :mod:`email.header` :meth:`~email.header.decode_header` or :meth:`~email.header.make_header` functions.
uk: Ви помітите, що відображуване ім’я Unicode автоматично кодується як ``utf-8``, коли повідомлення серіалізується, але коли до заголовка звертається безпосередньо, ви отримуєте версію Unicode. Це усуває будь-яку потребу працювати з функціями :mod:`email.header` :meth:`~email.header.decode_header` або :meth:`~email.header.make_header`.

source: You can also create addresses from parts::
uk: Ви також можете створювати адреси з частин::

source: Decoding to unicode is done automatically::
uk: Декодування в Юнікод виконується автоматично:

source: When you parse a message, you can use the ``addresses`` and ``groups`` attributes of the header objects to access the groups and individual addresses::
uk: Коли ви аналізуєте повідомлення, ви можете використовувати атрибути ``addresses`` і ``groups`` об’єктів заголовка для доступу до груп та окремих адрес::

source: In summary, if you use one of the new policies, header manipulation works the way it ought to: your application works with unicode strings, and the email package transparently encodes and decodes the unicode to and from the RFC standard Content Transfer Encodings.
uk: Підсумовуючи, якщо ви використовуєте одну з нових політик, маніпулювання заголовками працює так, як і повинно бути: ваша програма працює з рядками Unicode, а пакет електронної пошти прозоро кодує та декодує Unicode до стандарту RFC Content Transfer Encodings.

source: Other API Changes
uk: Інші зміни API

source: New :class:`~email.parser.BytesHeaderParser`, added to the :mod:`~email.parser` module to complement :class:`~email.parser.HeaderParser` and complete the Bytes API.
uk: Новий :class:`~email.parser.BytesHeaderParser`, доданий до модуля :mod:`~email.parser`, щоб доповнити :class:`~email.parser.HeaderParser` і завершити Bytes API.

source: New utility functions:
uk: Нові корисні функції:

source: :func:`~email.utils.format_datetime`: given a :class:`~datetime.datetime`, produce a string formatted for use in an email header.
uk: :func:`~email.utils.format_datetime`: враховуючи :class:`~datetime.datetime`, створити рядок, відформатований для використання в заголовку електронної пошти.

source: :func:`~email.utils.parsedate_to_datetime`: given a date string from an email header, convert it into an aware :class:`~datetime.datetime`, or a naive :class:`~datetime.datetime` if the offset is ``-0000``.
uk: :func:`~email.utils.parsedate_to_datetime`: отримавши рядок дати із заголовка електронної пошти, перетворити його на усвідомлений :class:`~datetime.datetime` або простий :class:`~datetime.datetime`, якщо зсув ``-0000``.

source: :func:`~email.utils.localtime`: With no argument, returns the current local time as an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`. Given an aware :class:`~datetime.datetime`, converts it into an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`.
uk: :func:`~email.utils.localtime`: без аргументів повертає поточний місцевий час як відомий :class:`~datetime.datetime` з використанням локального :class:`~datetime.timezone`. Дано aware :class:`~datetime.datetime`, перетворює його на aware :class:`~datetime.datetime` за допомогою локального :class:`~datetime.timezone`.

source: :class:`ftplib.FTP` now accepts a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Giampaolo Rodolà in :issue:`8594`.)
uk: :class:`ftplib.FTP` тепер приймає аргумент ключового слова ``source_address``, щоб вказати ``(хост, порт)`` для використання як адреси джерела у виклику зв’язування під час створення вихідного сокета. (Надав Джампаоло Родола в :issue:`8594`.)

source: The :class:`~ftplib.FTP_TLS` class now provides a new :func:`~ftplib.FTP_TLS.ccc` function to revert control channel back to plaintext. This can be useful to take advantage of firewalls that know how to handle NAT with non-secure FTP without opening fixed ports. (Contributed by Giampaolo Rodolà in :issue:`12139`.)
uk: Клас :class:`~ftplib.FTP_TLS` тепер надає нову функцію :func:`~ftplib.FTP_TLS.ccc` для повернення каналу керування назад до відкритого тексту. Це може бути корисним, щоб скористатися перевагами брандмауерів, які знають, як обробляти NAT із незахищеним FTP без відкриття фіксованих портів. (Надав Джампаоло Родола в :issue:`12139`.)

source: Added :meth:`ftplib.FTP.mlsd` method which provides a parsable directory listing format and deprecates :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`. (Contributed by Giampaolo Rodolà in :issue:`11072`.)
uk: Додано метод :meth:`ftplib.FTP.mlsd`, який забезпечує аналізований формат списку каталогів і не підтримує :meth:`ftplib.FTP.nlst` і :meth:`ftplib.FTP.dir`. (Надав Джампаоло Родола в :issue:`11072`.)

source: The :func:`functools.lru_cache` decorator now accepts a ``typed`` keyword argument (that defaults to ``False`` to ensure that it caches values of different types that compare equal in separate cache slots. (Contributed by Raymond Hettinger in :issue:`13227`.)
uk: Декоратор :func:`functools.lru_cache` тепер приймає аргумент ключового слова ``typed`` (який за замовчуванням має значення ``False``, щоб забезпечити кешування значень різних типів, які порівнюються, в окремих слотах кешу. (Надано Raymond Hettinger у :issue:`13227`.)

source: It is now possible to register callbacks invoked by the garbage collector before and after collection using the new :data:`~gc.callbacks` list.
uk: Тепер можна реєструвати зворотні виклики, викликані збирачем сміття до та після збирання, використовуючи новий список :data:`~gc.callbacks`.

source: A new :func:`~hmac.compare_digest` function has been added to prevent side channel attacks on digests through timing analysis. (Contributed by Nick Coghlan and Christian Heimes in :issue:`15061`.)
uk: Додано нову функцію :func:`~hmac.compare_digest`, щоб запобігти атакам бічних каналів на дайджести за допомогою аналізу часу. (Надано Ніком Когланом і Крістіаном Хеймсом у :issue:`15061`.)

source: :class:`http.server.BaseHTTPRequestHandler` now buffers the headers and writes them all at once when :meth:`~http.server.BaseHTTPRequestHandler.end_headers` is called. A new method :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` can be used to directly manage when the accumulated headers are sent. (Contributed by Andrew Schaaf in :issue:`3709`.)
uk: :class:`http.server.BaseHTTPRequestHandler` тепер буферизує заголовки та записує їх усі одночасно під час виклику :meth:`~http.server.BaseHTTPRequestHandler.end_headers`. Новий метод :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` можна використовувати для безпосереднього керування надсиланням накопичених заголовків. (Надав Ендрю Шааф у :issue:`3709`.)

source: :class:`http.server` now produces valid ``HTML 4.01 strict`` output. (Contributed by Ezio Melotti in :issue:`13295`.)
uk: :class:`http.server` тепер створює дійсний вихід ``HTML 4.01 strict``. (Надав Еціо Мелотті в :issue:`13295`.)

source: :class:`http.client.HTTPResponse` now has a :meth:`~http.client.HTTPResponse.readinto` method, which means it can be used as an :class:`io.RawIOBase` class. (Contributed by John Kuhn in :issue:`13464`.)
uk: :class:`http.client.HTTPResponse` тепер має метод :meth:`~http.client.HTTPResponse.readinto`, що означає, що його можна використовувати як клас :class:`io.RawIOBase`. (Надав Джон Кун у :issue:`13464`.)

source: :class:`html.parser.HTMLParser` is now able to parse broken markup without raising errors, therefore the *strict* argument of the constructor and the :exc:`~html.parser.HTMLParseError` exception are now deprecated. The ability to parse broken markup is the result of a number of bug fixes that are also available on the latest bug fix releases of Python 2.7/3.2. (Contributed by Ezio Melotti in :issue:`15114`, and :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)
uk: :class:`html.parser.HTMLParser` тепер може аналізувати пошкоджену розмітку, не викликаючи помилок, тому аргумент *strict* конструктора та виняток :exc:`~html.parser.HTMLParseError` тепер застаріли. Можливість аналізу пошкодженої розмітки є результатом ряду виправлень помилок, які також доступні в останніх версіях виправлень помилок Python 2.7/3.2. (Надав Еціо Мелотті в :issue:`15114` і :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)

source: A new :data:`~html.entities.html5` dictionary that maps HTML5 named character references to the equivalent Unicode character(s) (e.g. ``html5['gt;'] == '>'``) has been added to the :mod:`html.entities` module. The dictionary is now also used by :class:`~html.parser.HTMLParser`. (Contributed by Ezio Melotti in :issue:`11113` and :issue:`15156`.)
uk: Додано новий словник :data:`~html.entities.html5`, який відображає посилання на іменовані символи HTML5 на еквівалентні символи Unicode (наприклад, ``html5['gt;'] == '>'``). до модуля :mod:`html.entities`. Словник тепер також використовується :class:`~html.parser.HTMLParser`. (Надав Еціо Мелотті в :issue:`11113` і :issue:`15156`.)

source: imaplib
uk: імапліб

source: The :class:`~imaplib.IMAP4_SSL` constructor now accepts an SSLContext parameter to control parameters of the secure channel.
uk: Конструктор :class:`~imaplib.IMAP4_SSL` тепер приймає параметр SSLContext для керування параметрами безпечного каналу.

source: (Contributed by Sijin Joseph in :issue:`8808`.)
uk: (Надав Сіджин Джозеф у :issue:`8808`.)

source: inspect
uk: оглядати

source: A new :func:`~inspect.getclosurevars` function has been added. This function reports the current binding of all names referenced from the function body and where those names were resolved, making it easier to verify correct internal state when testing code that relies on stateful closures.
uk: Додано нову функцію :func:`~inspect.getclosurevars`. Ця функція повідомляє про поточне зв’язування всіх імен, на які посилається тіло функції, і про те, де ці імена були розпізнані, що полегшує перевірку правильності внутрішнього стану під час тестування коду, який покладається на закриття зі збереженням стану.

source: (Contributed by Meador Inge and Nick Coghlan in :issue:`13062`.)
uk: (Надано Meador Inge та Nick Coghlan у :issue:`13062`.)

source: A new :func:`~inspect.getgeneratorlocals` function has been added. This function reports the current binding of local variables in the generator's stack frame, making it easier to verify correct internal state when testing generators.
uk: Додано нову функцію :func:`~inspect.getgeneratorlocals`. Ця функція повідомляє про поточне зв’язування локальних змінних у стековому кадрі генератора, що полегшує перевірку правильності внутрішнього стану під час тестування генераторів.

source: (Contributed by Meador Inge in :issue:`15153`.)
uk: (Надано Meador Inge у :issue:`15153`.)
