Repository: python/python-docs-uk
Catalog: whatsnew/3.3.po
Languages: uk

source: PEP 380 adds the ``yield from`` expression, allowing a :term:`generator` to delegate part of its operations to another generator. This allows a section of code containing :keyword:`yield` to be factored out and placed in another generator. Additionally, the subgenerator is allowed to return with a value, and the value is made available to the delegating generator.
uk: PEP 380 додає вираз ``yield from``, дозволяючи :term:`generator` делегувати частину своїх операцій іншому генератору. Це дозволяє розділити код, що містить :keyword:`yield`, і розмістити його в іншому генераторі. Крім того, підгенератору дозволено повертати значення, і це значення стає доступним для делегуючого генератора.

source: While designed primarily for use in delegating to a subgenerator, the ``yield from`` expression actually allows delegation to arbitrary subiterators.
uk: Незважаючи на те, що вираз ``yield from`` розроблено в основному для використання під час делегування підгенератору, він фактично дозволяє делегувати довільним субітераторам.

source: For simple iterators, ``yield from iterable`` is essentially just a shortened form of ``for item in iterable: yield item``::
uk: Для простих ітераторів ``yield from iterable`` по суті є лише скороченою формою ``for item in iterable: yield item``::

source: However, unlike an ordinary loop, ``yield from`` allows subgenerators to receive sent and thrown values directly from the calling scope, and return a final value to the outer generator::
uk: Однак, на відміну від звичайного циклу, ``yield from`` дозволяє підгенераторам отримувати надіслані та викинуті значення безпосередньо з області виклику та повертати остаточне значення зовнішньому генератору:

source: The main principle driving this change is to allow even generators that are designed to be used with the ``send`` and ``throw`` methods to be split into multiple subgenerators as easily as a single large function can be split into multiple subfunctions.
uk: Головний принцип, що керує цією зміною, полягає в тому, щоб дозволити навіть генераторам, які призначені для використання з методами ``send`` і ``throw``, бути розділені на кілька підгенераторів так само легко, як одну велику функцію можна розділити на кілька підфункцій .

source: :pep:`380` - Syntax for Delegating to a Subgenerator
uk: :pep:`380` - Синтаксис для делегування підгенератору

source: PEP written by Greg Ewing; implementation by Greg Ewing, integrated into 3.3 by Renaud Blanch, Ryan Kelly and Nick Coghlan; documentation by Zbigniew Jędrzejewski-Szmek and Nick Coghlan
uk: PEP, написаний Грегом Юінгом; впровадження Грегом Юінгом, інтегроване в 3.3 Рено Бланчем, Раяном Келлі та Ніком Когланом; документація Збігнєва Єнджеєвського-Шмека та Ніка Коглана

source: PEP 409: Suppressing exception context
uk: PEP 409: Придушення контексту винятку

source: PEP 409 introduces new syntax that allows the display of the chained exception context to be disabled. This allows cleaner error messages in applications that convert between exception types::
uk: PEP 409 представляє новий синтаксис, який дозволяє вимкнути відображення зв’язаного виняткового контексту. Це дозволяє очистити повідомлення про помилки в програмах, які перетворюють типи винятків:

source: Without the ``from None`` suffix to suppress the cause, the original exception would be displayed by default::
uk: Без суфікса ``from None`` для придушення причини вихідний виняток відображатиметься за замовчуванням::

source: No debugging capability is lost, as the original exception context remains available if needed (for example, if an intervening library has incorrectly suppressed valuable underlying details)::
uk: Жодна можливість налагодження не втрачається, оскільки вихідний контекст винятку залишається доступним, якщо це необхідно (наприклад, якщо проміжна бібліотека неправильно приховала цінні основні деталі):

source: :pep:`409` - Suppressing exception context
uk: :pep:`409` - Придушення контексту винятків

source: PEP written by Ethan Furman; implemented by Ethan Furman and Nick Coghlan.
uk: PEP, написаний Ітаном Фурманом; реалізований Ітаном Фурманом і Ніком Когланом.

source: PEP 414: Explicit Unicode literals
uk: PEP 414: Явні літерали Unicode

source: To ease the transition from Python 2 for Unicode aware Python applications that make heavy use of Unicode literals, Python 3.3 once again supports the "``u``" prefix for string literals. This prefix has no semantic significance in Python 3, it is provided solely to reduce the number of purely mechanical changes in migrating to Python 3, making it easier for developers to focus on the more significant semantic changes (such as the stricter default separation of binary and text data).
uk: Щоб полегшити перехід від Python 2 для додатків Python, які підтримують Unicode і активно використовують літерали Unicode, Python 3.3 знову підтримує префікс "``u``" для рядкових літералів. Цей префікс не має семантичного значення в Python 3, він надається виключно для того, щоб зменшити кількість суто механічних змін під час переходу на Python 3, що полегшує розробникам зосередження на більш значущих семантичних змінах (таких як суворіше розділення двійкових за замовчуванням і текстові дані).

source: :pep:`414` - Explicit Unicode literals
uk: :pep:`414` - Явні літерали Unicode

source: PEP written by Armin Ronacher.
uk: PEP, автор Армін Ронашер.

source: PEP 3155: Qualified name for classes and functions
uk: PEP 3155: Уточнена назва для класів і функцій

source: Functions and class objects have a new ``__qualname__`` attribute representing the "path" from the module top-level to their definition. For global functions and classes, this is the same as ``__name__``. For other functions and classes, it provides better information about where they were actually defined, and how they might be accessible from the global scope.
uk: Функції та об’єкти класу мають новий атрибут ``__qualname__``, що представляє "шлях" від верхнього рівня модуля до їхнього визначення. Для глобальних функцій і класів це те саме, що ``__name__``. Для інших функцій і класів він надає кращу інформацію про те, де вони були фактично визначені, і як вони можуть бути доступні з глобальної області.

source: Example with (non-bound) methods::
uk: Приклад із (незв’язаними) методами::

source: Example with nested classes::
uk: Приклад із вкладеними класами::

source: Example with nested functions::
uk: Приклад із вкладеними функціями::

source: The string representation of those objects is also changed to include the new, more precise information::
uk: Рядкове подання цих об’єктів також змінено, щоб включити нову, більш точну інформацію::

source: :pep:`3155` - Qualified name for classes and functions
uk: :pep:`3155` - Уточнена назва для класів і функцій

source: PEP written and implemented by Antoine Pitrou.
uk: PEP написаний і реалізований Антуаном Пітру.

source: PEP 412: Key-Sharing Dictionary
uk: PEP 412: словник спільного використання ключів

source: Dictionaries used for the storage of objects' attributes are now able to share part of their internal storage between each other (namely, the part which stores the keys and their respective hashes). This reduces the memory consumption of programs creating many instances of non-builtin types.
uk: Словники, які використовуються для зберігання атрибутів об’єктів, тепер можуть спільно використовувати частину свого внутрішнього сховища між собою (а саме ту частину, яка зберігає ключі та їхні відповідні хеші). Це зменшує споживання пам’яті програмами, які створюють багато екземплярів невбудованих типів.

source: :pep:`412` - Key-Sharing Dictionary
uk: :pep:`412` - Словник зі спільним використанням ключів

source: PEP written and implemented by Mark Shannon.
uk: PEP написав і реалізував Марк Шеннон.

source: PEP 362: Function Signature Object
uk: PEP 362: Об’єкт підпису функції

source: A new function :func:`inspect.signature` makes introspection of python callables easy and straightforward. A broad range of callables is supported: python functions, decorated or not, classes, and :func:`functools.partial` objects. New classes :class:`inspect.Signature`, :class:`inspect.Parameter` and :class:`inspect.BoundArguments` hold information about the call signatures, such as, annotations, default values, parameters kinds, and bound arguments, which considerably simplifies writing decorators and any code that validates or amends calling signatures or arguments.
uk: Нова функція :func:`inspect.signature` робить інтроспекцію викликів Python легкою та простою. Підтримується широкий діапазон викликів: функції python, декоровані чи ні, класи та об’єкти :func:`functools.partial`. Нові класи :class:`inspect.Signature`, :class:`inspect.Parameter` і :class:`inspect.BoundArguments` містять інформацію про підписи викликів, такі як анотації, значення за замовчуванням, типи параметрів і зв’язані аргументи, що значно спрощує написання декораторів і будь-якого коду, який перевіряє або змінює підписи викликів або аргументи.

source: :pep:`362`: - Function Signature Object
uk: :pep:`362`: - Об'єкт підпису функції

source: PEP written by Brett Cannon, Yury Selivanov, Larry Hastings, Jiwon Seo; implemented by Yury Selivanov.
uk: PEP автори Бретт Кеннон, Юрій Селіванов, Ларрі Гастінгс, Джівон Сео; реалізував Юрій Селіванов.

source: PEP 421: Adding sys.implementation
uk: PEP 421: додавання sys.implementation

source: A new attribute on the :mod:`sys` module exposes details specific to the implementation of the currently running interpreter. The initial set of attributes on :attr:`sys.implementation` are ``name``, ``version``, ``hexversion``, and ``cache_tag``.
uk: Новий атрибут у модулі :mod:`sys` розкриває деталі, специфічні для реалізації поточного інтерпретатора. Початковим набором атрибутів :attr:`sys.implementation` є ``name``, ``version``, ``hexversion`` і ``cache_tag``.

source: The intention of ``sys.implementation`` is to consolidate into one namespace the implementation-specific data used by the standard library. This allows different Python implementations to share a single standard library code base much more easily. In its initial state, ``sys.implementation`` holds only a small portion of the implementation-specific data. Over time that ratio will shift in order to make the standard library more portable.
uk: Метою ``sys.implementation`` є консолідація в один простір імен специфічних для реалізації даних, які використовуються стандартною бібліотекою. Це дозволяє різним реалізаціям Python набагато легше спільно використовувати одну стандартну бібліотечну базу коду. У початковому стані ``sys.implementation`` містить лише невелику частину даних, що стосуються реалізації. З часом це співвідношення зміниться, щоб зробити стандартну бібліотеку більш портативною.

source: One example of improved standard library portability is ``cache_tag``. As of Python 3.3, ``sys.implementation.cache_tag`` is used by :mod:`importlib` to support :pep:`3147` compliance. Any Python implementation that uses ``importlib`` for its built-in import system may use ``cache_tag`` to control the caching behavior for modules.
uk: Одним із прикладів покращеної переносимості стандартної бібліотеки є ``cache_tag``. Починаючи з Python 3.3, ``sys.implementation.cache_tag`` використовується :mod:`importlib` для підтримки :pep:`3147` відповідності. Будь-яка реалізація Python, яка використовує ``importlib`` для своєї вбудованої системи імпорту, може використовувати ``cache_tag`` для керування поведінкою кешування для модулів.

source: The implementation of ``sys.implementation`` also introduces a new type to Python: :class:`types.SimpleNamespace`. In contrast to a mapping-based namespace, like :class:`dict`, ``SimpleNamespace`` is attribute-based, like :class:`object`. However, unlike ``object``, ``SimpleNamespace`` instances are writable. This means that you can add, remove, and modify the namespace through normal attribute access.
uk: Реалізація ``sys.implementation`` також вводить новий тип у Python: :class:`types.SimpleNamespace`. На відміну від простору імен на основі зіставлення, наприклад :class:`dict`, ``SimpleNamespace`` базується на атрибутах, як :class:`object`. Однак, на відміну від ``object``, екземпляри ``SimpleNamespace`` доступні для запису. Це означає, що ви можете додавати, видаляти та змінювати простір імен за допомогою звичайного доступу до атрибутів.

source: :pep:`421` - Adding sys.implementation
uk: :pep:`421` - Додавання sys.implementation

source: PEP written and implemented by Eric Snow.
uk: PEP написав і реалізував Ерік Сноу.

source: Using importlib as the Implementation of Import
uk: Використання importlib як реалізації імпорту

source: :issue:`2377` - Replace __import__ w/ importlib.__import__ :issue:`13959` - Re-implement parts of :mod:`imp` in pure Python :issue:`14605` - Make import machinery explicit :issue:`14646` - Require loaders set __loader__ and __package__
uk: :issue:`2377` - Замінити __import__ на importlib.__import__ :issue:`13959` - Повторно реалізувати частини :mod:`imp` на чистому Python :issue:`14605` - Зробити механізм імпорту явним :issue:`14646` - Вимагати набір завантажувачів __loader__ і __package__

source: The :func:`__import__` function is now powered by :func:`importlib.__import__`. This work leads to the completion of "phase 2" of :pep:`302`. There are multiple benefits to this change. First, it has allowed for more of the machinery powering import to be exposed instead of being implicit and hidden within the C code. It also provides a single implementation for all Python VMs supporting Python 3.3 to use, helping to end any VM-specific deviations in import semantics. And finally it eases the maintenance of import, allowing for future growth to occur.
uk: Функція :func:`__import__` тепер підтримується :func:`importlib.__import__`. Ця робота призводить до завершення "фази 2" :pep:`302`. Ця зміна має багато переваг. По-перше, це дозволило відкрити більшу частину механізму, що забезпечує імпорт, замість того, щоб бути неявним і прихованим у коді C. Він також забезпечує єдину реалізацію для всіх віртуальних машин Python, які підтримують Python 3.3, допомагаючи покласти край будь-яким специфічним для віртуальних машин відхилень у семантиці імпорту. І, нарешті, це полегшує підтримку імпорту, дозволяючи відбутися майбутнє зростання.

source: For the common user, there should be no visible change in semantics. For those whose code currently manipulates import or calls import programmatically, the code changes that might possibly be required are covered in the `Porting Python code`_ section of this document.
uk: Для звичайного користувача не повинно бути видимих змін у семантиці. Для тих, чий код наразі керує імпортом або викликає імпорт програмно, зміни коду, які можуть знадобитися, розглядаються в розділі "Перенесення коду Python" (`Porting Python code`_) цього документа.

source: New APIs
uk: Нові API

source: One of the large benefits of this work is the exposure of what goes into making the import statement work. That means the various importers that were once implicit are now fully exposed as part of the :mod:`importlib` package.
uk: Однією з значних переваг цієї роботи є розкриття того, що необхідно для того, щоб оператор імпорту працював. Це означає, що різні імпортери, які колись були неявними, тепер повністю доступні як частина пакета :mod:`importlib`.

source: The abstract base classes defined in :mod:`importlib.abc` have been expanded to properly delineate between :term:`meta path finders <meta path finder>` and :term:`path entry finders <path entry finder>` by introducing :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder`, respectively. The old ABC of :class:`importlib.abc.Finder` is now only provided for backwards-compatibility and does not enforce any method requirements.
uk: Абстрактні базові класи, визначені в :mod:`importlib.abc`, були розширені для правильного розмежування між :term:`мета-шляхом пошуку <meta path finder>` та :term:`мета-пошуком шляху <path entry finder>` шляхом введення :class:`importlib.abc. MetaPathFinder` і :class:`importlib.abc.PathEntryFinder` відповідно. Старий ABC :class:`importlib.abc.Finder` тепер надається лише для зворотної сумісності та не передбачає жодних вимог до методів.

source: In terms of finders, :class:`importlib.machinery.FileFinder` exposes the mechanism used to search for source and bytecode files of a module. Previously this class was an implicit member of :attr:`sys.path_hooks`.
uk: З точки зору засобів пошуку, :class:`importlib.machinery.FileFinder` відкриває механізм, який використовується для пошуку вихідних файлів і файлів байт-коду модуля. Раніше цей клас був неявним членом :attr:`sys.path_hooks`.

source: For loaders, the new abstract base class :class:`importlib.abc.FileLoader` helps write a loader that uses the file system as the storage mechanism for a module's code. The loader for source files (:class:`importlib.machinery.SourceFileLoader`), sourceless bytecode files (:class:`importlib.machinery.SourcelessFileLoader`), and extension modules (:class:`importlib.machinery.ExtensionFileLoader`) are now available for direct use.
uk: Для завантажувачів новий абстрактний базовий клас :class:`importlib.abc.FileLoader` допомагає написати завантажувач, який використовує файлову систему як механізм зберігання коду модуля. Завантажувач для вихідних файлів (:class:`importlib.machinery.SourceFileLoader`), файлів байт-кодів без джерел (:class:`importlib.machinery.SourcelessFileLoader`) і модулів розширення (:class:`importlib.machinery.ExtensionFileLoader`) є тепер доступний для прямого використання.

source: :exc:`ImportError` now has ``name`` and ``path`` attributes which are set when there is relevant data to provide. The message for failed imports will also provide the full name of the module now instead of just the tail end of the module's name.
uk: :exc:`ImportError` тепер має атрибути ``name`` і ``path``, які встановлюються, коли є відповідні дані для надання. У повідомленні про невдалі імпорти тепер буде міститися повна назва модуля, а не лише кінцева частина назви модуля.

source: The :func:`importlib.invalidate_caches` function will now call the method with the same name on all finders cached in :attr:`sys.path_importer_cache` to help clean up any stored state as necessary.
uk: Функція :func:`importlib.invalidate_caches` тепер викличе метод з однаковою назвою для всіх засобів пошуку, кешованих у :attr:`sys.path_importer_cache`, щоб допомогти очистити будь-який збережений стан за потреби.

source: Visible Changes
uk: Видимі зміни

source: For potential required changes to code, see the `Porting Python code`_ section.
uk: Інформацію про потенційно необхідні зміни коду див. у розділі "Перенесення коду Python" (`Porting Python code`_).

source: Beyond the expanse of what :mod:`importlib` now exposes, there are other visible changes to import. The biggest is that :attr:`sys.meta_path` and :attr:`sys.path_hooks` now store all of the meta path finders and path entry hooks used by import. Previously the finders were implicit and hidden within the C code of import instead of being directly exposed. This means that one can now easily remove or change the order of the various finders to fit one's needs.
uk: Окрім того, що зараз відкриває :mod:`importlib`, існують інші видимі зміни для імпорту. Найбільшим є те, що :attr:`sys.meta_path` і :attr:`sys.path_hooks` тепер зберігають усі шукачі мета-шляхів і перехоплювачі для введення шляхів, які використовуються імпортом. Раніше шукачі були неявними та прихованими в коді імпорту C замість того, щоб бути відкритими безпосередньо. Це означає, що тепер можна легко видалити або змінити порядок різних шукачів відповідно до своїх потреб.

source: Another change is that all modules have a ``__loader__`` attribute, storing the loader used to create the module. :pep:`302` has been updated to make this attribute mandatory for loaders to implement, so in the future once 3rd-party loaders have been updated people will be able to rely on the existence of the attribute. Until such time, though, import is setting the module post-load.
uk: Ще одна зміна полягає в тому, що всі модулі мають атрибут ``__loader__``, який зберігає завантажувач, використаний для створення модуля. :pep:`302` було оновлено, щоб зробити цей атрибут обов’язковим для завантажувачів, тож у майбутньому, після оновлення завантажувачів сторонніх розробників, люди зможуть покладатися на існування атрибута. Однак до цього часу імпорт встановлює модуль після завантаження.

source: Loaders are also now expected to set the ``__package__`` attribute from :pep:`366`. Once again, import itself is already setting this on all loaders from :mod:`importlib` and import itself is setting the attribute post-load.
uk: Тепер очікується, що завантажувачі встановлюють атрибут ``__package__`` з :pep:`366`. Знову ж таки, сам імпорт уже встановлює це для всіх завантажувачів із :mod:`importlib`, а сам імпорт встановлює атрибут після завантаження.

source: ``None`` is now inserted into :attr:`sys.path_importer_cache` when no finder can be found on :attr:`sys.path_hooks`. Since :class:`imp.NullImporter` is not directly exposed on :attr:`sys.path_hooks` it could no longer be relied upon to always be available to use as a value representing no finder found.
uk: ``None`` тепер вставляється в :attr:`sys.path_importer_cache`, якщо в :attr:`sys.path_hooks` не вдається знайти засіб пошуку. Оскільки :class:`imp.NullImporter` не доступний безпосередньо для :attr:`sys.path_hooks`, більше не можна покладатися на те, що він завжди буде доступним для використання як значення, що представляє не знайдений засіб пошуку.

source: All other changes relate to semantic changes which should be taken into consideration when updating code for Python 3.3, and thus should be read about in the `Porting Python code`_ section of this document.
uk: Усі інші зміни стосуються семантичних змін, які слід враховувати під час оновлення коду для Python 3.3, і тому про них слід прочитати в розділі "Перенесення коду Python" (`Porting Python code`_) цього документа.

source: (Implementation by Brett Cannon)
uk: (Реалізація Бреттом Кенноном)

source: Other Language Changes
uk: Інші зміни мови

source: Some smaller changes made to the core Python language are:
uk: Деякі менші зміни, внесені до основної мови Python:

source: Added support for Unicode name aliases and named sequences. Both :func:`unicodedata.lookup()` and ``'\N{...}'`` now resolve name aliases, and :func:`unicodedata.lookup()` resolves named sequences too.
uk: Додано підтримку псевдонімів імен Unicode та іменованих послідовностей. І :func:`unicodedata.lookup()`, і ``'\N{...}''`` тепер розпізнають псевдоніми імен, а :func:`unicodedata.lookup()` також розпізнає іменовані послідовності.

source: (Contributed by Ezio Melotti in :issue:`12753`.)
uk: (Надав Еціо Мелотті в :issue:`12753`.)

source: Unicode database updated to UCD version 6.1.0
uk: Базу даних Unicode оновлено до UCD версії 6.1.0

source: Equality comparisons on :func:`range` objects now return a result reflecting the equality of the underlying sequences generated by those range objects. (:issue:`13201`)
uk: Порівняння рівності об’єктів :func:`range` тепер повертає результат, що відображає рівність базових послідовностей, створених цими об’єктами діапазону. (:issue:`13201`)

source: The ``count()``, ``find()``, ``rfind()``, ``index()`` and ``rindex()`` methods of :class:`bytes` and :class:`bytearray` objects now accept an integer between 0 and 255 as their first argument.
uk: Методи ``count()``, ``find()``, ``rfind()``, ``index()`` і ``rindex()`` :class:`bytes` і: Об’єкти :class:`bytearray` тепер приймають ціле число від 0 до 255 як перший аргумент.

source: (Contributed by Petri Lehtinen in :issue:`12170`.)
uk: (Надав Петрі Лехтінен у :issue:`12170`.)
