Repository: python/python-docs-uk
Catalog: whatsnew/3.3.po
Languages: uk

source: New functions:
uk: Нові функції:

source: :func:`~shutil.disk_usage`: provides total, used and free disk space statistics. (Contributed by Giampaolo Rodolà in :issue:`12442`.)
uk: :func:`~shutil.disk_usage`: надає статистику загального, використаного та вільного дискового простору. (Надав Джампаоло Родола в :issue:`12442`.)

source: :func:`~shutil.chown`: allows one to change user and/or group of the given path also specifying the user/group names and not only their numeric ids. (Contributed by Sandro Tosi in :issue:`12191`.)
uk: :func:`~shutil.chown`: дозволяє змінювати користувача та/або групу заданого шляху, вказуючи також імена користувачів/груп, а не лише їхні цифрові ідентифікатори. (Надав Сандро Тосі в :issue:`12191`.)

source: :func:`shutil.get_terminal_size`: returns the size of the terminal window to which the interpreter is attached. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
uk: :func:`shutil.get_terminal_size`: повертає розмір вікна терміналу, до якого приєднаний інтерпретатор. (Надав Збігнєв Єнджеєвський-Шмек у :issue:`13609`.)

source: :func:`~shutil.copy2` and :func:`~shutil.copystat` now preserve file timestamps with nanosecond precision on platforms that support it. They also preserve file "extended attributes" on Linux. (Contributed by Larry Hastings in :issue:`14127` and :issue:`15238`.)
uk: :func:`~shutil.copy2` і :func:`~shutil.copystat` тепер зберігають мітки часу файлу з точністю до наносекунд на платформах, які це підтримують. Вони також зберігають "розширені атрибути" файлів у Linux. (Надано Ларрі Гастінгсом у :issue:`14127` та :issue:`15238`.)

source: Several functions now take an optional ``symlinks`` argument: when that parameter is true, symlinks aren't dereferenced and the operation instead acts on the symlink itself (or creates one, if relevant). (Contributed by Hynek Schlawack in :issue:`12715`.)
uk: Кілька функцій тепер приймають необов’язковий аргумент ``symlinks``: коли цей параметр має значення true, символічні посилання не розіменовуються, а операція натомість діє на саме символічне посилання (або створює його, якщо це необхідно). (Надав Хайнек Шлавак у :issue:`12715`.)

source: When copying files to a different file system, :func:`~shutil.move` now handles symlinks the way the posix ``mv`` command does, recreating the symlink rather than copying the target file contents. (Contributed by Jonathan Niehof in :issue:`9993`.) :func:`~shutil.move` now also returns the ``dst`` argument as its result.
uk: Під час копіювання файлів до іншої файлової системи :func:`~shutil.move` тепер обробляє символічні посилання так, як це робить команда posix ``mv``, відтворюючи символічне посилання, а не копіюючи вміст цільового файлу. (Надано Джонатаном Нігофом у :issue:`9993`.) :func:`~shutil.move` тепер також повертає аргумент ``dst`` як результат.

source: :func:`~shutil.rmtree` is now resistant to symlink attacks on platforms which support the new ``dir_fd`` parameter in :func:`os.open` and :func:`os.unlink`. (Contributed by Martin von Löwis and Hynek Schlawack in :issue:`4489`.)
uk: :func:`~shutil.rmtree` тепер стійкий до атак через символічні посилання на платформах, які підтримують новий параметр ``dir_fd`` у :func:`os.open` і :func:`os.unlink`. (Надано Мартіном фон Льовісом і Гінеком Шлаваком у :issue:`4489`.)

source: signal
uk: сигнал

source: The :mod:`signal` module has new functions:
uk: Модуль :mod:`signal` має нові функції:

source: :func:`~signal.pthread_sigmask`: fetch and/or change the signal mask of the calling thread (Contributed by Jean-Paul Calderone in :issue:`8407`);
uk: :func:`~signal.pthread_sigmask`: отримати та/або змінити маску сигналу викликаючого потоку (Надано Жаном-Полем Кальдероне в :issue:`8407`);

source: :func:`~signal.pthread_kill`: send a signal to a thread;
uk: :func:`~signal.pthread_kill`: відправити сигнал до потоку;

source: :func:`~signal.sigpending`: examine pending functions;
uk: :func:`~signal.sigpending`: перевірити незавершені функції;

source: :func:`~signal.sigwait`: wait a signal;
uk: :func:`~signal.sigwait`: чекати сигналу;

source: :func:`~signal.sigwaitinfo`: wait for a signal, returning detailed information about it;
uk: :func:`~signal.sigwaitinfo`: чекати сигналу, повертаючи детальну інформацію про нього;

source: :func:`~signal.sigtimedwait`: like :func:`~signal.sigwaitinfo` but with a timeout.
uk: :func:`~signal.sigtimedwait`: як :func:`~signal.sigwaitinfo`, але з тайм-аутом.

source: The signal handler writes the signal number as a single byte instead of a nul byte into the wakeup file descriptor. So it is possible to wait more than one signal and know which signals were raised.
uk: Обробник сигналу записує номер сигналу як один байт замість нульового байта в дескриптор файлу пробудження. Таким чином, можна чекати більше ніж один сигнал і знати, які сигнали були підняті.

source: :func:`signal.signal` and :func:`signal.siginterrupt` raise an OSError, instead of a RuntimeError: OSError has an errno attribute.
uk: :func:`signal.signal` і :func:`signal.siginterrupt` викликають OSError замість RuntimeError: OSError має атрибут errno.

source: The :mod:`smtpd` module now supports :rfc:`5321` (extended SMTP) and :rfc:`1870` (size extension). Per the standard, these extensions are enabled if and only if the client initiates the session with an ``EHLO`` command.
uk: Модуль :mod:`smtpd` тепер підтримує :rfc:`5321` (розширений SMTP) і :rfc:`1870` (розширення розміру). Відповідно до стандарту, ці розширення вмикаються тоді і тільки тоді, коли клієнт ініціює сеанс за допомогою команди ``EHLO``.

source: (Initial ``ELHO`` support by Alberto Trevino. Size extension by Juhana Jauhiainen. Substantial additional work on the patch contributed by Michele Orrù and Dan Boswell. :issue:`8739`)
uk: (Початкову підтримку ``ELHO`` виконав Альберто Тревіно. Розширення розміру здійснено Юханою Яухіайнен. Значну додаткову роботу над виправленням зробили Мікеле Орру та Ден Босвелл. :issue:`8739`)

source: The :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL`, and :class:`~smtplib.LMTP` classes now accept a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Paulo Scardine in :issue:`11281`.)
uk: Класи :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL` і :class:`~smtplib.LMTP` тепер приймають аргумент ключового слова ``source_address`` для визначення ``(host, port)`` для використання як адреси джерела у виклику зв’язування під час створення вихідного сокета. (Надав Paulo Scardine у :issue:`11281`.)

source: :class:`~smtplib.SMTP` now supports the context management protocol, allowing an ``SMTP`` instance to be used in a ``with`` statement. (Contributed by Giampaolo Rodolà in :issue:`11289`.)
uk: :class:`~smtplib.SMTP` тепер підтримує протокол керування контекстом, що дозволяє використовувати екземпляр ``SMTP`` у операторі ``with``. (Надав Джампаоло Родола в :issue:`11289`.)

source: The :class:`~smtplib.SMTP_SSL` constructor and the :meth:`~smtplib.SMTP.starttls` method now accept an SSLContext parameter to control parameters of the secure channel. (Contributed by Kasun Herath in :issue:`8809`.)
uk: Конструктор :class:`~smtplib.SMTP_SSL` і метод :meth:`~smtplib.SMTP.starttls` тепер приймають параметр SSLContext для керування параметрами безпечного каналу. (Надано Kasun Herath у :issue:`8809`.)

source: socket
uk: гніздо

source: The :class:`~socket.socket` class now exposes additional methods to process ancillary data when supported by the underlying platform:
uk: Клас :class:`~socket.socket` тепер надає додаткові методи для обробки допоміжних даних, якщо вони підтримуються базовою платформою:

source: (Contributed by David Watson in :issue:`6560`, based on an earlier patch by Heiko Wundram)
uk: (Надано Девідом Вотсоном у :issue:`6560`, на основі попереднього патча Хайко Вундрама)

source: The :class:`~socket.socket` class now supports the PF_CAN protocol family (https://en.wikipedia.org/wiki/Socketcan), on Linux (https://lwn.net/Articles/253425).
uk: Клас :class:`~socket.socket` тепер підтримує сімейство протоколів PF_CAN (https://en.wikipedia.org/wiki/Socketcan) у Linux (https://lwn.net/Articles/253425).

source: (Contributed by Matthias Fuchs, updated by Tiago Gonçalves in :issue:`10141`.)
uk: (Надано Маттіасом Фуксом, оновлено Тіаго Гонсалвесом у :issue:`10141`.)

source: The :class:`~socket.socket` class now supports the PF_RDS protocol family (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets and https://oss.oracle.com/projects/rds/).
uk: Клас :class:`~socket.socket` тепер підтримує сімейство протоколів PF_RDS (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets і https://oss.oracle.com/projects/rds/).

source: The :class:`~socket.socket` class now supports the ``PF_SYSTEM`` protocol family on OS X. (Contributed by Michael Goderbauer in :issue:`13777`.)
uk: Клас :class:`~socket.socket` тепер підтримує сімейство протоколів ``PF_SYSTEM`` в OS X. (Надано Майклом Годербауером у :issue:`13777`.)

source: New function :func:`~socket.sethostname` allows the hostname to be set on unix systems if the calling process has sufficient privileges. (Contributed by Ross Lagerwall in :issue:`10866`.)
uk: Нова функція :func:`~socket.sethostname` дозволяє встановлювати ім’я хоста в системах Unix, якщо процес виклику має достатні привілеї. (Надав Росс Лагервалл у :issue:`10866`.)

source: socketserver
uk: сокетсервер

source: :class:`~socketserver.BaseServer` now has an overridable method :meth:`~socketserver.BaseServer.service_actions` that is called by the :meth:`~socketserver.BaseServer.serve_forever` method in the service loop. :class:`~socketserver.ForkingMixIn` now uses this to clean up zombie child processes. (Contributed by Justin Warkentin in :issue:`11109`.)
uk: :class:`~socketserver.BaseServer` тепер має замінений метод :meth:`~socketserver.BaseServer.service_actions`, який викликається методом :meth:`~socketserver.BaseServer.serve_forever` у циклі обслуговування. :class:`~socketserver.ForkingMixIn` тепер використовує це для очищення дочірніх процесів-зомбі. (Надав Джастін Варкентін у :issue:`11109`.)

source: New :class:`sqlite3.Connection` method :meth:`~sqlite3.Connection.set_trace_callback` can be used to capture a trace of all sql commands processed by sqlite. (Contributed by Torsten Landschoff in :issue:`11688`.)
uk: Новий метод :class:`sqlite3.Connection` :meth:`~sqlite3.Connection.set_trace_callback` можна використовувати для захоплення трасування всіх команд sql, оброблених sqlite. (Надав Торстен Ландшофф у :issue:`11688`.)

source: The :mod:`ssl` module has two new random generation functions:
uk: Модуль :mod:`ssl` має дві нові функції випадкової генерації:

source: :func:`~ssl.RAND_bytes`: generate cryptographically strong pseudo-random bytes.
uk: :func:`~ssl.RAND_bytes`: генерувати криптографічно надійні псевдовипадкові байти.

source: :func:`~ssl.RAND_pseudo_bytes`: generate pseudo-random bytes.
uk: :func:`~ssl.RAND_pseudo_bytes`: генерувати псевдовипадкові байти.

source: (Contributed by Victor Stinner in :issue:`12049`.)
uk: (Надав Віктор Стіннер у :issue:`12049`.)

source: The :mod:`ssl` module now exposes a finer-grained exception hierarchy in order to make it easier to inspect the various kinds of errors. (Contributed by Antoine Pitrou in :issue:`11183`.)
uk: Модуль :mod:`ssl` тепер надає детальнішу ієрархію винятків, щоб полегшити перевірку різних типів помилок. (Надав Антуан Пітру в :issue:`11183`.)

source: :meth:`~ssl.SSLContext.load_cert_chain` now accepts a *password* argument to be used if the private key is encrypted. (Contributed by Adam Simpkins in :issue:`12803`.)
uk: :meth:`~ssl.SSLContext.load_cert_chain` тепер приймає аргумент *пароль*, який буде використовуватися, якщо закритий ключ зашифровано. (Надав Адам Сімпкінс у :issue:`12803`.)

source: Diffie-Hellman key exchange, both regular and Elliptic Curve-based, is now supported through the :meth:`~ssl.SSLContext.load_dh_params` and :meth:`~ssl.SSLContext.set_ecdh_curve` methods. (Contributed by Antoine Pitrou in :issue:`13626` and :issue:`13627`.)
uk: Обмін ключами Діффі-Хеллмана, як звичайний, так і на основі еліптичної кривої, тепер підтримується через методи :meth:`~ssl.SSLContext.load_dh_params` і :meth:`~ssl.SSLContext.set_ecdh_curve`. (Надав Антуан Пітру в :issue:`13626` і :issue:`13627`.)

source: SSL sockets have a new :meth:`~ssl.SSLSocket.get_channel_binding` method allowing the implementation of certain authentication mechanisms such as SCRAM-SHA-1-PLUS. (Contributed by Jacek Konieczny in :issue:`12551`.)
uk: SSL-сокети мають новий метод :meth:`~ssl.SSLSocket.get_channel_binding`, який дозволяє реалізувати певні механізми автентифікації, такі як SCRAM-SHA-1-PLUS. (Надав Яцек Конєчний у :issue:`12551`.)

source: You can query the SSL compression algorithm used by an SSL socket, thanks to its new :meth:`~ssl.SSLSocket.compression` method. The new attribute :attr:`~ssl.OP_NO_COMPRESSION` can be used to disable compression. (Contributed by Antoine Pitrou in :issue:`13634`.)
uk: Ви можете запитати алгоритм стиснення SSL, який використовується сокетом SSL, завдяки його новому методу :meth:`~ssl.SSLSocket.compression`. Новий атрибут :attr:`~ssl.OP_NO_COMPRESSION` можна використовувати для вимкнення стиснення. (Надав Антуан Пітру в :issue:`13634`.)

source: Support has been added for the Next Protocol Negotiation extension using the :meth:`ssl.SSLContext.set_npn_protocols` method. (Contributed by Colin Marc in :issue:`14204`.)
uk: Додано підтримку розширення Next Protocol Negotiation за допомогою методу :meth:`ssl.SSLContext.set_npn_protocols`. (Надав Колін Марк у :issue:`14204`.)

source: SSL errors can now be introspected more easily thanks to :attr:`~ssl.SSLError.library` and :attr:`~ssl.SSLError.reason` attributes. (Contributed by Antoine Pitrou in :issue:`14837`.)
uk: Помилки SSL тепер легше аналізувати завдяки атрибутам :attr:`~ssl.SSLError.library` і :attr:`~ssl.SSLError.reason`. (Надав Антуан Пітру в :issue:`14837`.)

source: The :func:`~ssl.get_server_certificate` function now supports IPv6. (Contributed by Charles-François Natali in :issue:`11811`.)
uk: Функція :func:`~ssl.get_server_certificate` тепер підтримує IPv6. (Надав Шарль-Франсуа Наталі в :issue:`11811`.)

source: New attribute :attr:`~ssl.OP_CIPHER_SERVER_PREFERENCE` allows setting SSLv3 server sockets to use the server's cipher ordering preference rather than the client's (:issue:`13635`).
uk: Новий атрибут :attr:`~ssl.OP_CIPHER_SERVER_PREFERENCE` дозволяє налаштувати серверні сокети SSLv3 на використання параметрів упорядкування шифрів сервера, а не клієнта (:issue:`13635`).

source: stat
uk: стат

source: The undocumented tarfile.filemode function has been moved to :func:`stat.filemode`. It can be used to convert a file's mode to a string of the form '-rwxrwxrwx'.
uk: Недокументовану функцію tarfile.filemode переміщено до :func:`stat.filemode`. Його можна використовувати для перетворення режиму файлу на рядок у формі '-rwxrwxrwx'.

source: (Contributed by Giampaolo Rodolà in :issue:`14807`.)
uk: (Надав Джампаоло Родола в :issue:`14807`.)

source: struct
uk: структура

source: The :mod:`struct` module now supports ``ssize_t`` and ``size_t`` via the new codes ``n`` and ``N``, respectively. (Contributed by Antoine Pitrou in :issue:`3163`.)
uk: Модуль :mod:`struct` тепер підтримує ``ssize_t`` і ``size_t`` через нові коди ``n`` і ``N`` відповідно. (Надав Антуан Пітру в :issue:`3163`.)

source: subprocess
uk: підпроцес

source: Command strings can now be bytes objects on posix platforms. (Contributed by Victor Stinner in :issue:`8513`.)
uk: Командні рядки тепер можуть бути об’єктами bytes на платформах posix. (Надав Віктор Стіннер у :issue:`8513`.)

source: A new constant :data:`~subprocess.DEVNULL` allows suppressing output in a platform-independent fashion. (Contributed by Ross Lagerwall in :issue:`5870`.)
uk: Нова константа :data:`~subprocess.DEVNULL` дозволяє придушувати виведення незалежним від платформи способом. (Надав Росс Лагервалл у :issue:`5870`.)

source: sys
uk: система

source: The :mod:`sys` module has a new :data:`~sys.thread_info` :term:`named tuple` holding information about the thread implementation (:issue:`11223`).
uk: Модуль :mod:`sys` має новий :data:`~sys.thread_info` :term:`named tuple`, що містить інформацію про реалізацію потоку (:issue:`11223`).

source: :mod:`tarfile` now supports ``lzma`` encoding via the :mod:`lzma` module. (Contributed by Lars Gustäbel in :issue:`5689`.)
uk: :mod:`tarfile` тепер підтримує кодування ``lzma`` через модуль :mod:`lzma`. (Надав Ларс Густебель у :issue:`5689`.)

source: tempfile
uk: тимчасовий файл

source: :class:`tempfile.SpooledTemporaryFile`\'s :meth:`~tempfile.SpooledTemporaryFile.truncate` method now accepts a ``size`` parameter. (Contributed by Ryan Kelly in :issue:`9957`.)
uk: Метод :class:`tempfile.SpooledTemporaryFile` :meth:`~tempfile.SpooledTemporaryFile.truncate` тепер приймає параметр ``size``. (Надав Райан Келлі в :issue:`9957`.)

source: textwrap
uk: обтікання текстом

source: The :mod:`textwrap` module has a new :func:`~textwrap.indent` that makes it straightforward to add a common prefix to selected lines in a block of text (:issue:`13857`).
uk: Модуль :mod:`textwrap` має новий :func:`~textwrap.indent`, який дозволяє легко додавати загальний префікс до вибраних рядків у блоці тексту (:issue:`13857`).

source: threading
uk: різьблення

source: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event`, and :class:`threading.Timer`, all of which used to be factory functions returning a class instance, are now classes and may be subclassed. (Contributed by Éric Araujo in :issue:`10968`.)
uk: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event` і :class:`threading.Timer`, усі з яких використовуються бути фабричними функціями, що повертають екземпляр класу, тепер є класами та можуть бути підкласами. (Надав Ерік Араужо в :issue:`10968`.)

source: The :class:`threading.Thread` constructor now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag value from the parent thread (:issue:`6064`).
uk: Конструктор :class:`threading.Thread` тепер приймає аргумент ключового слова ``daemon``, щоб замінити типову поведінку успадкування значення прапора ``daemon`` від батьківського потоку (:issue:`6064`).

source: The formerly private function ``_thread.get_ident`` is now available as the public function :func:`threading.get_ident`. This eliminates several cases of direct access to the ``_thread`` module in the stdlib. Third party code that used ``_thread.get_ident`` should likewise be changed to use the new public interface.
uk: Раніше закрита функція ``_thread.get_ident`` тепер доступна як публічна функція :func:`threading.get_ident`. Це усуває декілька випадків прямого доступу до модуля ``_thread`` у stdlib. Код третьої сторони, який використовував ``_thread.get_ident``, також слід змінити, щоб використовувати новий публічний інтерфейс.

source: time
uk: час

source: The :pep:`418` added new functions to the :mod:`time` module:
uk: :pep:`418` додав нові функції до модуля :mod:`time`:

source: :func:`~time.get_clock_info`: Get information on a clock.
uk: :func:`~time.get_clock_info`: отримати інформацію про годинник.

source: :func:`~time.monotonic`: Monotonic clock (cannot go backward), not affected by system clock updates.
uk: :func:`~time.monotonic`: Монотонний годинник (не може повертатися назад), на нього не впливають оновлення системного годинника.

source: :func:`~time.perf_counter`: Performance counter with the highest available resolution to measure a short duration.
uk: :func:`~time.perf_counter`: Лічильник продуктивності з найвищою доступною роздільною здатністю для вимірювання короткої тривалості.

source: :func:`~time.process_time`: Sum of the system and user CPU time of the current process.
uk: :func:`~time.process_time`: сума системного та користувальницького процесорного часу поточного процесу.

source: Other new functions:
uk: Інші нові функції:

source: :func:`~time.clock_getres`, :func:`~time.clock_gettime` and :func:`~time.clock_settime` functions with ``CLOCK_xxx`` constants. (Contributed by Victor Stinner in :issue:`10278`.)
uk: Функції :func:`~time.clock_getres`, :func:`~time.clock_gettime` і :func:`~time.clock_settime` з константами ``CLOCK_xxx``. (Надав Віктор Стіннер у :issue:`10278`.)

source: To improve cross platform consistency, :func:`~time.sleep` now raises a :exc:`ValueError` when passed a negative sleep value. Previously this was an error on posix, but produced an infinite sleep on Windows.
uk: Щоб покращити узгодженість між платформами, :func:`~time.sleep` тепер викликає :exc:`ValueError`, коли передається від’ємне значення сну. Раніше це була помилка на posix, але спричиняла нескінченний сон у Windows.

source: types
uk: види

source: Add a new :class:`types.MappingProxyType` class: Read-only proxy of a mapping. (:issue:`14386`)
uk: Додайте новий клас :class:`types.MappingProxyType`: проксі зіставлення лише для читання. (:issue:`14386`)

source: The new functions :func:`types.new_class` and :func:`types.prepare_class` provide support for :pep:`3115` compliant dynamic type creation. (:issue:`14588`)
uk: Нові функції :func:`types.new_class` і :func:`types.prepare_class` забезпечують підтримку для :pep:`3115` сумісного створення динамічного типу. (:issue:`14588`)

source: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns`, and :meth:`.assertWarnsRegex` now accept a keyword argument *msg* when used as context managers. (Contributed by Ezio Melotti and Winston Ewert in :issue:`10775`.)
uk: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns` і :meth:`.assertWarnsRegex` тепер приймають аргумент ключового слова *msg*, коли використовуються як менеджери контексту. (Надано Еціо Мелотті та Вінстоном Евертом у :issue:`10775`.)

source: :meth:`unittest.TestCase.run` now returns the :class:`~unittest.TestResult` object.
uk: :meth:`unittest.TestCase.run` тепер повертає об’єкт :class:`~unittest.TestResult`.

source: The :class:`~urllib.request.Request` class, now accepts a *method* argument used by :meth:`~urllib.request.Request.get_method` to determine what HTTP method should be used. For example, this will send a ``'HEAD'`` request::
uk: Клас :class:`~urllib.request.Request` тепер приймає аргумент *method*, який використовується :meth:`~urllib.request.Request.get_method`, щоб визначити, який метод HTTP слід використовувати. Наприклад, це надішле запит ``'HEAD'``:

source: webbrowser
uk: веб-браузер

source: The :mod:`webbrowser` module supports more "browsers": Google Chrome (named :program:`chrome`, :program:`chromium`, :program:`chrome-browser` or :program:`chromium-browser` depending on the version and operating system), and the generic launchers :program:`xdg-open`, from the FreeDesktop.org project, and :program:`gvfs-open`, which is the default URI handler for GNOME 3. (The former contributed by Arnaud Calmettes in :issue:`13620`, the latter by Matthias Klose in :issue:`14493`.)
uk: Модуль :mod:`webbrowser` підтримує більше "браузерів": Google Chrome (з назвами :program:`chrome`, :program:`chromium`, :program:`chrome-browser` або :program:`chromium-browser` залежно у версії й операційній системі), а також загальні засоби запуску :program:`xdg-open` із проекту FreeDesktop.org і :program:`gvfs-open`, який є обробником URI за замовчуванням для GNOME 3. ( перший надав Арно Кальметт у :issue:`13620`, другий — Матіас Клозе в :issue:`14493`.)
