Repository: python/python-docs-uk
Catalog: whatsnew/3.3.po
Languages: uk

source: The :func:`~io.open` function has a new ``'x'`` mode that can be used to exclusively create a new file, and raise a :exc:`FileExistsError` if the file already exists. It is based on the C11 'x' mode to fopen().
uk: Функція :func:`~io.open` має новий режим ``'x''``, який можна використовувати виключно для створення нового файлу та викликати :exc:`FileExistsError`, якщо файл уже існує. Він заснований на режимі C11 'x' для fopen().

source: (Contributed by David Townshend in :issue:`12760`.)
uk: (Надав Девід Тауншенд у :issue:`12760`.)

source: The constructor of the :class:`~io.TextIOWrapper` class has a new *write_through* optional argument. If *write_through* is ``True``, calls to :meth:`~io.TextIOWrapper.write` are guaranteed not to be buffered: any data written on the :class:`~io.TextIOWrapper` object is immediately handled to its underlying binary buffer.
uk: Конструктор класу :class:`~io.TextIOWrapper` має новий необов’язковий аргумент *write_through*. Якщо *write_through* має значення ``True``, виклики :meth:`~io.TextIOWrapper.write` гарантовано не буферизуються: будь-які дані, записані в об’єкт :class:`~io.TextIOWrapper`, негайно обробляються базовий двійковий буфер.

source: :func:`~itertools.accumulate` now takes an optional ``func`` argument for providing a user-supplied binary function.
uk: :func:`~itertools.accumulate` тепер приймає додатковий аргумент ``func`` для надання наданої користувачем бінарної функції.

source: logging
uk: лісозаготівля

source: The :func:`~logging.basicConfig` function now supports an optional ``handlers`` argument taking an iterable of handlers to be added to the root logger.
uk: Функція :func:`~logging.basicConfig` тепер підтримує необов’язковий аргумент ``handlers``, який приймає ітерацію обробників для додавання до кореневого реєстратора.

source: A class level attribute :attr:`~logging.handlers.SysLogHandler.append_nul` has been added to :class:`~logging.handlers.SysLogHandler` to allow control of the appending of the ``NUL`` (``\000``) byte to syslog records, since for some daemons it is required while for others it is passed through to the log.
uk: Атрибут рівня класу :attr:`~logging.handlers.SysLogHandler.append_nul` додано до :class:`~logging.handlers.SysLogHandler`, щоб дозволити контролювати додавання ``NUL`` (``\000``) байт до записів системного журналу, оскільки для деяких демонов він потрібен, а для інших він передається до журналу.

source: math
uk: математика

source: The :mod:`math` module has a new function, :func:`~math.log2`, which returns the base-2 logarithm of *x*.
uk: Модуль :mod:`math` має нову функцію, :func:`~math.log2`, яка повертає логарифм *x* за основою 2.

source: (Written by Mark Dickinson in :issue:`11888`.)
uk: (Написав Марк Дікінсон у :issue:`11888`.)

source: The :meth:`~mmap.mmap.read` method is now more compatible with other file-like objects: if the argument is omitted or specified as ``None``, it returns the bytes from the current file position to the end of the mapping. (Contributed by Petri Lehtinen in :issue:`12021`.)
uk: Метод :meth:`~mmap.mmap.read` тепер більш сумісний з іншими файлоподібними об’єктами: якщо аргумент опущено або вказано як ``None``, він повертає байти від поточної позиції файлу до кінця відображення. (Надав Петрі Лехтінен у :issue:`12021`.)

source: multiprocessing
uk: багатопроцесорність

source: The new :func:`multiprocessing.connection.wait` function allows polling multiple objects (such as connections, sockets and pipes) with a timeout. (Contributed by Richard Oudkerk in :issue:`12328`.)
uk: Нова функція :func:`multiprocessing.connection.wait` дозволяє опитувати кілька об’єктів (таких як з’єднання, сокети та канали) з тайм-аутом. (Надав Річард Оудкерк у :issue:`12328`.)

source: :class:`multiprocessing.Connection` objects can now be transferred over multiprocessing connections. (Contributed by Richard Oudkerk in :issue:`4892`.)
uk: :class:`multiprocessing.Connection` об’єкти тепер можна передавати через багатопроцесорні з’єднання. (Надав Річард Оудкерк у :issue:`4892`.)

source: :class:`multiprocessing.Process` now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag from the parent process (:issue:`6064`).
uk: :class:`multiprocessing.Process` тепер приймає аргумент ключового слова ``daemon``, щоб замінити типову поведінку успадкування прапора ``daemon`` від батьківського процесу (:issue:`6064`).

source: New attribute :data:`multiprocessing.Process.sentinel` allows a program to wait on multiple :class:`~multiprocessing.Process` objects at one time using the appropriate OS primitives (for example, :mod:`select` on posix systems).
uk: Новий атрибут :data:`multiprocessing.Process.sentinel` дозволяє програмі очікувати на кілька об’єктів :class:`~multiprocessing.Process` одночасно, використовуючи відповідні примітиви ОС (наприклад, :mod:`select` у системах posix ).

source: New methods :meth:`multiprocessing.pool.Pool.starmap` and :meth:`~multiprocessing.pool.Pool.starmap_async` provide :func:`itertools.starmap` equivalents to the existing :meth:`multiprocessing.pool.Pool.map` and :meth:`~multiprocessing.pool.Pool.map_async` functions. (Contributed by Hynek Schlawack in :issue:`12708`.)
uk: Нові методи :meth:`multiprocessing.pool.Pool.starmap` і :meth:`~multiprocessing.pool.Pool.starmap_async` забезпечують :func:`itertools.starmap` еквіваленти існуючого :meth:`multiprocessing.pool.Pool Функції .map` і :meth:`~multiprocessing.pool.Pool.map_async`. (Надав Хайнек Шлавак у :issue:`12708`.)

source: The :class:`nntplib.NNTP` class now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the NNTP connection when done::
uk: Клас :class:`nntplib.NNTP` тепер підтримує протокол керування контекстом для безумовного використання винятків :exc:`socket.error` і закриття з’єднання NNTP після завершення:

source: (Contributed by Giampaolo Rodolà in :issue:`9795`.)
uk: (Надав Джампаоло Родола в :issue:`9795`.)

source: os
uk: ос

source: The :mod:`os` module has a new :func:`~os.pipe2` function that makes it possible to create a pipe with :data:`~os.O_CLOEXEC` or :data:`~os.O_NONBLOCK` flags set atomically. This is especially useful to avoid race conditions in multi-threaded programs.
uk: Модуль :mod:`os` має нову функцію :func:`~os.pipe2`, яка дає змогу створювати трубу з прапорцями :data:`~os.O_CLOEXEC` або :data:`~os.O_NONBLOCK` встановити атомарно. Це особливо корисно, щоб уникнути умов змагань у багатопоточних програмах.

source: The :mod:`os` module has a new :func:`~os.sendfile` function which provides an efficient "zero-copy" way for copying data from one file (or socket) descriptor to another. The phrase "zero-copy" refers to the fact that all of the copying of data between the two descriptors is done entirely by the kernel, with no copying of data into userspace buffers. :func:`~os.sendfile` can be used to efficiently copy data from a file on disk to a network socket, e.g. for downloading a file.
uk: Модуль :mod:`os` має нову функцію :func:`~os.sendfile`, яка забезпечує ефективний спосіб "нульового копіювання" для копіювання даних з одного дескриптора файлу (або сокета) до іншого. Фраза "нульове копіювання" стосується того факту, що все копіювання даних між двома дескрипторами виконується виключно ядром, без копіювання даних у буфери простору користувача. :func:`~os.sendfile` можна використовувати для ефективного копіювання даних із файлу на диску в мережевий сокет, напр. для завантаження файлу.

source: (Patch submitted by Ross Lagerwall and Giampaolo Rodolà in :issue:`10882`.)
uk: (Патч надіслано Россом Лагерваллом і Джампаоло Родола в :issue:`10882`.)

source: To avoid race conditions like symlink attacks and issues with temporary files and directories, it is more reliable (and also faster) to manipulate file descriptors instead of file names. Python 3.3 enhances existing functions and introduces new functions to work on file descriptors (:issue:`4761`, :issue:`10755` and :issue:`14626`).
uk: Щоб уникнути таких ситуацій, як атаки символьних посилань і проблеми з тимчасовими файлами та каталогами, надійніше (а також швидше) маніпулювати дескрипторами файлів замість імен файлів. Python 3.3 покращує існуючі функції та представляє нові функції для роботи з дескрипторами файлів (:issue:`4761`, :issue:`10755` та :issue:`14626`).

source: The :mod:`os` module has a new :func:`~os.fwalk` function similar to :func:`~os.walk` except that it also yields file descriptors referring to the directories visited. This is especially useful to avoid symlink races.
uk: Модуль :mod:`os` має нову функцію :func:`~os.fwalk`, подібну до :func:`~os.walk` за винятком того, що він також видає дескриптори файлів, які посилаються на відвідані каталоги. Це особливо корисно, щоб уникнути перегонів символічних посилань.

source: The following functions get new optional *dir_fd* (:ref:`paths relative to directory descriptors <dir_fd>`) and/or *follow_symlinks* (:ref:`not following symlinks <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. Platform support for using these parameters can be checked via the sets :data:`os.supports_dir_fd` and :data:`os.supports_follows_symlinks`.
uk: Наступні функції отримують нові додаткові *dir_fd* (:ref:`шляхи відносно дескрипторів каталогу <dir_fd>`) та/або *follow_symlinks* (:ref:`не слідують символічним посиланням <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. Підтримку платформи для використання цих параметрів можна перевірити за допомогою наборів :data:`os.supports_dir_fd` і :data:`os.supports_follows_symlinks`.

source: The following functions now support a file descriptor for their path argument: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. Platform support for this can be checked via the :data:`os.supports_fd` set.
uk: Наступні функції тепер підтримують дескриптор файлу для свого аргументу шляху: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os. execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. Підтримку платформи для цього можна перевірити за допомогою набору :data:`os.supports_fd`.

source: :func:`~os.access` accepts an ``effective_ids`` keyword argument to turn on using the effective uid/gid rather than the real uid/gid in the access check. Platform support for this can be checked via the :data:`~os.supports_effective_ids` set.
uk: :func:`~os.access` приймає аргумент ключового слова ``effective_ids``, щоб увімкнути використання ефективного uid/gid замість справжнього uid/gid під час перевірки доступу. Підтримку платформи для цього можна перевірити за допомогою набору :data:`~os.supports_effective_ids`.

source: The :mod:`os` module has two new functions: :func:`~os.getpriority` and :func:`~os.setpriority`. They can be used to get or set process niceness/priority in a fashion similar to :func:`os.nice` but extended to all processes instead of just the current one.
uk: Модуль :mod:`os` має дві нові функції: :func:`~os.getpriority` і :func:`~os.setpriority`. Їх можна використовувати, щоб отримати або встановити зручність/пріоритет процесів подібно до :func:`os.nice`, але поширене на всі процеси, а не лише на поточний.

source: (Patch submitted by Giampaolo Rodolà in :issue:`10784`.)
uk: (Патч надіслав Джампаоло Родола в :issue:`10784`.)

source: The new :func:`os.replace` function allows cross-platform renaming of a file with overwriting the destination. With :func:`os.rename`, an existing destination file is overwritten under POSIX, but raises an error under Windows. (Contributed by Antoine Pitrou in :issue:`8828`.)
uk: Нова функція :func:`os.replace` дозволяє перейменовувати файл на різних платформах із перезаписом місця призначення. За допомогою :func:`os.rename` наявний цільовий файл перезаписується під POSIX, але викликає помилку під Windows. (Надав Антуан Пітру в :issue:`8828`.)

source: The stat family of functions (:func:`~os.stat`, :func:`~os.fstat`, and :func:`~os.lstat`) now support reading a file's timestamps with nanosecond precision. Symmetrically, :func:`~os.utime` can now write file timestamps with nanosecond precision. (Contributed by Larry Hastings in :issue:`14127`.)
uk: Сімейство функцій stat (:func:`~os.stat`, :func:`~os.fstat` і :func:`~os.lstat` тепер підтримує читання позначок часу файлу з наносекундною точністю. Симетрично, :func:`~os.utime` тепер може записувати мітки часу файлу з точністю до наносекунд. (Надано Ларрі Гастінгсом у :issue:`14127`.)

source: The new :func:`os.get_terminal_size` function queries the size of the terminal attached to a file descriptor. See also :func:`shutil.get_terminal_size`. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
uk: Нова функція :func:`os.get_terminal_size` запитує розмір терміналу, прикріпленого до дескриптора файлу. Дивіться також :func:`shutil.get_terminal_size`. (Надав Збігнєв Єнджеєвський-Шмек у :issue:`13609`.)

source: New functions to support Linux extended attributes (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.
uk: Нові функції для підтримки розширених атрибутів Linux (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.

source: New interface to the scheduler. These functions control how a process is allocated CPU time by the operating system. New functions: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os.sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os.sched_yield`,
uk: Новий інтерфейс планувальника. Ці функції контролюють, як процес розподіляє процесорний час операційною системою. Нові функції: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os. sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os. sched_yield`,

source: New functions to control the file system:
uk: Нові функції для керування файловою системою:

source: :func:`~os.posix_fadvise`: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations.
uk: :func:`~os.posix_fadvise`: повідомляє про намір отримати доступ до даних за певним шаблоном, таким чином дозволяючи ядру робити оптимізацію.

source: :func:`~os.posix_fallocate`: Ensures that enough disk space is allocated for a file.
uk: :func:`~os.posix_fallocate`: Переконується, що для файлу виділено достатньо місця на диску.

source: :func:`~os.sync`: Force write of everything to disk.
uk: :func:`~os.sync`: Примусовий запис усього на диск.

source: Additional new posix functions:
uk: Додаткові нові функції posix:

source: :func:`~os.lockf`: Apply, test or remove a POSIX lock on an open file descriptor.
uk: :func:`~os.lockf`: Застосувати, перевірити або видалити блокування POSIX для дескриптора відкритого файлу.

source: :func:`~os.pread`: Read from a file descriptor at an offset, the file offset remains unchanged.
uk: :func:`~os.pread`: читання з дескриптора файлу зі зміщенням, зміщення файлу залишається незмінним.

source: :func:`~os.pwrite`: Write to a file descriptor from an offset, leaving the file offset unchanged.
uk: :func:`~os.pwrite`: Запис у дескриптор файлу зі зсуву, залишаючи зміщення файлу незмінним.

source: :func:`~os.readv`: Read from a file descriptor into a number of writable buffers.
uk: :func:`~os.readv`: Читання з дескриптора файлу в декілька записуваних буферів.

source: :func:`~os.truncate`: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
uk: :func:`~os.truncate`: Обрізати файл, що відповідає *шляху*, щоб він мав розмір не більше *довжини* байтів.

source: :func:`~os.waitid`: Wait for the completion of one or more child processes.
uk: :func:`~os.waitid`: Зачекайте на завершення одного чи кількох дочірніх процесів.

source: :func:`~os.writev`: Write the contents of *buffers* to a file descriptor, where *buffers* is an arbitrary sequence of buffers.
uk: :func:`~os.writev`: Записати вміст *buffers* у файловий дескриптор, де *buffers* — це довільна послідовність буферів.

source: :func:`~os.getgrouplist` (:issue:`9344`): Return list of group ids that specified user belongs to.
uk: :func:`~os.getgrouplist` (:issue:`9344`): повертає список ідентифікаторів груп, до яких належить вказаний користувач.

source: :func:`~os.times` and :func:`~os.uname`: Return type changed from a tuple to a tuple-like object with named attributes.
uk: :func:`~os.times` і :func:`~os.uname`: тип повернення змінено з кортежу на кортеж-подібний об’єкт з іменованими атрибутами.

source: Some platforms now support additional constants for the :func:`~os.lseek` function, such as ``os.SEEK_HOLE`` and ``os.SEEK_DATA``.
uk: Деякі платформи тепер підтримують додаткові константи для функції :func:`~os.lseek`, такі як ``os.SEEK_HOLE`` і ``os.SEEK_DATA``.

source: New constants :data:`~os.RTLD_LAZY`, :data:`~os.RTLD_NOW`, :data:`~os.RTLD_GLOBAL`, :data:`~os.RTLD_LOCAL`, :data:`~os.RTLD_NODELETE`, :data:`~os.RTLD_NOLOAD`, and :data:`~os.RTLD_DEEPBIND` are available on platforms that support them. These are for use with the :func:`sys.setdlopenflags` function, and supersede the similar constants defined in :mod:`ctypes` and :mod:`DLFCN`. (Contributed by Victor Stinner in :issue:`13226`.)
uk: Нові константи :data:`~os.RTLD_LAZY`, :data:`~os.RTLD_NOW`, :data:`~os.RTLD_GLOBAL`, :data:`~os.RTLD_LOCAL`, :data:`~os.RTLD_NODELETE`, :data:`~os.RTLD_NOLOAD` і :data:`~os.RTLD_DEEPBIND` доступні на платформах, які їх підтримують. Вони призначені для використання з функцією :func:`sys.setdlopenflags` і замінюють подібні константи, визначені в :mod:`ctypes` і :mod:`DLFCN`. (Надав Віктор Стіннер у :issue:`13226`.)

source: :func:`os.symlink` now accepts (and ignores) the ``target_is_directory`` keyword argument on non-Windows platforms, to ease cross-platform support.
uk: :func:`os.symlink` тепер приймає (і ігнорує) аргумент ключового слова ``target_is_directory`` на платформах, відмінних від Windows, щоб полегшити міжплатформенну підтримку.

source: Tab-completion is now available not only for command names, but also their arguments. For example, for the ``break`` command, function and file names are completed.
uk: Завершення табуляції тепер доступне не тільки для імен команд, але й для їх аргументів. Наприклад, для команди ``break`` завершуються імена функцій і файлів.

source: (Contributed by Georg Brandl in :issue:`14210`)
uk: (Надав Георг Брандл у :issue:`14210`)

source: pickle
uk: маринований огірок

source: :class:`pickle.Pickler` objects now have an optional :attr:`~pickle.Pickler.dispatch_table` attribute allowing per-pickler reduction functions to be set.
uk: Об’єкти :class:`pickle.Pickler` тепер мають необов’язковий атрибут :attr:`~pickle.Pickler.dispatch_table`, який дозволяє встановлювати функції зменшення для кожного піклера.

source: (Contributed by Richard Oudkerk in :issue:`14166`.)
uk: (Надав Річард Оудкерк у :issue:`14166`.)

source: The Tk GUI and the :func:`~pydoc.serve` function have been removed from the :mod:`pydoc` module: ``pydoc -g`` and :func:`~pydoc.serve` have been deprecated in Python 3.2.
uk: Графічний інтерфейс Tk і функцію :func:`~pydoc.serve` видалено з модуля :mod:`pydoc`: ``pydoc -g`` і :func:`~pydoc.serve` застаріли в Python 3.2.

source: re
uk: повторно

source: :class:`str` regular expressions now support ``\u`` and ``\U`` escapes.
uk: :class:`str` регулярні вирази тепер підтримують екранування ``\u`` і ``\U``.

source: (Contributed by Serhiy Storchaka in :issue:`3665`.)
uk: (Надав Сергій Сторчака в :issue:`3665`.)

source: sched
uk: розклад

source: :meth:`~sched.scheduler.run` now accepts a *blocking* parameter which when set to false makes the method execute the scheduled events due to expire soonest (if any) and then return immediately. This is useful in case you want to use the :class:`~sched.scheduler` in non-blocking applications. (Contributed by Giampaolo Rodolà in :issue:`13449`.)
uk: :meth:`~sched.scheduler.run` тепер приймає параметр *blocking*, який, якщо встановлено на false, змушує метод виконувати заплановані події, які мають закінчитися якнайшвидше (якщо такі є), а потім негайно повертатися. Це корисно, якщо ви хочете використовувати :class:`~sched.scheduler` у неблокуючих програмах. (Надав Джампаоло Родола в :issue:`13449`.)

source: :class:`~sched.scheduler` class can now be safely used in multi-threaded environments. (Contributed by Josiah Carlson and Giampaolo Rodolà in :issue:`8684`.)
uk: :class:`~sched.scheduler` клас тепер можна безпечно використовувати в багатопоточних середовищах. (Надано Джосіа Карлсоном і Джампаоло Родола в :issue:`8684`.)

source: *timefunc* and *delayfunct* parameters of :class:`~sched.scheduler` class constructor are now optional and defaults to :func:`time.time` and :func:`time.sleep` respectively. (Contributed by Chris Clark in :issue:`13245`.)
uk: Параметри *timefunc* і *delayfunct* конструктора класу :class:`~sched.scheduler` тепер є необов’язковими і за умовчанням мають значення :func:`time.time` і :func:`time.sleep` відповідно. (Надав Кріс Кларк у :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` *argument* parameter is now optional. (Contributed by Chris Clark in :issue:`13245`.)
uk: Параметр *argument* :meth:`~sched.scheduler.enter` і :meth:`~sched.scheduler.enterabs` тепер необов’язковий. (Надав Кріс Кларк у :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` now accept a *kwargs* parameter. (Contributed by Chris Clark in :issue:`13245`.)
uk: :meth:`~sched.scheduler.enter` і :meth:`~sched.scheduler.enterabs` тепер приймають параметр *kwargs*. (Надав Кріс Кларк у :issue:`13245`.)

source: select
uk: вибрати

source: Solaris and derivative platforms have a new class :class:`select.devpoll` for high performance asynchronous sockets via :file:`/dev/poll`. (Contributed by Jesús Cea Avión in :issue:`6397`.)
uk: Solaris і похідні платформи мають новий клас :class:`select.devpoll` для високопродуктивних асинхронних сокетів через :file:`/dev/poll`. (Надав Jesús Cea Avión у :issue:`6397`.)

source: shlex
uk: шлекс

source: The previously undocumented helper function ``quote`` from the :mod:`pipes` modules has been moved to the :mod:`shlex` module and documented. :func:`~shlex.quote` properly escapes all characters in a string that might be otherwise given special meaning by the shell.
uk: Попередньо недокументована допоміжна функція ``quote`` з модулів :mod:`pipes` була переміщена до модуля :mod:`shlex` і задокументована. :func:`~shlex.quote` належним чином екранує всі символи в рядку, яким оболонка могла б надати особливого значення.

source: shutil
uk: шутил
