Repository: python/python-docs-uk
Catalog: whatsnew/3.3.po
Languages: uk

source: :meth:`poplib.POP3.quit` may now raise protocol errors like all other ``poplib`` methods. Code that assumes ``quit`` does not raise :exc:`poplib.error_proto` errors may need to be changed if errors on ``quit`` are encountered by a particular application (:issue:`11291`).
uk: :meth:`poplib.POP3.quit` тепер може викликати помилки протоколу, як і всі інші методи ``poplib``. Код, який припускає, що ``вийти`` не викликає помилки :exc:`poplib.error_proto`, може знадобитися змінити, якщо певна програма стикається з помилками ``вийти`` (:issue:`11291`).

source: The ``strict`` argument to :class:`email.parser.Parser`, deprecated since Python 2.4, has finally been removed.
uk: Аргумент ``strict`` для :class:`email.parser.Parser`, застарілий з Python 2.4, нарешті видалено.

source: The deprecated method ``unittest.TestCase.assertSameElements`` has been removed.
uk: Застарілий метод ``unittest.TestCase.assertSameElements`` було видалено.

source: The deprecated variable ``time.accept2dyear`` has been removed.
uk: Застарілу змінну ``time.accept2dyear`` видалено.

source: The deprecated ``Context._clamp`` attribute has been removed from the :mod:`decimal` module. It was previously replaced by the public attribute :attr:`~decimal.Context.clamp`. (See :issue:`8540`.)
uk: Застарілий атрибут ``Context._clamp`` було видалено з модуля :mod:`decimal`. Раніше він був замінений публічним атрибутом :attr:`~decimal.Context.clamp`. (Див. :issue:`8540`.)

source: The undocumented internal helper class ``SSLFakeFile`` has been removed from :mod:`smtplib`, since its functionality has long been provided directly by :meth:`socket.socket.makefile`.
uk: Недокументований внутрішній допоміжний клас ``SSLFakeFile`` було видалено з :mod:`smtplib`, оскільки його функціональні можливості протягом тривалого часу надавалися безпосередньо :meth:`socket.socket.makefile`.

source: Passing a negative value to :func:`time.sleep` on Windows now raises an error instead of sleeping forever. It has always raised an error on posix.
uk: Передача від’ємного значення :func:`time.sleep` у Windows тепер викликає помилку, а не сплячий режим назавжди. Це завжди викликало помилку на posix.

source: The ``ast.__version__`` constant has been removed. If you need to make decisions affected by the AST version, use :attr:`sys.version_info` to make the decision.
uk: Константу ``ast.__version__`` видалено. Якщо вам потрібно прийняти рішення, на які впливає версія AST, використовуйте :attr:`sys.version_info` для прийняття рішення.

source: Code that used to work around the fact that the :mod:`threading` module used factory functions by subclassing the private classes will need to change to subclass the now-public classes.
uk: Код, який раніше обходив той факт, що модуль :mod:`threading` використовував фабричні функції, створюючи підкласи приватних класів, потрібно буде змінити, щоб створити підкласи публічних класів.

source: The undocumented debugging machinery in the threading module has been removed, simplifying the code. This should have no effect on production code, but is mentioned here in case any application debug frameworks were interacting with it (:issue:`13550`).
uk: Недокументований механізм налагодження в модулі обробки потоків було видалено, що спростило код. Це не повинно вплинути на робочий код, але згадується тут, якщо з ним взаємодіють будь-які фреймворки налагодження програм (:issue:`13550`).

source: Porting C code
uk: Перенесення коду C

source: In the course of changes to the buffer API the undocumented :c:member:`~Py_buffer.smalltable` member of the :c:type:`Py_buffer` structure has been removed and the layout of the :c:type:`PyMemoryViewObject` has changed.
uk: Під час змін до API буфера було видалено недокументований член :c:member:`~Py_buffer.smalltable` структури :c:type:`Py_buffer` і макет :c:type:`PyMemoryViewObject` змінилося.

source: All extensions relying on the relevant parts in ``memoryobject.h`` or ``object.h`` must be rebuilt.
uk: Усі розширення, що покладаються на відповідні частини в ``memoryobject.h`` або ``object.h``, повинні бути перебудовані.

source: Due to :ref:`PEP 393 <pep-393>`, the :c:type:`Py_UNICODE` type and all functions using this type are deprecated (but will stay available for at least five years). If you were using low-level Unicode APIs to construct and access unicode objects and you want to benefit of the memory footprint reduction provided by :pep:`393`, you have to convert your code to the new :doc:`Unicode API <../c-api/unicode>`.
uk: Через :ref:`PEP 393 <pep-393>`, тип :c:type:`Py_UNICODE` та всі функції, що використовують цей тип, застаріли (але залишатимуться доступними щонайменше п’ять років). Якщо ви використовували низькорівневі API Unicode для створення та доступу до об’єктів Unicode та хочете скористатися перевагами зменшення обсягу пам’яті, яке забезпечує :pep:`393`, вам потрібно перетворити свій код на новий :doc:`API Unicode <../c-api/unicode>`.

source: However, if you only have been using high-level functions such as :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` or :c:func:`PyUnicode_FromFormat()`, your code will automatically take advantage of the new unicode representations.
uk: Однак, якщо ви використовували лише функції високого рівня, такі як :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` або :c:func:`PyUnicode_FromFormat()`, ваш код автоматично прийматиме переваги нових представлень Unicode.

source: :c:func:`PyImport_GetMagicNumber` now returns ``-1`` upon failure.
uk: :c:func:`PyImport_GetMagicNumber` тепер повертає ``-1`` у разі помилки.

source: As a negative value for the *level* argument to :func:`__import__` is no longer valid, the same now holds for :c:func:`PyImport_ImportModuleLevel`. This also means that the value of *level* used by :c:func:`PyImport_ImportModuleEx` is now ``0`` instead of ``-1``.
uk: Оскільки від’ємне значення для аргументу *level* для :func:`__import__` більше недійсне, те саме тепер стосується :c:func:`PyImport_ImportModuleLevel`. Це також означає, що значення *level*, яке використовується :c:func:`PyImport_ImportModuleEx`, тепер дорівнює ``0`` замість ``-1``.

source: Building C extensions
uk: Будівля C розширення

source: The range of possible file names for C extensions has been narrowed. Very rarely used spellings have been suppressed: under POSIX, files named ``xxxmodule.so``, ``xxxmodule.abi3.so`` and ``xxxmodule.cpython-*.so`` are no longer recognized as implementing the ``xxx`` module. If you had been generating such files, you have to switch to the other spellings (i.e., remove the ``module`` string from the file names).
uk: Діапазон можливих імен файлів для розширень C було звужено. Дуже рідко використовувані варіанти написання були придушені: у POSIX файли з іменами ``xxxmodule.so``, ``xxxmodule.abi3.so`` і ``xxxmodule.cpython-*.so`` більше не розпізнаються як такі, що реалізують` модуль `xxx``. Якщо ви створювали такі файли, вам потрібно переключитися на інші варіанти написання (тобто видалити рядок ``module`` з імен файлів).

source: (implemented in :issue:`14040`.)
uk: (реалізовано в :issue:`14040`.)

source: Command Line Switch Changes
uk: Зміни перемикача командного рядка

source: The -Q command-line flag and related artifacts have been removed. Code checking sys.flags.division_warning will need updating.
uk: Прапор командного рядка -Q і пов’язані артефакти видалено. Код перевірки sys.flags.division_warning потребує оновлення.

source: (:issue:`10998`, contributed by Éric Araujo.)
uk: (:issue:`10998`, надано Еріком Араухо.)

source: When :program:`python` is started with :option:`-S`, ``import site`` will no longer add site-specific paths to the module search paths. In previous versions, it did.
uk: Коли :program:`python` запускається за допомогою :option:`-S`, ``import site`` більше не додаватиме шляхи для сайту до шляхів пошуку модуля. У попередніх версіях так і було.

source: (:issue:`11591`, contributed by Carl Meyer with editions by Éric Araujo.)
uk: (:issue:`11591`, надано Карлом Майєром з виданнями Еріка Араухо.)
