Repository: python/python-docs-uk
Catalog: whatsnew/3.3.po
Languages: uk

source: The :mod:`xml.etree.ElementTree` module now imports its C accelerator by default; there is no longer a need to explicitly import :mod:`xml.etree.cElementTree` (this module stays for backwards compatibility, but is now deprecated). In addition, the ``iter`` family of methods of :class:`~xml.etree.ElementTree.Element` has been optimized (rewritten in C). The module's documentation has also been greatly improved with added examples and a more detailed reference.
uk: Модуль :mod:`xml.etree.ElementTree` тепер імпортує свій прискорювач C за замовчуванням; більше немає потреби явно імпортувати :mod:`xml.etree.cElementTree` (цей модуль залишається для зворотної сумісності, але тепер він застарів). Крім того, сімейство методів ``iter`` :class:`~xml.etree.ElementTree.Element` було оптимізовано (переписано на C). Документацію модуля також було значно покращено, додано приклади та більш детальну довідку.

source: New attribute :attr:`zlib.Decompress.eof` makes it possible to distinguish between a properly-formed compressed stream and an incomplete or truncated one. (Contributed by Nadeem Vawda in :issue:`12646`.)
uk: Новий атрибут :attr:`zlib.Decompress.eof` дає змогу відрізнити правильно сформований стислий потік від неповного або скороченого. (Надім Вавда в :issue:`12646`.)

source: New attribute :attr:`zlib.ZLIB_RUNTIME_VERSION` reports the version string of the underlying ``zlib`` library that is loaded at runtime. (Contributed by Torsten Landschoff in :issue:`12306`.)
uk: Новий атрибут :attr:`zlib.ZLIB_RUNTIME_VERSION` повідомляє рядок версії основної бібліотеки ``zlib``, яка завантажується під час виконання. (Надав Торстен Ландшофф у :issue:`12306`.)

source: Optimizations
uk: Оптимізації

source: Major performance enhancements have been added:
uk: Додано основні покращення продуктивності:

source: Thanks to :pep:`393`, some operations on Unicode strings have been optimized:
uk: Завдяки :pep:`393` деякі операції над рядками Unicode були оптимізовані:

source: the memory footprint is divided by 2 to 4 depending on the text
uk: обсяг пам'яті ділиться на 2-4 в залежності від тексту

source: encode an ASCII string to UTF-8 doesn't need to encode characters anymore, the UTF-8 representation is shared with the ASCII representation
uk: кодувати рядок ASCII у UTF-8 більше не потрібно кодувати символи, представлення UTF-8 спільно з представленням ASCII

source: the UTF-8 encoder has been optimized
uk: кодувальник UTF-8 оптимізовано

source: repeating a single ASCII letter and getting a substring of an ASCII string is 4 times faster
uk: повторення однієї літери ASCII і отримання підрядка рядка ASCII відбувається в 4 рази швидше

source: UTF-8 is now 2x to 4x faster. UTF-16 encoding is now up to 10x faster.
uk: UTF-8 тепер у 2-4 рази швидше. Кодування UTF-16 тепер у 10 разів швидше.

source: (Contributed by Serhiy Storchaka, :issue:`14624`, :issue:`14738` and :issue:`15026`.)
uk: (Надав Сергій Сторчака, :issue:`14624`, :issue:`14738` та :issue:`15026`.)

source: Build and C API Changes
uk: Зміни збірки та C API

source: Changes to Python's build process and to the C API include:
uk: Зміни в процесі збирання Python і в API C включають:

source: New :pep:`3118` related function:
uk: Нова пов'язана функція :pep:`3118`:

source: :pep:`393` added new Unicode types, macros and functions:
uk: :pep:`393` додано нові типи Unicode, макроси та функції:

source: High-level API:
uk: API високого рівня:

source: Low-level API:
uk: API низького рівня:

source: :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4` types
uk: Типи :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4`

source: :c:type:`PyASCIIObject` and :c:type:`PyCompactUnicodeObject` structures
uk: Структури :c:type:`PyASCIIObject` і :c:type:`PyCompactUnicodeObject`

source: :c:macro:`PyUnicode_KIND` with :c:type:`PyUnicode_Kind` enum: :c:data:`PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`
uk: :c:macro:`PyUnicode_KIND` з :c:type:`PyUnicode_Kind` enum: :c:data:`PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`

source: :c:macro:`PyArg_ParseTuple` now accepts a :class:`bytearray` for the ``c`` format (:issue:`12380`).
uk: :c:macro:`PyArg_ParseTuple` тепер приймає :class:`bytearray` для формату ``c`` (:issue:`12380`).

source: Deprecated
uk: Застаріле

source: Unsupported Operating Systems
uk: Непідтримувані операційні системи

source: OS/2 and VMS are no longer supported due to the lack of a maintainer.
uk: OS/2 і VMS більше не підтримуються через відсутність супроводжуючого.

source: Windows 2000 and Windows platforms which set ``COMSPEC`` to ``command.com`` are no longer supported due to maintenance burden.
uk: Платформи Windows 2000 і Windows, які встановлюють для ``COMSPEC`` значення ``command.com`` більше не підтримуються через тягар обслуговування.

source: OSF support, which was deprecated in 3.2, has been completely removed.
uk: Підтримку OSF, яка була застарілою у версії 3.2, було повністю видалено.

source: Deprecated Python modules, functions and methods
uk: Застарілі модулі, функції та методи Python

source: Passing a non-empty string to ``object.__format__()`` is deprecated, and will produce a :exc:`TypeError` in Python 3.4 (:issue:`9856`).
uk: Передача непорожнього рядка в ``object.__format__()`` є застарілою та викличе :exc:`TypeError` у Python 3.4 (:issue:`9856`).

source: The ``unicode_internal`` codec has been deprecated because of the :pep:`393`, use UTF-8, UTF-16 (``utf-16-le`` or ``utf-16-be``), or UTF-32 (``utf-32-le`` or ``utf-32-be``)
uk: Кодек ``unicode_internal`` застарів через :pep:`393`, використовуйте UTF-8, UTF-16 (``utf-16-le`` або ``utf-16-be``), або UTF-32 (``utf-32-le`` або ``utf-32-be``)

source: :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`: use :meth:`ftplib.FTP.mlsd`
uk: :meth:`ftplib.FTP.nlst` і :meth:`ftplib.FTP.dir`: використовуйте :meth:`ftplib.FTP.mlsd`

source: :func:`platform.popen`: use the :mod:`subprocess` module. Check especially the :ref:`subprocess-replacements` section (:issue:`11377`).
uk: :func:`platform.popen`: використовуйте модуль :mod:`subprocess`. Особливо перевірте розділ :ref:`subprocess-replacements` (:issue:`11377`).

source: :issue:`13374`: The Windows bytes API has been deprecated in the :mod:`os` module. Use Unicode filenames, instead of bytes filenames, to not depend on the ANSI code page anymore and to support any filename.
uk: :issue:`13374`: Windows bytes API більше не підтримується в модулі :mod:`os`. Щоб більше не залежати від кодової сторінки ANSI та підтримувати будь-які назви файлів, використовуйте назви файлів у кодуванні Unicode замість імен файлів у байтах.

source: :issue:`13988`: The :mod:`xml.etree.cElementTree` module is deprecated. The accelerator is used automatically whenever available.
uk: :issue:`13988`: Модуль :mod:`xml.etree.cElementTree` застарів. Прискорювач використовується автоматично, коли він доступний.

source: The behaviour of :func:`time.clock` depends on the platform: use the new :func:`time.perf_counter` or :func:`time.process_time` function instead, depending on your requirements, to have a well defined behaviour.
uk: Поведінка :func:`time.clock` залежить від платформи: замість цього використовуйте нову функцію :func:`time.perf_counter` або :func:`time.process_time`, залежно від ваших вимог, щоб мати чітко визначену поведінку .

source: The :func:`os.stat_float_times` function is deprecated.
uk: Функція :func:`os.stat_float_times` застаріла.

source: :mod:`abc` module:
uk: :mod:`abc` модуль:

source: :mod:`importlib` package:
uk: :mod:`importlib` пакет:

source: :meth:`importlib.abc.SourceLoader.path_mtime` is now deprecated in favour of :meth:`importlib.abc.SourceLoader.path_stats` as bytecode files now store both the modification time and size of the source file the bytecode file was compiled from.
uk: :meth:`importlib.abc.SourceLoader.path_mtime` тепер не підтримується на користь :meth:`importlib.abc.SourceLoader.path_stats`, оскільки файли байт-коду тепер зберігають як час модифікації, так і розмір вихідного файлу, файл байт-коду було скомпільовано від.

source: Deprecated functions and types of the C API
uk: Застарілі функції та типи C API

source: The :c:type:`Py_UNICODE` has been deprecated by :pep:`393` and will be removed in Python 4. All functions using this type are deprecated:
uk: :c:type:`Py_UNICODE` був застарілим :pep:`393` і буде видалено в Python 4. Усі функції, що використовують цей тип, застаріли:

source: Unicode functions and methods using :c:type:`Py_UNICODE` and :c:type:`Py_UNICODE*` types:
uk: Функції та методи Unicode, що використовують типи :c:type:`Py_UNICODE` і :c:type:`Py_UNICODE*`:

source: :c:macro:`PyUnicode_FromUnicode`: use :c:func:`PyUnicode_FromWideChar` or :c:func:`PyUnicode_FromKindAndData`
uk: :c:macro:`PyUnicode_FromUnicode`: використовуйте :c:func:`PyUnicode_FromWideChar` або :c:func:`PyUnicode_FromKindAndData`

source: :c:macro:`PyUnicode_AS_UNICODE`, :c:func:`PyUnicode_AsUnicode`, :c:func:`PyUnicode_AsUnicodeAndSize`: use :c:func:`PyUnicode_AsWideCharString`
uk: :c:macro:`PyUnicode_AS_UNICODE`, :c:func:`PyUnicode_AsUnicode`, :c:func:`PyUnicode_AsUnicodeAndSize`: використовуйте :c:func:`PyUnicode_AsWideCharString`

source: :c:macro:`PyUnicode_AS_DATA`: use :c:macro:`PyUnicode_DATA` with :c:macro:`PyUnicode_READ` and :c:macro:`PyUnicode_WRITE`
uk: :c:macro:`PyUnicode_AS_DATA`: використовуйте :c:macro:`PyUnicode_DATA` з :c:macro:`PyUnicode_READ` і :c:macro:`PyUnicode_WRITE`

source: :c:macro:`PyUnicode_GET_SIZE`, :c:func:`PyUnicode_GetSize`: use :c:macro:`PyUnicode_GET_LENGTH` or :c:func:`PyUnicode_GetLength`
uk: :c:macro:`PyUnicode_GET_SIZE`, :c:func:`PyUnicode_GetSize`: використовуйте :c:macro:`PyUnicode_GET_LENGTH` або :c:func:`PyUnicode_GetLength`

source: :c:macro:`PyUnicode_GET_DATA_SIZE`: use ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (only work on ready strings)
uk: :c:macro:`PyUnicode_GET_DATA_SIZE`: використовуйте ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (працює лише з готовими рядками)

source: :c:func:`PyUnicode_AsUnicodeCopy`: use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString`
uk: :c:func:`PyUnicode_AsUnicodeCopy`: використовуйте :c:func:`PyUnicode_AsUCS4Copy` або :c:func:`PyUnicode_AsWideCharString`

source: Functions and macros manipulating Py_UNICODE* strings:
uk: Функції та макроси, що маніпулюють рядками Py_UNICODE*:

source: :c:macro:`Py_UNICODE_strlen`: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
uk: :c:macro:`Py_UNICODE_strlen`: використовуйте :c:func:`PyUnicode_GetLength` або :c:macro:`PyUnicode_GET_LENGTH`

source: :c:macro:`Py_UNICODE_strcat`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
uk: :c:macro:`Py_UNICODE_strcat`: використовуйте :c:func:`PyUnicode_CopyCharacters` або :c:func:`PyUnicode_FromFormat`

source: :c:macro:`Py_UNICODE_strcpy`, :c:macro:`Py_UNICODE_strncpy`, :c:macro:`Py_UNICODE_COPY`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
uk: :c:macro:`Py_UNICODE_strcpy`, :c:macro:`Py_UNICODE_strncpy`, :c:macro:`Py_UNICODE_COPY`: використовуйте :c:func:`PyUnicode_CopyCharacters` або :c:func:`PyUnicode_Substring`

source: :c:macro:`Py_UNICODE_strcmp`: use :c:func:`PyUnicode_Compare`
uk: :c:macro:`Py_UNICODE_strcmp`: використовуйте :c:func:`PyUnicode_Compare`

source: :c:macro:`Py_UNICODE_strncmp`: use :c:func:`PyUnicode_Tailmatch`
uk: :c:macro:`Py_UNICODE_strncmp`: використовуйте :c:func:`PyUnicode_Tailmatch`

source: :c:macro:`Py_UNICODE_strchr`, :c:macro:`Py_UNICODE_strrchr`: use :c:func:`PyUnicode_FindChar`
uk: :c:macro:`Py_UNICODE_strchr`, :c:macro:`Py_UNICODE_strrchr`: використовуйте :c:func:`PyUnicode_FindChar`

source: :c:macro:`Py_UNICODE_FILL`: use :c:func:`PyUnicode_Fill`
uk: :c:macro:`Py_UNICODE_FILL`: використовуйте :c:func:`PyUnicode_Fill`

source: Encoders:
uk: Кодери:

source: :c:func:`PyUnicode_Encode`: use :c:func:`PyUnicode_AsEncodedObject`
uk: :c:func:`PyUnicode_Encode`: використовуйте :c:func:`PyUnicode_AsEncodedObject`

source: :c:func:`PyUnicode_EncodeUTF8`: use :c:func:`PyUnicode_AsUTF8` or :c:func:`PyUnicode_AsUTF8String`
uk: :c:func:`PyUnicode_EncodeUTF8`: використовуйте :c:func:`PyUnicode_AsUTF8` або :c:func:`PyUnicode_AsUTF8String`

source: :c:func:`PyUnicode_EncodeUnicodeEscape` use :c:func:`PyUnicode_AsUnicodeEscapeString`
uk: :c:func:`PyUnicode_EncodeUnicodeEscape` використовуйте :c:func:`PyUnicode_AsUnicodeEscapeString`

source: :c:func:`PyUnicode_EncodeRawUnicodeEscape` use :c:func:`PyUnicode_AsRawUnicodeEscapeString`
uk: :c:func:`PyUnicode_EncodeRawUnicodeEscape` використовуйте :c:func:`PyUnicode_AsRawUnicodeEscapeString`

source: :c:func:`PyUnicode_EncodeLatin1`: use :c:func:`PyUnicode_AsLatin1String`
uk: :c:func:`PyUnicode_EncodeLatin1`: використовуйте :c:func:`PyUnicode_AsLatin1String`

source: :c:func:`PyUnicode_EncodeASCII`: use :c:func:`PyUnicode_AsASCIIString`
uk: :c:func:`PyUnicode_EncodeASCII`: використовуйте :c:func:`PyUnicode_AsASCIIString`

source: :c:func:`PyUnicode_EncodeMBCS`: use :c:func:`PyUnicode_AsMBCSString` or :c:func:`PyUnicode_EncodeCodePage` (with ``CP_ACP`` code_page)
uk: :c:func:`PyUnicode_EncodeMBCS`: використовуйте :c:func:`PyUnicode_AsMBCSString` або :c:func:`PyUnicode_EncodeCodePage` (з ``CP_ACP`` code_page)

source: Deprecated features
uk: Застарілі функції

source: The :mod:`array` module's ``'u'`` format code is now deprecated and will be removed in Python 4 together with the rest of the (:c:type:`Py_UNICODE`) API.
uk: Код формату ``'u'`` модуля :mod:`array` тепер не підтримується та буде видалено в Python 4 разом з рештою (:c:type:`Py_UNICODE`) API.

source: Porting to Python 3.3
uk: Перенесення на Python 3.3

source: This section lists previously described changes and other bugfixes that may require changes to your code.
uk: У цьому розділі наведено описані раніше зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді.

source: Porting Python code
uk: Перенесення коду Python

source: Hash randomization is enabled by default. Set the :envvar:`PYTHONHASHSEED` environment variable to ``0`` to disable hash randomization. See also the :meth:`object.__hash__` method.
uk: Хеш-рандомізація ввімкнена за замовчуванням. Встановіть для змінної середовища :envvar:`PYTHONHASHSEED` значення ``0``, щоб вимкнути рандомізацію хешу. Дивіться також метод :meth:`object.__hash__`.

source: :issue:`12326`: On Linux, sys.platform doesn't contain the major version anymore. It is now always 'linux', instead of 'linux2' or 'linux3' depending on the Linux version used to build Python. Replace sys.platform == 'linux2' with sys.platform.startswith('linux'), or directly sys.platform == 'linux' if you don't need to support older Python versions.
uk: :issue:`12326`: У Linux sys.platform більше не містить основної версії. Тепер це завжди "linux", а не "linux2" або "linux3", залежно від версії Linux, яка використовується для створення Python. Замініть sys.platform == 'linux2' на sys.platform.startswith('linux') або безпосередньо sys.platform == 'linux', якщо вам не потрібна підтримка старіших версій Python.

source: :issue:`13847`, :issue:`14180`: :mod:`time` and :mod:`datetime`: :exc:`OverflowError` is now raised instead of :exc:`ValueError` if a timestamp is out of range. :exc:`OSError` is now raised if C functions :c:func:`gmtime` or :c:func:`localtime` failed.
uk: :issue:`13847`, :issue:`14180`: :mod:`time` і :mod:`datetime`: :exc:`OverflowError` тепер викликається замість :exc:`ValueError`, якщо немає позначки часу діапазону. :exc:`OSError` тепер виникає, якщо функції C :c:func:`gmtime` або :c:func:`localtime` не вдаються.

source: The default finders used by import now utilize a cache of what is contained within a specific directory. If you create a Python source file or sourceless bytecode file, make sure to call :func:`importlib.invalidate_caches` to clear out the cache for the finders to notice the new file.
uk: Засоби пошуку за умовчанням, які використовуються імпортом, тепер використовують кеш того, що міститься в певному каталозі. Якщо ви створюєте вихідний файл Python або файл байт-коду без вихідного коду, обов’язково викличте :func:`importlib.invalidate_caches`, щоб очистити кеш, щоб шукачі помітили новий файл.

source: :exc:`ImportError` now uses the full name of the module that was attempted to be imported. Doctests that check ImportErrors' message will need to be updated to use the full name of the module instead of just the tail of the name.
uk: :exc:`ImportError` тепер використовує повну назву модуля, який намагалися імпортувати. Доктести, які перевіряють повідомлення ImportErrors, потрібно буде оновити, щоб використовувати повну назву модуля, а не лише хвіст назви.

source: The *index* argument to :func:`__import__` now defaults to 0 instead of -1 and no longer support negative values. It was an oversight when :pep:`328` was implemented that the default value remained -1. If you need to continue to perform a relative import followed by an absolute import, then perform the relative import using an index of 1, followed by another import using an index of 0. It is preferred, though, that you use :func:`importlib.import_module` rather than call :func:`__import__` directly.
uk: Аргумент *index* для :func:`__import__` тепер має значення 0 замість -1 і більше не підтримує від’ємні значення. Коли :pep:`328` було реалізовано, це було помилкою, що значення за замовчуванням залишилося -1. Якщо вам потрібно продовжити виконання відносного імпорту з подальшим абсолютним імпортом, тоді виконайте відносний імпорт із використанням індексу 1, а потім ще один імпорт із використанням індексу 0. Однак бажано використовувати :func:`importlib.import_module` замість безпосереднього виклику :func:`__import__`.

source: :func:`__import__` no longer allows one to use an index value other than 0 for top-level modules. E.g. ``__import__('sys', level=1)`` is now an error.
uk: :func:`__import__` більше не дозволяє використовувати значення індексу, відмінне від 0, для модулів верхнього рівня. наприклад ``__import__('sys', level=1)`` тепер є помилкою.

source: Because :attr:`sys.meta_path` and :attr:`sys.path_hooks` now have finders on them by default, you will most likely want to use :meth:`list.insert` instead of :meth:`list.append` to add to those lists.
uk: Оскільки :attr:`sys.meta_path` і :attr:`sys.path_hooks` тепер мають засоби пошуку за замовчуванням, ви, швидше за все, захочете використовувати :meth:`list.insert` замість :meth:`list.append`, щоб додати до цих списків.

source: Because ``None`` is now inserted into :attr:`sys.path_importer_cache`, if you are clearing out entries in the dictionary of paths that do not have a finder, you will need to remove keys paired with values of ``None`` **and** :class:`imp.NullImporter` to be backwards-compatible. This will lead to extra overhead on older versions of Python that re-insert ``None`` into :attr:`sys.path_importer_cache` where it represents the use of implicit finders, but semantically it should not change anything.
uk: Оскільки ``None`` тепер вставлено в :attr:`sys.path_importer_cache`, якщо ви очищаєте записи в словнику шляхів, які не мають шукача, вам потрібно буде видалити ключі, поєднані зі значеннями ``None`` **і** :class:`imp.NullImporter` для зворотної сумісності. Це призведе до додаткових витрат на старіші версії Python, які повторно вставляють ``None`` у :attr:`sys.path_importer_cache`, де це означає використання неявних засобів пошуку, але семантично це не повинно нічого змінити.

source: :class:`importlib.abc.Finder` no longer specifies a `find_module()` abstract method that must be implemented. If you were relying on subclasses to implement that method, make sure to check for the method's existence first. You will probably want to check for `find_loader()` first, though, in the case of working with :term:`path entry finders <path entry finder>`.
uk: :class:`importlib.abc.Finder` більше не вказує абстрактний метод `find_module()`, який необхідно реалізувати. Якщо ви покладалися на підкласи для реалізації цього методу, переконайтеся, що спочатку перевірте існування методу. Ви, ймовірно, захочете спочатку перевірити `find_loader()` у випадку роботи з :term:`засобами пошуку записів шляху <path entry finder>`.

source: :mod:`pkgutil` has been converted to use :mod:`importlib` internally. This eliminates many edge cases where the old behaviour of the :pep:`302` import emulation failed to match the behaviour of the real import system. The import emulation itself is still present, but is now deprecated. The :func:`pkgutil.iter_importers` and :func:`pkgutil.walk_packages` functions special case the standard import hooks so they are still supported even though they do not provide the non-standard ``iter_modules()`` method.
uk: :mod:`pkgutil` було перетворено на використання :mod:`importlib` внутрішньо. Це усуває багато граничних випадків, коли стара поведінка емуляції імпорту :pep:`302` не збігалася з поведінкою реальної системи імпорту. Сама емуляція імпорту все ще присутня, але тепер не підтримується. Функції :func:`pkgutil.iter_importers` і :func:`pkgutil.walk_packages` представляють спеціальний варіант для стандартних хуків імпорту, тому вони все ще підтримуються, навіть якщо вони не забезпечують нестандартний метод ``iter_modules()``.

source: A longstanding RFC-compliance bug (:issue:`1079`) in the parsing done by :func:`email.header.decode_header` has been fixed. Code that uses the standard idiom to convert encoded headers into unicode (``str(make_header(decode_header(h))``) will see no change, but code that looks at the individual tuples returned by decode_header will see that whitespace that precedes or follows ``ASCII`` sections is now included in the ``ASCII`` section. Code that builds headers using ``make_header`` should also continue to work without change, since ``make_header`` continues to add whitespace between ``ASCII`` and non-``ASCII`` sections if it is not already present in the input strings.
uk: Виправлено давню помилку відповідності вимогам RFC (:issue:`1079`) у синтаксичному аналізі, виконаному :func:`email.header.decode_header`. Код, який використовує стандартну ідіому для перетворення закодованих заголовків у юнікод (``str(make_header(decode_header(h))``), не побачить жодних змін, але код, який переглядає окремі кортежі, повернуті decode_header, побачить пробіли, які передують або наступні розділи ``ASCII`` тепер включено в розділ ``ASCII``. Код, який створює заголовки за допомогою ``make_header``, також має продовжувати працювати без змін, оскільки ``make_header`` продовжує додавати пробіли між ``ASCII`` і не ``ASCII`` розділи, якщо вони ще не присутні у вхідних рядках.

source: :func:`email.utils.formataddr` now does the correct content transfer encoding when passed non-``ASCII`` display names. Any code that depended on the previous buggy behavior that preserved the non-``ASCII`` unicode in the formatted output string will need to be changed (:issue:`1690608`).
uk: :func:`email.utils.formataddr` тепер виконує правильне кодування передачі вмісту, коли передаються відображувані імена, відмінні від ``ASCII``. Будь-який код, який залежав від попередньої помилкової поведінки, яка зберігала не-``ASCII`` Юнікод у форматованому вихідному рядку, потрібно буде змінити (:issue:`1690608`).
