Repository: python/python-docs-uk
Catalog: whatsnew/3.4.po
Languages: uk

source: :mod:`importlib.util` has a new function :func:`~importlib.util.decode_source` that decodes source from bytes using universal newline processing. This is useful for implementing :meth:`.InspectLoader.get_source` methods.
uk: :mod:`importlib.util` має нову функцію :func:`~importlib.util.decode_source`, яка декодує джерело з байтів за допомогою універсальної обробки нового рядка. Це корисно для реалізації методів :meth:`.InspectLoader.get_source`.

source: :class:`importlib.machinery.ExtensionFileLoader` now has a :meth:`~importlib.machinery.ExtensionFileLoader.get_filename` method. This was inadvertently omitted in the original implementation. (Contributed by Eric Snow in :issue:`19152`.)
uk: :class:`importlib.machinery.ExtensionFileLoader` тепер має метод :meth:`~importlib.machinery.ExtensionFileLoader.get_filename`. Це було ненавмисно пропущено в початковій реалізації. (Надав Ерік Сноу в :issue:`19152`.)

source: inspect
uk: оглядати

source: The :mod:`inspect` module now offers a basic :ref:`command line interface <inspect-module-cli>` to quickly display source code and other information for modules, classes and functions. (Contributed by Claudiu Popa and Nick Coghlan in :issue:`18626`.)
uk: Модуль :mod:`inspect` тепер пропонує базовий :ref:`інтерфейс командного рядка <inspect-module-cli>` для швидкого відображення вихідного коду та іншої інформації для модулів, класів і функцій. (Надано Клаудіу Попою та Ніком Когланом у :issue:`18626`.)

source: :func:`~inspect.unwrap` makes it easy to unravel wrapper function chains created by :func:`functools.wraps` (and any other API that sets the ``__wrapped__`` attribute on a wrapper function). (Contributed by Daniel Urban, Aaron Iles and Nick Coghlan in :issue:`13266`.)
uk: :func:`~inspect.unwrap` полегшує розгадування ланцюжків функцій оболонки, створених :func:`functools.wraps` (та будь-яким іншим API, який встановлює атрибут ``__wrapped__`` для функції оболонки). (Надано Деніелом Урбаном, Аароном Айлзом і Ніком Когланом у :issue:`13266`.)

source: As part of the implementation of the new :mod:`enum` module, the :mod:`inspect` module now has substantially better support for custom ``__dir__`` methods and dynamic class attributes provided through metaclasses. (Contributed by Ethan Furman in :issue:`18929` and :issue:`19030`.)
uk: Як частина реалізації нового модуля :mod:`enum`, модуль :mod:`inspect` тепер має значно кращу підтримку користувацьких методів ``__dir__`` і атрибутів динамічного класу, що надаються через метакласи. (Надав Ітан Фурман у :issue:`18929` і :issue:`19030`.)

source: :func:`~inspect.getfullargspec` and :func:`~inspect.getargspec` now use the :func:`~inspect.signature` API. This allows them to support a much broader range of callables, including those with ``__signature__`` attributes, those with metadata provided by argument clinic, :func:`functools.partial` objects and more. Note that, unlike :func:`~inspect.signature`, these functions still ignore ``__wrapped__`` attributes, and report the already bound first argument for bound methods, so it is still necessary to update your code to use :func:`~inspect.signature` directly if those features are desired. (Contributed by Yury Selivanov in :issue:`17481`.)
uk: :func:`~inspect.getfullargspec` і :func:`~inspect.getargspec` тепер використовують API :func:`~inspect.signature`. Це дозволяє їм підтримувати набагато ширший діапазон викликів, включаючи ті, що мають атрибути ``__signature__``, ті, що мають метадані, надані клінікою аргументів, об’єкти :func:`functools.partial` тощо. Зауважте, що, на відміну від :func:`~inspect.signature`, ці функції все ще ігнорують атрибути ``__wrapped__`` і повідомляють про вже прив’язаний перший аргумент для прив’язаних методів, тому все одно необхідно оновити свій код, щоб використовувати :func:`~inspect.signature` безпосередньо, якщо ці функції потрібні. (Надав Юрій Селіванов у :issue:`17481`.)

source: :func:`~inspect.signature` now supports duck types of CPython functions, which adds support for functions compiled with Cython. (Contributed by Stefan Behnel and Yury Selivanov in :issue:`17159`.)
uk: :func:`~inspect.signature` тепер підтримує типи качок функцій CPython, що додає підтримку функцій, скомпільованих за допомогою Cython. (Надано Стефаном Бенелем і Юрієм Селівановим у :issue:`17159`.)

source: ipaddress
uk: IP-адреса

source: :mod:`ipaddress` was added to the standard library in Python 3.3 as a :term:`provisional API`. With the release of Python 3.4, this qualification has been removed: :mod:`ipaddress` is now considered a stable API, covered by the normal standard library requirements to maintain backwards compatibility.
uk: :mod:`ipaddress` було додано до стандартної бібліотеки в Python 3.3 як :term:`provisional API`. З випуском Python 3.4 цю кваліфікацію було видалено: :mod:`ipaddress` тепер вважається стабільним API, охопленим нормальними стандартними вимогами бібліотеки для підтримки зворотної сумісності.

source: A new :attr:`~ipaddress.IPv4Address.is_global` property is ``True`` if an address is globally routeable. (Contributed by Peter Moody in :issue:`17400`.)
uk: Нова властивість :attr:`~ipaddress.IPv4Address.is_global` має значення ``True``, якщо адресу можна глобально маршрутизувати. (Надав Пітер Муді в :issue:`17400`.)

source: logging
uk: лісозаготівля

source: The :class:`~logging.handlers.TimedRotatingFileHandler` has a new *atTime* parameter that can be used to specify the time of day when rollover should happen. (Contributed by Ronald Oussoren in :issue:`9556`.)
uk: :class:`~logging.handlers.TimedRotatingFileHandler` має новий параметр *atTime*, за допомогою якого можна вказати час доби, коли має відбутися ролловер. (Надав Рональд Оуссорен у :issue:`9556`.)

source: :class:`~logging.handlers.SocketHandler` and :class:`~logging.handlers.DatagramHandler` now support Unix domain sockets (by setting *port* to ``None``). (Contributed by Vinay Sajip in commit ce46195b56a9.)
uk: :class:`~logging.handlers.SocketHandler` і :class:`~logging.handlers.DatagramHandler` тепер підтримують сокети домену Unix (встановивши *port* на ``None``). (Надано Вінаєм Саджипом у коміті ce46195b56a9.)

source: :func:`~logging.config.fileConfig` now accepts a :class:`configparser.RawConfigParser` subclass instance for the *fname* parameter. This facilitates using a configuration file when logging configuration is just a part of the overall application configuration, or where the application modifies the configuration before passing it to :func:`~logging.config.fileConfig`. (Contributed by Vinay Sajip in :issue:`16110`.)
uk: :func:`~logging.config.fileConfig` тепер приймає екземпляр підкласу :class:`configparser.RawConfigParser` для параметра *fname*. Це полегшує використання файлу конфігурації, коли конфігурація журналювання є лише частиною загальної конфігурації програми або коли програма змінює конфігурацію перед передачею її в :func:`~logging.config.fileConfig`. (Надав Віней Саджип у :issue:`16110`.)

source: Logging configuration data received from a socket via the :func:`logging.config.listen` function can now be validated before being processed by supplying a verification function as the argument to the new *verify* keyword argument. (Contributed by Vinay Sajip in :issue:`15452`.)
uk: Дані конфігурації журналу, отримані з сокета через функцію :func:`logging.config.listen`, тепер можна перевірити перед обробкою, надаючи функцію перевірки як аргумент для нового аргументу ключового слова *verify*. (Надав Віней Саджип у :issue:`15452`.)

source: marshal
uk: маршал

source: The default :mod:`marshal` version has been bumped to 3. The code implementing the new version restores the Python2 behavior of recording only one copy of interned strings and preserving the interning on deserialization, and extends this "one copy" ability to any object type (including handling recursive references). This reduces both the size of ``.pyc`` files and the amount of memory a module occupies in memory when it is loaded from a ``.pyc`` (or ``.pyo``) file. (Contributed by Kristján Valur Jónsson in :issue:`16475`, with additional speedups by Antoine Pitrou in :issue:`19219`.)
uk: Версію :mod:`marshal` за замовчуванням було збільшено до 3. Код, що реалізує нову версію, відновлює поведінку Python2 щодо запису лише однієї копії інтернованих рядків і збереження інтернінгу під час десеріалізації, а також розширює цю можливість "однієї копії" на будь-які тип об’єкта (включаючи обробку рекурсивних посилань). Це зменшує як розмір файлів ``.pyc``, так і обсяг пам’яті, який модуль займає в пам’яті, коли він завантажується з файлу ``.pyc`` (або ``.pyo``). (Надав Крістіан Валур Йонссон у :issue:`16475`, з додатковими прискореннями Антуаном Пітру в :issue:`19219`.)

source: mmap objects can now be :mod:`weakref`\ ed. (Contributed by Valerie Lambert in :issue:`4885`.)
uk: Об’єкти mmap тепер можна мають властивість :mod:`weakref`. (Додано Valerie Lambert в :issue:`4885`.)

source: multiprocessing
uk: багатопроцесорність

source: On Unix two new :ref:`start methods <multiprocessing-start-methods>`, ``spawn`` and ``forkserver``, have been added for starting processes using :mod:`multiprocessing`. These make the mixing of processes with threads more robust, and the ``spawn`` method matches the semantics that multiprocessing has always used on Windows. New function :func:`~multiprocessing.get_all_start_methods` reports all start methods available on the platform, :func:`~multiprocessing.get_start_method` reports the current start method, and :func:`~multiprocessing.set_start_method` sets the start method. (Contributed by Richard Oudkerk in :issue:`8713`.)
uk: В Unix два нові :ref:`методи запуску <multiprocessing-start-methods>`, ``spawn`` і ``forkserver``, були додані для запуску процесів за допомогою :mod:`multiprocessing`. Це робить змішування процесів із потоками більш надійним, а метод ``spawn`` відповідає семантиці, яку багатопроцесорність завжди використовувала в Windows. Нова функція :func:`~multiprocessing.get_all_start_methods` повідомляє про всі методи запуску, доступні на платформі, :func:`~multiprocessing.get_start_method` повідомляє поточний метод запуску, а :func:`~multiprocessing.set_start_method` встановлює метод запуску. (Надав Річард Оудкерк у :issue:`8713`.)

source: :mod:`multiprocessing` also now has the concept of a ``context``, which determines how child processes are created. New function :func:`~multiprocessing.get_context` returns a context that uses a specified start method. It has the same API as the :mod:`multiprocessing` module itself, so you can use it to create :class:`~multiprocessing.pool.Pool`\ s and other objects that will operate within that context. This allows a framework and an application or different parts of the same application to use multiprocessing without interfering with each other. (Contributed by Richard Oudkerk in :issue:`18999`.)
uk: :mod:`multiprocessing` також тепер має концепцію ``контексту``, який визначає, як створюються дочірні процеси. Нова функція :func:`~multiprocessing.get_context` повертає контекст, який використовує вказаний метод запуску. Він має той самий API, що й сам модуль :mod:`multiprocessing`, тож ви можете використовувати його для створення :class:`~multiprocessing.pool.Pool`\ та інших об’єктів, які працюватимуть у цьому контексті. Це дозволяє інфраструктурі та програмі або різним частинам однієї програми використовувати багатопроцесорність, не заважаючи одна одній. (Надав Річард Оудкерк у :issue:`18999`.)

source: Except when using the old *fork* start method, child processes no longer inherit unneeded handles/file descriptors from their parents (part of :issue:`8713`).
uk: За винятком використання старого методу запуску *fork*, дочірні процеси більше не успадковують непотрібні дескриптори/дескриптори файлів від своїх батьків (частина :issue:`8713`).

source: :mod:`multiprocessing` now relies on :mod:`runpy` (which implements the ``-m`` switch) to initialise ``__main__`` appropriately in child processes when using the ``spawn`` or ``forkserver`` start methods. This resolves some edge cases where combining multiprocessing, the ``-m`` command line switch, and explicit relative imports could cause obscure failures in child processes. (Contributed by Nick Coghlan in :issue:`19946`.)
uk: :mod:`multiprocessing` тепер покладається на :mod:`runpy` (який реалізує перемикач ``-m``), щоб належним чином ініціалізувати ``__main__`` у дочірніх процесах під час використання ``spawn`` або ``forkserver`` методи запуску. Це вирішує деякі граничні випадки, коли поєднання багатопроцесорності, перемикача командного рядка ``-m`` і явного відносного імпорту може спричинити незрозумілі збої в дочірніх процесах. (Надав Нік Коглан у :issue:`19946`.)

source: operator
uk: оператор

source: New function :func:`~operator.length_hint` provides an implementation of the specification for how the :meth:`~object.__length_hint__` special method should be used, as part of the :pep:`424` formal specification of this language feature. (Contributed by Armin Ronacher in :issue:`16148`.)
uk: Нова функція :func:`~operator.length_hint` забезпечує реалізацію специфікації того, як слід використовувати спеціальний метод :meth:`~object.__length_hint__` як частину :pep:`424` формальної специфікації цієї мови функція. (Надав Армін Роначер у :issue:`16148`.)

source: There is now a pure-python version of the :mod:`operator` module available for reference and for use by alternate implementations of Python. (Contributed by Zachary Ware in :issue:`16694`.)
uk: Тепер існує чиста версія модуля :mod:`operator` на Python, доступна для довідки та для використання в альтернативних реалізаціях Python. (Надано Zachary Ware у :issue:`16694`.)

source: os
uk: ос

source: There are new functions to get and set the :ref:`inheritable flag <fd_inheritance>` of a file descriptor (:func:`os.get_inheritable`, :func:`os.set_inheritable`) or a Windows handle (:func:`os.get_handle_inheritable`, :func:`os.set_handle_inheritable`).
uk: Є нові функції для отримання та встановлення :ref:`inheritable flag <fd_inheritance>` файлового дескриптора (:func:`os.get_inheritable`, :func:`os.set_inheritable`) або маркера Windows (:func:`os .get_handle_inheritable`, :func:`os.set_handle_inheritable`).

source: New function :func:`~os.cpu_count` reports the number of CPUs available on the platform on which Python is running (or ``None`` if the count can't be determined). The :func:`multiprocessing.cpu_count` function is now implemented in terms of this function). (Contributed by Trent Nelson, Yogesh Chaudhari, Victor Stinner, and Charles-François Natali in :issue:`17914`.)
uk: Нова функція :func:`~os.cpu_count` повідомляє кількість ЦП, доступних на платформі, на якій працює Python (або ``None``, якщо кількість не може бути визначена). Функція :func:`multiprocessing.cpu_count` тепер реалізована в термінах цієї функції). (Надано Трентом Нельсоном, Йогешем Чаудхарі, Віктором Стіннером і Чарльзом-Франсуа Наталі в :issue:`17914`.)

source: :func:`os.path.samestat` is now available on the Windows platform (and the :func:`os.path.samefile` implementation is now shared between Unix and Windows). (Contributed by Brian Curtin in :issue:`11939`.)
uk: :func:`os.path.samestat` тепер доступний на платформі Windows (і реалізація :func:`os.path.samefile` тепер спільно використовується між Unix і Windows). (Надав Браян Кертін у :issue:`11939`.)

source: :func:`os.path.ismount` now recognizes volumes mounted below a drive root on Windows. (Contributed by Tim Golden in :issue:`9035`.)
uk: :func:`os.path.ismount` тепер розпізнає томи, змонтовані нижче кореня диска в Windows. (Надав Тім Голден у :issue:`9035`.)

source: :func:`os.open` supports two new flags on platforms that provide them, :data:`~os.O_PATH` (un-opened file descriptor), and :data:`~os.O_TMPFILE` (unnamed temporary file; as of 3.4.0 release available only on Linux systems with a kernel version of 3.11 or newer that have uapi headers). (Contributed by Christian Heimes in :issue:`18673` and Benjamin Peterson, respectively.)
uk: :func:`os.open` підтримує два нові позначки на платформах, які їх надають, :data:`~os.O_PATH` (дескриптор невідкритого файлу) і :data:`~os.O_TMPFILE` (тимчасовий файл без назви; починаючи з випуску 3.4.0, доступного лише в системах Linux із версією ядра 3.11 або новішою, які мають заголовки uapi). (Надано Крістіаном Хеймсом у :issue:`18673` та Бенджаміном Петерсоном відповідно.)

source: :mod:`pdb` has been enhanced to handle generators, :keyword:`yield`, and ``yield from`` in a more useful fashion. This is especially helpful when debugging :mod:`asyncio` based programs. (Contributed by Andrew Svetlov and Xavier de Gaye in :issue:`16596`.)
uk: :mod:`pdb` було вдосконалено, щоб працювати з генераторами, :keyword:`yield` і ``yield from`` більш корисним способом. Це особливо корисно під час налагодження програм на основі :mod:`asyncio`. (Надано Ендрю Свєтловим і Ксав’є де Гає в :issue:`16596`.)

source: The ``print`` command has been removed from :mod:`pdb`, restoring access to the Python :func:`print` function from the pdb command line. Python2's ``pdb`` did not have a ``print`` command; instead, entering ``print`` executed the ``print`` statement. In Python3 ``print`` was mistakenly made an alias for the pdb :pdbcmd:`p` command. ``p``, however, prints the ``repr`` of its argument, not the ``str`` like the Python2 ``print`` command did. Worse, the Python3 ``pdb print`` command shadowed the Python3 ``print`` function, making it inaccessible at the ``pdb`` prompt. (Contributed by Connor Osborn in :issue:`18764`.)
uk: Команду ``print`` видалено з :mod:`pdb`, відновивши доступ до функції :func:`print` Python з командного рядка pdb. ``pdb`` Python2 не мав команди ``print``; натомість введення ``print`` виконувало оператор ``print``. У Python3 ``print`` було помилково зроблено псевдонімом для команди pdb :pdbcmd:`p`. Проте ``p`` друкує ``repr`` свого аргументу, а не ``str``, як це робила команда ``print`` Python2. Гірше того, команда Python3 ``pdb print`` затьмарювала функцію ``print`` Python3, роблячи її недоступною у підказці ``pdb``. (Надав Коннор Осборн у :issue:`18764`.)

source: pickle
uk: маринований огірок

source: :mod:`pickle` now supports (but does not use by default) a new pickle protocol, protocol 4. This new protocol addresses a number of issues that were present in previous protocols, such as the serialization of nested classes, very large strings and containers, and classes whose :meth:`__new__` method takes keyword-only arguments. It also provides some efficiency improvements.
uk: :mod:`pickle` тепер підтримує (але не використовує за замовчуванням) новий протокол pickle, протокол 4. Цей новий протокол вирішує ряд проблем, які були присутні в попередніх протоколах, таких як серіалізація вкладених класів, дуже великі рядки і контейнери, і класи, чий метод :meth:`__new__` приймає лише ключові аргументи. Це також забезпечує деякі покращення ефективності.

source: :pep:`3154` -- Pickle protocol 4
uk: :pep:`3154` -- Протокол Pickle 4

source: PEP written by Antoine Pitrou and implemented by Alexandre Vassalotti.
uk: PEP, написаний Антуаном Пітру та реалізований Александром Вассалотті.

source: :mod:`plistlib` now has an API that is similar to the standard pattern for stdlib serialization protocols, with new :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads`, and :func:`~plistlib.dumps` functions. (The older API is now deprecated.) In addition to the already supported XML plist format (:data:`~plistlib.FMT_XML`), it also now supports the binary plist format (:data:`~plistlib.FMT_BINARY`). (Contributed by Ronald Oussoren and others in :issue:`14455`.)
uk: :mod:`plistlib` тепер має API, подібний до стандартного шаблону для протоколів серіалізації stdlib, з новими :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib функції .loads` і :func:`~plistlib.dumps`. (Старіший API тепер не підтримується.) На додаток до вже підтримуваного формату XML plist (:data:`~plistlib.FMT_XML`), він також підтримує двійковий формат plist (:data:`~plistlib.FMT_BINARY`). (Надано Рональдом Оуссореном та іншими в :issue:`14455`.)

source: poplib
uk: попліб

source: Two new methods have been added to :mod:`poplib`: :meth:`~poplib.POP3.capa`, which returns the list of capabilities advertised by the POP server, and :meth:`~poplib.POP3.stls`, which switches a clear-text POP3 session into an encrypted POP3 session if the POP server supports it. (Contributed by Lorenzo Catucci in :issue:`4473`.)
uk: До :mod:`poplib`: :meth:`~poplib.POP3.capa` додано два нові методи, які повертають список можливостей, рекламованих сервером POP, і :meth:`~poplib.POP3.stls` , який перемикає сеанс POP3 із відкритим текстом на зашифрований сеанс POP3, якщо сервер POP це підтримує. (Надав Лоренцо Катуччі в :issue:`4473`.)

source: The :mod:`pprint` module's :class:`~pprint.PrettyPrinter` class and its :func:`~pprint.pformat`, and :func:`~pprint.pprint` functions have a new option, *compact*, that controls how the output is formatted. Currently setting *compact* to ``True`` means that sequences will be printed with as many sequence elements as will fit within *width* on each (indented) line. (Contributed by Serhiy Storchaka in :issue:`19132`.)
uk: Клас :class:`~pprint.PrettyPrinter` модуля :mod:`pprint` і його функції :func:`~pprint.pformat` і :func:`~pprint.pprint` мають новий параметр, *compact*, який керує форматуванням виводу. Наразі встановлення *compact* на ``True`` означає, що послідовності будуть надруковані з такою кількістю елементів послідовності, скільки вміщуватиметься в межах *ширини* на кожному (з відступом) рядку. (Надав Сергій Сторчака в :issue:`19132`.)

source: Long strings are now wrapped using Python's normal line continuation syntax. (Contributed by Antoine Pitrou in :issue:`17150`.)
uk: Довгі рядки тепер обертаються за допомогою звичайного синтаксису продовження рядка Python. (Надав Антуан Пітру в :issue:`17150`.)

source: :func:`pty.spawn` now returns the status value from :func:`os.waitpid` on the child process, instead of ``None``. (Contributed by Gregory P. Smith.)
uk: :func:`pty.spawn` тепер повертає значення стану з :func:`os.waitpid` дочірнього процесу замість ``None``. (Надав Грегорі П. Сміт.)

source: The :mod:`pydoc` module is now based directly on the :func:`inspect.signature` introspection API, allowing it to provide signature information for a wider variety of callable objects. This change also means that ``__wrapped__`` attributes are now taken into account when displaying help information. (Contributed by Larry Hastings in :issue:`19674`.)
uk: Модуль :mod:`pydoc` тепер базується безпосередньо на API інтроспекції :func:`inspect.signature`, що дозволяє йому надавати інформацію про підпис для більшої кількості викликаних об’єктів. Ця зміна також означає, що атрибути ``__wrapped__`` тепер враховуються під час відображення довідкової інформації. (Надано Ларрі Гастінгсом у :issue:`19674`.)

source: The :mod:`pydoc` module no longer displays the ``self`` parameter for already bound methods. Instead, it aims to always display the exact current signature of the supplied callable. (Contributed by Larry Hastings in :issue:`20710`.)
uk: Модуль :mod:`pydoc` більше не відображає параметр ``self`` для вже зв’язаних методів. Замість цього він прагне завжди відображати точний поточний підпис наданого виклику. (Надано Ларрі Гастінгсом у :issue:`20710`.)
