Repository: python/python-docs-uk
Catalog: whatsnew/3.4.po
Languages: uk

source: In addition to the changes that have been made to :mod:`pydoc` directly, its handling of custom ``__dir__`` methods and various descriptor behaviours has also been improved substantially by the underlying changes in the :mod:`inspect` module.
uk: На додаток до змін, внесених безпосередньо до :mod:`pydoc`, його обробка користувацьких методів ``__dir__`` і різноманітна поведінка дескрипторів також була суттєво покращена завдяки базовим змінам у модулі :mod:`inspect` .

source: As the :func:`help` builtin is based on :mod:`pydoc`, the above changes also affect the behaviour of :func:`help`.
uk: Оскільки вбудований :func:`help` базується на :mod:`pydoc`, наведені вище зміни також впливають на поведінку :func:`help`.

source: re
uk: повторно

source: New :func:`~re.fullmatch` function and :meth:`.regex.fullmatch` method anchor the pattern at both ends of the string to match. This provides a way to be explicit about the goal of the match, which avoids a class of subtle bugs where ``$`` characters get lost during code changes or the addition of alternatives to an existing regular expression. (Contributed by Matthew Barnett in :issue:`16203`.)
uk: Нова функція :func:`~re.fullmatch` і метод :meth:`.regex.fullmatch` закріплюють шаблон на обох кінцях рядка для відповідності. Це дає можливість чітко вказати мету збігу, що дозволяє уникнути класу непомітних помилок, через які символи ``$`` губляться під час змін коду або додавання альтернатив до існуючого регулярного виразу. (Надав Метью Барнетт у :issue:`16203`.)

source: The repr of :ref:`regex objects <re-objects>` now includes the pattern and the flags; the repr of :ref:`match objects <match-objects>` now includes the start, end, and the part of the string that matched. (Contributed by Hugo Lopes Tavares and Serhiy Storchaka in :issue:`13592` and :issue:`17087`.)
uk: Repr :ref:`regex об’єктів <re-objects>` тепер включає шаблон і прапори; repr :ref:`match objects <match-objects>` тепер включає початок, кінець і частину рядка, що збігається. (Надано Уго Лопесом Таваресом і Сергієм Сторчакою в :issue:`13592` і :issue:`17087`.)

source: resource
uk: ресурс

source: New :func:`~resource.prlimit` function, available on Linux platforms with a kernel version of 2.6.36 or later and glibc of 2.13 or later, provides the ability to query or set the resource limits for processes other than the one making the call. (Contributed by Christian Heimes in :issue:`16595`.)
uk: Нова функція :func:`~resource.prlimit`, доступна на платформах Linux із версією ядра 2.6.36 або новішою та glibc 2.13 або новішою, надає можливість запитувати або встановлювати обмеження ресурсів для процесів, відмінних від того, що створює виклик. (Надав Крістіан Хеймс у :issue:`16595`.)

source: On Linux kernel version 2.6.36 or later, there are also some new Linux specific constants: :attr:`~resource.RLIMIT_MSGQUEUE`, :attr:`~resource.RLIMIT_NICE`, :attr:`~resource.RLIMIT_RTPRIO`, :attr:`~resource.RLIMIT_RTTIME`, and :attr:`~resource.RLIMIT_SIGPENDING`. (Contributed by Christian Heimes in :issue:`19324`.)
uk: У ядрі Linux версії 2.6.36 або пізнішої також є деякі нові специфічні константи Linux: :attr:`~resource.RLIMIT_MSGQUEUE`, :attr:`~resource.RLIMIT_NICE`, :attr:`~resource.RLIMIT_RTPRIO`, :attr:`~resource.RLIMIT_RTTIME` і :attr:`~resource.RLIMIT_SIGPENDING`. (Надав Крістіан Хеймс у :issue:`19324`.)

source: On FreeBSD version 9 and later, there some new FreeBSD specific constants: :attr:`~resource.RLIMIT_SBSIZE`, :attr:`~resource.RLIMIT_SWAP`, and :attr:`~resource.RLIMIT_NPTS`. (Contributed by Claudiu Popa in :issue:`19343`.)
uk: У FreeBSD версії 9 і пізніших є деякі нові специфічні константи FreeBSD: :attr:`~resource.RLIMIT_SBSIZE`, :attr:`~resource.RLIMIT_SWAP` і :attr:`~resource.RLIMIT_NPTS`. (Надав Клаудіу Попа в :issue:`19343`.)

source: select
uk: вибрати

source: :class:`~select.epoll` objects now support the context management protocol. When used in a :keyword:`with` statement, the :meth:`~select.epoll.close` method will be called automatically at the end of the block. (Contributed by Serhiy Storchaka in :issue:`16488`.)
uk: Об’єкти :class:`~select.epoll` тепер підтримують протокол керування контекстом. При використанні в операторі :keyword:`with` метод :meth:`~select.epoll.close` буде викликано автоматично в кінці блоку. (Надав Сергій Сторчака в :issue:`16488`.)

source: :class:`~select.devpoll` objects now have :meth:`~select.devpoll.fileno` and :meth:`~select.devpoll.close` methods, as well as a new attribute :attr:`~select.devpoll.closed`. (Contributed by Victor Stinner in :issue:`18794`.)
uk: Об’єкти :class:`~select.devpoll` тепер мають методи :meth:`~select.devpoll.fileno` і :meth:`~select.devpoll.close`, а також новий атрибут :attr:`~select. devpoll.closed`. (Надав Віктор Стіннер у :issue:`18794`.)

source: shelve
uk: полиця

source: :class:`~shelve.Shelf` instances may now be used in :keyword:`with` statements, and will be automatically closed at the end of the :keyword:`!with` block. (Contributed by Filip Gruszczyński in :issue:`13896`.)
uk: Екземпляри :class:`~shelve.Shelf` тепер можна використовувати в операторах :keyword:`with` і автоматично закриватимуться в кінці блоку :keyword:`!with`. (Надав Філіп Грущинський у :issue:`13896`.)

source: shutil
uk: шутил

source: :func:`~shutil.copyfile` now raises a specific :exc:`~shutil.Error` subclass, :exc:`~shutil.SameFileError`, when the source and destination are the same file, which allows an application to take appropriate action on this specific error. (Contributed by Atsuo Ishimoto and Hynek Schlawack in :issue:`1492704`.)
uk: :func:`~shutil.copyfile` тепер створює певний підклас :exc:`~shutil.Error`, :exc:`~shutil.SameFileError`, коли джерело та місце призначення є тим самим файлом, що дозволяє програмі приймати відповідні дії щодо цієї конкретної помилки. (Надано Atsuo Ishimoto та Hynek Schlawack у :issue:`1492704`.)

source: The :class:`~smtpd.SMTPServer` and :class:`~smtpd.SMTPChannel` classes now accept a *map* keyword argument which, if specified, is passed in to :class:`asynchat.async_chat` as its *map* argument. This allows an application to avoid affecting the global socket map. (Contributed by Vinay Sajip in :issue:`11959`.)
uk: Класи :class:`~smtpd.SMTPServer` і :class:`~smtpd.SMTPChannel` тепер приймають аргумент ключового слова *map*, який, якщо вказано, передається в :class:`asynchat.async_chat` як його *map* аргумент. Це дозволяє програмі уникнути впливу на глобальну карту сокетів. (Надав Віней Саджип у :issue:`11959`.)

source: :exc:`~smtplib.SMTPException` is now a subclass of :exc:`OSError`, which allows both socket level errors and SMTP protocol level errors to be caught in one try/except statement by code that only cares whether or not an error occurred. (Contributed by Ned Jackson Lovely in :issue:`2118`.)
uk: :exc:`~smtplib.SMTPException` тепер є підкласом :exc:`OSError`, який дозволяє перехоплювати помилки рівня сокета та протоколу SMTP одним оператором try/except за допомогою коду, який дбає лише про те, чи сталася помилка. (Надав Нед Джексон Лавлі в :issue:`2118`.)

source: socket
uk: гніздо

source: The socket module now supports the :data:`~socket.CAN_BCM` protocol on platforms that support it. (Contributed by Brian Thorne in :issue:`15359`.)
uk: Модуль сокета тепер підтримує протокол :data:`~socket.CAN_BCM` на платформах, які його підтримують. (Надав Браян Торн у :issue:`15359`.)

source: Socket objects have new methods to get or set their :ref:`inheritable flag <fd_inheritance>`, :meth:`~socket.socket.get_inheritable` and :meth:`~socket.socket.set_inheritable`.
uk: Об’єкти Socket мають нові методи отримання або встановлення свого :ref:`inheritable flag <fd_inheritance>`, :meth:`~socket.socket.get_inheritable` та :meth:`~socket.socket.set_inheritable`.

source: The ``socket.AF_*`` and ``socket.SOCK_*`` constants are now enumeration values using the new :mod:`enum` module. This allows meaningful names to be printed during debugging, instead of integer "magic numbers".
uk: Константи ``socket.AF_*`` і ``socket.SOCK_*`` тепер є значеннями перерахування за допомогою нового модуля :mod:`enum`. Це дозволяє друкувати осмислені імена під час налагодження замість цілих "магічних чисел".

source: The :data:`~socket.AF_LINK` constant is now available on BSD and OSX.
uk: Константа :data:`~socket.AF_LINK` тепер доступна в BSD і OSX.

source: :func:`~socket.inet_pton` and :func:`~socket.inet_ntop` are now supported on Windows. (Contributed by Atsuo Ishimoto in :issue:`7171`.)
uk: :func:`~socket.inet_pton` і :func:`~socket.inet_ntop` тепер підтримуються в Windows. (Надав Ацуо Ісімото в :issue:`7171`.)

source: A new boolean parameter to the :func:`~sqlite3.connect` function, *uri*, can be used to indicate that the *database* parameter is a ``uri`` (see the `SQLite URI documentation <https://www.sqlite.org/uri.html>`_). (Contributed by poq in :issue:`13773`.)
uk: Новий логічний параметр функції :func:`~sqlite3.connect`, *uri*, можна використовувати, щоб вказати, що параметр *database* є ``uri`` (див. `документацію SQLite URI <https://www.sqlite.org/uri.html>`_) . (Надано poq у :issue:`13773`.)

source: :data:`~ssl.PROTOCOL_TLSv1_1` and :data:`~ssl.PROTOCOL_TLSv1_2` (TLSv1.1 and TLSv1.2 support) have been added; support for these protocols is only available if Python is linked with OpenSSL 1.0.1 or later. (Contributed by Michele Orrù and Antoine Pitrou in :issue:`16692`.)
uk: Додано :data:`~ssl.PROTOCOL_TLSv1_1` і :data:`~ssl.PROTOCOL_TLSv1_2` (підтримка TLSv1.1 і TLSv1.2); підтримка цих протоколів доступна, лише якщо Python пов’язано з OpenSSL 1.0.1 або новішої версії. (Надано Мікеле Орру та Антуаном Пітру в :issue:`16692`.)

source: New function :func:`~ssl.create_default_context` provides a standard way to obtain an :class:`~ssl.SSLContext` whose settings are intended to be a reasonable balance between compatibility and security. These settings are more stringent than the defaults provided by the :class:`~ssl.SSLContext` constructor, and may be adjusted in the future, without prior deprecation, if best-practice security requirements change. The new recommended best practice for using stdlib libraries that support SSL is to use :func:`~ssl.create_default_context` to obtain an :class:`~ssl.SSLContext` object, modify it if needed, and then pass it as the *context* argument of the appropriate stdlib API. (Contributed by Christian Heimes in :issue:`19689`.)
uk: Нова функція :func:`~ssl.create_default_context` надає стандартний спосіб отримати :class:`~ssl.SSLContext`, налаштування якого створюють розумний баланс між сумісністю та безпекою. Ці параметри суворіші, ніж стандартні, надані конструктором :class:`~ssl.SSLContext`, і можуть бути скориговані в майбутньому без попереднього припинення підтримки, якщо зміняться найкращі вимоги безпеки. Нова рекомендована найкраща практика використання бібліотек stdlib, які підтримують SSL, полягає в тому, щоб використовувати :func:`~ssl.create_default_context` для отримання об’єкта :class:`~ssl.SSLContext`, змінювати його за потреби, а потім передавати як *аргумент context* відповідного API stdlib. (Надав Крістіан Хаймес у :issue:`19689`.)

source: :class:`~ssl.SSLContext` method :meth:`~ssl.SSLContext.load_verify_locations` accepts a new optional argument *cadata*, which can be used to provide PEM or DER encoded certificates directly via strings or bytes, respectively. (Contributed by Christian Heimes in :issue:`18138`.)
uk: :class:`~ssl.SSLContext` метод :meth:`~ssl.SSLContext.load_verify_locations` приймає новий необов’язковий аргумент *cadata*, який можна використовувати для надання сертифікатів у кодуванні PEM або DER безпосередньо через рядки або байти відповідно. (Надав Крістіан Хеймс у :issue:`18138`.)

source: New function :func:`~ssl.get_default_verify_paths` returns a named tuple of the paths and environment variables that the :meth:`~ssl.SSLContext.set_default_verify_paths` method uses to set OpenSSL's default ``cafile`` and ``capath``. This can be an aid in debugging default verification issues. (Contributed by Christian Heimes in :issue:`18143`.)
uk: Нова функція :func:`~ssl.get_default_verify_paths` повертає іменований кортеж шляхів і змінних середовища, які метод :meth:`~ssl.SSLContext.set_default_verify_paths` використовує для встановлення стандартних OpenSSL ``cafile`` і ``capath``. Це може допомогти у вирішенні проблем перевірки за замовчуванням. (Надав Крістіан Хеймс у :issue:`18143`.)

source: :class:`~ssl.SSLContext` has a new method, :meth:`~ssl.SSLContext.cert_store_stats`, that reports the number of loaded ``X.509`` certs, ``X.509 CA`` certs, and certificate revocation lists (``crl``\ s), as well as a :meth:`~ssl.SSLContext.get_ca_certs` method that returns a list of the loaded ``CA`` certificates. (Contributed by Christian Heimes in :issue:`18147`.)
uk: :class:`~ssl.SSLContext` має новий метод, :meth:`~ssl.SSLContext.cert_store_stats`, який повідомляє кількість завантажених сертифікатів ``X.509``, ``X.509 CA`` сертифікатів і списки відкликаних сертифікатів (``crl``\ s), а також метод :meth:`~ssl.SSLContext.get_ca_certs`, який повертає список завантажених сертифікатів ``CA``. (Надав Крістіан Хеймс у :issue:`18147`.)

source: If OpenSSL 0.9.8 or later is available, :class:`~ssl.SSLContext` has a new attribute :attr:`~ssl.SSLContext.verify_flags` that can be used to control the certificate verification process by setting it to some combination of the new constants :data:`~ssl.VERIFY_DEFAULT`, :data:`~ssl.VERIFY_CRL_CHECK_LEAF`, :data:`~ssl.VERIFY_CRL_CHECK_CHAIN`, or :data:`~ssl.VERIFY_X509_STRICT`. OpenSSL does not do any CRL verification by default. (Contributed by Christien Heimes in :issue:`8813`.)
uk: Якщо доступний OpenSSL 0.9.8 або новішої версії, :class:`~ssl.SSLContext` має новий атрибут :attr:`~ssl.SSLContext.verify_flags`, який можна використовувати для керування процесом перевірки сертифіката, установивши для нього певну комбінацію нових констант :data:`~ssl.VERIFY_DEFAULT`, :data:`~ssl.VERIFY_CRL_CHECK_LEAF`, :data:`~ssl.VERIFY_CRL_CHECK_CHAIN` або :data:`~ssl.VERIFY_X509_STRICT`. За замовчуванням OpenSSL не перевіряє CRL. (Надано Christien Heimes у :issue:`8813`.)

source: New :class:`~ssl.SSLContext` method :meth:`~ssl.SSLContext.load_default_certs` loads a set of default "certificate authority" (CA) certificates from default locations, which vary according to the platform. It can be used to load both TLS web server authentication certificates (``purpose=``:data:`~ssl.Purpose.SERVER_AUTH`) for a client to use to verify a server, and certificates for a server to use in verifying client certificates (``purpose=``:data:`~ssl.Purpose.CLIENT_AUTH`). (Contributed by Christian Heimes in :issue:`19292`.)
uk: Новий метод :class:`~ssl.SSLContext` :meth:`~ssl.SSLContext.load_default_certs` завантажує набір стандартних сертифікатів "центру сертифікації" (CA) із стандартних розташувань, які відрізняються залежно від платформи. Його можна використовувати для завантаження як сертифікатів автентифікації веб-сервера TLS (``purpose=``:data:`~ssl.Purpose.SERVER_AUTH`), які клієнт використовує для перевірки сервера, так і сертифікатів для сервера, які використовують для перевірки клієнтські сертифікати (``purpose=``:data:`~ssl.Purpose.CLIENT_AUTH`). (Надав Крістіан Хаймес у :issue:`19292`.)

source: Two new windows-only functions, :func:`~ssl.enum_certificates` and :func:`~ssl.enum_crls` provide the ability to retrieve certificates, certificate information, and CRLs from the Windows cert store. (Contributed by Christian Heimes in :issue:`17134`.)
uk: Дві нові функції лише для Windows, :func:`~ssl.enum_certificates` і :func:`~ssl.enum_crls` надають можливість отримувати сертифікати, інформацію про сертифікати та CRL зі сховища сертифікатів Windows. (Надав Крістіан Хеймс у :issue:`17134`.)

source: Support for server-side SNI (Server Name Indication) using the new :meth:`ssl.SSLContext.set_servername_callback` method. (Contributed by Daniel Black in :issue:`8109`.)
uk: Підтримка SNI на стороні сервера (Індикація імені сервера) за допомогою нового методу :meth:`ssl.SSSLContext.set_servername_callback`. (Надав Деніел Блек у :issue:`8109`.)

source: The dictionary returned by :meth:`.SSLSocket.getpeercert` contains additional ``X509v3`` extension items: ``crlDistributionPoints``, ``calIssuers``, and ``OCSP`` URIs. (Contributed by Christian Heimes in :issue:`18379`.)
uk: Словник, який повертає :meth:`.SSLSocket.getpeercert`, містить додаткові елементи розширення ``X509v3``: ``crlDistributionPoints``, ``calIssuers`` і ``OCSP`` URI. (Надав Крістіан Хеймс у :issue:`18379`.)

source: stat
uk: стат

source: The :mod:`stat` module is now backed by a C implementation in :mod:`_stat`. A C implementation is required as most of the values aren't standardized and are platform-dependent. (Contributed by Christian Heimes in :issue:`11016`.)
uk: Модуль :mod:`stat` тепер підтримується реалізацією C у :mod:`_stat`. Потрібна реалізація C, оскільки більшість значень не стандартизовані та залежать від платформи. (Надав Крістіан Хеймс у :issue:`11016`.)

source: The module supports new :mod:`~stat.ST_MODE` flags, :mod:`~stat.S_IFDOOR`, :attr:`~stat.S_IFPORT`, and :attr:`~stat.S_IFWHT`. (Contributed by Christian Hiemes in :issue:`11016`.)
uk: Модуль підтримує нові прапорці :mod:`~stat.ST_MODE`, :mod:`~stat.S_IFDOOR`, :attr:`~stat.S_IFPORT` і :attr:`~stat.S_IFWHT`. (Надав Крістіан Гімес у :issue:`11016`.)

source: struct
uk: структура

source: New function :mod:`~struct.iter_unpack` and a new :meth:`struct.Struct.iter_unpack` method on compiled formats provide streamed unpacking of a buffer containing repeated instances of a given format of data. (Contributed by Antoine Pitrou in :issue:`17804`.)
uk: Нова функція :mod:`~struct.iter_unpack` і новий метод :meth:`struct.Struct.iter_unpack` для скомпільованих форматів забезпечують потокове розпакування буфера, що містить повторювані екземпляри даного формату даних. (Надав Антуан Пітру в :issue:`17804`.)

source: subprocess
uk: підпроцес

source: :func:`~subprocess.check_output` now accepts an *input* argument that can be used to provide the contents of ``stdin`` for the command that is run. (Contributed by Zack Weinberg in :issue:`16624`.)
uk: :func:`~subprocess.check_output` тепер приймає аргумент *input*, який можна використовувати для надання вмісту ``stdin`` для команди, яка виконується. (Надав Зак Вайнберг у :issue:`16624`.)

source: :func:`~subprocess.getstatus` and :func:`~subprocess.getstatusoutput` now work on Windows. This change was actually inadvertently made in 3.3.4. (Contributed by Tim Golden in :issue:`10197`.)
uk: :func:`~subprocess.getstatus` і :func:`~subprocess.getstatusoutput` тепер працюють у Windows. Ця зміна фактично була зроблена ненавмисно в 3.3.4. (Надав Тім Голден у :issue:`10197`.)

source: The :meth:`~sunau.getparams` method now returns a namedtuple rather than a plain tuple. (Contributed by Claudiu Popa in :issue:`18901`.)
uk: Метод :meth:`~sunau.getparams` тепер повертає іменований кортеж, а не звичайний кортеж. (Надав Клаудіу Попа в :issue:`18901`.)

source: :meth:`sunau.open` now supports the context management protocol: when used in a :keyword:`with` block, the ``close`` method of the returned object will be called automatically at the end of the block. (Contributed by Serhiy Storchaka in :issue:`18878`.)
uk: :meth:`sunau.open` тепер підтримує протокол керування контекстом: при використанні в блоці :keyword:`with` метод ``close`` повернутого об'єкта буде автоматично викликаний у кінці блоку. (Надав Сергій Сторчака в :issue:`18878`.)

source: :meth:`.AU_write.setsampwidth` now supports 24 bit samples, thus adding support for writing 24 sample using the module. (Contributed by Serhiy Storchaka in :issue:`19261`.)
uk: :meth:`.AU_write.setsampwidth` тепер підтримує 24-бітові зразки, таким чином додаючи підтримку запису 24-х зразків за допомогою модуля. (Надав Сергій Сторчака в :issue:`19261`.)

source: The :meth:`~sunau.AU_write.writeframesraw` and :meth:`~sunau.AU_write.writeframes` methods now accept any :term:`bytes-like object`. (Contributed by Serhiy Storchaka in :issue:`8311`.)
uk: Методи :meth:`~sunau.AU_write.writeframesraw` і :meth:`~sunau.AU_write.writeframes` тепер приймають будь-які :term:`bytes-like object`. (Надав Сергій Сторчака в :issue:`8311`.)

source: sys
uk: система

source: New function :func:`sys.getallocatedblocks` returns the current number of blocks allocated by the interpreter. (In CPython with the default ``--with-pymalloc`` setting, this is allocations made through the :c:func:`PyObject_Malloc` API.) This can be useful for tracking memory leaks, especially if automated via a test suite. (Contributed by Antoine Pitrou in :issue:`13390`.)
uk: Нова функція :func:`sys.getallocatedblocks` повертає поточну кількість блоків, виділених інтерпретатором. (У CPython із параметром за замовчуванням ``--with-pymalloc`` це виділення, зроблене через :c:func:`PyObject_Malloc` API.) Це може бути корисним для відстеження витоків пам’яті, особливо якщо це автоматизовано за допомогою набору тестів. . (Надав Антуан Пітру в :issue:`13390`.)

source: When the Python interpreter starts in :ref:`interactive mode <tut-interactive>`, it checks for an :data:`~sys.__interactivehook__` attribute on the :mod:`sys` module. If the attribute exists, its value is called with no arguments just before interactive mode is started. The check is made after the :envvar:`PYTHONSTARTUP` file is read, so it can be set there. The :mod:`site` module :ref:`sets it <rlcompleter-config>` to a function that enables tab completion and history saving (in :file:`~/.python-history`) if the platform supports :mod:`readline`. If you do not want this (new) behavior, you can override it in :envvar:`PYTHONSTARTUP`, :mod:`sitecustomize`, or :mod:`usercustomize` by deleting this attribute from :mod:`sys` (or setting it to some other callable). (Contributed by Éric Araujo and Antoine Pitrou in :issue:`5845`.)
uk: Коли інтерпретатор Python запускається в :ref:`інтерактивному режимі <tut-interactive>`, він перевіряє наявність атрибута :data:`~sys.__interactivehook__` в модулі :mod:`sys`. Якщо атрибут існує, його значення викликається без аргументів безпосередньо перед запуском інтерактивного режиму. Перевірка виконується після прочитання файлу :envvar:`PYTHONSTARTUP`, тож його можна встановити там. Модуль :mod:`site` :ref:`встановлює для нього <rlcompleter-config>` функцію, яка вмикає завершення вкладки та збереження історії (у :file:`~/.python-history`), якщо платформа підтримує :mod:`readline` . Якщо ви не бажаєте такої (нової) поведінки, ви можете змінити її в :envvar:`PYTHONSTARTUP`, :mod:`sitecustomize` або :mod:`usercustomize`, видаливши цей атрибут із :mod:`sys` (або встановлення його на інший виклик). (Надано Еріком Араухо та Антуаном Пітру в :issue:`5845`.)

source: The :mod:`tarfile` module now supports a simple :ref:`tarfile-commandline` when called as a script directly or via ``-m``. This can be used to create and extract tarfile archives. (Contributed by Berker Peksag in :issue:`13477`.)
uk: Модуль :mod:`tarfile` тепер підтримує простий :ref:`tarfile-commandline` під час безпосереднього виклику сценарію або через ``-m``. Це можна використовувати для створення та розпакування архівів tarfile. (Надано Berker Peksag у :issue:`13477`.)

source: textwrap
uk: обтікання текстом
