Repository: python/python-docs-uk
Catalog: whatsnew/3.4.po
Languages: uk

source: The *parser* argument of :func:`xml.etree.ElementTree.iterparse` has been deprecated, as has the *html* argument of :func:`~xml.etree.ElementTree.XMLParser`. To prepare for the removal of the latter, all arguments to ``XMLParser`` should be passed by keyword.
uk: Аргумент *parser* :func:`xml.etree.ElementTree.iterparse` не підтримується, як і аргумент *html* :func:`~xml.etree.ElementTree.XMLParser`. Щоб підготуватися до видалення останнього, усі аргументи ``XMLParser`` повинні бути передані за ключовим словом.

source: Deprecated Features
uk: Застарілі функції

source: Running :ref:`idle` with the ``-n`` flag (no subprocess) is deprecated. However, the feature will not be removed until :issue:`18823` is resolved.
uk: Запуск :ref:`idle` з прапором ``-n`` (без підпроцесу) застарів. Однак цю функцію не буде видалено, доки не буде вирішено :issue:`18823`.

source: The site module adding a "site-python" directory to sys.path, if it exists, is deprecated (:issue:`19375`).
uk: Модуль сайту, який додає каталог "site-python" до sys.path, якщо він існує, вважається застарілим (:issue:`19375`).

source: Removed
uk: Видалено

source: Operating Systems No Longer Supported
uk: Операційні системи більше не підтримуються

source: Support for the following operating systems has been removed from the source and build tools:
uk: Підтримку таких операційних систем видалено з джерела та інструментів збірки:

source: Windows 2000 (changeset e52df05b496a).
uk: Windows 2000 (набір змін e52df05b496a).

source: Windows systems where ``COMSPEC`` points to ``command.com`` (:issue:`14470`).
uk: Системи Windows, де ``COMSPEC`` вказує на ``command.com`` (:issue:`14470`).

source: API and Feature Removals
uk: Видалення API та функцій

source: The following obsolete and previously deprecated APIs and features have been removed:
uk: Наступні застарілі API та функції, які раніше не підтримувалися, видалено:

source: The unmaintained ``Misc/TextMate`` and ``Misc/vim`` directories have been removed (see the `devguide <https://devguide.python.org>`_ for suggestions on what to use instead).
uk: Непідтримувані каталоги ``Misc/TextMate`` і ``Misc/vim`` було видалено (перегляньте `devguide <https://devguide.python.org>`_, щоб дізнатися, що використовувати натомість).

source: The ``SO`` makefile macro is removed (it was replaced by the ``SHLIB_SUFFIX`` and ``EXT_SUFFIX`` macros) (:issue:`16754`).
uk: Макрос makefile ``SO`` видалено (його замінено макросами ``SHLIB_SUFFIX`` і ``EXT_SUFFIX``) (:issue:`16754`).

source: The ``PyThreadState.tick_counter`` field has been removed; its value has been meaningless since Python 3.2, when the "new GIL" was introduced (:issue:`19199`).
uk: Поле ``PyThreadState.tick_counter`` було видалено; його значення не має сенсу з Python 3.2, коли було представлено "новий GIL" (:issue:`19199`).

source: ``PyLoader`` and ``PyPycLoader`` have been removed from :mod:`importlib`. (Contributed by Taras Lyapun in :issue:`15641`.)
uk: ``PyLoader`` і ``PyPycLoader`` видалено з :mod:`importlib`. (Надав Тарас Ляпун у :issue:`15641`.)

source: The *strict* argument to :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` has been removed. HTTP 0.9-style "Simple Responses" are no longer supported.
uk: Аргумент *строгий* для :class:`~http.client.HTTPConnection` і :class:`~http.client.HTTPSConnection` видалено. "Прості відповіді" у стилі HTTP 0.9 більше не підтримуються.

source: The deprecated :mod:`urllib.request.Request` getter and setter methods ``add_data``, ``has_data``, ``get_data``, ``get_type``, ``get_host``, ``get_selector``, ``set_proxy``, ``get_origin_req_host``, and ``is_unverifiable`` have been removed (use direct attribute access instead).
uk: Застарілі :mod:`urllib.request.Request` методи отримання та встановлення ``add_data``, ``has_data``, ``get_data``, ``get_type``, ``get_host``, ``get_selector``, ``set_proxy``, ``get_origin_req_host`` і ``is_unverifiable`` були видалені (замість цього використовуйте прямий доступ до атрибутів).

source: Support for loading the deprecated ``TYPE_INT64`` has been removed from :mod:`marshal`. (Contributed by Dan Riti in :issue:`15480`.)
uk: Підтримку завантаження застарілого ``TYPE_INT64`` було видалено з :mod:`marshal`. (Надав Ден Ріті в :issue:`15480`.)

source: :class:`inspect.Signature`: positional-only parameters are now required to have a valid name.
uk: :class:`inspect.Signature`: лише позиційні параметри тепер повинні мати дійсне ім’я.

source: :meth:`object.__format__` no longer accepts non-empty format strings, it now raises a :exc:`TypeError` instead. Using a non-empty string has been deprecated since Python 3.2. This change has been made to prevent a situation where previously working (but incorrect) code would start failing if an object gained a __format__ method, which means that your code may now raise a :exc:`TypeError` if you are using an ``'s'`` format code with objects that do not have a __format__ method that handles it. See :issue:`7994` for background.
uk: :meth:`object.__format__` більше не приймає непорожні рядки формату, замість цього він викликає :exc:`TypeError`. Використання непорожнього рядка застаріло з Python 3.2. Цю зміну було внесено, щоб запобігти ситуації, коли раніше працюючий (але неправильний) код почав виходити з ладу, якщо об’єкт отримав метод __format__, що означає, що ваш код тепер може викликати :exc:`TypeError`, якщо ви використовуєте Код формату ``'s'`` з об'єктами, які не мають методу __format__, який його обробляє. Див. :issue:`7994` для довідкової інформації.

source: :meth:`difflib.SequenceMatcher.isbjunk` and :meth:`difflib.SequenceMatcher.isbpopular` were deprecated in 3.2, and have now been removed: use ``x in sm.bjunk`` and ``x in sm.bpopular``, where *sm* is a :class:`~difflib.SequenceMatcher` object (:issue:`13248`).
uk: :meth:`difflib.SequenceMatcher.isbjunk` і :meth:`difflib.SequenceMatcher.isbpopular` були застарілими в 3.2, і тепер їх видалено: використовуйте ``x в sm.bjunk`` і ``x в sm.bpopular``, де *sm* є об’єктом :class:`~difflib.SequenceMatcher` (:issue:`13248`).

source: Code Cleanups
uk: Очищення коду

source: The unused and undocumented internal ``Scanner`` class has been removed from the :mod:`pydoc` module.
uk: Невикористаний і недокументований внутрішній клас ``Scanner`` було видалено з модуля :mod:`pydoc`.

source: The private and effectively unused ``_gestalt`` module has been removed, along with the private :mod:`platform` functions ``_mac_ver_lookup``, ``_mac_ver_gstalt``, and ``_bcd2str``, which would only have ever been called on badly broken OSX systems (see :issue:`18393`).
uk: Приватний і фактично невикористаний модуль ``_gestalt`` було видалено разом із приватними функціями :mod:`platform` ``_mac_ver_lookup``, ``_mac_ver_gstalt`` і ``_bcd2str``, які б тільки коли-небудь викликано на сильно зламаних системах OSX (див. :issue:`18393`).

source: The hardcoded copies of certain :mod:`stat` constants that were included in the :mod:`tarfile` module namespace have been removed.
uk: Жорстко закодовані копії певних констант :mod:`stat`, які були включені в простір імен модуля :mod:`tarfile`, було видалено.

source: Porting to Python 3.4
uk: Перенесення на Python 3.4

source: This section lists previously described changes and other bugfixes that may require changes to your code.
uk: У цьому розділі наведено описані раніше зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді.

source: Changes in 'python' Command Behavior
uk: Зміни в поведінці команд "python".

source: In a posix shell, setting the :envvar:`PATH` environment variable to an empty value is equivalent to not setting it at all. However, setting :envvar:`PYTHONPATH` to an empty value was *not* equivalent to not setting it at all: setting :envvar:`PYTHONPATH` to an empty value was equivalent to setting it to ``.``, which leads to confusion when reasoning by analogy to how :envvar:`PATH` works. The behavior now conforms to the posix convention for :envvar:`PATH`.
uk: У posix-оболонці встановлення змінної середовища :envvar:`PATH` на порожнє значення еквівалентно невстановленню її взагалі. Однак встановлення :envvar:`PYTHONPATH` на порожнє значення *не* еквівалентно тому, що його не встановлювати взагалі: встановлення :envvar:`PYTHONPATH` на порожнє значення було еквівалентно встановленню його на ``.``, що призводить до до плутанини, міркуючи за аналогією з тим, як працює :envvar:`PATH`. Поведінка тепер відповідає угоді posix для :envvar:`PATH`.

source: The [X refs, Y blocks] output of a debug (``--with-pydebug``) build of the CPython interpreter is now off by default. It can be re-enabled using the ``-X showrefcount`` option. (Contributed by Ezio Melotti in :issue:`17323`.)
uk: [X refs, Y blocks] вихід збірки налагодження (``--with-pydebug``) інтерпретатора CPython тепер вимкнено за замовчуванням. Його можна повторно ввімкнути за допомогою параметра ``-X showrefcount``. (Надав Еціо Мелотті в :issue:`17323`.)

source: The python command and most stdlib scripts (as well as :mod:`argparse`) now output ``--version`` information to ``stdout`` instead of ``stderr`` (for issue list see :ref:`other-improvements-3.4` above).
uk: Команда python і більшість сценаріїв stdlib (а також :mod:`argparse`) тепер виводять інформацію ``--version`` на ``stdout`` замість ``stderr`` (перелік проблем див. :ref:`other-improvements-3.4` вище).

source: Changes in the Python API
uk: Зміни в API Python

source: The ABCs defined in :mod:`importlib.abc` now either raise the appropriate exception or return a default value instead of raising :exc:`NotImplementedError` blindly. This will only affect code calling :func:`super` and falling through all the way to the ABCs. For compatibility, catch both :exc:`NotImplementedError` or the appropriate exception as needed.
uk: ABC, визначені в :mod:`importlib.abc`, тепер або викликають відповідний виняток, або повертають значення за замовчуванням замість виклику :exc:`NotImplementedError` наосліп. Це вплине лише на код, що викликає :func:`super` і потрапляє до ABC. Для сумісності перехопіть обидва :exc:`NotImplementedError` або відповідний виняток за потреби.

source: The module type now initializes the :attr:`__package__` and :attr:`__loader__` attributes to ``None`` by default. To determine if these attributes were set in a backwards-compatible fashion, use e.g. ``getattr(module, '__loader__', None) is not None``. (:issue:`17115`.)
uk: Тип модуля тепер ініціалізує атрибути :attr:`__package__` і :attr:`__loader__` як ``None`` за замовчуванням. Щоб визначити, чи ці атрибути були встановлені у зворотній сумісності, використовуйте, наприклад. ``getattr(module, '__loader__', None) не є None``. (:issue:`17115`.)

source: :meth:`importlib.util.module_for_loader` now sets ``__loader__`` and ``__package__`` unconditionally to properly support reloading. If this is not desired then you will need to set these attributes manually. You can use :func:`importlib.util.module_to_load` for module management.
uk: :meth:`importlib.util.module_for_loader` тепер безумовно встановлює ``__loader__`` і ``__package__`` для належної підтримки перезавантаження. Якщо це небажано, вам потрібно буде встановити ці атрибути вручну. Ви можете використовувати :func:`importlib.util.module_to_load` для керування модулями.

source: Import now resets relevant attributes (e.g. ``__name__``, ``__loader__``, ``__package__``, ``__file__``, ``__cached__``) unconditionally when reloading. Note that this restores a pre-3.3 behavior in that it means a module is re-found when re-loaded (:issue:`19413`).
uk: Імпорт тепер безумовно скидає відповідні атрибути (наприклад, ``__name__``, ``__loader__``, ``__package__``, ``__file__``, ``__cached__``) під час перезавантаження. Зауважте, що це відновлює поведінку до 3.3, оскільки це означає, що модуль повторно знайдено під час повторного завантаження (:issue:`19413`).

source: Frozen packages no longer set ``__path__`` to a list containing the package name, they now set it to an empty list. The previous behavior could cause the import system to do the wrong thing on submodule imports if there was also a directory with the same name as the frozen package. The correct way to determine if a module is a package or not is to use ``hasattr(module, '__path__')`` (:issue:`18065`).
uk: Заморожені пакунки більше не встановлюють ``__path__`` як список, що містить назву пакета, тепер вони встановлюють його як порожній список. Попередня поведінка могла спричинити неправильну дію системи імпорту під час імпорту підмодуля, якщо існував також каталог із такою ж назвою, як і заморожений пакет. Правильний спосіб визначити, чи є модуль пакетом чи ні, це використати ``hasattr(module, '__path__')`` (:issue:`18065`).

source: Frozen modules no longer define a ``__file__`` attribute. It's semantically incorrect for frozen modules to set the attribute as they are not loaded from any explicit location. If you must know that a module comes from frozen code then you can see if the module's ``__spec__.location`` is set to ``'frozen'``, check if the loader is a subclass of :class:`importlib.machinery.FrozenImporter`, or if Python 2 compatibility is necessary you can use :func:`imp.is_frozen`.
uk: Заморожені модулі більше не визначають атрибут ``__file__``. Для заморожених модулів семантично неправильно встановлювати атрибут, оскільки вони не завантажуються з будь-якого явного місця. Якщо вам потрібно знати, що модуль походить із замороженого коду, ви можете побачити, чи ``__spec__.location`` модуля встановлено на ``'frozen'``, перевірте, чи завантажувач є підкласом :class:`importlib. machinery.FrozenImporter`, або, якщо потрібна сумісність з Python 2, ви можете використовувати :func:`imp.is_frozen`.

source: :func:`py_compile.compile` now raises :exc:`FileExistsError` if the file path it would write to is a symlink or a non-regular file. This is to act as a warning that import will overwrite those files with a regular file regardless of what type of file path they were originally.
uk: :func:`py_compile.compile` тепер викликає :exc:`FileExistsError`, якщо шлях до файлу, куди він буде писати, є символічним посиланням або незвичайним файлом. Це є попередженням про те, що імпортування перезапише ці файли звичайним файлом незалежно від того, яким типом шляху до файлу вони були спочатку.

source: :meth:`importlib.abc.SourceLoader.get_source` no longer raises :exc:`ImportError` when the source code being loaded triggers a :exc:`SyntaxError` or :exc:`UnicodeDecodeError`. As :exc:`ImportError` is meant to be raised only when source code cannot be found but it should, it was felt to be over-reaching/overloading of that meaning when the source code is found but improperly structured. If you were catching ImportError before and wish to continue to ignore syntax or decoding issues, catch all three exceptions now.
uk: :meth:`importlib.abc.SourceLoader.get_source` більше не викликає :exc:`ImportError`, коли вихідний код, що завантажується, викликає :exc:`SyntaxError` або :exc:`UnicodeDecodeError`. Оскільки помилка :exc:`ImportError` має виникати лише тоді, коли вихідний код не може бути знайдений, але він має бути знайдений, було зрозуміло, що це означає надмірне/перевантажене значення, коли вихідний код знайдено, але неналежно структурований. Якщо ви раніше виявляли помилку ImportError і бажаєте й надалі ігнорувати проблеми з синтаксисом або декодуванням, виловіть усі три винятки зараз.

source: :func:`functools.update_wrapper` and :func:`functools.wraps` now correctly set the ``__wrapped__`` attribute to the function being wrapped, even if that function also had its ``__wrapped__`` attribute set. This means ``__wrapped__`` attributes now correctly link a stack of decorated functions rather than every ``__wrapped__`` attribute in the chain referring to the innermost function. Introspection libraries that assumed the previous behaviour was intentional can use :func:`inspect.unwrap` to access the first function in the chain that has no ``__wrapped__`` attribute.
uk: :func:`functools.update_wrapper` і :func:`functools.wraps` тепер правильно встановлюють атрибут ``__wrapped__`` для функції, яку обгортають, навіть якщо ця функція також має свій атрибут ``__wrapped__``. Це означає, що атрибути ``__wrapped__`` тепер правильно пов’язують стек декорованих функцій, а не кожен атрибут ``__wrapped__`` у ланцюжку, який посилається на найвнутрішню функцію. Бібліотеки самоаналізу, які припускали, що попередня поведінка була навмисною, можуть використовувати :func:`inspect.unwrap` для доступу до першої функції в ланцюжку, яка не має атрибута ``__wrapped__``.

source: :func:`inspect.getfullargspec` has been reimplemented on top of :func:`inspect.signature` and hence handles a much wider variety of callable objects than it did in the past. It is expected that additional builtin and extension module callables will gain signature metadata over the course of the Python 3.4 series. Code that assumes that :func:`inspect.getfullargspec` will fail on non-Python callables may need to be adjusted accordingly.
uk: :func:`inspect.getfullargspec` було повторно реалізовано поверх :func:`inspect.signature` і, отже, обробляє набагато більше різноманітних викликаних об’єктів, ніж це було в минулому. Очікується, що додаткові вбудовані модулі та модулі розширення отримають метадані підпису протягом серії Python 3.4. Код, який припускає, що :func:`inspect.getfullargspec` не вдасться викликати виклики, відмінні від Python, може потребувати відповідних змін.

source: :class:`importlib.machinery.PathFinder` now passes on the current working directory to objects in :data:`sys.path_hooks` for the empty string. This results in :data:`sys.path_importer_cache` never containing ``''``, thus iterating through :data:`sys.path_importer_cache` based on :data:`sys.path` will not find all keys. A module's ``__file__`` when imported in the current working directory will also now have an absolute path, including when using ``-m`` with the interpreter (except for ``__main__.__file__`` when a script has been executed directly using a relative path) (Contributed by Brett Cannon in :issue:`18416`). is specified on the command-line) (:issue:`18416`).
uk: :class:`importlib.machinery.PathFinder` тепер передає поточний робочий каталог об’єктам у :data:`sys.path_hooks` для порожнього рядка. Це призводить до того, що :data:`sys.path_importer_cache` ніколи не містить ``''``, тому ітерація через :data:`sys.path_importer_cache` на основі :data:`sys.path` не знайде всіх ключів. ``__file__`` модуля під час імпорту в поточний робочий каталог також тепер матиме абсолютний шлях, включно з використанням ``-m`` з інтерпретатором (за винятком ``__main__.__file__``, коли сценарій було виконано безпосередньо за допомогою відносного шляху) (надано Бреттом Кенноном у :issue:`18416`). вказується в командному рядку) (:issue:`18416`).

source: The removal of the *strict* argument to :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` changes the meaning of the remaining arguments if you are specifying them positionally rather than by keyword. If you've been paying attention to deprecation warnings your code should already be specifying any additional arguments via keywords.
uk: Видалення аргументу *strict* для :class:`~http.client.HTTPConnection` і :class:`~http.client.HTTPSConnection` змінює значення решти аргументів, якщо ви вказуєте їх позиційно, а не за ключовим словом. Якщо ви звертали увагу на застереження щодо застарілості, ваш код уже має вказувати додаткові аргументи за допомогою ключових слів.

source: Strings between ``from __future__ import ...`` statements now *always* raise a :exc:`SyntaxError`. Previously if there was no leading docstring, an interstitial string would sometimes be ignored. This brings CPython into compliance with the language spec; Jython and PyPy already were. (:issue:`17434`).
uk: Рядки між операторами ``from __future__ import ...`` тепер *завжди* викликають :exc:`SyntaxError`. Раніше, якщо не було початкового рядка документації, проміжний рядок іноді ігнорувався. Це приводить CPython у відповідність зі специфікацією мови; Jython і PyPy вже були. (:issue:`17434`).

source: :meth:`ssl.SSLSocket.getpeercert` and :meth:`ssl.SSLSocket.do_handshake` now raise an :exc:`OSError` with ``ENOTCONN`` when the ``SSLSocket`` is not connected, instead of the previous behavior of raising an :exc:`AttributeError`. In addition, :meth:`~ssl.SSLSocket.getpeercert` will raise a :exc:`ValueError` if the handshake has not yet been done.
uk: :meth:`ssl.SSLSocket.getpeercert` і :meth:`ssl.SSLSocket.do_handshake` тепер викликають :exc:`OSError` з ``ENOTCONN``, коли ``SSLSocket`` не підключено, замість попередня поведінка виклику :exc:`AttributeError`. Крім того, :meth:`~ssl.SSLSocket.getpeercert` викличе :exc:`ValueError`, якщо рукостискання ще не виконано.

source: :func:`base64.b32decode` now raises a :exc:`binascii.Error` when the input string contains non-b32-alphabet characters, instead of a :exc:`TypeError`. This particular :exc:`TypeError` was missed when the other :exc:`TypeError`\ s were converted. (Contributed by Serhiy Storchaka in :issue:`18011`.) Note: this change was also inadvertently applied in Python 3.3.3.
uk: :func:`base64.b32decode` тепер викликає :exc:`binascii.Error`, коли вхідний рядок містить символи, відмінні від b32-алфавіту, замість :exc:`TypeError`. Ця конкретна :exc:`TypeError` була пропущена під час перетворення інших :exc:`TypeError`\. (Надано Сергієм Сторчакою в :issue:`18011`.) Примітка: цю зміну також було випадково застосовано в Python 3.3.3.

source: The :attr:`~cgi.FieldStorage.file` attribute is now automatically closed when the creating :class:`cgi.FieldStorage` instance is garbage collected. If you were pulling the file object out separately from the :class:`cgi.FieldStorage` instance and not keeping the instance alive, then you should either store the entire :class:`cgi.FieldStorage` instance or read the contents of the file before the :class:`cgi.FieldStorage` instance is garbage collected.
uk: Атрибут :attr:`~cgi.FieldStorage.file` тепер автоматично закривається, коли створюваний екземпляр :class:`cgi.FieldStorage` збирається як сміття. Якщо ви витягували об’єкт файлу окремо від екземпляра :class:`cgi.FieldStorage` і не зберігали екземпляр живим, то вам слід або зберегти весь екземпляр :class:`cgi.FieldStorage`, або прочитати вміст файлу до того, як екземпляр :class:`cgi.FieldStorage` буде зібрано сміттям.

source: Calling ``read`` or ``write`` on a closed SSL socket now raises an informative :exc:`ValueError` rather than the previous more mysterious :exc:`AttributeError` (:issue:`9177`).
uk: Виклик ``read`` або ``write`` у закритому SSL-сокеті тепер викликає інформативну :exc:`ValueError`, а не попередню більш загадкову :exc:`AttributeError` (:issue:`9177`).

source: :meth:`slice.indices` no longer produces an :exc:`OverflowError` for huge values. As a consequence of this fix, :meth:`slice.indices` now raises a :exc:`ValueError` if given a negative length; previously it returned nonsense values (:issue:`14794`).
uk: :meth:`slice.indices` більше не створює :exc:`OverflowError` для великих значень. Як наслідок цього виправлення, :meth:`slice.indices` тепер викликає :exc:`ValueError`, якщо задано від’ємну довжину; раніше він повертав безглузді значення (:issue:`14794`).

source: The :class:`complex` constructor, unlike the :mod:`cmath` functions, was incorrectly accepting :class:`float` values if an object's ``__complex__`` special method returned one. This now raises a :exc:`TypeError`. (:issue:`16290`.)
uk: Конструктор :class:`complex`, на відміну від функцій :mod:`cmath`, неправильно приймав значення :class:`float`, якщо спеціальний метод ``__complex__`` об’єкта повертав одне. Тепер це викликає :exc:`TypeError`. (:issue:`16290`.)
