Repository: python/python-docs-uk
Catalog: whatsnew/3.4.po
Languages: uk

source: The :class:`int` constructor in 3.2 and 3.3 erroneously accepts :class:`float` values for the *base* parameter. It is unlikely anyone was doing this, but if so, it will now raise a :exc:`TypeError` (:issue:`16772`).
uk: Конструктор :class:`int` у версіях 3.2 і 3.3 помилково приймає значення :class:`float` для параметра *base*. Навряд чи хтось це робив, але якщо так, то тепер це викличе :exc:`TypeError` (:issue:`16772`).

source: Defaults for keyword-only arguments are now evaluated *after* defaults for regular keyword arguments, instead of before. Hopefully no one wrote any code that depends on the previous buggy behavior (:issue:`16967`).
uk: Значення за замовчуванням для аргументів лише ключових слів тепер оцінюються *після* значень за замовчуванням для звичайних аргументів ключових слів, а не раніше. Сподіваюся, ніхто не написав код, який би залежав від попередньої поведінки з помилками (:issue:`16967`).

source: Stale thread states are now cleared after :func:`~os.fork`. This may cause some system resources to be released that previously were incorrectly kept perpetually alive (for example, database connections kept in thread-local storage). (:issue:`17094`.)
uk: Застарілі стани потоку тепер очищаються після :func:`~os.fork`. Це може спричинити звільнення деяких системних ресурсів, які раніше неправильно зберігалися безперервно активними (наприклад, підключення до бази даних, що зберігаються в локальному сховищі потоку). (:issue:`17094`.)

source: Parameter names in ``__annotations__`` dicts are now mangled properly, similarly to ``__kwdefaults__``. (Contributed by Yury Selivanov in :issue:`20625`.)
uk: Назви параметрів у ``__annotations__`` dicts тепер змінюються належним чином, подібно до ``__kwdefaults__``. (Надав Юрій Селіванов у :issue:`20625`.)

source: :attr:`hashlib.hash.name` now always returns the identifier in lower case. Previously some builtin hashes had uppercase names, but now that it is a formal public interface the naming has been made consistent (:issue:`18532`).
uk: :attr:`hashlib.hash.name` тепер завжди повертає ідентифікатор у нижньому регістрі. Раніше деякі вбудовані хеші мали назви у верхньому регістрі, але тепер, коли це офіційний загальнодоступний інтерфейс, іменування стало узгодженим (:issue:`18532`).

source: Because :mod:`unittest.TestSuite` now drops references to tests after they are run, test harnesses that re-use a :class:`~unittest.TestSuite` to re-run a set of tests may fail. Test suites should not be re-used in this fashion since it means state is retained between test runs, breaking the test isolation that :mod:`unittest` is designed to provide. However, if the lack of isolation is considered acceptable, the old behavior can be restored by creating a :mod:`~unittest.TestSuite` subclass that defines a ``_removeTestAtIndex`` method that does nothing (see :meth:`.TestSuite.__iter__`) (:issue:`11798`).
uk: Оскільки :mod:`unittest.TestSuite` тепер видаляє посилання на тести після їх виконання, тестові пакети, які повторно використовують :class:`~unittest.TestSuite` для повторного запуску набору тестів, можуть не працювати. Набори тестів не слід повторно використовувати таким чином, оскільки це означає, що стан зберігається між тестовими запусками, порушуючи ізоляцію тесту, яку :mod:`unittest` створено для забезпечення. Однак, якщо відсутність ізоляції вважається прийнятною, стару поведінку можна відновити шляхом створення підкласу :mod:`~unittest.TestSuite`, який визначає метод ``_removeTestAtIndex``, який нічого не робить (див. :meth:`.TestSuite .__iter__`) (:issue:`11798`).

source: :mod:`unittest` now uses :mod:`argparse` for command line parsing. There are certain invalid command forms that used to work that are no longer allowed; in theory this should not cause backward compatibility issues since the disallowed command forms didn't make any sense and are unlikely to be in use.
uk: :mod:`unittest` тепер використовує :mod:`argparse` для аналізу командного рядка. Існують певні недійсні форми команд, які раніше працювали, але більше не дозволені; теоретично це не повинно викликати проблем із зворотною сумісністю, оскільки заборонені форми команд не мали жодного сенсу та навряд чи будуть використовуватися.

source: The :func:`re.split`, :func:`re.findall`, and :func:`re.sub` functions, and the :meth:`~re.match.group` and :meth:`~re.match.groups` methods of ``match`` objects now always return a *bytes* object when the string to be matched is a :term:`bytes-like object`. Previously the return type matched the input type, so if your code was depending on the return value being, say, a ``bytearray``, you will need to change your code.
uk: Функції :func:`re.split`, :func:`re.findall` і :func:`re.sub`, а також :meth:`~re.match.group` і Методи :meth:`~re.match.groups` об’єктів ``match`` тепер завжди повертають об’єкт *bytes*, коли рядок, який потрібно знайти, є :term:`bytes-like object`. Раніше тип повернення відповідав типу введення, тому, якщо ваш код залежав від значення, яке повертається, скажімо, як ``bytearray``, вам потрібно буде змінити свій код.

source: :mod:`audioop` functions now raise an error immediately if passed string input, instead of failing randomly later on (:issue:`16685`).
uk: Функції :mod:`audioop` тепер викликають помилку відразу після введення рядка, замість того, щоб випадково виходити з ладу пізніше (:issue:`16685`).

source: The new *convert_charrefs* argument to :class:`~html.parser.HTMLParser` currently defaults to ``False`` for backward compatibility, but will eventually be changed to default to ``True``. It is recommended that you add this keyword, with the appropriate value, to any :class:`~html.parser.HTMLParser` calls in your code (:issue:`13633`).
uk: Новий аргумент *convert_charrefs* для :class:`~html.parser.HTMLParser` наразі має значення ``False`` для зворотної сумісності, але з часом буде змінено на ``True``. Рекомендовано додати це ключове слово з відповідним значенням до будь-яких викликів :class:`~html.parser.HTMLParser` у вашому коді (:issue:`13633`).

source: Since the *digestmod* argument to the :func:`hmac.new` function will in the future have no default, all calls to :func:`hmac.new` should be changed to explicitly specify a *digestmod* (:issue:`17276`).
uk: Оскільки аргумент *digestmod* для функції :func:`hmac.new` у майбутньому не матиме значення за замовчуванням, усі виклики до :func:`hmac.new` слід змінити, щоб явно вказати *digestmod* (:issue:`17276`).

source: Calling :func:`sysconfig.get_config_var` with the ``SO`` key, or looking ``SO`` up in the results of a call to :func:`sysconfig.get_config_vars` is deprecated. This key should be replaced by ``EXT_SUFFIX`` or ``SHLIB_SUFFIX``, depending on the context (:issue:`19555`).
uk: Виклик :func:`sysconfig.get_config_var` за допомогою ключа ``SO`` або пошук ``SO`` у результатах виклику :func:`sysconfig.get_config_vars` є застарілим. Цей ключ слід замінити на ``EXT_SUFFIX`` або ``SHLIB_SUFFIX``, залежно від контексту (:issue:`19555`).

source: Any calls to ``open`` functions that specify ``U`` should be modified. ``U`` is ineffective in Python3 and will eventually raise an error if used. Depending on the function, the equivalent of its old Python2 behavior can be achieved using either a *newline* argument, or if necessary by wrapping the stream in :mod:`~io.TextIOWrapper` to use its *newline* argument (:issue:`15204`).
uk: Будь-які виклики функцій ``open``, які вказують ``U``, слід змінити. ``U`` неефективний у Python3 і зрештою викличе помилку, якщо його використовувати. Залежно від функції, еквівалент її старої поведінки Python2 може бути досягнутий за допомогою аргументу *нового рядка* або, якщо необхідно, загортання потоку в :mod:`~io.TextIOWrapper` для використання його аргументу *нового рядка* (:issue:`15204`).

source: If you use ``pyvenv`` in a script and desire that pip *not* be installed, you must add ``--without-pip`` to your command invocation.
uk: Якщо ви використовуєте ``pyvenv`` у сценарії та бажаєте, щоб pip *не* був встановлений, ви повинні додати ``--without-pip`` до виклику вашої команди.

source: The default behavior of :func:`json.dump` and :func:`json.dumps` when an indent is specified has changed: it no longer produces trailing spaces after the item separating commas at the ends of lines. This will matter only if you have tests that are doing white-space-sensitive comparisons of such output (:issue:`16333`).
uk: Поведінка за замовчуванням :func:`json.dump` і :func:`json.dumps`, коли вказано відступ, змінилася: він більше не створює кінцевих пробілів після елемента, що розділяє коми в кінцях рядків. Це матиме значення, лише якщо у вас є тести, які виконують чутливі до пробілів порівняння такого результату (:issue:`16333`).

source: :mod:`doctest` now looks for doctests in extension module ``__doc__`` strings, so if your doctest test discovery includes extension modules that have things that look like doctests in them you may see test failures you've never seen before when running your tests (:issue:`3158`).
uk: :mod:`doctest` тепер шукає doctests у рядках модуля розширення ``__doc__``, тож якщо ваш тест doctest включає модулі розширення, які містять речі, схожі на doctests, ви можете побачити помилки тестування, яких ніколи раніше не бачили, коли виконання ваших тестів (:issue:`3158`).

source: The :mod:`collections.abc` module has been slightly refactored as part of the Python startup improvements. As a consequence of this, it is no longer the case that importing :mod:`collections` automatically imports :mod:`collections.abc`. If your program depended on the (undocumented) implicit import, you will need to add an explicit ``import collections.abc`` (:issue:`20784`).
uk: Модуль :mod:`collections.abc` було дещо перероблено в рамках покращення запуску Python. Як наслідок цього, імпорт :mod:`collections` автоматично імпортує :mod:`collections.abc`. Якщо ваша програма залежала від (недокументованого) неявного імпорту, вам потрібно буде додати явний ``import collections.abc`` (:issue:`20784`).

source: Changes in the C API
uk: Зміни в C API

source: :c:func:`PyEval_EvalFrameEx`, :c:func:`PyObject_Repr`, and :c:func:`PyObject_Str`, along with some other internal C APIs, now include a debugging assertion that ensures they are not used in situations where they may silently discard a currently active exception. In cases where discarding the active exception is expected and desired (for example, because it has already been saved locally with :c:func:`PyErr_Fetch` or is being deliberately replaced with a different exception), an explicit :c:func:`PyErr_Clear` call will be needed to avoid triggering the assertion when invoking these operations (directly or indirectly) and running against a version of Python that is compiled with assertions enabled.
uk: :c:func:`PyEval_EvalFrameEx`, :c:func:`PyObject_Repr` і :c:func:`PyObject_Str`, а також деякі інші внутрішні API C тепер включають твердження про налагодження, яке гарантує, що вони не використовуються в ситуаціях, коли вони можуть мовчки відхилити поточний активний виняток. У випадках, коли скасування активного винятку є очікуваним і бажаним (наприклад, оскільки його вже було збережено локально за допомогою :c:func:`PyErr_Fetch` або навмисно замінено іншим винятком), явний виклик :c:func:`PyErr_Clear` буде потрібний, щоб уникнути запуску твердження під час виклику цих операцій (прямо чи опосередковано) і роботи з версією Python, яка скомпільована з увімкненими твердженнями.

source: :c:func:`PyErr_SetImportError` now sets :exc:`TypeError` when its **msg** argument is not set. Previously only ``NULL`` was returned with no exception set.
uk: :c:func:`PyErr_SetImportError` тепер встановлює :exc:`TypeError`, коли його аргумент **msg** не встановлено. Раніше повертався лише ``NULL`` без набору винятків.

source: The result of the :c:data:`PyOS_ReadlineFunctionPointer` callback must now be a string allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, or ``NULL`` if an error occurred, instead of a string allocated by :c:func:`PyMem_Malloc` or :c:func:`PyMem_Realloc` (:issue:`16742`)
uk: Результатом зворотного виклику :c:data:`PyOS_ReadlineFunctionPointer` тепер має бути рядок, виділений :c:func:`PyMem_RawMalloc` або :c:func:`PyMem_RawRealloc`, або ``NULL``, якщо сталася помилка, натомість рядка, виділеного :c:func:`PyMem_Malloc` або :c:func:`PyMem_Realloc` (:issue:`16742`)

source: :c:func:`PyThread_set_key_value` now always set the value. In Python 3.3, the function did nothing if the key already exists (if the current value is a non-``NULL`` pointer).
uk: :c:func:`PyThread_set_key_value` тепер завжди встановлює значення. У Python 3.3 функція нічого не робила, якщо ключ уже існує (якщо поточне значення не є вказівником ``NULL``).

source: The ``f_tstate`` (thread state) field of the :c:type:`PyFrameObject` structure has been removed to fix a bug: see :issue:`14432` for the rationale.
uk: Поле ``f_tstate`` (стан потоку) структури :c:type:`PyFrameObject` було видалено, щоб виправити помилку: див. :issue:`14432` для обґрунтування.

source: Changed in 3.4.3
uk: Змінено в 3.4.3

source: PEP 476: Enabling certificate verification by default for stdlib http clients
uk: PEP 476: увімкнення перевірки сертифіката за замовчуванням для http-клієнтів stdlib

source: :mod:`http.client` and modules which use it, such as :mod:`urllib.request` and :mod:`xmlrpc.client`, will now verify that the server presents a certificate which is signed by a CA in the platform trust store and whose hostname matches the hostname being requested by default, significantly improving security for many applications.
uk: :mod:`http.client` і модулі, які його використовують, такі як :mod:`urllib.request` і :mod:`xmlrpc.client`, тепер перевірятимуть, чи надає сервер сертифікат, підписаний ЦС у довіреного сховища платформи, і чиє ім’я хоста збігається з ім’ям хоста, яке запитується за замовчуванням, що значно покращує безпеку для багатьох програм.

source: For applications which require the old previous behavior, they can pass an alternate context::
uk: Для програм, які вимагають старої попередньої поведінки, вони можуть передавати альтернативний контекст::
