Repository: python/python-docs-uk
Catalog: whatsnew/3.4.po
Languages: uk

source: What's New In Python 3.4
uk: Що нового в Python 3.4

source: Author
uk: Автор

source: R. David Murray <rdmurray@bitdance.com> (Editor)
uk: R. David Murray <rdmurray@bitdance.com> (Редактор)

source: This article explains the new features in Python 3.4, compared to 3.3. Python 3.4 was released on March 16, 2014. For full details, see the `changelog <https://docs.python.org/3.4/whatsnew/changelog.html>`_.
uk: У цій статті пояснюється нові функції в Python 3.4 порівняно з 3.3. Python 3.4 було випущено 16 березня 2014 року. Щоб отримати повну інформацію, перегляньте `журнал змін <https://docs.python.org/3.4/whatsnew/changelog.html>`_.

source: :pep:`429` -- Python 3.4 Release Schedule
uk: :pep:`429` -- Графік випуску Python 3.4

source: Summary -- Release Highlights
uk: Підсумок -- Основні моменти випуску

source: New syntax features:
uk: Нові функції синтаксису:

source: No new syntax features were added in Python 3.4.
uk: У Python 3.4 не було додано нових функцій синтаксису.

source: Other new features:
uk: Інші нові функції:

source: :ref:`pip should always be available <whatsnew-pep-453>` (:pep:`453`).
uk: :ref:`pip завжди має бути доступним <whatsnew-pep-453>` (:pep:`453`).

source: :ref:`Newly created file descriptors are non-inheritable <whatsnew-pep-446>` (:pep:`446`).
uk: :ref:`Новостворені дескриптори файлів не успадковуються <whatsnew-pep-446>` (:pep:`446`).

source: command line option for :ref:`isolated mode <whatsnew-isolated-mode>` (:issue:`16499`).
uk: параметр командного рядка для :ref:`ізольованого режиму <whatsnew-isolated-mode>` (:issue:`16499`).

source: :ref:`improvements in the handling of codecs <codec-handling-improvements>` that are not text encodings (multiple issues).
uk: :ref:`покращення в обробці кодеків <codec-handling-improvements>`, які не є текстовими кодуваннями (кілька проблем).

source: :ref:`A ModuleSpec Type <whatsnew-pep-451>` for the Import System (:pep:`451`). (Affects importer authors.)
uk: :ref:`A ModuleSpec Type <whatsnew-pep-451>` для системи імпорту (:pep:`451`). (Впливає на авторів-імпортерів.)

source: The :mod:`marshal` format has been made :ref:`more compact and efficient <whatsnew-marshal-3>` (:issue:`16475`).
uk: Формат :mod:`marshal` зроблено :ref:`компактнішим і ефективнішим <whatsnew-marshal-3>` (:issue:`16475`).

source: New library modules:
uk: Нові бібліотечні модулі:

source: :mod:`asyncio`: :ref:`New provisional API for asynchronous IO <whatsnew-asyncio>` (:pep:`3156`).
uk: :mod:`asyncio`: :ref:`Новий тимчасовий API для асинхронного введення-виведення <whatsnew-asyncio>` (:pep:`3156`).

source: :mod:`ensurepip`: :ref:`Bootstrapping the pip installer <whatsnew-ensurepip>` (:pep:`453`).
uk: :mod:`ensurepip`: :ref:`Завантаження інсталятора pip <whatsnew-ensurepip>` (:pep:`453`).

source: :mod:`enum`: :ref:`Support for enumeration types <whatsnew-enum>` (:pep:`435`).
uk: :mod:`enum`: :ref:`Підтримка типів перерахування <whatsnew-enum>` (:pep:`435`).

source: :mod:`pathlib`: :ref:`Object-oriented filesystem paths <whatsnew-pathlib>` (:pep:`428`).
uk: :mod:`pathlib`: :ref:`Шляхи об’єктно-орієнтованої файлової системи <whatsnew-pathlib>` (:pep:`428`).

source: :mod:`selectors`: :ref:`High-level and efficient I/O multiplexing <whatsnew-selectors>`, built upon the :mod:`select` module primitives (part of :pep:`3156`).
uk: :mod:`selectors`: :ref:`Високорівневе й ефективне мультиплексування введення/виведення <whatsnew-selectors>`, побудоване на примітивах модуля :mod:`select` (частина :pep:`3156`).

source: :mod:`statistics`: A basic :ref:`numerically stable statistics library <whatsnew-statistics>` (:pep:`450`).
uk: :mod:`statistics`: базова :ref:`бібліотека чисельно стабільної статистики <whatsnew-statistics>` (:pep:`450`).

source: :mod:`tracemalloc`: :ref:`Trace Python memory allocations <whatsnew-tracemalloc>` (:pep:`454`).
uk: :mod:`tracemalloc`: :ref:`Відстеження розподілу пам’яті Python <whatsnew-tracemalloc>` (:pep:`454`).

source: Significantly improved library modules:
uk: Значно вдосконалені модулі бібліотеки:

source: :ref:`Single-dispatch generic functions <whatsnew-singledispatch>` in :mod:`functools` (:pep:`443`).
uk: :ref:`Загальні функції одноразового відправлення <whatsnew-singledispatch>` у :mod:`functools` (:pep:`443`).

source: New :mod:`pickle` :ref:`protocol 4 <whatsnew-protocol-4>` (:pep:`3154`).
uk: Новий :mod:`pickle` :ref:`протокол 4 <whatsnew-protocol-4>` (:pep:`3154`).

source: :mod:`multiprocessing` now has :ref:`an option to avoid using os.fork on Unix <whatsnew-multiprocessing-no-fork>` (:issue:`8713`).
uk: :mod:`multiprocessing` тепер має :ref:`опцію, щоб уникнути використання os.fork на Unix <whatsnew-multiprocessing-no-fork>` (:issue:`8713`).

source: :mod:`email` has a new submodule, :mod:`~email.contentmanager`, and a new :mod:`~email.message.Message` subclass (:class:`~email.contentmanager.EmailMessage`) that :ref:`simplify MIME handling <whatsnew_email_contentmanager>` (:issue:`18891`).
uk: :mod:`email` має новий підмодуль :mod:`~email.contentmanager` і новий підклас :mod:`~email.message.Message` (:class:`~email.contentmanager.EmailMessage`), який :ref:`спрощення обробки MIME <whatsnew_email_contentmanager>` (:issue:`18891`).

source: The :mod:`inspect` and :mod:`pydoc` modules are now capable of correct introspection of a much wider variety of callable objects, which improves the output of the Python :func:`help` system.
uk: Модулі :mod:`inspect` і :mod:`pydoc` тепер здатні до правильного аналізу набагато ширшого спектру викликаних об’єктів, що покращує результат роботи системи :func:`help` Python.

source: The :mod:`ipaddress` module API has been declared stable
uk: API модуля :mod:`ipaddress` оголошено стабільним

source: Security improvements:
uk: Покращення безпеки:

source: :ref:`Secure and interchangeable hash algorithm <whatsnew-pep-456>` (:pep:`456`).
uk: :ref:`Безпечний і взаємозамінний хеш-алгоритм <whatsnew-pep-456>` (:pep:`456`).

source: :ref:`Make newly created file descriptors non-inheritable <whatsnew-pep-446>` (:pep:`446`) to avoid leaking file descriptors to child processes.
uk: :ref:`Зробити новостворені дескриптори файлів неуспадкованими <whatsnew-pep-446>` (:pep:`446`), щоб уникнути витоку дескрипторів файлів у дочірні процеси.

source: New command line option for :ref:`isolated mode <whatsnew-isolated-mode>`, (:issue:`16499`).
uk: Нова опція командного рядка для :ref:`ізольованого режиму <whatsnew-isolated-mode>`, (:issue:`16499`).

source: :mod:`multiprocessing` now has :ref:`an option to avoid using os.fork on Unix <whatsnew-multiprocessing-no-fork>`. *spawn* and *forkserver* are more secure because they avoid sharing data with child processes.
uk: :mod:`multiprocessing` тепер має :ref:`опцію, щоб уникнути використання os.fork на Unix <whatsnew-multiprocessing-no-fork>`. *spawn* і *forkserver* більш безпечні, оскільки вони уникають обміну даними з дочірніми процесами.

source: :mod:`multiprocessing` child processes on Windows no longer inherit all of the parent's inheritable handles, only the necessary ones.
uk: :mod:`multiprocessing` дочірні процеси в Windows більше не успадковують усі успадковані дескриптори батьківського процесу, лише необхідні.

source: A new :func:`hashlib.pbkdf2_hmac` function provides the `PKCS#5 password-based key derivation function 2 <https://en.wikipedia.org/wiki/PBKDF2>`_.
uk: Нова функція :func:`hashlib.pbkdf2_hmac` забезпечує функцію виведення ключа на основі пароля `PKCS#5 2 <https://en.wikipedia.org/wiki/PBKDF2>`_.

source: :ref:`TLSv1.1 and TLSv1.2 support <whatsnew-tls-11-12>` for :mod:`ssl`.
uk: :ref:`TLSv1.1 і TLSv1.2 підтримують <whatsnew-tls-11-12>` для :mod:`ssl`.

source: :ref:`Retrieving certificates from the Windows system cert store support <whatsnew34-win-cert-store>` for :mod:`ssl`.
uk: :ref:`Отримання сертифікатів із сховища сертифікатів системи Windows підтримує <whatsnew34-win-cert-store>` для :mod:`ssl`.

source: The :class:`ssl.SSLContext` class has a :ref:`lot of improvements <whatsnew34-sslcontext>`.
uk: Клас :class:`ssl.SSLContext` має :ref:`багато покращень <whatsnew34-sslcontext>`.

source: All modules in the standard library that support SSL now support server certificate verification, including hostname matching (:func:`ssl.match_hostname`) and CRLs (Certificate Revocation lists, see :func:`ssl.SSLContext.load_verify_locations`).
uk: Усі модулі в стандартній бібліотеці, які підтримують SSL, тепер підтримують перевірку сертифікатів сервера, включаючи відповідність імен хостів (:func:`ssl.match_hostname`) і CRL (списки відкликаних сертифікатів, див. :func:`ssl.SSLContext.load_verify_locations`).

source: CPython implementation improvements:
uk: Покращення реалізації CPython:

source: :ref:`Safe object finalization <whatsnew-pep-442>` (:pep:`442`).
uk: :ref:`Безпечна фіналізація об’єкта <whatsnew-pep-442>` (:pep:`442`).

source: Leveraging :pep:`442`, in most cases :ref:`module globals are no longer set to None during finalization <whatsnew-pep-442>` (:issue:`18214`).
uk: Використовуючи :pep:`442`, у більшості випадків :ref:`глобальні параметри модуля більше не встановлюються на None під час фіналізації <whatsnew-pep-442>` (:issue:`18214`).

source: :ref:`Configurable memory allocators <whatsnew-pep-445>` (:pep:`445`).
uk: :ref:`Настроювані розподілювачі пам’яті <whatsnew-pep-445>` (:pep:`445`).

source: Please read on for a comprehensive list of user-facing changes, including many other smaller improvements, CPython optimizations, deprecations, and potential porting issues.
uk: Будь ласка, прочитайте повний список змін, які стосуються користувача, включаючи багато інших менших покращень, оптимізацію CPython, застарілі та потенційні проблеми з перенесенням.

source: New Features
uk: Нові можливості

source: PEP 453: Explicit Bootstrapping of PIP in Python Installations
uk: PEP 453: Явне початкове завантаження PIP у встановленнях Python

source: Bootstrapping pip By Default
uk: За замовчуванням завантажувальний pip

source: The new :mod:`ensurepip` module (defined in :pep:`453`) provides a standard cross-platform mechanism to bootstrap the pip installer into Python installations and virtual environments. The version of ``pip`` included with Python 3.4.0 is ``pip`` 1.5.4, and future 3.4.x maintenance releases will update the bundled version to the latest version of ``pip`` that is available at the time of creating the release candidate.
uk: Новий модуль :mod:`ensurepip` (визначений у :pep:`453`) забезпечує стандартний міжплатформний механізм для завантаження інсталятора pip у інсталяції Python і віртуальні середовища. Версія ``pip``, що входить до складу Python 3.4.0, — це ``pip`` 1.5.4, і в майбутніх випусках технічного обслуговування 3.4.x оновлюватиметься пакетна версія до останньої версії ``pip``, доступної за адресою час створення реліз-кандидата.

source: By default, the commands ``pipX`` and ``pipX.Y`` will be installed on all platforms (where X.Y stands for the version of the Python installation), along with the ``pip`` Python package and its dependencies. On Windows and in virtual environments on all platforms, the unversioned ``pip`` command will also be installed. On other platforms, the system wide unversioned ``pip`` command typically refers to the separately installed Python 2 version.
uk: За замовчуванням команди ``pipX`` і ``pipX.Y`` будуть встановлені на всіх платформах (де X.Y означає версію інсталяції Python), а також пакет ``pip`` Python і його залежності . У Windows і у віртуальних середовищах на всіх платформах також буде встановлено неверсійну команду ``pip``. На інших платформах загальносистемна неверсійна команда ``pip`` зазвичай відноситься до окремо встановленої версії Python 2.

source: The ``pyvenv`` command line utility and the :mod:`venv` module make use of the :mod:`ensurepip` module to make ``pip`` readily available in virtual environments. When using the command line utility, ``pip`` is installed by default, while when using the :mod:`venv` module :ref:`venv-api` installation of ``pip`` must be requested explicitly.
uk: Утиліта командного рядка ``pyvenv`` і модуль :mod:`venv` використовують модуль :mod:`ensurepip`, щоб зробити ``pip`` доступним у віртуальних середовищах. Під час використання утиліти командного рядка ``pip`` встановлено за замовчуванням, тоді як при використанні модуля :mod:`venv` :ref:`venv-api` встановлення ``pip`` має бути запитане явно.

source: For CPython :ref:`source builds on POSIX systems <building-python-on-unix>`, the ``make install`` and ``make altinstall`` commands bootstrap ``pip`` by default. This behaviour can be controlled through configure options, and overridden through Makefile options.
uk: Для CPython :ref:`source будується на системах POSIX <building-python-on-unix>`, команди ``make install`` і ``make altinstall`` завантажують ``pip`` за замовчуванням. Цю поведінку можна контролювати за допомогою параметрів конфігурації та перевизначати за допомогою параметрів Makefile.

source: On Windows and Mac OS X, the CPython installers now default to installing ``pip`` along with CPython itself (users may opt out of installing it during the installation process). Window users will need to opt in to the automatic ``PATH`` modifications to have ``pip`` available from the command line by default, otherwise it can still be accessed through the Python launcher for Windows as ``py -m pip``.
uk: У Windows і Mac OS X інсталятори CPython тепер за замовчуванням встановлюють ``pip`` разом із самим CPython (користувачі можуть відмовитися від його встановлення під час процесу встановлення). Користувачам Windows потрібно буде ввімкнути автоматичні зміни PATH, щоб за замовчуванням мати pip доступним із командного рядка, інакше до нього можна отримати доступ через засіб запуску Python для Windows за допомогою ``py -m pip``.

source: As `discussed in the PEP`__, platform packagers may choose not to install these commands by default, as long as, when invoked, they provide clear and simple directions on how to install them on that platform (usually using the system package manager).
uk: Як `обговорювалося в PEP`__, пакувальники платформи можуть не встановлювати ці команди за замовчуванням, якщо під час виклику вони надають чіткі та прості вказівки щодо їх встановлення на цій платформі (зазвичай за допомогою системного менеджера пакетів) .

source: To avoid conflicts between parallel Python 2 and Python 3 installations, only the versioned ``pip3`` and ``pip3.4`` commands are bootstrapped by default when ``ensurepip`` is invoked directly - the ``--default-pip`` option is needed to also request the unversioned ``pip`` command. ``pyvenv`` and the Windows installer ensure that the unqualified ``pip`` command is made available in those environments, and ``pip`` can always be invoked via the ``-m`` switch rather than directly to avoid ambiguity on systems with multiple Python installations.
uk: Щоб уникнути конфліктів між паралельними інсталяціями Python 2 і Python 3, лише версії команд ``pip3`` і ``pip3.4`` завантажуються за замовчуванням, коли ``ensurepip`` викликається безпосередньо - ``--default- Опція pip потрібна для запиту неверсійної команди pip. ``pyvenv`` і інсталятор Windows забезпечують доступність некваліфікованої команди ``pip`` у цих середовищах, а ``pip`` завжди можна викликати за допомогою перемикача ``-m``, а не безпосередньо, щоб уникнути неоднозначність у системах із кількома інсталяціями Python.

source: Documentation Changes
uk: Зміни в документації

source: As part of this change, the :ref:`installing-index` and :ref:`distributing-index` sections of the documentation have been completely redesigned as short getting started and FAQ documents. Most packaging documentation has now been moved out to the Python Packaging Authority maintained `Python Packaging User Guide <https://packaging.python.org>`__ and the documentation of the individual projects.
uk: У рамках цієї зміни розділи :ref:`installing-index` і :ref:`distributing-index` документації були повністю перероблені як короткі документи про початок роботи та FAQ. Більшість пакетної документації тепер переміщено до Python Packaging Authority, який підтримується `Python Packaging User Guide <https://packaging.python.org>`__ і документація окремих проектів.

source: However, as this migration is currently still incomplete, the legacy versions of those guides remaining available as :ref:`install-index` and :ref:`distutils-index`.
uk: Однак, оскільки ця міграція ще не завершена, застарілі версії цих посібників залишаються доступними як :ref:`install-index` і :ref:`distutils-index`.

source: :pep:`453` -- Explicit bootstrapping of pip in Python installations
uk: :pep:`453` -- Явне початкове завантаження pip у інсталяціях Python

source: PEP written by Donald Stufft and Nick Coghlan, implemented by Donald Stufft, Nick Coghlan, Martin von Löwis and Ned Deily.
uk: PEP, написаний Дональдом Стаффтом і Ніком Когланом, реалізований Дональдом Стаффтом, Ніком Когланом, Мартіном фон Льовісом і Недом Дейлі.

source: PEP 446: Newly Created File Descriptors Are Non-Inheritable
uk: PEP 446: щойно створені дескриптори файлів не успадковуються

source: :pep:`446` makes newly created file descriptors :ref:`non-inheritable <fd_inheritance>`. In general, this is the behavior an application will want: when launching a new process, having currently open files also open in the new process can lead to all sorts of hard to find bugs, and potentially to security issues.
uk: :pep:`446` робить новостворені дескриптори файлів :ref:`неуспадкованими <fd_inheritance>`. Загалом це те, чого захоче програма: під час запуску нового процесу наявність відкритих файлів, також відкритих у новому процесі, може призвести до різного роду помилок, які важко знайти, і потенційно до проблем безпеки.

source: However, there are occasions when inheritance is desired. To support these cases, the following new functions and methods are available:
uk: Однак бувають випадки, коли бажано отримати спадок. Для підтримки цих випадків доступні такі нові функції та методи:

source: :pep:`446` -- Make newly created file descriptors non-inheritable
uk: :pep:`446` -- Зробити новостворені дескриптори файлів неуспадковуваними

source: PEP written and implemented by Victor Stinner.
uk: PEP написав і реалізував Віктор Стіннер.

source: Improvements to Codec Handling
uk: Покращення обробки кодеків

source: Since it was first introduced, the :mod:`codecs` module has always been intended to operate as a type-neutral dynamic encoding and decoding system. However, its close coupling with the Python text model, especially the type restricted convenience methods on the builtin :class:`str`, :class:`bytes` and :class:`bytearray` types, has historically obscured that fact.
uk: З моменту появи вперше модуль :mod:`codecs` завжди був призначений для роботи як нейтральна до типу система динамічного кодування та декодування. Однак його тісний зв’язок із текстовою моделлю Python, особливо зручні методи з обмеженим типом у вбудованих типах :class:`str`, :class:`bytes` і :class:`bytearray`, історично приховав цей факт.

source: As a key step in clarifying the situation, the :meth:`codecs.encode` and :meth:`codecs.decode` convenience functions are now properly documented in Python 2.7, 3.3 and 3.4. These functions have existed in the :mod:`codecs` module (and have been covered by the regression test suite) since Python 2.4, but were previously only discoverable through runtime introspection.
uk: Як ключовий крок у проясненні ситуації, зручні функції :meth:`codecs.encode` і :meth:`codecs.decode` тепер належним чином задокументовані в Python 2.7, 3.3 і 3.4. Ці функції існували в модулі :mod:`codecs` (і були охоплені набором тестів регресії) з Python 2.4, але раніше їх можна було виявити лише під час самоаналізу.

source: Unlike the convenience methods on :class:`str`, :class:`bytes` and :class:`bytearray`, the :mod:`codecs` convenience functions support arbitrary codecs in both Python 2 and Python 3, rather than being limited to Unicode text encodings (in Python 3) or ``basestring`` <-> ``basestring`` conversions (in Python 2).
uk: На відміну від зручних методів :class:`str`, :class:`bytes` і :class:`bytearray`, зручні функції :mod:`codecs` підтримують довільні кодеки в Python 2 і Python 3, а не обмежені у кодування тексту Unicode (у Python 3) або перетворення ``basestring`` <-> ``basestring`` (у Python 2).

source: In Python 3.4, the interpreter is able to identify the known non-text encodings provided in the standard library and direct users towards these general purpose convenience functions when appropriate::
uk: У Python 3.4 інтерпретатор може ідентифікувати відомі нетекстові кодування, надані в стандартній бібліотеці, і спрямовувати користувачів до цих зручних функцій загального призначення, коли це необхідно:

source: In a related change, whenever it is feasible without breaking backwards compatibility, exceptions raised during encoding and decoding operations are wrapped in a chained exception of the same type that mentions the name of the codec responsible for producing the error::
uk: У зв’язаних змінах, коли це можливо без порушення зворотної сумісності, винятки, які виникають під час операцій кодування та декодування, загортаються в ланцюговий виняток того самого типу, у якому згадується ім’я кодека, відповідального за створення помилки:

source: Finally, as the examples above show, these improvements have permitted the restoration of the convenience aliases for the non-Unicode codecs that were themselves restored in Python 3.2. This means that encoding binary data to and from its hexadecimal representation (for example) can now be written as::
uk: Нарешті, як показують наведені вище приклади, ці вдосконалення дозволили відновити зручні псевдоніми для кодеків, відмінних від Unicode, які самі були відновлені в Python 3.2. Це означає, що кодування двійкових даних у їх шістнадцяткове представлення та з них (наприклад) тепер можна записати так:

source: The binary and text transforms provided in the standard library are detailed in :ref:`binary-transforms` and :ref:`text-transforms`.
uk: Двійкові та текстові перетворення, надані в стандартній бібліотеці, детально описані в :ref:`binary-transforms` і :ref:`text-transforms`.

source: (Contributed by Nick Coghlan in :issue:`7475`, :issue:`17827`, :issue:`17828` and :issue:`19619`.)
uk: (Надано Ніком Когланом у :issue:`7475`, :issue:`17827`, :issue:`17828` та :issue:`19619`.)

source: PEP 451: A ModuleSpec Type for the Import System
uk: PEP 451: тип ModuleSpec для системи імпорту

source: :pep:`451` provides an encapsulation of the information about a module that the import machinery will use to load it (that is, a module specification). This helps simplify both the import implementation and several import-related APIs. The change is also a stepping stone for `several future import-related improvements`__.
uk: :pep:`451` забезпечує інкапсуляцію інформації про модуль, яку механізм імпорту використовуватиме для його завантаження (тобто специфікацію модуля). Це допомагає спростити як реалізацію імпорту, так і кілька пов’язаних з імпортом API. Ця зміна також є кроком до `декількох майбутніх покращень, пов’язаних з імпортом`__.
