Repository: python/python-docs-uk
Catalog: whatsnew/3.5.po
Languages: uk

source: What's New In Python 3.5
uk: Що нового в Python 3.5

source: Editors
uk: Редактори

source: This article explains the new features in Python 3.5, compared to 3.4. Python 3.5 was released on September 13, 2015. See the `changelog <https://docs.python.org/3.5/whatsnew/changelog.html>`_ for a full list of changes.
uk: У цій статті пояснюється нові функції в Python 3.5 порівняно з 3.4. Python 3.5 було випущено 13 вересня 2015 року. Повний список змін див. у `журналі змін <https://docs.python.org/3.5/whatsnew/changelog.html>`_.

source: :pep:`478` - Python 3.5 Release Schedule
uk: :pep:`478` - Графік випуску Python 3.5

source: Summary -- Release highlights
uk: Підсумок – основні моменти випуску

source: New syntax features:
uk: Нові функції синтаксису:

source: :ref:`PEP 492 <whatsnew-pep-492>`, coroutines with async and await syntax.
uk: :ref:`PEP 492 <whatsnew-pep-492>`, співпрограми з синтаксисом async і await.

source: :ref:`PEP 465 <whatsnew-pep-465>`, a new matrix multiplication operator: ``a @ b``.
uk: :ref:`PEP 465 <whatsnew-pep-465>`, новий оператор множення матриці: ``a @ b``.

source: :ref:`PEP 448 <whatsnew-pep-448>`, additional unpacking generalizations.
uk: :ref:`PEP 448 <whatsnew-pep-448>`, додаткові узагальнення розпакування.

source: New library modules:
uk: Нові бібліотечні модулі:

source: :mod:`typing`: :ref:`PEP 484 -- Type Hints <whatsnew-pep-484>`.
uk: :mod:`typing`: :ref:`PEP 484 -- Типові підказки <whatsnew-pep-484>`.

source: :mod:`zipapp`: :ref:`PEP 441 Improving Python ZIP Application Support <whatsnew-zipapp>`.
uk: :mod:`zipapp`: :ref:`PEP 441 Покращення підтримки програм Python ZIP <whatsnew-zipapp>`.

source: New built-in features:
uk: Нові вбудовані функції:

source: ``bytes % args``, ``bytearray % args``: :ref:`PEP 461 <whatsnew-pep-461>` -- Adding ``%`` formatting to bytes and bytearray.
uk: ``bytes % args``, ``bytearray % args``: :ref:`PEP 461 <whatsnew-pep-461>` -- Додано форматування ``%`` до байтів і bytearray.

source: New :meth:`bytes.hex`, :meth:`bytearray.hex` and :meth:`memoryview.hex` methods. (Contributed by Arnon Yaari in :issue:`9951`.)
uk: Нові методи :meth:`bytes.hex`, :meth:`bytearray.hex` і :meth:`memoryview.hex`. (Надав Арнон Яарі в :issue:`9951`.)

source: :class:`memoryview` now supports tuple indexing (including multi-dimensional). (Contributed by Antoine Pitrou in :issue:`23632`.)
uk: :class:`memoryview` тепер підтримує індексування кортежів (включаючи багатовимірне). (Надав Антуан Пітру в :issue:`23632`.)

source: Generators have a new ``gi_yieldfrom`` attribute, which returns the object being iterated by ``yield from`` expressions. (Contributed by Benno Leslie and Yury Selivanov in :issue:`24450`.)
uk: Генератори мають новий атрибут ``gi_yieldfrom``, який повертає об’єкт, який повторюється виразами ``yield from``. (Надано Бенно Леслі та Юрієм Селівановим у :issue:`24450`.)

source: A new :exc:`RecursionError` exception is now raised when maximum recursion depth is reached. (Contributed by Georg Brandl in :issue:`19235`.)
uk: Новий виняток :exc:`RecursionError` тепер викликається, коли досягається максимальна глибина рекурсії. (Надав Георг Брандл у :issue:`19235`.)

source: CPython implementation improvements:
uk: Покращення реалізації CPython:

source: When the ``LC_TYPE`` locale is the POSIX locale (``C`` locale), :py:data:`sys.stdin` and :py:data:`sys.stdout` now use the ``surrogateescape`` error handler, instead of the ``strict`` error handler. (Contributed by Victor Stinner in :issue:`19977`.)
uk: Якщо локаль ``LC_TYPE`` є локаллю POSIX (``C`` локаль), :py:data:`sys.stdin` і :py:data:`sys.stdout` тепер використовують ``surrogateescape`` обробник помилок замість ``строгого`` обробника помилок. (Надав Віктор Стіннер у :issue:`19977`.)

source: ``.pyo`` files are no longer used and have been replaced by a more flexible scheme that includes the optimization level explicitly in ``.pyc`` name. (See :ref:`PEP 488 overview <whatsnew-pep-488>`.)
uk: Файли ``.pyo`` більше не використовуються і були замінені більш гнучкою схемою, яка включає рівень оптимізації явно в назві ``.pyc``. (Див. :ref:`Огляд PEP 488 <whatsnew-pep-488>`.)

source: Builtin and extension modules are now initialized in a multi-phase process, which is similar to how Python modules are loaded. (See :ref:`PEP 489 overview <whatsnew-pep-489>`.)
uk: Вбудовані модулі та модулі розширення тепер ініціалізуються в багатофазному процесі, який подібний до того, як завантажуються модулі Python. (Див. :ref:`Огляд PEP 489 <whatsnew-pep-489>`.)

source: Significant improvements in the standard library:
uk: Значні вдосконалення стандартної бібліотеки:

source: :class:`collections.OrderedDict` is now :ref:`implemented in C <whatsnew-ordereddict>`, which makes it 4 to 100 times faster.
uk: :class:`collections.OrderedDict` тепер :ref:`реалізовано в C <whatsnew-ordereddict>`, що робить його від 4 до 100 разів швидшим.

source: The :mod:`ssl` module gained :ref:`support for Memory BIO <whatsnew-sslmemorybio>`, which decouples SSL protocol handling from network IO.
uk: Модуль :mod:`ssl` отримав :ref:`підтримку Memory BIO <whatsnew-sslmemorybio>`, що відокремлює обробку протоколу SSL від мережевого введення-виведення.

source: The new :func:`os.scandir` function provides a :ref:`better and significantly faster way <whatsnew-pep-471>` of directory traversal.
uk: Нова функція :func:`os.scandir` забезпечує :ref:`кращий і значно швидший спосіб <whatsnew-pep-471>` обходу каталогу.

source: :func:`functools.lru_cache` has been mostly :ref:`reimplemented in C <whatsnew-lrucache>`, yielding much better performance.
uk: :func:`functools.lru_cache` був здебільшого :ref:`перереалізований у C <whatsnew-lrucache>`, що дало набагато кращу продуктивність.

source: The new :func:`subprocess.run` function provides a :ref:`streamlined way to run subprocesses <whatsnew-subprocess>`.
uk: Нова функція :func:`subprocess.run` забезпечує :ref:`впорядкований спосіб запуску підпроцесів <whatsnew-subprocess>`.

source: The :mod:`traceback` module has been significantly :ref:`enhanced <whatsnew-traceback>` for improved performance and developer convenience.
uk: Модуль :mod:`traceback` був значно :ref:`покращений <whatsnew-traceback>` для покращення продуктивності та зручності для розробників.

source: Security improvements:
uk: Покращення безпеки:

source: SSLv3 is now disabled throughout the standard library. It can still be enabled by instantiating a :class:`ssl.SSLContext` manually. (See :issue:`22638` for more details; this change was backported to CPython 3.4 and 2.7.)
uk: SSLv3 тепер вимкнено в стандартній бібліотеці. Його все ще можна ввімкнути, створивши екземпляр :class:`ssl.SSLContext` вручну. (Докладніше див. :issue:`22638`; цю зміну було перенесено до CPython 3.4 і 2.7.)

source: HTTP cookie parsing is now stricter, in order to protect against potential injection attacks. (Contributed by Antoine Pitrou in :issue:`22796`.)
uk: Синтаксичний аналіз файлів cookie HTTP тепер суворіший, щоб захистити від потенційних ін’єкційних атак. (Надав Антуан Пітру в :issue:`22796`.)

source: Windows improvements:
uk: Покращення Windows:

source: A new installer for Windows has replaced the old MSI. See :ref:`using-on-windows` for more information.
uk: Новий інсталятор для Windows замінив старий MSI. Перегляньте :ref:`using-on-windows` для отримання додаткової інформації.

source: Windows builds now use Microsoft Visual C++ 14.0, and extension modules should use the same.
uk: Збірки Windows тепер використовують Microsoft Visual C++ 14.0, і модулі розширення мають використовувати те саме.

source: Please read on for a comprehensive list of user-facing changes, including many other smaller improvements, CPython optimizations, deprecations, and potential porting issues.
uk: Будь ласка, прочитайте повний список змін, які стосуються користувачів, включаючи багато інших менших покращень, оптимізацію CPython, застарілі та потенційні проблеми з перенесенням.

source: New Features
uk: Нові можливості

source: PEP 492 - Coroutines with async and await syntax
uk: PEP 492 – співпрограми з синтаксисом async і await

source: :pep:`492` greatly improves support for asynchronous programming in Python by adding :term:`awaitable objects <awaitable>`, :term:`coroutine functions <coroutine function>`, :term:`asynchronous iteration <asynchronous iterable>`, and :term:`asynchronous context managers <asynchronous context manager>`.
uk: :pep:`492` значно покращує підтримку асинхронного програмування в Python, додаючи :term:`очікувані об’єкти <awaitable>`, :term:`функції співпрограми <coroutine function>`, :term:`асинхронну ітерацію <asynchronous iterable>` та :term:`асинхронну контекст менеджери <asynchronous context manager>`.

source: Coroutine functions are declared using the new :keyword:`async def` syntax::
uk: Функції співпрограми оголошено за допомогою нового синтаксису :keyword:`async def`::

source: Inside a coroutine function, the new :keyword:`await` expression can be used to suspend coroutine execution until the result is available. Any object can be *awaited*, as long as it implements the :term:`awaitable` protocol by defining the :meth:`__await__` method.
uk: Усередині функції співпрограми новий вираз :keyword:`await` можна використовувати для призупинення виконання співпрограми, доки не буде доступний результат. Будь-який об’єкт може бути *очікуваним*, якщо він реалізує протокол :term:`awaitable` шляхом визначення методу :meth:`__await__`.

source: PEP 492 also adds :keyword:`async for` statement for convenient iteration over asynchronous iterables.
uk: PEP 492 також додає оператор :keyword:`async for` для зручної ітерації над асинхронними ітераціями.

source: An example of a rudimentary HTTP client written using the new syntax::
uk: Приклад елементарного клієнта HTTP, написаного з використанням нового синтаксису:

source: Similarly to asynchronous iteration, there is a new syntax for asynchronous context managers. The following script::
uk: Подібно до асинхронної ітерації, існує новий синтаксис для менеджерів асинхронного контексту. Наступний сценарій::

source: will output::
uk: виведе::

source: Note that both :keyword:`async for` and :keyword:`async with` can only be used inside a coroutine function declared with :keyword:`async def`.
uk: Зауважте, що як :keyword:`async for`, так і :keyword:`async with` можна використовувати лише всередині функції співпрограми, оголошеної за допомогою :keyword:`async def`.

source: Coroutine functions are intended to be run inside a compatible event loop, such as the :ref:`asyncio loop <asyncio-event-loop>`.
uk: Функції співпрограми призначені для виконання всередині сумісного циклу подій, такого як :ref:`асинхронний цикл <asyncio-event-loop>`.

source: Starting with CPython 3.5.2, ``__aiter__`` can directly return :term:`asynchronous iterators <asynchronous iterator>`. Returning an :term:`awaitable` object will result in a :exc:`PendingDeprecationWarning`.
uk: Починаючи з CPython 3.5.2, ``__aiter__`` може безпосередньо повертати :term:`асинхронні ітератори <asynchronous iterator>`. Повернення об’єкта :term:`awaitable` призведе до появи :exc:`PendingDeprecationWarning`.

source: See more details in the :ref:`async-iterators` documentation section.
uk: Дивіться більше деталей у розділі документації :ref:`async-iterators`.

source: :pep:`492` -- Coroutines with async and await syntax
uk: :pep:`492` -- Співпрограми з синтаксисом async і await

source: PEP written and implemented by Yury Selivanov.
uk: PEP написав і реалізував Юрій Селіванов.

source: PEP 465 - A dedicated infix operator for matrix multiplication
uk: PEP 465 – спеціальний інфіксний оператор для множення матриць

source: :pep:`465` adds the ``@`` infix operator for matrix multiplication. Currently, no builtin Python types implement the new operator, however, it can be implemented by defining :meth:`__matmul__`, :meth:`__rmatmul__`, and :meth:`__imatmul__` for regular, reflected, and in-place matrix multiplication. The semantics of these methods is similar to that of methods defining other infix arithmetic operators.
uk: :pep:`465` додає інфіксний оператор ``@`` для множення матриць. Наразі жодні вбудовані типи Python не реалізують новий оператор, однак його можна реалізувати, визначивши :meth:`__matmul__`, :meth:`__rmatmul__` і :meth:`__imatmul__` для звичайної, відображеної та на місці матриці множення. Семантика цих методів подібна до методів, що визначають інші інфіксні арифметичні оператори.

source: Matrix multiplication is a notably common operation in many fields of mathematics, science, engineering, and the addition of ``@`` allows writing cleaner code::
uk: Матричне множення є досить поширеною операцією в багатьох галузях математики, науки, техніки, а додавання ``@`` дозволяє писати чистіший код::

source: instead of::
uk: замість::

source: NumPy 1.10 has support for the new operator::
uk: NumPy 1.10 підтримує новий оператор:

source: :pep:`465` -- A dedicated infix operator for matrix multiplication
uk: :pep:`465` -- Спеціальний інфіксний оператор для множення матриць

source: PEP written by Nathaniel J. Smith; implemented by Benjamin Peterson.
uk: PEP, написаний Натаніелем Дж. Смітом; реалізований Бенджаміном Петерсоном.

source: PEP 448 - Additional Unpacking Generalizations
uk: PEP 448 - Додаткові узагальнення розпакування

source: :pep:`448` extends the allowed uses of the ``*`` iterable unpacking operator and ``**`` dictionary unpacking operator. It is now possible to use an arbitrary number of unpackings in :ref:`function calls <calls>`::
uk: :pep:`448` розширює дозволене використання оператора ітераційного розпакування ``*`` та оператора розпакування словника ``**``. Тепер можна використовувати довільну кількість розпакувань у :ref:`викликах функцій <calls>`::

source: Similarly, tuple, list, set, and dictionary displays allow multiple unpackings (see :ref:`exprlists` and :ref:`dict`)::
uk: Так само відображення кортежів, списків, наборів і словників дозволяють багаторазове розпакування (див. :ref:`exprlists` і :ref:`dict`)::

source: :pep:`448` -- Additional Unpacking Generalizations
uk: :pep:`448` -- Додаткові узагальнення розпакування

source: PEP written by Joshua Landau; implemented by Neil Girdhar, Thomas Wouters, and Joshua Landau.
uk: PEP, написаний Джошуа Ландау; реалізували Ніл Ґірдхар, Томас Воутерс і Джошуа Ландау.

source: PEP 461 - percent formatting support for bytes and bytearray
uk: PEP 461 - підтримка відсоткового форматування для байтів і байтового масиву

source: :pep:`461` adds support for the ``%`` :ref:`interpolation operator <bytes-formatting>` to :class:`bytes` and :class:`bytearray`.
uk: :pep:`461` додає підтримку для ``%`` :ref:`оператора інтерполяції <bytes-formatting>` до :class:`bytes` і :class:`bytearray`.

source: While interpolation is usually thought of as a string operation, there are cases where interpolation on ``bytes`` or ``bytearrays`` makes sense, and the work needed to make up for this missing functionality detracts from the overall readability of the code. This issue is particularly important when dealing with wire format protocols, which are often a mixture of binary and ASCII compatible text.
uk: Хоча інтерполяція зазвичай розглядається як рядкова операція, є випадки, коли інтерполяція на ``bytes`` або ``bytearrays`` має сенс, і робота, необхідна для компенсації цієї відсутньої функції, погіршує загальну читабельність коду. . Ця проблема особливо важлива при роботі з протоколами дротового формату, які часто є сумішшю двійкового та ASCII-сумісного тексту.

source: Examples::
uk: Приклади::

source: Unicode is not allowed for ``%b``, but it is accepted by ``%a`` (equivalent of ``repr(obj).encode('ascii', 'backslashreplace')``)::
uk: Юнікод не дозволяється для ``%b``, але він приймається ``%a`` (еквівалент ``repr(obj).encode('ascii', 'backslashreplace')``::

source: Note that ``%s`` and ``%r`` conversion types, although supported, should only be used in codebases that need compatibility with Python 2.
uk: Зауважте, що типи перетворення ``%s`` і ``%r``, хоча й підтримуються, слід використовувати лише в кодових базах, які потребують сумісності з Python 2.

source: :pep:`461` -- Adding % formatting to bytes and bytearray
uk: :pep:`461` -- Додано форматування % до байтів і масиву байтів

source: PEP written by Ethan Furman; implemented by Neil Schemenauer and Ethan Furman.
uk: PEP, написаний Ітаном Фурманом; реалізували Ніл Шеменауер та Ітан Фурман.

source: PEP 484 - Type Hints
uk: PEP 484 – Типові підказки

source: Function annotation syntax has been a Python feature since version 3.0 (:pep:`3107`), however the semantics of annotations has been left undefined.
uk: Синтаксис анотації функції є функцією Python з версії 3.0 (:pep:`3107`), однак семантика анотацій залишилася невизначеною.

source: Experience has shown that the majority of function annotation uses were to provide type hints to function parameters and return values. It became evident that it would be beneficial for Python users, if the standard library included the base definitions and tools for type annotations.
uk: Досвід показав, що більшість анотацій функцій використовувалися для надання підказок типу для параметрів функції та повернення значень. Стало очевидним, що користувачам Python було б вигідно, якби стандартна бібліотека включала базові визначення та інструменти для анотацій типів.

source: :pep:`484` introduces a :term:`provisional module <provisional API>` to provide these standard definitions and tools, along with some conventions for situations where annotations are not available.
uk: :pep:`484` представляє :term:`тимчасовий модуль <provisional API>`, щоб надати ці стандартні визначення та інструменти, а також деякі умовності для ситуацій, коли анотації недоступні.

source: For example, here is a simple function whose argument and return type are declared in the annotations::
uk: Наприклад, ось проста функція, чий аргумент і тип повернення оголошено в анотаціях::

source: While these annotations are available at runtime through the usual :attr:`__annotations__` attribute, *no automatic type checking happens at runtime*. Instead, it is assumed that a separate off-line type checker (e.g. `mypy <http://mypy-lang.org>`_) will be used for on-demand source code analysis.
uk: Хоча ці анотації доступні під час виконання через звичайний атрибут :attr:`__annotations__`, *автоматична перевірка типу не відбувається під час виконання*. Натомість передбачається, що для аналізу вихідного коду на вимогу використовуватиметься окремий автономний засіб перевірки типу (наприклад, `mypy <http://mypy-lang.org>`_).

source: The type system supports unions, generic types, and a special type named :class:`~typing.Any` which is consistent with (i.e. assignable to and from) all types.
uk: Система типів підтримує об’єднання, загальні типи та спеціальний тип під назвою :class:`~typing.Any`, який узгоджується з усіма типами (тобто призначається до них і від них).

source: :mod:`typing` module documentation
uk: документація модуля :mod:`typing`

source: :pep:`484` -- Type Hints
uk: :pep:`484` -- Підказки щодо типу

source: PEP written by Guido van Rossum, Jukka Lehtosalo, and Łukasz Langa; implemented by Guido van Rossum.
uk: PEP, написаний Гвідо ван Россумом, Юккою Лехтосало та Лукашем Лангою; реалізований Гвідо ван Россумом.

source: :pep:`483` -- The Theory of Type Hints
uk: :pep:`483` -- Теорія підказок типів

source: PEP written by Guido van Rossum
uk: PEP, написаний Гвідо ван Россумом

source: PEP 471 - os.scandir() function -- a better and faster directory iterator
uk: PEP 471 — функція os.scandir() — кращий і швидший ітератор каталогу

source: :pep:`471` adds a new directory iteration function, :func:`os.scandir`, to the standard library. Additionally, :func:`os.walk` is now implemented using ``scandir``, which makes it 3 to 5 times faster on POSIX systems and 7 to 20 times faster on Windows systems. This is largely achieved by greatly reducing the number of calls to :func:`os.stat` required to walk a directory tree.
uk: :pep:`471` додає нову функцію ітерації каталогу, :func:`os.scandir`, до стандартної бібліотеки. Крім того, :func:`os.walk` тепер реалізовано за допомогою ``scandir``, що робить його в 3-5 разів швидшим у системах POSIX і в 7-20 разів швидшим у системах Windows. Це значною мірою досягається за рахунок значного зменшення кількості викликів :func:`os.stat`, необхідних для перегляду дерева каталогів.

source: Additionally, ``scandir`` returns an iterator, as opposed to returning a list of file names, which improves memory efficiency when iterating over very large directories.
uk: Крім того, ``scandir`` повертає ітератор, на відміну від повернення списку імен файлів, що покращує ефективність пам’яті під час повторення дуже великих каталогів.

source: The following example shows a simple use of :func:`os.scandir` to display all the files (excluding directories) in the given *path* that don't start with ``'.'``. The :meth:`entry.is_file() <os.DirEntry.is_file>` call will generally not make an additional system call::
uk: У наступному прикладі показано просте використання :func:`os.scandir` для відображення всіх файлів (за винятком каталогів) у заданому *шляху*, які не починаються з ``'.'``. Виклик :meth:`entry.is_file() <os.DirEntry.is_file>` зазвичай не виконує додаткових системних викликів:

source: :pep:`471` -- os.scandir() function -- a better and faster directory iterator
uk: :pep:`471` -- функція os.scandir() -- кращий і швидший ітератор каталогу

source: PEP written and implemented by Ben Hoyt with the help of Victor Stinner.
uk: PEP написаний і реалізований Беном Хойтом за допомогою Віктора Стіннера.

source: PEP 475: Retry system calls failing with EINTR
uk: PEP 475: повторна спроба системних викликів, які не вдалися з EINTR

source: An :py:data:`errno.EINTR` error code is returned whenever a system call, that is waiting for I/O, is interrupted by a signal. Previously, Python would raise :exc:`InterruptedError` in such cases. This meant that, when writing a Python application, the developer had two choices:
uk: Код помилки :py:data:`errno.EINTR` повертається щоразу, коли системний виклик, який очікує на введення/виведення, переривається сигналом. Раніше в таких випадках Python викликав :exc:`InterruptedError`. Це означало, що під час написання програми Python розробник мав два варіанти:

source: Ignore the ``InterruptedError``.
uk: Ігноруйте ``InterruptedError``.

source: Handle the ``InterruptedError`` and attempt to restart the interrupted system call at every call site.
uk: Обробити ``InterruptedError`` і спробувати перезапустити перерваний системний виклик на кожному місці виклику.

source: The first option makes an application fail intermittently. The second option adds a large amount of boilerplate that makes the code nearly unreadable. Compare::
uk: Перший варіант призводить до періодичного збою програми. Другий варіант додає велику кількість шаблонів, що робить код майже нечитабельним. Порівняти::

source: and::
uk: і::

source: :pep:`475` implements automatic retry of system calls on ``EINTR``. This removes the burden of dealing with ``EINTR`` or :exc:`InterruptedError` in user code in most situations and makes Python programs, including the standard library, more robust. Note that the system call is only retried if the signal handler does not raise an exception.
uk: :pep:`475` реалізує автоматичний повтор системних викликів на ``EINTR``. Це знімає тягар роботи з ``EINTR`` або :exc:`InterruptedError` у коді користувача в більшості ситуацій і робить програми Python, включаючи стандартну бібліотеку, більш надійними. Зауважте, що повторна спроба системного виклику виконується, лише якщо обробник сигналу не викликає виняткової ситуації.
