Repository: python/python-docs-uk
Catalog: whatsnew/3.5.po
Languages: uk

source: (Contributed by Yury Selivanov in :issue:`24190`.)
uk: (Надав Юрій Селіванов у :issue:`24190`.)

source: A new class method :meth:`Signature.from_callable() <inspect.Signature.from_callable>` makes subclassing of :class:`~inspect.Signature` easier. (Contributed by Yury Selivanov and Eric Snow in :issue:`17373`.)
uk: Новий метод класу :meth:`Signature.from_callable() <inspect.Signature.from_callable>` полегшує створення підкласів :class:`~inspect.Signature`. (Надано Юрієм Селівановим та Еріком Сноу в :issue:`17373`.)

source: The :func:`~inspect.signature` function now accepts a *follow_wrapped* optional keyword argument, which, when set to ``False``, disables automatic following of ``__wrapped__`` links. (Contributed by Yury Selivanov in :issue:`20691`.)
uk: Функція :func:`~inspect.signature` тепер приймає необов’язковий аргумент ключового слова *follow_wrapped*, який, якщо встановлено значення ``False``, вимикає автоматичне перехід за посиланнями ``__wrapped__``. (Надав Юрій Селіванов у :issue:`20691`.)

source: A set of new functions to inspect :term:`coroutine functions <coroutine function>` and :term:`coroutine objects <coroutine>` has been added: :func:`~inspect.iscoroutine`, :func:`~inspect.iscoroutinefunction`, :func:`~inspect.isawaitable`, :func:`~inspect.getcoroutinelocals`, and :func:`~inspect.getcoroutinestate`. (Contributed by Yury Selivanov in :issue:`24017` and :issue:`24400`.)
uk: Додано набір нових функцій для перевірки :term:`функцій співпрограми <coroutine function>` та :term:`об’єктів співпрограми <coroutine>`: :func:`~inspect.iscoroutine`, :func:`~inspect.iscoroutinefunction`, :func:`~inspect.isawaitable`, :func:`~inspect.getcoroutinelocals` і :func:`~inspect.getcoroutinestate`. (Надав Юрій Селіванов у :issue:`24017` та :issue:`24400`.)

source: The :func:`~inspect.stack`, :func:`~inspect.trace`, :func:`~inspect.getouterframes`, and :func:`~inspect.getinnerframes` functions now return a list of named tuples. (Contributed by Daniel Shahaf in :issue:`16808`.)
uk: Функції :func:`~inspect.stack`, :func:`~inspect.trace`, :func:`~inspect.getouterframes` і :func:`~inspect.getinnerframes` тепер повертають список іменованих кортежів. (Надав Даніель Шахаф у :issue:`16808`.)

source: A new :meth:`BufferedIOBase.readinto1() <io.BufferedIOBase.readinto1>` method, that uses at most one call to the underlying raw stream's :meth:`RawIOBase.read() <io.RawIOBase.read>` or :meth:`RawIOBase.readinto() <io.RawIOBase.readinto>` methods. (Contributed by Nikolaus Rath in :issue:`20578`.)
uk: Новий метод :meth:`BufferedIOBase.readinto1() <io.BufferedIOBase.readinto1>`, який використовує не більше одного виклику базового необробленого потоку методів :meth:`RawIOBase.read() <io.RawIOBase.read>` або :meth:`RawIOBase.readinto() a0c114382bc`922z0 . (Надав Ніколаус Рат у :issue:`20578`.)

source: ipaddress
uk: IP-адреса

source: Both the :class:`~ipaddress.IPv4Network` and :class:`~ipaddress.IPv6Network` classes now accept an ``(address, netmask)`` tuple argument, so as to easily construct network objects from existing addresses::
uk: Обидва класи :class:`~ipaddress.IPv4Network` і :class:`~ipaddress.IPv6Network` тепер приймають аргумент кортежу ``(адреса, маска мережі)``, щоб легко створювати мережеві об’єкти з існуючих адрес:

source: (Contributed by Peter Moody and Antoine Pitrou in :issue:`16531`.)
uk: (Надано Пітером Муді та Антуаном Пітру в :issue:`16531`.)

source: A new :attr:`~ipaddress.IPv4Network.reverse_pointer` attribute for the :class:`~ipaddress.IPv4Network` and :class:`~ipaddress.IPv6Network` classes returns the name of the reverse DNS PTR record::
uk: Новий атрибут :attr:`~ipaddress.IPv4Network.reverse_pointer` для класів :class:`~ipaddress.IPv4Network` і :class:`~ipaddress.IPv6Network` повертає назву зворотного запису DNS PTR::

source: (Contributed by Leon Weber in :issue:`20480`.)
uk: (Надав Леон Вебер у :issue:`20480`.)

source: The :mod:`json.tool` command line interface now preserves the order of keys in JSON objects passed in input. The new ``--sort-keys`` option can be used to sort the keys alphabetically. (Contributed by Berker Peksag in :issue:`21650`.)
uk: Інтерфейс командного рядка :mod:`json.tool` тепер зберігає порядок ключів в об’єктах JSON, переданих у вхідних даних. Новий параметр ``--sort-keys`` можна використовувати для сортування ключів за алфавітом. (Надано Berker Peksag у :issue:`21650`.)

source: JSON decoder now raises :exc:`~json.JSONDecodeError` instead of :exc:`ValueError` to provide better context information about the error. (Contributed by Serhiy Storchaka in :issue:`19361`.)
uk: Декодер JSON тепер викликає :exc:`~json.JSONDecodeError` замість :exc:`ValueError`, щоб надати кращу контекстну інформацію про помилку. (Надав Сергій Сторчака в :issue:`19361`.)

source: linecache
uk: лінійний кеш

source: A new :func:`~linecache.lazycache` function can be used to capture information about a non-file-based module to permit getting its lines later via :func:`~linecache.getline`. This avoids doing I/O until a line is actually needed, without having to carry the module globals around indefinitely. (Contributed by Robert Collins in :issue:`17911`.)
uk: Нову функцію :func:`~linecache.lazycache` можна використовувати для захоплення інформації про нефайловий модуль, щоб дозволити отримати його рядки пізніше через :func:`~linecache.getline`. Це дозволяє уникнути введення/виведення, доки рядок дійсно не знадобиться, без необхідності носити глобальні модулі безкінечно. (Надав Роберт Коллінз у :issue:`17911`.)

source: locale
uk: локаль

source: A new :func:`~locale.delocalize` function can be used to convert a string into a normalized number string, taking the ``LC_NUMERIC`` settings into account::
uk: Нову функцію :func:`~locale.delocalize` можна використовувати для перетворення рядка в нормалізований рядок чисел, враховуючи параметри ``LC_NUMERIC``:

source: (Contributed by Cédric Krier in :issue:`13918`.)
uk: (Надав Седрик Крієр у :issue:`13918`.)

source: logging
uk: лісозаготівля

source: All logging methods (:class:`~logging.Logger` :meth:`~logging.Logger.log`, :meth:`~logging.Logger.exception`, :meth:`~logging.Logger.critical`, :meth:`~logging.Logger.debug`, etc.), now accept exception instances as an *exc_info* argument, in addition to boolean values and exception tuples::
uk: Усі методи журналювання (:class:`~logging.Logger` :meth:`~logging.Logger.log`, :meth:`~logging.Logger.exception`, :meth:`~logging.Logger.critical`, :meth:`~logging.Logger.debug` тощо), тепер приймають випадки винятків як аргумент *exc_info* на додаток до логічних значень і кортежів винятків::

source: (Contributed by Yury Selivanov in :issue:`20537`.)
uk: (Надав Юрій Селіванов у :issue:`20537`.)

source: The :class:`handlers.HTTPHandler <logging.handlers.HTTPHandler>` class now accepts an optional :class:`ssl.SSLContext` instance to configure SSL settings used in an HTTP connection. (Contributed by Alex Gaynor in :issue:`22788`.)
uk: Клас :class:`handlers.HTTPHandler <logging.handlers.HTTPHandler>` тепер приймає додатковий екземпляр :class:`ssl.SSLContext` для налаштування параметрів SSL, які використовуються в HTTP-з’єднанні. (Надав Алекс Гейнор у :issue:`22788`.)

source: The :class:`handlers.QueueListener <logging.handlers.QueueListener>` class now takes a *respect_handler_level* keyword argument which, if set to ``True``, will pass messages to handlers taking handler levels into account. (Contributed by Vinay Sajip.)
uk: Клас :class:`handlers.QueueListener <logging.handlers.QueueListener>` тепер приймає аргумент ключового слова *respect_handler_level*, який, якщо встановити значення ``True``, передаватиме повідомлення обробникам з урахуванням рівнів обробників. (Надав Віней Саджип.)

source: The :meth:`LZMADecompressor.decompress() <lzma.LZMADecompressor.decompress>` method now accepts an optional *max_length* argument to limit the maximum size of decompressed data. (Contributed by Martin Panter in :issue:`15955`.)
uk: Метод :meth:`LZMADecompressor.decompress() <lzma.LZMADecompressor.decompress>` тепер приймає додатковий аргумент *max_length* для обмеження максимального розміру розпакованих даних. (Надав Мартін Пантер у :issue:`15955`.)

source: math
uk: математика

source: Two new constants have been added to the :mod:`math` module: :data:`~math.inf` and :data:`~math.nan`. (Contributed by Mark Dickinson in :issue:`23185`.)
uk: До модуля :mod:`math` додано дві нові константи: :data:`~math.inf` і :data:`~math.nan`. (Надав Марк Дікінсон у :issue:`23185`.)

source: A new function :func:`~math.isclose` provides a way to test for approximate equality. (Contributed by Chris Barker and Tal Einat in :issue:`24270`.)
uk: Нова функція :func:`~math.isclose` надає спосіб перевірити приблизну рівність. (Надано Крісом Баркером і Тал Ейнатом у :issue:`24270`.)

source: A new :func:`~math.gcd` function has been added. The :func:`fractions.gcd` function is now deprecated. (Contributed by Mark Dickinson and Serhiy Storchaka in :issue:`22486`.)
uk: Додано нову функцію :func:`~math.gcd`. Функція :func:`fractions.gcd` тепер застаріла. (Надано Марком Дікінсоном і Сергієм Сторчакою в :issue:`22486`.)

source: multiprocessing
uk: багатопроцесорність

source: :func:`sharedctypes.synchronized() <multiprocessing.sharedctypes.synchronized>` objects now support the :term:`context manager` protocol. (Contributed by Charles-François Natali in :issue:`21565`.)
uk: :func:`sharedctypes.synchronized() <multiprocessing.sharedctypes.synchronized>` об’єкти тепер підтримують протокол :term:`context manager`. (Надав Шарль-Франсуа Наталі в :issue:`21565`.)

source: operator
uk: оператор

source: :func:`~operator.attrgetter`, :func:`~operator.itemgetter`, and :func:`~operator.methodcaller` objects now support pickling. (Contributed by Josh Rosenberg and Serhiy Storchaka in :issue:`22955`.)
uk: Об’єкти :func:`~operator.attrgetter`, :func:`~operator.itemgetter` і :func:`~operator.methodcaller` тепер підтримують травлення. (Надано Джошем Розенбергом і Сергієм Сторчакою в :issue:`22955`.)

source: New :func:`~operator.matmul` and :func:`~operator.imatmul` functions to perform matrix multiplication. (Contributed by Benjamin Peterson in :issue:`21176`.)
uk: Нові функції :func:`~operator.matmul` і :func:`~operator.imatmul` для виконання множення матриць. (Надав Бенджамін Петерсон у :issue:`21176`.)

source: os
uk: ос

source: The new :func:`~os.scandir` function returning an iterator of :class:`~os.DirEntry` objects has been added. If possible, :func:`~os.scandir` extracts file attributes while scanning a directory, removing the need to perform subsequent system calls to determine file type or attributes, which may significantly improve performance. (Contributed by Ben Hoyt with the help of Victor Stinner in :issue:`22524`.)
uk: Додано нову функцію :func:`~os.scandir`, яка повертає ітератор об’єктів :class:`~os.DirEntry`. Якщо можливо, :func:`~os.scandir` витягує атрибути файлів під час сканування каталогу, усуваючи необхідність виконувати наступні системні виклики для визначення типу файлу або атрибутів, що може значно покращити продуктивність. (Надано Беном Хойтом за допомогою Віктора Стіннера в :issue:`22524`.)

source: On Windows, a new :attr:`stat_result.st_file_attributes <os.stat_result.st_file_attributes>` attribute is now available. It corresponds to the ``dwFileAttributes`` member of the ``BY_HANDLE_FILE_INFORMATION`` structure returned by ``GetFileInformationByHandle()``. (Contributed by Ben Hoyt in :issue:`21719`.)
uk: У Windows тепер доступний новий атрибут :attr:`stat_result.st_file_attributes <os.stat_result.st_file_attributes>`. Він відповідає члену ``dwFileAttributes`` структури ``BY_HANDLE_FILE_INFORMATION``, яку повертає ``GetFileInformationByHandle()``. (Надав Бен Хойт у :issue:`21719`.)

source: The :func:`~os.urandom` function now uses the ``getrandom()`` syscall on Linux 3.17 or newer, and ``getentropy()`` on OpenBSD 5.6 and newer, removing the need to use ``/dev/urandom`` and avoiding failures due to potential file descriptor exhaustion. (Contributed by Victor Stinner in :issue:`22181`.)
uk: Функція :func:`~os.urandom` тепер використовує системний виклик ``getrandom()`` у Linux 3.17 або новіших версіях і ``getentropy()`` в OpenBSD 5.6 і новіших версіях, усуваючи необхідність використовувати ``/ dev/urandom`` та уникнення збоїв через потенційне вичерпання дескриптора файлу. (Надав Віктор Стіннер у :issue:`22181`.)

source: New :func:`~os.get_blocking` and :func:`~os.set_blocking` functions allow getting and setting a file descriptor's blocking mode (:data:`~os.O_NONBLOCK`.) (Contributed by Victor Stinner in :issue:`22054`.)
uk: Нові функції :func:`~os.get_blocking` і :func:`~os.set_blocking` дозволяють отримати та встановити режим блокування дескриптора файлу (:data:`~os.O_NONBLOCK`.) (Надано Віктором Стіннером у :issue:`22054`.)

source: The :func:`~os.truncate` and :func:`~os.ftruncate` functions are now supported on Windows. (Contributed by Steve Dower in :issue:`23668`.)
uk: Функції :func:`~os.truncate` і :func:`~os.ftruncate` тепер підтримуються в Windows. (Надав Стів Дауер у :issue:`23668`.)

source: There is a new :func:`os.path.commonpath` function returning the longest common sub-path of each passed pathname. Unlike the :func:`os.path.commonprefix` function, it always returns a valid path::
uk: Існує нова функція :func:`os.path.commonpath`, яка повертає найдовший загальний підшлях кожного переданого шляху. На відміну від функції :func:`os.path.commonprefix`, вона завжди повертає дійсний шлях::

source: (Contributed by Rafik Draoui and Serhiy Storchaka in :issue:`10395`.)
uk: (Надано Рафіком Драуї та Сергієм Сторчакою в :issue:`10395`.)

source: The new :meth:`Path.samefile() <pathlib.Path.samefile>` method can be used to check whether the path points to the same file as another path, which can be either another :class:`~pathlib.Path` object, or a string::
uk: Новий метод :meth:`Path.samefile() <pathlib.Path.samefile>` можна використовувати, щоб перевірити, чи шлях вказує на той самий файл, що й інший шлях, який може бути іншим об’єктом :class:`~pathlib.Path` або рядком ::

source: (Contributed by Vajrasky Kok and Antoine Pitrou in :issue:`19775`.)
uk: (Надано Vajrasky Kok і Antoine Pitrou у :issue:`19775`.)

source: The :meth:`Path.mkdir() <pathlib.Path.mkdir>` method now accepts a new optional *exist_ok* argument to match ``mkdir -p`` and :func:`os.makedirs` functionality. (Contributed by Berker Peksag in :issue:`21539`.)
uk: Метод :meth:`Path.mkdir() <pathlib.Path.mkdir>` тепер приймає новий необов’язковий аргумент *exist_ok* для відповідності ``mkdir -p`` і функції :func:`os.makedirs`. (Надано Berker Peksag у :issue:`21539`.)

source: There is a new :meth:`Path.expanduser() <pathlib.Path.expanduser>` method to expand ``~`` and ``~user`` prefixes. (Contributed by Serhiy Storchaka and Claudiu Popa in :issue:`19776`.)
uk: Існує новий метод :meth:`Path.expanduser() <pathlib.Path.expanduser>` для розширення префіксів ``~`` і ``~user``. (Надано Сергієм Сторчакою та Клаудіу Попою в :issue:`19776`.)

source: A new :meth:`Path.home() <pathlib.Path.home>` class method can be used to get a :class:`~pathlib.Path` instance representing the user’s home directory. (Contributed by Victor Salgado and Mayank Tripathi in :issue:`19777`.)
uk: Новий метод класу :meth:`Path.home() <pathlib.Path.home>` можна використовувати для отримання екземпляра :class:`~pathlib.Path`, який представляє домашній каталог користувача. (Надано Віктором Сальгадо та Маянком Тріпаті в :issue:`19777`.)

source: New :meth:`Path.write_text() <pathlib.Path.write_text>`, :meth:`Path.read_text() <pathlib.Path.read_text>`, :meth:`Path.write_bytes() <pathlib.Path.write_bytes>`, :meth:`Path.read_bytes() <pathlib.Path.read_bytes>` methods to simplify read/write operations on files.
uk: Нові методи :meth:`Path.write_text() <pathlib.Path.write_text>`, :meth:`Path.read_text() <pathlib.Path.read_text>`, :meth:`Path.write_bytes() <pathlib.Path.write_bytes>`, :meth:`Path.read_bytes()` для спрощення операцій читання/запису файлів.

source: The following code snippet will create or rewrite existing file ``~/spam42``::
uk: Наступний фрагмент коду створить або перепише існуючий файл ``~/spam42``::

source: (Contributed by Christopher Welborn in :issue:`20218`.)
uk: (Надав Крістофер Велборн у :issue:`20218`.)

source: pickle
uk: маринований огірок

source: Nested objects, such as unbound methods or nested classes, can now be pickled using :ref:`pickle protocols <pickle-protocols>` older than protocol version 4. Protocol version 4 already supports these cases. (Contributed by Serhiy Storchaka in :issue:`23611`.)
uk: Вкладені об’єкти, такі як незв’язані методи чи вкладені класи, тепер можна вибирати за допомогою :ref:`протоколів pickle <pickle-protocols>`, старших за протокол версії 4. Протокол версії 4 уже підтримує ці випадки. (Надав Сергій Сторчака в :issue:`23611`.)

source: poplib
uk: попліб

source: A new :meth:`POP3.utf8() <poplib.POP3.utf8>` command enables :rfc:`6856` (Internationalized Email) support, if a POP server supports it. (Contributed by Milan OberKirch in :issue:`21804`.)
uk: Нова команда :meth:`POP3.utf8() <poplib.POP3.utf8>` вмикає підтримку :rfc:`6856` (інтернаціоналізованої електронної пошти), якщо це підтримує POP-сервер. (Надано Milan OberKirch у :issue:`21804`.)

source: re
uk: повторно

source: References and conditional references to groups with fixed length are now allowed in lookbehind assertions::
uk: Посилання та умовні посилання на групи з фіксованою довжиною тепер дозволені в ретроспективних твердженнях::

source: (Contributed by Serhiy Storchaka in :issue:`9179`.)
uk: (Надав Сергій Сторчака в :issue:`9179`.)

source: The number of capturing groups in regular expressions is no longer limited to 100. (Contributed by Serhiy Storchaka in :issue:`22437`.)
uk: Кількість груп захоплення в регулярних виразах більше не обмежується 100. (Надано Сергієм Сторчакою в :issue:`22437`.)

source: The :func:`~re.sub` and :func:`~re.subn` functions now replace unmatched groups with empty strings instead of raising an exception. (Contributed by Serhiy Storchaka in :issue:`1519638`.)
uk: Функції :func:`~re.sub` і :func:`~re.subn` тепер замінюють невідповідні групи порожніми рядками замість того, щоб викликати виключення. (Надав Сергій Сторчака в :issue:`1519638`.)

source: The :class:`re.error` exceptions have new attributes, :attr:`~re.error.msg`, :attr:`~re.error.pattern`, :attr:`~re.error.pos`, :attr:`~re.error.lineno`, and :attr:`~re.error.colno`, that provide better context information about the error::
uk: Винятки :class:`re.error` мають нові атрибути, :attr:`~re.error.msg`, :attr:`~re.error.pattern`, :attr:`~re.error.pos`, :attr:`~re.error.lineno` і :attr:`~re.error.colno`, які надають кращу контекстну інформацію про помилку::

source: (Contributed by Serhiy Storchaka in :issue:`22578`.)
uk: (Надав Сергій Сторчака в :issue:`22578`.)

source: A new :func:`~readline.append_history_file` function can be used to append the specified number of trailing elements in history to the given file. (Contributed by Bruno Cauet in :issue:`22940`.)
uk: Нову функцію :func:`~readline.append_history_file` можна використовувати для додавання вказаної кількості кінцевих елементів в історії до даного файлу. (Надав Бруно Кауе в :issue:`22940`.)

source: selectors
uk: селектори

source: The new :class:`~selectors.DevpollSelector` supports efficient ``/dev/poll`` polling on Solaris. (Contributed by Giampaolo Rodola' in :issue:`18931`.)
uk: Новий :class:`~selectors.DevpollSelector` підтримує ефективне опитування ``/dev/poll`` у Solaris. (Надав Джампаоло Родола в :issue:`18931`.)

source: shutil
uk: шутил

source: The :func:`~shutil.move` function now accepts a *copy_function* argument, allowing, for example, the :func:`~shutil.copy` function to be used instead of the default :func:`~shutil.copy2` if there is a need to ignore file metadata when moving. (Contributed by Claudiu Popa in :issue:`19840`.)
uk: Функція :func:`~shutil.move` тепер приймає аргумент *copy_function*, що дозволяє, наприклад, використовувати функцію :func:`~shutil.copy` замість стандартного :func:`~shutil.copy2` якщо необхідно ігнорувати метадані файлу під час переміщення. (Надав Клаудіу Попа в :issue:`19840`.)

source: The :func:`~shutil.make_archive` function now supports the *xztar* format. (Contributed by Serhiy Storchaka in :issue:`5411`.)
uk: Функція :func:`~shutil.make_archive` тепер підтримує формат *xztar*. (Надав Сергій Сторчака в :issue:`5411`.)

source: signal
uk: сигнал

source: On Windows, the :func:`~signal.set_wakeup_fd` function now also supports socket handles. (Contributed by Victor Stinner in :issue:`22018`.)
uk: У Windows функція :func:`~signal.set_wakeup_fd` тепер також підтримує дескриптори сокетів. (Надав Віктор Стіннер у :issue:`22018`.)

source: Various ``SIG*`` constants in the :mod:`signal` module have been converted into :mod:`Enums <enum>`. This allows meaningful names to be printed during debugging, instead of integer "magic numbers". (Contributed by Giampaolo Rodola' in :issue:`21076`.)
uk: Різні константи ``SIG*`` в модулі :mod:`signal` були перетворені в :mod:`Enums <enum>`. Це дозволяє друкувати осмислені імена під час налагодження замість цілих "магічних чисел". (Надав Джампаоло Родола в :issue:`21076`.)

source: Both the :class:`~smtpd.SMTPServer` and :class:`~smtpd.SMTPChannel` classes now accept a *decode_data* keyword argument to determine if the ``DATA`` portion of the SMTP transaction is decoded using the ``"utf-8"`` codec or is instead provided to the :meth:`SMTPServer.process_message() <smtpd.SMTPServer.process_message>` method as a byte string. The default is ``True`` for backward compatibility reasons, but will change to ``False`` in Python 3.6. If *decode_data* is set to ``False``, the ``process_message`` method must be prepared to accept keyword arguments. (Contributed by Maciej Szulik in :issue:`19662`.)
uk: Обидва класи :class:`~smtpd.SMTPServer` і :class:`~smtpd.SMTPChannel` тепер приймають аргумент ключового слова *decode_data*, щоб визначити, чи частина ``DATA`` транзакції SMTP декодується за допомогою кодек ``"utf-8"`` або замість цього надається методу :meth:`SMTPServer.process_message() <smtpd.SMTPServer.process_message>` як рядок байтів. За замовчуванням встановлено ``True`` з міркувань зворотної сумісності, але зміниться на ``False`` у Python 3.6. Якщо *decode_data* має значення ``False``, метод ``process_message`` має бути готовий приймати аргументи ключового слова. (Надав Мацей Шулік у :issue:`19662`.)

source: The :class:`~smtpd.SMTPServer` class now advertises the ``8BITMIME`` extension (:rfc:`6152`) if *decode_data* has been set ``True``. If the client specifies ``BODY=8BITMIME`` on the ``MAIL`` command, it is passed to :meth:`SMTPServer.process_message() <smtpd.SMTPServer.process_message>` via the *mail_options* keyword. (Contributed by Milan Oberkirch and R. David Murray in :issue:`21795`.)
uk: Клас :class:`~smtpd.SMTPServer` тепер рекламує розширення ``8BITMIME`` (:rfc:`6152`), якщо для *decode_data* встановлено ``True``. Якщо клієнт вказує ``BODY=8BITMIME`` у команді ``MAIL``, вона передається до :meth:`SMTPServer.process_message() <smtpd.SMTPServer.process_message>` через ключове слово *mail_options*. (Надано Міланом Оберкірхом і Р. Девідом Мюрреєм у :issue:`21795`.)
