Repository: python/python-docs-uk
Catalog: whatsnew/3.5.po
Languages: uk

source: Below is a list of functions which are now retried when interrupted by a signal:
uk: Нижче наведено список функцій, які зараз виконуються повторно, коли їх перериває сигнал:

source: :func:`open` and :func:`io.open`;
uk: :func:`open` і :func:`io.open`;

source: functions of the :mod:`faulthandler` module;
uk: функції модуля :mod:`faulthandler`;

source: :mod:`os` functions: :func:`~os.fchdir`, :func:`~os.fchmod`, :func:`~os.fchown`, :func:`~os.fdatasync`, :func:`~os.fstat`, :func:`~os.fstatvfs`, :func:`~os.fsync`, :func:`~os.ftruncate`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.posix_fadvise`, :func:`~os.posix_fallocate`, :func:`~os.pread`, :func:`~os.pwrite`, :func:`~os.read`, :func:`~os.readv`, :func:`~os.sendfile`, :func:`~os.wait3`, :func:`~os.wait4`, :func:`~os.wait`, :func:`~os.waitid`, :func:`~os.waitpid`, :func:`~os.write`, :func:`~os.writev`;
uk: :mod:`os` функції: :func:`~os.fchdir`, :func:`~os.fchmod`, :func:`~os.fchown`, :func:`~os.fdatasync`, :func:`~os.fstat`, :func:`~os.fstatvfs`, :func:`~os.fsync`, :func:`~os.ftruncate`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.posix_fadvise`, :func:`~os.posix_fallocate`, :func:`~os.pread`, :func:`~os.pwrite`, :func:`~os.read`, :func:`~os.readv`, :func:`~os.sendfile`, :func:`~os.wait3`, :func:`~os.wait4`, :func:`~os.wait`, :func:`~os.waitid`, :func:`~os.waitpid`, :func:`~os.write`, :func:`~os.writev`;

source: special cases: :func:`os.close` and :func:`os.dup2` now ignore :py:data:`~errno.EINTR` errors; the syscall is not retried (see the PEP for the rationale);
uk: спеціальні випадки: :func:`os.close` і :func:`os.dup2` тепер ігнорують помилки :py:data:`~errno.EINTR`; системний виклик не повторюється (обґрунтування див. у PEP);

source: :mod:`select` functions: :func:`devpoll.poll() <select.devpoll.poll>`, :func:`epoll.poll() <select.epoll.poll>`, :func:`kqueue.control() <select.kqueue.control>`, :func:`poll.poll() <select.poll.poll>`, :func:`~select.select`;
uk: :mod:`select` функції: :func:`devpoll.poll() <select.devpoll.poll>`, :func:`epoll.poll() <select.epoll.poll>`, :func:`kqueue.control() <select.kqueue.control>`, :func:`poll. poll() <select.poll.poll>`, :func:`~select.select`;

source: methods of the :class:`~socket.socket` class: :meth:`~socket.socket.accept`, :meth:`~socket.socket.connect` (except for non-blocking sockets), :meth:`~socket.socket.recv`, :meth:`~socket.socket.recvfrom`, :meth:`~socket.socket.recvmsg`, :meth:`~socket.socket.send`, :meth:`~socket.socket.sendall`, :meth:`~socket.socket.sendmsg`, :meth:`~socket.socket.sendto`;
uk: методи класу :class:`~socket.socket`: :meth:`~socket.socket.accept`, :meth:`~socket.socket.connect` (крім неблокуючих сокетів), :meth:`~socket.socket.recv`, :meth:`~socket.socket.recvfrom`, :meth:`~socket.socket.recvmsg`, :meth:`~socket.socket.send`, :meth:`~сокет .socket.sendall`, :meth:`~socket.socket.sendmsg`, :meth:`~socket.socket.sendto`;

source: :func:`signal.sigtimedwait` and :func:`signal.sigwaitinfo`;
uk: :func:`signal.sigtimedwait` і :func:`signal.sigwaitinfo`;

source: :pep:`475` -- Retry system calls failing with EINTR
uk: :pep:`475` -- Повторити системні виклики, які не вдалися з EINTR

source: PEP and implementation written by Charles-François Natali and Victor Stinner, with the help of Antoine Pitrou (the French connection).
uk: PEP та реалізація написані Шарлем-Франсуа Наталі та Віктором Стіннером за допомогою Антуана Пітру (французький зв’язок).

source: PEP 479: Change StopIteration handling inside generators
uk: PEP 479: змініть обробку StopIteration всередині генераторів

source: The interaction of generators and :exc:`StopIteration` in Python 3.4 and earlier was sometimes surprising, and could conceal obscure bugs. Previously, ``StopIteration`` raised accidentally inside a generator function was interpreted as the end of the iteration by the loop construct driving the generator.
uk: Взаємодія генераторів і :exc:`StopIteration` в Python 3.4 і раніших версіях іноді була несподіваною і могла приховувати незрозумілі помилки. Раніше ``StopIteration``, викликаний випадково у функції генератора, інтерпретувався як кінець ітерації конструкцією циклу, що керує генератором.

source: :pep:`479` changes the behavior of generators: when a ``StopIteration`` exception is raised inside a generator, it is replaced with a :exc:`RuntimeError` before it exits the generator frame. The main goal of this change is to ease debugging in the situation where an unguarded :func:`next` call raises ``StopIteration`` and causes the iteration controlled by the generator to terminate silently. This is particularly pernicious in combination with the ``yield from`` construct.
uk: :pep:`479` змінює поведінку генераторів: коли всередині генератора виникає виняткова ситуація ``StopIteration``, вона замінюється на :exc:`RuntimeError` перед тим, як вийти з кадру генератора. Основна мета цієї зміни полягає в тому, щоб полегшити налагодження в ситуації, коли незахищений виклик :func:`next` викликає ``StopIteration`` і змушує ітерацію, керовану генератором, мовчки завершувати. Це особливо згубно в поєднанні з конструкцією ``вихід від``.

source: This is a backwards incompatible change, so to enable the new behavior, a :term:`__future__` import is necessary::
uk: Це зворотно несумісна зміна, тому, щоб увімкнути нову поведінку, потрібен імпорт :term:`__future__`::

source: Without a ``__future__`` import, a :exc:`PendingDeprecationWarning` will be raised whenever a :exc:`StopIteration` exception is raised inside a generator.
uk: Без імпорту ``__future__`` :exc:`PendingDeprecationWarning` буде викликано щоразу, коли всередині генератора буде викликано виключення :exc:`StopIteration`.

source: :pep:`479` -- Change StopIteration handling inside generators
uk: :pep:`479` -- Змінити обробку StopIteration всередині генераторів

source: PEP written by Chris Angelico and Guido van Rossum. Implemented by Chris Angelico, Yury Selivanov and Nick Coghlan.
uk: PEP, написаний Крісом Анджеліко та Гвідо ван Россумом. Реалізували Кріс Анжеліко, Юрій Селіванов та Нік Коглан.

source: PEP 485: A function for testing approximate equality
uk: PEP 485: функція для перевірки приблизної рівності

source: :pep:`485` adds the :func:`math.isclose` and :func:`cmath.isclose` functions which tell whether two values are approximately equal or "close" to each other. Whether or not two values are considered close is determined according to given absolute and relative tolerances. Relative tolerance is the maximum allowed difference between ``isclose`` arguments, relative to the larger absolute value::
uk: :pep:`485` додає функції :func:`math.isclose` і :func:`cmath.isclose`, які повідомляють, чи є два значення приблизно рівними або "близькими" одне до одного. Чи вважаються два значення близькими чи ні, визначається відповідно до заданих абсолютних і відносних допусків. Відносний допуск — це максимально дозволена різниця між аргументами ``isclose`` відносно більшого абсолютного значення::

source: It is also possible to compare two values using absolute tolerance, which must be a non-negative value::
uk: Також можна порівняти два значення, використовуючи абсолютний допуск, який має бути невід’ємним значенням:

source: :pep:`485` -- A function for testing approximate equality
uk: :pep:`485` -- Функція для перевірки приблизної рівності

source: PEP written by Christopher Barker; implemented by Chris Barker and Tal Einat.
uk: PEP, написаний Крістофером Баркером; реалізували Кріс Баркер і Тал Ейнат.

source: PEP 486: Make the Python Launcher aware of virtual environments
uk: PEP 486: інформуйте програму запуску Python про віртуальні середовища

source: :pep:`486` makes the Windows launcher (see :pep:`397`) aware of an active virtual environment. When the default interpreter would be used and the ``VIRTUAL_ENV`` environment variable is set, the interpreter in the virtual environment will be used.
uk: :pep:`486` повідомляє програму запуску Windows (див. :pep:`397`) про активне віртуальне середовище. Якщо використовуватиметься інтерпретатор за замовчуванням і встановлено змінну середовища ``VIRTUAL_ENV``, використовуватиметься інтерпретатор у віртуальному середовищі.

source: :pep:`486` -- Make the Python Launcher aware of virtual environments
uk: :pep:`486` -- Зробіть програму запуску Python інформованою про віртуальні середовища

source: PEP written and implemented by Paul Moore.
uk: PEP написаний і реалізований Полом Муром.

source: PEP 488: Elimination of PYO files
uk: PEP 488: видалення файлів PYO

source: :pep:`488` does away with the concept of ``.pyo`` files. This means that ``.pyc`` files represent both unoptimized and optimized bytecode. To prevent the need to constantly regenerate bytecode files, ``.pyc`` files now have an optional ``opt-`` tag in their name when the bytecode is optimized. This has the side-effect of no more bytecode file name clashes when running under either :option:`-O` or :option:`-OO`. Consequently, bytecode files generated from :option:`-O`, and :option:`-OO` may now exist simultaneously. :func:`importlib.util.cache_from_source` has an updated API to help with this change.
uk: :pep:`488` скасовує концепцію файлів ``.pyo``. Це означає, що файли ``.pyc`` представляють як неоптимізований, так і оптимізований байт-код. Щоб уникнути необхідності постійного відновлення файлів байт-коду, файли ``.pyc`` тепер мають додатковий тег ``opt-`` у своїй назві, коли байт-код оптимізується. Побічним ефектом цього є відсутність зіткнень імен файлів байт-кодів під час роботи з :option:`-O` або :option:`-OO`. Отже, файли байт-коду, створені за допомогою :option:`-O` і :option:`-OO`, тепер можуть існувати одночасно. :func:`importlib.util.cache_from_source` має оновлений API, щоб допомогти з цією зміною.

source: :pep:`488` -- Elimination of PYO files
uk: :pep:`488` -- Видалення файлів PYO

source: PEP written and implemented by Brett Cannon.
uk: PEP написаний і реалізований Бреттом Кенноном.

source: PEP 489: Multi-phase extension module initialization
uk: PEP 489: Ініціалізація багатофазного модуля розширення

source: :pep:`489` updates extension module initialization to take advantage of the two step module loading mechanism introduced by :pep:`451` in Python 3.4.
uk: :pep:`489` оновлює ініціалізацію модуля розширення, щоб скористатися двоетапним механізмом завантаження модуля, представленим :pep:`451` у Python 3.4.

source: This change brings the import semantics of extension modules that opt-in to using the new mechanism much closer to those of Python source and bytecode modules, including the ability to use any valid identifier as a module name, rather than being restricted to ASCII.
uk: Ця зміна наближає семантику імпорту модулів розширення, які вибирають використання нового механізму, до семантики вихідного коду Python і модулів байт-коду, включаючи можливість використовувати будь-який дійсний ідентифікатор як ім’я модуля, а не обмеження ASCII.

source: :pep:`489` -- Multi-phase extension module initialization
uk: :pep:`489` -- Ініціалізація багатофазного модуля розширення

source: PEP written by Petr Viktorin, Stefan Behnel, and Nick Coghlan; implemented by Petr Viktorin.
uk: PEP, написаний Петром Вікторіним, Стефаном Бенелем і Ніком Когланом; реалізував Петро Вікторін.

source: Other Language Changes
uk: Інші зміни мови

source: Some smaller changes made to the core Python language are:
uk: Деякі менші зміни, внесені до основної мови Python:

source: Added the ``"namereplace"`` error handlers. The ``"backslashreplace"`` error handlers now work with decoding and translating. (Contributed by Serhiy Storchaka in :issue:`19676` and :issue:`22286`.)
uk: Додано обробники помилок ``"namereplace"``. Обробники помилок ``"backslashreplace"`` тепер працюють з декодуванням і перекладом. (Надав Сергій Сторчака в :issue:`19676` і :issue:`22286`.)

source: The :option:`-b` option now affects comparisons of :class:`bytes` with :class:`int`. (Contributed by Serhiy Storchaka in :issue:`23681`.)
uk: Параметр :option:`-b` тепер впливає на порівняння :class:`bytes` з :class:`int`. (Надав Сергій Сторчака в :issue:`23681`.)

source: New Kazakh ``kz1048`` and Tajik ``koi8_t`` :ref:`codecs <standard-encodings>`. (Contributed by Serhiy Storchaka in :issue:`22682` and :issue:`22681`.)
uk: Нові казахські ``kz1048`` і таджицькі ``koi8_t`` :ref:`кодеки <standard-encodings>`. (Надав Сергій Сторчака в :issue:`22682` і :issue:`22681`.)

source: Property docstrings are now writable. This is especially useful for :func:`collections.namedtuple` docstrings. (Contributed by Berker Peksag in :issue:`24064`.)
uk: Документаційні рядки властивостей тепер доступні для запису. Це особливо корисно для рядків документів :func:`collections.namedtuple`. (Надано Berker Peksag у :issue:`24064`.)

source: Circular imports involving relative imports are now supported. (Contributed by Brett Cannon and Antoine Pitrou in :issue:`17636`.)
uk: Тепер підтримується циклічний імпорт із відносним імпортом. (Надано Бреттом Кенноном і Антуаном Пітру в :issue:`17636`.)

source: New Modules
uk: Нові модулі

source: typing
uk: введення тексту

source: The new :mod:`typing` :term:`provisional <provisional API>` module provides standard definitions and tools for function type annotations. See :ref:`Type Hints <whatsnew-pep-484>` for more information.
uk: Новий модуль :mod:`typing` :term:`provisional <provisional API>` надає стандартні визначення та інструменти для анотацій типів функцій. Дивіться :ref:`Підказки типу <whatsnew-pep-484>` для отримання додаткової інформації.

source: zipapp
uk: zipap

source: The new :mod:`zipapp` module (specified in :pep:`441`) provides an API and command line tool for creating executable Python Zip Applications, which were introduced in Python 2.6 in :issue:`1739468`, but which were not well publicized, either at the time or since.
uk: Новий модуль :mod:`zipapp` (зазначений у :pep:`441`) надає API та інструмент командного рядка для створення виконуваних програм Python Zip, які були представлені в Python 2.6 у :issue:`1739468`, але які були не було широко розголошено ні в той час, ні після.

source: With the new module, bundling your application is as simple as putting all the files, including a ``__main__.py`` file, into a directory ``myapp`` and running:
uk: З новим модулем об’єднати вашу програму так само просто, як помістити всі файли, включно з файлом ``__main__.py``, у каталог ``myapp`` і запустити:

source: The module implementation has been contributed by Paul Moore in :issue:`23491`.
uk: Реалізацію модуля надав Пол Мур у :issue:`23491`.

source: :pep:`441` -- Improving Python ZIP Application Support
uk: :pep:`441` -- Покращення підтримки програм Python ZIP

source: Improved Modules
uk: Покращені модулі

source: The :class:`~argparse.ArgumentParser` class now allows disabling :ref:`abbreviated usage <prefix-matching>` of long options by setting :ref:`allow_abbrev` to ``False``. (Contributed by Jonathan Paugh, Steven Bethard, paul j3 and Daniel Eriksson in :issue:`14910`.)
uk: Клас :class:`~argparse.ArgumentParser` тепер дозволяє вимкнути :ref:`скорочене використання <prefix-matching>` довгих параметрів, встановивши :ref:`allow_abbrev` значення ``False``. (Надано Джонатаном По, Стівеном Бетардом, Полом j3 і Даніелем Ерікссоном у :issue:`14910`.)

source: Since the :mod:`asyncio` module is :term:`provisional <provisional API>`, all changes introduced in Python 3.5 have also been backported to Python 3.4.x.
uk: Оскільки модуль :mod:`asyncio` є :term:`тимчасовим <provisional API>`, усі зміни, внесені в Python 3.5, також було перенесено до Python 3.4.x.

source: Notable changes in the :mod:`asyncio` module since Python 3.4.0:
uk: Помітні зміни в модулі :mod:`asyncio` з Python 3.4.0:

source: New debugging APIs: :meth:`loop.set_debug() <asyncio.loop.set_debug>` and :meth:`loop.get_debug() <asyncio.loop.get_debug>` methods. (Contributed by Victor Stinner.)
uk: Нові API налагодження: методи :meth:`loop.set_debug() <asyncio.loop.set_debug>` і :meth:`loop.get_debug() <asyncio.loop.get_debug>`. (Надав Віктор Стіннер.)

source: The proactor event loop now supports SSL. (Contributed by Antoine Pitrou and Victor Stinner in :issue:`22560`.)
uk: Цикл подій proactor тепер підтримує SSL. (Надано Антуаном Пітру та Віктором Стіннером у :issue:`22560`.)

source: A new :meth:`loop.is_closed() <asyncio.loop.is_closed>` method to check if the event loop is closed. (Contributed by Victor Stinner in :issue:`21326`.)
uk: Новий метод :meth:`loop.is_closed() <asyncio.loop.is_closed>` для перевірки, чи замкнутий цикл подій. (Надав Віктор Стіннер у :issue:`21326`.)

source: A new :meth:`loop.create_task() <asyncio.loop.create_task>` to conveniently create and schedule a new :class:`~asyncio.Task` for a coroutine. The ``create_task`` method is also used by all asyncio functions that wrap coroutines into tasks, such as :func:`asyncio.wait`, :func:`asyncio.gather`, etc. (Contributed by Victor Stinner.)
uk: Новий :meth:`loop.create_task() <asyncio.loop.create_task>` для зручного створення та планування нового :class:`~asyncio.Task` для співпрограми. Метод ``create_task`` також використовується всіма асинхронними функціями, які об’єднують співпрограми в завдання, наприклад :func:`asyncio.wait`, :func:`asyncio.gather` тощо (Надано Віктором Стіннером.)

source: A new :meth:`transport.get_write_buffer_limits() <asyncio.WriteTransport.get_write_buffer_limits>` method to inquire for *high-* and *low-* water limits of the flow control. (Contributed by Victor Stinner.)
uk: Новий метод :meth:`transport.get_write_buffer_limits() <asyncio.WriteTransport.get_write_buffer_limits>` для запиту *високих* і *низьких* обмежень води для керування потоком. (Надав Віктор Стіннер.)

source: The :func:`~asyncio.async` function is deprecated in favor of :func:`~asyncio.ensure_future`. (Contributed by Yury Selivanov.)
uk: Функція :func:`~asyncio.async` застаріла на користь :func:`~asyncio.ensure_future`. (Уклав Юрій Селіванов.)

source: New :meth:`loop.set_task_factory() <asyncio.loop.set_task_factory>` and :meth:`loop.get_task_factory() <asyncio.loop.get_task_factory>` methods to customize the task factory that :meth:`loop.create_task() <asyncio.loop.create_task>` method uses. (Contributed by Yury Selivanov.)
uk: Нові методи :meth:`loop.set_task_factory() <asyncio.loop.set_task_factory>` і :meth:`loop.get_task_factory() <asyncio.loop.get_task_factory>` для налаштування фабрики завдань, яку використовує метод :meth:`loop.create_task() <asyncio.loop.create_task>`. (Уклав Юрій Селіванов.)

source: New :meth:`Queue.join() <asyncio.Queue.join>` and :meth:`Queue.task_done() <asyncio.Queue.task_done>` queue methods. (Contributed by Victor Stinner.)
uk: Нові методи черги :meth:`Queue.join() <asyncio.Queue.join>` і :meth:`Queue.task_done() <asyncio.Queue.task_done>`. (Надав Віктор Стіннер.)

source: The ``JoinableQueue`` class was removed, in favor of the :class:`asyncio.Queue` class. (Contributed by Victor Stinner.)
uk: Клас ``JoinableQueue`` було видалено на користь класу :class:`asyncio.Queue`. (Надав Віктор Стіннер.)

source: Updates in 3.5.1:
uk: Оновлення в 3.5.1:

source: The :func:`~asyncio.ensure_future` function and all functions that use it, such as :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, now accept all kinds of :term:`awaitable objects <awaitable>`. (Contributed by Yury Selivanov.)
uk: Функція :func:`~asyncio.ensure_future` і всі функції, які її використовують, такі як :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, тепер приймають усі типи :term:`awaitable об’єктів <awaitable>`. (Уклав Юрій Селіванов.)

source: New :func:`~asyncio.run_coroutine_threadsafe` function to submit coroutines to event loops from other threads. (Contributed by Vincent Michel.)
uk: Нова функція :func:`~asyncio.run_coroutine_threadsafe` для надсилання співпрограм до циклів подій з інших потоків. (Надав Вінсент Мішель.)

source: New :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>` method to check if the transport is closing or closed. (Contributed by Yury Selivanov.)
uk: Новий метод :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>` для перевірки, закривається чи закривається транспорт. (Уклав Юрій Селіванов.)

source: The :meth:`loop.create_server() <asyncio.loop.create_server>` method can now accept a list of hosts. (Contributed by Yann Sionneau.)
uk: Метод :meth:`loop.create_server() <asyncio.loop.create_server>` тепер може приймати список хостів. (Надав Ян Сіно.)

source: Updates in 3.5.2:
uk: Оновлення в 3.5.2:

source: New :meth:`loop.create_future() <asyncio.loop.create_future>` method to create Future objects. This allows alternative event loop implementations, such as `uvloop <https://github.com/MagicStack/uvloop>`_, to provide a faster :class:`asyncio.Future` implementation. (Contributed by Yury Selivanov.)
uk: Новий метод :meth:`loop.create_future() <asyncio.loop.create_future>` для створення об’єктів Future. Це дозволяє альтернативним реалізаціям циклу подій, таким як `uvloop <https://github.com/MagicStack/uvloop>`_, забезпечити швидшу реалізацію :class:`asyncio.Future`. (Уклав Юрій Селіванов.)

source: New :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>` method to get the current exception handler. (Contributed by Yury Selivanov.)
uk: Новий метод :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>` для отримання поточного обробника винятків. (Уклав Юрій Селіванов.)

source: New :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>` method to read data from the stream until a separator bytes sequence appears. (Contributed by Mark Korenberg.)
uk: Новий метод :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>` для читання даних із потоку, доки не з’явиться послідовність байтів-роздільників. (Надав Марк Коренберг.)

source: The :meth:`loop.create_connection() <asyncio.loop.create_connection>` and :meth:`loop.create_server() <asyncio.loop.create_server>` methods are optimized to avoid calling the system ``getaddrinfo`` function if the address is already resolved. (Contributed by A. Jesse Jiryu Davis.)
uk: Методи :meth:`loop.create_connection() <asyncio.loop.create_connection>` і :meth:`loop.create_server() <asyncio.loop.create_server>` оптимізовано, щоб уникнути виклику системної функції ``getaddrinfo``, якщо адресу вже визначено. (Надав А. Джессі Джірю Девіс.)

source: The :meth:`loop.sock_connect(sock, address) <asyncio.loop.sock_connect>` no longer requires the *address* to be resolved prior to the call. (Contributed by A. Jesse Jiryu Davis.)
uk: :meth:`loop.sock_connect(sock, address) <asyncio.loop.sock_connect>` більше не вимагає визначення *адреси* перед викликом. (Надав А. Джессі Джірю Девіс.)

source: The :meth:`BZ2Decompressor.decompress <bz2.BZ2Decompressor.decompress>` method now accepts an optional *max_length* argument to limit the maximum size of decompressed data. (Contributed by Nikolaus Rath in :issue:`15955`.)
uk: Метод :meth:`BZ2Decompressor.decompress <bz2.BZ2Decompressor.decompress>` тепер приймає додатковий аргумент *max_length* для обмеження максимального розміру розпакованих даних. (Надав Ніколаус Рат у :issue:`15955`.)

source: The :class:`~cgi.FieldStorage` class now supports the :term:`context manager` protocol. (Contributed by Berker Peksag in :issue:`20289`.)
uk: Клас :class:`~cgi.FieldStorage` тепер підтримує протокол :term:`context manager`. (Надано Berker Peksag у :issue:`20289`.)

source: A new function :func:`~cmath.isclose` provides a way to test for approximate equality. (Contributed by Chris Barker and Tal Einat in :issue:`24270`.)
uk: Нова функція :func:`~cmath.isclose` надає спосіб перевірити приблизну рівність. (Надано Крісом Баркером і Тал Ейнатом у :issue:`24270`.)

source: code
uk: код
