Repository: python/python-docs-uk
Catalog: whatsnew/3.5.po
Languages: uk

source: The :class:`~smtpd.SMTPServer` class now also supports the ``SMTPUTF8`` extension (:rfc:`6531`: Internationalized Email). If the client specified ``SMTPUTF8 BODY=8BITMIME`` on the ``MAIL`` command, they are passed to :meth:`SMTPServer.process_message() <smtpd.SMTPServer.process_message>` via the *mail_options* keyword. It is the responsibility of the ``process_message`` method to correctly handle the ``SMTPUTF8`` data. (Contributed by Milan Oberkirch in :issue:`21725`.)
uk: Клас :class:`~smtpd.SMTPServer` тепер також підтримує розширення ``SMTPUTF8`` (:rfc:`6531`: інтернаціоналізована електронна пошта). Якщо клієнт вказав ``SMTPUTF8 BODY=8BITMIME`` у команді ``MAIL``, вони передаються до :meth:`SMTPServer.process_message() <smtpd.SMTPServer.process_message>` через ключове слово *mail_options*. Метод ``process_message`` відповідає за правильну обробку даних ``SMTPUTF8``. (Надав Мілан Оберкірх у :issue:`21725`.)

source: It is now possible to provide, directly or via name resolution, IPv6 addresses in the :class:`~smtpd.SMTPServer` constructor, and have it successfully connect. (Contributed by Milan Oberkirch in :issue:`14758`.)
uk: Тепер можна надати, безпосередньо або через розпізнавання імен, IPv6-адреси в конструкторі :class:`~smtpd.SMTPServer` і забезпечити його успішне підключення. (Надав Мілан Оберкірх у :issue:`14758`.)

source: A new :meth:`SMTP.auth() <smtplib.SMTP.auth>` method provides a convenient way to implement custom authentication mechanisms. (Contributed by Milan Oberkirch in :issue:`15014`.)
uk: Новий метод :meth:`SMTP.auth() <smtplib.SMTP.auth>` забезпечує зручний спосіб реалізації спеціальних механізмів автентифікації. (Надав Мілан Оберкірх у :issue:`15014`.)

source: The :meth:`SMTP.set_debuglevel() <smtplib.SMTP.set_debuglevel>` method now accepts an additional debuglevel (2), which enables timestamps in debug messages. (Contributed by Gavin Chappell and Maciej Szulik in :issue:`16914`.)
uk: Метод :meth:`SMTP.set_debuglevel() <smtplib.SMTP.set_debuglevel>` тепер приймає додатковий рівень налагодження (2), який умикає мітки часу в повідомленнях налагодження. (Надано Гевіном Чаппеллом і Мацеєм Шуліком у :issue:`16914`.)

source: Both the :meth:`SMTP.sendmail() <smtplib.SMTP.sendmail>` and :meth:`SMTP.send_message() <smtplib.SMTP.send_message>` methods now support :rfc:`6531` (SMTPUTF8). (Contributed by Milan Oberkirch and R. David Murray in :issue:`22027`.)
uk: Обидва методи :meth:`SMTP.sendmail() <smtplib.SMTP.sendmail>` і :meth:`SMTP.send_message() <smtplib.SMTP.send_message>` тепер підтримують :rfc:`6531` (SMTPUTF8). (Надано Міланом Оберкірхом і Р. Девідом Мюрреєм у :issue:`22027`.)

source: The :func:`~sndhdr.what` and :func:`~sndhdr.whathdr` functions now return a :func:`~collections.namedtuple`. (Contributed by Claudiu Popa in :issue:`18615`.)
uk: Функції :func:`~sndhdr.what` і :func:`~sndhdr.whathdr` тепер повертають :func:`~collections.namedtuple`. (Надав Клаудіу Попа в :issue:`18615`.)

source: socket
uk: гніздо

source: Functions with timeouts now use a monotonic clock, instead of a system clock. (Contributed by Victor Stinner in :issue:`22043`.)
uk: Функції з тайм-аутами тепер використовують монотонний годинник замість системного. (Надав Віктор Стіннер у :issue:`22043`.)

source: A new :meth:`socket.sendfile() <socket.socket.sendfile>` method allows sending a file over a socket by using the high-performance :func:`os.sendfile` function on UNIX, resulting in uploads being from 2 to 3 times faster than when using plain :meth:`socket.send() <socket.socket.send>`. (Contributed by Giampaolo Rodola' in :issue:`17552`.)
uk: Новий метод :meth:`socket.sendfile() <socket.socket.sendfile>` дозволяє надсилати файл через сокет за допомогою високопродуктивної функції :func:`os.sendfile` в UNIX, що призводить до завантаження в 2-3 рази швидше, ніж при використанні простого :meth:`socket.send() <socket.socket.send>`. (Надав Джампаоло Родола в :issue:`17552`.)

source: The :meth:`socket.sendall() <socket.socket.sendall>` method no longer resets the socket timeout every time bytes are received or sent. The socket timeout is now the maximum total duration to send all data. (Contributed by Victor Stinner in :issue:`23853`.)
uk: Метод :meth:`socket.sendall() <socket.socket.sendall>` більше не скидає тайм-аут сокета кожного разу, коли байти надходять або надсилаються. Час очікування сокета тепер є максимальною загальною тривалістю надсилання всіх даних. (Надав Віктор Стіннер у :issue:`23853`.)

source: The *backlog* argument of the :meth:`socket.listen() <socket.socket.listen>` method is now optional. By default it is set to :data:`SOMAXCONN <socket.SOMAXCONN>` or to ``128``, whichever is less. (Contributed by Charles-François Natali in :issue:`21455`.)
uk: Аргумент *backlog* методу :meth:`socket.listen() <socket.socket.listen>` тепер необов’язковий. За замовчуванням встановлено :data:`SOMAXCONN <socket.SOMAXCONN>` або ``128``, залежно від того, що менше. (Надав Шарль-Франсуа Наталі в :issue:`21455`.)

source: Memory BIO Support
uk: Підтримка BIO пам'яті

source: (Contributed by Geert Jansen in :issue:`21965`.)
uk: (Надав Герт Янсен у :issue:`21965`.)

source: The new :class:`~ssl.SSLObject` class has been added to provide SSL protocol support for cases when the network I/O capabilities of :class:`~ssl.SSLSocket` are not necessary or are suboptimal. ``SSLObject`` represents an SSL protocol instance, but does not implement any network I/O methods, and instead provides a memory buffer interface. The new :class:`~ssl.MemoryBIO` class can be used to pass data between Python and an SSL protocol instance.
uk: Новий клас :class:`~ssl.SSLObject` було додано, щоб забезпечити підтримку протоколу SSL у випадках, коли можливості мережевого вводу/виводу :class:`~ssl.SSLSocket` не потрібні або неоптимальні. ``SSLObject`` представляє екземпляр протоколу SSL, але не реалізує жодних мережевих методів вводу/виводу, натомість надає інтерфейс буфера пам’яті. Новий клас :class:`~ssl.MemoryBIO` можна використовувати для передачі даних між Python і екземпляром протоколу SSL.

source: The memory BIO SSL support is primarily intended to be used in frameworks implementing asynchronous I/O for which :class:`~ssl.SSLSocket`'s readiness model ("select/poll") is inefficient.
uk: Підтримка SSL BIO пам’яті в першу чергу призначена для використання в структурах, що реалізують асинхронний ввід-вивід, для яких модель готовності :class:`~ssl.SSLSocket` ("вибір/опитування") неефективна.

source: A new :meth:`SSLContext.wrap_bio() <ssl.SSLContext.wrap_bio>` method can be used to create a new ``SSLObject`` instance.
uk: Новий метод :meth:`SSLContext.wrap_bio() <ssl.SSLContext.wrap_bio>` можна використати для створення нового екземпляра ``SSLObject``.

source: Application-Layer Protocol Negotiation Support
uk: Підтримка узгодження протоколу прикладного рівня

source: (Contributed by Benjamin Peterson in :issue:`20188`.)
uk: (Надав Бенджамін Петерсон у :issue:`20188`.)

source: Where OpenSSL support is present, the :mod:`ssl` module now implements the *Application-Layer Protocol Negotiation* TLS extension as described in :rfc:`7301`.
uk: Там, де є підтримка OpenSSL, модуль :mod:`ssl` тепер реалізує розширення TLS *Application-Layer Protocol Negotiation*, як описано в :rfc:`7301`.

source: The new :meth:`SSLContext.set_alpn_protocols() <ssl.SSLContext.set_alpn_protocols>` can be used to specify which protocols a socket should advertise during the TLS handshake.
uk: Новий :meth:`SSLContext.set_alpn_protocols() <ssl.SSLContext.set_alpn_protocols>` можна використовувати, щоб вказати, які протоколи сокет має оголосити під час рукостискання TLS.

source: The new :meth:`SSLSocket.selected_alpn_protocol() <ssl.SSLSocket.selected_alpn_protocol>` returns the protocol that was selected during the TLS handshake. The :data:`~ssl.HAS_ALPN` flag indicates whether ALPN support is present.
uk: Новий :meth:`SSLSocket.selected_alpn_protocol() <ssl.SSLSocket.selected_alpn_protocol>` повертає протокол, який було вибрано під час рукостискання TLS. Прапор :data:`~ssl.HAS_ALPN` вказує на наявність підтримки ALPN.

source: Other Changes
uk: Інші зміни

source: There is a new :meth:`SSLSocket.version() <ssl.SSLSocket.version>` method to query the actual protocol version in use. (Contributed by Antoine Pitrou in :issue:`20421`.)
uk: Існує новий метод :meth:`SSLSocket.version() <ssl.SSLSocket.version>` для запиту фактичної версії протоколу, що використовується. (Надав Антуан Пітру в :issue:`20421`.)

source: The :class:`~ssl.SSLSocket` class now implements a :meth:`SSLSocket.sendfile() <ssl.SSLSocket.sendfile>` method. (Contributed by Giampaolo Rodola' in :issue:`17552`.)
uk: Клас :class:`~ssl.SSLSocket` тепер реалізує метод :meth:`SSLSocket.sendfile() <ssl.SSLSocket.sendfile>`. (Надав Джампаоло Родола в :issue:`17552`.)

source: The :meth:`SSLSocket.send() <ssl.SSLSocket.send>` method now raises either the :exc:`ssl.SSLWantReadError` or :exc:`ssl.SSLWantWriteError` exception on a non-blocking socket if the operation would block. Previously, it would return ``0``. (Contributed by Nikolaus Rath in :issue:`20951`.)
uk: Метод :meth:`SSLSocket.send() <ssl.SSLSocket.send>` тепер викликає виняток :exc:`ssl.SSLWantReadError` або :exc:`ssl.SSLWantWriteError` у неблокуючому сокеті, якщо операція буде заблокована. Раніше він повертав ``0``. (Надав Ніколаус Рат у :issue:`20951`.)

source: The :func:`~ssl.cert_time_to_seconds` function now interprets the input time as UTC and not as local time, per :rfc:`5280`. Additionally, the return value is always an :class:`int`. (Contributed by Akira Li in :issue:`19940`.)
uk: Функція :func:`~ssl.cert_time_to_seconds` тепер інтерпретує введений час як UTC, а не як місцевий час відповідно до :rfc:`5280`. Крім того, повертається значення завжди :class:`int`. (Надав Акіра Лі в :issue:`19940`.)

source: New :meth:`SSLObject.shared_ciphers() <ssl.SSLObject.shared_ciphers>` and :meth:`SSLSocket.shared_ciphers() <ssl.SSLSocket.shared_ciphers>` methods return the list of ciphers sent by the client during the handshake. (Contributed by Benjamin Peterson in :issue:`23186`.)
uk: Нові методи :meth:`SSLObject.shared_ciphers() <ssl.SSLObject.shared_ciphers>` і :meth:`SSLSocket.shared_ciphers() <ssl.SSLSocket.shared_ciphers>` повертають список шифрів, надісланих клієнтом під час рукостискання. (Надав Бенджамін Петерсон у :issue:`23186`.)

source: The :meth:`SSLSocket.do_handshake() <ssl.SSLSocket.do_handshake>`, :meth:`SSLSocket.read() <ssl.SSLSocket.read>`, :meth:`SSLSocket.shutdown() <ssl.SSLSocket.shutdown>`, and :meth:`SSLSocket.write() <ssl.SSLSocket.write>` methods of the :class:`~ssl.SSLSocket` class no longer reset the socket timeout every time bytes are received or sent. The socket timeout is now the maximum total duration of the method. (Contributed by Victor Stinner in :issue:`23853`.)
uk: Методи :meth:`SSLSocket.do_handshake() <ssl.SSLSocket.do_handshake>`, :meth:`SSLSocket.read() <ssl.SSLSocket.read>`, :meth:`SSLSocket.shutdown() <ssl.SSLSocket.shutdown>`, and :meth:`SSLSocket.write() <ssl.SSLSocket.write>` класу :class:`~ssl.SSLSocket` більше не скидає тайм-аут сокета кожного разу, коли байти надходять або надсилаються. Час очікування сокета тепер є максимальною загальною тривалістю методу. (Надав Віктор Стіннер у :issue:`23853`.)

source: The :func:`~ssl.match_hostname` function now supports matching of IP addresses. (Contributed by Antoine Pitrou in :issue:`23239`.)
uk: Функція :func:`~ssl.match_hostname` тепер підтримує зіставлення IP-адрес. (Надав Антуан Пітру в :issue:`23239`.)

source: The :class:`~sqlite3.Row` class now fully supports the sequence protocol, in particular :func:`reversed` iteration and slice indexing. (Contributed by Claudiu Popa in :issue:`10203`; by Lucas Sinclair, Jessica McKellar, and Serhiy Storchaka in :issue:`13583`.)
uk: Клас :class:`~sqlite3.Row` тепер повністю підтримує протокол послідовності, зокрема :func:`reversed` ітерацію та індексування фрагментів. (Надано Клаудіу Попою в :issue:`10203`; Лукасом Сінклером, Джесікою Маккеллар і Сергієм Сторчакою в :issue:`13583`.)

source: subprocess
uk: підпроцес

source: The new :func:`~subprocess.run` function has been added. It runs the specified command and returns a :class:`~subprocess.CompletedProcess` object, which describes a finished process. The new API is more consistent and is the recommended approach to invoking subprocesses in Python code that does not need to maintain compatibility with earlier Python versions. (Contributed by Thomas Kluyver in :issue:`23342`.)
uk: Додано нову функцію :func:`~subprocess.run`. Він виконує вказану команду та повертає об’єкт :class:`~subprocess.CompletedProcess`, який описує завершений процес. Новий API є більш послідовним і є рекомендованим підходом до виклику підпроцесів у коді Python, якому не потрібно підтримувати сумісність із попередніми версіями Python. (Надав Томас Клюйвер у :issue:`23342`.)

source: sys
uk: система

source: A new :func:`~sys.set_coroutine_wrapper` function allows setting a global hook that will be called whenever a :term:`coroutine object <coroutine>` is created by an :keyword:`async def` function. A corresponding :func:`~sys.get_coroutine_wrapper` can be used to obtain a currently set wrapper. Both functions are :term:`provisional <provisional API>`, and are intended for debugging purposes only. (Contributed by Yury Selivanov in :issue:`24017`.)
uk: Нова функція :func:`~sys.set_coroutine_wrapper` дозволяє встановити глобальний хук, який буде викликатися щоразу, коли об’єкт :term:`coroutine <coroutine>` створюється функцією :keyword:`async def`. Відповідний :func:`~sys.get_coroutine_wrapper` можна використовувати для отримання поточної встановленої оболонки. Обидві функції є :term:`тимчасовими <provisional API>` і призначені лише для цілей налагодження. (Надав Юрій Селіванов у :issue:`24017`.)

source: A new :func:`~sys.is_finalizing` function can be used to check if the Python interpreter is :term:`shutting down <interpreter shutdown>`. (Contributed by Antoine Pitrou in :issue:`22696`.)
uk: Нову функцію :func:`~sys.is_finalizing` можна використати, щоб перевірити, чи інтерпретатор Python :term:`вимикає <interpreter shutdown>`. (Надав Антуан Пітру в :issue:`22696`.)

source: The name of the user scripts directory on Windows now includes the first two components of the Python version. (Contributed by Paul Moore in :issue:`23437`.)
uk: Назва каталогу сценаріїв користувача в Windows тепер включає перші два компоненти версії Python. (Надав Пол Мур у :issue:`23437`.)

source: The *mode* argument of the :func:`~tarfile.open` function now accepts ``"x"`` to request exclusive creation. (Contributed by Berker Peksag in :issue:`21717`.)
uk: Аргумент *mode* функції :func:`~tarfile.open` тепер приймає ``"x"`` для запиту ексклюзивного створення. (Надано Berker Peksag у :issue:`21717`.)

source: The :meth:`TarFile.extractall() <tarfile.TarFile.extractall>` and :meth:`TarFile.extract() <tarfile.TarFile.extract>` methods now take a keyword argument *numeric_owner*. If set to ``True``, the extracted files and directories will be owned by the numeric ``uid`` and ``gid`` from the tarfile. If set to ``False`` (the default, and the behavior in versions prior to 3.5), they will be owned by the named user and group in the tarfile. (Contributed by Michael Vogt and Eric Smith in :issue:`23193`.)
uk: Методи :meth:`TarFile.extractall() <tarfile.TarFile.extractall>` і :meth:`TarFile.extract() <tarfile.TarFile.extract>` тепер приймають аргумент ключового слова *numeric_owner*. Якщо встановлено значення ``True``, витягнуті файли та каталоги будуть належати числовим ``uid`` і ``gid`` з tarfile. Якщо встановлено значення ``False`` (за умовчанням і поведінка у версіях до 3.5), вони належатимуть вказаному користувачеві та групі в tar-файлі. (Надано Майклом Фогтом і Еріком Смітом у :issue:`23193`.)

source: The :meth:`TarFile.list() <tarfile.TarFile.list>` now accepts an optional *members* keyword argument that can be set to a subset of the list returned by :meth:`TarFile.getmembers() <tarfile.TarFile.getmembers>`. (Contributed by Serhiy Storchaka in :issue:`21549`.)
uk: :meth:`TarFile.list() <tarfile.TarFile.list>` тепер приймає необов’язковий аргумент ключового слова *members*, який можна встановити як підмножину списку, який повертає :meth:`TarFile.getmembers() <tarfile.TarFile.getmembers>`. (Надав Сергій Сторчака в :issue:`21549`.)

source: threading
uk: різьблення

source: Both the :meth:`Lock.acquire() <threading.Lock.acquire>` and :meth:`RLock.acquire() <threading.RLock.acquire>` methods now use a monotonic clock for timeout management. (Contributed by Victor Stinner in :issue:`22043`.)
uk: Обидва методи :meth:`Lock.acquire() <threading.Lock.acquire>` і :meth:`RLock.acquire() <threading.RLock.acquire>` тепер використовують монотонний годинник для керування часом очікування. (Надав Віктор Стіннер у :issue:`22043`.)

source: time
uk: час

source: The :func:`~time.monotonic` function is now always available. (Contributed by Victor Stinner in :issue:`22043`.)
uk: Функція :func:`~time.monotonic` тепер доступна завжди. (Надав Віктор Стіннер у :issue:`22043`.)

source: A new command line option ``-u`` or :samp:`--unit={U}` can be used to specify the time unit for the timer output. Supported options are ``usec``, ``msec``, or ``sec``. (Contributed by Julian Gindi in :issue:`18983`.)
uk: Новий параметр командного рядка ``-u`` або :samp:`--unit={U}` можна використовувати для визначення одиниці часу для виведення таймером. Підтримувані параметри: ``usec``, ``msec`` або ``sec``. (Надав Джуліан Гінді в :issue:`18983`.)

source: The :func:`~timeit.timeit` function has a new *globals* parameter for specifying the namespace in which the code will be running. (Contributed by Ben Roberts in :issue:`2527`.)
uk: Функція :func:`~timeit.timeit` має новий параметр *globals* для визначення простору імен, у якому виконуватиметься код. (Надав Бен Робертс у :issue:`2527`.)

source: The :mod:`tkinter._fix` module used for setting up the Tcl/Tk environment on Windows has been replaced by a private function in the :mod:`_tkinter` module which makes no permanent changes to environment variables. (Contributed by Zachary Ware in :issue:`20035`.)
uk: Модуль :mod:`tkinter._fix`, який використовувався для налаштування середовища Tcl/Tk у Windows, було замінено на приватну функцію в модулі :mod:`_tkinter`, яка не вносить постійних змін до змінних середовища. (Надано Zachary Ware у :issue:`20035`.)

source: traceback
uk: простежити

source: New :func:`~traceback.walk_stack` and :func:`~traceback.walk_tb` functions to conveniently traverse frame and traceback objects. (Contributed by Robert Collins in :issue:`17911`.)
uk: Нові функції :func:`~traceback.walk_stack` і :func:`~traceback.walk_tb` для зручного перегляду кадрів і об’єктів трасування. (Надав Роберт Коллінз у :issue:`17911`.)

source: New lightweight classes: :class:`~traceback.TracebackException`, :class:`~traceback.StackSummary`, and :class:`~traceback.FrameSummary`. (Contributed by Robert Collins in :issue:`17911`.)
uk: Нові спрощені класи: :class:`~traceback.TracebackException`, :class:`~traceback.StackSummary` і :class:`~traceback.FrameSummary`. (Надав Роберт Коллінз у :issue:`17911`.)

source: Both the :func:`~traceback.print_tb` and :func:`~traceback.print_stack` functions now support negative values for the *limit* argument. (Contributed by Dmitry Kazakov in :issue:`22619`.)
uk: Функції :func:`~traceback.print_tb` і :func:`~traceback.print_stack` тепер підтримують від’ємні значення для аргументу *limit*. (Надав Дмитро Казаков у :issue:`22619`.)

source: types
uk: види

source: A new :func:`~types.coroutine` function to transform :term:`generator <generator iterator>` and :class:`generator-like <collections.abc.Generator>` objects into :term:`awaitables <awaitable>`. (Contributed by Yury Selivanov in :issue:`24017`.)
uk: Нова функція :func:`~types.coroutine` для перетворення об’єктів :term:`generator <generator iterator>` і :class:`generator-like <collections.abc.Generator>` в :term:`awaitables <awaitable>`. (Надав Юрій Селіванов у :issue:`24017`.)

source: A new type called :class:`~types.CoroutineType`, which is used for :term:`coroutine` objects created by :keyword:`async def` functions. (Contributed by Yury Selivanov in :issue:`24400`.)
uk: Новий тип під назвою :class:`~types.CoroutineType`, який використовується для об’єктів :term:`coroutine`, створених функціями :keyword:`async def`. (Надав Юрій Селіванов у :issue:`24400`.)

source: The :mod:`unicodedata` module now uses data from `Unicode 8.0.0 <http://unicode.org/versions/Unicode8.0.0/>`_.
uk: Модуль :mod:`unicodedata` тепер використовує дані з `Unicode 8.0.0 <http://unicode.org/versions/Unicode8.0.0/>`_.

source: The :meth:`TestLoader.loadTestsFromModule() <unittest.TestLoader.loadTestsFromModule>` method now accepts a keyword-only argument *pattern* which is passed to ``load_tests`` as the third argument. Found packages are now checked for ``load_tests`` regardless of whether their path matches *pattern*, because it is impossible for a package name to match the default pattern. (Contributed by Robert Collins and Barry A. Warsaw in :issue:`16662`.)
uk: Метод :meth:`TestLoader.loadTestsFromModule() <unittest.TestLoader.loadTestsFromModule>` тепер приймає аргумент *pattern* лише з ключовим словом, який передається в ``load_tests`` як третій аргумент. Знайдені пакунки тепер перевіряються на ``load_tests`` незалежно від того, чи відповідає їхній шлях *шаблону*, оскільки назва пакета не може відповідати шаблону за замовчуванням. (Надано Робертом Коллінзом і Баррі А. Варшавою в :issue:`16662`.)

source: Unittest discovery errors now are exposed in the :data:`TestLoader.errors <unittest.TestLoader.errors>` attribute of the :class:`~unittest.TestLoader` instance. (Contributed by Robert Collins in :issue:`19746`.)
uk: Помилки виявлення Unittest тепер виявляються в атрибуті :data:`TestLoader.errors <unittest.TestLoader.errors>` екземпляра :class:`~unittest.TestLoader`. (Надано Робертом Коллінзом у :issue:`19746`.)

source: A new command line option ``--locals`` to show local variables in tracebacks. (Contributed by Robert Collins in :issue:`22936`.)
uk: Новий параметр командного рядка ``--locals`` для відображення локальних змінних у відстеженнях. (Надав Роберт Коллінз у :issue:`22936`.)

source: The :class:`~unittest.mock.Mock` class has the following improvements:
uk: Клас :class:`~unittest.mock.Mock` має наступні покращення:

source: The class constructor has a new *unsafe* parameter, which causes mock objects to raise :exc:`AttributeError` on attribute names starting with ``"assert"``. (Contributed by Kushal Das in :issue:`21238`.)
uk: Конструктор класу має новий параметр *unsafe*, який змушує фіктивні об’єкти викликати помилку :exc:`AttributeError` для імен атрибутів, що починаються з ``"assert"``. (Надав Кушал Дас у :issue:`21238`.)

source: A new :meth:`Mock.assert_not_called() <unittest.mock.Mock.assert_not_called>` method to check if the mock object was called. (Contributed by Kushal Das in :issue:`21262`.)
uk: Новий метод :meth:`Mock.assert_not_ called() <unittest.mock.Mock.assert_not_called>` для перевірки, чи був викликаний макетний об’єкт. (Надав Кушал Дас у :issue:`21262`.)

source: The :class:`~unittest.mock.MagicMock` class now supports :meth:`__truediv__`, :meth:`__divmod__` and :meth:`__matmul__` operators. (Contributed by Johannes Baiter in :issue:`20968`, and Håkan Lövdahl in :issue:`23581` and :issue:`23568`.)
uk: Клас :class:`~unittest.mock.MagicMock` тепер підтримує оператори :meth:`__truediv__`, :meth:`__divmod__` і :meth:`__matmul__`. (Надано Йоханнесом Байтером у :issue:`20968` та Хоканом Льовдалем у :issue:`23581` та :issue:`23568`.)
