Repository: python/python-docs-uk
Catalog: whatsnew/3.5.po
Languages: uk

source: It is no longer necessary to explicitly pass ``create=True`` to the :func:`~unittest.mock.patch` function when patching builtin names. (Contributed by Kushal Das in :issue:`17660`.)
uk: Більше не потрібно явно передавати ``create=True`` функції :func:`~unittest.mock.patch` під час виправлення вбудованих імен. (Надав Кушал Дас у :issue:`17660`.)

source: A new :class:`request.HTTPPasswordMgrWithPriorAuth <urllib.request.HTTPPasswordMgrWithPriorAuth>` class allows HTTP Basic Authentication credentials to be managed so as to eliminate unnecessary ``401`` response handling, or to unconditionally send credentials on the first request in order to communicate with servers that return a ``404`` response instead of a ``401`` if the ``Authorization`` header is not sent. (Contributed by Matej Cepl in :issue:`19494` and Akshit Khurana in :issue:`7159`.)
uk: Новий клас :class:`request.HTTPPasswordMgrWithPriorAuth <urllib.request.HTTPPasswordMgrWithPriorAuth>` дозволяє керувати обліковими даними базової автентифікації HTTP, щоб усунути непотрібну обробку відповіді ``401`` або безумовно надсилати облікові дані на перший запит для зв’язку з серверами, які повертають відповідь ``404`` замість ``401``, якщо заголовок ``Authorization`` не надіслано. (Надано Матеєм Чеплем у :issue:`19494` та Akshit Khurana у :issue:`7159`.)

source: A new *quote_via* argument for the :func:`parse.urlencode() <urllib.parse.urlencode>` function provides a way to control the encoding of query parts if needed. (Contributed by Samwyse and Arnon Yaari in :issue:`13866`.)
uk: Новий аргумент *quote_via* для функції :func:`parse.urlencode() <urllib.parse.urlencode>` забезпечує спосіб керування кодуванням частин запиту, якщо це необхідно. (Надано Samwyse та Arnon Yaari у :issue:`13866`.)

source: The :func:`request.urlopen() <urllib.request.urlopen>` function accepts an :class:`ssl.SSLContext` object as a *context* argument, which will be used for the HTTPS connection. (Contributed by Alex Gaynor in :issue:`22366`.)
uk: Функція :func:`request.urlopen() <urllib.request.urlopen>` приймає об’єкт :class:`ssl.SSLContext` як аргумент *context*, який використовуватиметься для з’єднання HTTPS. (Надав Алекс Гейнор у :issue:`22366`.)

source: The :func:`parse.urljoin() <urllib.parse.urljoin>` was updated to use the :rfc:`3986` semantics for the resolution of relative URLs, rather than :rfc:`1808` and :rfc:`2396`. (Contributed by Demian Brecht and Senthil Kumaran in :issue:`22118`.)
uk: :func:`parse.urljoin() <urllib.parse.urljoin>` було оновлено, щоб використовувати семантику :rfc:`3986` для розділення відносних URL-адрес замість :rfc:`1808` і :rfc:`2396`. (Надано Деміаном Брехтом і Сентилом Кумараном у :issue:`22118`.)

source: The *headers* argument of the :class:`headers.Headers <wsgiref.headers.Headers>` class constructor is now optional. (Contributed by Pablo Torres Navarrete and SilentGhost in :issue:`5800`.)
uk: Аргумент *headers* конструктора класу :class:`headers.Headers <wsgiref.headers.Headers>` тепер необов'язковий. (Надано Пабло Торресом Наваррете та SilentGhost у :issue:`5800`.)

source: The :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` class now supports the :term:`context manager` protocol. (Contributed by Claudiu Popa in :issue:`20627`.)
uk: Клас :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` тепер підтримує протокол :term:`context manager`. (Надав Клаудіу Попа в :issue:`20627`.)

source: The :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` constructor now accepts an optional :class:`ssl.SSLContext` instance. (Contributed by Alex Gaynor in :issue:`22960`.)
uk: Конструктор :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` тепер приймає додатковий екземпляр :class:`ssl.SSLContext`. (Надав Алекс Гейнор у :issue:`22960`.)

source: SAX parsers now support a character stream of the :class:`xmlreader.InputSource <xml.sax.xmlreader.InputSource>` object. (Contributed by Serhiy Storchaka in :issue:`2175`.)
uk: Синтаксичні аналізатори SAX тепер підтримують потік символів об’єкта :class:`xmlreader.InputSource <xml.sax.xmlreader.InputSource>`. (Надав Сергій Сторчака в :issue:`2175`.)

source: :func:`~xml.sax.parseString` now accepts a :class:`str` instance. (Contributed by Serhiy Storchaka in :issue:`10590`.)
uk: :func:`~xml.sax.parseString` тепер приймає екземпляр :class:`str`. (Надав Сергій Сторчака в :issue:`10590`.)

source: zipfile
uk: zip-файл

source: ZIP output can now be written to unseekable streams. (Contributed by Serhiy Storchaka in :issue:`23252`.)
uk: Вихідний файл ZIP тепер можна записувати в потоки, які неможливо шукати. (Надав Сергій Сторчака в :issue:`23252`.)

source: The *mode* argument of :meth:`ZipFile.open() <zipfile.ZipFile.open>` method now accepts ``"x"`` to request exclusive creation. (Contributed by Serhiy Storchaka in :issue:`21717`.)
uk: Аргумент *mode* методу :meth:`ZipFile.open() <zipfile.ZipFile.open>` тепер приймає ``"x"`` для запиту ексклюзивного створення. (Надав Сергій Сторчака в :issue:`21717`.)

source: Other module-level changes
uk: Інші зміни на рівні модуля

source: Many functions in the :mod:`mmap`, :mod:`ossaudiodev`, :mod:`socket`, :mod:`ssl`, and :mod:`codecs` modules now accept writable :term:`bytes-like objects <bytes-like object>`. (Contributed by Serhiy Storchaka in :issue:`23001`.)
uk: Багато функцій у модулях :mod:`mmap`, :mod:`ossaudiodev`, :mod:`socket`, :mod:`ssl` і :mod:`codecs` тепер можуть записувати :term:`байт-подібно об'єкти <bytes-like object>`. (Надав Сергій Сторчака в :issue:`23001`.)

source: Optimizations
uk: Оптимізації

source: The :func:`os.walk` function has been sped up by 3 to 5 times on POSIX systems, and by 7 to 20 times on Windows. This was done using the new :func:`os.scandir` function, which exposes file information from the underlying ``readdir`` or ``FindFirstFile``/``FindNextFile`` system calls. (Contributed by Ben Hoyt with help from Victor Stinner in :issue:`23605`.)
uk: Функцію :func:`os.walk` було прискорено в 3-5 разів на системах POSIX і в 7-20 разів на Windows. Це було зроблено за допомогою нової функції :func:`os.scandir`, яка відкриває інформацію про файл із базових системних викликів ``readdir`` або ``FindFirstFile``/``FindNextFile``. (Надано Беном Хойтом за допомогою Віктора Стіннера в :issue:`23605`.)

source: Construction of ``bytes(int)`` (filled by zero bytes) is faster and uses less memory for large objects. ``calloc()`` is used instead of ``malloc()`` to allocate memory for these objects. (Contributed by Victor Stinner in :issue:`21233`.)
uk: Створення ``bytes(int)`` (заповненого нульовими байтами) відбувається швидше та використовує менше пам’яті для великих об’єктів. ``calloc()`` використовується замість ``malloc()`` для виділення пам'яті для цих об'єктів. (Надав Віктор Стіннер у :issue:`21233`.)

source: Some operations on :mod:`ipaddress` :class:`~ipaddress.IPv4Network` and :class:`~ipaddress.IPv6Network` have been massively sped up, such as :meth:`~ipaddress.IPv4Network.subnets`, :meth:`~ipaddress.IPv4Network.supernet`, :func:`~ipaddress.summarize_address_range`, :func:`~ipaddress.collapse_addresses`. The speed up can range from 3 to 15 times. (Contributed by Antoine Pitrou, Michel Albert, and Markus in :issue:`21486`, :issue:`21487`, :issue:`20826`, :issue:`23266`.)
uk: Деякі операції в :mod:`ipaddress` :class:`~ipaddress.IPv4Network` і :class:`~ipaddress.IPv6Network` були значно прискорені, наприклад :meth:`~ipaddress.IPv4Network.subnets`, :meth:`~ipaddress.IPv4Network.supernet`, :func:`~ipaddress.summarize_address_range`, :func:`~ipaddress.collapse_addresses`. Прискорення може бути від 3 до 15 разів. (Надано Антуаном Пітру, Мішелем Альбертом і Маркусом у :issue:`21486`, :issue:`21487`, :issue:`20826`, :issue:`23266`.)

source: Pickling of :mod:`ipaddress` objects was optimized to produce significantly smaller output. (Contributed by Serhiy Storchaka in :issue:`23133`.)
uk: Видалення об’єктів :mod:`ipaddress` було оптимізовано для отримання значно менших результатів. (Надав Сергій Сторчака в :issue:`23133`.)

source: Many operations on :class:`io.BytesIO` are now 50% to 100% faster. (Contributed by Serhiy Storchaka in :issue:`15381` and David Wilson in :issue:`22003`.)
uk: Багато операцій на :class:`io.BytesIO` тепер на 50% до 100% швидше. (Надано Сергієм Сторчакою у :issue:`15381` та Девідом Вілсоном у :issue:`22003`.)

source: The :func:`marshal.dumps` function is now faster: 65--85% with versions 3 and 4, 20--25% with versions 0 to 2 on typical data, and up to 5 times in best cases. (Contributed by Serhiy Storchaka in :issue:`20416` and :issue:`23344`.)
uk: Функція :func:`marshal.dumps` тепер працює швидше: 65--85% з версіями 3 і 4, 20--25% з версіями 0-2 на типових даних і до 5 разів у найкращих випадках. (Надав Сергій Сторчака в :issue:`20416` і :issue:`23344`.)

source: The UTF-32 encoder is now 3 to 7 times faster. (Contributed by Serhiy Storchaka in :issue:`15027`.)
uk: Кодер UTF-32 тепер у 3-7 разів швидший. (Надав Сергій Сторчака в :issue:`15027`.)

source: Regular expressions are now parsed up to 10% faster. (Contributed by Serhiy Storchaka in :issue:`19380`.)
uk: Регулярні вирази тепер аналізуються на 10% швидше. (Надав Сергій Сторчака в :issue:`19380`.)

source: The :func:`json.dumps` function was optimized to run with ``ensure_ascii=False`` as fast as with ``ensure_ascii=True``. (Contributed by Naoki Inada in :issue:`23206`.)
uk: Функцію :func:`json.dumps` було оптимізовано для роботи з ``ensure_ascii=False`` так само швидко, як і з ``ensure_ascii=True``. (Надав Наокі Інада в :issue:`23206`.)

source: The :c:func:`PyObject_IsInstance` and :c:func:`PyObject_IsSubclass` functions have been sped up in the common case that the second argument has :class:`type` as its metaclass. (Contributed Georg Brandl by in :issue:`22540`.)
uk: Функції :c:func:`PyObject_IsInstance` і :c:func:`PyObject_IsSubclass` було пришвидшено у типовому випадку, коли другий аргумент має :class:`type` як метаклас. (Надав Георг Брандл у :issue:`22540`.)

source: Method caching was slightly improved, yielding up to 5% performance improvement in some benchmarks. (Contributed by Antoine Pitrou in :issue:`22847`.)
uk: Кешування методів було дещо покращено, що дало підвищення продуктивності на 5% у деяких тестах. (Надав Антуан Пітру в :issue:`22847`.)

source: Objects from the :mod:`random` module now use 50% less memory on 64-bit builds. (Contributed by Serhiy Storchaka in :issue:`23488`.)
uk: Об’єкти з модуля :mod:`random` тепер використовують на 50% менше пам’яті в 64-розрядних версіях. (Надав Сергій Сторчака в :issue:`23488`.)

source: The :func:`property` getter calls are up to 25% faster. (Contributed by Joe Jevnik in :issue:`23910`.)
uk: Виклики методу отримання :func:`property` на 25% швидші. (Надав Джо Джевнік у :issue:`23910`.)

source: Instantiation of :class:`fractions.Fraction` is now up to 30% faster. (Contributed by Stefan Behnel in :issue:`22464`.)
uk: Створення екземпляра :class:`fractions.Fraction` тепер на 30% швидше. (Надав Стефан Бенель у :issue:`22464`.)

source: String methods :meth:`~str.find`, :meth:`~str.rfind`, :meth:`~str.split`, :meth:`~str.partition` and the :keyword:`in` string operator are now significantly faster for searching 1-character substrings. (Contributed by Serhiy Storchaka in :issue:`23573`.)
uk: Рядкові методи :meth:`~str.find`, :meth:`~str.rfind`, :meth:`~str.split`, :meth:`~str.partition` та рядок :keyword:`in` тепер значно швидше для пошуку підрядків з 1 символу. (Надав Сергій Сторчака в :issue:`23573`.)

source: Build and C API Changes
uk: Зміни збірки та C API

source: New ``calloc`` functions were added:
uk: Додано нові функції callloc:

source: (Contributed by Victor Stinner in :issue:`21233`.)
uk: (Надав Віктор Стіннер у :issue:`21233`.)

source: New encoding/decoding helper functions:
uk: Нові допоміжні функції кодування/декодування:

source: :c:func:`Py_DecodeLocale` (replaced ``_Py_char2wchar()``),
uk: :c:func:`Py_DecodeLocale` (замінено ``_Py_char2wchar()``),

source: :c:func:`Py_EncodeLocale` (replaced ``_Py_wchar2char()``).
uk: :c:func:`Py_EncodeLocale` (замінено ``_Py_wchar2char()``).

source: (Contributed by Victor Stinner in :issue:`18395`.)
uk: (Надав Віктор Стіннер у :issue:`18395`.)

source: A new :c:func:`PyCodec_NameReplaceErrors` function to replace the unicode encode error with ``\N{...}`` escapes. (Contributed by Serhiy Storchaka in :issue:`19676`.)
uk: Нова функція :c:func:`PyCodec_NameReplaceErrors` замінює помилку кодування Unicode на ``\N{...}``. (Надав Сергій Сторчака в :issue:`19676`.)

source: A new :c:func:`PyErr_FormatV` function similar to :c:func:`PyErr_Format`, but accepts a ``va_list`` argument. (Contributed by Antoine Pitrou in :issue:`18711`.)
uk: Нова функція :c:func:`PyErr_FormatV`, подібна до :c:func:`PyErr_Format`, але приймає аргумент ``va_list``. (Надав Антуан Пітру в :issue:`18711`.)

source: A new :c:data:`PyExc_RecursionError` exception. (Contributed by Georg Brandl in :issue:`19235`.)
uk: Новий виняток :c:data:`PyExc_RecursionError`. (Надав Георг Брандл у :issue:`19235`.)

source: New :c:func:`PyModule_FromDefAndSpec`, :c:func:`PyModule_FromDefAndSpec2`, and :c:func:`PyModule_ExecDef` functions introduced by :pep:`489` -- multi-phase extension module initialization. (Contributed by Petr Viktorin in :issue:`24268`.)
uk: Нові функції :c:func:`PyModule_FromDefAndSpec`, :c:func:`PyModule_FromDefAndSpec2` і :c:func:`PyModule_ExecDef`, представлені :pep:`489` -- багатофазова ініціалізація модуля розширення. (Надав Петро Вікторін у :issue:`24268`.)

source: New :c:func:`PyNumber_MatrixMultiply` and :c:func:`PyNumber_InPlaceMatrixMultiply` functions to perform matrix multiplication. (Contributed by Benjamin Peterson in :issue:`21176`. See also :pep:`465` for details.)
uk: Нові функції :c:func:`PyNumber_MatrixMultiply` і :c:func:`PyNumber_InPlaceMatrixMultiply` для виконання множення матриць. (Надано Бенджаміном Петерсоном у :issue:`21176`. Докладніше див. також :pep:`465`.)

source: The :c:member:`PyTypeObject.tp_finalize` slot is now part of the stable ABI.
uk: Слот :c:member:`PyTypeObject.tp_finalize` тепер є частиною стабільного ABI.

source: Windows builds now require Microsoft Visual C++ 14.0, which is available as part of `Visual Studio 2015 <https://www.visualstudio.com/>`_.
uk: Для збірок Windows тепер потрібен Microsoft Visual C++ 14.0, який доступний як частина `Visual Studio 2015 <https://www.visualstudio.com/>`_.

source: Extension modules now include a platform information tag in their filename on some platforms (the tag is optional, and CPython will import extensions without it, although if the tag is present and mismatched, the extension won't be loaded):
uk: Модулі розширення тепер включають тег інформації про платформу в назву файлу на деяких платформах (тег необов’язковий, і CPython імпортуватиме розширення без нього, хоча якщо тег присутній і не відповідає, розширення не завантажуватиметься):

source: On Linux, extension module filenames end with ``.cpython-<major><minor>m-<architecture>-<os>.pyd``:
uk: У Linux імена файлів модулів розширення закінчуються на ``.cpython- <major> <minor> m- <architecture> - <os> .pyd``:

source: ``<major>`` is the major number of the Python version; for Python 3.5 this is ``3``.
uk: ``<major>`` - головний номер версії Python; для Python 3.5 це ``3``.

source: ``<minor>`` is the minor number of the Python version; for Python 3.5 this is ``5``.
uk: ``<minor>`` є другорядним номером версії Python; для Python 3.5 це ``5``.

source: ``<architecture>`` is the hardware architecture the extension module was built to run on. It's most commonly either ``i386`` for 32-bit Intel platforms or ``x86_64`` for 64-bit Intel (and AMD) platforms.
uk: ``<architecture>`` - це апаратна архітектура, для роботи на якій створено модуль розширення. Найчастіше це ``i386`` для 32-розрядних платформ Intel або ``x86_64`` для 64-розрядних платформ Intel (і AMD).

source: ``<os>`` is always ``linux-gnu``, except for extensions built to talk to the 32-bit ABI on 64-bit platforms, in which case it is ``linux-gnu32`` (and ``<architecture>`` will be ``x86_64``).
uk: ``<os>`` завжди ``linux-gnu``, за винятком розширень, створених для спілкування з 32-розрядним ABI на 64-розрядних платформах, у цьому випадку це ``linux-gnu32`` (і ``<architecture>`` буде ``x86_64``).

source: On Windows, extension module filenames end with ``<debug>.cp<major><minor>-<platform>.pyd``:
uk: У Windows назви файлів модулів розширення закінчуються на ``<debug> .cp <major> <minor> - <platform> .pyd``:

source: ``<platform>`` is the platform the extension module was built for, either ``win32`` for Win32, ``win_amd64`` for Win64, ``win_ia64`` for Windows Itanium 64, and ``win_arm`` for Windows on ARM.
uk: ``<platform>`` — це платформа, для якої створено модуль розширення, або ``win32`` для Win32, ``win_amd64`` для Win64, ``win_ia64`` для Windows Itanium 64 і ``win_arm`` для Windows на ARM.

source: If built in debug mode, ``<debug>`` will be ``_d``, otherwise it will be blank.
uk: Якщо створено в режимі налагодження, ``<debug>`` буде ``_d``, інакше він буде порожнім.

source: On OS X platforms, extension module filenames now end with ``-darwin.so``.
uk: На платформах OS X імена файлів модулів розширення тепер закінчуються на ``-darwin.so``.

source: On all other platforms, extension module filenames are the same as they were with Python 3.4.
uk: На всіх інших платформах імена файлів модулів розширення такі ж, як і в Python 3.4.

source: Deprecated
uk: Застаріле

source: New Keywords
uk: Нові ключові слова

source: ``async`` and ``await`` are not recommended to be used as variable, class, function or module names. Introduced by :pep:`492` in Python 3.5, they will become proper keywords in Python 3.7.
uk: ``async`` і ``await`` не рекомендується використовувати як імена змінних, класів, функцій або модулів. Представлені :pep:`492` у Python 3.5, вони стануть правильними ключовими словами в Python 3.7.

source: Deprecated Python Behavior
uk: Застаріла поведінка Python

source: Raising the :exc:`StopIteration` exception inside a generator will now generate a silent :exc:`PendingDeprecationWarning`, which will become a non-silent deprecation warning in Python 3.6 and will trigger a :exc:`RuntimeError` in Python 3.7. See :ref:`PEP 479: Change StopIteration handling inside generators <whatsnew-pep-479>` for details.
uk: Викликання винятку :exc:`StopIteration` всередині генератора тепер генеруватиме мовчазне :exc:`PendingDeprecationWarning`, яке стане немовчазним попередженням про застаріння в Python 3.6 і викличе :exc:`RuntimeError` у Python 3.7. Перегляньте :ref:`PEP 479: Змініть обробку StopIteration всередині генераторів <whatsnew-pep-479>` для деталей.

source: Unsupported Operating Systems
uk: Непідтримувані операційні системи

source: Windows XP is no longer supported by Microsoft, thus, per :PEP:`11`, CPython 3.5 is no longer officially supported on this OS.
uk: Windows XP більше не підтримується корпорацією Майкрософт, тому, відповідно до :PEP:`11`, CPython 3.5 більше не офіційно підтримується в цій ОС.

source: Deprecated Python modules, functions and methods
uk: Застарілі модулі, функції та методи Python

source: The :mod:`formatter` module has now graduated to full deprecation and is still slated for removal in Python 3.6.
uk: Модуль :mod:`formatter` тепер повністю припинено, і його все ще планується видалити в Python 3.6.

source: The :func:`asyncio.async` function is deprecated in favor of :func:`~asyncio.ensure_future`.
uk: Функція :func:`asyncio.async` застаріла на користь :func:`~asyncio.ensure_future`.

source: The :mod:`smtpd` module has in the past always decoded the DATA portion of email messages using the ``utf-8`` codec. This can now be controlled by the new *decode_data* keyword to :class:`~smtpd.SMTPServer`. The default value is ``True``, but this default is deprecated. Specify the *decode_data* keyword with an appropriate value to avoid the deprecation warning.
uk: Модуль :mod:`smtpd` раніше завжди декодував частину DATA повідомлень електронної пошти за допомогою кодека ``utf-8``. Тепер цим можна керувати за допомогою нового ключового слова *decode_data* для :class:`~smtpd.SMTPServer`. Значенням за замовчуванням є ``True``, але це за замовчуванням застаріло. Укажіть ключове слово *decode_data* з відповідним значенням, щоб уникнути попередження про застаріле.

source: Directly assigning values to the :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` and :attr:`~http.cookies.Morsel.coded_value` of :class:`http.cookies.Morsel` objects is deprecated. Use the :meth:`~http.cookies.Morsel.set` method instead. In addition, the undocumented *LegalChars* parameter of :meth:`~http.cookies.Morsel.set` is deprecated, and is now ignored.
uk: Пряме призначення значень :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` і :attr:`~http.cookies.Morsel.coded_value` Об’єкти :class:`http.cookies.Morsel` застаріли. Натомість використовуйте метод :meth:`~http.cookies.Morsel.set`. Крім того, незадокументований параметр *LegalChars* :meth:`~http.cookies.Morsel.set` застарів і тепер ігнорується.

source: Passing a format string as keyword argument *format_string* to the :meth:`~string.Formatter.format` method of the :class:`string.Formatter` class has been deprecated. (Contributed by Serhiy Storchaka in :issue:`23671`.)
uk: Передача рядка формату як аргументу ключового слова *format_string* у метод :meth:`~string.Formatter.format` класу :class:`string.Formatter` застаріла. (Надав Сергій Сторчака в :issue:`23671`.)

source: The :func:`platform.dist` and :func:`platform.linux_distribution` functions are now deprecated. Linux distributions use too many different ways of describing themselves, so the functionality is left to a package. (Contributed by Vajrasky Kok and Berker Peksag in :issue:`1322`.)
uk: Функції :func:`platform.dist` і :func:`platform.linux_distribution` тепер застаріли. У дистрибутивах Linux використовується занадто багато різних способів опису, тому функціональність залишається за пакетом. (Надано Vajrasky Kok і Berker Peksag у :issue:`1322`.)

source: The previously undocumented ``from_function`` and ``from_builtin`` methods of :class:`inspect.Signature` are deprecated. Use the new :meth:`Signature.from_callable() <inspect.Signature.from_callable>` method instead. (Contributed by Yury Selivanov in :issue:`24248`.)
uk: Раніше недокументовані методи ``from_function`` і ``from_builtin`` :class:`inspect.Signature` застаріли. Натомість використовуйте новий метод :meth:`Signature.from_callable() <inspect.Signature.from_callable>`. (Надав Юрій Селіванов у :issue:`24248`.)

source: The :func:`inspect.getargspec` function is deprecated and scheduled to be removed in Python 3.6. (See :issue:`20438` for details.)
uk: Функція :func:`inspect.getargspec` є застарілою та планується її видалення в Python 3.6. (Докладніше див. :issue:`20438`.)

source: The :mod:`inspect` :func:`~inspect.getfullargspec`, :func:`~inspect.getcallargs`, and :func:`~inspect.formatargspec` functions are deprecated in favor of the :func:`inspect.signature` API. (Contributed by Yury Selivanov in :issue:`20438`.)
uk: Функції :mod:`inspect` :func:`~inspect.getfullargspec`, :func:`~inspect.getcallargs` і :func:`~inspect.formatargspec` застаріли на користь :func:`inspect.signature` API. (Надав Юрій Селіванов у :issue:`20438`.)

source: :func:`~inspect.getargvalues` and :func:`~inspect.formatargvalues` functions were inadvertently marked as deprecated with the release of Python 3.5.0.
uk: Функції :func:`~inspect.getargvalues` і :func:`~inspect.formatargvalues` були ненавмисно позначені як застарілі з випуском Python 3.5.0.
