Repository: python/python-docs-uk
Catalog: whatsnew/3.5.po
Languages: uk

source: The :func:`InteractiveInterpreter.showtraceback() <code.InteractiveInterpreter.showtraceback>` method now prints the full chained traceback, just like the interactive interpreter. (Contributed by Claudiu Popa in :issue:`17442`.)
uk: Метод :func:`InteractiveInterpreter.showtraceback() <code.InteractiveInterpreter.showtraceback>` тепер друкує повний ланцюжок трасування, як і інтерактивний інтерпретатор. (Надав Клаудіу Попа в :issue:`17442`.)

source: collections
uk: колекції

source: The :class:`~collections.OrderedDict` class is now implemented in C, which makes it 4 to 100 times faster. (Contributed by Eric Snow in :issue:`16991`.)
uk: Клас :class:`~collections.OrderedDict` тепер реалізовано в C, що робить його від 4 до 100 разів швидшим. (Надав Ерік Сноу в :issue:`16991`.)

source: :meth:`OrderedDict.items() <collections.OrderedDict.items>`, :meth:`OrderedDict.keys() <collections.OrderedDict.keys>`, :meth:`OrderedDict.values() <collections.OrderedDict.values>` views now support :func:`reversed` iteration. (Contributed by Serhiy Storchaka in :issue:`19505`.)
uk: :meth:`OrderedDict.items() <collections.OrderedDict.items>`, :meth:`OrderedDict.keys() <collections.OrderedDict.keys>`, :meth:`OrderedDict.values() <collections.OrderedDict.values>` представлення тепер підтримують :func:`reversed` ітерацію. (Надав Сергій Сторчака в :issue:`19505`.)

source: The :class:`~collections.deque` class now defines :meth:`~collections.deque.index`, :meth:`~collections.deque.insert`, and :meth:`~collections.deque.copy`, and supports the ``+`` and ``*`` operators. This allows deques to be recognized as a :class:`~collections.abc.MutableSequence` and improves their substitutability for lists. (Contributed by Raymond Hettinger in :issue:`23704`.)
uk: Клас :class:`~collections.deque` тепер визначає :meth:`~collections.deque.index`, :meth:`~collections.deque.insert` і :meth:`~collections.deque.copy`, і підтримує оператори ``+`` і ``*``. Це дозволяє розпізнавати двокомпонентні послідовності як :class:`~collections.abc.MutableSequence` і покращує їх замінність списками. (Надав Реймонд Геттінгер у :issue:`23704`.)

source: Docstrings produced by :func:`~collections.namedtuple` can now be updated::
uk: Рядки документів, створені :func:`~collections.namedtuple`, тепер можна оновлювати:

source: (Contributed by Berker Peksag in :issue:`24064`.)
uk: (Надано Berker Peksag у :issue:`24064`.)

source: The :class:`~collections.UserString` class now implements the :meth:`__getnewargs__`, :meth:`__rmod__`, :meth:`~str.casefold`, :meth:`~str.format_map`, :meth:`~str.isprintable`, and :meth:`~str.maketrans` methods to match the corresponding methods of :class:`str`. (Contributed by Joe Jevnik in :issue:`22189`.)
uk: Клас :class:`~collections.UserString` тепер реалізує :meth:`__getnewargs__`, :meth:`__rmod__`, :meth:`~str.casefold`, :meth:`~str.format_map`, :meth:`~str.isprintable`, і :meth:`~str.maketrans` методи для відповідності відповідним методам :class:`str`. (Надав Джо Джевнік у :issue:`22189`.)

source: collections.abc
uk: колекції.abc

source: The :meth:`Sequence.index() <collections.abc.Sequence.index>` method now accepts *start* and *stop* arguments to match the corresponding methods of :class:`tuple`, :class:`list`, etc. (Contributed by Devin Jeanpierre in :issue:`23086`.)
uk: Метод :meth:`Sequence.index() <collections.abc.Sequence.index>` тепер приймає аргументи *start* і *stop* для відповідності відповідним методам :class:`tuple`, :class:`list` тощо (надано Девіном Жанп'єром в :issue:`23086`.)

source: A new :class:`~collections.abc.Generator` abstract base class. (Contributed by Stefan Behnel in :issue:`24018`.)
uk: Новий :class:`~collections.abc.Generator` абстрактний базовий клас. (Надав Стефан Бенель у :issue:`24018`.)

source: New :class:`~collections.abc.Awaitable`, :class:`~collections.abc.Coroutine`, :class:`~collections.abc.AsyncIterator`, and :class:`~collections.abc.AsyncIterable` abstract base classes. (Contributed by Yury Selivanov in :issue:`24184`.)
uk: Нові :class:`~collections.abc.Awaitable`, :class:`~collections.abc.Coroutine`, :class:`~collections.abc.AsyncIterator` і :class:`~collections.abc.AsyncIterable` анотація базові класи. (Надав Юрій Селіванов у :issue:`24184`.)

source: For earlier Python versions, a backport of the new ABCs is available in an external `PyPI package <https://pypi.org/project/backports_abc>`_.
uk: Для попередніх версій Python бекпорт нових ABC доступний у зовнішньому `пакеті PyPI <https://pypi.org/project/backports_abc>`_.

source: A new :mod:`compileall` option, :samp:`-j {N}`, allows running *N* workers simultaneously to perform parallel bytecode compilation. The :func:`~compileall.compile_dir` function has a corresponding ``workers`` parameter. (Contributed by Claudiu Popa in :issue:`16104`.)
uk: Нова опція :mod:`compileall`, :samp:`-j {N}`, дозволяє запускати *N* робочих процесів одночасно для виконання паралельної компіляції байт-коду. Функція :func:`~compileall.compile_dir` має відповідний параметр ``workers``. (Надав Клаудіу Попа в :issue:`16104`.)

source: Another new option, ``-r``, allows controlling the maximum recursion level for subdirectories. (Contributed by Claudiu Popa in :issue:`19628`.)
uk: Ще один новий параметр, ``-r``, дозволяє контролювати максимальний рівень рекурсії для підкаталогів. (Надав Клаудіу Попа в :issue:`19628`.)

source: The ``-q`` command line option can now be specified more than once, in which case all output, including errors, will be suppressed. The corresponding ``quiet`` parameter in :func:`~compileall.compile_dir`, :func:`~compileall.compile_file`, and :func:`~compileall.compile_path` can now accept an integer value indicating the level of output suppression. (Contributed by Thomas Kluyver in :issue:`21338`.)
uk: Параметр командного рядка ``-q`` тепер можна вказувати кілька разів, у цьому випадку всі виведення, включаючи помилки, будуть придушені. Відповідний параметр ``quiet`` у :func:`~compileall.compile_dir`, :func:`~compileall.compile_file` і :func:`~compileall.compile_path` тепер може приймати ціле значення, що вказує на рівень виведення придушення. (Надав Томас Клюйвер у :issue:`21338`.)

source: The :meth:`Executor.map() <concurrent.futures.Executor.map>` method now accepts a *chunksize* argument to allow batching of tasks to improve performance when :meth:`~concurrent.futures.ProcessPoolExecutor` is used. (Contributed by Dan O'Reilly in :issue:`11271`.)
uk: Метод :meth:`Executor.map() <concurrent.futures.Executor.map>` тепер приймає аргумент *chunksize*, щоб дозволити групування завдань для підвищення продуктивності, коли використовується :meth:`~concurrent.futures.ProcessPoolExecutor`. (Надав Ден О'Райлі в :issue:`11271`.)

source: The number of workers in the :class:`~concurrent.futures.ThreadPoolExecutor` constructor is optional now. The default value is 5 times the number of CPUs. (Contributed by Claudiu Popa in :issue:`21527`.)
uk: Кількість робітників у конструкторі :class:`~concurrent.futures.ThreadPoolExecutor` тепер необов’язкова. Значення за замовчуванням у 5 разів перевищує кількість ЦП. (Надав Клаудіу Попа в :issue:`21527`.)

source: configparser
uk: аналізатор конфігурації

source: :mod:`configparser` now provides a way to customize the conversion of values by specifying a dictionary of converters in the :class:`~configparser.ConfigParser` constructor, or by defining them as methods in ``ConfigParser`` subclasses. Converters defined in a parser instance are inherited by its section proxies.
uk: :mod:`configparser` тепер надає можливість налаштувати перетворення значень, вказавши словник перетворювачів у конструкторі :class:`~configparser.ConfigParser` або визначивши їх як методи в підкласах ``ConfigParser``. Конвертери, визначені в екземплярі аналізатора, успадковуються його проксі-серверами розділів.

source: Example::
uk: Приклад::

source: (Contributed by Łukasz Langa in :issue:`18159`.)
uk: (Надав Łukasz Langa в :issue:`18159`.)

source: The new :func:`~contextlib.redirect_stderr` :term:`context manager` (similar to :func:`~contextlib.redirect_stdout`) makes it easier for utility scripts to handle inflexible APIs that write their output to :data:`sys.stderr` and don't provide any options to redirect it::
uk: Новий :func:`~contextlib.redirect_stderr` :term:`context manager` (схожий на :func:`~contextlib.redirect_stdout`) спрощує роботу сценаріїв утиліт з негнучкими API, які записують свій вихід до :data:`sys.stderr` і не надає жодних опцій для його перенаправлення::

source: (Contributed by Berker Peksag in :issue:`22389`.)
uk: (Надано Berker Peksag у :issue:`22389`.)

source: The :meth:`~csv.csvwriter.writerow` method now supports arbitrary iterables, not just sequences. (Contributed by Serhiy Storchaka in :issue:`23171`.)
uk: Метод :meth:`~csv.csvwriter.writerow` тепер підтримує довільні ітерації, а не лише послідовності. (Надав Сергій Сторчака в :issue:`23171`.)

source: curses
uk: прокльони

source: The new :func:`~curses.update_lines_cols` function updates the :envvar:`LINES` and :envvar:`COLS` environment variables. This is useful for detecting manual screen resizing. (Contributed by Arnon Yaari in :issue:`4254`.)
uk: Нова функція :func:`~curses.update_lines_cols` оновлює змінні середовища :envvar:`LINES` і :envvar:`COLS`. Це корисно для виявлення зміни розміру екрана вручну. (Надав Арнон Яарі в :issue:`4254`.)

source: :func:`dumb.open <dbm.dumb.open>` always creates a new database when the flag has the value ``"n"``. (Contributed by Claudiu Popa in :issue:`18039`.)
uk: :func:`dumb.open <dbm.dumb.open>` завжди створює нову базу даних, якщо прапорець має значення ``"n"``. (Надав Клаудіу Попа в :issue:`18039`.)

source: The charset of HTML documents generated by :meth:`HtmlDiff.make_file() <difflib.HtmlDiff.make_file>` can now be customized by using a new *charset* keyword-only argument. The default charset of HTML document changed from ``"ISO-8859-1"`` to ``"utf-8"``. (Contributed by Berker Peksag in :issue:`2052`.)
uk: Набір символів HTML-документів, згенерованих :meth:`HtmlDiff.make_file() <difflib.HtmlDiff.make_file>`, тепер можна налаштувати за допомогою нового аргументу *charset*, що містить лише ключове слово. Стандартний набір кодів HTML-документа змінено з ``"ISO-8859-1"`` на ``"utf-8"``. (Надано Berker Peksag у :issue:`2052`.)

source: The :func:`~difflib.diff_bytes` function can now compare lists of byte strings. This fixes a regression from Python 2. (Contributed by Terry J. Reedy and Greg Ward in :issue:`17445`.)
uk: Функція :func:`~difflib.diff_bytes` тепер може порівнювати списки рядків байтів. Це виправляє регресію з Python 2. (Надано Terry J. Reedy і Greg Ward у :issue:`17445`.)

source: Both the ``build`` and ``build_ext`` commands now accept a ``-j`` option to enable parallel building of extension modules. (Contributed by Antoine Pitrou in :issue:`5309`.)
uk: Обидві команди ``build`` і ``build_ext`` тепер приймають опцію ``-j``, щоб увімкнути паралельне створення модулів розширення. (Надав Антуан Пітру в :issue:`5309`.)

source: The :mod:`distutils` module now supports ``xz`` compression, and can be enabled by passing ``xztar`` as an argument to ``bdist --format``. (Contributed by Serhiy Storchaka in :issue:`16314`.)
uk: Модуль :mod:`distutils` тепер підтримує стиснення ``xz``, і його можна ввімкнути, передавши ``xztar`` як аргумент ``bdist --format``. (Надав Сергій Сторчака в :issue:`16314`.)

source: The :func:`~doctest.DocTestSuite` function returns an empty :class:`unittest.TestSuite` if *module* contains no docstrings, instead of raising :exc:`ValueError`. (Contributed by Glenn Jones in :issue:`15916`.)
uk: Функція :func:`~doctest.DocTestSuite` повертає порожній :class:`unittest.TestSuite`, якщо *module* не містить рядків документації, замість того, щоб викликати :exc:`ValueError`. (Надав Гленн Джонс у :issue:`15916`.)

source: email
uk: електронною поштою

source: A new policy option :attr:`Policy.mangle_from_ <email.policy.Policy.mangle_from_>` controls whether or not lines that start with ``"From "`` in email bodies are prefixed with a ``">"`` character by generators. The default is ``True`` for :attr:`~email.policy.compat32` and ``False`` for all other policies. (Contributed by Milan Oberkirch in :issue:`20098`.)
uk: Нова опція політики :attr:`Policy.mangle_from_ <email.policy.Policy.mangle_from_>` контролює, чи додають генератори до рядків, які починаються з ``"From "``, у тексті електронної пошти префікс ``">"``. За замовчуванням для :attr:`~email.policy.compat32` є ``True`` і ``False`` для всіх інших політик. (Надано Міланом Оберкірхом у :issue:`20098`.)

source: A new :meth:`Message.get_content_disposition() <email.message.Message.get_content_disposition>` method provides easy access to a canonical value for the :mailheader:`Content-Disposition` header. (Contributed by Abhilash Raj in :issue:`21083`.)
uk: Новий метод :meth:`Message.get_content_disposition() <email.message.Message.get_content_disposition>` забезпечує легкий доступ до канонічного значення для заголовка :mailheader:`Content-Disposition`. (Надав Абхілаш Радж у :issue:`21083`.)

source: A new policy option :attr:`EmailPolicy.utf8 <email.policy.EmailPolicy.utf8>` can be set to ``True`` to encode email headers using the UTF-8 charset instead of using encoded words. This allows ``Messages`` to be formatted according to :rfc:`6532` and used with an SMTP server that supports the :rfc:`6531` ``SMTPUTF8`` extension. (Contributed by R. David Murray in :issue:`24211`.)
uk: Для нового параметра політики :attr:`EmailPolicy.utf8 <email.policy.EmailPolicy.utf8>` можна встановити значення ``True`` для кодування заголовків електронної пошти за допомогою набору символів UTF-8 замість використання закодованих слів. Це дозволяє форматувати ``повідомлення`` відповідно до :rfc:`6532` і використовувати їх із сервером SMTP, який підтримує :rfc:`6531` розширення ``SMTPUTF8``. (Надав Р. Девід Мюррей у :issue:`24211`.)

source: The :class:`mime.text.MIMEText <email.mime.text.MIMEText>` constructor now accepts a :class:`charset.Charset <email.charset.Charset>` instance. (Contributed by Claude Paroz and Berker Peksag in :issue:`16324`.)
uk: Конструктор :class:`mime.text.MIMEText <email.mime.text.MIMEText>` тепер приймає екземпляр :class:`charset.Charset <email.charset.Charset>`. (Надано Клодом Парозом і Беркером Пексагом у :issue:`16324`.)

source: The :class:`~enum.Enum` callable has a new parameter *start* to specify the initial number of enum values if only *names* are provided::
uk: Викликаний :class:`~enum.Enum` має новий параметр *start* для визначення початкової кількості значень переліку, якщо надано лише *імена*::

source: (Contributed by Ethan Furman in :issue:`21706`.)
uk: (Надав Ітан Фурман у :issue:`21706`.)

source: faulthandler
uk: обробник помилок

source: The :func:`~faulthandler.enable`, :func:`~faulthandler.register`, :func:`~faulthandler.dump_traceback` and :func:`~faulthandler.dump_traceback_later` functions now accept file descriptors in addition to file-like objects. (Contributed by Wei Wu in :issue:`23566`.)
uk: Функції :func:`~faulthandler.enable`, :func:`~faulthandler.register`, :func:`~faulthandler.dump_traceback` і :func:`~faulthandler.dump_traceback_later` тепер приймають дескриптори файлів на додаток до file- як предмети. (Надав Вей Ву в :issue:`23566`.)

source: Most of the :func:`~functools.lru_cache` machinery is now implemented in C, making it significantly faster. (Contributed by Matt Joiner, Alexey Kachayev, and Serhiy Storchaka in :issue:`14373`.)
uk: Більшість механізмів :func:`~functools.lru_cache` тепер реалізовано на C, що робить його значно швидшим. (Надано Метом Джойнером, Олексієм Качаєвим і Сергієм Сторчакою в :issue:`14373`.)

source: glob
uk: глоб

source: The :func:`~glob.iglob` and :func:`~glob.glob` functions now support recursive search in subdirectories, using the ``"**"`` pattern. (Contributed by Serhiy Storchaka in :issue:`13968`.)
uk: Функції :func:`~glob.iglob` і :func:`~glob.glob` тепер підтримують рекурсивний пошук у підкаталогах за шаблоном ``"**"``. (Надав Сергій Сторчака в :issue:`13968`.)

source: The *mode* argument of the :class:`~gzip.GzipFile` constructor now accepts ``"x"`` to request exclusive creation. (Contributed by Tim Heaney in :issue:`19222`.)
uk: Аргумент *mode* конструктора :class:`~gzip.GzipFile` тепер приймає ``"x"`` для запиту ексклюзивного створення. (Надав Тім Хіні в :issue:`19222`.)

source: Element comparison in :func:`~heapq.merge` can now be customized by passing a :term:`key function` in a new optional *key* keyword argument, and a new optional *reverse* keyword argument can be used to reverse element comparison::
uk: Порівняння елементів у :func:`~heapq.merge` тепер можна налаштувати, передавши :term:`key function` в новий необов’язковий аргумент ключового слова *key*, а новий додатковий аргумент ключового слова *reverse* можна використовувати для зворотного порівняння елементів::

source: (Contributed by Raymond Hettinger in :issue:`13742`.)
uk: (Надав Реймонд Геттінгер у :issue:`13742`.)

source: A new :class:`HTTPStatus <http.HTTPStatus>` enum that defines a set of HTTP status codes, reason phrases and long descriptions written in English. (Contributed by Demian Brecht in :issue:`21793`.)
uk: Новий перелік :class:`HTTPStatus <http.HTTPStatus>`, який визначає набір кодів стану HTTP, фраз причин і довгих описів, написаних англійською мовою. (Надав Деміан Брехт у :issue:`21793`.)

source: :meth:`HTTPConnection.getresponse() <http.client.HTTPConnection.getresponse>` now raises a :exc:`~http.client.RemoteDisconnected` exception when a remote server connection is closed unexpectedly. Additionally, if a :exc:`ConnectionError` (of which ``RemoteDisconnected`` is a subclass) is raised, the client socket is now closed automatically, and will reconnect on the next request::
uk: :meth:`HTTPConnection.getresponse() <http.client.HTTPConnection.getresponse>` тепер викликає виняток :exc:`~http.client.RemoteDisconnected`, коли з’єднання з віддаленим сервером неочікувано закривається. Крім того, якщо виникає :exc:`ConnectionError` (підкласом якого є ``RemoteDisconnected``), клієнтський сокет тепер автоматично закривається та підключатиметься за наступним запитом::

source: (Contributed by Martin Panter in :issue:`3566`.)
uk: (Надав Мартін Пантер у :issue:`3566`.)

source: idlelib and IDLE
uk: idlelib і IDLE

source: Since idlelib implements the IDLE shell and editor and is not intended for import by other programs, it gets improvements with every release. See :file:`Lib/idlelib/NEWS.txt` for a cumulative list of changes since 3.4.0, as well as changes made in future 3.5.x releases. This file is also available from the IDLE :menuselection:`Help --> About IDLE` dialog.
uk: Оскільки idlelib реалізує оболонку та редактор IDLE і не призначений для імпорту іншими програмами, він отримує покращення з кожним випуском. Дивіться :file:`Lib/idlelib/NEWS.txt` для сукупного списку змін, внесених після версії 3.4.0, а також змін, внесених у майбутніх версіях 3.5.x. Цей файл також доступний у діалоговому вікні IDLE :menuselection:`Довідка --> Про IDLE`.

source: imaplib
uk: імапліб

source: The :class:`~imaplib.IMAP4` class now supports the :term:`context manager` protocol. When used in a :keyword:`with` statement, the IMAP4 ``LOGOUT`` command will be called automatically at the end of the block. (Contributed by Tarek Ziadé and Serhiy Storchaka in :issue:`4972`.)
uk: Клас :class:`~imaplib.IMAP4` тепер підтримує протокол :term:`context manager`. У разі використання в операторі :keyword:`with` команда ``LOGOUT`` IMAP4 буде викликана автоматично в кінці блоку. (Надано Тареком Зіаде та Сергієм Сторчакою в :issue:`4972`.)

source: The :mod:`imaplib` module now supports :rfc:`5161` (ENABLE Extension) and :rfc:`6855` (UTF-8 Support) via the :meth:`IMAP4.enable() <imaplib.IMAP4.enable>` method. A new :attr:`IMAP4.utf8_enabled <imaplib.IMAP4.utf8_enabled>` attribute tracks whether or not :rfc:`6855` support is enabled. (Contributed by Milan Oberkirch, R. David Murray, and Maciej Szulik in :issue:`21800`.)
uk: Модуль :mod:`imaplib` тепер підтримує :rfc:`5161` (розширення ENABLE) і :rfc:`6855` (підтримка UTF-8) через метод :meth:`IMAP4.enable() <imaplib.IMAP4.enable>`. Новий атрибут :attr:`IMAP4.utf8_enabled <imaplib.IMAP4.utf8_enabled>` відстежує, чи ввімкнено підтримку :rfc:`6855`. (Надано Міланом Оберкірхом, Р. Девідом Мюрреєм і Мацеєм Шуліком у :issue:`21800`.)

source: The :mod:`imaplib` module now automatically encodes non-ASCII string usernames and passwords using UTF-8, as recommended by the RFCs. (Contributed by Milan Oberkirch in :issue:`21800`.)
uk: Модуль :mod:`imaplib` тепер автоматично кодує рядкові імена користувачів і паролі, відмінні від ASCII, за допомогою UTF-8, як рекомендовано RFC. (Надав Мілан Оберкірх у :issue:`21800`.)

source: The :func:`~imghdr.what` function now recognizes the `OpenEXR <http://www.openexr.com>`_ format (contributed by Martin Vignali and Claudiu Popa in :issue:`20295`), and the `WebP <https://en.wikipedia.org/wiki/WebP>`_ format (contributed by Fabrice Aneche and Claudiu Popa in :issue:`20197`.)
uk: Функція :func:`~imghdr.what` тепер розпізнає формат `OpenEXR <http://www.openexr.com>`_ (наданий Мартіном Віньялі та Клаудіу Попою в :issue:`20295`) і формат `WebP <https://en.wikipedia.org/wiki/WebP>`_ (наданий Фабрісом Анешем і Клаудіу Попа в :issue:`20197`.)

source: The :class:`util.LazyLoader <importlib.util.LazyLoader>` class allows for lazy loading of modules in applications where startup time is important. (Contributed by Brett Cannon in :issue:`17621`.)
uk: Клас :class:`util.LazyLoader <importlib.util.LazyLoader>` дозволяє відкладено завантажувати модулі в програмах, де важливий час запуску. (Надано Бреттом Кенноном у :issue:`17621`.)

source: The :func:`abc.InspectLoader.source_to_code() <importlib.abc.InspectLoader.source_to_code>` method is now a static method. This makes it easier to initialize a module object with code compiled from a string by running ``exec(code, module.__dict__)``. (Contributed by Brett Cannon in :issue:`21156`.)
uk: Метод :func:`abc.InspectLoader.source_to_code() <importlib.abc.InspectLoader.source_to_code>` тепер є статичним методом. Це полегшує ініціалізацію об’єкта модуля кодом, скомпільованим із рядка, запустивши ``exec(code, module.__dict__)``. (Надано Бреттом Кенноном у :issue:`21156`.)

source: The new :func:`util.module_from_spec() <importlib.util.module_from_spec>` function is now the preferred way to create a new module. As opposed to creating a :class:`types.ModuleType` instance directly, this new function will set the various import-controlled attributes based on the passed-in spec object. (Contributed by Brett Cannon in :issue:`20383`.)
uk: Нова функція :func:`util.module_from_spec() <importlib.util.module_from_spec>` тепер є кращим способом створення нового модуля. На відміну від безпосереднього створення екземпляра :class:`types.ModuleType`, ця нова функція встановлюватиме різні контрольовані імпортом атрибути на основі переданого специфікаційного об’єкта. (Надано Бреттом Кенноном у :issue:`20383`.)

source: inspect
uk: оглядати

source: Both the :class:`~inspect.Signature` and :class:`~inspect.Parameter` classes are now picklable and hashable. (Contributed by Yury Selivanov in :issue:`20726` and :issue:`20334`.)
uk: Обидва класи :class:`~inspect.Signature` і :class:`~inspect.Parameter` тепер можна вибирати та хешувати. (Надав Юрій Селіванов у :issue:`20726` і :issue:`20334`.)

source: A new :meth:`BoundArguments.apply_defaults() <inspect.BoundArguments.apply_defaults>` method provides a way to set default values for missing arguments::
uk: Новий метод :meth:`BoundArguments.apply_defaults() <inspect.BoundArguments.apply_defaults>` забезпечує спосіб встановлення значень за замовчуванням для відсутніх аргументів:
