Repository: python/python-docs-uk
Catalog: whatsnew/3.5.po
Languages: uk

source: Use of :const:`re.LOCALE` flag with str patterns or :const:`re.ASCII` is now deprecated. (Contributed by Serhiy Storchaka in :issue:`22407`.)
uk: Використання прапора :const:`re.LOCALE` із шаблонами str або :const:`re.ASCII` тепер застаріло. (Надав Сергій Сторчака в :issue:`22407`.)

source: Use of unrecognized special sequences consisting of ``'\'`` and an ASCII letter in regular expression patterns and replacement patterns now raises a deprecation warning and will be forbidden in Python 3.6. (Contributed by Serhiy Storchaka in :issue:`23622`.)
uk: Використання нерозпізнаних спеціальних послідовностей, що складаються з ``'\'`` і літери ASCII у шаблонах регулярних виразів і шаблонах заміни, тепер викликає попередження про застаріння та буде заборонено в Python 3.6. (Надав Сергій Сторчака в :issue:`23622`.)

source: The undocumented and unofficial *use_load_tests* default argument of the :meth:`unittest.TestLoader.loadTestsFromModule` method now is deprecated and ignored. (Contributed by Robert Collins and Barry A. Warsaw in :issue:`16662`.)
uk: Недокументований і неофіційний аргумент *use_load_tests* за замовчуванням методу :meth:`unittest.TestLoader.loadTestsFromModule` тепер застарілий і ігнорується. (Надано Робертом Коллінзом і Баррі А. Варшавою в :issue:`16662`.)

source: Removed
uk: Видалено

source: API and Feature Removals
uk: Видалення API та функцій

source: The following obsolete and previously deprecated APIs and features have been removed:
uk: Наступні застарілі API та функції, які раніше не підтримувалися, видалено:

source: The ``__version__`` attribute has been dropped from the email package. The email code hasn't been shipped separately from the stdlib for a long time, and the ``__version__`` string was not updated in the last few releases.
uk: Атрибут ``__version__`` видалено з пакета електронної пошти. Код електронної пошти не надсилався окремо від stdlib протягом тривалого часу, а рядок ``__version__`` не оновлювався в останніх кількох випусках.

source: The internal ``Netrc`` class in the :mod:`ftplib` module was deprecated in 3.4, and has now been removed. (Contributed by Matt Chaput in :issue:`6623`.)
uk: Внутрішній клас ``Netrc`` у модулі :mod:`ftplib` було визнано застарілим у версії 3.4 і тепер його видалено. (Надав Мет Чапут у :issue:`6623`.)

source: The concept of ``.pyo`` files has been removed.
uk: Поняття файлів ``.pyo`` було видалено.

source: The JoinableQueue class in the provisional :mod:`asyncio` module was deprecated in 3.4.4 and is now removed. (Contributed by A. Jesse Jiryu Davis in :issue:`23464`.)
uk: Клас JoinableQueue у попередньому модулі :mod:`asyncio` був застарілим у версії 3.4.4 і тепер видалений. (Надав А. Джессі Джірю Девіс у :issue:`23464`.)

source: Porting to Python 3.5
uk: Перенесення на Python 3.5

source: This section lists previously described changes and other bugfixes that may require changes to your code.
uk: У цьому розділі наведено описані раніше зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді.

source: Changes in Python behavior
uk: Зміни в поведінці Python

source: Due to an oversight, earlier Python versions erroneously accepted the following syntax::
uk: Через помилку попередні версії Python помилково приймали такий синтаксис:

source: Python 3.5 now correctly raises a :exc:`SyntaxError`, as generator expressions must be put in parentheses if not a sole argument to a function.
uk: Python 3.5 тепер правильно викликає :exc:`SyntaxError`, оскільки вирази генератора потрібно поміщати в дужки, якщо вони не є єдиним аргументом функції.

source: Changes in the Python API
uk: Зміни в API Python

source: :pep:`475`: System calls are now retried when interrupted by a signal instead of raising :exc:`InterruptedError` if the Python signal handler does not raise an exception.
uk: :pep:`475`: Системні виклики тепер повторюються, коли їх перериває сигнал, замість того, щоб викликати :exc:`InterruptedError`, якщо обробник сигналів Python не викликає виключення.

source: Before Python 3.5, a :class:`datetime.time` object was considered to be false if it represented midnight in UTC. This behavior was considered obscure and error-prone and has been removed in Python 3.5. See :issue:`13936` for full details.
uk: До Python 3.5 об’єкт :class:`datetime.time` вважався хибним, якщо він представляв північ за UTC. Таку поведінку вважали незрозумілою та схильною до помилок, тому її було видалено в Python 3.5. Дивіться :issue:`13936` для повної інформації.

source: The :meth:`ssl.SSLSocket.send()` method now raises either :exc:`ssl.SSLWantReadError` or :exc:`ssl.SSLWantWriteError` on a non-blocking socket if the operation would block. Previously, it would return ``0``. (Contributed by Nikolaus Rath in :issue:`20951`.)
uk: Метод :meth:`ssl.SSLSocket.send()` тепер викликає :exc:`ssl.SSLWantReadError` або :exc:`ssl.SSLWantWriteError` на неблокуючому сокеті, якщо операція буде заблокована. Раніше він повертав ``0``. (Надав Ніколаус Рат у :issue:`20951`.)

source: The ``__name__`` attribute of generators is now set from the function name, instead of being set from the code name. Use ``gen.gi_code.co_name`` to retrieve the code name. Generators also have a new ``__qualname__`` attribute, the qualified name, which is now used for the representation of a generator (``repr(gen)``). (Contributed by Victor Stinner in :issue:`21205`.)
uk: Атрибут ``__name__`` генераторів тепер встановлюється з імені функції, а не з кодового імені. Використовуйте ``gen.gi_code.co_name``, щоб отримати кодову назву. Генератори також мають новий атрибут ``__qualname__``, кваліфіковане ім’я, яке тепер використовується для представлення генератора (``repr(gen)``). (Надав Віктор Стіннер у :issue:`21205`.)

source: The deprecated "strict" mode and argument of :class:`~html.parser.HTMLParser`, :meth:`HTMLParser.error`, and the :exc:`HTMLParserError` exception have been removed. (Contributed by Ezio Melotti in :issue:`15114`.) The *convert_charrefs* argument of :class:`~html.parser.HTMLParser` is now ``True`` by default. (Contributed by Berker Peksag in :issue:`21047`.)
uk: Застарілий "суворий" режим і аргумент :class:`~html.parser.HTMLParser`, :meth:`HTMLParser.error` і виняток :exc:`HTMLParserError` видалено. (Надано Еціо Мелотті в :issue:`15114`.) Аргумент *convert_charrefs* :class:`~html.parser.HTMLParser` тепер за умовчанням має значення ``True``. (Надано Berker Peksag у :issue:`21047`.)

source: Although it is not formally part of the API, it is worth noting for porting purposes (ie: fixing tests) that error messages that were previously of the form "'sometype' does not support the buffer protocol" are now of the form "a :term:`bytes-like object` is required, not 'sometype'". (Contributed by Ezio Melotti in :issue:`16518`.)
uk: Хоча це формально не є частиною API, варто зазначити, що для цілей перенесення (тобто: виправлення тестів) повідомлення про помилки, які раніше мали форму "'sometype' не підтримує буферний протокол", тепер мають форму "a :term:`bytes-like object` потрібен, а не 'sometype'". (Надав Еціо Мелотті в :issue:`16518`.)

source: If the current directory is set to a directory that no longer exists then :exc:`FileNotFoundError` will no longer be raised and instead :meth:`~importlib.machinery.FileFinder.find_spec` will return ``None`` **without** caching ``None`` in :data:`sys.path_importer_cache`, which is different than the typical case (:issue:`22834`).
uk: Якщо поточний каталог встановлено на каталог, який більше не існує, тоді :exc:`FileNotFoundError` більше не буде викликано, а замість цього :meth:`~importlib.machinery.FileFinder.find_spec` поверне ``None`` **без** кешування ``None`` у :data:`sys.path_importer_cache`, що відрізняється від типового випадку (:issue:`22834`).

source: HTTP status code and messages from :mod:`http.client` and :mod:`http.server` were refactored into a common :class:`~http.HTTPStatus` enum. The values in :mod:`http.client` and :mod:`http.server` remain available for backwards compatibility. (Contributed by Demian Brecht in :issue:`21793`.)
uk: Код статусу HTTP та повідомлення від :mod:`http.client` і :mod:`http.server` були перетворені в загальний перелік :class:`~http.HTTPStatus`. Значення в :mod:`http.client` і :mod:`http.server` залишаються доступними для зворотної сумісності. (Надав Деміан Брехт у :issue:`21793`.)

source: When an import loader defines :meth:`importlib.machinery.Loader.exec_module` it is now expected to also define :meth:`~importlib.machinery.Loader.create_module` (raises a :exc:`DeprecationWarning` now, will be an error in Python 3.6). If the loader inherits from :class:`importlib.abc.Loader` then there is nothing to do, else simply define :meth:`~importlib.machinery.Loader.create_module` to return ``None``. (Contributed by Brett Cannon in :issue:`23014`.)
uk: Коли завантажувач імпорту визначає :meth:`importlib.machinery.Loader.exec_module`, тепер очікується також визначення :meth:`~importlib.machinery.Loader.create_module` (зараз викликає :exc:`DeprecationWarning`, буде помилка в Python 3.6). Якщо завантажувач успадковує :class:`importlib.abc.Loader`, тоді нічого не потрібно робити, інакше просто визначте :meth:`~importlib.machinery.Loader.create_module` для повернення ``None``. (Надав Бретт Кеннон у :issue:`23014`.)

source: The :func:`re.split` function always ignored empty pattern matches, so the ``"x*"`` pattern worked the same as ``"x+"``, and the ``"\b"`` pattern never worked. Now :func:`re.split` raises a warning if the pattern could match an empty string. For compatibility, use patterns that never match an empty string (e.g. ``"x+"`` instead of ``"x*"``). Patterns that could only match an empty string (such as ``"\b"``) now raise an error. (Contributed by Serhiy Storchaka in :issue:`22818`.)
uk: Функція :func:`re.split` завжди ігнорувала збіги порожнього шаблону, тому шаблон ``"x*"`` працював так само, як ``"x+"``, а шаблон ``"\b"`` ніколи не працював. Тепер :func:`re.split` викликає попередження, якщо шаблон може збігатися з порожнім рядком. Для сумісності використовуйте шаблони, які ніколи не відповідають порожньому рядку (наприклад, ``"x+"`` замість ``"x*"``). Шаблони, які можуть відповідати лише порожньому рядку (наприклад, ``"\b"``), тепер викликають помилку. (Надав Сергій Сторчака в :issue:`22818`.)

source: The :class:`http.cookies.Morsel` dict-like interface has been made self consistent: morsel comparison now takes the :attr:`~http.cookies.Morsel.key` and :attr:`~http.cookies.Morsel.value` into account, :meth:`~http.cookies.Morsel.copy` now results in a :class:`~http.cookies.Morsel` instance rather than a :class:`dict`, and :meth:`~http.cookies.Morsel.update` will now raise an exception if any of the keys in the update dictionary are invalid. In addition, the undocumented *LegalChars* parameter of :func:`~http.cookies.Morsel.set` is deprecated and is now ignored. (Contributed by Demian Brecht in :issue:`2211`.)
uk: Dict-подібний інтерфейс :class:`http.cookies.Morsel` був узгоджений: порівняння шматків тепер використовує :attr:`~http.cookies.Morsel.key` і :attr:`~http.cookies.Morsel .value`, :meth:`~http.cookies.Morsel.copy` тепер призводить до екземпляра :class:`~http.cookies.Morsel` замість :class:`dict`, і :meth:`~http.cookies.Morsel.update` тепер викличе виняток, якщо будь-який із ключів у словнику оновлення недійсний. Крім того, недокументований параметр *LegalChars* :func:`~http.cookies.Morsel.set` застарів і тепер ігнорується. (Надав Деміан Брехт у :issue:`2211`.)

source: :pep:`488` has removed ``.pyo`` files from Python and introduced the optional ``opt-`` tag in ``.pyc`` file names. The :func:`importlib.util.cache_from_source` has gained an *optimization* parameter to help control the ``opt-`` tag. Because of this, the *debug_override* parameter of the function is now deprecated. `.pyo` files are also no longer supported as a file argument to the Python interpreter and thus serve no purpose when distributed on their own (i.e. sourceless code distribution). Due to the fact that the magic number for bytecode has changed in Python 3.5, all old `.pyo` files from previous versions of Python are invalid regardless of this PEP.
uk: :pep:`488` видалив файли ``.pyo`` з Python і ввів додатковий тег ``opt-`` в назвах файлів ``.pyc``. :func:`importlib.util.cache_from_source` отримав параметр *optimization*, щоб допомогти контролювати тег ``opt-``. Через це параметр *debug_override* функції тепер застарілий. Файли `.pyo` також більше не підтримуються як аргумент файлу для інтерпретатора Python і, отже, не мають жодної цілі, коли розповсюджуються самостійно (тобто розповсюдження коду без джерел). Через те, що магічне число для байт-коду змінилося в Python 3.5, усі старі файли `.pyo` з попередніх версій Python є недійсними незалежно від цього PEP.

source: The :mod:`socket` module now exports the :data:`~socket.CAN_RAW_FD_FRAMES` constant on linux 3.6 and greater.
uk: Модуль :mod:`socket` тепер експортує константу :data:`~socket.CAN_RAW_FD_FRAMES` у Linux 3.6 і новіших версіях.

source: The :func:`ssl.cert_time_to_seconds` function now interprets the input time as UTC and not as local time, per :rfc:`5280`. Additionally, the return value is always an :class:`int`. (Contributed by Akira Li in :issue:`19940`.)
uk: Функція :func:`ssl.cert_time_to_seconds` тепер інтерпретує введений час як UTC, а не як місцевий час відповідно до :rfc:`5280`. Крім того, повертається значення завжди :class:`int`. (Надав Акіра Лі в :issue:`19940`.)

source: The ``pygettext.py`` Tool now uses the standard +NNNN format for timezones in the POT-Creation-Date header.
uk: Інструмент ``pygettext.py`` тепер використовує стандартний формат +NNNN для часових поясів у заголовку POT-Creation-Date.

source: The :mod:`smtplib` module now uses :data:`sys.stderr` instead of the previous module-level :data:`stderr` variable for debug output. If your (test) program depends on patching the module-level variable to capture the debug output, you will need to update it to capture sys.stderr instead.
uk: Модуль :mod:`smtplib` тепер використовує :data:`sys.stderr` замість попередньої змінної рівня модуля :data:`stderr` для виводу налагодження. Якщо ваша (тестова) програма залежить від виправлення змінної рівня модуля для захоплення вихідних даних налагодження, вам потрібно буде оновити її для захоплення sys.stderr.

source: The :meth:`str.startswith` and :meth:`str.endswith` methods no longer return ``True`` when finding the empty string and the indexes are completely out of range. (Contributed by Serhiy Storchaka in :issue:`24284`.)
uk: Методи :meth:`str.startswith` і :meth:`str.endswith` більше не повертають значення ``True``, коли знаходять порожній рядок, а індекси повністю виходять за межі діапазону. (Надав Сергій Сторчака в :issue:`24284`.)

source: The :func:`inspect.getdoc` function now returns documentation strings inherited from base classes. Documentation strings no longer need to be duplicated if the inherited documentation is appropriate. To suppress an inherited string, an empty string must be specified (or the documentation may be filled in). This change affects the output of the :mod:`pydoc` module and the :func:`help` function. (Contributed by Serhiy Storchaka in :issue:`15582`.)
uk: Функція :func:`inspect.getdoc` тепер повертає рядки документації, успадковані від базових класів. Рядки документації більше не потрібно дублювати, якщо успадкована документація підходить. Щоб приховати успадкований рядок, необхідно вказати порожній рядок (або можна заповнити документацію). Ця зміна впливає на вихідні дані модуля :mod:`pydoc` і функції :func:`help`. (Надав Сергій Сторчака в :issue:`15582`.)

source: Nested :func:`functools.partial` calls are now flattened. If you were relying on the previous behavior, you can now either add an attribute to a :func:`functools.partial` object or you can create a subclass of :func:`functools.partial`. (Contributed by Alexander Belopolsky in :issue:`7830`.)
uk: Вкладені виклики :func:`functools.partial` тепер зведені. Якщо ви покладалися на попередню поведінку, тепер ви можете додати атрибут до об’єкта :func:`functools.partial` або створити підклас :func:`functools.partial`. (Надав Олександр Бєлопольський у :issue:`7830`.)

source: Changes in the C API
uk: Зміни в C API

source: The undocumented :c:member:`~PyMemoryViewObject.format` member of the (non-public) :c:type:`PyMemoryViewObject` structure has been removed. All extensions relying on the relevant parts in ``memoryobject.h`` must be rebuilt.
uk: Недокументований член :c:member:`~PyMemoryViewObject.format` (непублічної) структури :c:type:`PyMemoryViewObject` було видалено. Усі розширення, що покладаються на відповідні частини в ``memoryobject.h``, необхідно перебудувати.

source: The :c:type:`PyMemAllocator` structure was renamed to :c:type:`PyMemAllocatorEx` and a new ``calloc`` field was added.
uk: Структуру :c:type:`PyMemAllocator` було перейменовано на :c:type:`PyMemAllocatorEx` і додано нове поле ``calloc``.

source: Removed non-documented macro :c:macro:`PyObject_REPR` which leaked references. Use format character ``%R`` in :c:func:`PyUnicode_FromFormat`-like functions to format the :func:`repr` of the object. (Contributed by Serhiy Storchaka in :issue:`22453`.)
uk: Видалено незадокументований макрос :c:macro:`PyObject_REPR`, який став джерелом посилань. Використовуйте символ форматування ``%R`` у :c:func:`PyUnicode_FromFormat`-подібних функціях, щоб відформатувати :func:`repr` об’єкта. (Надав Сергій Сторчака в :issue:`22453`.)

source: Because the lack of the :attr:`__module__` attribute breaks pickling and introspection, a deprecation warning is now raised for builtin types without the :attr:`__module__` attribute. This would be an AttributeError in the future. (Contributed by Serhiy Storchaka in :issue:`20204`.)
uk: Оскільки відсутність атрибута :attr:`__module__` порушує маринування та самоаналіз, для вбудованих типів без атрибута :attr:`__module__` тепер видається попередження про застаріле. У майбутньому це буде AttributeError. (Надав Сергій Сторчака у :issue:`20204`.)

source: As part of the :pep:`492` implementation, the ``tp_reserved`` slot of :c:type:`PyTypeObject` was replaced with a :c:member:`tp_as_async` slot. Refer to :ref:`coro-objects` for new types, structures and functions.
uk: У рамках реалізації :pep:`492` слот ``tp_reserved`` :c:type:`PyTypeObject` було замінено на :c:member:`tp_as_async` слот. Зверніться до :ref:`coro-objects` для нових типів, структур і функцій.

source: Notable changes in Python 3.5.4
uk: Помітні зміни в Python 3.5.4

source: New ``make regen-all`` build target
uk: Нова ціль збірки ``make regen-all``

source: To simplify cross-compilation, and to ensure that CPython can reliably be compiled without requiring an existing version of Python to already be available, the autotools-based build system no longer attempts to implicitly recompile generated files based on file modification times.
uk: Щоб спростити крос-компіляцію та гарантувати, що CPython можна надійно скомпілювати без наявності наявної версії Python, система збирання на основі autotools більше не намагається неявно перекомпілювати згенеровані файли на основі часу модифікації файлу.

source: Instead, a new ``make regen-all`` command has been added to force regeneration of these files when desired (e.g. after an initial version of Python has already been built based on the pregenerated versions).
uk: Натомість додано нову команду ``make regen-all``, щоб примусово повторно генерувати ці файли за бажанням (наприклад, після того, як початкова версія Python вже була створена на основі попередньо згенерованих версій).

source: More selective regeneration targets are also defined - see :source:`Makefile.pre.in` for details.
uk: Також визначено більш вибіркові цілі регенерації - подробиці див. :source:`Makefile.pre.in`.

source: (Contributed by Victor Stinner in :issue:`23404`.)
uk: (Надав Віктор Стіннер у :issue:`23404`.)

source: Removal of ``make touch`` build target
uk: Видалення цілі збірки ``make touch``

source: The ``make touch`` build target previously used to request implicit regeneration of generated files by updating their modification times has been removed.
uk: Ціль збірки ``make touch``, яка раніше використовувалася для запиту неявної регенерації згенерованих файлів шляхом оновлення часу їх модифікації, видалено.

source: It has been replaced by the new ``make regen-all`` target.
uk: Його було замінено новою метою ``make regen-all``.
