Repository: python/python-docs-uk
Catalog: whatsnew/3.6.po
Languages: uk

source: The :c:func:`PyUnicode_FSConverter` and :c:func:`PyUnicode_FSDecoder` functions will now accept :term:`path-like objects <path-like object>`.
uk: Функції :c:func:`PyUnicode_FSConverter` і :c:func:`PyUnicode_FSDecoder` тепер прийматимуть :term:`шляхові об’єкти <path-like object>`.

source: Other Improvements
uk: Інші вдосконалення

source: When :option:`--version` (short form: :option:`-V`) is supplied twice, Python prints :data:`sys.version` for detailed information.
uk: Коли :option:`--version` (коротка форма: :option:`-V`) надається двічі, Python друкує :data:`sys.version` для отримання детальної інформації.

source: Deprecated
uk: Застаріле

source: New Keywords
uk: Нові ключові слова

source: ``async`` and ``await`` are not recommended to be used as variable, class, function or module names. Introduced by :pep:`492` in Python 3.5, they will become proper keywords in Python 3.7. Starting in Python 3.6, the use of ``async`` or ``await`` as names will generate a :exc:`DeprecationWarning`.
uk: ``async`` і ``await`` не рекомендується використовувати як імена змінних, класів, функцій або модулів. Представлені :pep:`492` у Python 3.5, вони стануть правильними ключовими словами в Python 3.7. Починаючи з Python 3.6, використання ``async`` або ``await`` як імен створюватиме :exc:`DeprecationWarning`.

source: Deprecated Python behavior
uk: Застаріла поведінка Python

source: Raising the :exc:`StopIteration` exception inside a generator will now generate a :exc:`DeprecationWarning`, and will trigger a :exc:`RuntimeError` in Python 3.7. See :ref:`whatsnew-pep-479` for details.
uk: Підвищення винятку :exc:`StopIteration` всередині генератора тепер створить :exc:`DeprecationWarning` і викличе :exc:`RuntimeError` у Python 3.7. Докладніше див. :ref:`whatsnew-pep-479`.

source: The :meth:`__aiter__` method is now expected to return an asynchronous iterator directly instead of returning an awaitable as previously. Doing the former will trigger a :exc:`DeprecationWarning`. Backward compatibility will be removed in Python 3.7. (Contributed by Yury Selivanov in :issue:`27243`.)
uk: Тепер очікується, що метод :meth:`__aiter__` повертатиме безпосередньо асинхронний ітератор замість того, щоб повертати awaitable, як раніше. Виконання першого призведе до появи :exc:`DeprecationWarning`. У Python 3.7 буде видалено зворотну сумісність. (Надав Юрій Селіванов у :issue:`27243`.)

source: A backslash-character pair that is not a valid escape sequence now generates a :exc:`DeprecationWarning`. Although this will eventually become a :exc:`SyntaxError`, that will not be for several Python releases. (Contributed by Emanuel Barry in :issue:`27364`.)
uk: Пара символів зворотної похилої риски, яка не є дійсною керуючою послідовністю, тепер генерує :exc:`DeprecationWarning`. Хоча це з часом стане :exc:`SyntaxError`, це не буде для кількох випусків Python. (Надав Емануель Баррі в :issue:`27364`.)

source: When performing a relative import, falling back on ``__name__`` and ``__path__`` from the calling module when ``__spec__`` or ``__package__`` are not defined now raises an :exc:`ImportWarning`. (Contributed by Rose Ames in :issue:`25791`.)
uk: Під час виконання відносного імпорту повернення до ``__name__`` і ``__path__`` з викликаючого модуля, коли ``__spec__`` або ``__package__`` тепер не визначено, викликає :exc:`ImportWarning`. (Надано Роуз Еймс у :issue:`25791`.)

source: Deprecated Python modules, functions and methods
uk: Застарілі модулі, функції та методи Python

source: asynchat
uk: асинчат

source: The :mod:`asynchat` has been deprecated in favor of :mod:`asyncio`. (Contributed by Mariatta in :issue:`25002`.)
uk: :mod:`asynchat` застаріло на користь :mod:`asyncio`. (Надано Mariatta в :issue:`25002`.)

source: asyncore
uk: несиндром

source: The :mod:`asyncore` has been deprecated in favor of :mod:`asyncio`. (Contributed by Mariatta in :issue:`25002`.)
uk: :mod:`asyncore` застаріло на користь :mod:`asyncio`. (Надано Mariatta в :issue:`25002`.)

source: Unlike other :mod:`dbm` implementations, the :mod:`dbm.dumb` module creates databases with the ``'rw'`` mode and allows modifying the database opened with the ``'r'`` mode. This behavior is now deprecated and will be removed in 3.8. (Contributed by Serhiy Storchaka in :issue:`21708`.)
uk: На відміну від інших реалізацій :mod:`dbm`, модуль :mod:`dbm.dumb` створює бази даних у режимі ``'rw'`` і дозволяє змінювати базу даних, відкриту в режимі ``'r'``. Ця поведінка тепер застаріла та буде видалена у версії 3.8. (Надав Сергій Сторчака в :issue:`21708`.)

source: The undocumented ``extra_path`` argument to the :class:`~distutils.Distribution` constructor is now considered deprecated and will raise a warning if set. Support for this parameter will be removed in a future Python release. See :issue:`27919` for details.
uk: Недокументований аргумент ``extra_path`` до конструктора :class:`~distutils.Distribution` тепер вважається застарілим і викличе попередження, якщо встановлено. Підтримку цього параметра буде вилучено в майбутньому випуску Python. Докладніше див. :issue:`27919`.

source: grp
uk: група

source: The support of non-integer arguments in :func:`~grp.getgrgid` has been deprecated. (Contributed by Serhiy Storchaka in :issue:`26129`.)
uk: Підтримка нецілочисельних аргументів у :func:`~grp.getgrgid` застаріла. (Надав Сергій Сторчака в :issue:`26129`.)

source: The :meth:`importlib.machinery.SourceFileLoader.load_module` and :meth:`importlib.machinery.SourcelessFileLoader.load_module` methods are now deprecated. They were the only remaining implementations of :meth:`importlib.abc.Loader.load_module` in :mod:`importlib` that had not been deprecated in previous versions of Python in favour of :meth:`importlib.abc.Loader.exec_module`.
uk: Методи :meth:`importlib.machinery.SourceFileLoader.load_module` і :meth:`importlib.machinery.SourcelessFileLoader.load_module` тепер застаріли. Це були єдині реалізації :meth:`importlib.abc.Loader.load_module` в :mod:`importlib`, які не були застарілими в попередніх версіях Python на користь :meth:`importlib.abc.Loader.exec_module`.

source: The :class:`importlib.machinery.WindowsRegistryFinder` class is now deprecated. As of 3.6.0, it is still added to :attr:`sys.meta_path` by default (on Windows), but this may change in future releases.
uk: Клас :class:`importlib.machinery.WindowsRegistryFinder` тепер застарілий. Починаючи з версії 3.6.0, він усе ще додається до :attr:`sys.meta_path` за замовчуванням (у Windows), але це може змінитися в наступних випусках.

source: Undocumented support of general :term:`bytes-like objects <bytes-like object>` as paths in :mod:`os` functions, :func:`compile` and similar functions is now deprecated. (Contributed by Serhiy Storchaka in :issue:`25791` and :issue:`26754`.)
uk: Недокументована підтримка загальних :term:`байт-подібних об’єктів <bytes-like object>` як шляхів у функціях :mod:`os`, :func:`compile` та подібних функціях тепер застаріла. (Надав Сергій Сторчака в :issue:`25791` та :issue:`26754`.)

source: Support for inline flags ``(?letters)`` in the middle of the regular expression has been deprecated and will be removed in a future Python version. Flags at the start of a regular expression are still allowed. (Contributed by Serhiy Storchaka in :issue:`22493`.)
uk: Підтримка вбудованих прапорців ``(?літери)`` в середині регулярного виразу застаріла та буде видалена в майбутній версії Python. Прапорці на початку регулярного виразу все ще дозволені. (Надав Сергій Сторчака в :issue:`22493`.)

source: OpenSSL 0.9.8, 1.0.0 and 1.0.1 are deprecated and no longer supported. In the future the :mod:`ssl` module will require at least OpenSSL 1.0.2 or 1.1.0.
uk: OpenSSL 0.9.8, 1.0.0 і 1.0.1 застаріли та більше не підтримуються. У майбутньому модуль :mod:`ssl` вимагатиме принаймні OpenSSL 1.0.2 або 1.1.0.

source: SSL-related arguments like ``certfile``, ``keyfile`` and ``check_hostname`` in :mod:`ftplib`, :mod:`http.client`, :mod:`imaplib`, :mod:`poplib`, and :mod:`smtplib` have been deprecated in favor of ``context``. (Contributed by Christian Heimes in :issue:`28022`.)
uk: Аргументи, пов’язані з SSL, як-от ``certfile``, ``keyfile`` і ``check_hostname`` у :mod:`ftplib`, :mod:`http.client`, :mod:`imaplib`, :mod:`poplib` і :mod:`smtplib` застаріли на користь ``context``. (Надав Крістіан Хеймс у :issue:`28022`.)

source: A couple of protocols and functions of the :mod:`ssl` module are now deprecated. Some features will no longer be available in future versions of OpenSSL. Other features are deprecated in favor of a different API. (Contributed by Christian Heimes in :issue:`28022` and :issue:`26470`.)
uk: Кілька протоколів і функцій модуля :mod:`ssl` тепер застаріли. Деякі функції більше не будуть доступні в майбутніх версіях OpenSSL. Інші функції застаріли на користь іншого API. (Надано Крістіаном Хеймсом у :issue:`28022` та :issue:`26470`.)

source: The :mod:`tkinter.tix` module is now deprecated. :mod:`tkinter` users should use :mod:`tkinter.ttk` instead.
uk: Модуль :mod:`tkinter.tix` тепер не підтримується. Користувачі :mod:`tkinter` повинні замість цього використовувати :mod:`tkinter.ttk`.

source: The ``pyvenv`` script has been deprecated in favour of ``python3 -m venv``. This prevents confusion as to what Python interpreter ``pyvenv`` is connected to and thus what Python interpreter will be used by the virtual environment. (Contributed by Brett Cannon in :issue:`25154`.)
uk: Сценарій ``pyvenv`` застарів на користь ``python3 -m venv``. Це запобігає плутанині щодо того, до якого інтерпретатора Python підключено ``pyvenv`` і, таким чином, який інтерпретатор Python використовуватиме віртуальне середовище. (Надано Бреттом Кенноном у :issue:`25154`.)

source: Deprecated functions and types of the C API
uk: Застарілі функції та типи C API

source: Undocumented functions :c:func:`PyUnicode_AsEncodedObject`, :c:func:`PyUnicode_AsDecodedObject`, :c:func:`PyUnicode_AsEncodedUnicode` and :c:func:`PyUnicode_AsDecodedUnicode` are deprecated now. Use the :ref:`generic codec based API <codec-registry>` instead.
uk: Недокументовані функції :c:func:`PyUnicode_AsEncodedObject`, :c:func:`PyUnicode_AsDecodedObject`, :c:func:`PyUnicode_AsEncodedUnicode` і :c:func:`PyUnicode_AsDecodedUnicode` зараз застаріли. Натомість використовуйте :ref:`загальний API на основі кодека <codec-registry>`.

source: Deprecated Build Options
uk: Застарілі параметри збірки

source: The ``--with-system-ffi`` configure flag is now on by default on non-macOS UNIX platforms. It may be disabled by using ``--without-system-ffi``, but using the flag is deprecated and will not be accepted in Python 3.7. macOS is unaffected by this change. Note that many OS distributors already use the ``--with-system-ffi`` flag when building their system Python.
uk: Прапор конфігурації ``--with-system-ffi`` тепер увімкнено за замовчуванням на платформах UNIX, відмінних від macOS. Його можна вимкнути за допомогою ``--without-system-ffi``, але використання прапора є застарілим і не буде прийматися в Python 3.7. Ця зміна не впливає на macOS. Зауважте, що багато розповсюджувачів ОС уже використовують прапорець ``--with-system-ffi`` під час створення своєї системи Python.

source: Removed
uk: Видалено

source: API and Feature Removals
uk: Видалення API та функцій

source: Unknown escapes consisting of ``'\'`` and an ASCII letter in regular expressions will now cause an error. In replacement templates for :func:`re.sub` they are still allowed, but deprecated. The :const:`re.LOCALE` flag can now only be used with binary patterns.
uk: Невідомі вихідні коди, що складаються з ``'\'`` і літери ASCII у регулярних виразах, тепер спричинятимуть помилку. У шаблонах заміни для :func:`re.sub` вони все ще дозволені, але не рекомендовані. Прапор :const:`re.LOCALE` тепер можна використовувати лише з бінарними шаблонами.

source: ``inspect.getmoduleinfo()`` was removed (was deprecated since CPython 3.3). :func:`inspect.getmodulename` should be used for obtaining the module name for a given path. (Contributed by Yury Selivanov in :issue:`13248`.)
uk: ``inspect.getmoduleinfo()`` було видалено (було застарілим з CPython 3.3). :func:`inspect.getmodulename` слід використовувати для отримання імені модуля для заданого шляху. (Надав Юрій Селіванов у :issue:`13248`.)

source: ``traceback.Ignore`` class and ``traceback.usage``, ``traceback.modname``, ``traceback.fullmodname``, ``traceback.find_lines_from_code``, ``traceback.find_lines``, ``traceback.find_strings``, ``traceback.find_executable_lines`` methods were removed from the :mod:`traceback` module. They were undocumented methods deprecated since Python 3.2 and equivalent functionality is available from private methods.
uk: Клас ``traceback.Ignore`` і ``traceback.usage``, ``traceback.modname``, ``traceback.fullmodname``, ``traceback.find_lines_from_code``, ``traceback.find_lines``, Методи ``traceback.find_strings``, ``traceback.find_executable_lines`` видалено з модуля :mod:`traceback`. Це були недокументовані методи, які застаріли з Python 3.2, і еквівалентна функціональність доступна з приватних методів.

source: The ``tk_menuBar()`` and ``tk_bindForTraversal()`` dummy methods in :mod:`tkinter` widget classes were removed (corresponding Tk commands were obsolete since Tk 4.0).
uk: Фіктивні методи ``tk_menuBar()`` і ``tk_bindForTraversal()`` у класах віджетів :mod:`tkinter` були видалені (відповідні команди Tk застаріли з Tk 4.0).

source: The :meth:`~zipfile.ZipFile.open` method of the :class:`zipfile.ZipFile` class no longer supports the ``'U'`` mode (was deprecated since Python 3.4). Use :class:`io.TextIOWrapper` for reading compressed text files in :term:`universal newlines` mode.
uk: Метод :meth:`~zipfile.ZipFile.open` класу :class:`zipfile.ZipFile` більше не підтримує режим ``'U'`` (був застарілим з Python 3.4). Використовуйте :class:`io.TextIOWrapper` для читання стиснених текстових файлів у режимі :term:`universal newlines`.

source: The undocumented ``IN``, ``CDROM``, ``DLFCN``, ``TYPES``, ``CDIO``, and ``STROPTS`` modules have been removed. They had been available in the platform specific ``Lib/plat-*/`` directories, but were chronically out of date, inconsistently available across platforms, and unmaintained. The script that created these modules is still available in the source distribution at :source:`Tools/scripts/h2py.py`.
uk: Недокументовані модулі ``IN``, ``CDROM``, ``DLFCN``, ``TYPES``, ``CDIO`` та ``STROPTS`` були видалені. Вони були доступні в каталогах ``Lib/plat-*/`` для певної платформи, але були перманентно застарілими, неоднаково доступними на різних платформах і не підтримувалися. Скрипт, який створив ці модулі, все ще доступний у вихідному дистрибутиві за адресою :source:`Tools/scripts/h2py.py`.

source: The deprecated ``asynchat.fifo`` class has been removed.
uk: Застарілий клас ``asynchat.fifo`` було видалено.

source: Porting to Python 3.6
uk: Перенесення на Python 3.6

source: This section lists previously described changes and other bugfixes that may require changes to your code.
uk: У цьому розділі наведено описані раніше зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді.

source: Changes in 'python' Command Behavior
uk: Зміни в поведінці команд "python".

source: The output of a special Python build with defined ``COUNT_ALLOCS``, ``SHOW_ALLOC_COUNT`` or ``SHOW_TRACK_COUNT`` macros is now off by default. It can be re-enabled using the ``-X showalloccount`` option. It now outputs to ``stderr`` instead of ``stdout``. (Contributed by Serhiy Storchaka in :issue:`23034`.)
uk: Вихід спеціальної збірки Python із визначеними макросами ``COUNT_ALLOCS``, ``SHOW_ALLOC_COUNT`` або ``SHOW_TRACK_COUNT`` тепер вимкнено за замовчуванням. Його можна повторно ввімкнути за допомогою параметра ``-X showalloccount``. Тепер він виводить на ``stderr`` замість ``stdout``. (Надав Сергій Сторчака в :issue:`23034`.)

source: Changes in the Python API
uk: Зміни в API Python

source: :func:`open() <open>` will no longer allow combining the ``'U'`` mode flag with ``'+'``. (Contributed by Jeff Balogh and John O'Connor in :issue:`2091`.)
uk: :func:`open() <open>` більше не дозволить комбінувати прапор режиму ``'U'`` з ``'+'``. (Надано Джеффом Балогом і Джоном О'Коннором у :issue:`2091`.)

source: :mod:`sqlite3` no longer implicitly commits an open transaction before DDL statements.
uk: :mod:`sqlite3` більше не явно фіксує відкриту транзакцію перед операторами DDL.

source: On Linux, :func:`os.urandom` now blocks until the system urandom entropy pool is initialized to increase the security.
uk: У Linux :func:`os.urandom` тепер блокується, доки системний пул ентропії не буде ініціалізовано для підвищення безпеки.

source: When :meth:`importlib.abc.Loader.exec_module` is defined, :meth:`importlib.abc.Loader.create_module` must also be defined.
uk: Коли визначено :meth:`importlib.abc.Loader.exec_module`, :meth:`importlib.abc.Loader.create_module` також має бути визначено.

source: :c:func:`PyErr_SetImportError` now sets :exc:`TypeError` when its **msg** argument is not set. Previously only ``NULL`` was returned.
uk: :c:func:`PyErr_SetImportError` тепер встановлює :exc:`TypeError`, коли його аргумент **msg** не встановлено. Раніше повертався лише ``NULL``.

source: The format of the ``co_lnotab`` attribute of code objects changed to support a negative line number delta. By default, Python does not emit bytecode with a negative line number delta. Functions using ``frame.f_lineno``, ``PyFrame_GetLineNumber()`` or ``PyCode_Addr2Line()`` are not affected. Functions directly decoding ``co_lnotab`` should be updated to use a signed 8-bit integer type for the line number delta, but this is only required to support applications using a negative line number delta. See ``Objects/lnotab_notes.txt`` for the ``co_lnotab`` format and how to decode it, and see the :pep:`511` for the rationale.
uk: Формат атрибута ``co_lnotab`` об’єктів коду змінено для підтримки від’ємної дельти номера рядка. За замовчуванням Python не видає байт-код із від’ємним номером рядка дельта. Функції, що використовують ``frame.f_lineno``, ``PyFrame_GetLineNumber()`` або ``PyCode_Addr2Line()`` не впливають. Функції, які безпосередньо декодують ``co_lnotab``, слід оновити для використання 8-бітного цілого типу зі знаком для дельти номера рядка, але це потрібно лише для підтримки програм, які використовують дельту від’ємного номера рядка. Дивіться ``Objects/lnotab_notes.txt``, щоб дізнатися про формат ``co_lnotab`` і як його декодувати, і перегляньте :pep:`511` для обґрунтування.

source: The functions in the :mod:`compileall` module now return booleans instead of ``1`` or ``0`` to represent success or failure, respectively. Thanks to booleans being a subclass of integers, this should only be an issue if you were doing identity checks for ``1`` or ``0``. See :issue:`25768`.
uk: Функції в модулі :mod:`compileall` тепер повертають логічні значення замість ``1`` або ``0``, щоб показати успіх або невдачу, відповідно. Завдяки тому, що булеві значення є підкласом цілих чисел, це має бути проблемою, лише якщо ви проводили перевірку ідентичності для ``1`` або ``0``. Див. :issue:`25768`.

source: Reading the :attr:`~urllib.parse.SplitResult.port` attribute of :func:`urllib.parse.urlsplit` and :func:`~urllib.parse.urlparse` results now raises :exc:`ValueError` for out-of-range values, rather than returning :const:`None`. See :issue:`20059`.
uk: Читання атрибута :attr:`~urllib.parse.SplitResult.port` результатів :func:`urllib.parse.urlsplit` і :func:`~urllib.parse.urlparse` тепер викликає :exc:`ValueError` для виходу -of-range значення замість повернення :const:`None`. Див. :issue:`20059`.

source: The :mod:`imp` module now raises a :exc:`DeprecationWarning` instead of :exc:`PendingDeprecationWarning`.
uk: Модуль :mod:`imp` тепер викликає :exc:`DeprecationWarning` замість :exc:`PendingDeprecationWarning`.

source: The following modules have had missing APIs added to their :attr:`__all__` attributes to match the documented APIs: :mod:`calendar`, :mod:`cgi`, :mod:`csv`, :mod:`~xml.etree.ElementTree`, :mod:`enum`, :mod:`fileinput`, :mod:`ftplib`, :mod:`logging`, :mod:`mailbox`, :mod:`mimetypes`, :mod:`optparse`, :mod:`plistlib`, :mod:`smtpd`, :mod:`subprocess`, :mod:`tarfile`, :mod:`threading` and :mod:`wave`. This means they will export new symbols when ``import *`` is used. (Contributed by Joel Taddei and Jacek Kołodziej in :issue:`23883`.)
uk: Наступні модулі мали відсутні API, додані до їхніх атрибутів :attr:`__all__`, щоб відповідати задокументованим API: :mod:`calendar`, :mod:`cgi`, :mod:`csv`, :mod:`~xml .etree.ElementTree`, :mod:`enum`, :mod:`fileinput`, :mod:`ftplib`, :mod:`logging`, :mod:`mailbox`, :mod:`mimetypes`, :mod:`optparse`, :mod:`plistlib`, :mod:`smtpd`, :mod:`subprocess`, :mod:`tarfile`, :mod:`threading` і :mod:`wave`. Це означає, що вони експортуватимуть нові символи, коли використовується ``import *``. (Надано Joel Taddei та Jacek Kołodziej у :issue:`23883`.)

source: When performing a relative import, if ``__package__`` does not compare equal to ``__spec__.parent`` then :exc:`ImportWarning` is raised. (Contributed by Brett Cannon in :issue:`25791`.)
uk: Під час виконання відносного імпорту, якщо ``__package__`` не порівнюється з ``__spec__.parent``, тоді виникає :exc:`ImportWarning`. (Надано Бреттом Кенноном у :issue:`25791`.)

source: When a relative import is performed and no parent package is known, then :exc:`ImportError` will be raised. Previously, :exc:`SystemError` could be raised. (Contributed by Brett Cannon in :issue:`18018`.)
uk: Коли виконується відносний імпорт і батьківський пакет не відомий, буде викликано :exc:`ImportError`. Раніше могла виникати :exc:`SystemError`. (Надав Бретт Кеннон у :issue:`18018`.)

source: Servers based on the :mod:`socketserver` module, including those defined in :mod:`http.server`, :mod:`xmlrpc.server` and :mod:`wsgiref.simple_server`, now only catch exceptions derived from :exc:`Exception`. Therefore if a request handler raises an exception like :exc:`SystemExit` or :exc:`KeyboardInterrupt`, :meth:`~socketserver.BaseServer.handle_error` is no longer called, and the exception will stop a single-threaded server. (Contributed by Martin Panter in :issue:`23430`.)
uk: Сервери на основі модуля :mod:`socketserver`, включно з тими, що визначені в :mod:`http.server`, :mod:`xmlrpc.server` і :mod:`wsgiref.simple_server`, тепер перехоплюють лише винятки, отримані від :exc:`Exception`. Тому, якщо обробник запитів викликає виняток, наприклад :exc:`SystemExit` або :exc:`KeyboardInterrupt`, :meth:`~socketserver.BaseServer.handle_error` більше не викликається, і виняток зупинить однопотоковий сервер. (Надав Мартін Пантер у :issue:`23430`.)

source: :func:`spwd.getspnam` now raises a :exc:`PermissionError` instead of :exc:`KeyError` if the user doesn't have privileges.
uk: :func:`spwd.getspnam` тепер викликає :exc:`PermissionError` замість :exc:`KeyError`, якщо користувач не має привілеїв.

source: The :meth:`socket.socket.close` method now raises an exception if an error (e.g. ``EBADF``) was reported by the underlying system call. (Contributed by Martin Panter in :issue:`26685`.)
uk: Метод :meth:`socket.socket.close` тепер викликає виняток, якщо базовий системний виклик повідомляє про помилку (наприклад, ``EBADF``). (Надав Мартін Пантер у :issue:`26685`.)
