Repository: python/python-docs-uk
Catalog: whatsnew/3.8.po
Languages: uk

source: Add keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
uk: Додайте ключові слова до списку завершення імен модуля. (Надано Террі Дж. Ріді в :issue:`37765`.)

source: inspect
uk: оглядати

source: The :func:`inspect.getdoc` function can now find docstrings for ``__slots__`` if that attribute is a :class:`dict` where the values are docstrings. This provides documentation options similar to what we already have for :func:`property`, :func:`classmethod`, and :func:`staticmethod`::
uk: Функція :func:`inspect.getdoc` тепер може знаходити рядки документів для ``__slots__``, якщо цей атрибут є :class:`dict`, де значення є рядками документів. Це надає параметри документації, подібні до тих, які ми вже маємо для :func:`property`, :func:`classmethod` і :func:`staticmethod`::

source: (Contributed by Raymond Hettinger in :issue:`36326`.)
uk: (Надав Реймонд Геттінгер у :issue:`36326`.)

source: In development mode (:option:`-X` ``env``) and in :ref:`debug build <debug-build>`, the :class:`io.IOBase` finalizer now logs the exception if the ``close()`` method fails. The exception is ignored silently by default in release build. (Contributed by Victor Stinner in :issue:`18748`.)
uk: У режимі розробки (:option:`-X` ``env``) і в :ref:`debug build <debug-build>` фіналізатор :class:`io.IOBase` тепер реєструє виняток, якщо ``close()`` метод не вдається. Виняток ігнорується за умовчанням у збірці випуску. (Надав Віктор Стіннер у :issue:`18748`.)

source: The :func:`itertools.accumulate` function added an option *initial* keyword argument to specify an initial value::
uk: Функція :func:`itertools.accumulate` додала опцію *initial* аргумент ключового слова для визначення початкового значення::

source: (Contributed by Lisa Roach in :issue:`34659`.)
uk: (Надано Лізою Роуч у :issue:`34659`.)

source: Add option ``--json-lines`` to parse every input line as a separate JSON object. (Contributed by Weipeng Hong in :issue:`31553`.)
uk: Додайте опцію ``--json-lines``, щоб аналізувати кожен рядок введення як окремий об’єкт JSON. (Надано Weipeng Hong у :issue:`31553`.)

source: logging
uk: лісозаготівля

source: Added a *force* keyword argument to :func:`logging.basicConfig()` When set to true, any existing handlers attached to the root logger are removed and closed before carrying out the configuration specified by the other arguments.
uk: Додано аргумент ключового слова *force* до :func:`logging.basicConfig()` Якщо встановлено значення true, усі існуючі обробники, приєднані до кореневого реєстратора, видаляються та закриваються перед виконанням конфігурації, визначеної іншими аргументами.

source: This solves a long-standing problem. Once a logger or *basicConfig()* had been called, subsequent calls to *basicConfig()* were silently ignored. This made it difficult to update, experiment with, or teach the various logging configuration options using the interactive prompt or a Jupyter notebook.
uk: Це вирішує давню проблему. Після виклику реєстратора або *basicConfig()* наступні виклики *basicConfig()* мовчки ігнорувалися. Через це було складно оновлювати, експериментувати з різними параметрами конфігурації журналу або навчати їх за допомогою інтерактивної підказки або блокнота Jupyter.

source: (Suggested by Raymond Hettinger, implemented by Dong-hee Na, and reviewed by Vinay Sajip in :issue:`33897`.)
uk: (Запропоновано Raymond Hettinger, реалізовано Dong-hee Na та переглянуто Vinay Sajip у :issue:`33897`.)

source: math
uk: математика

source: Added new function :func:`math.dist` for computing Euclidean distance between two points. (Contributed by Raymond Hettinger in :issue:`33089`.)
uk: Додано нову функцію :func:`math.dist` для обчислення евклідової відстані між двома точками. (Надав Реймонд Геттінгер у :issue:`33089`.)

source: Expanded the :func:`math.hypot` function to handle multiple dimensions. Formerly, it only supported the 2-D case. (Contributed by Raymond Hettinger in :issue:`33089`.)
uk: Розширено функцію :func:`math.hypot` для обробки кількох вимірів. Раніше він підтримував лише двовимірний випадок. (Надав Реймонд Геттінгер у :issue:`33089`.)

source: Added new function, :func:`math.prod`, as analogous function to :func:`sum` that returns the product of a 'start' value (default: 1) times an iterable of numbers::
uk: Додано нову функцію, :func:`math.prod`, як функцію, аналогічну функції :func:`sum`, яка повертає добуток початкового значення (за замовчуванням: 1), помноженого на ітерацію чисел::

source: (Contributed by Pablo Galindo in :issue:`35606`.)
uk: (Надав Пабло Галіндо в :issue:`35606`.)

source: Added two new combinatoric functions :func:`math.perm` and :func:`math.comb`::
uk: Додано дві нові комбінаторні функції :func:`math.perm` і :func:`math.comb`::

source: (Contributed by Yash Aggarwal, Keller Fuchs, Serhiy Storchaka, and Raymond Hettinger in :issue:`37128`, :issue:`37178`, and :issue:`35431`.)
uk: (Надано Yash Aggarwal, Keller Fuchs, Serhiy Storchaka та Raymond Hettinger у :issue:`37128`, :issue:`37178` та :issue:`35431`.)

source: Added a new function :func:`math.isqrt` for computing accurate integer square roots without conversion to floating point. The new function supports arbitrarily large integers. It is faster than ``floor(sqrt(n))`` but slower than :func:`math.sqrt`::
uk: Додано нову функцію :func:`math.isqrt` для обчислення точних цілих квадратних коренів без перетворення до числа з плаваючою комою. Нова функція підтримує довільні цілі числа. Це швидше, ніж ``floor(sqrt(n))``, але повільніше, ніж :func:`math.sqrt`::

source: (Contributed by Mark Dickinson in :issue:`36887`.)
uk: (Надав Марк Дікінсон у :issue:`36887`.)

source: The function :func:`math.factorial` no longer accepts arguments that are not int-like. (Contributed by Pablo Galindo in :issue:`33083`.)
uk: Функція :func:`math.factorial` більше не приймає аргументи, які не є int-подібними. (Надав Пабло Галіндо в :issue:`33083`.)

source: The :class:`mmap.mmap` class now has an :meth:`~mmap.mmap.madvise` method to access the ``madvise()`` system call. (Contributed by Zackery Spytz in :issue:`32941`.)
uk: Клас :class:`mmap.mmap` тепер має метод :meth:`~mmap.mmap.madvise` для доступу до системного виклику ``madvise()``. (Надав Закері Шпітц у :issue:`32941`.)

source: multiprocessing
uk: багатопроцесорність

source: Added new :mod:`multiprocessing.shared_memory` module. (Contributed by Davin Potts in :issue:`35813`.)
uk: Додано новий модуль :mod:`multiprocessing.shared_memory`. (Надав Девін Поттс у :issue:`35813`.)

source: On macOS, the *spawn* start method is now used by default. (Contributed by Victor Stinner in :issue:`33725`.)
uk: У macOS метод запуску *spawn* тепер використовується за замовчуванням. (Надав Віктор Стіннер у :issue:`33725`.)

source: os
uk: ос

source: Added new function :func:`~os.add_dll_directory` on Windows for providing additional search paths for native dependencies when importing extension modules or loading DLLs using :mod:`ctypes`. (Contributed by Steve Dower in :issue:`36085`.)
uk: Додано нову функцію :func:`~os.add_dll_directory` у Windows для надання додаткових шляхів пошуку для власних залежностей під час імпорту модулів розширення або завантаження DLL за допомогою :mod:`ctypes`. (Надав Стів Дауер у :issue:`36085`.)

source: A new :func:`os.memfd_create` function was added to wrap the ``memfd_create()`` syscall. (Contributed by Zackery Spytz and Christian Heimes in :issue:`26836`.)
uk: Було додано нову функцію :func:`os.memfd_create` для обгортання системного виклику ``memfd_create()``. (Надано Zackery Spytz і Christian Heimes у :issue:`26836`.)

source: On Windows, much of the manual logic for handling reparse points (including symlinks and directory junctions) has been delegated to the operating system. Specifically, :func:`os.stat` will now traverse anything supported by the operating system, while :func:`os.lstat` will only open reparse points that identify as "name surrogates" while others are opened as for :func:`os.stat`. In all cases, :attr:`stat_result.st_mode` will only have ``S_IFLNK`` set for symbolic links and not other kinds of reparse points. To identify other kinds of reparse point, check the new :attr:`stat_result.st_reparse_tag` attribute.
uk: У Windows велика частина ручної логіки для обробки точок повторного аналізу (включаючи символічні посилання та з’єднання каталогів) була делегована операційній системі. Зокрема, :func:`os.stat` тепер переглядатиме все, що підтримується операційною системою, тоді як :func:`os.lstat` відкриватиме лише точки повторного аналізу, які ідентифікуються як "сурогати імен", тоді як інші відкриваються як для :func:`os.stat`. У всіх випадках у :attr:`stat_result.st_mode` буде встановлено лише ``S_IFLNK`` для символічних посилань, а не для інших типів точок повторного аналізу. Щоб визначити інші типи точок повторного аналізу, перевірте новий атрибут :attr:`stat_result.st_reparse_tag`.

source: On Windows, :func:`os.readlink` is now able to read directory junctions. Note that :func:`~os.path.islink` will return ``False`` for directory junctions, and so code that checks ``islink`` first will continue to treat junctions as directories, while code that handles errors from :func:`os.readlink` may now treat junctions as links.
uk: У Windows :func:`os.readlink` тепер може читати з’єднання каталогів. Зауважте, що :func:`~os.path.islink` поверне ``False`` для з’єднань каталогів, тому код, який спочатку перевіряє ``islink``, продовжуватиме розглядати з’єднання як каталоги, тоді як код, який обробляє помилки з :func:`os.readlink` тепер може розглядати перехрестя як посилання.

source: (Contributed by Steve Dower in :issue:`37834`.)
uk: (Надав Стів Дауер у :issue:`37834`.)

source: :mod:`os.path` functions that return a boolean result like :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir`, :func:`~os.path.isfile`, :func:`~os.path.islink`, and :func:`~os.path.ismount` now return ``False`` instead of raising :exc:`ValueError` or its subclasses :exc:`UnicodeEncodeError` and :exc:`UnicodeDecodeError` for paths that contain characters or bytes unrepresentable at the OS level. (Contributed by Serhiy Storchaka in :issue:`33721`.)
uk: :mod:`os.path` функції, які повертають логічний результат, наприклад :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir` , :func:`~os.path.isfile`, :func:`~os.path.islink` і :func:`~os.path.ismount` тепер повертають ``False`` замість підвищення :exc:`ValueError` або його підкласи :exc:`UnicodeEncodeError` і :exc:`UnicodeDecodeError` для шляхів, які містять символи або байти, які неможливо відобразити на рівні ОС. (Надав Сергій Сторчака в :issue:`33721`.)

source: :func:`~os.path.expanduser` on Windows now prefers the :envvar:`USERPROFILE` environment variable and does not use :envvar:`HOME`, which is not normally set for regular user accounts. (Contributed by Anthony Sottile in :issue:`36264`.)
uk: :func:`~os.path.expanduser` у Windows тепер надає перевагу змінній середовища :envvar:`USERPROFILE` і не використовує :envvar:`HOME`, яка зазвичай не встановлюється для звичайних облікових записів користувачів. (Надав Ентоні Соттіле в :issue:`36264`.)

source: :func:`~os.path.isdir` on Windows no longer returns ``True`` for a link to a non-existent directory.
uk: :func:`~os.path.isdir` у Windows більше не повертає ``True`` для посилання на неіснуючий каталог.

source: :func:`~os.path.realpath` on Windows now resolves reparse points, including symlinks and directory junctions.
uk: :func:`~os.path.realpath` у Windows тепер розпізнає точки повторного аналізу, включаючи символічні посилання та з’єднання каталогів.

source: :mod:`pathlib.Path` methods that return a boolean result like :meth:`~pathlib.Path.exists()`, :meth:`~pathlib.Path.is_dir()`, :meth:`~pathlib.Path.is_file()`, :meth:`~pathlib.Path.is_mount()`, :meth:`~pathlib.Path.is_symlink()`, :meth:`~pathlib.Path.is_block_device()`, :meth:`~pathlib.Path.is_char_device()`, :meth:`~pathlib.Path.is_fifo()`, :meth:`~pathlib.Path.is_socket()` now return ``False`` instead of raising :exc:`ValueError` or its subclass :exc:`UnicodeEncodeError` for paths that contain characters unrepresentable at the OS level. (Contributed by Serhiy Storchaka in :issue:`33721`.)
uk: :mod:`pathlib.Path` методи, які повертають логічний результат, наприклад :meth:`~pathlib.Path.exists()`, :meth:`~pathlib.Path.is_dir()`, :meth:`~pathlib. Path.is_file()`, :meth:`~pathlib.Path.is_mount()`, :meth:`~pathlib.Path.is_symlink()`, :meth:`~pathlib.Path.is_block_device()`, :meth:`~pathlib.Path.is_char_device()`, :meth:`~pathlib.Path.is_fifo()`, :meth:`~pathlib.Path.is_socket()` тепер повертає ``False`` замість підвищення :exc:`ValueError` або його підклас :exc:`UnicodeEncodeError` для шляхів, які містять символи, які неможливо відобразити на рівні ОС. (Надав Сергій Сторчака в :issue:`33721`.)

source: Added :meth:`pathlib.Path.link_to()` which creates a hard link pointing to a path. (Contributed by Joannah Nanjekye in :issue:`26978`)
uk: Додано :meth:`pathlib.Path.link_to()`, який створює жорстке посилання, що вказує на шлях. (Надано Joannah Nanjekye у :issue:`26978`)

source: pickle
uk: маринований огірок

source: :mod:`pickle` extensions subclassing the C-optimized :class:`~pickle.Pickler` can now override the pickling logic of functions and classes by defining the special :meth:`~pickle.Pickler.reducer_override` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
uk: Розширення :mod:`pickle`, що створюють субкласи оптимізованого для C :class:`~pickle.Pickler`, тепер можуть перевизначати логіку маринування функцій і класів, визначаючи спеціальний метод :meth:`~pickle.Pickler.reducer_override`. (Надано П’єром Глейзером і Олів’є Грізелем у :issue:`35900`.)

source: Added new :class:`plistlib.UID` and enabled support for reading and writing NSKeyedArchiver-encoded binary plists. (Contributed by Jon Janzen in :issue:`26707`.)
uk: Додано новий :class:`plistlib.UID` і ввімкнено підтримку для читання та запису бінарних списків у кодуванні NSKeyedArchiver. (Надав Джон Янзен у :issue:`26707`.)

source: The :mod:`pprint` module added a *sort_dicts* parameter to several functions. By default, those functions continue to sort dictionaries before rendering or printing. However, if *sort_dicts* is set to false, the dictionaries retain the order that keys were inserted. This can be useful for comparison to JSON inputs during debugging.
uk: Модуль :mod:`pprint` додав параметр *sort_dicts* до кількох функцій. За замовчуванням ці функції продовжують сортувати словники перед рендерингом або друком. Однак якщо *sort_dicts* має значення false, словники зберігають порядок вставлення ключів. Це може бути корисним для порівняння з вхідними даними JSON під час налагодження.

source: In addition, there is a convenience new function, :func:`pprint.pp` that is like :func:`pprint.pprint` but with *sort_dicts* defaulting to ``False``::
uk: Крім того, є нова зручна функція :func:`pprint.pp`, яка схожа на :func:`pprint.pprint`, але з *sort_dicts* за замовчуванням ``False``::

source: (Contributed by Rémi Lapeyre in :issue:`30670`.)
uk: (Надав Ремі Лапейр у :issue:`30670`.)

source: :func:`py_compile.compile` now supports silent mode. (Contributed by Joannah Nanjekye in :issue:`22640`.)
uk: :func:`py_compile.compile` тепер підтримує тихий режим. (Надано Joannah Nanjekye у :issue:`22640`.)

source: shlex
uk: шлекс

source: The new :func:`shlex.join` function acts as the inverse of :func:`shlex.split`. (Contributed by Bo Bayles in :issue:`32102`.)
uk: Нова функція :func:`shlex.join` діє як зворотна функція :func:`shlex.split`. (Надав Бо Бейлс у :issue:`32102`.)

source: shutil
uk: шутил

source: :func:`shutil.copytree` now accepts a new ``dirs_exist_ok`` keyword argument. (Contributed by Josh Bronson in :issue:`20849`.)
uk: :func:`shutil.copytree` тепер приймає новий аргумент ключового слова ``dirs_exist_ok``. (Надав Джош Бронсон у :issue:`20849`.)

source: :func:`shutil.make_archive` now defaults to the modern pax (POSIX.1-2001) format for new archives to improve portability and standards conformance, inherited from the corresponding change to the :mod:`tarfile` module. (Contributed by C.A.M. Gerlach in :issue:`30661`.)
uk: :func:`shutil.make_archive` тепер за замовчуванням використовує сучасний формат pax (POSIX.1-2001) для нових архівів для покращення переносимості та відповідності стандартам, успадкованому від відповідних змін у модулі :mod:`tarfile`. (Надано C.A.M. Gerlach у :issue:`30661`.)

source: :func:`shutil.rmtree` on Windows now removes directory junctions without recursively removing their contents first. (Contributed by Steve Dower in :issue:`37834`.)
uk: :func:`shutil.rmtree` у Windows тепер видаляє з’єднання каталогів без попереднього рекурсивного видалення їх вмісту. (Надав Стів Дауер у :issue:`37834`.)

source: socket
uk: гніздо

source: Added :meth:`~socket.create_server()` and :meth:`~socket.has_dualstack_ipv6()` convenience functions to automate the necessary tasks usually involved when creating a server socket, including accepting both IPv4 and IPv6 connections on the same socket. (Contributed by Giampaolo Rodolà in :issue:`17561`.)
uk: Додано зручні функції :meth:`~sockete.create_server()` і :meth:`~socket.has_dualstack_ipv6()` для автоматизації необхідних завдань, які зазвичай виконуються під час створення серверного сокета, включаючи прийняття з’єднань IPv4 і IPv6 в одному сокеті. . (Надав Джампаоло Родола в :issue:`17561`.)

source: The :func:`socket.if_nameindex()`, :func:`socket.if_nametoindex()`, and :func:`socket.if_indextoname()` functions have been implemented on Windows. (Contributed by Zackery Spytz in :issue:`37007`.)
uk: Функції :func:`socket.if_nameindex()`, :func:`socket.if_nametoindex()` і :func:`socket.if_indextoname()` реалізовано у Windows. (Надав Закері Шпітц у :issue:`37007`.)

source: Added :attr:`~ssl.SSLContext.post_handshake_auth` to enable and :meth:`~ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :issue:`34670`.)
uk: Додано :attr:`~ssl.SSLContext.post_handshake_auth` для ввімкнення та :meth:`~ssl.SSLSocket.verify_client_post_handshake` для ініціювання автентифікації TLS 1.3 після рукостискання. (Надав Крістіан Хеймс у :issue:`34670`.)

source: statistics
uk: статистика

source: Added :func:`statistics.fmean` as a faster, floating point variant of :func:`statistics.mean()`. (Contributed by Raymond Hettinger and Steven D'Aprano in :issue:`35904`.)
uk: Додано :func:`statistics.fmean` як швидший варіант :func:`statistics.mean()` з плаваючою комою. (Надано Реймондом Геттінгером і Стівеном Д'Апрано в :issue:`35904`.)

source: Added :func:`statistics.geometric_mean()` (Contributed by Raymond Hettinger in :issue:`27181`.)
uk: Додано :func:`statistics.geometric_mean()` (надано Реймондом Хеттінгером у :issue:`27181`.)

source: Added :func:`statistics.multimode` that returns a list of the most common values. (Contributed by Raymond Hettinger in :issue:`35892`.)
uk: Додано :func:`statistics.multimode`, який повертає список найпоширеніших значень. (Надав Реймонд Геттінгер у :issue:`35892`.)

source: Added :func:`statistics.quantiles` that divides data or a distribution in to equiprobable intervals (e.g. quartiles, deciles, or percentiles). (Contributed by Raymond Hettinger in :issue:`36546`.)
uk: Додано :func:`statistics.quantiles`, який ділить дані або розподіл на рівноімовірні інтервали (наприклад, квартилі, децилі або процентилі). (Надав Реймонд Геттінгер у :issue:`36546`.)

source: Added :class:`statistics.NormalDist`, a tool for creating and manipulating normal distributions of a random variable. (Contributed by Raymond Hettinger in :issue:`36018`.)
uk: Додано :class:`statistics.NormalDist`, інструмент для створення та керування нормальним розподілом випадкової величини. (Надав Реймонд Геттінгер у :issue:`36018`.)

source: sys
uk: система

source: Add new :func:`sys.unraisablehook` function which can be overridden to control how "unraisable exceptions" are handled. It is called when an exception has occurred but there is no way for Python to handle it. For example, when a destructor raises an exception or during garbage collection (:func:`gc.collect`). (Contributed by Victor Stinner in :issue:`36829`.)
uk: Додайте нову функцію :func:`sys.unraisablehook`, яку можна перевизначати, щоб керувати обробкою "виключних ситуацій, які не можна викликати". Він викликається, коли сталася виняткова ситуація, але Python не може її впоратися. Наприклад, коли деструктор викликає виняток або під час збирання сміття (:func:`gc.collect`). (Надав Віктор Стіннер у :issue:`36829`.)

source: The :mod:`tarfile` module now defaults to the modern pax (POSIX.1-2001) format for new archives, instead of the previous GNU-specific one. This improves cross-platform portability with a consistent encoding (UTF-8) in a standardized and extensible format, and offers several other benefits. (Contributed by C.A.M. Gerlach in :issue:`36268`.)
uk: Модуль :mod:`tarfile` тепер за замовчуванням використовує сучасний формат pax (POSIX.1-2001) для нових архівів замість попереднього, специфічного для GNU. Це покращує міжплатформенну переносимість завдяки узгодженому кодуванню (UTF-8) у стандартизованому та розширюваному форматі та пропонує кілька інших переваг. (Надано C.A.M. Gerlach у :issue:`36268`.)

source: threading
uk: різьблення

source: Add a new :func:`threading.excepthook` function which handles uncaught :meth:`threading.Thread.run` exception. It can be overridden to control how uncaught :meth:`threading.Thread.run` exceptions are handled. (Contributed by Victor Stinner in :issue:`1230540`.)
uk: Додайте нову функцію :func:`threading.excepthook`, яка обробляє неперехоплені винятки :meth:`threading.Thread.run`. Його можна змінити, щоб керувати обробкою неперехоплених винятків :meth:`threading.Thread.run`. (Надав Віктор Стіннер у :issue:`1230540`.)

source: Add a new :func:`threading.get_native_id` function and a :data:`~threading.Thread.native_id` attribute to the :class:`threading.Thread` class. These return the native integral Thread ID of the current thread assigned by the kernel. This feature is only available on certain platforms, see :func:`get_native_id <threading.get_native_id>` for more information. (Contributed by Jake Tesler in :issue:`36084`.)
uk: Додайте нову функцію :func:`threading.get_native_id` і атрибут :data:`~threading.Thread.native_id` до класу :class:`threading.Thread`. Вони повертають власний інтегральний ідентифікатор потоку поточного потоку, призначений ядром. Ця функція доступна лише на певних платформах, див. :func:`get_native_id <threading.get_native_id>` для отримання додаткової інформації. (Надав Джейк Теслер у :issue:`36084`.)

source: tokenize
uk: токенізувати

source: The :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
uk: Модуль :mod:`tokenize` тепер неявно випромінює маркер ``NEWLINE``, якщо надається вхідні дані, які не мають кінцевого нового рядка. Ця поведінка тепер відповідає внутрішнім функціям C tokenizer. (Надав Аммар Аскар у :issue:`33899`.)

source: Added methods :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` and :meth:`~tkinter.Spinbox.selection_to` in the :class:`tkinter.Spinbox` class. (Contributed by Juliette Monsel in :issue:`34829`.)
uk: Додано методи :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` та :meth:`~tkinter.Spinbox.selection_to` у клас :class:`tkinter.Spinbox`. (Надано Juliette Monsel у :issue:`34829`.)
