Repository: python/python-docs-uk
Catalog: whatsnew/3.8.po
Languages: uk

source: What's New In Python 3.8
uk: Що нового в Python 3.8

source: Editor
uk: Редактор

source: This article explains the new features in Python 3.8, compared to 3.7. Python 3.8 was released on October 14, 2019. For full details, see the :ref:`changelog <changelog>`.
uk: У цій статті пояснюється нові функції в Python 3.8 порівняно з 3.7. Python 3.8 було випущено 14 жовтня 2019 року. Щоб отримати повну інформацію, перегляньте :ref:`журнал змін <changelog>`.

source: Summary -- Release highlights
uk: Підсумок – основні моменти випуску

source: New Features
uk: Нові можливості

source: Assignment expressions
uk: Вирази присвоєння

source: There is new syntax ``:=`` that assigns values to variables as part of a larger expression. It is affectionately known as "the walrus operator" due to its resemblance to `the eyes and tusks of a walrus <https://en.wikipedia.org/wiki/Walrus#/media/File:Pacific_Walrus_-_Bull_(8247646168).jpg>`_.
uk: Існує новий синтаксис ``:=``, який призначає значення змінним як частину більшого виразу. Його ласкаво називають "оператором моржа" через його схожість з `очима та бивнями моржа <https://en.wikipedia.org/wiki/Walrus#/media/File:Pacific_Walrus_-_Bull_(8247646168).jpg>`.

source: In this example, the assignment expression helps avoid calling :func:`len` twice::
uk: У цьому прикладі вираз присвоєння допомагає уникнути виклику :func:`len` двічі::

source: A similar benefit arises during regular expression matching where match objects are needed twice, once to test whether a match occurred and another to extract a subgroup::
uk: Подібна перевага виникає під час зіставлення регулярних виразів, коли об’єкти збігу потрібні двічі: один раз, щоб перевірити, чи відбувся збіг, а другий – щоб отримати підгрупу::

source: The operator is also useful with while-loops that compute a value to test loop termination and then need that same value again in the body of the loop::
uk: Оператор також корисний у циклах while, які обчислюють значення для перевірки завершення циклу, а потім знову потребують того самого значення в тілі циклу::

source: Another motivating use case arises in list comprehensions where a value computed in a filtering condition is also needed in the expression body::
uk: Інший спонукальний випадок використання виникає під час розуміння списку, де значення, обчислене в умові фільтрації, також потрібне в тілі виразу::

source: Try to limit use of the walrus operator to clean cases that reduce complexity and improve readability.
uk: Спробуйте обмежити використання оператора Walrus для очищення випадків, що зменшує складність і покращує читабельність.

source: See :pep:`572` for a full description.
uk: Дивіться :pep:`572` для повного опису.

source: (Contributed by Emily Morehouse in :issue:`35224`.)
uk: (Надано Емілі Морхаус у :issue:`35224`.)

source: Positional-only parameters
uk: Лише позиційні параметри

source: There is a new function parameter syntax ``/`` to indicate that some function parameters must be specified positionally and cannot be used as keyword arguments. This is the same notation shown by ``help()`` for C functions annotated with Larry Hastings' `Argument Clinic <https://docs.python.org/3/howto/clinic.html>`_ tool.
uk: Існує новий синтаксис параметрів функції ``/``, щоб вказати, що деякі параметри функції мають бути визначені позиційно та не можуть використовуватися як аргументи ключового слова. Це та сама нотація, яку показує ``help()`` для функцій C, анотованих інструментом `Argument Clinic <https://docs.python.org/3/howto/clinic.html>`_ Larry Hastings.

source: In the following example, parameters *a* and *b* are positional-only, while *c* or *d* can be positional or keyword, and *e* or *f* are required to be keywords::
uk: У наступному прикладі параметри *a* і *b* є лише позиційними, тоді як *c* або *d* можуть бути позиційними або ключовими словами, а *e* або *f* мають бути ключовими словами::

source: The following is a valid call::
uk: Нижче наведено дійсний виклик:

source: However, these are invalid calls::
uk: Однак це недійсні виклики::

source: One use case for this notation is that it allows pure Python functions to fully emulate behaviors of existing C coded functions. For example, the built-in :func:`divmod` function does not accept keyword arguments::
uk: Одним із випадків використання цієї нотації є те, що вона дозволяє чистим функціям Python повністю емулювати поведінку існуючих функцій, закодованих на C. Наприклад, вбудована функція :func:`divmod` не приймає ключові аргументи::

source: Another use case is to preclude keyword arguments when the parameter name is not helpful. For example, the builtin :func:`len` function has the signature ``len(obj, /)``. This precludes awkward calls such as::
uk: Іншим випадком використання є виключення аргументів ключового слова, коли назва параметра не є корисною. Наприклад, вбудована функція :func:`len` має підпис ``len(obj, /)``. Це виключає незручні виклики, такі як::

source: A further benefit of marking a parameter as positional-only is that it allows the parameter name to be changed in the future without risk of breaking client code. For example, in the :mod:`statistics` module, the parameter name *dist* may be changed in the future. This was made possible with the following function specification::
uk: Додаткова перевага позначення параметра як лише позиційного полягає в тому, що це дозволяє змінювати ім’я параметра в майбутньому без ризику зламати код клієнта. Наприклад, у модулі :mod:`statistic` назва параметра *dist* може бути змінена в майбутньому. Це стало можливим завдяки наступній специфікації функції:

source: Since the parameters to the left of ``/`` are not exposed as possible keywords, the parameters names remain available for use in ``**kwargs``::
uk: Оскільки параметри ліворуч від ``/`` не представлені як можливі ключові слова, назви параметрів залишаються доступними для використання в ``**kwargs``::

source: This greatly simplifies the implementation of functions and methods that need to accept arbitrary keyword arguments. For example, here is an excerpt from code in the :mod:`collections` module::
uk: Це значно спрощує реалізацію функцій і методів, які повинні приймати довільні аргументи ключового слова. Наприклад, ось фрагмент коду в модулі :mod:`collections`::

source: See :pep:`570` for a full description.
uk: Дивіться :pep:`570` для повного опису.

source: (Contributed by Pablo Galindo in :issue:`36540`.)
uk: (Надав Pablo Galindo в :issue:`36540`.)

source: Parallel filesystem cache for compiled bytecode files
uk: Паралельний кеш файлової системи для скомпільованих файлів байт-коду

source: The new :envvar:`PYTHONPYCACHEPREFIX` setting (also available as :option:`-X` ``pycache_prefix``) configures the implicit bytecode cache to use a separate parallel filesystem tree, rather than the default ``__pycache__`` subdirectories within each source directory.
uk: Нове налаштування :envvar:`PYTHONPYCACHEPREFIX` (також доступне як :option:`-X` ``pycache_prefix``) налаштовує неявний кеш байт-коду на використання окремого паралельного дерева файлової системи, а не стандартних підкаталогів ``__pycache__`` всередині кожен вихідний каталог.

source: The location of the cache is reported in :data:`sys.pycache_prefix` (:const:`None` indicates the default location in ``__pycache__`` subdirectories).
uk: Розташування кешу повідомляється в :data:`sys.pycache_prefix` (:const:`None` вказує на розташування за умовчанням у підкаталогах ``__pycache__``).

source: (Contributed by Carl Meyer in :issue:`33499`.)
uk: (Надано Карлом Майєром у :issue:`33499`.)

source: Debug build uses the same ABI as release build
uk: Збірка налагодження використовує той самий ABI, що й збірка випуску

source: Python now uses the same ABI whether it's built in release or debug mode. On Unix, when Python is built in debug mode, it is now possible to load C extensions built in release mode and C extensions built using the stable ABI.
uk: Тепер Python використовує той самий ABI, незалежно від того, чи створено його в режимі випуску чи налагодження. У Unix, коли Python створено в режимі налагодження, тепер можна завантажувати розширення C, створені в режимі випуску, і розширення C, створені за допомогою стабільного ABI.

source: Release builds and :ref:`debug builds <debug-build>` are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro, which introduces the only ABI incompatibility. The ``Py_TRACE_REFS`` macro, which adds the :func:`sys.getobjects` function and the :envvar:`PYTHONDUMPREFS` environment variable, can be set using the new :option:`./configure --with-trace-refs <--with-trace-refs>` build option. (Contributed by Victor Stinner in :issue:`36465`.)
uk: Випускні збірки та :ref:`налагоджувальні збірки <debug-build>` тепер сумісні з ABI: визначення макросу ``Py_DEBUG`` більше не означає макрос ``Py_TRACE_REFS``, який створює єдину несумісність ABI. Макрос ``Py_TRACE_REFS``, який додає функцію :func:`sys.getobjects` і змінну середовища :envvar:`PYTHONDUMPREFS`, можна встановити за допомогою нового :option:`./configure --with-trace- refs <--with-trace-refs>` параметр збірки. (Надав Віктор Стіннер у :issue:`36465`.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. It is now possible for a statically linked Python to load a C extension built using a shared library Python. (Contributed by Victor Stinner in :issue:`21536`.)
uk: В Unix розширення C більше не пов’язані з libpython, за винятком Android і Cygwin. Статично зв’язаний Python тепер може завантажувати розширення C, створене за допомогою спільної бібліотеки Python. (Надав Віктор Стіннер у :issue:`21536`.)

source: On Unix, when Python is built in debug mode, import now also looks for C extensions compiled in release mode and for C extensions compiled with the stable ABI. (Contributed by Victor Stinner in :issue:`36722`.)
uk: У Unix, коли Python створено в режимі налагодження, імпорт тепер також шукає розширення C, скомпільовані в режимі випуску, і розширення C, скомпільовані зі стабільним ABI. (Надав Віктор Стіннер у :issue:`36722`.)

source: To embed Python into an application, a new ``--embed`` option must be passed to ``python3-config --libs --embed`` to get ``-lpython3.8`` (link the application to libpython). To support both 3.8 and older, try ``python3-config --libs --embed`` first and fallback to ``python3-config --libs`` (without ``--embed``) if the previous command fails.
uk: Щоб вставити Python у програму, нову опцію ``--embed`` потрібно передати в ``python3-config --libs --embed``, щоб отримати ``-lpython3.8`` (пов’язати програму з libpython ). Щоб підтримувати як 3.8, так і старіші, спробуйте спочатку ``python3-config --libs --embed`` і поверніться до ``python3-config --libs`` (без ``--embed``), якщо попередня команда не вдається .

source: Add a pkg-config ``python-3.8-embed`` module to embed Python into an application: ``pkg-config python-3.8-embed --libs`` includes ``-lpython3.8``. To support both 3.8 and older, try ``pkg-config python-X.Y-embed --libs`` first and fallback to ``pkg-config python-X.Y --libs`` (without ``--embed``) if the previous command fails (replace ``X.Y`` with the Python version).
uk: Додайте модуль pkg-config ``python-3.8-embed``, щоб вставити Python у програму: ``pkg-config python-3.8-embed --libs`` включає ``-lpython3.8``. Щоб підтримувати версії 3.8 і старіші, спочатку спробуйте ``pkg-config python-X.Y-embed --libs`` і поверніться до ``pkg-config python-X.Y --libs`` (без ``--embed``). якщо попередня команда не виконується (замініть ``X.Y`` версією Python).

source: On the other hand, ``pkg-config python3.8 --libs`` no longer contains ``-lpython3.8``. C extensions must not be linked to libpython (except on Android and Cygwin, whose cases are handled by the script); this change is backward incompatible on purpose. (Contributed by Victor Stinner in :issue:`36721`.)
uk: З іншого боку, ``pkg-config python3.8 --libs`` більше не містить ``-lpython3.8``. Розширення C не повинні бути пов’язані з libpython (за винятком Android і Cygwin, випадки яких обробляються скриптом); ця зміна навмисно зворотно несумісна. (Надав Віктор Стіннер у :issue:`36721`.)

source: f-strings support ``=`` for self-documenting expressions and debugging
uk: f-рядки підтримують ``=`` для самодокументованих виразів і налагодження

source: Added an ``=`` specifier to :term:`f-string`\s. An f-string such as ``f'{expr=}'`` will expand to the text of the expression, an equal sign, then the representation of the evaluated expression. For example:
uk: Додано специфікатор ``=`` до :term:`f-string`\s. Рядок f, такий як ``f'{expr=}''`` розгорнеться до тексту виразу, знака рівності, а потім представлення обчисленого виразу. Наприклад:

source: The usual :ref:`f-string format specifiers <f-strings>` allow more control over how the result of the expression is displayed::
uk: Звичайні специфікатори формату :ref:`f-string <f-strings>` дозволяють краще контролювати відображення результату виразу:

source: The ``=`` specifier will display the whole expression so that calculations can be shown::
uk: Специфікатор ``=`` відобразить весь вираз, щоб можна було показати обчислення::

source: (Contributed by Eric V. Smith and Larry Hastings in :issue:`36817`.)
uk: (Надано Еріком В. Смітом і Ларрі Гастінгсом у :issue:`36817`.)

source: PEP 578: Python Runtime Audit Hooks
uk: PEP 578: Перехоплювачі аудиту виконання Python

source: The PEP adds an Audit Hook and Verified Open Hook. Both are available from Python and native code, allowing applications and frameworks written in pure Python code to take advantage of extra notifications, while also allowing embedders or system administrators to deploy builds of Python where auditing is always enabled.
uk: PEP додає Audit Hook і Verified Open Hook. Обидва доступні з Python і рідного коду, що дозволяє програмам і фреймворкам, написаним на чистому коді Python, використовувати додаткові сповіщення, а також дозволяючи розробникам і системним адміністраторам розгортати збірки Python, де аудит завжди ввімкнено.

source: See :pep:`578` for full details.
uk: Дивіться :pep:`578` для повної інформації.

source: PEP 587: Python Initialization Configuration
uk: PEP 587: Конфігурація ініціалізації Python

source: The :pep:`587` adds a new C API to configure the Python Initialization providing finer control on the whole configuration and better error reporting.
uk: :pep:`587` додає новий C API для налаштування ініціалізації Python, забезпечуючи точніший контроль над усією конфігурацією та кращі звіти про помилки.

source: New structures:
uk: Нові структури:

source: New functions:
uk: Нові функції:

source: This PEP also adds ``_PyRuntimeState.preconfig`` (:c:type:`PyPreConfig` type) and ``PyInterpreterState.config`` (:c:type:`PyConfig` type) fields to these internal structures. ``PyInterpreterState.config`` becomes the new reference configuration, replacing global configuration variables and other private variables.
uk: Цей PEP також додає до цих внутрішніх структур поля ``_PyRuntimeState.preconfig`` (:c:type:`PyPreConfig` тип) і ``PyInterpreterState.config`` (:c:type:`PyConfig` тип). ``PyInterpreterState.config`` стає новою еталонною конфігурацією, замінюючи глобальні змінні конфігурації та інші приватні змінні.

source: See :ref:`Python Initialization Configuration <init-config>` for the documentation.
uk: Перегляньте :ref:`Налаштування ініціалізації Python <init-config>` для документації.

source: See :pep:`587` for a full description.
uk: Дивіться :pep:`587` для повного опису.

source: (Contributed by Victor Stinner in :issue:`36763`.)
uk: (Надав Віктор Стіннер у :issue:`36763`.)

source: PEP 590: Vectorcall: a fast calling protocol for CPython
uk: PEP 590: Vectorcall: швидкий протокол виклику для CPython

source: :ref:`vectorcall` is added to the Python/C API. It is meant to formalize existing optimizations which were already done for various classes. Any :ref:`static type <static-types>` implementing a callable can use this protocol.
uk: :ref:`vectorcall` додано до API Python/C. Він призначений для формалізації існуючих оптимізацій, які вже були зроблені для різних класів. Будь-який :ref:`static type <static-types>`, що реалізує виклик, може використовувати цей протокол.

source: This is currently provisional. The aim is to make it fully public in Python 3.9.
uk: Наразі це тимчасово. Мета полягає в тому, щоб зробити його повністю публічним у Python 3.9.

source: See :pep:`590` for a full description.
uk: Дивіться :pep:`590` для повного опису.

source: (Contributed by Jeroen Demeyer, Mark Shannon and Petr Viktorin in :issue:`36974`.)
uk: (Надано Йероном Демейєром, Марком Шенноном і Петром Вікторіном у :issue:`36974`.)

source: Pickle protocol 5 with out-of-band data buffers
uk: Протокол Pickle 5 із позасмуговими буферами даних

source: When :mod:`pickle` is used to transfer large data between Python processes in order to take advantage of multi-core or multi-machine processing, it is important to optimize the transfer by reducing memory copies, and possibly by applying custom techniques such as data-dependent compression.
uk: Коли :mod:`pickle` використовується для передачі великих даних між процесами Python, щоб скористатися перевагами багатоядерної або багатомашинної обробки, важливо оптимізувати передачу, зменшивши копії в пам’яті та, можливо, застосувавши спеціальні методи, наприклад як залежне від даних стиснення.

source: The :mod:`pickle` protocol 5 introduces support for out-of-band buffers where :pep:`3118`-compatible data can be transmitted separately from the main pickle stream, at the discretion of the communication layer.
uk: Протокол :mod:`pickle` 5 вводить підтримку позасмугових буферів, де :pep:`3118`-сумісні дані можуть передаватись окремо від основного потоку pickle, на розсуд рівня зв’язку.

source: See :pep:`574` for a full description.
uk: Дивіться :pep:`574` для повного опису.

source: (Contributed by Antoine Pitrou in :issue:`36785`.)
uk: (Надав Антуан Пітру в :issue:`36785`.)

source: Other Language Changes
uk: Інші зміни мови

source: A :keyword:`continue` statement was illegal in the :keyword:`finally` clause due to a problem with the implementation. In Python 3.8 this restriction was lifted. (Contributed by Serhiy Storchaka in :issue:`32489`.)
uk: Оператор :keyword:`continue` був незаконним у пункті :keyword:`finally` через проблему з реалізацією. У Python 3.8 це обмеження було знято. (Надав Сергій Сторчака в :issue:`32489`.)

source: The :class:`bool`, :class:`int`, and :class:`fractions.Fraction` types now have an :meth:`~int.as_integer_ratio` method like that found in :class:`float` and :class:`decimal.Decimal`. This minor API extension makes it possible to write ``numerator, denominator = x.as_integer_ratio()`` and have it work across multiple numeric types. (Contributed by Lisa Roach in :issue:`33073` and Raymond Hettinger in :issue:`37819`.)
uk: Типи :class:`bool`, :class:`int` і :class:`fractions.Fraction` тепер мають метод :meth:`~int.as_integer_ratio`, подібний до того, що є в :class:`float` і :class:`decimal.Decimal`. Це другорядне розширення API дає змогу написати ``чисельник, знаменник = x.as_integer_ratio()`` і налаштувати його роботу з кількома числовими типами. (Надано Лізою Роуч у :issue:`33073` та Реймондом Геттінгером у :issue:`37819`.)

source: Constructors of :class:`int`, :class:`float` and :class:`complex` will now use the :meth:`~object.__index__` special method, if available and the corresponding method :meth:`~object.__int__`, :meth:`~object.__float__` or :meth:`~object.__complex__` is not available. (Contributed by Serhiy Storchaka in :issue:`20092`.)
uk: Конструктори :class:`int`, :class:`float` і :class:`complex` тепер використовуватимуть спеціальний метод :meth:`~object.__index__`, якщо він доступний, і відповідний метод :meth:`~object .__int__`, :meth:`~object.__float__` або :meth:`~object.__complex__` недоступні. (Надав Сергій Сторчака у :issue:`20092`.)

source: Added support of ``\N{name}`` escapes in :mod:`regular expressions <re>`::
uk: Додано підтримку ``\N{name}`` екранування в :mod:`регулярних виразах <re>`::

source: (Contributed by Jonathan Eunice and Serhiy Storchaka in :issue:`30688`.)
uk: (Надано Джонатаном Юнісом і Сергієм Сторчакою в :issue:`30688`.)

source: Dict and dictviews are now iterable in reversed insertion order using :func:`reversed`. (Contributed by Rémi Lapeyre in :issue:`33462`.)
uk: Dict і dictviews тепер можна повторювати у зворотному порядку вставки за допомогою :func:`reversed`. (Надав Ремі Лапейр у :issue:`33462`.)

source: The syntax allowed for keyword names in function calls was further restricted. In particular, ``f((keyword)=arg)`` is no longer allowed. It was never intended to permit more than a bare name on the left-hand side of a keyword argument assignment term. (Contributed by Benjamin Peterson in :issue:`34641`.)
uk: Синтаксис, дозволений для імен ключових слів у викликах функцій, був додатково обмежений. Зокрема, ``f((keyword)=arg)`` більше не дозволяється. Він ніколи не мав на меті дозволити більше, ніж голе ім’я в лівій частині терміна призначення аргументу ключового слова. (Надав Бенджамін Петерсон у :issue:`34641`.)

source: Generalized iterable unpacking in :keyword:`yield` and :keyword:`return` statements no longer requires enclosing parentheses. This brings the *yield* and *return* syntax into better agreement with normal assignment syntax::
uk: Узагальнене ітераційне розпакування в операторах :keyword:`yield` і :keyword:`return` більше не потребує включення дужок. Завдяки цьому синтаксис *yield* і *return* краще узгоджується зі звичайним синтаксисом призначення:

source: (Contributed by David Cuthbert and Jordan Chapman in :issue:`32117`.)
uk: (Надано Девідом Катбертом і Джорданом Чепменом у :issue:`32117`.)

source: When a comma is missed in code such as ``[(10, 20) (30, 40)]``, the compiler displays a :exc:`SyntaxWarning` with a helpful suggestion. This improves on just having a :exc:`TypeError` indicating that the first tuple was not callable. (Contributed by Serhiy Storchaka in :issue:`15248`.)
uk: Якщо в коді пропущена кома, як-от ``[(10, 20) (30, 40)]``, компілятор відображає :exc:`SyntaxWarning` з корисною пропозицією. Це покращує наявність лише :exc:`TypeError`, яка вказує, що перший кортеж не можна викликати. (Надав Сергій Сторчака в :issue:`15248`.)

source: Arithmetic operations between subclasses of :class:`datetime.date` or :class:`datetime.datetime` and :class:`datetime.timedelta` objects now return an instance of the subclass, rather than the base class. This also affects the return type of operations whose implementation (directly or indirectly) uses :class:`datetime.timedelta` arithmetic, such as :meth:`~datetime.datetime.astimezone`. (Contributed by Paul Ganssle in :issue:`32417`.)
uk: Арифметичні операції між підкласами об’єктів :class:`datetime.date` або :class:`datetime.datetime` і :class:`datetime.timedelta` тепер повертають екземпляр підкласу, а не базового класу. Це також впливає на тип повернення операцій, реалізація яких (прямо чи опосередковано) використовує арифметику :class:`datetime.timedelta`, наприклад :meth:`~datetime.datetime.astimezone`. (Надав Пол Ганссле в :issue:`32417`.)
