Repository: python/python-docs-uk
Catalog: whatsnew/3.8.po
Languages: uk

source: :class:`subprocess.Popen` can now use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, the :class:`Popen` constructor using :func:`os.posix_spawn` no longer raises an exception on errors like "missing program". Instead the child process fails with a non-zero :attr:`~Popen.returncode`. (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
uk: :class:`subprocess.Popen` тепер може використовувати :func:`os.posix_spawn` у деяких випадках для кращої продуктивності. У підсистемі Windows для Linux і емуляції користувача QEMU конструктор :class:`Popen`, що використовує :func:`os.posix_spawn`, більше не створює виняток для таких помилок, як "відсутня програма". Натомість дочірній процес завершується помилкою з ненульовим :attr:`~Popen.returncode`. (Надано Джоанною Нанджекі та Віктором Стіннером у :issue:`35537`.)

source: The *preexec_fn* argument of * :class:`subprocess.Popen` is no longer compatible with subinterpreters. The use of the parameter in a subinterpreter now raises :exc:`RuntimeError`. (Contributed by Eric Snow in :issue:`34651`, modified by Christian Heimes in :issue:`37951`.)
uk: Аргумент *preexec_fn* * :class:`subprocess.Popen` більше не сумісний із субінтерпретаторами. Використання параметра у субінтерпретаторі тепер викликає :exc:`RuntimeError`. (Надано Еріком Сноу у :issue:`34651`, змінено Крістіаном Хаймсом у :issue:`37951`.)

source: The :meth:`imap.IMAP4.logout` method no longer silently ignores arbitrary exceptions. (Contributed by Victor Stinner in :issue:`36348`.)
uk: Метод :meth:`imap.IMAP4.logout` більше не ігнорує довільні винятки. (Надав Віктор Стіннер у :issue:`36348`.)

source: The :func:`statistics.mode` function no longer raises an exception when given multimodal data. Instead, it returns the first mode encountered in the input data. (Contributed by Raymond Hettinger in :issue:`35892`.)
uk: Функція :func:`statistics.mode` більше не створює виняток, коли їй надаються мультимодальні дані. Натомість він повертає перший режим, який зустрічається у вхідних даних. (Надав Реймонд Геттінгер у :issue:`35892`.)

source: The :meth:`~tkinter.ttk.Treeview.selection` method of the :class:`tkinter.ttk.Treeview` class no longer takes arguments. Using it with arguments for changing the selection was deprecated in Python 3.6. Use specialized methods like :meth:`~tkinter.ttk.Treeview.selection_set` for changing the selection. (Contributed by Serhiy Storchaka in :issue:`31508`.)
uk: Метод :meth:`~tkinter.ttk.Treeview.selection` класу :class:`tkinter.ttk.Treeview` більше не приймає аргументи. Його використання з аргументами для зміни вибору було застарілим у Python 3.6. Використовуйте спеціалізовані методи, такі як :meth:`~tkinter.ttk.Treeview.selection_set` для зміни вибору. (Надав Сергій Сторчака в :issue:`31508`.)

source: The :meth:`writexml`, :meth:`toxml` and :meth:`toprettyxml` methods of :mod:`xml.dom.minidom`, and the :meth:`write` method of :mod:`xml.etree`, now preserve the attribute order specified by the user. (Contributed by Diego Rojas and Raymond Hettinger in :issue:`34160`.)
uk: Методи :meth:`writexml`, :meth:`toxml` і :meth:`toprettyxml` :mod:`xml.dom.minidom` і метод :meth:`write` :mod:`xml. etree`, тепер збереже порядок атрибутів, указаний користувачем. (Надано Дієго Рохасом і Раймондом Геттінгером у :issue:`34160`.)

source: A :mod:`dbm.dumb` database opened with flags ``'r'`` is now read-only. :func:`dbm.dumb.open` with flags ``'r'`` and ``'w'`` no longer creates a database if it does not exist. (Contributed by Serhiy Storchaka in :issue:`32749`.)
uk: База даних :mod:`dbm.dumb`, відкрита з прапорцями ``'r'`` тепер доступна лише для читання. :func:`dbm.dumb.open` з прапорцями ``'r'`` і ``'w'`` більше не створює базу даних, якщо вона не існує. (Надав Сергій Сторчака в :issue:`32749`.)

source: The ``doctype()`` method defined in a subclass of :class:`~xml.etree.ElementTree.XMLParser` will no longer be called and will emit a :exc:`RuntimeWarning` instead of a :exc:`DeprecationWarning`. Define the :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` method on a target for handling an XML doctype declaration. (Contributed by Serhiy Storchaka in :issue:`29209`.)
uk: Метод ``doctype()``, визначений у підкласі :class:`~xml.etree.ElementTree.XMLParser` більше не буде викликатися та видасть :exc:`RuntimeWarning` замість :exc:`DeprecationWarning`. Визначте метод :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` на цільовому об’єкті для обробки XML-декларації doctype. (Надав Сергій Сторчака в :issue:`29209`.)

source: A :exc:`RuntimeError` is now raised when the custom metaclass doesn't provide the ``__classcell__`` entry in the namespace passed to ``type.__new__``. A :exc:`DeprecationWarning` was emitted in Python 3.6--3.7. (Contributed by Serhiy Storchaka in :issue:`23722`.)
uk: Помилка :exc:`RuntimeError` тепер виникає, коли спеціальний метаклас не надає запис ``__classcell__`` у просторі імен, переданому в ``type.__new__``. :exc:`DeprecationWarning` було видано в Python 3.6--3.7. (Надав Сергій Сторчака в :issue:`23722`.)

source: The :class:`cProfile.Profile` class can now be used as a context manager. (Contributed by Scott Sanderson in :issue:`29235`.)
uk: Клас :class:`cProfile.Profile` тепер можна використовувати як контекстний менеджер. (Надав Скотт Сандерсон у :issue:`29235`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls (see :ref:`shutil-platform-dependent-efficient-copy-operations` section).
uk: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` і :func:`shutil.move` використовують спеціальну для платформи "швидку -copy" системні виклики (див. розділ :ref:`shutil-platform-dependent-efficient-copy-operations`).

source: :func:`shutil.copyfile` default buffer size on Windows was changed from 16 KiB to 1 MiB.
uk: :func:`shutil.copyfile` розмір буфера за замовчуванням у Windows змінено з 16 KiB на 1 MiB.

source: The ``PyGC_Head`` struct has changed completely. All code that touched the struct member should be rewritten. (See :issue:`33597`.)
uk: Структура ``PyGC_Head`` повністю змінилася. Весь код, який торкався члена структури, слід переписати. (Див. :issue:`33597`.)

source: The :c:type:`PyInterpreterState` struct has been moved into the "internal" header files (specifically Include/internal/pycore_pystate.h). An opaque ``PyInterpreterState`` is still available as part of the public API (and stable ABI). The docs indicate that none of the struct's fields are public, so we hope no one has been using them. However, if you do rely on one or more of those private fields and have no alternative then please open a BPO issue. We'll work on helping you adjust (possibly including adding accessor functions to the public API). (See :issue:`35886`.)
uk: Структуру :c:type:`PyInterpreterState` було переміщено у "внутрішні" файли заголовків (зокрема, Include/internal/pycore_pystate.h). Непрозорий ``PyInterpreterState`` все ще доступний як частина публічного API (і стабільного ABI). У документах зазначено, що жодне з полів структури не є відкритим, тому ми сподіваємось, що ніхто ними не користувався. Однак, якщо ви покладаєтеся на одне або кілька з цих приватних полів і не маєте альтернативи, будь ласка, відкрийте проблему BPO. Ми допоможемо вам налаштувати (можливо, включаючи додавання функцій доступу до публічного API). (Див. :issue:`35886`.)

source: The :meth:`mmap.flush() <mmap.mmap.flush>` method now returns ``None`` on success and raises an exception on error under all platforms. Previously, its behavior was platform-dependent: a nonzero value was returned on success; zero was returned on error under Windows. A zero value was returned on success; an exception was raised on error under Unix. (Contributed by Berker Peksag in :issue:`2122`.)
uk: Метод :meth:`mmap.flush() <mmap.mmap.flush>` тепер повертає ``None`` у разі успіху та викликає виняток у разі помилки на всіх платформах. Раніше його поведінка залежала від платформи: ненульове значення поверталося в разі успіху; нуль було повернуто через помилку під Windows. У разі успіху було повернуто нульове значення; виняток було викликано помилкою під Unix. (Надано Berker Peksag у :issue:`2122`.)

source: :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
uk: Модулі :mod:`xml.dom.minidom` і :mod:`xml.sax` більше не обробляють зовнішні сутності за замовчуванням. (Надав Крістіан Хеймс у :issue:`17239`.)

source: Deleting a key from a read-only :mod:`dbm` database (:mod:`dbm.dumb`, :mod:`dbm.gnu` or :mod:`dbm.ndbm`) raises :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` or :exc:`dbm.ndbm.error`) instead of :exc:`KeyError`. (Contributed by Xiang Zhang in :issue:`33106`.)
uk: Видалення ключа з доступної лише для читання бази даних :mod:`dbm` (:mod:`dbm.dumb`, :mod:`dbm.gnu` або :mod:`dbm.ndbm`) викликає :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` або :exc:`dbm.ndbm.error`) замість :exc:`KeyError`. (Надав Xiang Zhang у :issue:`33106`.)

source: Simplified AST for literals. All constants will be represented as :class:`ast.Constant` instances. Instantiating old classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` will return an instance of ``Constant``. (Contributed by Serhiy Storchaka in :issue:`32892`.)
uk: Спрощений AST для літералів. Усі константи будуть представлені як екземпляри :class:`ast.Constant`. Створення екземплярів старих класів ``Num``, ``Str``, ``Bytes``, ``NameConstant`` і ``Ellipsis`` поверне екземпляр ``Constant``. (Надав Сергій Сторчака в :issue:`32892`.)

source: The function :func:`asyncio.wait_for` now correctly waits for cancellation when using an instance of :class:`asyncio.Task`. Previously, upon reaching *timeout*, it was cancelled and immediately returned. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
uk: Функція :func:`asyncio.wait_for` тепер правильно очікує на скасування під час використання екземпляра :class:`asyncio.Task`. Раніше, після досягнення *тайм-ауту*, він скасовувався та негайно повертався. (Надав Елвіс Пранскявічус у :issue:`32751`.)

source: The function :func:`asyncio.BaseTransport.get_extra_info` now returns a safe to use socket object when 'socket' is passed to the *name* parameter. (Contributed by Yury Selivanov in :issue:`37027`.)
uk: Функція :func:`asyncio.BaseTransport.get_extra_info` тепер повертає безпечний для використання об’єкт socket, коли 'socket' передається в параметр *name*. (Надав Юрій Селіванов у :issue:`37027`.)

source: :class:`asyncio.BufferedProtocol` has graduated to the stable API.
uk: :class:`asyncio.BufferedProtocol` перейшов на стабільний API.

source: DLL dependencies for extension modules and DLLs loaded with :mod:`ctypes` on Windows are now resolved more securely. Only the system paths, the directory containing the DLL or PYD file, and directories added with :func:`~os.add_dll_directory` are searched for load-time dependencies. Specifically, :envvar:`PATH` and the current working directory are no longer used, and modifications to these will no longer have any effect on normal DLL resolution. If your application relies on these mechanisms, you should check for :func:`~os.add_dll_directory` and if it exists, use it to add your DLLs directory while loading your library. Note that Windows 7 users will need to ensure that Windows Update KB2533623 has been installed (this is also verified by the installer). (Contributed by Steve Dower in :issue:`36085`.)
uk: Залежності DLL для модулів розширення та DLL, завантажених за допомогою :mod:`ctypes` у Windows, тепер вирішуються більш безпечно. На наявність залежностей під час завантаження шукаються лише системні шляхи, каталог, що містить файл DLL або PYD, і каталоги, додані за допомогою :func:`~os.add_dll_directory`. Зокрема, :envvar:`PATH` і поточний робочий каталог більше не використовуються, і їх зміни більше не впливатимуть на нормальну роздільну здатність DLL. Якщо ваша програма покладається на ці механізми, вам слід перевірити :func:`~os.add_dll_directory` і, якщо вона існує, використати її для додавання каталогу DLLs під час завантаження бібліотеки. Зауважте, що користувачам Windows 7 потрібно буде переконатися, що Windows Update KB2533623 інстальовано (це також перевіряє інсталятор). (Надав Стів Дауер у :issue:`36085`.)

source: The header files and functions related to pgen have been removed after its replacement by a pure Python implementation. (Contributed by Pablo Galindo in :issue:`36623`.)
uk: Файли заголовків і функції, пов’язані з pgen, були видалені після заміни на чисту реалізацію Python. (Надав Пабло Галіндо в :issue:`36623`.)

source: :class:`types.CodeType` has a new parameter in the second position of the constructor (*posonlyargcount*) to support positional-only arguments defined in :pep:`570`. The first argument (*argcount*) now represents the total number of positional arguments (including positional-only arguments). The new ``replace()`` method of :class:`types.CodeType` can be used to make the code future-proof.
uk: :class:`types.CodeType` має новий параметр у другій позиції конструктора (*posonlyargcount*) для підтримки лише позиційних аргументів, визначених у :pep:`570`. Перший аргумент (*argcount*) тепер представляє загальну кількість позиційних аргументів (включаючи лише позиційні аргументи). Новий метод ``replace()`` :class:`types.CodeType` можна використовувати, щоб зробити код готовим до майбутнього.

source: The parameter ``digestmod`` for :func:`hmac.new` no longer uses the MD5 digest by default.
uk: Параметр ``digestmod`` для :func:`hmac.new` більше не використовує дайджест MD5 за замовчуванням.

source: Changes in the C API
uk: Зміни в C API

source: The :c:type:`PyCompilerFlags` structure got a new *cf_feature_version* field. It should be initialized to ``PY_MINOR_VERSION``. The field is ignored by default, and is used if and only if ``PyCF_ONLY_AST`` flag is set in *cf_flags*. (Contributed by Guido van Rossum in :issue:`35766`.)
uk: Структура :c:type:`PyCompilerFlags` отримала нове поле *cf_feature_version*. Його слід ініціалізувати як ``PY_MINOR_VERSION``. Поле ігнорується за замовчуванням і використовується тоді і тільки тоді, коли в *cf_flags* встановлено прапорець ``PyCF_ONLY_AST``. (Надав Гвідо ван Россум у :issue:`35766`.)

source: The :c:func:`PyEval_ReInitThreads` function has been removed from the C API. It should not be called explicitly: use :c:func:`PyOS_AfterFork_Child` instead. (Contributed by Victor Stinner in :issue:`36728`.)
uk: Функцію :c:func:`PyEval_ReInitThreads` видалено з C API. Його не слід викликати явно: замість цього використовуйте :c:func:`PyOS_AfterFork_Child`. (Надав Віктор Стіннер у :issue:`36728`.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. When Python is embedded, ``libpython`` must not be loaded with ``RTLD_LOCAL``, but ``RTLD_GLOBAL`` instead. Previously, using ``RTLD_LOCAL``, it was already not possible to load C extensions which were not linked to ``libpython``, like C extensions of the standard library built by the ``*shared*`` section of ``Modules/Setup``. (Contributed by Victor Stinner in :issue:`21536`.)
uk: В Unix розширення C більше не пов’язані з libpython, за винятком Android і Cygwin. Коли Python вбудовано, ``libpython`` має завантажуватися не з ``RTLD_LOCAL``, а ``RTLD_GLOBAL``. Раніше за допомогою ``RTLD_LOCAL`` було неможливо завантажити розширення C, які не були пов’язані з ``libpython``, як-от розширення C стандартної бібліотеки, створеної розділом ``*shared*`` ``Modules/Setup``. (Надав Віктор Стіннер у :issue:`21536`.)

source: Use of ``#`` variants of formats in parsing or building value (e.g. :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction`, etc.) without ``PY_SSIZE_T_CLEAN`` defined raises ``DeprecationWarning`` now. It will be removed in 3.10 or 4.0. Read :ref:`arg-parsing` for detail. (Contributed by Inada Naoki in :issue:`36381`.)
uk: Використання варіантів форматів ``#`` під час аналізу чи побудови значення (наприклад, :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction` тощо) без Визначений ``PY_SSIZE_T_CLEAN`` тепер викликає ``DeprecationWarning``. Його буде видалено в 3.10 або 4.0. Прочитайте :ref:`arg-parsing` для деталей. (Надано Інадою Наокі в :issue:`36381`.)

source: Instances of heap-allocated types (such as those created with :c:func:`PyType_FromSpec`) hold a reference to their type object. Increasing the reference count of these type objects has been moved from :c:func:`PyType_GenericAlloc` to the more low-level functions, :c:func:`PyObject_Init` and :c:func:`PyObject_INIT`. This makes types created through :c:func:`PyType_FromSpec` behave like other classes in managed code.
uk: Екземпляри типів, виділених у купі (наприклад, створених за допомогою :c:func:`PyType_FromSpec`) містять посилання на свій об’єкт типу. Збільшення кількості посилань на ці типи об’єктів було переміщено з :c:func:`PyType_GenericAlloc` до функцій більш низького рівня, :c:func:`PyObject_Init` і :c:func:`PyObject_INIT`. Це змушує типи, створені через :c:func:`PyType_FromSpec`, поводитися як інші класи в керованому коді.

source: :ref:`Statically allocated types <static-types>` are not affected.
uk: :ref:`Статично виділені типи <static-types>` не впливають.

source: For the vast majority of cases, there should be no side effect. However, types that manually increase the reference count after allocating an instance (perhaps to work around the bug) may now become immortal. To avoid this, these classes need to call Py_DECREF on the type object during instance deallocation.
uk: У переважній більшості випадків побічних ефектів бути не повинно. Однак типи, які вручну збільшують кількість посилань після виділення екземпляра (можливо, щоб обійти помилку), тепер можуть стати безсмертними. Щоб уникнути цього, ці класи повинні викликати Py_DECREF для об’єкта типу під час звільнення примірника.

source: To correctly port these types into 3.8, please apply the following changes:
uk: Щоб правильно перенести ці типи в 3.8, застосуйте такі зміни:

source: Remove :c:macro:`Py_INCREF` on the type object after allocating an instance - if any. This may happen after calling :c:func:`PyObject_New`, :c:func:`PyObject_NewVar`, :c:func:`PyObject_GC_New`, :c:func:`PyObject_GC_NewVar`, or any other custom allocator that uses :c:func:`PyObject_Init` or :c:func:`PyObject_INIT`.
uk: Видаліть :c:macro:`Py_INCREF` на об'єкті типу після виділення екземпляра - якщо такий є. Це може статися після виклику :c:func:`PyObject_New`, :c:func:`PyObject_NewVar`, :c:func:`PyObject_GC_New`, :c:func:`PyObject_GC_NewVar` або будь-якого іншого спеціального розподілювача, який використовує :c:func:`PyObject_Init` або :c:func:`PyObject_INIT`.

source: Example:
uk: приклад:

source: Ensure that all custom ``tp_dealloc`` functions of heap-allocated types decrease the type's reference count.
uk: Переконайтеся, що всі спеціальні функції ``tp_dealloc`` типів, виділених у купі, зменшують кількість посилань на тип.

source: (Contributed by Eddie Elizondo in :issue:`35810`.)
uk: (Надав Едді Елізондо в :issue:`35810`.)

source: The :c:macro:`Py_DEPRECATED()` macro has been implemented for MSVC. The macro now must be placed before the symbol name.
uk: Для MSVC реалізовано макрос :c:macro:`Py_DEPRECATED()`. Тепер макрос потрібно розмістити перед назвою символу.

source: (Contributed by Zackery Spytz in :issue:`33407`.)
uk: (Надав Закері Шпітц у :issue:`33407`.)

source: The interpreter does not pretend to support binary compatibility of extension types across feature releases, anymore. A :c:type:`PyTypeObject` exported by a third-party extension module is supposed to have all the slots expected in the current Python version, including :c:member:`~PyTypeObject.tp_finalize` (:const:`Py_TPFLAGS_HAVE_FINALIZE` is not checked anymore before reading :c:member:`~PyTypeObject.tp_finalize`).
uk: Інтерпретатор більше не претендує на підтримку бінарної сумісності типів розширень у випусках функцій. :c:type:`PyTypeObject`, експортований модулем розширення третьої сторони, повинен мати всі слоти, очікувані в поточній версії Python, включаючи :c:member:`~PyTypeObject.tp_finalize` (:const:`Py_TPFLAGS_HAVE_FINALIZE` більше не перевіряється перед читанням :c:member:`~PyTypeObject.tp_finalize`).

source: (Contributed by Antoine Pitrou in :issue:`32388`.)
uk: (Надав Антуан Пітру в :issue:`32388`.)

source: The functions :c:func:`PyNode_AddChild` and :c:func:`PyParser_AddToken` now accept two additional ``int`` arguments *end_lineno* and *end_col_offset*.
uk: Функції :c:func:`PyNode_AddChild` і :c:func:`PyParser_AddToken` тепер приймають два додаткові аргументи ``int`` *end_lineno* і *end_col_offset*.

source: The :file:`libpython38.a` file to allow MinGW tools to link directly against :file:`python38.dll` is no longer included in the regular Windows distribution. If you require this file, it may be generated with the ``gendef`` and ``dlltool`` tools, which are part of the MinGW binutils package:
uk: Файл :file:`libpython38.a`, який дозволяє інструментам MinGW зв’язуватися безпосередньо з :file:`python38.dll`, більше не входить до звичайного дистрибутива Windows. Якщо вам потрібен цей файл, його можна створити за допомогою інструментів ``gendef`` і ``dlltool``, які є частиною пакету MinGW binutils:

source: The location of an installed :file:`pythonXY.dll` will depend on the installation options and the version and language of Windows. See :ref:`using-on-windows` for more information. The resulting library should be placed in the same directory as :file:`pythonXY.lib`, which is generally the :file:`libs` directory under your Python installation.
uk: Розташування встановленого :file:`pythonXY.dll` залежатиме від параметрів встановлення, версії та мови Windows. Перегляньте :ref:`using-on-windows` для отримання додаткової інформації. Отриману бібліотеку слід розмістити в тому самому каталозі, що й :file:`pythonXY.lib`, який зазвичай є каталогом :file:`libs` у вашій установці Python.

source: (Contributed by Steve Dower in :issue:`37351`.)
uk: (Надав Стів Дауер у :issue:`37351`.)

source: CPython bytecode changes
uk: Зміни байт-коду CPython

source: The interpreter loop has been simplified by moving the logic of unrolling the stack of blocks into the compiler. The compiler emits now explicit instructions for adjusting the stack of values and calling the cleaning-up code for :keyword:`break`, :keyword:`continue` and :keyword:`return`.
uk: Цикл інтерпретатора було спрощено шляхом переміщення логіки розгортання стека блоків у компілятор. Тепер компілятор видає чіткі інструкції для налаштування стека значень і виклику коду очищення для :keyword:`break`, :keyword:`continue` і :keyword:`return`.

source: Removed opcodes :opcode:`BREAK_LOOP`, :opcode:`CONTINUE_LOOP`, :opcode:`SETUP_LOOP` and :opcode:`SETUP_EXCEPT`. Added new opcodes :opcode:`ROT_FOUR`, :opcode:`BEGIN_FINALLY`, :opcode:`CALL_FINALLY` and :opcode:`POP_FINALLY`. Changed the behavior of :opcode:`END_FINALLY` and :opcode:`WITH_CLEANUP_START`.
uk: Видалено коди операцій :opcode:`BREAK_LOOP`, :opcode:`CONTINUE_LOOP`, :opcode:`SETUP_LOOP` і :opcode:`SETUP_EXCEPT`. Додано нові коди операцій: :opcode:`ROT_FOUR`, :opcode:`BEGIN_FINALLY`, :opcode:`CALL_FINALLY` і :opcode:`POP_FINALLY`. Змінено поведінку :opcode:`END_FINALLY` і :opcode:`WITH_CLEANUP_START`.

source: (Contributed by Mark Shannon, Antoine Pitrou and Serhiy Storchaka in :issue:`17611`.)
uk: (Надано Марком Шенноном, Антуаном Пітру та Сергієм Сторчакою в :issue:`17611`.)
