Repository: python/python-docs-uk
Catalog: whatsnew/3.8.po
Languages: uk

source: When the Python interpreter is interrupted by Ctrl-C (SIGINT) and the resulting :exc:`KeyboardInterrupt` exception is not caught, the Python process now exits via a SIGINT signal or with the correct exit code such that the calling process can detect that it died due to a Ctrl-C. Shells on POSIX and Windows use this to properly terminate scripts in interactive sessions. (Contributed by Google via Gregory P. Smith in :issue:`1054041`.)
uk: Коли інтерпретатор Python переривається Ctrl-C (SIGINT) і результуючий виняток :exc:`KeyboardInterrupt` не перехоплюється, процес Python тепер завершує роботу через сигнал SIGINT або з правильним кодом виходу, щоб процес виклику міг виявити це він помер через Ctrl-C. Оболонки в POSIX і Windows використовують це для належного завершення сценаріїв під час інтерактивних сеансів. (Надано Google через Грегорі П. Сміта в :issue:`1054041`.)

source: Some advanced styles of programming require updating the :class:`types.CodeType` object for an existing function. Since code objects are immutable, a new code object needs to be created, one that is modeled on the existing code object. With 19 parameters, this was somewhat tedious. Now, the new ``replace()`` method makes it possible to create a clone with a few altered parameters.
uk: Деякі просунуті стилі програмування вимагають оновлення об’єкта :class:`types.CodeType` для наявної функції. Оскільки кодові об’єкти є незмінними, необхідно створити новий кодовий об’єкт, змодельований на основі існуючого кодового об’єкта. З 19 параметрами це було дещо втомливо. Тепер новий метод ``replace()`` дозволяє створити клон із декількома зміненими параметрами.

source: Here's an example that alters the :func:`statistics.mean` function to prevent the *data* parameter from being used as a keyword argument::
uk: Ось приклад, який змінює функцію :func:`statistics.mean`, щоб запобігти використанню параметра *data* як аргументу ключового слова:

source: (Contributed by Victor Stinner in :issue:`37032`.)
uk: (Надав Віктор Стіннер у :issue:`37032`.)

source: For integers, the three-argument form of the :func:`pow` function now permits the exponent to be negative in the case where the base is relatively prime to the modulus. It then computes a modular inverse to the base when the exponent is ``-1``, and a suitable power of that inverse for other negative exponents. For example, to compute the `modular multiplicative inverse <https://en.wikipedia.org/wiki/Modular_multiplicative_inverse>`_ of 38 modulo 137, write::
uk: Для цілих чисел форма функції :func:`pow` із трьома аргументами тепер дозволяє показнику степеня бути від’ємним у випадку, коли основа взаємно проста до модуля. Потім він обчислює модульну величину, обернену до основи, коли експонента дорівнює ``-1``, і відповідний ступінь цієї оберненої величини для інших від’ємних показників степеня. Наприклад, щоб обчислити `модульний мультиплікативний обернений <https://en.wikipedia.org/wiki/Modular_multiplicative_inverse>`_ 38 за модулем 137, напишіть::

source: Modular inverses arise in the solution of `linear Diophantine equations <https://en.wikipedia.org/wiki/Diophantine_equation>`_. For example, to find integer solutions for ``4258𝑥 + 147𝑦 = 369``, first rewrite as ``4258𝑥 ≡ 369 (mod 147)`` then solve:
uk: Модульні обернені виникають при розв’язуванні "лінійних діофантових рівнянь <https://en.wikipedia.org/wiki/Diophantine_equation>" _. Наприклад, щоб знайти цілочисельні розв’язки для ``4258𝑥 + 147𝑦 = 369``, спочатку перепишіть як ``4258𝑥 ≡ 369 (mod 147)``, а потім розв’яжіть:

source: (Contributed by Mark Dickinson in :issue:`36027`.)
uk: (Надав Марк Дікінсон у :issue:`36027`.)

source: Dict comprehensions have been synced-up with dict literals so that the key is computed first and the value second::
uk: Розуміння Dict було синхронізовано з літералами Dict, так що спочатку обчислюється ключ, а потім значення::

source: The guaranteed execution order is helpful with assignment expressions because variables assigned in the key expression will be available in the value expression::
uk: Гарантований порядок виконання корисний у виразах призначення, оскільки змінні, призначені у ключовому виразі, будуть доступні у виразі значення::

source: (Contributed by Jörn Heissler in :issue:`35224`.)
uk: (Надав Йорн Гайслер у :issue:`35224`.)

source: The :meth:`object.__reduce__` method can now return a tuple from two to six elements long. Formerly, five was the limit. The new, optional sixth element is a callable with a ``(obj, state)`` signature. This allows the direct control over the state-updating behavior of a specific object. If not *None*, this callable will have priority over the object's :meth:`~__setstate__` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
uk: Метод :meth:`object.__reduce__` тепер може повертати кортеж довжиною від двох до шести елементів. Раніше обмеженням було п’ять. Новий необов’язковий шостий елемент – це виклик із сигнатурою ``(obj, state)``. Це дозволяє безпосередньо контролювати поведінку певного об’єкта при оновленні стану. Якщо не *None*, цей виклик матиме пріоритет над методом :meth:`~__setstate__` об’єкта. (Надано П’єром Глейзером і Олів’є Грізелем у :issue:`35900`.)

source: New Modules
uk: Нові модулі

source: The new :mod:`importlib.metadata` module provides (provisional) support for reading metadata from third-party packages. For example, it can extract an installed package's version number, list of entry points, and more::
uk: Новий модуль :mod:`importlib.metadata` забезпечує (тимчасову) підтримку читання метаданих зі сторонніх пакетів. Наприклад, він може отримати номер версії встановленого пакета, список точок входу тощо:

source: (Contributed by Barry Warsaw and Jason R. Coombs in :issue:`34632`.)
uk: (Надано Баррі Варшау та Джейсоном Р. Кумбсом у :issue:`34632`.)

source: Improved Modules
uk: Покращені модулі

source: ast
uk: аст

source: AST nodes now have ``end_lineno`` and ``end_col_offset`` attributes, which give the precise location of the end of the node. (This only applies to nodes that have ``lineno`` and ``col_offset`` attributes.)
uk: Вузли AST тепер мають атрибути ``end_lineno`` і ``end_col_offset``, які дають точне розташування кінця вузла. (Це стосується лише вузлів, які мають атрибути ``lineno`` і ``col_offset``.)

source: New function :func:`ast.get_source_segment` returns the source code for a specific AST node.
uk: Нова функція :func:`ast.get_source_segment` повертає вихідний код для певного вузла AST.

source: (Contributed by Ivan Levkivskyi in :issue:`33416`.)
uk: (Надав Іван Левківський у :issue:`33416`.)

source: The :func:`ast.parse` function has some new flags:
uk: Функція :func:`ast.parse` має кілька нових позначок:

source: ``type_comments=True`` causes it to return the text of :pep:`484` and :pep:`526` type comments associated with certain AST nodes;
uk: ``type_comments=True`` змушує повертати текст коментарів типу :pep:`484` і :pep:`526`, пов’язаних із певними вузлами AST;

source: ``mode='func_type'`` can be used to parse :pep:`484` "signature type comments" (returned for function definition AST nodes);
uk: ``mode='func_type'`` можна використовувати для аналізу :pep:`484` "коментарів типу підпису" (повертається для вузлів AST визначення функції);

source: ``feature_version=(3, N)`` allows specifying an earlier Python 3 version. For example, ``feature_version=(3, 4)`` will treat :keyword:`async` and :keyword:`await` as non-reserved words.
uk: ``feature_version=(3, N)`` дозволяє вказати попередню версію Python 3. Наприклад, ``feature_version=(3, 4)`` розглядатиме :keyword:`async` і :keyword:`await` як незарезервовані слова.

source: (Contributed by Guido van Rossum in :issue:`35766`.)
uk: (Надав Гвідо ван Россум у :issue:`35766`.)

source: :func:`asyncio.run` has graduated from the provisional to stable API. This function can be used to execute a :term:`coroutine` and return the result while automatically managing the event loop. For example::
uk: :func:`asyncio.run` перейшов від попереднього до стабільного API. Цю функцію можна використовувати для виконання :term:`coroutine` і повернення результату під час автоматичного керування циклом подій. Наприклад::

source: This is *roughly* equivalent to::
uk: Це *приблизно* еквівалентно::

source: The actual implementation is significantly more complex. Thus, :func:`asyncio.run` should be the preferred way of running asyncio programs.
uk: Фактична реалізація значно складніша. Таким чином, :func:`asyncio.run` має бути кращим способом запуску асинхронних програм.

source: (Contributed by Yury Selivanov in :issue:`32314`.)
uk: (Надав Юрій Селіванов у :issue:`32314`.)

source: Running ``python -m asyncio`` launches a natively async REPL. This allows rapid experimentation with code that has a top-level :keyword:`await`. There is no longer a need to directly call ``asyncio.run()`` which would spawn a new event loop on every invocation:
uk: Запуск ``python -m asyncio`` запускає нативний асинхронний REPL. Це дозволяє швидко експериментувати з кодом, який має :keyword:`await` верхнього рівня. Більше немає потреби безпосередньо викликати ``asyncio.run()``, який породжував би новий цикл подій під час кожного виклику:

source: (Contributed by Yury Selivanov in :issue:`37028`.)
uk: (Надав Юрій Селіванов у :issue:`37028`.)

source: The exception :class:`asyncio.CancelledError` now inherits from :class:`BaseException` rather than :class:`Exception` and no longer inherits from :class:`concurrent.futures.CancelledError`. (Contributed by Yury Selivanov in :issue:`32528`.)
uk: Виняток :class:`asyncio.CancelledError` тепер успадковується від :class:`BaseException`, а не від :class:`Exception` і більше не успадковується від :class:`concurrent.futures.CancelledError`. (Надав Юрій Селіванов у :issue:`32528`.)

source: On Windows, the default event loop is now :class:`~asyncio.ProactorEventLoop`. (Contributed by Victor Stinner in :issue:`34687`.)
uk: У Windows типовим циклом подій тепер є :class:`~asyncio.ProactorEventLoop`. (Надав Віктор Стіннер у :issue:`34687`.)

source: :class:`~asyncio.ProactorEventLoop` now also supports UDP. (Contributed by Adam Meily and Andrew Svetlov in :issue:`29883`.)
uk: :class:`~asyncio.ProactorEventLoop` тепер також підтримує UDP. (Надано Адамом Мейлі та Ендрю Свєтловим у :issue:`29883`.)

source: :class:`~asyncio.ProactorEventLoop` can now be interrupted by :exc:`KeyboardInterrupt` ("CTRL+C"). (Contributed by Vladimir Matveev in :issue:`23057`.)
uk: :class:`~asyncio.ProactorEventLoop` тепер можна переривати :exc:`KeyboardInterrupt` ("CTRL+C"). (Надав Володимир Матвєєв у :issue:`23057`.)

source: Added :meth:`asyncio.Task.get_coro` for getting the wrapped coroutine within an :class:`asyncio.Task`. (Contributed by Alex Grönholm in :issue:`36999`.)
uk: Додано :meth:`asyncio.Task.get_coro` для отримання загорнутої співпрограми в :class:`asyncio.Task`. (Надав Алекс Грьонхольм у :issue:`36999`.)

source: Asyncio tasks can now be named, either by passing the ``name`` keyword argument to :func:`asyncio.create_task` or the :meth:`~asyncio.loop.create_task` event loop method, or by calling the :meth:`~asyncio.Task.set_name` method on the task object. The task name is visible in the ``repr()`` output of :class:`asyncio.Task` and can also be retrieved using the :meth:`~asyncio.Task.get_name` method. (Contributed by Alex Grönholm in :issue:`34270`.)
uk: Асинхронним завданням тепер можна присвоювати назви, передавши аргумент ключового слова ``name`` до :func:`asyncio.create_task` або методу циклу подій :meth:`~asyncio.loop.create_task`, або викликавши :meth:`~asyncio.Task.set_name` метод об’єкта завдання. Ім’я завдання відображається у виведенні ``repr()`` :class:`asyncio.Task` і також може бути отримано за допомогою методу :meth:`~asyncio.Task.get_name`. (Надав Алекс Грьонхольм у :issue:`34270`.)

source: Added support for `Happy Eyeballs <https://en.wikipedia.org/wiki/Happy_Eyeballs>`_ to :func:`asyncio.loop.create_connection`. To specify the behavior, two new parameters have been added: *happy_eyeballs_delay* and *interleave*. The Happy Eyeballs algorithm improves responsiveness in applications that support IPv4 and IPv6 by attempting to simultaneously connect using both. (Contributed by twisteroid ambassador in :issue:`33530`.)
uk: Додано підтримку `Happy Eyeballs <https://en.wikipedia.org/wiki/Happy_Eyeballs>`_ до :func:`asyncio.loop.create_connection`. Щоб визначити поведінку, було додано два нові параметри: *happy_eyeballs_delay* і *interleave*. Алгоритм Happy Eyeballs покращує швидкість реагування в програмах, які підтримують IPv4 та IPv6, намагаючись одночасно підключитися за допомогою обох. (Надано twisteroid ambassador у :issue:`33530`.)

source: builtins
uk: вбудовані елементи

source: The :func:`compile` built-in has been improved to accept the ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` flag. With this new flag passed, :func:`compile` will allow top-level ``await``, ``async for`` and ``async with`` constructs that are usually considered invalid syntax. Asynchronous code object marked with the ``CO_COROUTINE`` flag may then be returned. (Contributed by Matthias Bussonnier in :issue:`34616`)
uk: Вбудований :func:`compile` був покращений, щоб приймати прапорець ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT``. Після передачі цього нового прапора :func:`compile` дозволить використовувати конструкції верхнього рівня ``await``, ``async for`` і ``async with``, які зазвичай вважаються недійсними синтаксисом. Після цього можна повернути об’єкт асинхронного коду, позначений прапором ``CO_COROUTINE``. (Надав Матіас Бюссонньє в :issue:`34616`)

source: collections
uk: колекції

source: The :meth:`~collections.somenamedtuple._asdict` method for :func:`collections.namedtuple` now returns a :class:`dict` instead of a :class:`collections.OrderedDict`. This works because regular dicts have guaranteed ordering since Python 3.7. If the extra features of :class:`OrderedDict` are required, the suggested remediation is to cast the result to the desired type: ``OrderedDict(nt._asdict())``. (Contributed by Raymond Hettinger in :issue:`35864`.)
uk: Метод :meth:`~collections.somenamedtuple._asdict` для :func:`collections.namedtuple` тепер повертає :class:`dict` замість :class:`collections.OrderedDict`. Це працює, оскільки звичайні dicts мають гарантоване впорядкування, починаючи з Python 3.7. Якщо потрібні додаткові функції :class:`OrderedDict`, запропонованим виправленням є приведення результату до потрібного типу: ``OrderedDict(nt._asdict())``. (Надав Реймонд Геттінгер у :issue:`35864`.)

source: The :class:`cProfile.Profile <profile.Profile>` class can now be used as a context manager. Profile a block of code by running::
uk: Клас :class:`cProfile.Profile <profile.Profile>` тепер можна використовувати як контекстний менеджер. Профілюйте блок коду, виконавши::

source: (Contributed by Scott Sanderson in :issue:`29235`.)
uk: (Надав Скотт Сандерсон у :issue:`29235`.)

source: The :class:`csv.DictReader` now returns instances of :class:`dict` instead of a :class:`collections.OrderedDict`. The tool is now faster and uses less memory while still preserving the field order. (Contributed by Michael Selik in :issue:`34003`.)
uk: :class:`csv.DictReader` тепер повертає екземпляри :class:`dict` замість :class:`collections.OrderedDict`. Інструмент тепер працює швидше та використовує менше пам’яті, але зберігає порядок полів. (Надав Майкл Селік у :issue:`34003`.)

source: curses
uk: прокльони

source: Added a new variable holding structured version information for the underlying ncurses library: :data:`~curses.ncurses_version`. (Contributed by Serhiy Storchaka in :issue:`31680`.)
uk: Додано нову змінну, яка містить структуровану інформацію про версію базової бібліотеки ncurses: :data:`~curses.ncurses_version`. (Надав Сергій Сторчака в :issue:`31680`.)

source: On Windows, :class:`~ctypes.CDLL` and subclasses now accept a *winmode* parameter to specify flags for the underlying ``LoadLibraryEx`` call. The default flags are set to only load DLL dependencies from trusted locations, including the path where the DLL is stored (if a full or partial path is used to load the initial DLL) and paths added by :func:`~os.add_dll_directory`. (Contributed by Steve Dower in :issue:`36085`.)
uk: У Windows :class:`~ctypes.CDLL` і підкласи тепер приймають параметр *winmode* для визначення прапорів для основного виклику ``LoadLibraryEx``. Прапорці за замовчуванням встановлено лише для завантаження залежностей DLL із надійних місць, включаючи шлях, де зберігається DLL (якщо повний або частковий шлях використовується для завантаження початкової DLL), і шляхи, додані :func:`~os.add_dll_directory` . (Надав Стів Дауер у :issue:`36085`.)

source: datetime
uk: дата, час

source: Added new alternate constructors :meth:`datetime.date.fromisocalendar` and :meth:`datetime.datetime.fromisocalendar`, which construct :class:`date` and :class:`datetime` objects respectively from ISO year, week number, and weekday; these are the inverse of each class's ``isocalendar`` method. (Contributed by Paul Ganssle in :issue:`36004`.)
uk: Додано нові альтернативні конструктори :meth:`datetime.date.fromisocalendar` і :meth:`datetime.datetime.fromisocalendar`, які створюють об’єкти :class:`date` і :class:`datetime` відповідно з року ISO, номера тижня, і будній день; вони є зворотними до методу ``isocalendar`` кожного класу. (Надав Пол Ганссле в :issue:`36004`.)

source: :func:`functools.lru_cache` can now be used as a straight decorator rather than as a function returning a decorator. So both of these are now supported::
uk: :func:`functools.lru_cache` тепер можна використовувати як прямий декоратор, а не як функцію, що повертає декоратор. Тож тепер підтримуються обидва:

source: (Contributed by Raymond Hettinger in :issue:`36772`.)
uk: (Надав Реймонд Геттінгер у :issue:`36772`.)

source: Added a new :func:`functools.cached_property` decorator, for computed properties cached for the life of the instance. ::
uk: Додано новий декоратор :func:`functools.cached_property` для обчислених властивостей, кешованих протягом життя примірника. ::

source: (Contributed by Carl Meyer in :issue:`21145`)
uk: (Надано Карлом Майєром у :issue:`21145`)

source: Added a new :func:`functools.singledispatchmethod` decorator that converts methods into :term:`generic functions <generic function>` using :term:`single dispatch`::
uk: Додано новий декоратор :func:`functools.singledispatchmethod`, який перетворює методи на :term:`загальні функції <generic function>` за допомогою :term:`single dispatch`::

source: (Contributed by Ethan Smith in :issue:`32380`)
uk: (Надав Ітан Сміт у :issue:`32380`)

source: :func:`~gc.get_objects` can now receive an optional *generation* parameter indicating a generation to get objects from. (Contributed by Pablo Galindo in :issue:`36016`.)
uk: :func:`~gc.get_objects` тепер може отримувати додатковий параметр *generation*, що вказує на покоління, з якого потрібно отримати об’єкти. (Надав Пабло Галіндо в :issue:`36016`.)

source: Added :func:`~gettext.pgettext` and its variants. (Contributed by Franz Glasner, Éric Araujo, and Cheryl Sabella in :issue:`2504`.)
uk: Додано :func:`~gettext.pgettext` та його варіанти. (Надано Францом Гласнером, Еріком Араужо та Шеріл Сабеллою в :issue:`2504`.)

source: Added the *mtime* parameter to :func:`gzip.compress` for reproducible output. (Contributed by Guo Ci Teo in :issue:`34898`.)
uk: Додано параметр *mtime* до :func:`gzip.compress` для відтворюваного виведення. (Надав Guo Ci Teo в :issue:`34898`.)

source: A :exc:`~gzip.BadGzipFile` exception is now raised instead of :exc:`OSError` for certain types of invalid or corrupt gzip files. (Contributed by Filip Gruszczyński, Michele Orrù, and Zackery Spytz in :issue:`6584`.)
uk: Виняток :exc:`~gzip.BadGzipFile` тепер викликається замість :exc:`OSError` для певних типів недійсних або пошкоджених файлів gzip. (Надано Філіпом Грущинським, Мікеле Орру та Закері Шпітцем у :issue:`6584`.)

source: IDLE and idlelib
uk: IDLE і idlelib

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
uk: Виведення в N рядків (50 за замовчуванням) стиснуто до кнопки. N можна змінити в розділі PyShell на сторінці "Загальні" діалогового вікна "Параметри". Менше, але, можливо, наддовгих рядків можна стиснути, клацнувши правою кнопкою миші на виводі. Стиснутий вихід можна розгорнути на місці, подвійним клацанням кнопки або в буфер обміну чи окреме вікно, клацнувши кнопку правою кнопкою миші. (Надав Тал Ейнат у :issue:`1529353`.)

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They also re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
uk: Додайте "Run Customized" до меню "Run", щоб запустити модуль із налаштованими налаштуваннями. Будь-які введені аргументи командного рядка додаються до sys.argv. Вони також знову з’являються в полі для наступного налаштованого запуску. Можна також придушити звичайний перезапуск основного модуля Shell. (Надано Шеріл Сабелла, Террі Ян Ріді та іншими в :issue:`5680` і :issue:`37627`.)

source: Added optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
uk: Додано додаткові номери рядків для вікон редактора IDLE. Вікна відкриваються без номерів рядків, якщо не встановлено інше на вкладці "Загальні" діалогового вікна налаштування. Номери рядків для існуючого вікна відображаються та ховаються в меню "Параметри". (Надано Тал Ейнат і Саймадхав Геблікар у :issue:`17535`.)

source: OS native encoding is now used for converting between Python strings and Tcl objects. This allows IDLE to work with emoji and other non-BMP characters. These characters can be displayed or copied and pasted to or from the clipboard. Converting strings from Tcl to Python and back now never fails. (Many people worked on this for eight years but the problem was finally solved by Serhiy Storchaka in :issue:`13153`.)
uk: Власне кодування ОС тепер використовується для перетворення між рядками Python і об’єктами Tcl. Це дозволяє IDLE працювати з емодзі та іншими символами, відмінними від BMP. Ці символи можна відобразити або скопіювати та вставити в буфер обміну або з нього. Перетворення рядків із Tcl на Python і назад тепер ніколи не дає збою. (Багато людей працювали над цим вісім років, але нарешті проблему вирішив Сергій Сторчака в :issue:`13153`.)

source: New in 3.8.1:
uk: Нове в 3.8.1:

source: Add option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
uk: Додайте опцію для вимкнення блимання курсору. (Надав Закері Шпітц у :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
uk: Клавіша Escape тепер закриває вікна завершення IDLE. (Надав Джонні Наджера в :issue:`38944`.)

source: The changes above have been backported to 3.7 maintenance releases.
uk: Зазначені вище зміни було перенесено до випусків обслуговування 3.7.
