Repository: python/python-docs-uk
Catalog: whatsnew/3.8.po
Languages: uk

source: Added method :meth:`~tkinter.Canvas.moveto` in the :class:`tkinter.Canvas` class. (Contributed by Juliette Monsel in :issue:`23831`.)
uk: Додано метод :meth:`~tkinter.Canvas.moveto` в клас :class:`tkinter.Canvas`. (Надано Джульєтт Монсел у :issue:`23831`.)

source: The :class:`tkinter.PhotoImage` class now has :meth:`~tkinter.PhotoImage.transparency_get` and :meth:`~tkinter.PhotoImage.transparency_set` methods. (Contributed by Zackery Spytz in :issue:`25451`.)
uk: Клас :class:`tkinter.PhotoImage` тепер має методи :meth:`~tkinter.PhotoImage.transparency_get` і :meth:`~tkinter.PhotoImage.transparency_set`. (Надав Закері Шпітц у :issue:`25451`.)

source: time
uk: час

source: Added new clock :data:`~time.CLOCK_UPTIME_RAW` for macOS 10.12. (Contributed by Joannah Nanjekye in :issue:`35702`.)
uk: Додано новий годинник :data:`~time.CLOCK_UPTIME_RAW` для macOS 10.12. (Надано Joannah Nanjekye у :issue:`35702`.)

source: typing
uk: введення тексту

source: The :mod:`typing` module incorporates several new features:
uk: Модуль :mod:`typing` містить кілька нових функцій:

source: A dictionary type with per-key types. See :pep:`589` and :class:`typing.TypedDict`. TypedDict uses only string keys. By default, every key is required to be present. Specify "total=False" to allow keys to be optional::
uk: Тип словника з типами по ключу. Перегляньте :pep:`589` і :class:`typing.TypedDict`. TypedDict використовує лише рядкові ключі. За замовчуванням кожен ключ повинен бути присутнім. Укажіть "total=False", щоб дозволити ключам бути необов'язковими::

source: Literal types. See :pep:`586` and :class:`typing.Literal`. Literal types indicate that a parameter or return value is constrained to one or more specific literal values::
uk: Літеральні типи. Перегляньте :pep:`586` і :class:`typing.Literal`. Літеральні типи вказують на те, що параметр або значення, що повертається, обмежено одним або кількома конкретними літеральними значеннями:

source: "Final" variables, functions, methods and classes. See :pep:`591`, :class:`typing.Final` and :func:`typing.final`. The final qualifier instructs a static type checker to restrict subclassing, overriding, or reassignment::
uk: "Кінцеві" змінні, функції, методи та класи. Перегляньте :pep:`591`, :class:`typing.Final` і :func:`typing.final`. Остаточний кваліфікатор наказує статичному засобу перевірки типів обмежити створення підкласів, перевизначення чи перепризначення:

source: Protocol definitions. See :pep:`544`, :class:`typing.Protocol` and :func:`typing.runtime_checkable`. Simple ABCs like :class:`typing.SupportsInt` are now ``Protocol`` subclasses.
uk: Визначення протоколу. Перегляньте :pep:`544`, :class:`typing.Protocol` і :func:`typing.runtime_checkable`. Прості азбуки, такі як :class:`typing.SupportsInt` тепер є підкласами ``Protocol``.

source: New protocol class :class:`typing.SupportsIndex`.
uk: Новий клас протоколу :class:`typing.SupportsIndex`.

source: New functions :func:`typing.get_origin` and :func:`typing.get_args`.
uk: Нові функції :func:`typing.get_origin` і :func:`typing.get_args`.

source: The :mod:`unicodedata` module has been upgraded to use the `Unicode 12.1.0 <http://blog.unicode.org/2019/05/unicode-12-1-en.html>`_ release.
uk: Модуль :mod:`unicodedata` було оновлено для використання випуску `Unicode 12.1.0 <http://blog.unicode.org/2019/05/unicode-12-1-en.html>`_.

source: New function :func:`~unicodedata.is_normalized` can be used to verify a string is in a specific normal form, often much faster than by actually normalizing the string. (Contributed by Max Belanger, David Euresti, and Greg Price in :issue:`32285` and :issue:`37966`).
uk: Нова функція :func:`~unicodedata.is_normalized` може бути використана для перевірки того, що рядок знаходиться в певній нормальній формі, часто набагато швидше, ніж шляхом фактичної нормалізації рядка. (Надано Максом Беланджером, Девідом Юресті та Грегом Прайсом у :issue:`32285` та :issue:`37966`).

source: Added :class:`~unittest.mock.AsyncMock` to support an asynchronous version of :class:`~unittest.mock.Mock`. Appropriate new assert functions for testing have been added as well. (Contributed by Lisa Roach in :issue:`26467`).
uk: Додано :class:`~unittest.mock.AsyncMock` для підтримки асинхронної версії :class:`~unittest.mock.Mock`. Також додано відповідні нові функції assert для тестування. (Надано Лізою Роуч у :issue:`26467`).

source: Added :func:`~unittest.addModuleCleanup()` and :meth:`~unittest.TestCase.addClassCleanup()` to unittest to support cleanups for :func:`~unittest.setUpModule()` and :meth:`~unittest.TestCase.setUpClass()`. (Contributed by Lisa Roach in :issue:`24412`.)
uk: Додано :func:`~unittest.addModuleCleanup()` і :meth:`~unittest.TestCase.addClassCleanup()` до unittest для підтримки очищення для :func:`~unittest.setUpModule()` і :meth:`~unittest .TestCase.setUpClass()`. (Надано Лізою Роуч у :issue:`24412`.)

source: Several mock assert functions now also print a list of actual calls upon failure. (Contributed by Petter Strandmark in :issue:`35047`.)
uk: Кілька імітаційних функцій підтвердження тепер також друкують список фактичних викликів у разі невдачі. (Надано Петтером Страндмарком у :issue:`35047`.)

source: :mod:`unittest` module gained support for coroutines to be used as test cases with :class:`unittest.IsolatedAsyncioTestCase`. (Contributed by Andrew Svetlov in :issue:`32972`.)
uk: Модуль :mod:`unittest` отримав підтримку співпрограм для використання як тестових випадків із :class:`unittest.IsolatedAsyncioTestCase`. (Надав Ендрю Свєтлов у :issue:`32972`.)

source: Example::
uk: Приклад::

source: :mod:`venv` now includes an ``Activate.ps1`` script on all platforms for activating virtual environments under PowerShell Core 6.1. (Contributed by Brett Cannon in :issue:`32718`.)
uk: :mod:`venv` тепер містить сценарій ``Activate.ps1`` на всіх платформах для активації віртуальних середовищ у PowerShell Core 6.1. (Надано Бреттом Кенноном у :issue:`32718`.)

source: weakref
uk: слабкий реф

source: The proxy objects returned by :func:`weakref.proxy` now support the matrix multiplication operators ``@`` and ``@=`` in addition to the other numeric operators. (Contributed by Mark Dickinson in :issue:`36669`.)
uk: Проксі-об’єкти, які повертає :func:`weakref.proxy`, тепер підтримують оператори множення матриці ``@`` і ``@=`` на додаток до інших числових операторів. (Надав Марк Дікінсон у :issue:`36669`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
uk: Щоб пом’якшити DTD і пошук зовнішніх об’єктів, модулі :mod:`xml.dom.minidom` і :mod:`xml.sax` більше не обробляють зовнішні об’єкти за замовчуванням. (Надав Крістіан Хеймс у :issue:`17239`.)

source: The ``.find*()`` methods in the :mod:`xml.etree.ElementTree` module support wildcard searches like ``{*}tag`` which ignores the namespace and ``{namespace}*`` which returns all tags in the given namespace. (Contributed by Stefan Behnel in :issue:`28238`.)
uk: Методи ``.find*()`` у модулі :mod:`xml.etree.ElementTree` підтримують пошук за символами узагальнення, наприклад ``{*}tag``, який ігнорує простір імен, і ``{namespace}*``, який повертає всі теги у вказаному просторі імен. (Надав Стефан Бенель у :issue:`28238`.)

source: The :mod:`xml.etree.ElementTree` module provides a new function :func:`–xml.etree.ElementTree.canonicalize()` that implements C14N 2.0. (Contributed by Stefan Behnel in :issue:`13611`.)
uk: Модуль :mod:`xml.etree.ElementTree` надає нову функцію :func:`–xml.etree.ElementTree.canonicalize()`, яка реалізує C14N 2.0. (Надав Стефан Бенель у :issue:`13611`.)

source: The target object of :class:`xml.etree.ElementTree.XMLParser` can receive namespace declaration events through the new callback methods ``start_ns()`` and ``end_ns()``. Additionally, the :class:`xml.etree.ElementTree.TreeBuilder` target can be configured to process events about comments and processing instructions to include them in the generated tree. (Contributed by Stefan Behnel in :issue:`36676` and :issue:`36673`.)
uk: Цільовий об’єкт :class:`xml.etree.ElementTree.XMLParser` може отримувати події оголошення простору імен через нові методи зворотного виклику ``start_ns()`` і ``end_ns()``. Крім того, ціль :class:`xml.etree.ElementTree.TreeBuilder` можна налаштувати на обробку подій щодо коментарів та інструкцій з обробки, щоб включити їх у згенероване дерево. (Надав Стефан Бенель у :issue:`36676` і :issue:`36673`.)

source: :class:`xmlrpc.client.ServerProxy` now supports an optional *headers* keyword argument for a sequence of HTTP headers to be sent with each request. Among other things, this makes it possible to upgrade from default basic authentication to faster session authentication. (Contributed by Cédric Krier in :issue:`35153`.)
uk: :class:`xmlrpc.client.ServerProxy` тепер підтримує необов’язковий аргумент ключового слова *headers* для послідовності заголовків HTTP, які надсилаються з кожним запитом. Серед іншого, це дає змогу оновити стандартну базову автентифікацію до швидшої сеансової автентифікації. (Надав Седрик Крієр у :issue:`35153`.)

source: Optimizations
uk: Оптимізації

source: The :mod:`subprocess` module can now use the :func:`os.posix_spawn` function in some cases for better performance. Currently, it is only used on macOS and Linux (using glibc 2.24 or newer) if all these conditions are met:
uk: Модуль :mod:`subprocess` тепер може використовувати функцію :func:`os.posix_spawn` у деяких випадках для кращої продуктивності. Наразі він використовується лише в macOS і Linux (з використанням glibc 2.24 або новішої версії), якщо виконуються всі ці умови:

source: *close_fds* is false;
uk: *close_fds* є помилковим;

source: *preexec_fn*, *pass_fds*, *cwd* and *start_new_session* parameters are not set;
uk: Параметри *preexec_fn*, *pass_fds*, *cwd* і *start_new_session* не встановлені;

source: the *executable* path contains a directory.
uk: *виконуваний* шлях містить каталог.

source: (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
uk: (Надано Джоанною Нанджекі та Віктором Стіннером у :issue:`35537`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls on Linux and macOS in order to copy the file more efficiently. "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``". On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 16 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used. The speedup for copying a 512 MiB file within the same partition is about +26% on Linux, +50% on macOS and +40% on Windows. Also, much less CPU cycles are consumed. See :ref:`shutil-platform-dependent-efficient-copy-operations` section. (Contributed by Giampaolo Rodolà in :issue:`33671`.)
uk: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` і :func:`shutil.move` використовують спеціальну для платформи "швидку -copy" системні виклики в Linux і macOS для більш ефективного копіювання файлу. "швидке копіювання" означає, що операція копіювання відбувається всередині ядра, уникаючи використання буферів простору користувача в Python, як у "``outfd.write(infd.read())``". У Windows :func:`shutil.copyfile` використовує більший розмір буфера за замовчуванням (1 МіБ замість 16 КіБ) і використовується варіант :func:`memoryview` на основі :func:`shutil.copyfileobj`. Прискорення копіювання файлу розміром 512 МіБ в межах одного розділу становить приблизно +26% у Linux, +50% у macOS і +40% у Windows. Крім того, споживається набагато менше циклів ЦП. Перегляньте розділ :ref:`shutil-platform-dependent-efficient-copy-operations`. (Надав Джампаоло Родола в :issue:`33671`.)

source: :func:`shutil.copytree` uses :func:`os.scandir` function and all copy functions depending from it use cached :func:`os.stat` values. The speedup for copying a directory with 8000 files is around +9% on Linux, +20% on Windows and +30% on a Windows SMB share. Also the number of :func:`os.stat` syscalls is reduced by 38% making :func:`shutil.copytree` especially faster on network filesystems. (Contributed by Giampaolo Rodolà in :issue:`33695`.)
uk: :func:`shutil.copytree` використовує функцію :func:`os.scandir`, а всі залежні від неї функції копіювання використовують кешовані значення :func:`os.stat`. Прискорення для копіювання каталогу з 8000 файлами становить приблизно +9% у Linux, +20% у Windows і +30% у Windows SMB. Також кількість системних викликів :func:`os.stat` зменшено на 38%, що робить :func:`shutil.copytree` особливо швидшим у мережевих файлових системах. (Надав Джампаоло Родола в :issue:`33695`.)

source: The default protocol in the :mod:`pickle` module is now Protocol 4, first introduced in Python 3.4. It offers better performance and smaller size compared to Protocol 3 available since Python 3.0.
uk: Протоколом за замовчуванням у модулі :mod:`pickle` тепер є протокол 4, вперше представлений у Python 3.4. Він пропонує кращу продуктивність і менший розмір порівняно з протоколом 3, доступним з Python 3.0.

source: Removed one :c:type:`Py_ssize_t` member from ``PyGC_Head``. All GC tracked objects (e.g. tuple, list, dict) size is reduced 4 or 8 bytes. (Contributed by Inada Naoki in :issue:`33597`.)
uk: Видалено один член :c:type:`Py_ssize_t` з ``PyGC_Head``. Розмір усіх об’єктів, що відстежуються GC (наприклад, кортеж, список, dict), зменшено на 4 або 8 байт. (Надано Інадою Наокі в :issue:`33597`.)

source: :class:`uuid.UUID` now uses ``__slots__`` to reduce its memory footprint. (Contributed by Wouter Bolsterlee and Tal Einat in :issue:`30977`)
uk: :class:`uuid.UUID` тепер використовує ``__slots__``, щоб зменшити обсяг пам’яті. (Надано Wouter Bolsterlee і Tal Einat у :issue:`30977`)

source: Improved performance of :func:`operator.itemgetter` by 33%. Optimized argument handling and added a fast path for the common case of a single non-negative integer index into a tuple (which is the typical use case in the standard library). (Contributed by Raymond Hettinger in :issue:`35664`.)
uk: Покращена продуктивність :func:`operator.itemgetter` на 33%. Оптимізовано обробку аргументів і додано швидкий шлях для звичайного випадку одного невід’ємного цілого індексу в кортежі (що є типовим випадком використання в стандартній бібліотеці). (Надав Реймонд Геттінгер у :issue:`35664`.)

source: Sped-up field lookups in :func:`collections.namedtuple`. They are now more than two times faster, making them the fastest form of instance variable lookup in Python. (Contributed by Raymond Hettinger, Pablo Galindo, and Joe Jevnik, Serhiy Storchaka in :issue:`32492`.)
uk: Прискорений пошук полів у :func:`collections.namedtuple`. Тепер вони більш ніж у два рази швидші, що робить їх найшвидшою формою пошуку змінних екземплярів у Python. (Надано Реймондом Геттінгером, Пабло Галіндо та Джо Джевником, Сергієм Сторчакою в :issue:`32492`.)

source: The :class:`list` constructor does not overallocate the internal item buffer if the input iterable has a known length (the input implements ``__len__``). This makes the created list 12% smaller on average. (Contributed by Raymond Hettinger and Pablo Galindo in :issue:`33234`.)
uk: Конструктор :class:`list` не розподіляє внутрішній буфер елементів, якщо ітерація введення має відому довжину (введення реалізує ``__len__``). Це робить створений список у середньому на 12% меншим. (Надано Реймондом Геттінгером і Пабло Галіндо в :issue:`33234`.)

source: Doubled the speed of class variable writes. When a non-dunder attribute was updated, there was an unnecessary call to update slots. (Contributed by Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer, and Serhiy Storchaka in :issue:`36012`.)
uk: Подвоєна швидкість запису змінних класу. Коли атрибут не-dunder оновлювався, виникав непотрібний виклик для оновлення слотів. (Надано Стефаном Бенелем, Пабло Галіндо Сальгадо, Раймондом Геттінгером, Нілом Шеменауером і Сергієм Сторчакою в :issue:`36012`.)

source: Reduced an overhead of converting arguments passed to many builtin functions and methods. This sped up calling some simple builtin functions and methods up to 20--50%. (Contributed by Serhiy Storchaka in :issue:`23867`, :issue:`35582` and :issue:`36127`.)
uk: Зменшено накладні витрати на перетворення аргументів, які передаються багатьом вбудованим функціям і методам. Це прискорило виклик деяких простих вбудованих функцій і методів на 20--50%. (Надав Сергій Сторчака в :issue:`23867`, :issue:`35582` та :issue:`36127`.)

source: ``LOAD_GLOBAL`` instruction now uses new "per opcode cache" mechanism. It is about 40% faster now. (Contributed by Yury Selivanov and Inada Naoki in :issue:`26219`.)
uk: Інструкція ``LOAD_GLOBAL`` тепер використовує новий механізм "кешу кожного коду операції". Зараз це приблизно на 40% швидше. (Надано Юрієм Селівановим та Інадою Наокі в :issue:`26219`.)

source: Build and C API Changes
uk: Зміни збірки та C API

source: Default :data:`sys.abiflags` became an empty string: the ``m`` flag for pymalloc became useless (builds with and without pymalloc are ABI compatible) and so has been removed. (Contributed by Victor Stinner in :issue:`36707`.)
uk: За замовчуванням :data:`sys.abiflags` став порожнім рядком: прапорець ``m`` для pymalloc став марним (збірки з pymalloc і без нього сумісні з ABI), тому його було видалено. (Надав Віктор Стіннер у :issue:`36707`.)

source: Example of changes:
uk: Приклад змін:

source: Only ``python3.8`` program is installed, ``python3.8m`` program is gone.
uk: Встановлено лише програму ``python3.8``, програми ``python3.8m`` немає.

source: Only ``python3.8-config`` script is installed, ``python3.8m-config`` script is gone.
uk: Встановлено лише сценарій ``python3.8-config``, сценарій ``python3.8m-config`` зник.

source: The ``m`` flag has been removed from the suffix of dynamic library filenames: extension modules in the standard library as well as those produced and installed by third-party packages, like those downloaded from PyPI. On Linux, for example, the Python 3.7 suffix ``.cpython-37m-x86_64-linux-gnu.so`` became ``.cpython-38-x86_64-linux-gnu.so`` in Python 3.8.
uk: Прапор ``m`` було видалено з суфікса назв файлів динамічної бібліотеки: модулі розширення в стандартній бібліотеці, а також модулі, створені та встановлені пакетами сторонніх розробників, як-от завантажені з PyPI. У Linux, наприклад, суфікс Python 3.7 ``.cpython-37m-x86_64-linux-gnu.so`` став ``.cpython-38-x86_64-linux-gnu.so`` у Python 3.8.

source: The header files have been reorganized to better separate the different kinds of APIs:
uk: Файли заголовків реорганізовано, щоб краще розділити різні типи API:

source: ``Include/*.h`` should be the portable public stable C API.
uk: ``Include/*.h`` має бути портативним загальнодоступним стабільним C API.

source: ``Include/cpython/*.h`` should be the unstable C API specific to CPython; public API, with some private API prefixed by ``_Py`` or ``_PY``.
uk: ``Include/cpython/*.h`` має бути нестабільним C API, специфічним для CPython; публічний API, з деякими приватними API з префіксом ``_Py`` або ``_PY``.

source: ``Include/internal/*.h`` is the private internal C API very specific to CPython. This API comes with no backward compatibility warranty and should not be used outside CPython. It is only exposed for very specific needs like debuggers and profiles which has to access to CPython internals without calling functions. This API is now installed by ``make install``.
uk: ``Include/internal/*.h`` — це приватний внутрішній API C, специфічний для CPython. Цей API не має гарантії зворотної сумісності, тому його не слід використовувати поза CPython. Він доступний лише для дуже специфічних потреб, таких як налагоджувачі та профілі, які мають доступ до внутрішніх елементів CPython без виклику функцій. Цей API тепер встановлено за допомогою ``make install``.

source: (Contributed by Victor Stinner in :issue:`35134` and :issue:`35081`, work initiated by Eric Snow in Python 3.7.)
uk: (Надано Віктором Стіннером у :issue:`35134` та :issue:`35081`, робота, розпочата Еріком Сноу над Python 3.7.)

source: Some macros have been converted to static inline functions: parameter types and return type are well defined, they don't have issues specific to macros, variables have a local scopes. Examples:
uk: Деякі макроси було перетворено на статичні вбудовані функції: типи параметрів і тип повернення добре визначені, вони не мають проблем, характерних для макросів, змінні мають локальні області видимості. приклади:

source: Private functions: :c:func:`_PyObject_GC_TRACK`, :c:func:`_PyObject_GC_UNTRACK`, :c:func:`_Py_Dealloc`
uk: Приватні функції: :c:func:`_PyObject_GC_TRACK`, :c:func:`_PyObject_GC_UNTRACK`, :c:func:`_Py_Dealloc`

source: (Contributed by Victor Stinner in :issue:`35059`.)
uk: (Надав Віктор Стіннер у :issue:`35059`.)

source: The :c:func:`PyByteArray_Init` and :c:func:`PyByteArray_Fini` functions have been removed. They did nothing since Python 2.7.4 and Python 3.2.0, were excluded from the limited API (stable ABI), and were not documented. (Contributed by Victor Stinner in :issue:`35713`.)
uk: Функції :c:func:`PyByteArray_Init` і :c:func:`PyByteArray_Fini` видалено. Вони нічого не зробили з Python 2.7.4 і Python 3.2.0, були виключені з обмеженого API (стабільний ABI) і не були задокументовані. (Надав Віктор Стіннер у :issue:`35713`.)

source: The result of :c:func:`PyExceptionClass_Name` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`33818`.)
uk: Результат :c:func:`PyExceptionClass_Name` тепер має тип ``const char *``, а не ``char *``. (Надав Сергій Сторчака в :issue:`33818`.)

source: The duality of ``Modules/Setup.dist`` and ``Modules/Setup`` has been removed. Previously, when updating the CPython source tree, one had to manually copy ``Modules/Setup.dist`` (inside the source tree) to ``Modules/Setup`` (inside the build tree) in order to reflect any changes upstream. This was of a small benefit to packagers at the expense of a frequent annoyance to developers following CPython development, as forgetting to copy the file could produce build failures.
uk: Подвійність ``Modules/Setup.dist`` і ``Modules/Setup`` було видалено. Раніше, оновлюючи дерево вихідних кодів CPython, потрібно було вручну скопіювати ``Modules/Setup.dist`` (усередині дерева вихідних кодів) до ``Modules/Setup`` (усередині дерева збірки), щоб відобразити будь-які зміни вгорі . Це було невеликою перевагою для пакувальників за рахунок частого роздратування розробників після розробки CPython, оскільки забуття скопіювати файл могло призвести до помилок збірки.

source: Now the build system always reads from ``Modules/Setup`` inside the source tree. People who want to customize that file are encouraged to maintain their changes in a git fork of CPython or as patch files, as they would do for any other change to the source tree.
uk: Тепер система збирання завжди читає з ``Modules/Setup`` у дереві вихідних кодів. Людям, які хочуть налаштувати цей файл, рекомендується зберігати свої зміни в git-форку CPython або як файли виправлень, як вони робили б для будь-яких інших змін у вихідному дереві.

source: (Contributed by Antoine Pitrou in :issue:`32430`.)
uk: (Надав Антуан Пітру в :issue:`32430`.)
