Repository: python/python-docs-uk
Catalog: whatsnew/3.8.po
Languages: uk

source: Added new opcode :opcode:`END_ASYNC_FOR` for handling exceptions raised when awaiting a next item in an :keyword:`async for` loop. (Contributed by Serhiy Storchaka in :issue:`33041`.)
uk: Додано новий код операції :opcode:`END_ASYNC_FOR` для обробки винятків, які виникають під час очікування наступного елемента в :keyword:`async for` циклі. (Надав Сергій Сторчака в :issue:`33041`.)

source: The :opcode:`MAP_ADD` now expects the value as the first element in the stack and the key as the second element. This change was made so the key is always evaluated before the value in dictionary comprehensions, as proposed by :pep:`572`. (Contributed by Jörn Heissler in :issue:`35224`.)
uk: :opcode:`MAP_ADD` тепер очікує значення як перший елемент у стеку та ключ як другий елемент. Цю зміну було внесено, щоб ключ завжди оцінювався перед значенням у словнику, як запропоновано :pep:`572`. (Надав Йорн Гайслер у :issue:`35224`.)

source: Demos and Tools
uk: Демонстрації та інструменти

source: Added a benchmark script for timing various ways to access variables: ``Tools/scripts/var_access_benchmark.py``. (Contributed by Raymond Hettinger in :issue:`35884`.)
uk: Додано тестовий сценарій для визначення часу різними способами доступу до змінних: ``Tools/scripts/var_access_benchmark.py``. (Надав Реймонд Геттінгер у :issue:`35884`.)

source: Here's a summary of performance improvements since Python 3.3:
uk: Ось підсумок покращень продуктивності з Python 3.3:

source: The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/mac-osx/>`_. The benchmark script displays timings in nanoseconds.
uk: Контрольні показники вимірювалися на процесорі `Intel® Core™ i7-4960HQ <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ під керуванням 64-розрядних збірок macOS, доступних на `python.org <https://www.python.org/downloads/mac-osx/>`_. Еталонний сценарій відображає таймінги в наносекундах.

source: Notable changes in Python 3.8.1
uk: Помітні зміни в Python 3.8.1

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
uk: Через серйозні проблеми безпеки параметр *reuse_address* :meth:`asyncio.loop.create_datagram_endpoint` більше не підтримується. Це через поведінку опції сокета ``SO_REUSEADDR`` в UDP. Для отримання додаткової інформації див. документацію для ``loop.create_datagram_endpoint()``. (Надано Кайлом Стенлі, Антуаном Пітру та Юрієм Селівановим у :issue:`37228`.)

source: Notable changes in Python 3.8.8
uk: Помітні зміни в Python 3.8.8

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
uk: Попередні версії Python дозволяли використовувати як ``;``, так і ``&`` як роздільники параметрів запиту в :func:`urllib.parse.parse_qs` і :func:`urllib.parse.parse_qsl`. З міркувань безпеки та для відповідності новим рекомендаціям W3C це було змінено, щоб дозволити лише один роздільний ключ із ``&`` за замовчуванням. Ця зміна також впливає на :func:`cgi.parse` і :func:`cgi.parse_multipart`, оскільки вони використовують уражені функції внутрішньо. Щоб дізнатися більше, перегляньте відповідну документацію. (Надано Адамом Ґолдшмідтом, Сентилом Кумараном і Кеном Джином у :issue:`42967`.)

source: Notable changes in Python 3.8.12
uk: Помітні зміни в Python 3.8.12

source: Starting with Python 3.8.12 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros.
uk: Починаючи з Python 3.8.12, модуль :mod:`ipaddress` більше не приймає жодних початкових нулів у рядках адрес IPv4. Початкові нулі є неоднозначними та інтерпретуються деякими бібліотеками як вісімкове позначення. Наприклад, застаріла функція :func:`socket.inet_aton` розглядає початкові нулі як вісімкове позначення. glibc реалізація сучасного :func:`~socket.inet_pton` не приймає жодних початкових нулів.

source: (Originally contributed by Christian Heimes in :issue:`36384`, and backported to 3.8 by Achraf Merzouki.)
uk: (Спочатку надано Крістіаном Хеймсом у :issue:`36384`, а також перенесено до 3.8 Ахрафом Мерзукі.)
