Repository: python/python-docs-uk
Catalog: whatsnew/3.8.po
Languages: uk

source: Functions that convert Python number to C integer like :c:func:`PyLong_AsLong` and argument parsing functions like :c:func:`PyArg_ParseTuple` with integer converting format units like ``'i'`` will now use the :meth:`~object.__index__` special method instead of :meth:`~object.__int__`, if available. The deprecation warning will be emitted for objects with the ``__int__()`` method but without the ``__index__()`` method (like :class:`~decimal.Decimal` and :class:`~fractions.Fraction`). :c:func:`PyNumber_Check` will now return ``1`` for objects implementing ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` and :c:func:`PyFloat_AsDouble` also now use the ``__index__()`` method if available. (Contributed by Serhiy Storchaka in :issue:`36048` and :issue:`20092`.)
uk: Функції, які перетворюють число Python на ціле число C, як-от :c:func:`PyLong_AsLong`, і функції аналізу аргументів, як-от :c:func:`PyArg_ParseTuple` з одиницями формату перетворення цілих чисел, як-от ``'i'`` тепер використовуватимуть Спеціальний метод :meth:`~object.__index__` замість :meth:`~object.__int__`, якщо доступний. Попередження про припинення використання буде випущено для об’єктів із методом ``__int__()``, але без ``__index__()`` (наприклад, :class:`~decimal.Decimal` і :class:`~fractions.Fraction` ). :c:func:`PyNumber_Check` тепер повертатиме ``1`` для об’єктів, що реалізують ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` і :c:func:`PyFloat_AsDouble` тепер також використовують метод ``__index__()``, якщо він доступний. (Надав Сергій Сторчака в :issue:`36048` і :issue:`20092`.)

source: Heap-allocated type objects will now increase their reference count in :c:func:`PyObject_Init` (and its parallel macro ``PyObject_INIT``) instead of in :c:func:`PyType_GenericAlloc`. Types that modify instance allocation or deallocation may need to be adjusted. (Contributed by Eddie Elizondo in :issue:`35810`.)
uk: Об’єкти типу, розподіленого за допомогою динамічної пам’яті, тепер збільшуватимуть кількість посилань у :c:func:`PyObject_Init` (і його паралельному макросі ``PyObject_INIT``), а не в :c:func:`PyType_GenericAlloc`. Типи, які змінюють виділення або звільнення екземплярів, можливо, потребують коригування. (Надав Едді Елізондо в :issue:`35810`.)

source: The new function :c:func:`PyCode_NewWithPosOnlyArgs` allows to create code objects like :c:func:`PyCode_New`, but with an extra *posonlyargcount* parameter for indicating the number of positional-only arguments. (Contributed by Pablo Galindo in :issue:`37221`.)
uk: Нова функція :c:func:`PyCode_NewWithPosOnlyArgs` дозволяє створювати об’єкти коду, такі як :c:func:`PyCode_New`, але з додатковим параметром *posonlyargcount* для вказівки кількості лише позиційних аргументів. (Надав Пабло Галіндо в :issue:`37221`.)

source: :c:func:`Py_SetPath` now sets :data:`sys.executable` to the program full path (:c:func:`Py_GetProgramFullPath`) rather than to the program name (:c:func:`Py_GetProgramName`). (Contributed by Victor Stinner in :issue:`38234`.)
uk: :c:func:`Py_SetPath` тепер встановлює :data:`sys.executable` повний шлях до програми (:c:func:`Py_GetProgramFullPath`), а не назву програми (:c:func:`Py_GetProgramName`). (Надав Віктор Стіннер у :issue:`38234`.)

source: Deprecated
uk: Застаріле

source: The distutils ``bdist_wininst`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Victor Stinner in :issue:`37481`.)
uk: Команда distutils ``bdist_wininst`` тепер застаріла, замість неї використовуйте ``bdist_wheel`` (пакети колеса). (Надав Віктор Стіннер у :issue:`37481`.)

source: Deprecated methods ``getchildren()`` and ``getiterator()`` in the :mod:`~xml.etree.ElementTree` module now emit a :exc:`DeprecationWarning` instead of :exc:`PendingDeprecationWarning`. They will be removed in Python 3.9. (Contributed by Serhiy Storchaka in :issue:`29209`.)
uk: Застарілі методи ``getchildren()`` і ``getiterator()`` у модулі :mod:`~xml.etree.ElementTree` тепер видають :exc:`DeprecationWarning` замість :exc:`PendingDeprecationWarning`. Їх буде видалено в Python 3.9. (Надав Сергій Сторчака в :issue:`29209`.)

source: Passing an object that is not an instance of :class:`concurrent.futures.ThreadPoolExecutor` to :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` is deprecated and will be prohibited in Python 3.9. (Contributed by Elvis Pranskevichus in :issue:`34075`.)
uk: Передача об’єкта, який не є екземпляром :class:`concurrent.futures.ThreadPoolExecutor`, у :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` застаріла та буде заборонена в Python 3.9. (Надав Елвіс Пранскявічус у :issue:`34075`.)

source: The :meth:`__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput` have been deprecated.
uk: Методи :meth:`__getitem__` :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` і :class:`fileinput.FileInput` стали застарілими.

source: Implementations of these methods have been ignoring their *index* parameter, and returning the next item instead. (Contributed by Berker Peksag in :issue:`9372`.)
uk: Реалізації цих методів ігнорували параметр *index* і замість нього повертали наступний елемент. (Надано Berker Peksag у :issue:`9372`.)

source: The :class:`typing.NamedTuple` class has deprecated the ``_field_types`` attribute in favor of the ``__annotations__`` attribute which has the same information. (Contributed by Raymond Hettinger in :issue:`36320`.)
uk: Клас :class:`typing.NamedTuple` відмовився від атрибута ``_field_types`` на користь атрибута ``__annotations__``, який містить ту саму інформацію. (Надав Реймонд Геттінгер у :issue:`36320`.)

source: :mod:`ast` classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` are considered deprecated and will be removed in future Python versions. :class:`~ast.Constant` should be used instead. (Contributed by Serhiy Storchaka in :issue:`32892`.)
uk: :mod:`ast` класи ``Num``, ``Str``, ``Bytes``, ``NameConstant`` і ``Ellipsis`` вважаються застарілими та будуть видалені в майбутніх версіях Python. Замість цього слід використовувати :class:`~ast.Constant`. (Надав Сергій Сторчака в :issue:`32892`.)

source: :class:`ast.NodeVisitor` methods ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` and ``visit_Ellipsis()`` are deprecated now and will not be called in future Python versions. Add the :meth:`~ast.NodeVisitor.visit_Constant` method to handle all constant nodes. (Contributed by Serhiy Storchaka in :issue:`36917`.)
uk: :class:`ast.NodeVisitor` методи ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` та ``visit_Ellipsis()`` застаріли тепер і не буде викликатися в майбутніх версіях Python. Додайте метод :meth:`~ast.NodeVisitor.visit_Constant` для обробки всіх постійних вузлів. (Надав Сергій Сторчака в :issue:`36917`.)

source: The :func:`asyncio.coroutine` :term:`decorator` is deprecated and will be removed in version 3.10. Instead of ``@asyncio.coroutine``, use :keyword:`async def` instead. (Contributed by Andrew Svetlov in :issue:`36921`.)
uk: :func:`asyncio.coroutine` :term:`decorator` застаріло та буде видалено у версії 3.10. Замість ``@asyncio.coroutine`` використовуйте :keyword:`async def`. (Надав Ендрю Свєтлов у :issue:`36921`.)

source: In :mod:`asyncio`, the explicit passing of a *loop* argument has been deprecated and will be removed in version 3.10 for the following: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec`, and :func:`asyncio.create_subprocess_shell`.
uk: У :mod:`asyncio` явна передача аргументу *loop* застаріла та буде видалена у версії 3.10 для наступних: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio. Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec` і :func:`asyncio.create_subprocess_shell`.

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov in :issue:`34790`.)
uk: Явне передавання об’єктів співпрограми до :func:`asyncio.wait` застаріло та буде видалено у версії 3.11. (Надав Юрій Селіванов у :issue:`34790`.)

source: The following functions and methods are deprecated in the :mod:`gettext` module: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` and :func:`~gettext.ldngettext`. They return encoded bytes, and it's possible that you will get unexpected Unicode-related exceptions if there are encoding problems with the translated strings. It's much better to use alternatives which return Unicode strings in Python 3. These functions have been broken for a long time.
uk: Наступні функції та методи застаріли в модулі :mod:`gettext`: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` і :func:`~gettext.ldngettext`. Вони повертають закодовані байти, і можливо, ви отримаєте несподівані винятки, пов’язані з Unicode, якщо є проблеми з кодуванням перекладених рядків. Набагато краще використовувати альтернативи, які повертають рядки Unicode в Python 3. Ці функції давно не працюють.

source: Function :func:`~gettext.bind_textdomain_codeset`, methods :meth:`~gettext.NullTranslations.output_charset` and :meth:`~gettext.NullTranslations.set_output_charset`, and the *codeset* parameter of functions :func:`~gettext.translation` and :func:`~gettext.install` are also deprecated, since they are only used for the ``l*gettext()`` functions. (Contributed by Serhiy Storchaka in :issue:`33710`.)
uk: Функція :func:`~gettext.bind_textdomain_codeset`, методи :meth:`~gettext.NullTranslations.output_charset` і :meth:`~gettext.NullTranslations.set_output_charset`, а також параметр *codeset* функцій :func:`~gettext .translation` і :func:`~gettext.install` також застаріли, оскільки вони використовуються лише для функцій ``l*gettext()``. (Надав Сергій Сторчака в :issue:`33710`.)

source: The :meth:`~threading.Thread.isAlive()` method of :class:`threading.Thread` has been deprecated. (Contributed by Dong-hee Na in :issue:`35283`.)
uk: Метод :meth:`~threading.Thread.isAlive()` для :class:`threading.Thread` визнано застарілим. (Надав Dong-hee Na у :issue:`35283`.)

source: Many builtin and extension functions that take integer arguments will now emit a deprecation warning for :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and any other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). In future version they will be errors. (Contributed by Serhiy Storchaka in :issue:`36048`.)
uk: Багато вбудованих функцій і функцій розширення, які приймають цілі аргументи, тепер видаватимуть попередження про застаріленість для :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s та будь-яких інших об’єктів, які можна перетворити лише на цілі числа із втратою (наприклад, які мають метод :meth:`~object.__int__`, але не мають методу :meth:`~object.__index__`). У наступній версії вони будуть помилками. (Надав Сергій Сторчака в :issue:`36048`.)

source: Deprecated passing the following arguments as keyword arguments:
uk: Застаріло передавати такі аргументи як аргументи ключового слова:

source: *func* in :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb.Bdb.runcall`, :meth:`trace.Trace.runfunc` and :func:`curses.wrapper`.
uk: *func* у :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb. Bdb.runcall`, :meth:`trace.Trace.runfunc` і :func:`curses.wrapper`.

source: *function* in :meth:`unittest.TestCase.addCleanup`.
uk: *функція* в :meth:`unittest.TestCase.addCleanup`.

source: *fn* in the :meth:`~concurrent.futures.Executor.submit` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor`.
uk: *fn* у методі :meth:`~concurrent.futures.Executor.submit` :class:`concurrent.futures.ThreadPoolExecutor` і :class:`concurrent.futures.ProcessPoolExecutor`.

source: *callback* in :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` and :meth:`contextlib.AsyncExitStack.push_async_callback`.
uk: *зворотний виклик* у :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` і :meth:`contextlib.AsyncExitStack.push_async_callback`.

source: *c* and *typeid* in the :meth:`~multiprocessing.managers.Server.create` method of :class:`multiprocessing.managers.Server` and :class:`multiprocessing.managers.SharedMemoryServer`.
uk: *c* і *typeid* у методі :meth:`~multiprocessing.managers.Server.create` :class:`multiprocessing.managers.Server` і :class:`multiprocessing.managers.SharedMemoryServer`.

source: *obj* in :func:`weakref.finalize`.
uk: *obj* у :func:`weakref.finalize`.

source: In future releases of Python, they will be :ref:`positional-only <positional-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`36492`.)
uk: У майбутніх випусках Python вони будуть :ref:`позиційними лише <positional-only_parameter>`. (Надав Сергій Сторчака в :issue:`36492`.)

source: API and Feature Removals
uk: Видалення API та функцій

source: The following features and APIs have been removed from Python 3.8:
uk: З Python 3.8 видалено наступні функції та API:

source: Starting with Python 3.3, importing ABCs from :mod:`collections` was deprecated, and importing should be done from :mod:`collections.abc`. Being able to import from collections was marked for removal in 3.8, but has been delayed to 3.9. (See :issue:`36952`.)
uk: Починаючи з Python 3.3, імпорт азбуки з :mod:`collections` був застарілим, і імпорт повинен здійснюватися з :mod:`collections.abc`. Можливість імпортувати з колекцій було позначено для видалення у версії 3.8, але відкладено до версії 3.9. (Див. :issue:`36952`.)

source: The :mod:`macpath` module, deprecated in Python 3.7, has been removed. (Contributed by Victor Stinner in :issue:`35471`.)
uk: Модуль :mod:`macpath`, застарілий у Python 3.7, було видалено. (Надав Віктор Стіннер у :issue:`35471`.)

source: The function :func:`platform.popen` has been removed, after having been deprecated since Python 3.3: use :func:`os.popen` instead. (Contributed by Victor Stinner in :issue:`35345`.)
uk: Функцію :func:`platform.popen` було видалено після того, як вона була застарілою з Python 3.3: замість неї використовуйте :func:`os.popen`. (Надав Віктор Стіннер у :issue:`35345`.)

source: The function :func:`time.clock` has been removed, after having been deprecated since Python 3.3: use :func:`time.perf_counter` or :func:`time.process_time` instead, depending on your requirements, to have well-defined behavior. (Contributed by Matthias Bussonnier in :issue:`36895`.)
uk: Функцію :func:`time.clock` було видалено після того, як вона була застарілою з Python 3.3: використовуйте замість неї :func:`time.perf_counter` або :func:`time.process_time`, залежно від ваших вимог, щоб добре працювати - визначена поведінка. (Надано Матіасом Бюссонньєром у :issue:`36895`.)

source: The ``pyvenv`` script has been removed in favor of ``python3.8 -m venv`` to help eliminate confusion as to what Python interpreter the ``pyvenv`` script is tied to. (Contributed by Brett Cannon in :issue:`25427`.)
uk: Сценарій ``pyvenv`` було видалено на користь ``python3.8 -m venv``, щоб допомогти усунути плутанину щодо того, до якого інтерпретатора Python прив’язаний сценарій ``pyvenv``. (Надав Бретт Кеннон у :issue:`25427`.)

source: ``parse_qs``, ``parse_qsl``, and ``escape`` are removed from the :mod:`cgi` module. They are deprecated in Python 3.2 or older. They should be imported from the ``urllib.parse`` and ``html`` modules instead.
uk: ``parse_qs``, ``parse_qsl`` і ``escape`` видаляються з модуля :mod:`cgi`. Вони застаріли в Python 3.2 або старіших версіях. Натомість їх слід імпортувати з модулів ``urllib.parse`` і ``html``.

source: ``filemode`` function is removed from the :mod:`tarfile` module. It is not documented and deprecated since Python 3.3.
uk: Функцію ``filemode`` видалено з модуля :mod:`tarfile`. Він не задокументований і не підтримується, починаючи з Python 3.3.

source: The :class:`~xml.etree.ElementTree.XMLParser` constructor no longer accepts the *html* argument. It never had an effect and was deprecated in Python 3.4. All other parameters are now :ref:`keyword-only <keyword-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
uk: Конструктор :class:`~xml.etree.ElementTree.XMLParser` більше не приймає аргумент *html*. Це ніколи не мало ефекту та було застарілим у Python 3.4. Усі інші параметри тепер :ref:`лише для ключових слів <keyword-only_parameter>`. (Надав Сергій Сторчака в :issue:`29209`.)

source: Removed the ``doctype()`` method of :class:`~xml.etree.ElementTree.XMLParser`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
uk: Видалено метод ``doctype()`` :class:`~xml.etree.ElementTree.XMLParser`. (Надав Сергій Сторчака в :issue:`29209`.)

source: "unicode_internal" codec is removed. (Contributed by Inada Naoki in :issue:`36297`.)
uk: Кодек "unicode_internal" видалено. (Надано Інадою Наокі в :issue:`36297`.)

source: The ``Cache`` and ``Statement`` objects of the :mod:`sqlite3` module are not exposed to the user. (Contributed by Aviv Palivoda in :issue:`30262`.)
uk: Об’єкти ``Cache`` і ``Statement`` модуля :mod:`sqlite3` не доступні для користувача. (Надав Авів Паливода в :issue:`30262`.)

source: The ``bufsize`` keyword argument of :func:`fileinput.input` and :func:`fileinput.FileInput` which was ignored and deprecated since Python 3.6 has been removed. :issue:`36952` (Contributed by Matthias Bussonnier.)
uk: Аргумент ключового слова ``bufsize`` :func:`fileinput.input` і :func:`fileinput.FileInput`, який ігнорувався та не підтримувався з Python 3.6, було видалено. :issue:`36952` (Надав Матіас Бюссонньє.)

source: The functions :func:`sys.set_coroutine_wrapper` and :func:`sys.get_coroutine_wrapper` deprecated in Python 3.7 have been removed; :issue:`36933` (Contributed by Matthias Bussonnier.)
uk: Функції :func:`sys.set_coroutine_wrapper` і :func:`sys.get_coroutine_wrapper`, які застаріли в Python 3.7, видалено; :issue:`36933` (Надав Матіас Бюссонньє.)

source: Porting to Python 3.8
uk: Перенесення на Python 3.8

source: This section lists previously described changes and other bugfixes that may require changes to your code.
uk: У цьому розділі наведено описані раніше зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді.

source: Changes in Python behavior
uk: Зміни в поведінці Python

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now disallowed in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). (Contributed by Serhiy Storchaka in :issue:`10544`.)
uk: Вирази yield (як ``yield``, так і ``yield from`` пункти тепер заборонені у виразах розуміння та генераторі (окрім ітераційного виразу в крайньому лівому пункті :keyword:`!for`). (Надав Сергій Сторчака в :issue:`10544`.)

source: The compiler now produces a :exc:`SyntaxWarning` when identity checks (``is`` and ``is not``) are used with certain types of literals (e.g. strings, numbers). These can often work by accident in CPython, but are not guaranteed by the language spec. The warning advises users to use equality tests (``==`` and ``!=``) instead. (Contributed by Serhiy Storchaka in :issue:`34850`.)
uk: Тепер компілятор створює :exc:`SyntaxWarning`, коли перевірки ідентичності (``is`` і ``is not``) використовуються з певними типами літералів (наприклад, рядки, числа). Вони часто можуть працювати випадково в CPython, але не гарантуються специфікацією мови. Застереження рекомендує користувачам замість цього використовувати тести рівності (``==`` і ``!=``). (Надав Сергій Сторчака в :issue:`34850`.)

source: The CPython interpreter can swallow exceptions in some circumstances. In Python 3.8 this happens in fewer cases. In particular, exceptions raised when getting the attribute from the type dictionary are no longer ignored. (Contributed by Serhiy Storchaka in :issue:`35459`.)
uk: Інтерпретатор CPython може ковтати винятки за деяких обставин. У Python 3.8 це відбувається в меншій кількості випадків. Зокрема, винятки, викликані під час отримання атрибута зі словника типів, більше не ігноруються. (Надав Сергій Сторчака в :issue:`35459`.)

source: Removed ``__str__`` implementations from builtin types :class:`bool`, :class:`int`, :class:`float`, :class:`complex` and few classes from the standard library. They now inherit ``__str__()`` from :class:`object`. As result, defining the ``__repr__()`` method in the subclass of these classes will affect their string representation. (Contributed by Serhiy Storchaka in :issue:`36793`.)
uk: Видалено реалізації ``__str__`` із вбудованих типів :class:`bool`, :class:`int`, :class:`float`, :class:`complex` і кількох класів зі стандартної бібліотеки. Тепер вони успадковують ``__str__()`` від :class:`object`. Як наслідок, визначення методу ``__repr__()`` у підкласі цих класів вплине на їхнє представлення рядків. (Надав Сергій Сторчака в :issue:`36793`.)

source: On AIX, :attr:`sys.platform` doesn't contain the major version anymore. It is always ``'aix'``, instead of ``'aix3'`` .. ``'aix7'``. Since older Python versions include the version number, so it is recommended to always use ``sys.platform.startswith('aix')``. (Contributed by M. Felt in :issue:`36588`.)
uk: В AIX :attr:`sys.platform` більше не містить основної версії. Це завжди ``'aix'`` замість ``'aix3''`` .. ``'aix7''``. Оскільки старіші версії Python містять номер версії, тому рекомендується завжди використовувати ``sys.platform.startswith('aix')``. (Надав М. Фелт у :issue:`36588`.)

source: :c:func:`PyEval_AcquireLock` and :c:func:`PyEval_AcquireThread` now terminate the current thread if called while the interpreter is finalizing, making them consistent with :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS`, and :c:func:`PyGILState_Ensure`. If this behavior is not desired, guard the call by checking :c:func:`_Py_IsFinalizing` or :c:func:`sys.is_finalizing`. (Contributed by Joannah Nanjekye in :issue:`36475`.)
uk: :c:func:`PyEval_AcquireLock` і :c:func:`PyEval_AcquireThread` тепер припиняють поточний потік, якщо викликаються під час завершення інтерпретатора, що робить їх сумісними з :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS` і :c:func:`PyGILState_Ensure`. Якщо така поведінка небажана, захистіть виклик, позначивши :c:func:`_Py_IsFinalizing` або :c:func:`sys.is_finalizing`. (Надано Joannah Nanjekye у :issue:`36475`.)

source: Changes in the Python API
uk: Зміни в API Python

source: The :func:`os.getcwdb` function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows. (Contributed by Victor Stinner in :issue:`37412`.)
uk: Функція :func:`os.getcwdb` тепер використовує кодування UTF-8 у Windows, а не кодову сторінку ANSI: див. :pep:`529` для обґрунтування. Ця функція більше не підтримується в Windows. (Надав Віктор Стіннер у :issue:`37412`.)
