Repository: python/python-docs-uk
Catalog: whatsnew/3.9.po
Languages: uk

source: What's New In Python 3.9
uk: Що нового в Python 3.9

source: Release
uk: Реліз

source: Date
uk: Дата

source: Editor
uk: редактор

source: This article explains the new features in Python 3.9, compared to 3.8. Python 3.9 was released on October 5, 2020.
uk: У цій статті пояснюється нові функції в Python 3.9 порівняно з 3.8. Python 3.9 було випущено 5 жовтня 2020 року.

source: For full details, see the :ref:`changelog <changelog>`.
uk: Щоб отримати повну інформацію, перегляньте :ref:`журнал змін <changelog>`.

source: :pep:`596` - Python 3.9 Release Schedule
uk: :pep:`596` - Графік випуску Python 3.9

source: Summary -- Release highlights
uk: Підсумок – основні моменти випуску

source: New syntax features:
uk: Нові функції синтаксису:

source: :pep:`584`, union operators added to ``dict``;
uk: :pep:`584`, оператори об’єднання додано до ``dict``;

source: :pep:`585`, type hinting generics in standard collections;
uk: :pep:`585`, генерики підказок типів у стандартних колекціях;

source: :pep:`614`, relaxed grammar restrictions on decorators.
uk: :pep:`614`, послаблені граматичні обмеження для декораторів.

source: New built-in features:
uk: Нові вбудовані функції:

source: :pep:`616`, string methods to remove prefixes and suffixes.
uk: :pep:`616`, рядкові методи для видалення префіксів і суфіксів.

source: New features in the standard library:
uk: Нові можливості стандартної бібліотеки:

source: :pep:`593`, flexible function and variable annotations;
uk: :pep:`593`, гнучка функція та анотації змінних;

source: :func:`os.pidfd_open` added that allows process management without races and signals.
uk: :func:`os.pidfd_open` додано, що дозволяє керувати процесом без гонок і сигналів.

source: Interpreter improvements:
uk: Покращення перекладача:

source: :pep:`573`, fast access to module state from methods of C extension types;
uk: :pep:`573`, швидкий доступ до стану модуля з методів типів розширення C;

source: :pep:`617`, CPython now uses a new parser based on PEG;
uk: :pep:`617`, CPython тепер використовує новий аналізатор на основі PEG;

source: a number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using :pep:`590` vectorcall;
uk: ряд вбудованих компонентів Python (діапазон, кортеж, набір, заморожений набір, список, dict) тепер пришвидшено за допомогою :pep:`590` vectorcall;

source: garbage collection does not block on resurrected objects;
uk: збір сміття не блокується на відроджених об'єктах;

source: a number of Python modules (:mod:`_abc`, :mod:`audioop`, :mod:`_bz2`, :mod:`_codecs`, :mod:`_contextvars`, :mod:`_crypt`, :mod:`_functools`, :mod:`_json`, :mod:`_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`_weakref`) now use multiphase initialization as defined by PEP 489;
uk: декілька модулів Python (:mod:`_abc`, :mod:`audioop`, :mod:`_bz2`, :mod:`_codecs`, :mod:`_contextvars`, :mod:`_crypt`, :mod:`_functools`, :mod:`_json`, :mod:`_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`_weakref`) тепер використовує багатофазову ініціалізацію, як визначено PEP 489;

source: a number of standard library modules (:mod:`audioop`, :mod:`ast`, :mod:`grp`, :mod:`_hashlib`, :mod:`pwd`, :mod:`_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) are now using the stable ABI defined by PEP 384.
uk: кілька стандартних бібліотечних модулів (:mod:`audioop`, :mod:`ast`, :mod:`grp`, :mod:`_hashlib`, :mod:`pwd`, :mod:`_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) тепер використовують стабільний ABI, визначений PEP 384.

source: New library modules:
uk: Нові бібліотечні модулі:

source: :pep:`615`, the IANA Time Zone Database is now present in the standard library in the :mod:`zoneinfo` module;
uk: :pep:`615`, база даних часових поясів IANA тепер присутня в стандартній бібліотеці в модулі :mod:`zoneinfo`;

source: an implementation of a topological sort of a graph is now provided in the new :mod:`graphlib` module.
uk: реалізація топологічного сортування графа тепер доступна в новому модулі :mod:`graphlib`.

source: Release process changes:
uk: Зміни в процесі випуску:

source: :pep:`602`, CPython adopts an annual release cycle.
uk: :pep:`602`, CPython використовує щорічний цикл випуску.

source: You should check for DeprecationWarning in your code
uk: Вам слід перевірити DeprecationWarning у вашому коді

source: When Python 2.7 was still supported, a lot of functionality in Python 3 was kept for backward compatibility with Python 2.7. With the end of Python 2 support, these backward compatibility layers have been removed, or will be removed soon. Most of them emitted a :exc:`DeprecationWarning` warning for several years. For example, using ``collections.Mapping`` instead of ``collections.abc.Mapping`` emits a :exc:`DeprecationWarning` since Python 3.3, released in 2012.
uk: Коли Python 2.7 ще підтримувався, багато функціональних можливостей Python 3 було збережено для зворотної сумісності з Python 2.7. З припиненням підтримки Python 2 ці рівні зворотної сумісності були видалені або будуть видалені незабаром. Більшість із них видавали попередження :exc:`DeprecationWarning` протягом кількох років. Наприклад, використання ``collections.Mapping`` замість ``collections.abc.Mapping`` видає :exc:`DeprecationWarning`, починаючи з Python 3.3, випущеного в 2012 році.

source: Test your application with the :option:`-W` ``default`` command-line option to see :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning`, or even with :option:`-W` ``error`` to treat them as errors. :ref:`Warnings Filter <warning-filter>` can be used to ignore warnings from third-party code.
uk: Перевірте свою програму за допомогою параметра командного рядка :option:`-W` ``default``, щоб побачити :exc:`DeprecationWarning` і :exc:`PendingDeprecationWarning`, або навіть за допомогою :option:`-W` ``error`` розглядати їх як помилки. :ref:`Фільтр попереджень <warning-filter>` можна використовувати для ігнорування попереджень від стороннього коду.

source: Python 3.9 is the last version providing those Python 2 backward compatibility layers, to give more time to Python projects maintainers to organize the removal of the Python 2 support and add support for Python 3.9.
uk: Python 3.9 є останньою версією, яка забезпечує рівні зворотної сумісності Python 2, щоб дати більше часу супроводжувачам проектів Python для організації видалення підтримки Python 2 і додавання підтримки для Python 3.9.

source: Aliases to :ref:`Abstract Base Classes <collections-abstract-base-classes>` in the :mod:`collections` module, like ``collections.Mapping`` alias to :class:`collections.abc.Mapping`, are kept for one last release for backward compatibility. They will be removed from Python 3.10.
uk: Псевдоніми :ref:`Abstract Base Classes <collections-abstract-base-classes>` в модулі :mod:`collections`, як-от псевдонім ``collections.Mapping`` для :class:`collections.abc.Mapping`, зберігаються для останнього випуску для повернення сумісність. Їх буде видалено з Python 3.10.

source: More generally, try to run your tests in the :ref:`Python Development Mode <devmode>` which helps to prepare your code to make it compatible with the next Python version.
uk: Загалом, спробуйте запустити свої тести в режимі :ref:`Python Development Mode <devmode>`, який допоможе підготувати ваш код до сумісності з наступною версією Python.

source: Note: a number of pre-existing deprecations were removed in this version of Python as well. Consult the :ref:`removed-in-python-39` section.
uk: Примітка: у цій версії Python також було видалено низку існуючих застарілих програм. Зверніться до розділу :ref:`removed-in-python-39`.

source: New Features
uk: Нові можливості

source: Dictionary Merge & Update Operators
uk: Оператори злиття та оновлення словника

source: Merge (``|``) and update (``|=``) operators have been added to the built-in :class:`dict` class. Those complement the existing ``dict.update`` and ``{**d1, **d2}`` methods of merging dictionaries.
uk: До вбудованого класу :class:`dict` додано оператори Merge (``|``) і Update (``|=``). Вони доповнюють існуючі методи об’єднання словників ``dict.update`` і ``{**d1, **d2}``.

source: Example::
uk: Приклад::

source: See :pep:`584` for a full description. (Contributed by Brandt Bucher in :issue:`36144`.)
uk: Дивіться :pep:`584` для повного опису. (Надав Брандт Бухер у :issue:`36144`.)

source: New String Methods to Remove Prefixes and Suffixes
uk: Нові рядкові методи для видалення префіксів і суфіксів

source: :meth:`str.removeprefix(prefix)<str.removeprefix>` and :meth:`str.removesuffix(suffix)<str.removesuffix>` have been added to easily remove an unneeded prefix or a suffix from a string. Corresponding ``bytes``, ``bytearray``, and ``collections.UserString`` methods have also been added. See :pep:`616` for a full description. (Contributed by Dennis Sweeney in :issue:`39939`.)
uk: Додано :meth:`str.removeprefix(prefix) <str.removeprefix>` і :meth:`str.removesuffix(suffix) <str.removesuffix>`, щоб легко видалити непотрібний префікс або суфікс із рядка. Також додано відповідні методи ``bytes``, ``bytearray`` і ``collections.UserString``. Дивіться :pep:`616` для повного опису. (Надав Денніс Суїні в :issue:`39939`.)

source: Type Hinting Generics in Standard Collections
uk: Універсальні підказки типів у стандартних колекціях

source: In type annotations you can now use built-in collection types such as ``list`` and ``dict`` as generic types instead of importing the corresponding capitalized types (e.g. ``List`` or ``Dict``) from ``typing``. Some other types in the standard library are also now generic, for example ``queue.Queue``.
uk: В анотаціях типів тепер можна використовувати вбудовані типи колекцій, такі як ``list`` і ``dict``, як загальні типи замість імпорту відповідних типів, написаних великими літерами (наприклад, ``List`` або ``Dict``) із ``введення``. Деякі інші типи стандартної бібліотеки також тепер є загальними, наприклад ``queue.Queue``.

source: Example:
uk: приклад:

source: See :pep:`585` for more details. (Contributed by Guido van Rossum, Ethan Smith, and Batuhan Taşkaya in :issue:`39481`.)
uk: Дивіться :pep:`585` для більш детальної інформації. (Надано Гвідо ван Россумом, Ітаном Смітом і Батуханом Ташкаєю в :issue:`39481`.)

source: New Parser
uk: Новий парсер

source: Python 3.9 uses a new parser, based on `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ instead of `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. The new parser's performance is roughly comparable to that of the old parser, but the PEG formalism is more flexible than LL(1) when it comes to designing new language features. We'll start using this flexibility in Python 3.10 and later.
uk: Python 3.9 використовує новий аналізатор на основі `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ замість `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. Продуктивність нового синтаксичного аналізатора приблизно порівнянна з продуктивністю старого парсера, але формалізм PEG є більш гнучким, ніж LL(1), коли справа доходить до розробки нових функцій мови. Ми почнемо використовувати цю гнучкість у Python 3.10 і пізніших версіях.

source: The :mod:`ast` module uses the new parser and produces the same AST as the old parser.
uk: Модуль :mod:`ast` використовує новий аналізатор і створює той самий AST, що й старий аналізатор.

source: In Python 3.10, the old parser will be deleted and so will all functionality that depends on it (primarily the :mod:`parser` module, which has long been deprecated). In Python 3.9 *only*, you can switch back to the LL(1) parser using a command line switch (``-X oldparser``) or an environment variable (``PYTHONOLDPARSER=1``).
uk: У Python 3.10 старий синтаксичний аналізатор буде видалено, а також усі функціональні можливості, які від нього залежать (передусім модуль :mod:`parser`, який уже давно застарів). Лише в Python 3.9 ви можете повернутися до синтаксичного аналізатора LL(1) за допомогою параметра командного рядка (``-X oldparser``) або змінної середовища (``PYTHONOLDPARSER=1``).

source: See :pep:`617` for more details. (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`40334`.)
uk: Дивіться :pep:`617` для більш детальної інформації. (Надано Гвідо ван Россумом, Пабло Галіндо та Лісандросом Ніколау в :issue:`40334`.)

source: Other Language Changes
uk: Інші зміни мови

source: :func:`__import__` now raises :exc:`ImportError` instead of :exc:`ValueError`, which used to occur when a relative import went past its top-level package. (Contributed by Ngalim Siregar in :issue:`37444`.)
uk: :func:`__import__` тепер викликає :exc:`ImportError` замість :exc:`ValueError`, який раніше траплявся, коли відносний імпорт проходив поза пакетом верхнього рівня. (Надав Нгалім Сірегар у :issue:`37444`.)

source: Python now gets the absolute path of the script filename specified on the command line (ex: ``python3 script.py``): the ``__file__`` attribute of the :mod:`__main__` module became an absolute path, rather than a relative path. These paths now remain valid after the current directory is changed by :func:`os.chdir`. As a side effect, the traceback also displays the absolute path for :mod:`__main__` module frames in this case. (Contributed by Victor Stinner in :issue:`20443`.)
uk: Тепер Python отримує абсолютний шлях до імені файлу сценарію, указаного в командному рядку (наприклад: ``python3 script.py``): атрибут ``__file__`` модуля :mod:`__main__` став абсолютним шляхом, а не ніж відносний шлях. Тепер ці шляхи залишаються дійсними після того, як поточний каталог змінено :func:`os.chdir`. Як побічний ефект, у цьому випадку трасування також відображає абсолютний шлях для фреймів модуля :mod:`__main__`. (Надав Віктор Стіннер у :issue:`20443`.)

source: In the :ref:`Python Development Mode <devmode>` and in :ref:`debug build <debug-build>`, the *encoding* and *errors* arguments are now checked for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
uk: У режимі :ref:`Python Development Mode <devmode>` і в :ref:`debug build <debug-build>`, аргументи *encoding* і *errors* тепер перевіряються на наявність операцій кодування та декодування рядків. Приклади: :func:`open`, :meth:`str.encode` і :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings. (Contributed by Victor Stinner in :issue:`37388`.)
uk: За замовчуванням для найкращої продуктивності аргумент *errors* перевіряється лише при першій помилці кодування/декодування, а аргумент *encoding* іноді ігнорується для порожніх рядків. (Надав Віктор Стіннер у :issue:`37388`.)

source: ``"".replace("", s, n)`` now returns ``s`` instead of an empty string for all non-zero ``n``. It is now consistent with ``"".replace("", s)``. There are similar changes for :class:`bytes` and :class:`bytearray` objects. (Contributed by Serhiy Storchaka in :issue:`28029`.)
uk: ``"".replace("", s, n)`` тепер повертає ``s`` замість порожнього рядка для всіх ненульових ``n``. Тепер це сумісно з ``"".replace("", s)``. Існують подібні зміни для об’єктів :class:`bytes` і :class:`bytearray`. (Надав Сергій Сторчака в :issue:`28029`.)

source: Any valid expression can now be used as a :term:`decorator`. Previously, the grammar was much more restrictive. See :pep:`614` for details. (Contributed by Brandt Bucher in :issue:`39702`.)
uk: Будь-який дійсний вираз тепер можна використовувати як :term:`decorator`. Раніше граматика була набагато жорсткішою. Подробиці див. :pep:`614`. (Надав Брандт Бухер у :issue:`39702`.)

source: Improved help for the :mod:`typing` module. Docstrings are now shown for all special forms and special generic aliases (like ``Union`` and ``List``). Using :func:`help` with generic alias like ``List[int]`` will show the help for the correspondent concrete type (``list`` in this case). (Contributed by Serhiy Storchaka in :issue:`40257`.)
uk: Покращена довідка для модуля :mod:`typing`. Рядки документів тепер відображаються для всіх спеціальних форм і спеціальних загальних псевдонімів (наприклад, ``Union`` і ``List``). Використання :func:`help` із загальним псевдонімом, таким як ``List[int]``, покаже довідку для відповідного конкретного типу (``list`` у цьому випадку). (Надав Сергій Сторчака в :issue:`40257`.)

source: Parallel running of :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` is now prohibited, and ``ag_running`` now reflects the actual running status of the async generator. (Contributed by Yury Selivanov in :issue:`30773`.)
uk: Паралельний запуск :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` тепер заборонено, а ``ag_running`` тепер відображає фактичний статус роботи асинхронний генератор. (Надав Юрій Селіванов у :issue:`30773`.)

source: Unexpected errors in calling the ``__iter__`` method are no longer masked by ``TypeError`` in the :keyword:`in` operator and functions :func:`~operator.contains`, :func:`~operator.indexOf` and :func:`~operator.countOf` of the :mod:`operator` module. (Contributed by Serhiy Storchaka in :issue:`40824`.)
uk: Неочікувані помилки під час виклику методу ``__iter__`` більше не маскуються ``TypeError`` в операторі :keyword:`in` і функціях :func:`~operator.contains`, :func:`~operator.indexOf` і :func:`~operator.countOf` модуля :mod:`operator`. (Надав Сергій Сторчака в :issue:`40824`.)

source: Unparenthesized lambda expressions can no longer be the expression part in an ``if`` clause in comprehensions and generator expressions. See :issue:`41848` and :issue:`43755` for details.
uk: Лямбда-вирази без круглих дужок більше не можуть бути частиною виразу в реченні ``if`` у виразах розуміння та генераторі. Дивіться :issue:`41848` і :issue:`43755` для отримання додаткової інформації.

source: New Modules
uk: Нові модулі

source: zoneinfo
uk: зонаінфо

source: The :mod:`zoneinfo` module brings support for the IANA time zone database to the standard library. It adds :class:`zoneinfo.ZoneInfo`, a concrete :class:`datetime.tzinfo` implementation backed by the system's time zone data.
uk: Модуль :mod:`zoneinfo` забезпечує підтримку бази даних часових поясів IANA до стандартної бібліотеки. Він додає :class:`zoneinfo.ZoneInfo`, конкретну реалізацію :class:`datetime.tzinfo`, яка підтримується даними про часовий пояс системи.

source: As a fall-back source of data for platforms that don't ship the IANA database, the |tzdata|_ module was released as a first-party package -- distributed via PyPI and maintained by the CPython core team.
uk: Як резервне джерело даних для платформ, які не постачають базу даних IANA, модуль |tzdata|_ було випущено як пакет першої сторони, який поширюється через PyPI та підтримується основною командою CPython.

source: :pep:`615` -- Support for the IANA Time Zone Database in the Standard Library
uk: :pep:`615` -- Підтримка бази даних часових поясів IANA в стандартній бібліотеці

source: PEP written and implemented by Paul Ganssle
uk: PEP написаний і реалізований Полом Ганссле

source: A new module, :mod:`graphlib`, was added that contains the :class:`graphlib.TopologicalSorter` class to offer functionality to perform topological sorting of graphs. (Contributed by Pablo Galindo, Tim Peters and Larry Hastings in :issue:`17005`.)
uk: Було додано новий модуль :mod:`graphlib`, який містить клас :class:`graphlib.TopologicalSorter`, який пропонує функції для виконання топологічного сортування графів. (Надано Пабло Галіндо, Тімом Пітерсом і Ларрі Гастінгсом у :issue:`17005`.)

source: Improved Modules
uk: Покращені модулі

source: ast
uk: аст

source: Added the *indent* option to :func:`~ast.dump` which allows it to produce a multiline indented output. (Contributed by Serhiy Storchaka in :issue:`37995`.)
uk: Додано опцію *indent* до :func:`~ast.dump`, яка дозволяє створювати багаторядковий вивід із відступом. (Надав Сергій Сторчака в :issue:`37995`.)

source: Added :func:`ast.unparse` as a function in the :mod:`ast` module that can be used to unparse an :class:`ast.AST` object and produce a string with code that would produce an equivalent :class:`ast.AST` object when parsed. (Contributed by Pablo Galindo and Batuhan Taskaya in :issue:`38870`.)
uk: Додано :func:`ast.unparse` як функцію в модулі :mod:`ast`, яку можна використовувати для розбору об’єкта :class:`ast.AST` і створення рядка з кодом, який створить еквівалентний :class:`ast.AST` об'єкт під час аналізу. (Надано Пабло Галіндо та Батуханом Таською в :issue:`38870`.)

source: Added docstrings to AST nodes that contains the ASDL signature used to construct that node. (Contributed by Batuhan Taskaya in :issue:`39638`.)
uk: До вузлів AST додано рядки документів, які містять підпис ASDL, використаний для створення цього вузла. (Надано Batuhan Taskaya в :issue:`39638`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
uk: Через серйозні проблеми безпеки параметр *reuse_address* :meth:`asyncio.loop.create_datagram_endpoint` більше не підтримується. Це через поведінку опції сокета ``SO_REUSEADDR`` в UDP. Для отримання додаткової інформації див. документацію для ``loop.create_datagram_endpoint()``. (Надано Кайлом Стенлі, Антуаном Пітру та Юрієм Селівановим у :issue:`37228`.)

source: Added a new :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` that schedules a shutdown for the default executor that waits on the :class:`~concurrent.futures.ThreadPoolExecutor` to finish closing. Also, :func:`asyncio.run` has been updated to use the new :term:`coroutine`. (Contributed by Kyle Stanley in :issue:`34037`.)
uk: Додано новий :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor`, який планує завершення роботи для виконавця за замовчуванням, який очікує завершення закриття :class:`~concurrent.futures.ThreadPoolExecutor`. Крім того, :func:`asyncio.run` було оновлено, щоб використовувати нову :term:`coroutine`. (Надав Кайл Стенлі в :issue:`34037`.)

source: Added :class:`asyncio.PidfdChildWatcher`, a Linux-specific child watcher implementation that polls process file descriptors. (:issue:`38692`)
uk: Додано :class:`asyncio.PidfdChildWatcher`, реалізацію дочірнього спостерігача для Linux, яка опитує дескриптори файлів процесу. (:issue:`38692`)

source: Added a new :term:`coroutine` :func:`asyncio.to_thread`. It is mainly used for running IO-bound functions in a separate thread to avoid blocking the event loop, and essentially works as a high-level version of :meth:`~asyncio.loop.run_in_executor` that can directly take keyword arguments. (Contributed by Kyle Stanley and Yury Selivanov in :issue:`32309`.)
uk: Додано нову :term:`coroutine` :func:`asyncio.to_thread`. Він в основному використовується для запуску функцій, пов’язаних із введенням-виведенням, в окремому потоці, щоб уникнути блокування циклу подій, і, по суті, працює як високорівнева версія :meth:`~asyncio.loop.run_in_executor`, яка може безпосередньо приймати ключові аргументи. (Надано Кайлом Стенлі та Юрієм Селівановим у :issue:`32309`.)
