Repository: python/python-docs-uk
Catalog: whatsnew/3.9.po
Languages: uk

source: ``base64.encodestring()`` and ``base64.decodestring()``, aliases deprecated since Python 3.1, have been removed: use :func:`base64.encodebytes` and :func:`base64.decodebytes` instead. (Contributed by Victor Stinner in :issue:`39351`.)
uk: ``base64.encodestring()`` і ``base64.decodestring()``, псевдоніми, які застаріли з Python 3.1, були видалені: замість них використовуйте :func:`base64.encodebytes` і :func:`base64.decodebytes`. (Надав Віктор Стіннер у :issue:`39351`.)

source: ``fractions.gcd()`` function has been removed, it was deprecated since Python 3.5 (:issue:`22486`): use :func:`math.gcd` instead. (Contributed by Victor Stinner in :issue:`39350`.)
uk: Функцію ``fractions.gcd()`` видалено, вона застаріла з Python 3.5 (:issue:`22486`): замість неї використовуйте :func:`math.gcd`. (Надав Віктор Стіннер у :issue:`39350`.)

source: The *buffering* parameter of :class:`bz2.BZ2File` has been removed. Since Python 3.0, it was ignored and using it emitted a :exc:`DeprecationWarning`. Pass an open file object to control how the file is opened. (Contributed by Victor Stinner in :issue:`39357`.)
uk: Параметр *buffering* :class:`bz2.BZ2File` було видалено. Починаючи з Python 3.0, він ігнорувався, і його використання видавало :exc:`DeprecationWarning`. Передайте відкритий файловий об’єкт, щоб контролювати, як відкривається файл. (Надав Віктор Стіннер у :issue:`39357`.)

source: The *encoding* parameter of :func:`json.loads` has been removed. As of Python 3.1, it was deprecated and ignored; using it has emitted a :exc:`DeprecationWarning` since Python 3.8. (Contributed by Inada Naoki in :issue:`39377`)
uk: Параметр *encoding* :func:`json.loads` видалено. Починаючи з Python 3.1, він був застарілим і ігнорувався; його використання видавало :exc:`DeprecationWarning`, починаючи з Python 3.8. (Надано Інадою Наокі в :issue:`39377`)

source: ``with (await asyncio.lock):`` and ``with (yield from asyncio.lock):`` statements are not longer supported, use ``async with lock`` instead. The same is correct for ``asyncio.Condition`` and ``asyncio.Semaphore``. (Contributed by Andrew Svetlov in :issue:`34793`.)
uk: Оператори ``with (чекати asyncio.lock):`` і ``with (вихід від asyncio.lock):`` більше не підтримуються, використовуйте замість них ``async with lock``. Те саме правильно для ``asyncio.Condition`` і ``asyncio.Semaphore``. (Надав Ендрю Свєтлов у :issue:`34793`.)

source: The :func:`sys.getcounts` function, the ``-X showalloccount`` command line option and the ``show_alloc_count`` field of the C structure :c:type:`PyConfig` have been removed. They required a special Python build by defining ``COUNT_ALLOCS`` macro. (Contributed by Victor Stinner in :issue:`39489`.)
uk: Функцію :func:`sys.getcounts`, параметр командного рядка ``-X showalloccount`` і поле ``show_alloc_count`` структури C :c:type:`PyConfig` видалено. Їм потрібна була спеціальна збірка Python із визначенням макросу ``COUNT_ALLOCS``. (Надав Віктор Стіннер у :issue:`39489`.)

source: The ``_field_types`` attribute of the :class:`typing.NamedTuple` class has been removed. It was deprecated since Python 3.8. Use the ``__annotations__`` attribute instead. (Contributed by Serhiy Storchaka in :issue:`40182`.)
uk: Атрибут ``_field_types`` класу :class:`typing.NamedTuple` було видалено. Він був застарілим, починаючи з Python 3.8. Натомість використовуйте атрибут ``__annotations__``. (Надав Сергій Сторчака в :issue:`40182`.)

source: The :meth:`symtable.SymbolTable.has_exec` method has been removed. It was deprecated since 2006, and only returning ``False`` when it's called. (Contributed by Batuhan Taskaya in :issue:`40208`)
uk: Метод :meth:`symtable.SymbolTable.has_exec` видалено. Він застарів з 2006 року, і повертає лише ``False`` під час виклику. (Надано Batuhan Taskaya в :issue:`40208`)

source: The :meth:`asyncio.Task.current_task` and :meth:`asyncio.Task.all_tasks` have been removed. They were deprecated since Python 3.7 and you can use :func:`asyncio.current_task` and :func:`asyncio.all_tasks` instead. (Contributed by Rémi Lapeyre in :issue:`40967`)
uk: :meth:`asyncio.Task.current_task` і :meth:`asyncio.Task.all_task` було видалено. Вони застаріли з Python 3.7, і замість них можна використовувати :func:`asyncio.current_task` і :func:`asyncio.all_tasks`. (Надав Ремі Лапейр у :issue:`40967`)

source: The ``unescape()`` method in the :class:`html.parser.HTMLParser` class has been removed (it was deprecated since Python 3.4). :func:`html.unescape` should be used for converting character references to the corresponding unicode characters.
uk: Метод ``unescape()`` у класі :class:`html.parser.HTMLParser` було видалено (він був застарілим з Python 3.4). :func:`html.unescape` слід використовувати для перетворення посилань на символи у відповідні символи Unicode.

source: Porting to Python 3.9
uk: Перенесення на Python 3.9

source: This section lists previously described changes and other bugfixes that may require changes to your code.
uk: У цьому розділі наведено описані раніше зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді.

source: Changes in the Python API
uk: Зміни в API Python

source: :func:`__import__` and :func:`importlib.util.resolve_name` now raise :exc:`ImportError` where it previously raised :exc:`ValueError`. Callers catching the specific exception type and supporting both Python 3.9 and earlier versions will need to catch both using ``except (ImportError, ValueError):``.
uk: :func:`__import__` і :func:`importlib.util.resolve_name` тепер викликають :exc:`ImportError` там, де раніше викликали :exc:`ValueError`. Викликачі, які перехоплюють певний тип винятку та підтримують як Python 3.9, так і попередні версії, повинні будуть перехопити обидва за допомогою ``except (ImportError, ValueError):``.

source: The :mod:`venv` activation scripts no longer special-case when ``__VENV_PROMPT__`` is set to ``""``.
uk: Скрипти активації :mod:`venv` більше не виключають особливий випадок, коли для ``__VENV_PROMPT__`` встановлено значення ``""``.

source: The :meth:`select.epoll.unregister` method no longer ignores the :data:`~errno.EBADF` error. (Contributed by Victor Stinner in :issue:`39239`.)
uk: Метод :meth:`select.epoll.unregister` більше не ігнорує помилку :data:`~errno.EBADF`. (Надав Віктор Стіннер у :issue:`39239`.)

source: The *compresslevel* parameter of :class:`bz2.BZ2File` became keyword-only, since the *buffering* parameter has been removed. (Contributed by Victor Stinner in :issue:`39357`.)
uk: Параметр *compresslevel* :class:`bz2.BZ2File` став лише ключовим словом, оскільки параметр *buffering* було видалено. (Надав Віктор Стіннер у :issue:`39357`.)

source: Simplified AST for subscription. Simple indices will be represented by their value, extended slices will be represented as tuples. ``Index(value)`` will return a ``value`` itself, ``ExtSlice(slices)`` will return ``Tuple(slices, Load())``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
uk: Спрощений AST для підписки. Прості індекси будуть представлені їх значеннями, розширені зрізи будуть представлені як кортежі. ``Index(value)`` поверне саме ``value``, ``ExtSlice(slices)`` поверне ``Tuple(slices, Load())``. (Надав Сергій Сторчака в :issue:`34822`.)

source: The :mod:`importlib` module now ignores the :envvar:`PYTHONCASEOK` environment variable when the :option:`-E` or :option:`-I` command line options are being used.
uk: Модуль :mod:`importlib` тепер ігнорує змінну середовища :envvar:`PYTHONCASEOK`, коли використовуються параметри командного рядка :option:`-E` або :option:`-I`.

source: The *encoding* parameter has been added to the classes :class:`ftplib.FTP` and :class:`ftplib.FTP_TLS` as a keyword-only parameter, and the default encoding is changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
uk: Параметр *encoding* додано до класів :class:`ftplib.FTP` і :class:`ftplib.FTP_TLS` як параметр лише для ключового слова, а стандартне кодування змінено з Latin-1 на UTF-8 на слідувати :rfc:`2640`.

source: :meth:`asyncio.loop.shutdown_default_executor` has been added to :class:`~asyncio.AbstractEventLoop`, meaning alternative event loops that inherit from it should have this method defined. (Contributed by Kyle Stanley in :issue:`34037`.)
uk: :meth:`asyncio.loop.shutdown_default_executor` додано до :class:`~asyncio.AbstractEventLoop`, тобто альтернативні цикли подій, які успадковуються від нього, повинні мати цей метод. (Надав Кайл Стенлі в :issue:`34037`.)

source: The constant values of future flags in the :mod:`__future__` module is updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :issue:`39562`)
uk: Постійні значення майбутніх прапорів у модулі :mod:`__future__` оновлюються, щоб запобігти зіткненню з прапорами компілятора. Раніше ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` конфліктував з ``CO_FUTURE_DIVISION``. (Надав Batuhan Taskaya в :issue:`39562`)

source: ``array('u')`` now uses ``wchar_t`` as C type instead of ``Py_UNICODE``. This change doesn't affect to its behavior because ``Py_UNICODE`` is alias of ``wchar_t`` since Python 3.3. (Contributed by Inada Naoki in :issue:`34538`.)
uk: ``array('u')`` тепер використовує ``wchar_t`` як тип C замість ``Py_UNICODE``. Ця зміна не впливає на його поведінку, оскільки ``Py_UNICODE`` є псевдонімом ``wchar_t``, починаючи з Python 3.3. (Надано Інадою Наокі в :issue:`34538`.)

source: The :func:`logging.getLogger` API now returns the root logger when passed the name ``'root'``, whereas previously it returned a non-root logger named ``'root'``. This could affect cases where user code explicitly wants a non-root logger named ``'root'``, or instantiates a logger using ``logging.getLogger(__name__)`` in some top-level module called ``'root.py'``. (Contributed by Vinay Sajip in :issue:`37742`.)
uk: :func:`logging.getLogger` API тепер повертає кореневий реєстратор, коли йому передається ім’я ``'root'``, тоді як раніше він повертав некореневий реєстратор під назвою ``'root'``. Це може вплинути на випадки, коли код користувача явно бажає мати некореневий реєстратор під назвою ``'root'`` або створює екземпляр реєстратора за допомогою ``logging.getLogger(__name__)`` в якомусь модулі верхнього рівня під назвою ``'root. py''``. (Надав Віней Саджип у :issue:`37742`.)

source: Division handling of :class:`~pathlib.PurePath` now returns ``NotImplemented`` instead of raising a :exc:`TypeError` when passed something other than an instance of ``str`` or :class:`~pathlib.PurePath`. This allows creating compatible classes that don't inherit from those mentioned types. (Contributed by Roger Aiudi in :issue:`34775`).
uk: Обробка ділення :class:`~pathlib.PurePath` тепер повертає ``NotImplemented`` замість того, щоб викликати :exc:`TypeError`, коли передається щось інше, ніж примірник ``str`` або :class:`~pathlib. PurePath`. Це дозволяє створювати сумісні класи, які не успадковують ці типи. (Надав Роджер Аюді в :issue:`34775`).

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notatation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros. (Contributed by Christian Heimes in :issue:`36384`).
uk: Починаючи з Python 3.9.5, модуль :mod:`ipaddress` більше не приймає жодних початкових нулів у рядках адрес IPv4. Початкові нулі є неоднозначними та інтерпретуються деякими бібліотеками як вісімкове позначення. Наприклад, застаріла функція :func:`socket.inet_aton` розглядає початкові нулі як вісімкове позначення. glibc реалізація сучасного :func:`~socket.inet_pton` не приймає жодних початкових нулів. (Надав Крістіан Хеймс у :issue:`36384`).

source: :func:`codecs.lookup` now normalizes the encoding name the same way as :func:`encodings.normalize_encoding`, except that :func:`codecs.lookup` also converts the name to lower case. For example, ``"latex+latin1"`` encoding name is now normalized to ``"latex_latin1"``. (Contributed by Jordon Xu in :issue:`37751`.)
uk: :func:`codecs.lookup` тепер нормалізує назву кодування так само, як :func:`encodings.normalize_encoding`, за винятком того, що :func:`codecs.lookup` також перетворює назву на нижній регістр. Наприклад, назву кодування ``"latex+latin1"`` тепер нормалізовано до ``"latex_latin1"``. (Надав Джордон Сю в :issue:`37751`.)

source: Changes in the C API
uk: Зміни в C API

source: Instances of :ref:`heap-allocated types <heap-types>` (such as those created with :c:func:`PyType_FromSpec` and similar APIs) hold a reference to their type object since Python 3.8. As indicated in the "Changes in the C API" of Python 3.8, for the vast majority of cases, there should be no side effect but for types that have a custom :c:member:`~PyTypeObject.tp_traverse` function, ensure that all custom ``tp_traverse`` functions of heap-allocated types visit the object's type.
uk: Екземпляри :ref:`виділених у купі типів <heap-types>` (наприклад, створених за допомогою :c:func:`PyType_FromSpec` та подібних API) містять посилання на свій об’єкт типу, починаючи з Python 3.8. Як зазначено в розділі "Зміни в API C" Python 3.8, у переважній більшості випадків побічних ефектів не повинно бути, але для типів, які мають спеціальну функцію :c:member:`~PyTypeObject.tp_traverse`, переконайтеся, що усі призначені для користувача функції ``tp_traverse`` типів, виділених у купі, відвідують тип об’єкта.

source: If your traverse function delegates to ``tp_traverse`` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only :ref:`heap type <heap-types>` are expected to visit the type in ``tp_traverse``.
uk: Якщо ваша функція переходу делегує ``tp_traverse`` свого базового класу (або іншого типу), переконайтеся, що ``Py_TYPE(self)`` відвідується лише один раз. Зауважте, що очікується, що лише :ref:`тип купи <heap-types>` відвідає тип у ``tp_traverse``.

source: For example, if your ``tp_traverse`` function includes:
uk: Наприклад, якщо ваша функція ``tp_traverse`` містить:

source: then add:
uk: потім додайте:

source: (See :issue:`35810` and :issue:`40217` for more information.)
uk: (Див. :issue:`35810` і :issue:`40217` для отримання додаткової інформації.)

source: The functions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` and ``PyEval_CallObjectWithKeywords`` are deprecated. Use :c:func:`PyObject_Call` and its variants instead. (See more details in :issue:`29548`.)
uk: Функції ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` і ``PyEval_CallObjectWithKeywords`` застаріли. Замість цього використовуйте :c:func:`PyObject_Call` та його варіанти. (Детальніше див. у :issue:`29548`.)

source: CPython bytecode changes
uk: Зміни байт-коду CPython

source: The :opcode:`LOAD_ASSERTION_ERROR` opcode was added for handling the :keyword:`assert` statement. Previously, the assert statement would not work correctly if the :exc:`AssertionError` exception was being shadowed. (Contributed by Zackery Spytz in :issue:`34880`.)
uk: Код операції :opcode:`LOAD_ASSERTION_ERROR` додано для обробки оператора :keyword:`assert`. Раніше оператор assert не працював належним чином, якщо виняток :exc:`AssertionError` затінявся. (Надав Закері Шпітц у :issue:`34880`.)

source: The :opcode:`COMPARE_OP` opcode was split into four distinct instructions:
uk: Код операції :opcode:`COMPARE_OP` було розділено на чотири окремі інструкції:

source: ``COMPARE_OP`` for rich comparisons
uk: ``COMPARE_OP`` для насичених порівнянь

source: ``IS_OP`` for 'is' and 'is not' tests
uk: ``IS_OP`` для тестів "є" і "не є".

source: ``CONTAINS_OP`` for 'in' and 'not in' tests
uk: ``CONTAINS_OP`` для тестів "in" і "not in".

source: ``JUMP_IF_NOT_EXC_MATCH`` for checking exceptions in 'try-except' statements.
uk: ``JUMP_IF_NOT_EXC_MATCH`` для перевірки винятків у операторах 'try-except'.

source: (Contributed by Mark Shannon in :issue:`39156`.)
uk: (Надав Марк Шеннон у :issue:`39156`.)

source: Build Changes
uk: Зміни збірки

source: Added ``--with-platlibdir`` option to the ``configure`` script: name of the platform-specific library directory, stored in the new :attr:`sys.platlibdir` attribute. See :attr:`sys.platlibdir` attribute for more information. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
uk: До сценарію ``configure`` додано опцію ``--with-platlibdir``: ім’я каталогу бібліотеки для певної платформи, що зберігається в новому атрибуті :attr:`sys.platlibdir`. Дивіться атрибут :attr:`sys.platlibdir` для отримання додаткової інформації. (Надано Яном Матєйком, Матєєм Чеплем, Харалампосом Стратакісом і Віктором Стіннером у :issue:`1294959`.)

source: The ``COUNT_ALLOCS`` special build macro has been removed. (Contributed by Victor Stinner in :issue:`39489`.)
uk: Спеціальний макрос збірки ``COUNT_ALLOCS`` видалено. (Надав Віктор Стіннер у :issue:`39489`.)

source: On non-Windows platforms, the :c:func:`setenv` and :c:func:`unsetenv` functions are now required to build Python. (Contributed by Victor Stinner in :issue:`39395`.)
uk: На платформах, відмінних від Windows, для створення Python тепер потрібні функції :c:func:`setenv` і :c:func:`unsetenv`. (Надав Віктор Стіннер у :issue:`39395`.)

source: On non-Windows platforms, creating ``bdist_wininst`` installers is now officially unsupported. (See :issue:`10945` for more details.)
uk: На платформах, відмінних від Windows, створення інсталяторів ``bdist_wininst`` тепер офіційно не підтримується. (Додаткову інформацію див. :issue:`10945`.)

source: When building Python on macOS from source, ``_tkinter`` now links with non-system Tcl and Tk frameworks if they are installed in ``/Library/Frameworks``, as had been the case on older releases of macOS. If a macOS SDK is explicitly configured, by using :option:`--enable-universalsdk` or ``-isysroot``, only the SDK itself is searched. The default behavior can still be overridden with :option:`--with-tcltk-includes` and :option:`--with-tcltk-libs`. (Contributed by Ned Deily in :issue:`34956`.)
uk: Під час створення Python на macOS із вихідного коду, ``_tkinter`` тепер зв’язується з несистемними фреймворками Tcl і Tk, якщо вони встановлені в ``/Library/Frameworks``, як це було у старих версіях macOS. Якщо macOS SDK налаштовано явно за допомогою :option:`--enable-universalsdk` або ``-isysroot``, пошук здійснюється лише в самому SDK. Поведінку за замовчуванням все ще можна змінити за допомогою :option:`--with-tcltk-includes` і :option:`--with-tcltk-libs`. (Надав Ned Deily в :issue:`34956`.)

source: Python can now be built for Windows 10 ARM64. (Contributed by Steve Dower in :issue:`33125`.)
uk: Тепер Python можна створити для Windows 10 ARM64. (Надав Стів Дауер у :issue:`33125`.)

source: Some individual tests are now skipped when ``--pgo`` is used. The tests in question increased the PGO task time significantly and likely didn't help improve optimization of the final executable. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain. (See :issue:`36044` and :issue:`37707` for more details.)
uk: Деякі окремі тести тепер пропускаються, коли використовується ``--pgo``. Тести, про які йдеться, значно збільшили час виконання завдання PGO і, ймовірно, не допомогли покращити оптимізацію остаточного виконуваного файлу. Це прискорює завдання приблизно в 15 разів. Запуск повного набору модульних тестів повільний. Ця зміна може призвести до дещо менш оптимізованої збірки, оскільки буде виконано не так багато гілок коду. Якщо ви бажаєте почекати на набагато повільнішу збірку, стару поведінку можна відновити за допомогою ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. Ми не гарантуємо, який набір завдань PGO забезпечує швидшу збірку. Небайдужі користувачі повинні запускати власні релевантні тести, оскільки результати можуть залежати від середовища, робочого навантаження та ланцюга інструментів компілятора. (Додаткову інформацію див. у :issue:`36044` і :issue:`37707`.)

source: C API Changes
uk: Зміни C API

source: :pep:`573`: Added :c:func:`PyType_FromModuleAndSpec` to associate a module with a class; :c:func:`PyType_GetModule` and :c:func:`PyType_GetModuleState` to retrieve the module and its state; and :c:data:`PyCMethod` and :c:data:`METH_METHOD` to allow a method to access the class it was defined in. (Contributed by Marcel Plch and Petr Viktorin in :issue:`38787`.)
uk: :pep:`573`: Додано :c:func:`PyType_FromModuleAndSpec` для асоціації модуля з класом; :c:func:`PyType_GetModule` і :c:func:`PyType_GetModuleState` для отримання модуля та його стану; і :c:data:`PyCMethod` і :c:data:`METH_METHOD`, щоб дозволити методу отримати доступ до класу, у якому його було визначено. (Надано Марселем Плхом і Петром Вікторіним у :issue:`38787`.)

source: Added :c:func:`PyFrame_GetCode` function: get a frame code. Added :c:func:`PyFrame_GetBack` function: get the frame next outer frame. (Contributed by Victor Stinner in :issue:`40421`.)
uk: Додано функцію :c:func:`PyFrame_GetCode`: отримати код кадру. Додано функцію :c:func:`PyFrame_GetBack`: отримати кадр наступного зовнішнього кадру. (Надав Віктор Стіннер у :issue:`40421`.)

source: Added :c:func:`PyFrame_GetLineNumber` to the limited C API. (Contributed by Victor Stinner in :issue:`40421`.)
uk: Додано :c:func:`PyFrame_GetLineNumber` до обмеженого C API. (Надав Віктор Стіннер у :issue:`40421`.)

source: Added :c:func:`PyThreadState_GetInterpreter` and :c:func:`PyInterpreterState_Get` functions to get the interpreter. Added :c:func:`PyThreadState_GetFrame` function to get the current frame of a Python thread state. Added :c:func:`PyThreadState_GetID` function: get the unique identifier of a Python thread state. (Contributed by Victor Stinner in :issue:`39947`.)
uk: Додано функції :c:func:`PyThreadState_GetInterpreter` і :c:func:`PyInterpreterState_Get` для отримання інтерпретатора. Додано функцію :c:func:`PyThreadState_GetFrame` для отримання поточного кадру стану потоку Python. Додано функцію :c:func:`PyThreadState_GetID`: отримати унікальний ідентифікатор стану потоку Python. (Надав Віктор Стіннер у :issue:`39947`.)

source: Added a new public :c:func:`PyObject_CallNoArgs` function to the C API, which calls a callable Python object without any arguments. It is the most efficient way to call a callable Python object without any argument. (Contributed by Victor Stinner in :issue:`37194`.)
uk: Додано нову загальнодоступну функцію :c:func:`PyObject_CallNoArgs` до C API, яка викликає об’єкт Python без аргументів. Це найефективніший спосіб викликати викликаний об’єкт Python без аргументів. (Надав Віктор Стіннер у :issue:`37194`.)

source: Changes in the limited C API (if ``Py_LIMITED_API`` macro is defined):
uk: Зміни в обмеженому API C (якщо визначено макрос ``Py_LIMITED_API``):
