Repository: python/python-docs-uk
Catalog: whatsnew/3_1.po
Languages: uk

source: The automatic name remapping in the pickle module for protocol 2 or lower can make Python 3.1 pickles unreadable in Python 3.0. One solution is to use protocol 3. Another solution is to set the *fix_imports* option to ``False``. See the discussion above for more details.
uk: Автоматичне перевідображення імен у модулі pickle для протоколу 2 або нижчої версії може зробити pickles Python 3.1 нечитабельними в Python 3.0. Одним із рішень є використання протоколу 3. Іншим рішенням є встановлення опції *fix_imports* на ``False``. Дивіться обговорення вище для отримання додаткової інформації.
