Repository: python/python-docs-uk
Catalog: whatsnew/3_1.po
Languages: uk

source: What's New In Python 3.1
uk: Що нового в Python 3.1

source: Author
uk: Автор

source: This article explains the new features in Python 3.1, compared to 3.0. Python 3.1 was released on June 27, 2009.
uk: У цій статті пояснюється нові функції в Python 3.1 порівняно з 3.0. Python 3.1 було випущено 27 червня 2009 року.

source: PEP 372: Ordered Dictionaries
uk: PEP 372: Упорядковані словники

source: Regular Python dictionaries iterate over key/value pairs in arbitrary order. Over the years, a number of authors have written alternative implementations that remember the order that the keys were originally inserted. Based on the experiences from those implementations, a new :class:`collections.OrderedDict` class has been introduced.
uk: Звичайні словники Python перебирають пари ключ/значення в довільному порядку. Протягом багатьох років кілька авторів написали альтернативні реалізації, які запам’ятовують порядок початкового вставлення ключів. На основі досвіду цих реалізацій було введено новий клас :class:`collections.OrderedDict`.

source: The OrderedDict API is substantially the same as regular dictionaries but will iterate over keys and values in a guaranteed order depending on when a key was first inserted. If a new entry overwrites an existing entry, the original insertion position is left unchanged. Deleting an entry and reinserting it will move it to the end.
uk: API OrderedDict практично такий же, як і звичайні словники, але перебиратиме ключі та значення в гарантованому порядку залежно від того, коли ключ було вперше вставлено. Якщо новий запис перезаписує існуючий запис, початкова позиція вставки залишається незмінною. Видалення запису та його повторне вставлення перемістить його в кінець.

source: :pep:`372` - Ordered Dictionaries
uk: :pep:`372` - Впорядковані словники

source: PEP written by Armin Ronacher and Raymond Hettinger. Implementation written by Raymond Hettinger.
uk: PEP, автори Армін Роначер і Раймонд Геттінгер. Реалізацію написав Раймонд Хеттінгер.

source: PEP 378: Format Specifier for Thousands Separator
uk: PEP 378: Специфікатор формату для розділювача тисяч

source: The built-in :func:`format` function and the :meth:`str.format` method use a mini-language that now includes a simple, non-locale aware way to format a number with a thousands separator. That provides a way to humanize a program's output, improving its professional appearance and readability::
uk: Вбудована функція :func:`format` і метод :meth:`str.format` використовують міні-мову, яка тепер містить простий спосіб форматування числа з роздільником тисяч, який не залежить від локалі. Це надає спосіб гуманізувати вихідні дані програми, покращуючи її професійний вигляд і читабельність:

source: The supported types are :class:`int`, :class:`float`, :class:`complex` and :class:`decimal.Decimal`.
uk: Підтримувані типи: :class:`int`, :class:`float`, :class:`complex` і :class:`decimal.Decimal`.

source: Discussions are underway about how to specify alternative separators like dots, spaces, apostrophes, or underscores. Locale-aware applications should use the existing *n* format specifier which already has some support for thousands separators.
uk: Ведуться дискусії про те, як вказати альтернативні роздільники, такі як крапки, пробіли, апострофи або підкреслення. Програми з розпізнаванням локалі повинні використовувати існуючий специфікатор формату *n*, який уже підтримує певну підтримку роздільників тисяч.

source: :pep:`378` - Format Specifier for Thousands Separator
uk: :pep:`378` - Специфікатор формату для розділювача тисяч

source: PEP written by Raymond Hettinger and implemented by Eric Smith and Mark Dickinson.
uk: PEP, написаний Реймондом Геттінгером і реалізований Еріком Смітом і Марком Дікінсоном.

source: Other Language Changes
uk: Інші зміни мови

source: Some smaller changes made to the core Python language are:
uk: Деякі менші зміни, внесені до основної мови Python:

source: Directories and zip archives containing a :file:`__main__.py` file can now be executed directly by passing their name to the interpreter. The directory/zipfile is automatically inserted as the first entry in sys.path. (Suggestion and initial patch by Andy Chu; revised patch by Phillip J. Eby and Nick Coghlan; :issue:`1739468`.)
uk: Каталоги та zip-архіви, що містять файл :file:`__main__.py`, тепер можна виконувати безпосередньо, передавши їх імена інтерпретатору. Каталог/файл zip автоматично вставляється як перший запис у sys.path. (Пропозиція та початковий патч від Енді Чу; переглянуте патч від Філіпа Дж. Ебі та Ніка Коглана; :issue:`1739468`.)

source: The :func:`int` type gained a ``bit_length`` method that returns the number of bits necessary to represent its argument in binary::
uk: Тип :func:`int` отримав метод ``bit_length``, який повертає кількість бітів, необхідних для представлення свого аргументу в двійковому вигляді::

source: (Contributed by Fredrik Johansson, Victor Stinner, Raymond Hettinger, and Mark Dickinson; :issue:`3439`.)
uk: (Надано Фредріком Йоханссоном, Віктором Стіннером, Реймондом Геттінгером і Марком Дікінсоном; :issue:`3439`.)

source: The fields in :func:`format` strings can now be automatically numbered::
uk: Поля в рядках :func:`format` тепер можуть бути автоматично пронумеровані::

source: Formerly, the string would have required numbered fields such as: ``'Sir {0} of {1}'``.
uk: Раніше рядок вимагав пронумерованих полів, таких як: ``'Sir {0} of {1}''``.

source: (Contributed by Eric Smith; :issue:`5237`.)
uk: (Надав Ерік Сміт; :issue:`5237`.)

source: (Contributed by Georg Brandl; :issue:`5675`.)
uk: (Надав Георг Брандл; :issue:`5675`.)

source: The syntax of the :keyword:`with` statement now allows multiple context managers in a single statement::
uk: Синтаксис оператора :keyword:`with` тепер дозволяє використовувати декілька менеджерів контексту в одному операторі:

source: (Contributed by Georg Brandl and Mattias Brändström; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)
uk: (Надано Георгом Брандлом і Маттіасом Брендстремом; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)

source: ``round(x, n)`` now returns an integer if *x* is an integer. Previously it returned a float::
uk: ``round(x, n)`` тепер повертає ціле число, якщо *x* є цілим числом. Раніше він повертав float::

source: (Contributed by Mark Dickinson; :issue:`4707`.)
uk: (Надав Марк Дікінсон; :issue:`4707`.)

source: The new algorithm for ``repr(1.1)`` is smarter and returns ``'1.1'``. Effectively, it searches all equivalent string representations (ones that get stored with the same underlying float value) and returns the shortest representation.
uk: Новий алгоритм для ``repr(1.1)`` розумніший і повертає ``'1.1'``. По суті, він шукає всі еквівалентні представлення рядків (ті, які зберігаються з тим самим базовим значенням з плаваючою точкою) і повертає найкоротше представлення.

source: The new algorithm tends to emit cleaner representations when possible, but it does not change the underlying values. So, it is still the case that ``1.1 + 2.2 != 3.3`` even though the representations may suggest otherwise.
uk: Новий алгоритм має тенденцію видавати чіткіші представлення, коли це можливо, але він не змінює основні значення. Таким чином, це все ще так, що ``1.1 + 2.2 != 3.3``, навіть якщо представлення можуть припускати інше.

source: (Contributed by Eric Smith and Mark Dickinson; :issue:`1580`)
uk: (Надано Еріком Смітом і Марком Дікінсоном; :issue:`1580`)

source: New, Improved, and Deprecated Modules
uk: Нові, покращені та застарілі модулі

source: Added a :class:`collections.Counter` class to support convenient counting of unique items in a sequence or iterable::
uk: Додано клас :class:`collections.Counter` для підтримки зручного підрахунку унікальних елементів у послідовності або ітерації::

source: (Contributed by Raymond Hettinger; :issue:`1696199`.)
uk: (Надав Реймонд Геттінгер; :issue:`1696199`.)

source: Added a new module, :mod:`tkinter.ttk` for access to the Tk themed widget set. The basic idea of ttk is to separate, to the extent possible, the code implementing a widget's behavior from the code implementing its appearance.
uk: Додано новий модуль :mod:`tkinter.ttk` для доступу до набору тематичних віджетів Tk. Основна ідея ttk полягає в тому, щоб відокремити, наскільки це можливо, код, що реалізує поведінку віджета, від коду, що реалізує його зовнішній вигляд.

source: (Contributed by Guilherme Polo; :issue:`2983`.)
uk: (Надав Гільєрме Поло; :issue:`2983`.)

source: The :class:`gzip.GzipFile` and :class:`bz2.BZ2File` classes now support the context management protocol::
uk: Класи :class:`gzip.GzipFile` і :class:`bz2.BZ2File` тепер підтримують протокол керування контекстом:

source: (Contributed by Antoine Pitrou.)
uk: (Надав Антуан Пітру.)

source: The :mod:`decimal` module now supports methods for creating a decimal object from a binary :class:`float`. The conversion is exact but can sometimes be surprising::
uk: Модуль :mod:`decimal` тепер підтримує методи для створення десяткового об’єкта з двійкового :class:`float`. Перетворення точне, але іноді може бути несподіваним:

source: The long decimal result shows the actual binary fraction being stored for *1.1*. The fraction has many digits because *1.1* cannot be exactly represented in binary.
uk: Довгий десятковий результат показує фактичний двійковий дріб, який зберігається для *1,1*. Дріб має багато цифр, оскільки *1.1* не може бути точно представлений у двійковому вигляді.

source: (Contributed by Raymond Hettinger and Mark Dickinson.)
uk: (Надано Реймондом Геттінгером і Марком Дікінсоном.)

source: The :mod:`itertools` module grew two new functions. The :func:`itertools.combinations_with_replacement` function is one of four for generating combinatorics including permutations and Cartesian products. The :func:`itertools.compress` function mimics its namesake from APL. Also, the existing :func:`itertools.count` function now has an optional *step* argument and can accept any type of counting sequence including :class:`fractions.Fraction` and :class:`decimal.Decimal`::
uk: Модуль :mod:`itertools` розширив дві нові функції. Функція :func:`itertools.combinations_with_replacement` є однією з чотирьох для створення комбінаторики, включаючи перестановки та декартові добутки. Функція :func:`itertools.compress` імітує свою тезку з APL. Крім того, наявна функція :func:`itertools.count` тепер має додатковий аргумент *step* і може приймати будь-який тип послідовності підрахунку, включаючи :class:`fractions.Fraction` і :class:`decimal.Decimal`::

source: (Contributed by Raymond Hettinger.)
uk: (Надав Реймонд Геттінгер.)

source: :func:`collections.namedtuple` now supports a keyword argument *rename* which lets invalid fieldnames be automatically converted to positional names in the form _0, _1, etc. This is useful when the field names are being created by an external source such as a CSV header, SQL field list, or user input::
uk: :func:`collections.namedtuple` тепер підтримує аргумент ключового слова *rename*, який дозволяє автоматично перетворювати недійсні назви полів на позиційні імена у формі _0, _1 тощо. Це корисно, коли назви полів створюються зовнішнім джерелом, наприклад як заголовок CSV, список полів SQL або введення користувача::

source: (Contributed by Raymond Hettinger; :issue:`1818`.)
uk: (Надав Раймонд Геттінгер; :issue:`1818`.)

source: The :func:`re.sub`, :func:`re.subn` and :func:`re.split` functions now accept a flags parameter.
uk: Функції :func:`re.sub`, :func:`re.subn` і :func:`re.split` тепер приймають параметр flags.

source: (Contributed by Gregory Smith.)
uk: (Надав Грегорі Сміт.)

source: The :mod:`logging` module now implements a simple :class:`logging.NullHandler` class for applications that are not using logging but are calling library code that does. Setting-up a null handler will suppress spurious warnings such as "No handlers could be found for logger foo"::
uk: Модуль :mod:`logging` тепер реалізує простий клас :class:`logging.NullHandler` для програм, які не використовують журналювання, але викликають код бібліотеки, який це робить. Налаштування нульового обробника придушить фальшиві попередження, такі як "Не вдалося знайти обробників для logger foo"::

source: (Contributed by Vinay Sajip; :issue:`4384`).
uk: (Надав Віней Саджип; :issue:`4384`).

source: The :mod:`runpy` module which supports the ``-m`` command line switch now supports the execution of packages by looking for and executing a ``__main__`` submodule when a package name is supplied.
uk: Модуль :mod:`runpy`, який підтримує перемикач командного рядка ``-m``, тепер підтримує виконання пакетів шляхом пошуку та виконання субмодуля ``__main__``, коли надається ім’я пакета.

source: (Contributed by Andi Vajda; :issue:`4195`.)
uk: (Надав Анді Вайда; :issue:`4195`.)

source: The :mod:`pdb` module can now access and display source code loaded via :mod:`zipimport` (or any other conformant :pep:`302` loader).
uk: Модуль :mod:`pdb` тепер може отримувати доступ і відображати вихідний код, завантажений через :mod:`zipimport` (або будь-який інший відповідний завантажувач :pep:`302`).

source: (Contributed by Alexander Belopolsky; :issue:`4201`.)
uk: (Надав Олександр Бєлопольський; :issue:`4201`.)

source: :class:`functools.partial` objects can now be pickled.
uk: :class:`functools.partial` об’єкти тепер можна маринувати.

source: (Suggested by Antoine Pitrou and Jesse Noller. Implemented by Jack Diederich; :issue:`5228`.)
uk: (Запропоновано Антуаном Пітру та Джессі Ноллером. Реалізовано Джеком Дідеріхом; :issue:`5228`.)

source: Add :mod:`pydoc` help topics for symbols so that ``help('@')`` works as expected in the interactive environment.
uk: Додайте теми довідки :mod:`pydoc` для символів, щоб ``help('@')`` працював належним чином в інтерактивному середовищі.

source: (Contributed by David Laban; :issue:`4739`.)
uk: (Надав Девід Лабан; :issue:`4739`.)

source: The :mod:`unittest` module now supports skipping individual tests or classes of tests. And it supports marking a test as an expected failure, a test that is known to be broken, but shouldn't be counted as a failure on a TestResult::
uk: Модуль :mod:`unittest` тепер підтримує пропуски окремих тестів або класів тестів. І він підтримує позначення тесту як очікуваної невдачі, тесту, який, як відомо, зламаний, але не повинен вважатися невдалим у TestResult::

source: Also, tests for exceptions have been builtout to work with context managers using the :keyword:`with` statement::
uk: Крім того, для роботи з менеджерами контексту за допомогою оператора :keyword:`with`::

source: (Contributed by Benjamin Peterson and Antoine Pitrou.)
uk: (Надано Бенджаміном Петерсоном і Антуаном Пітру.)

source: (Contributed by Ross Light; :issue:`4285`.)
uk: (Надав Росс Лайт; :issue:`4285`.)

source: (Contributed by Derek Morr; :issue:`1655` and :issue:`1664`.)
uk: (Надав Дерек Морр; :issue:`1655` і :issue:`1664`.)

source: The :mod:`pickle` module has been adapted for better interoperability with Python 2.x when used with protocol 2 or lower. The reorganization of the standard library changed the formal reference for many objects. For example, ``__builtin__.set`` in Python 2 is called ``builtins.set`` in Python 3. This change confounded efforts to share data between different versions of Python. But now when protocol 2 or lower is selected, the pickler will automatically use the old Python 2 names for both loading and dumping. This remapping is turned-on by default but can be disabled with the *fix_imports* option::
uk: Модуль :mod:`pickle` було адаптовано для кращої сумісності з Python 2.x при використанні протоколу 2 або нижчого. Реорганізація стандартної бібліотеки змінила формальне посилання для багатьох об'єктів. Наприклад, ``__builtin__.set`` у Python 2 називається ``builtins.set`` у Python 3. Ця зміна збентежила спроби обмінюватися даними між різними версіями Python. Але тепер, коли вибрано протокол 2 або нижчий, піклер автоматично використовуватиме старі назви Python 2 як для завантаження, так і для вивантаження. Це перевідображення ввімкнено за замовчуванням, але його можна вимкнути за допомогою опції *fix_imports*::

source: An unfortunate but unavoidable side-effect of this change is that protocol 2 pickles produced by Python 3.1 won't be readable with Python 3.0. The latest pickle protocol, protocol 3, should be used when migrating data between Python 3.x implementations, as it doesn't attempt to remain compatible with Python 2.x.
uk: Неприємний, але неминучий побічний ефект цієї зміни полягає в тому, що піклі протоколу 2, створені Python 3.1, не можна буде прочитати з Python 3.0. Найновіший протокол pickle, протокол 3, слід використовувати під час переміщення даних між реалізаціями Python 3.x, оскільки він не намагається зберегти сумісність із Python 2.x.

source: (Contributed by Alexandre Vassalotti and Antoine Pitrou, :issue:`6137`.)
uk: (Надано Александром Вассалотті та Антуаном Пітру, :issue:`6137`.)

source: A new module, :mod:`importlib` was added. It provides a complete, portable, pure Python reference implementation of the :keyword:`import` statement and its counterpart, the :func:`__import__` function. It represents a substantial step forward in documenting and defining the actions that take place during imports.
uk: Додано новий модуль :mod:`importlib`. Він забезпечує повну, портативну, чисту довідкову реалізацію на Python оператора :keyword:`import` і його відповідника, функції :func:`__import__`. Це значний крок вперед у документуванні та визначенні дій, які відбуваються під час імпорту.

source: (Contributed by Brett Cannon.)
uk: (Надав Бретт Кеннон.)

source: Optimizations
uk: Оптимізації

source: Major performance enhancements have been added:
uk: Додано основні покращення продуктивності:

source: The new I/O library (as defined in :pep:`3116`) was mostly written in Python and quickly proved to be a problematic bottleneck in Python 3.0. In Python 3.1, the I/O library has been entirely rewritten in C and is 2 to 20 times faster depending on the task at hand. The pure Python version is still available for experimentation purposes through the ``_pyio`` module.
uk: Нова бібліотека введення-виведення (як визначено в :pep:`3116`) була здебільшого написана на Python і швидко виявилася проблемним вузьким місцем у Python 3.0. У Python 3.1 бібліотеку вводу/виводу було повністю переписано на C і вона працює від 2 до 20 разів швидше залежно від поставленого завдання. Чиста версія Python все ще доступна для експериментальних цілей через модуль ``_pyio``.

source: (Contributed by Amaury Forgeot d'Arc and Antoine Pitrou.)
uk: (Надано Аморі Форже д'Арк і Антуаном Пітру.)

source: Added a heuristic so that tuples and dicts containing only untrackable objects are not tracked by the garbage collector. This can reduce the size of collections and therefore the garbage collection overhead on long-running programs, depending on their particular use of datatypes.
uk: Додано евристику, щоб кортежі та dicts, що містять лише невідстежувані об’єкти, не відстежувалися збирачем сміття. Це може зменшити розмір колекцій і, отже, накладні витрати на збирання сміття в програмах, що працюють довго, залежно від конкретного використання типів даних.

source: (Contributed by Antoine Pitrou, :issue:`4688`.)
uk: (Надав Антуан Пітру, :issue:`4688`.)

source: Enabling a configure option named ``--with-computed-gotos`` on compilers that support it (notably: gcc, SunPro, icc), the bytecode evaluation loop is compiled with a new dispatch mechanism which gives speedups of up to 20%, depending on the system, the compiler, and the benchmark.
uk: Увімкнувши параметр конфігурації під назвою ``--with-computed-gotos`` на компіляторах, які його підтримують (зокрема, gcc, SunPro, icc), цикл оцінки байт-коду компілюється з новим механізмом відправки, який забезпечує прискорення до 20% , залежно від системи, компілятора та тесту.

source: (Contributed by Antoine Pitrou along with a number of other participants, :issue:`4753`).
uk: (Надано Антуаном Пітру та низкою інших учасників, :issue:`4753`).

source: The decoding of UTF-8, UTF-16 and LATIN-1 is now two to four times faster.
uk: Декодування UTF-8, UTF-16 і LATIN-1 тепер у два-чотири рази швидше.

source: (Contributed by Antoine Pitrou and Amaury Forgeot d'Arc, :issue:`4868`.)
uk: (Надано Антуаном Пітру та Аморі Форже д'Арк, :issue:`4868`.)

source: (Contributed by Bob Ippolito and converted to Py3.1 by Antoine Pitrou and Benjamin Peterson; :issue:`4136`.)
uk: (Надано Бобом Іполіто та перетворено на Py3.1 Антуаном Пітру та Бенджаміном Петерсоном; :issue:`4136`.)

source: Unpickling now interns the attribute names of pickled objects. This saves memory and allows pickles to be smaller.
uk: Unpickling тепер інтернує назви атрибутів маринованих об’єктів. Це економить пам’ять і дозволяє зробити солоні огірки меншими.

source: (Contributed by Jake McGuire and Antoine Pitrou; :issue:`5084`.)
uk: (Надано Джейком Макгуайром і Антуаном Пітру; :issue:`5084`.)

source: IDLE
uk: ПРОСТОЮЧИЙ

source: IDLE's format menu now provides an option to strip trailing whitespace from a source file.
uk: Меню форматування IDLE тепер надає можливість видаляти кінцеві пробіли з вихідного файлу.

source: (Contributed by Roger D. Serwy; :issue:`5150`.)
uk: (Надав Роджер Д. Серві; :issue:`5150`.)

source: Build and C API Changes
uk: Зміни збірки та C API

source: Changes to Python's build process and to the C API include:
uk: Зміни в процесі збирання Python і в API C включають:

source: Integers are now stored internally either in base ``2**15`` or in base ``2**30``, the base being determined at build time. Previously, they were always stored in base ``2**15``. Using base ``2**30`` gives significant performance improvements on 64-bit machines, but benchmark results on 32-bit machines have been mixed. Therefore, the default is to use base ``2**30`` on 64-bit machines and base ``2**15`` on 32-bit machines; on Unix, there's a new configure option ``--enable-big-digits`` that can be used to override this default.
uk: Цілі числа тепер зберігаються внутрішньо або в базі ``2**15``, або в базі ``2**30``, причому база визначається під час створення. Раніше вони завжди зберігалися в базі ``2**15``. Використання бази ``2**30`` дає значне покращення продуктивності на 64-розрядних машинах, але результати порівняльного тестування на 32-розрядних машинах були неоднозначними. Тому за замовчуванням на 64-розрядних машинах використовується основа ``2**30`` і основа ``2**15`` на 32-розрядних машинах; в Unix є новий параметр конфігурації ``--enable-big-digits``, який можна використовувати для заміни цього значення за замовчуванням.

source: (Contributed by Mark Dickinson; :issue:`4258`.)
uk: (Надав Марк Дікінсон; :issue:`4258`.)

source: The :c:func:`PyLong_AsUnsignedLongLong()` function now handles a negative *pylong* by raising :exc:`OverflowError` instead of :exc:`TypeError`.
uk: Функція :c:func:`PyLong_AsUnsignedLongLong()` тепер обробляє негативний *pylong*, викликаючи :exc:`OverflowError` замість :exc:`TypeError`.

source: (Contributed by Mark Dickinson and Lisandro Dalcrin; :issue:`5175`.)
uk: (Надано Марком Дікінсоном і Лісандро Далкріном; :issue:`5175`.)

source: (Contributed by Mark Dickinson; :issue:`4910`.)
uk: (Надав Марк Дікінсон; :issue:`4910`.)

source: (Contributed by Mark Dickinson; :issue:`5914`.)
uk: (Надав Марк Дікінсон; :issue:`5914`.)

source: (Contributed by Larry Hastings; :issue:`5630`.)
uk: (Надав Ларрі Гастінгс; :issue:`5630`.)

source: Porting to Python 3.1
uk: Перенесення на Python 3.1

source: This section lists previously described changes and other bugfixes that may require changes to your code:
uk: У цьому розділі перераховані раніше описані зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді:
