Repository: python/python-docs-uk
Catalog: tutorial/appendix.po
Languages: uk

source: Appendix
uk: Додаток

source: Interactive Mode
uk: Інтерактивний режим

source: There are two variants of the interactive :term:`REPL`. The classic basic interpreter is supported on all platforms with minimal line control capabilities.
uk: Існує два варіанти інтерактивного :term:REPL. Класичний базовий інтерпретатор підтримується на всіх платформах з мінімальними можливостями керування рядками.

source: Error Handling
uk: Обробка помилок

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
uk: Введення символу переривання (зазвичай :kbd:`Control-C` або :kbd:`Delete`) у основному чи додатковому командному рядку скасовує введення та повертає до основного командного рядка. [#]_ Введення переривання під час виконання команди викликає виключення :exc:`KeyboardInterrupt`, яке може бути оброблено оператором :keyword:`try`.

source: Executable Python Scripts
uk: Виконувані скрипти Python

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
uk: У BSD Unix системах скрипти Python можна зробити безпосередньо виконуваними, як скрипти оболонки, додавши рядок ::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
uk: (за умови, що інтерпретатор знаходиться в змінній середовища користувача :envvar:`PATH`) на початку сценарію та надає файлу режим виконання. ``#!`` має бути першими двома символами файлу. На деяких платформах цей перший рядок має закінчуватися закінченням рядка в стилі Unix (``'\n'``), а не закінченням рядка Windows (``'\r\n'``). Зауважте, що для початку коментаря в Python використовується хеш або символ фунта, ``'#'``.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
uk: Скрипту можна надати режим виконання або дозвіл за допомогою команди :program:`chmod`.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
uk: У системах Windows немає поняття "виконуваний режим". Програма встановлення Python автоматично пов’язує файли ``.py`` з ``python.exe``, щоб подвійне клацання файлу Python запускало його як програму. Розширення також може бути ``.pyw``, у цьому випадку вікно консолі, яке в іншому випадку б з’явилось, приховується.

source: The Interactive Startup File
uk: Інтерактивний файл запуску

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
uk: Коли ви використовуєте Python в інтерактивному режимі, часто зручно мати деякі стандартні команди, які виконуються щоразу, коли запускається інтерпретатор. Ви можете зробити це, встановивши змінну середовища з назвою :envvar:`PYTHONSTARTUP` на назву файлу, що містить ваші команди запуску. Це схоже на функцію :file:`.profile` оболонок Unix.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
uk: Цей файл читається лише під час інтерактивних сеансів, а не тоді, коли Python читає команди зі сценарію, і не коли :file:`/dev/tty` вказано як явне джерело команд (що інакше поводиться як інтерактивний сеанс). Він виконується в тому самому просторі імен, де виконуються інтерактивні команди, тому об’єкти, які він визначає або імпортує, можна використовувати без застережень в інтерактивному сеансі. Ви також можете змінити підказки ``sys.ps1`` і ``sys.ps2`` у цьому файлі.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
uk: Якщо ви хочете прочитати додатковий файл запуску з поточного каталогу, ви можете запрограмувати це в глобальному файлі запуску за допомогою коду на кшталт ``if os.path.isfile('.pythonrc.py'): exec(open ('.pythonrc.py').read())``. Якщо ви хочете використовувати файл запуску в сценарії, ви повинні зробити це явно в сценарії::

source: The Customization Modules
uk: Модулі налаштування

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
uk: Тепер ви можете створити файл із назвою :file:`usercustomize.py` у цьому каталозі та помістити в нього все, що завгодно. Це впливатиме на кожен виклик Python, якщо його не запущено з параметром :option:`-s` для вимкнення автоматичного імпорту.

source: Footnotes
uk: Виноски

source: A problem with the GNU Readline package may prevent this.
uk: Проблема з пакетом GNU Readline може запобігти цьому.
