Repository: python/python-docs-uk
Catalog: tutorial/classes.po
Languages: uk

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
uk: Клас *instantiation* використовує нотацію функції. Просто уявіть, що об’єкт класу є функцією без параметрів, яка повертає новий екземпляр класу. Наприклад (припускаючи вищезгаданий клас):

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
uk: створює новий *примірник* класу та призначає цей об’єкт локальній змінній ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`__init__`, like this::
uk: Операція інстанціювання ("виклик" об’єкта класу) створює порожній об’єкт. Багато класів люблять створювати об’єкти з екземплярами, налаштованими на певний початковий стан. Тому клас може визначати спеціальний метод під назвою :meth:`__init__`, наприклад:

source: When a class defines an :meth:`__init__` method, class instantiation automatically invokes :meth:`__init__` for the newly-created class instance. So in this example, a new, initialized instance can be obtained by::
uk: Коли клас визначає метод :meth:`__init__`, екземпляр класу автоматично викликає :meth:`__init__` для щойно створеного примірника класу. Тож у цьому прикладі новий ініціалізований екземпляр можна отримати за допомогою:

source: Of course, the :meth:`__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`__init__`. For example, ::
uk: Звичайно, метод :meth:`__init__` може мати аргументи для більшої гнучкості. У цьому випадку аргументи, надані оператору інстанції класу, передаються до :meth:`__init__`. Наприклад, ::

source: Instance Objects
uk: Об’єкти екземпляра

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
uk: Тепер що ми можемо робити з об’єктами екземплярів? Єдиними операціями, які розуміють об’єкти екземплярів, є посилання на атрибути. Є два типи дійсних імен атрибутів: атрибути даних і методи.

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
uk: *атрибути даних* відповідають "змінним екземплярів" у Smalltalk і "членам даних" у C++. Атрибути даних не потрібно оголошувати; як і локальні змінні, вони виникають, коли їх вперше призначають. Наприклад, якщо ``x`` є екземпляром :class:`MyClass`, створеним вище, наступний фрагмент коду виведе значення ``16``, не залишаючи слідів::

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object. (In Python, the term method is not unique to class instances: other object types can have methods as well. For example, list objects have methods called append, insert, remove, sort, and so on. However, in the following discussion, we'll use the term method exclusively to mean methods of class instance objects, unless explicitly stated otherwise.)
uk: Іншим типом посилання на атрибут екземпляра є *метод*. Метод — це функція, яка "належить" об’єкту. (У Python термін метод не є унікальним для екземплярів класу: інші типи об’єктів також можуть мати методи. Наприклад, об’єкти списку мають методи, що називаються додаванням, вставкою, видаленням, сортуванням тощо. Однак у наступному обговоренні, ми будемо використовувати термін метод виключно для позначення методів об’єктів екземпляра класу, якщо явно не вказано інше.)

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
uk: Дійсні імена методів екземпляра об’єкта залежать від його класу. За визначенням, усі атрибути класу, які є функціональними об’єктами, визначають відповідні методи його екземплярів. Отже, у нашому прикладі ``x.f`` є дійсним посиланням на метод, оскільки ``MyClass.f`` є функцією, але ``x.i`` ні, оскільки ``MyClass.i`` не є таким. Але ``x.f`` — це не те саме, що ``MyClass.f`` --- це *об’єкт методу*, а не об’єкт функції.

source: Method Objects
uk: Об’єкти методу

source: Usually, a method is called right after it is bound::
uk: Зазвичай метод викликається одразу після його зв’язування::

source: In the :class:`MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
uk: У прикладі :class:`MyClass` це поверне рядок ``'hello world'``. Однак не обов’язково викликати метод одразу: ``x.f`` є об’єктом методу, його можна зберегти та викликати пізніше. Наприклад::

source: will continue to print ``hello world`` until the end of time.
uk: продовжуватиме друкувати ``hello world`` до кінця часу.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
uk: Що саме відбувається під час виклику методу? Можливо, ви помітили, що ``x.f()`` було викликано без аргументу вище, навіть якщо визначення функції для :meth:`f` вказало аргумент. Що сталося з суперечкою? Звичайно, Python створює виняток, коли функція, яка вимагає аргументу, викликається без будь-якого --- навіть якщо аргумент насправді не використовується...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
uk: Насправді, ви, можливо, здогадалися відповідь: особливість методів полягає в тому, що об’єкт екземпляра передається як перший аргумент функції. У нашому прикладі виклик ``x.f()`` точно еквівалентний ``MyClass.f(x)``. Загалом, виклик методу зі списком *n* аргументів еквівалентний виклику відповідної функції зі списком аргументів, який створюється шляхом вставки об’єкта екземпляра методу перед першим аргументом.

source: If you still don't understand how methods work, a look at the implementation can perhaps clarify matters. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, a method object is created by packing (pointers to) the instance object and the function object just found together in an abstract object: this is the method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
uk: Якщо ви все ще не розумієте, як працюють методи, погляд на реалізацію може прояснити ситуацію. Коли посилається на атрибут екземпляра, що не є даними, виконується пошук у класі екземпляра. Якщо ім’я вказує на дійсний атрибут класу, який є об’єктом функції, об’єкт методу створюється шляхом упаковки (вказівників на) об’єкта екземпляра та об’єкта функції, щойно знайдених разом в абстрактному об’єкті: це об’єкт методу. Коли об’єкт методу викликається зі списком аргументів, новий список аргументів створюється з об’єкта екземпляра та списку аргументів, а об’єкт функції викликається з цим новим списком аргументів.

source: Class and Instance Variables
uk: Змінні класу та екземпляра

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
uk: Загалом, змінні екземпляра призначені для даних, унікальних для кожного екземпляра, а змінні класу призначені для атрибутів і методів, спільних для всіх екземплярів класу::

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
uk: Як обговорювалося в :ref:`tut-object`, спільні дані можуть мати несподіваний ефект із залученням :term:`mutable` об’єктів, таких як списки та словники. Наприклад, список *tricks* у наступному коді не слід використовувати як змінну класу, тому що лише один список буде спільний для всіх екземплярів *Dog*::

source: Correct design of the class should use an instance variable instead::
uk: Правильний дизайн класу повинен використовувати замість змінної екземпляра::

source: Random Remarks
uk: Випадкові зауваження

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
uk: Якщо однакове ім’я атрибута зустрічається як в екземплярі, так і в класі, пошук атрибутів визначає пріоритет екземпляру::

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
uk: На атрибути даних можуть посилатися як методи, так і звичайні користувачі ("клієнти") об'єкта. Іншими словами, класи не можна використовувати для реалізації чистих абстрактних типів даних. Фактично, ніщо в Python не дозволяє примусово приховувати дані --- все базується на конвенції. (З іншого боку, реалізація Python, написана мовою C, може повністю приховати деталі реалізації та контролювати доступ до об’єкта, якщо це необхідно; це можна використовувати розширеннями Python, написаними мовою C.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
uk: Клієнти повинні використовувати атрибути даних обережно --- клієнти можуть зіпсувати інваріанти, які підтримуються методами, штампуючи свої атрибути даних. Зауважте, що клієнти можуть додавати власні атрибути даних до об’єкта екземпляра, не впливаючи на валідність методів, за умови уникнення конфліктів імен --- знову ж таки, угода про іменування може позбавити тут багато головного болю.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
uk: Не існує скорочення для посилання на атрибути даних (або інші методи!) з методів. Я вважаю, що це фактично підвищує читабельність методів: немає жодного шансу сплутати локальні змінні та змінні екземпляра під час перегляду методу.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
uk: Часто перший аргумент методу називається ``self``. Це не що інше, як конвенція: назва ``self`` не має абсолютно ніякого особливого значення для Python. Зауважте, однак, що через недотримання угоди ваш код може бути менш читабельним для інших програмістів на Python, і також можливо, що програма *браузера класів* може бути написана, яка спирається на таку угоду.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
uk: Будь-який функціональний об’єкт, який є атрибутом класу, визначає метод для екземплярів цього класу. Не обов’язково, щоб визначення функції було текстово укладено у визначення класу: присвоєння об’єкта функції локальній змінній у класі також є нормальним. Наприклад::

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`C` that refer to function objects, and consequently they are all methods of instances of :class:`C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
uk: Тепер ``f``, ``g`` і ``h`` — усі атрибути класу :class:`C`, які посилаються на функціональні об’єкти, і, отже, всі вони є методами екземплярів :class:`C` --- ``h`` є точним еквівалентом ``g``. Зауважте, що ця практика зазвичай служить лише для того, щоб заплутати читача програми.

source: Methods may call other methods by using method attributes of the ``self`` argument::
uk: Методи можуть викликати інші методи, використовуючи атрибути методу аргументу ``self``::

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
uk: Методи можуть посилатися на глобальні імена так само, як і звичайні функції. Глобальною областю, пов’язаною з методом, є модуль, що містить його визначення. (Клас ніколи не використовується як глобальна область видимості.) Хоча рідко можна зустріти вагому причину для використання глобальних даних у методі, існує багато законних застосувань глобальної області видимості: з одного боку, функції та модулі, імпортовані в глобальну область видимості, можуть використовуватися методами, а також функціями та класами, визначеними в ньому. Зазвичай клас, що містить метод, сам визначений у цій глобальній області видимості, і в наступному розділі ми знайдемо кілька вагомих причин, чому метод хоче посилатися на власний клас.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
uk: Кожне значення є об’єктом і, отже, має *клас* (також називається його *типом*). Він зберігається як ``object.__class__``.

source: Inheritance
uk: Спадщина

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
uk: Звичайно, функція мови не була б гідною назви "клас" без підтримки успадкування. Синтаксис для визначення похідного класу виглядає так:

source: The name :class:`BaseClassName` must be defined in a scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
uk: Ім’я :class:`BaseClassName` має бути визначено в області, що містить визначення похідного класу. Замість назви базового класу також допускаються інші довільні вирази. Це може бути корисно, наприклад, коли базовий клас визначено в іншому модулі:

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
uk: Виконання визначення похідного класу відбувається так само, як і для базового класу. Коли об'єкт класу створено, базовий клас запам'ятовується. Це використовується для вирішення посилань на атрибути: якщо запитуваний атрибут не знайдено в класі, пошук продовжується до базового класу. Це правило застосовується рекурсивно, якщо сам базовий клас є похідним від якогось іншого класу.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
uk: У створенні похідних класів немає нічого особливого: ``DerivedClassName()`` створює новий екземпляр класу. Посилання на метод розв’язуються наступним чином: виконується пошук відповідного атрибута класу, спускаючись вниз по ланцюжку базових класів, якщо необхідно, і посилання на метод є дійсним, якщо це дає об’єкт функції.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
uk: Похідні класи можуть перевизначати методи своїх базових класів. Оскільки методи не мають спеціальних привілеїв під час виклику інших методів того самого об’єкта, метод базового класу, який викликає інший метод, визначений у тому самому базовому класі, може призвести до виклику методу похідного класу, який замінює його. (Для програмістів C++: усі методи в Python фактично "віртуальні".)

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
uk: Перевизначений метод у похідному класі може фактично захотіти розширити, а не просто замінити однойменний метод базового класу. Існує простий спосіб безпосередньо викликати метод базового класу: просто викличте ``BaseClassName.methodname(self, arguments)``. Це також іноді корисно для клієнтів. (Зауважте, що це працює, лише якщо базовий клас доступний як ``BaseClassName`` у глобальній області.)

source: Python has two built-in functions that work with inheritance:
uk: Python має дві вбудовані функції, які працюють із успадкуванням:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
uk: Використовуйте :func:`isinstance`, щоб перевірити тип екземпляра: ``isinstance(obj, int)`` буде ``True`` лише якщо ``obj.__class__`` є :class:`int` або якийсь похідний клас з :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
uk: Використовуйте :func:`issubclass`, щоб перевірити успадкування класу: ``issubclass(bool, int)`` має значення ``True``, оскільки :class:`bool` є підкласом :class:`int`. Однак ``issubclass(float, int)`` є ``False``, оскільки :class:`float` не є підкласом :class:`int`.

source: Multiple Inheritance
uk: Множинне успадкування

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
uk: Python також підтримує форму множинного успадкування. Визначення класу з кількома базовими класами виглядає так:

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`DerivedClassName`, it is searched for in :class:`Base1`, then (recursively) in the base classes of :class:`Base1`, and if it was not found there, it was searched for in :class:`Base2`, and so on.
uk: Для більшості цілей, у найпростіших випадках, ви можете думати про пошук атрибутів, успадкованих від батьківського класу, як про пошук у глибину, зліва направо, а не пошук двічі в тому самому класі, де є перекриття в ієрархії. Таким чином, якщо атрибут не знайдено в :class:`DerivedClassName`, він шукається в :class:`Base1`, потім (рекурсивно) в базових класах :class:`Base1`, а якщо він не знайдений там його шукали в :class:`Base2` і так далі.

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
uk: Насправді це трохи складніше; порядок вирішення методів динамічно змінюється для підтримки кооперативних викликів :func:`super`. Цей підхід відомий у деяких інших мовах із множинним успадкуванням як call-next-method і є потужнішим, ніж супервиклик у мовах з одним успадкуванням.
