Repository: python/python-docs-uk
Catalog: tutorial/classes.po
Languages: uk

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see https://www.python.org/download/releases/2.3/mro/.
uk: Динамічне впорядкування є необхідним, тому що всі випадки множинного успадкування демонструють один або більше ромбоподібних зв’язків (де принаймні до одного з батьківських класів можна отримати доступ через кілька шляхів із найнижчого класу). Наприклад, усі класи успадковуються від :class:`object`, тому будь-який випадок множинного успадкування забезпечує більше ніж один шлях для досягнення :class:`object`. Щоб запобігти повторному доступу до базових класів, динамічний алгоритм лінеаризує порядок пошуку таким чином, що зберігає порядок зліва направо, визначений у кожному класі, що викликає кожного батьківського елемента лише один раз, і це є монотонним (це означає, що клас може бути підкласом, не впливаючи на порядок пріоритету його батьків). У сукупності ці властивості дозволяють створювати надійні та розширювані класи з множинним успадкуванням. Для отримання додаткової інформації див. https://www.python.org/download/releases/2.3/mro/.

source: Private Variables
uk: Приватні змінні

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
uk: "Приватні" змінні екземпляра, до яких можна отримати доступ лише зсередини об’єкта, не існують у Python. Проте існує конвенція, якої дотримується більшість коду Python: ім’я з префіксом підкреслення (наприклад, ``_spam``) має розглядатися як непублічна частина API (незалежно від того, чи це функція, метод чи член даних). Це слід розглядати як деталь впровадження та може бути змінено без попередження.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
uk: Оскільки існує дійсний варіант використання для приватних членів класу (а саме, щоб уникнути зіткнень імен імен з іменами, визначеними підкласами), існує обмежена підтримка такого механізму, що називається :dfn:`name mangling`. Будь-який ідентифікатор у формі ``__spam`` (принаймні два символи підкреслення на початку, не більше одного символу підкреслення в кінці) текстово замінюється на ``_classname__spam``, де ``classname`` є поточною назвою класу з підкресленням на початку оголений. Це спотворення виконується без урахування синтаксичної позиції ідентифікатора, доки воно трапляється у визначенні класу.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
uk: Викривлення імен корисне для того, щоб дозволити підкласам перевизначати методи, не порушуючи виклики внутрішньокласових методів. Наприклад::

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
uk: Наведений вище приклад працював би, навіть якби ``MappingSubclass`` вводив ідентифікатор ``__update``, оскільки він замінений на ``_Mapping__update`` у ``Mapping`` класі ``_MappingSubclass__update`` у ``Клас MappingSubclass`` відповідно.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
uk: Зауважте, що правила псування призначені здебільшого для уникнення нещасних випадків; все ще можна отримати доступ або змінити змінну, яка вважається приватною. Це навіть може бути корисним за особливих обставин, наприклад, у налагоджувачі.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
uk: Зауважте, що код, переданий у ``exec()`` або ``eval()``, не вважає назву класу викликаного класу поточним класом; це схоже на дію оператора ``global``, дія якого так само обмежена кодом, який скомпільовано разом. Те саме обмеження стосується getattr(), setattr() і delattr(), а також прямого посилання на __dict__.

source: Odds and Ends
uk: Обривки

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. An empty class definition will do nicely::
uk: Іноді корисно мати тип даних, схожий на Pascal "record" або C "struct", об'єднуючи кілька іменованих елементів даних. Порожнє визначення класу підійде:

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`read` and :meth:`!readline` that get the data from a string buffer instead, and pass it as an argument.
uk: Фрагмент коду Python, який очікує певний абстрактний тип даних, часто можна передати класу, який емулює методи цього типу даних. Наприклад, якщо у вас є функція, яка форматує деякі дані з файлового об’єкта, ви можете визначити клас за допомогою методів :meth:`read` і :meth:`!readline`, які натомість отримують дані з рядкового буфера та передають це як аргумент.

source: Instance method objects have attributes, too: ``m.__self__`` is the instance object with the method :meth:`m`, and ``m.__func__`` is the function object corresponding to the method.
uk: Об’єкти методів екземплярів також мають атрибути: ``m.__self__`` — об’єкт екземпляра з методом :meth:`m`, а ``m.__func__`` — об’єкт функції, що відповідає методу.

source: Iterators
uk: Ітератори

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
uk: Наразі ви, мабуть, помітили, що більшість об’єктів-контейнерів можна зациклювати за допомогою оператора :keyword:`for`::

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
uk: Цей стиль доступу є зрозумілим, лаконічним і зручним. Використання ітераторів пронизує й уніфікує Python. За лаштунками оператор :keyword:`for` викликає :func:`iter` об’єкта контейнера. Функція повертає об’єкт-ітератор, який визначає метод :meth:`~iterator.__next__`, який отримує доступ до елементів у контейнері по одному. Коли елементів більше немає, :meth:`~iterator.__next__` викликає виняток :exc:`StopIteration`, який повідомляє циклу :keyword:`!for` про завершення. Ви можете викликати метод :meth:`~iterator.__next__` за допомогою вбудованої функції :func:`next`; цей приклад показує, як це все працює:

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`__next__`, then :meth:`__iter__` can just return ``self``::
uk: Побачивши механіку протоколу ітератора, можна легко додати поведінку ітератора до своїх класів. Визначте метод :meth:`__iter__`, який повертає об’єкт за допомогою методу :meth:`~iterator.__next__`. Якщо клас визначає :meth:`__next__`, тоді :meth:`__iter__` може просто повернути ``self``::

source: Generators
uk: Генератори

source: :term:`Generators <generator>` are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
uk: :term:`Generators <generator>` — простий і потужний інструмент для створення ітераторів. Вони написані як звичайні функції, але використовують оператор :keyword:`yield`, коли вони хочуть повернути дані. Кожного разу, коли на ньому викликається :func:`next`, генератор продовжує роботу з того місця, де зупинився (він запам’ятовує всі значення даних і який оператор був виконаний останнім). Приклад показує, що генератори можна тривіально легко створити:

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`__iter__` and :meth:`~generator.__next__` methods are created automatically.
uk: Усе, що можна зробити за допомогою генераторів, також можна зробити за допомогою ітераторів на основі класів, як описано в попередньому розділі. Що робить генератори такими компактними, так це те, що методи :meth:`__iter__` і :meth:`~generator.__next__` створюються автоматично.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
uk: Інша ключова особливість полягає в тому, що локальні змінні та стан виконання автоматично зберігаються між викликами. Це зробило функцію легшою для написання та набагато зрозумілішою, ніж підхід із використанням змінних екземплярів, таких як ``self.index`` і ``self.data``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
uk: На додаток до автоматичного створення методу та збереження стану програми, коли генератори завершуються, вони автоматично викликають :exc:`StopIteration`. У поєднанні ці функції дозволяють легко створювати ітератори без зусиль, ніж написання звичайної функції.

source: Generator Expressions
uk: Генератор виразів

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
uk: Деякі прості генератори можна коротко закодувати як вирази за допомогою синтаксису, схожого на розуміння списків, але з круглими дужками замість квадратних. Ці вирази розроблені для ситуацій, коли генератор використовується одразу функцією охоплення. Вирази генератора є більш компактними, але менш універсальними, ніж повні визначення генераторів, і, як правило, більш зручні для пам’яті, ніж еквівалентні списки.

source: Examples::
uk: Приклади::

source: Footnotes
uk: Виноски

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name :attr:`~object.__dict__` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
uk: За винятком одного. Об’єкти модуля мають секретний атрибут лише для читання під назвою :attr:`~object.__dict__`, який повертає словник, використаний для реалізації простору імен модуля; ім'я :attr:`~object.__dict__` є атрибутом, але не глобальним іменем. Очевидно, що використання цього порушує абстракцію реалізації простору імен, і його слід обмежити такими речами, як посмертні відладчики.
