Repository: python/python-docs-uk
Catalog: tutorial/classes.po
Languages: uk

source: Classes
uk: Класи

source: Classes provide a means of bundling data and functionality together. Creating a new class creates a new *type* of object, allowing new *instances* of that type to be made. Each class instance can have attributes attached to it for maintaining its state. Class instances can also have methods (defined by its class) for modifying its state.
uk: Класи надають засоби об’єднання даних і функціональних можливостей. Створення нового класу створює новий *тип* об’єкта, що дозволяє створювати нові *примірники* цього типу. Кожен екземпляр класу може мати атрибути, приєднані до нього для підтримки його стану. Екземпляри класу також можуть мати методи (визначені його класом) для зміни свого стану.

source: Compared with other programming languages, Python's class mechanism adds classes with a minimum of new syntax and semantics. It is a mixture of the class mechanisms found in C++ and Modula-3. Python classes provide all the standard features of Object Oriented Programming: the class inheritance mechanism allows multiple base classes, a derived class can override any methods of its base class or classes, and a method can call the method of a base class with the same name. Objects can contain arbitrary amounts and kinds of data. As is true for modules, classes partake of the dynamic nature of Python: they are created at runtime, and can be modified further after creation.
uk: Порівняно з іншими мовами програмування, механізм класів Python додає класи з мінімумом нового синтаксису та семантики. Це суміш механізмів класів, знайдених у C++ і Modula-3. Класи Python забезпечують усі стандартні функції об’єктно-орієнтованого програмування: механізм успадкування класів дозволяє створювати кілька базових класів, похідний клас може перевизначати будь-які методи свого базового класу або класів, а метод може викликати метод базового класу з тим самим іменем. . Об’єкти можуть містити довільні обсяги та типи даних. Як і для модулів, класи мають динамічну природу Python: вони створюються під час виконання та можуть бути змінені далі після створення.

source: In C++ terminology, normally class members (including the data members) are *public* (except see below :ref:`tut-private`), and all member functions are *virtual*. As in Modula-3, there are no shorthands for referencing the object's members from its methods: the method function is declared with an explicit first argument representing the object, which is provided implicitly by the call. As in Smalltalk, classes themselves are objects. This provides semantics for importing and renaming. Unlike C++ and Modula-3, built-in types can be used as base classes for extension by the user. Also, like in C++, most built-in operators with special syntax (arithmetic operators, subscripting etc.) can be redefined for class instances.
uk: У термінології C++ зазвичай члени класу (включно з членами даних) є *публічними* (за винятком див. нижче :ref:`tut-private`), а всі функції-члени є *віртуальними*. Як і в Modula-3, немає скорочень для посилань на члени об’єкта з його методів: функція методу оголошується з явним першим аргументом, що представляє об’єкт, який неявно надається викликом. Як і в Smalltalk, класи самі є об'єктами. Це забезпечує семантику для імпортування та перейменування. На відміну від C++ і Modula-3, вбудовані типи можуть використовуватися як базові класи для розширення користувачем. Також, як і в C++, більшість вбудованих операторів зі спеціальним синтаксисом (арифметичні оператори, індексування тощо) можна перевизначати для екземплярів класу.

source: (Lacking universally accepted terminology to talk about classes, I will make occasional use of Smalltalk and C++ terms. I would use Modula-3 terms, since its object-oriented semantics are closer to those of Python than C++, but I expect that few readers have heard of it.)
uk: (Через відсутність загальноприйнятої термінології для розмови про класи, я час від часу використовую терміни Smalltalk і C++. Я б використовував терміни Modula-3, оскільки його об’єктно-орієнтована семантика ближча до семантики Python, ніж C++, але я очікую, що мало читачів чув про це.)

source: A Word About Names and Objects
uk: Слово про імена та предмети

source: Objects have individuality, and multiple names (in multiple scopes) can be bound to the same object. This is known as aliasing in other languages. This is usually not appreciated on a first glance at Python, and can be safely ignored when dealing with immutable basic types (numbers, strings, tuples). However, aliasing has a possibly surprising effect on the semantics of Python code involving mutable objects such as lists, dictionaries, and most other types. This is usually used to the benefit of the program, since aliases behave like pointers in some respects. For example, passing an object is cheap since only a pointer is passed by the implementation; and if a function modifies an object passed as an argument, the caller will see the change --- this eliminates the need for two different argument passing mechanisms as in Pascal.
uk: Об’єкти мають індивідуальність, і кілька імен (у кількох областях) можуть бути прив’язані до одного об’єкта. Це відоме як псевдонім в інших мовах. Це зазвичай не оцінюється з першого погляду на Python, і його можна сміливо ігнорувати, коли маєте справу з незмінними базовими типами (числа, рядки, кортежі). Однак псевдонім має, можливо, дивовижний ефект на семантику коду Python, що включає змінні об’єкти, такі як списки, словники та більшість інших типів. Зазвичай це використовується на користь програми, оскільки псевдоніми в деяких аспектах поводяться як покажчики. Наприклад, передача об'єкта дешева, оскільки реалізація передає лише покажчик; і якщо функція змінює об’єкт, переданий як аргумент, абонент побачить зміни --- це усуває потребу у двох різних механізмах передачі аргументів, як у Pascal.

source: Python Scopes and Namespaces
uk: Області та простори імен Python

source: Before introducing classes, I first have to tell you something about Python's scope rules. Class definitions play some neat tricks with namespaces, and you need to know how scopes and namespaces work to fully understand what's going on. Incidentally, knowledge about this subject is useful for any advanced Python programmer.
uk: Перш ніж представити класи, я спершу маю розповісти вам дещо про правила видимості Python. Визначення класів грають влучні трюки з просторами імен, і вам потрібно знати, як працюють області та простори імен, щоб повністю зрозуміти, що відбувається. До речі, знання з цієї теми знадобляться будь-якому досвідченому програмісту на Python.

source: Let's begin with some definitions.
uk: Почнемо з деяких визначень.

source: A *namespace* is a mapping from names to objects. Most namespaces are currently implemented as Python dictionaries, but that's normally not noticeable in any way (except for performance), and it may change in the future. Examples of namespaces are: the set of built-in names (containing functions such as :func:`abs`, and built-in exception names); the global names in a module; and the local names in a function invocation. In a sense the set of attributes of an object also form a namespace. The important thing to know about namespaces is that there is absolutely no relation between names in different namespaces; for instance, two different modules may both define a function ``maximize`` without confusion --- users of the modules must prefix it with the module name.
uk: *Простір імен* — це відображення імен на об’єкти. Більшість просторів імен наразі реалізовано як словники Python, але зазвичай це нічим не помітно (за винятком продуктивності), і це може змінитися в майбутньому. Прикладами просторів імен є: набір вбудованих імен (що містять такі функції, як :func:`abs`, і вбудовані імена винятків); глобальні імена в модулі; і локальні імена під час виклику функції. У певному сенсі набір атрибутів об'єкта також формує простір імен. Важливо знати про простори імен, що між іменами в різних просторах імен немає абсолютно ніякого зв’язку; наприклад, обидва різні модулі можуть визначати функцію ``maximize`` без плутанини --- користувачі модулів повинні додавати перед нею назву модуля.

source: By the way, I use the word *attribute* for any name following a dot --- for example, in the expression ``z.real``, ``real`` is an attribute of the object ``z``. Strictly speaking, references to names in modules are attribute references: in the expression ``modname.funcname``, ``modname`` is a module object and ``funcname`` is an attribute of it. In this case there happens to be a straightforward mapping between the module's attributes and the global names defined in the module: they share the same namespace! [#]_
uk: До речі, я використовую слово *attribute* для будь-якого імені після крапки --- наприклад, у виразі ``z.real``, ``real`` є атрибутом об’єкта ``z`` . Строго кажучи, посилання на імена в модулях є посиланнями на атрибути: у виразі ``modname.funcname``, ``modname`` є об’єктом модуля, а ``funcname`` є його атрибутом. У цьому випадку відбувається пряме відображення між атрибутами модуля та глобальними іменами, визначеними в модулі: вони спільно використовують той самий простір імен! [#]_

source: Attributes may be read-only or writable. In the latter case, assignment to attributes is possible. Module attributes are writable: you can write ``modname.the_answer = 42``. Writable attributes may also be deleted with the :keyword:`del` statement. For example, ``del modname.the_answer`` will remove the attribute :attr:`the_answer` from the object named by ``modname``.
uk: Атрибути можуть бути доступними лише для читання або запису. В останньому випадку можливе призначення атрибутів. Атрибути модуля доступні для запису: ви можете написати ``modname.the_answer = 42``. Атрибути, доступні для запису, також можна видалити за допомогою оператора :keyword:`del`. Наприклад, ``del modname.the_answer`` видалить атрибут :attr:`the_answer` з об’єкта, названого ``modname``.

source: Namespaces are created at different moments and have different lifetimes. The namespace containing the built-in names is created when the Python interpreter starts up, and is never deleted. The global namespace for a module is created when the module definition is read in; normally, module namespaces also last until the interpreter quits. The statements executed by the top-level invocation of the interpreter, either read from a script file or interactively, are considered part of a module called :mod:`__main__`, so they have their own global namespace. (The built-in names actually also live in a module; this is called :mod:`builtins`.)
uk: Простори імен створюються в різний момент і мають різний час життя. Простір імен, що містить вбудовані імена, створюється під час запуску інтерпретатора Python і ніколи не видаляється. Глобальний простір імен для модуля створюється, коли зчитується визначення модуля; зазвичай простори імен модулів також зберігаються, доки інтерпретатор не завершить роботу. Інструкції, що виконуються за допомогою виклику інтерпретатора верхнього рівня, або прочитані з файлу сценарію, або в інтерактивному режимі, вважаються частиною модуля під назвою :mod:`__main__`, тому вони мають власний глобальний простір імен. (Вбудовані імена насправді також містяться в модулі; це називається :mod:`builtins`.)

source: The local namespace for a function is created when the function is called, and deleted when the function returns or raises an exception that is not handled within the function. (Actually, forgetting would be a better way to describe what actually happens.) Of course, recursive invocations each have their own local namespace.
uk: Локальний простір імен для функції створюється під час виклику функції та видаляється, коли функція повертає або викликає виняткову ситуацію, яка не обробляється цією функцією. (Насправді, забування було б кращим способом описати те, що насправді відбувається.) Звичайно, кожен рекурсивний виклик має свій власний локальний простір імен.

source: A *scope* is a textual region of a Python program where a namespace is directly accessible. "Directly accessible" here means that an unqualified reference to a name attempts to find the name in the namespace.
uk: *Область* — це текстова область програми Python, де простір імен доступний безпосередньо. "Безпосередній доступ" тут означає, що некваліфіковане посилання на ім’я намагається знайти ім’я в просторі імен.

source: Although scopes are determined statically, they are used dynamically. At any time during execution, there are 3 or 4 nested scopes whose namespaces are directly accessible:
uk: Хоча області визначаються статично, вони використовуються динамічно. У будь-який час під час виконання є 3 або 4 вкладені області, простори імен яких доступні безпосередньо:

source: the innermost scope, which is searched first, contains the local names
uk: внутрішня область, яка шукається першою, містить локальні назви

source: the scopes of any enclosing functions, which are searched starting with the nearest enclosing scope, contains non-local, but also non-global names
uk: області будь-яких охоплюючих функцій, які шукаються, починаючи з найближчої охоплюючої області, містить не локальні, але також і неглобальні імена

source: the next-to-last scope contains the current module's global names
uk: передостання область містить глобальні імена поточного модуля

source: the outermost scope (searched last) is the namespace containing built-in names
uk: крайня область (шукається останньою) — це простір імен, що містить вбудовані імена

source: If a name is declared global, then all references and assignments go directly to the middle scope containing the module's global names. To rebind variables found outside of the innermost scope, the :keyword:`nonlocal` statement can be used; if not declared nonlocal, those variables are read-only (an attempt to write to such a variable will simply create a *new* local variable in the innermost scope, leaving the identically named outer variable unchanged).
uk: Якщо ім’я оголошено глобальним, тоді всі посилання та призначення переходять безпосередньо до середньої області, що містить глобальні імена модуля. Щоб повторно прив’язати змінні, знайдені за межами внутрішньої області, можна використати оператор :keyword:`nonlocal`; якщо не оголошено нелокальними, ці змінні доступні лише для читання (спроба запису в таку змінну просто створить *нову* локальну змінну у внутрішній області видимості, залишаючи зовнішню змінну з однаковою назвою без змін).

source: Usually, the local scope references the local names of the (textually) current function. Outside functions, the local scope references the same namespace as the global scope: the module's namespace. Class definitions place yet another namespace in the local scope.
uk: Зазвичай локальна область посилається на локальні імена поточної (текстової) функції. Поза функціями локальна область посилається на той самий простір імен, що й глобальна область: простір імен модуля. Визначення класу розміщують ще один простір імен у локальній області.

source: It is important to realize that scopes are determined textually: the global scope of a function defined in a module is that module's namespace, no matter from where or by what alias the function is called. On the other hand, the actual search for names is done dynamically, at run time --- however, the language definition is evolving towards static name resolution, at "compile" time, so don't rely on dynamic name resolution! (In fact, local variables are already determined statically.)
uk: Важливо розуміти, що області визначаються текстово: глобальна область дії функції, визначеної в модулі, є простором імен цього модуля, незалежно від того, звідки чи яким псевдонімом викликається функція. З іншого боку, фактичний пошук імен виконується динамічно, під час виконання --- однак визначення мови розвивається в бік статичного дозволу імен під час "компіляції", тому не покладайтеся на динамічне дозвіл імен! (Насправді локальні змінні вже визначені статично.)

source: A special quirk of Python is that -- if no :keyword:`global` or :keyword:`nonlocal` statement is in effect -- assignments to names always go into the innermost scope. Assignments do not copy data --- they just bind names to objects. The same is true for deletions: the statement ``del x`` removes the binding of ``x`` from the namespace referenced by the local scope. In fact, all operations that introduce new names use the local scope: in particular, :keyword:`import` statements and function definitions bind the module or function name in the local scope.
uk: Особлива примха Python полягає в тому, що, якщо не діють оператори :keyword:`global` або :keyword:`nonlocal`, призначення імен завжди потрапляють у найглибшу область видимості. Призначення не копіюють дані --- вони просто прив’язують імена до об’єктів. Те саме стосується видалень: оператор ``del x`` видаляє прив’язку ``x`` із простору імен, на який посилається локальна область видимості. Насправді всі операції, які вводять нові імена, використовують локальну область видимості: зокрема, оператори :keyword:`import` і визначення функцій прив’язують назву модуля або функції в локальній області видимості.

source: The :keyword:`global` statement can be used to indicate that particular variables live in the global scope and should be rebound there; the :keyword:`nonlocal` statement indicates that particular variables live in an enclosing scope and should be rebound there.
uk: Інструкція :keyword:`global` може бути використана, щоб вказати, що певні змінні живуть у глобальній області видимості та мають бути перенаправлені туди; оператор :keyword:`nonlocal` вказує на те, що певні змінні живуть в охоплюючій області видимості і мають бути перенаправлені туди.

source: Scopes and Namespaces Example
uk: Приклад областей і просторів імен

source: This is an example demonstrating how to reference the different scopes and namespaces, and how :keyword:`global` and :keyword:`nonlocal` affect variable binding::
uk: Це приклад, який демонструє, як посилатися на різні області та простори імен, і як :keyword:`global` і :keyword:`nonlocal` впливають на зв’язування змінних::

source: The output of the example code is:
uk: Результат коду прикладу:

source: Note how the *local* assignment (which is default) didn't change *scope_test*\'s binding of *spam*. The :keyword:`nonlocal` assignment changed *scope_test*\'s binding of *spam*, and the :keyword:`global` assignment changed the module-level binding.
uk: Зверніть увагу, що призначення *local* (яке є типовим) не змінило прив’язки *scope_test* до *spam*. Призначення :keyword:`nonlocal` змінило прив’язку *scope_test*\ до *спаму*, а призначення :keyword:`global` змінило прив’язку на рівні модуля.

source: You can also see that there was no previous binding for *spam* before the :keyword:`global` assignment.
uk: Ви також можете побачити, що не було попереднього зв’язування для *spam* перед призначенням :keyword:`global`.

source: A First Look at Classes
uk: Перший погляд на заняття

source: Classes introduce a little bit of new syntax, three new object types, and some new semantics.
uk: Класи представляють трохи нового синтаксису, три нових типи об’єктів і нову семантику.

source: Class Definition Syntax
uk: Синтаксис визначення класу

source: The simplest form of class definition looks like this::
uk: Найпростіша форма визначення класу виглядає так:

source: Class definitions, like function definitions (:keyword:`def` statements) must be executed before they have any effect. (You could conceivably place a class definition in a branch of an :keyword:`if` statement, or inside a function.)
uk: Визначення класів, як і визначення функцій (оператори :keyword:`def`), мають бути виконані, перш ніж вони матимуть будь-який ефект. (Імовірно, ви можете розмістити визначення класу в гілці оператора :keyword:`if` або всередині функції.)

source: In practice, the statements inside a class definition will usually be function definitions, but other statements are allowed, and sometimes useful --- we'll come back to this later. The function definitions inside a class normally have a peculiar form of argument list, dictated by the calling conventions for methods --- again, this is explained later.
uk: На практиці оператори всередині визначення класу зазвичай є визначеннями функцій, але допускаються й інші оператори, іноді корисні --- ми повернемося до цього пізніше. Визначення функції всередині класу зазвичай мають особливу форму списку аргументів, продиктовану умовами виклику методів --- знову ж таки, це пояснюється пізніше.

source: When a class definition is entered, a new namespace is created, and used as the local scope --- thus, all assignments to local variables go into this new namespace. In particular, function definitions bind the name of the new function here.
uk: Коли вводиться визначення класу, створюється новий простір імен і використовується як локальна область --- таким чином, усі призначення локальним змінним переходять до цього нового простору імен. Зокрема, визначення функції прив’язують тут назву нової функції.

source: When a class definition is left normally (via the end), a *class object* is created. This is basically a wrapper around the contents of the namespace created by the class definition; we'll learn more about class objects in the next section. The original local scope (the one in effect just before the class definition was entered) is reinstated, and the class object is bound here to the class name given in the class definition header (:class:`ClassName` in the example).
uk: Коли визначення класу залишається звичайним способом (через кінець), створюється *об’єкт класу*. По суті, це оболонка навколо вмісту простору імен, створеного визначенням класу; ми дізнаємось більше про об’єкти класу в наступному розділі. Початкова локальна область (та, що діяла безпосередньо перед тим, як було введено визначення класу) відновлюється, а об’єкт класу прив’язується тут до імені класу, указаного в заголовку визначення класу (:class:`ClassName` у прикладі).

source: Class Objects
uk: Об'єкти класу

source: Class objects support two kinds of operations: attribute references and instantiation.
uk: Об’єкти класу підтримують два типи операцій: посилання на атрибути та інстанціювання.

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
uk: *Посилання на атрибути* використовують стандартний синтаксис, який використовується для всіх посилань на атрибути в Python: ``obj.name``. Дійсні імена атрибутів — це всі імена, які були в просторі імен класу під час створення об’єкта класу. Отже, якби визначення класу виглядало так::

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
uk: тоді ``MyClass.i`` і ``MyClass.f`` є дійсними посиланнями на атрибути, які повертають ціле число та об’єкт функції відповідно. Атрибути класу також можна призначити, тому ви можете змінити значення ``MyClass.i`` шляхом призначення. :attr:`__doc__` також є дійсним атрибутом, який повертає рядок документації, що належить до класу: ``"Простий приклад класу"``.
