Repository: python/python-docs-uk
Catalog: tutorial/controlflow.po
Languages: uk

source: More Control Flow Tools
uk: Більше інструментів керування потоком

source: :keyword:`!if` Statements
uk: :keyword:`!if` Інструкції

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
uk: Мабуть, найвідомішим типом операторів є оператор :keyword:`if`. Наприклад::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
uk: Частин :keyword:`elif` може бути нуль або більше, а частина :keyword:`else` необов’язкова. Ключове слово ':keyword:`!elif`' є скороченням від 'else if' і корисне, щоб уникнути надмірних відступів. Послідовність :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... є заміною знайдених операторів ``switch`` або ``case`` іншими мовами.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
uk: Якщо ви порівнюєте те саме значення з декількома константами або перевіряєте певні типи чи атрибути, вам також може бути корисним оператор :keyword:`!match`. Детальніше див. :ref:`tut-match`.

source: :keyword:`!for` Statements
uk: :keyword:`!for` Заяви

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
uk: Оператор :keyword:`for` у Python дещо відрізняється від того, до чого ви звикли в C або Pascal. Замість того, щоб завжди повторювати арифметичну прогресію чисел (як у Паскалі) або давати користувачеві можливість визначати крок ітерації та умову зупинки (як C), оператор Python :keyword:`!for` повторює елементи будь-яка послідовність (список або рядок) у тому порядку, в якому вони з’являються в послідовності. Наприклад (без каламбуру):

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
uk: Код, який змінює колекцію під час ітерації над цією ж колекцією, може бути складним для правильного визначення. Замість цього зазвичай простіше виконати цикл по копії колекції або створити нову колекцію:

source: The :func:`range` Function
uk: Функція :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
uk: Якщо вам все-таки потрібно виконати ітерацію по послідовності чисел, стане в нагоді вбудована функція :func:`range`. Він створює арифметичні прогресії:

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
uk: Дана кінцева точка ніколи не є частиною згенерованої послідовності; ``range(10)`` генерує 10 значень, законних індексів для елементів послідовності довжиною 10. Можна дозволити діапазону починатися з іншого числа або вказати інший крок (навіть від’ємний; іноді це називається "крок")::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
uk: Щоб перебирати індекси послідовності, ви можете поєднати :func:`range` і :func:`len` таким чином:

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
uk: Однак у більшості таких випадків зручно використовувати функцію :func:`enumerate`, див. :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
uk: Дивна річ трапляється, якщо ви просто друкуєте діапазон::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
uk: Багато в чому об’єкт, який повертає :func:`range`, поводиться так, ніби це список, але насправді це не так. Це об’єкт, який повертає послідовні елементи потрібної послідовності, коли ви перебираєте його, але насправді він не входить до списку, таким чином економлячи місце.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
uk: Ми кажемо, що такий об’єкт є :term:`iterable`, тобто придатним як ціль для функцій і конструкцій, які очікують чогось, з чого вони можуть отримувати послідовні елементи, доки запас не буде вичерпано. Ми бачили, що оператор :keyword:`for` є такою конструкцією, тоді як прикладом функції, яка приймає ітерований елемент, є :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
uk: Пізніше ми побачимо більше функцій, які повертають iterables і приймають iterables як аргументи. У розділі :ref:`tut-structures` ми більш детально обговоримо :func:`list`.

source: :keyword:`!pass` Statements
uk: :keyword:`!pass` Інструкції

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
uk: Оператор :keyword:`pass` нічого не робить. Його можна використовувати, коли оператор потрібен синтаксично, але програма не вимагає жодних дій. Наприклад::

source: This is commonly used for creating minimal classes::
uk: Це зазвичай використовується для створення мінімальних класів:

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
uk: Інше місце, яке можна використовувати :keyword:`pass`, це як заповнювач для функції або умовного тіла, коли ви працюєте над новим кодом, що дозволяє вам продовжувати мислити на більш абстрактному рівні. :keyword:`!pass` мовчки ігнорується::

source: :keyword:`!match` Statements
uk: :keyword:`!match` Інструкції

source: The simplest form compares a subject value against one or more literals::
uk: Найпростіша форма порівнює значення предмета з одним або кількома літералами::

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match. If no case matches, none of the branches is executed.
uk: Зверніть увагу на останній блок: "ім’я змінної" ``_`` діє як *знак підстановки* і ніколи не збігається. Якщо жоден регістр не відповідає, жодна з гілок не виконується.

source: You can combine several literals in a single pattern using ``|`` ("or")::
uk: Ви можете поєднати кілька літералів в одному шаблоні за допомогою ``|`` ("або")::

source: Patterns can look like unpacking assignments, and can be used to bind variables::
uk: Патерни можуть виглядати як завдання розпакування, і їх можна використовувати для зв’язування змінних::

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
uk: Вивчіть це уважно! Перший шаблон містить два літерали, і його можна розглядати як розширення літерального шаблону, показаного вище. Але наступні два шаблони поєднують літерал і змінну, а змінна *зв’язує* значення з теми (``точка``). Четвертий шаблон фіксує два значення, що робить його концептуально подібним до призначення розпакування ``(x, y) = point``.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
uk: Якщо ви використовуєте класи для структурування своїх даних, ви можете використовувати назву класу, за якою слідує список аргументів, схожий на конструктор, але з можливістю запису атрибутів у змінні::

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
uk: Ви можете використовувати позиційні параметри з деякими вбудованими класами, які забезпечують порядок для своїх атрибутів (наприклад, класи даних). Ви також можете визначити конкретну позицію для атрибутів у шаблонах, встановивши спеціальний атрибут ``__match_args__`` у своїх класах. Якщо для нього встановлено значення ("x", "y"), усі наступні шаблони еквівалентні (і всі прив'язують атрибут ``y`` до змінної ``var``):

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
uk: Рекомендований спосіб читання шаблонів — розглядати їх як розширену форму того, що ви розміщуєте ліворуч від призначення, щоб зрозуміти, яким змінним буде встановлено значення. Лише автономні імена (як ``var`` вище) призначаються оператором відповідності. Назви з крапками (наприклад, ``foo.bar``), назви атрибутів (``x=`` і ``y=`` вище) або назви класів (розпізнаються за "(...)" поруч із ними, як ``Точка`` вище) ніколи не призначаються.

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
uk: Ми можемо додати умову ``if`` до шаблону, відомого як "guard". Якщо guard false, ``match`` переходить до наступного блоку case. Зауважте, що захоплення значення відбувається до оцінки захисника:

source: Several other key features of this statement:
uk: Кілька інших ключових особливостей цього твердження:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
uk: Подібно до завдань розпакування, шаблони кортежу та списку мають однакове значення та фактично відповідають довільним послідовностям. Важливим винятком є те, що вони не відповідають ітераторам або рядкам.

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
uk: Шаблони послідовності підтримують розширене розпакування: ``[x, y, *rest]`` і ``(x, y, *rest)`` працюють подібно до призначень розпакування. Ім’я після ``*`` також може бути ``_``, тому ``(x, y, *_)`` відповідає послідовності принаймні двох елементів без зв’язування решти елементів.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
uk: Шаблони зіставлення: ``{"bandwidth": b, "latency": l}`` фіксує значення ``"bandwidth"`` і ``"latency"`` зі словника. На відміну від шаблонів послідовності, додаткові ключі ігноруються. Також підтримується розпакування на зразок ``**rest``. (Але ``**_`` буде зайвим, тому це заборонено.)

source: Subpatterns may be captured using the ``as`` keyword::
uk: Підшаблони можуть бути захоплені за допомогою ключового слова ``as``::

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
uk: захопить другий елемент вхідних даних як ``p2`` (якщо вхідні дані є послідовністю з двох точок)

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
uk: Більшість літералів порівнюються за рівністю, однак синглетони ``True``, ``False`` і ``None`` порівнюються за тотожністю.

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
uk: Шаблони можуть використовувати іменовані константи. Ці імена мають бути розділені крапками, щоб запобігти їх інтерпретації як змінну захоплення::

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
uk: Для більш детального пояснення та додаткових прикладів ви можете переглянути :pep:`636`, який написаний у форматі підручника.

source: Defining Functions
uk: Визначення функцій

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
uk: Ми можемо створити функцію, яка записує ряд Фібоначчі до довільної границі:

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
uk: Ключове слово :keyword:`def` вводить *визначення* функції. Після нього має йти ім’я функції та список формальних параметрів у дужках. Оператори, які утворюють тіло функції, починаються з наступного рядка та мають бути з відступом.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
uk: Перший оператор тіла функції необов’язково може бути рядковим літералом; цей рядковий літерал є рядком документації функції, або :dfn:`docstring`. (Більше про рядки документів можна знайти в розділі :ref:`tut-docstrings`.) Існують інструменти, які використовують рядки документів для автоматичного створення онлайнової або друкованої документації або для того, щоб користувач міг інтерактивно переглядати код; добре включати рядки документації в код, який ви пишете, тож візьміть це за звичку.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
uk: *Виконання* функції вводить нову таблицю символів, яка використовується для локальних змінних функції. Точніше, усі призначення змінних у функції зберігають значення в локальній таблиці символів; тоді як посилання на змінні спочатку шукають у локальній таблиці символів, потім у локальних таблицях символів охоплюючих функцій, потім у глобальній таблиці символів і, нарешті, у таблиці вбудованих імен. Таким чином, глобальним змінним і змінним охоплюючих функцій не можна безпосередньо присвоїти значення в межах функції (якщо для глобальних змінних, названих у операторі :keyword:`global`, або для змінних охоплюючих функцій, названих у :keyword:`nonlocal`), хоча на них можна посилатися.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
uk: Фактичні параметри (аргументи) виклику функції вводяться в локальну таблицю символів викликаної функції під час її виклику; таким чином, аргументи передаються за допомогою *виклику за значенням* (де *значення* завжди є *посиланням* на об’єкт, а не значенням об’єкта). [#]_ Коли функція викликає іншу функцію або рекурсивно викликає саму себе, для цього виклику створюється нова локальна таблиця символів.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
uk: Визначення функції пов’язує назву функції з об’єктом функції в поточній таблиці символів. Інтерпретатор розпізнає об'єкт, на який вказує це ім'я, як функцію, визначену користувачем. Інші імена також можуть вказувати на той самий об’єкт функції та також можуть використовуватися для доступу до функції::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
uk: Виходячи з інших мов, ви можете заперечити, що ``fib`` — це не функція, а процедура, оскільки вона не повертає значення. Фактично, навіть функції без оператора :keyword:`return` повертають значення, хоча й досить нудне. Це значення називається ``None`` (це вбудоване ім'я). Запис значення ``None`` зазвичай пригнічується інтерпретатором, якщо це буде єдине записане значення. Ви можете побачити це, якщо дійсно хочете використовувати :func:`print`::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
uk: Дуже просто написати функцію, яка повертає список чисел ряду Фібоначчі, замість того, щоб друкувати його:

source: This example, as usual, demonstrates some new Python features:
uk: Цей приклад, як завжди, демонструє деякі нові функції Python:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
uk: Оператор :keyword:`return` повертає значення з функції. :keyword:`!return` без аргументу-виразу повертає ``None``. Випадання кінця функції також повертає ``None``.

source: More on Defining Functions
uk: Докладніше про визначення функцій

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
uk: Також можна визначати функції зі змінною кількістю аргументів. Є три форми, які можна комбінувати.

source: Default Argument Values
uk: Значення аргументів за замовчуванням

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
uk: Найбільш корисною формою є вказати значення за умовчанням для одного або кількох аргументів. Це створює функцію, яку можна викликати з меншою кількістю аргументів, ніж це дозволено. Наприклад::

source: This function can be called in several ways:
uk: Цю функцію можна викликати кількома способами:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
uk: вказуючи лише обов’язковий аргумент: ``ask_ok('Ви дійсно хочете вийти?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
uk: надання одного з необов’язкових аргументів: ``ask_ok('ОК перезаписати файл?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
uk: або навіть надавши всі аргументи: ``ask_ok('Добре перезаписати файл?', 2, 'Давай, тільки так чи ні!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
uk: У цьому прикладі також представлено ключове слово :keyword:`in`. Це перевіряє, чи містить послідовність певне значення.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
uk: Значення за замовчуванням оцінюються в точці визначення функції в області *defining*, так що:

source: will print ``5``.
uk: надрукує ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
uk: **Важливе попередження:** Значення за замовчуванням оцінюється лише один раз. Це має значення, коли за умовчанням є змінний об’єкт, наприклад список, словник або екземпляри більшості класів. Наприклад, наступна функція накопичує аргументи, передані їй під час наступних викликів::

source: This will print ::
uk: Це надрукує ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
uk: Якщо ви не хочете, щоб значення за замовчуванням використовувалися для наступних викликів, ви можете написати функцію так:

source: Keyword Arguments
uk: Аргументи ключових слів

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
uk: Функції також можна викликати за допомогою :term:`аргументів ключового слова <keyword argument>` у формі ``kwarg=значення``. Наприклад, така функція::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
uk: приймає один обов’язковий аргумент (``напруга``) і три необов’язкові аргументи (``стан``, ``дія`` і ``тип``). Цю функцію можна викликати будь-яким із наведених нижче способів:

source: but all the following calls would be invalid::
uk: але всі наступні виклики будуть недійсними::
