Repository: python/python-docs-uk
Catalog: tutorial/controlflow.po
Languages: uk

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
uk: Під час виклику функції ключові аргументи повинні слідувати за позиційними аргументами. Усі передані ключові аргументи мають відповідати одному з аргументів, прийнятих функцією (наприклад, ``actor`` не є дійсним аргументом для ``parrot`` функції), і їх порядок не важливий. Це також включає необов’язкові аргументи (наприклад, ``parrot(voltage=1000)`` також дійсний). Жоден аргумент не може отримати значення більше одного разу. Ось приклад, який не працює через це обмеження::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
uk: Коли присутній остаточний формальний параметр у формі ``**name``, він отримує словник (див. :ref:`typesmapping`), який містить усі ключові аргументи, за винятком тих, що відповідають формальному параметру. Це можна поєднати з формальним параметром у формі ``*name`` (описано в наступному підрозділі), який отримує :ref:`tuple <tut-tuples>`, що містить позиційні аргументи поза формальним списком параметрів. (``*name`` має бути перед ``**name``.) Наприклад, якщо ми визначимо таку функцію:

source: It could be called like this::
uk: Це можна назвати так::

source: and of course it would print:
uk: і, звичайно, він буде друкувати:

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
uk: Зауважте, що порядок друку ключових аргументів гарантовано збігається з порядком, у якому вони були надані під час виклику функції.

source: Special parameters
uk: Спеціальні параметри

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
uk: За замовчуванням аргументи можуть передаватися функції Python за позицією або явно за ключовим словом. Для зручності читання та продуктивності має сенс обмежити спосіб передачі аргументів, щоб розробнику потрібно було дивитися лише на визначення функції, щоб визначити, чи передаються елементи за позицією, за позицією чи ключовим словом або за ключовим словом.

source: A function definition may look like:
uk: Визначення функції може виглядати так:

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
uk: де ``/`` і ``*`` необов'язкові. Якщо використовуються, ці символи вказують на тип параметра за допомогою того, як аргументи можуть бути передані до функції: лише позиційні, позиційні чи ключові слова та лише ключові слова. Параметри ключових слів також називають іменованими параметрами.

source: Positional-or-Keyword Arguments
uk: Позиційні або ключові аргументи

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
uk: Якщо ``/`` і ``*`` відсутні у визначенні функції, аргументи можуть бути передані функції за позицією або за ключовим словом.

source: Positional-Only Parameters
uk: Лише позиційні параметри

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
uk: Розглянувши це трохи детальніше, можна позначити певні параметри як *тільки позиційні*. Якщо *лише позиційний*, порядок параметрів має значення, і параметри не можуть бути передані за ключовим словом. Лише позиційні параметри розміщуються перед ``/`` (коса риска). ``/`` використовується для логічного відокремлення лише позиційних параметрів від решти параметрів. Якщо у визначенні функції немає ``/``, немає позиційних параметрів.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
uk: Параметри після ``/`` можуть бути *positional-or-keyword* або *keyword-only*.

source: Keyword-Only Arguments
uk: Аргументи лише за ключовими словами

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
uk: Щоб позначити параметри як *лише ключове слово*, вказавши, що параметри повинні бути передані аргументом ключового слова, помістіть ``*`` у списку аргументів безпосередньо перед першим параметром *лише ключове*.

source: Function Examples
uk: Приклади функцій

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
uk: Розглянемо наступні приклади визначення функцій, звертаючи особливу увагу на маркери ``/`` і ``*``::

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
uk: Перше визначення функції, ``standard_arg``, найвідоміша форма, не накладає обмежень на угоду про виклики, і аргументи можуть передаватися за позицією або ключовим словом::

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
uk: Друга функція ``pos_only_arg`` обмежена використанням лише позиційних параметрів, оскільки у визначенні функції є ``/``::

source: And the last uses all three calling conventions in the same function definition::
uk: І останній використовує всі три угоди про виклики в одному визначенні функції:

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
uk: Нарешті, розглянемо це визначення функції, яке має потенційну колізію між позиційним аргументом ``name`` і ``**kwds``, який має ``name`` як ключ::

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
uk: Немає можливого виклику, який змусить його повернути ``True``, оскільки ключове слово ``'name''`` завжди прив’язуватиметься до першого параметра. Наприклад::

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
uk: Але використання ``/`` (лише позиційні аргументи) є можливим, оскільки воно дозволяє ``name`` як позиційний аргумент і ``'name'`` як ключ в аргументах ключового слова::

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
uk: Іншими словами, назви лише позиційних параметрів можна використовувати в ``**kwds`` без двозначності.

source: Recap
uk: Підведення підсумків

source: The use case will determine which parameters to use in the function definition::
uk: Варіант використання визначить, які параметри використовувати у визначенні функції:

source: As guidance:
uk: Як керівництво:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
uk: Використовуйте тільки позиційне значення, якщо ви хочете, щоб назва параметрів була недоступна для користувача. Це корисно, коли назви параметрів не мають реального значення, якщо ви хочете забезпечити порядок аргументів під час виклику функції або якщо вам потрібно взяти деякі позиційні параметри та довільні ключові слова.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
uk: Використовуйте ключові слова лише тоді, коли імена мають значення, а визначення функції є більш зрозумілим через чіткі імена або ви хочете запобігти тому, щоб користувачі покладалися на позицію переданого аргументу.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
uk: Для API використовуйте тільки позиційний, щоб запобігти несправним змінам API, якщо назву параметра буде змінено в майбутньому.

source: Arbitrary Argument Lists
uk: Списки довільних аргументів

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
uk: Нарешті, найменш часто використовуваний варіант - це вказати, що функція може бути викликана з довільною кількістю аргументів. Ці аргументи будуть загорнуті в кортеж (див. :ref:`tut-tuples`). Перед змінною кількістю аргументів може бути нуль або більше нормальних аргументів. ::

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
uk: Зазвичай ці *варіативні* аргументи будуть останніми в списку формальних параметрів, оскільки вони збирають усі вхідні аргументи, що залишилися, які передаються функції. Будь-які формальні параметри, які виникають після параметра ``*args``, є аргументами "тільки ключового слова", тобто їх можна використовувати лише як ключові слова, а не як позиційні аргументи. ::

source: Unpacking Argument Lists
uk: Розпакування списків аргументів

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
uk: Зворотна ситуація виникає, коли аргументи вже є в списку або кортежі, але їх потрібно розпакувати для виклику функції, що потребує окремих позиційних аргументів. Наприклад, вбудована функція :func:`range` очікує окремих аргументів *start* і *stop*. Якщо вони недоступні окремо, напишіть виклик функції з оператором ``*``\, щоб розпакувати аргументи зі списку або кортежу::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
uk: Таким же чином словники можуть надавати аргументи ключових слів за допомогою оператора ``**``\::

source: Lambda Expressions
uk: Лямбда-вирази

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
uk: Невеликі анонімні функції можна створювати за допомогою ключового слова :keyword:`lambda`. Ця функція повертає суму своїх двох аргументів: ``лямбда a, b: a+b``. Лямбда-функції можна використовувати скрізь, де потрібні функціональні об’єкти. Вони синтаксично обмежені одним виразом. Семантично вони є лише синтаксичним цукром для нормального визначення функції. Як і визначення вкладених функцій, лямбда-функції можуть посилатися на змінні з області видимості::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
uk: У наведеному вище прикладі використовується лямбда-вираз для повернення функції. Інше використання - передача невеликої функції як аргумент::

source: Documentation Strings
uk: Рядки документації

source: Here are some conventions about the content and formatting of documentation strings.
uk: Ось деякі умовності щодо вмісту та форматування рядків документації.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
uk: Перший рядок завжди має бути коротким, лаконічним описом призначення об’єкта. Для стислості, він не повинен явно вказувати ім’я чи тип об’єкта, оскільки вони доступні іншими засобами (окрім випадків, коли ім’я є дієсловом, що описує роботу функції). Цей рядок повинен починатися з великої літери і закінчуватися крапкою.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
uk: Якщо в рядку документації є більше рядків, другий рядок має бути порожнім, візуально відокремлюючи резюме від решти опису. Наступні рядки мають бути одним або декількома абзацами, що описують умови виклику об’єкта, його побічні ефекти тощо.

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
uk: Синтаксичний аналізатор Python не видаляє відступи з багаторядкових рядкових літералів у Python, тому інструменти, які обробляють документацію, за бажанням мають видаляти відступи. Це робиться за допомогою наступної угоди. Перший непорожній рядок *після* першого рядка рядка визначає величину відступу для всього рядка документації. (Ми не можемо використати перший рядок, оскільки він зазвичай примикає до початкових лапок рядка, тому його відступ не видно в рядковому літералі.) Пробіли, "еквівалентні" цьому відступу, потім видаляються з початку всіх рядків рядка . Рядки з меншим відступом не повинні з’являтися, але якщо вони трапляються, усі їх початкові пробіли мають бути видалені. Еквівалентність пробілів слід перевіряти після розширення табуляції (зазвичай до 8 пробілів).

source: Here is an example of a multi-line docstring::
uk: Ось приклад багаторядкового документального рядка::

source: Function Annotations
uk: Анотації до функцій

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
uk: :ref:`Анотації функцій <function>` є абсолютно необов’язковою інформацією метаданих про типи, які використовуються визначеними користувачем функціями (див. :pep:`3107` і :pep:`484` для отримання додаткової інформації).

source: Intermezzo: Coding Style
uk: Intermezzo: стиль кодування

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
uk: Тепер, коли ви збираєтеся писати довші, складніші частини Python, саме час поговорити про *стиль кодування*. Більшість мов можуть бути написані (або стисло, *форматовано*) різними стилями; деякі більш читабельні, ніж інші. Полегшити читання вашого коду для інших – це завжди гарна ідея, і застосування гарного стилю кодування надзвичайно допомагає в цьому.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
uk: Для Python :pep:`8` став керівництвом зі стилю, якого дотримуються більшість проектів; він сприяє дуже читабельному та приємному оку стилю кодування. Кожен розробник Python повинен колись прочитати його; ось найважливіші моменти, виділені для вас:

source: Use 4-space indentation, and no tabs.
uk: Використовуйте відступ із 4 пробілами без табуляції.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
uk: 4 пробіли є хорошим компромісом між малим відступом (дозволяє більшу глибину вкладення) та великим відступом (легше читати). Вкладки створюють плутанину, тому їх краще не використовувати.

source: Wrap lines so that they don't exceed 79 characters.
uk: Переносити рядки так, щоб вони не перевищували 79 символів.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
uk: Це допомагає користувачам із невеликими дисплеями та дає змогу мати декілька файлів коду поруч на більших дисплеях.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
uk: Використовуйте порожні рядки для розділення функцій і класів, а також більші блоки коду всередині функцій.

source: When possible, put comments on a line of their own.
uk: Якщо можливо, розмістіть коментарі в окремому рядку.

source: Use docstrings.
uk: Використовуйте рядки документів.

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
uk: Використовуйте пробіли навколо операторів і після ком, але не безпосередньо всередині конструкцій у дужках: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
uk: Послідовно назвіть свої класи та функції; Угода передбачає використання ``UpperCamelCase`` для класів і ``lowercase_with_underscores`` для функцій і методів. Завжди використовуйте ``self`` як назву для першого аргументу методу (перегляньте :ref:`tut-firstclasses` для отримання додаткової інформації про класи та методи).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
uk: Не використовуйте химерні кодування, якщо ваш код призначений для використання в міжнародних середовищах. За замовчуванням Python, UTF-8 або навіть звичайний ASCII найкраще працюють у будь-якому випадку.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
uk: Так само не використовуйте в ідентифікаторах символи, відмінні від ASCII, якщо є лише найменший шанс, що люди, які розмовляють іншою мовою, прочитають або збережуть код.

source: Footnotes
uk: Виноски

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
uk: Насправді *виклик за посиланням на об’єкт* був би кращим описом, оскільки якщо передано змінний об’єкт, абонент побачить будь-які зміни, внесені до нього викликаним (елементи, вставлені в список).

source: statement
uk: заява

source: * (asterisk)
uk: * (зірочка)

source: function
uk: функція

source: annotations
uk: анотації

source: style
uk: стиль
