Repository: python/python-docs-uk
Catalog: tutorial/datastructures.po
Languages: uk

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
uk: Щоб перейти до послідовності у відсортованому порядку, використовуйте функцію :func:`sorted`, яка повертає новий відсортований список, залишаючи джерело без змін. ::

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
uk: Використання :func:`set` у послідовності усуває повторювані елементи. Використання :func:`sorted` у поєднанні з :func:`set` над послідовністю є ідіоматичним способом проходження унікальних елементів послідовності в порядку сортування. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
uk: Іноді виникає спокуса змінити список, поки ви переглядаєте його; однак часто простіше й безпечніше створити новий список. ::

source: More on Conditions
uk: Детальніше про умови

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
uk: Умови, які використовуються в операторах while і if, можуть містити будь-які оператори, а не лише порівняння.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
uk: Оператори порівняння ``in`` і ``not in`` — це тести на приналежність, які визначають, чи є значення в контейнері (чи ні). Оператори ``is`` і ``is not`` порівнюють, чи дійсно два об’єкти є одним і тим же об’єктом. Усі оператори порівняння мають однаковий пріоритет, який нижчий, ніж у всіх числових операторів.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
uk: Порівняння можуть бути ланцюжками. Наприклад, ``a < b == c`` перевіряє, чи ``a`` є меншим за ``b`` і, крім того, ``b`` дорівнює ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
uk: Порівняння можна комбінувати за допомогою логічних операторів ``and`` і ``or``, а результат порівняння (або будь-якого іншого логічного виразу) можна заперечувати за допомогою ``not``. Вони мають нижчий пріоритет, ніж оператори порівняння; між ними ``not`` має найвищий пріоритет, а ``or`` найнижчий, так що ``A and not B or C`` еквівалентно ``(A and (not B)) or C`` . Як завжди, дужки можна використовувати для вираження бажаної композиції.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
uk: Логічні оператори ``and`` і ``or`` є так званими операторами *короткого замикання*: їхні аргументи обчислюються зліва направо, і обчислення припиняється, щойно визначається результат. Наприклад, якщо ``A`` і ``C`` є істинними, ``B`` є хибними, ``A and B and C`` не обчислює вираз ``C``. Якщо використовується як загальне значення, а не як логічне, значення, що повертається оператором короткого замикання, є останнім обчисленим аргументом.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
uk: Змінній можна призначити результат порівняння або інший логічний вираз. Наприклад, ::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
uk: Зауважте, що в Python, на відміну від C, призначення всередині виразів має виконуватися явно за допомогою оператора :ref:`walrus <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. Це дозволяє уникнути типових проблем, які виникають у програмах на C: введення ``=`` у виразі, коли передбачалося ``==``.

source: Comparing Sequences and Other Types
uk: Порівняння послідовностей та інших типів

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
uk: Об’єкти послідовності зазвичай можна порівнювати з іншими об’єктами того самого типу послідовності. Порівняння використовує *лексикографічне* впорядкування: спочатку порівнюються перші два елементи, і якщо вони відрізняються, це визначає результат порівняння; якщо вони рівні, наступні два елементи порівнюються і так далі, поки будь-яка послідовність не буде вичерпана. Якщо два елементи для порівняння самі є послідовностями одного типу, лексикографічне порівняння виконується рекурсивно. Якщо всі елементи двох послідовностей порівняно однакові, послідовності вважаються рівними. Якщо одна послідовність є початковою підпослідовністю іншої, коротша послідовність є меншою (меншою). Лексикографічне впорядкування для рядків використовує номер кодової точки Unicode для впорядкування окремих символів. Деякі приклади порівнянь між послідовностями одного типу:

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
uk: Зауважте, що порівняння об’єктів різних типів за допомогою ``<`` or ``>`` є законним за умови, що об’єкти мають відповідні методи порівняння. Наприклад, змішані числові типи порівнюються відповідно до їхнього числового значення, тому 0 дорівнює 0,0 тощо. В іншому випадку, замість надання довільного порядку, інтерпретатор викличе виняток :exc:`TypeError`.

source: Footnotes
uk: Виноски

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
uk: Інші мови можуть повертати змінений об’єкт, що дозволяє об’єднувати методи, наприклад ``d->insert("a")->remove("b")->sort();``.
