Repository: python/python-docs-uk
Catalog: tutorial/inputoutput.po
Languages: uk

source: Input and Output
uk: Вхід і вихід

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
uk: Є кілька способів представити вихідні дані програми; дані можна роздрукувати у формі, зрозумілій людині, або записати у файл для подальшого використання. У цьому розділі будуть розглянуті деякі з можливостей.

source: Fancier Output Formatting
uk: Вишуканіше форматування виводу

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
uk: Поки що ми стикалися з двома способами запису значень: *операторами виразу* та функцією :func:`print`. (Третій спосіб — використання методу :meth:`write` для об’єктів файлу; на стандартний файл виводу можна посилатися як на ``sys.stdout``. Додаткову інформацію про це див. у Довіднику до бібліотеки.)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
uk: Часто вам знадобиться більше контролювати форматування вихідних даних, ніж просто друкувати значення, розділені пробілами. Існує кілька способів форматування виводу.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
uk: Щоб використовувати :ref:`відформатовані рядкові літерали <tut-f-strings>`, починайте рядок з ``f`` або ``F`` перед лапками, що відкривають або потрійними лапками. Усередині цього рядка можна написати вираз Python між символами ``{`` і ``}``, які можуть посилатися на змінні або літеральні значення.

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted.
uk: Метод рядків :meth:`str.format` вимагає більше ручних зусиль. Ви все одно використовуватимете ``{`` і ``}``, щоб позначити місце заміни змінної, і можете надати детальні директиви форматування, але вам також потрібно буде надати інформацію для форматування.

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
uk: Нарешті, ви можете виконувати всю обробку рядків самостійно, використовуючи операції зрізання рядків і конкатенації для створення будь-якого макета, який тільки можете собі уявити. Рядковий тип має деякі методи, які виконують корисні операції для доповнення рядків до заданої ширини стовпця.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
uk: Якщо вам не потрібен вигадливий вихід, а просто потрібно швидко відобразити деякі змінні для цілей налагодження, ви можете перетворити будь-яке значення на рядок за допомогою функцій :func:`repr` або :func:`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
uk: Функція :func:`str` призначена для повернення представлень значень, які досить зрозумілі людині, тоді як :func:`repr` призначена для створення представлень, які може читати інтерпретатор (або примусово :exc:`SyntaxError`, якщо немає еквівалентного синтаксису). Для об’єктів, які не мають спеціального представлення для споживання людиною, :func:`str` поверне те саме значення, що й :func:`repr`. Багато значень, наприклад чисел або структур, таких як списки та словники, мають однакове представлення за допомогою будь-якої функції. Рядки, зокрема, мають два різних представлення.

source: Some examples::
uk: Деякі приклади::

source: The :mod:`string` module contains a :class:`~string.Template` class that offers yet another way to substitute values into strings, using placeholders like ``$x`` and replacing them with values from a dictionary, but offers much less control of the formatting.
uk: Модуль :mod:`string` містить клас :class:`~string.Template`, який пропонує ще один спосіб заміни значень у рядки, використовуючи заповнювачі, такі як ``$x``, і замінюючи їх значеннями зі словника, але пропонує набагато менше контролю над форматуванням.

source: Formatted String Literals
uk: Відформатовані рядкові літерали

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
uk: :ref:`Форматовані рядкові літерали <f-strings>` (які також скорочено називаються f-рядками) дозволяють включити значення виразів Python у рядок, додавши до рядка префікс ``f`` або ``F`` і записавши вирази як` `{expression}``.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
uk: За виразом може слідувати необов’язковий специфікатор формату. Це дозволяє краще контролювати форматування значення. У наступному прикладі число pi округлюється до трьох знаків після коми:

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
uk: Передача цілого числа після ``':''`` призведе до того, що це поле матиме мінімальну кількість символів. Це корисно для того, щоб вирівняти колони. ::

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
uk: Для перетворення значення перед його форматуванням можна використовувати інші модифікатори. ``'!a''`` застосовується :func:`ascii`, ``'!s''`` застосовується :func:`str`, а ``'!r''`` застосовується :func:`repr`::

source: For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
uk: Щоб отримати довідку щодо цих специфікацій формату, перегляньте довідковий посібник для :ref:`formatspec`.

source: The String format() Method
uk: Метод String format().

source: Basic usage of the :meth:`str.format` method looks like this::
uk: Основне використання методу :meth:`str.format` виглядає так:

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
uk: Дужки та символи в них (так звані поля форматування) замінюються об’єктами, переданими в метод :meth:`str.format`. Число в дужках можна використовувати для позначення позиції об’єкта, переданого в метод :meth:`str.format`. ::

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
uk: Якщо ключові аргументи використовуються в методі :meth:`str.format`, їх значення посилаються за допомогою назви аргументу. ::

source: Positional and keyword arguments can be arbitrarily combined::
uk: Позиційні та ключові аргументи можна довільно комбінувати:

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
uk: Якщо у вас є дуже довгий рядок формату, який ви не хочете розділяти, було б непогано, якби ви могли посилатися на змінні, які потрібно відформатувати за назвою, а не за позицією. Це можна зробити, просто передавши dict і використовуючи квадратні дужки ``''[]'`` для доступу до ключів. ::

source: This could also be done by passing the table as keyword arguments with the '**' notation. ::
uk: Це також можна зробити, передавши таблицю як ключові аргументи з нотацією "**". ::

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables.
uk: Це особливо корисно в поєднанні з вбудованою функцією :func:`vars`, яка повертає словник, що містить усі локальні змінні.

source: As an example, the following lines produce a tidily-aligned set of columns giving integers and their squares and cubes::
uk: Як приклад, наступні рядки створюють акуратно вирівняний набір стовпців, що дають цілі числа та їх квадрати та куби:

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
uk: Щоб отримати повний огляд форматування рядка за допомогою :meth:`str.format`, перегляньте :ref:`formatstrings`.

source: Manual String Formatting
uk: Ручне форматування рядка

source: Here's the same table of squares and cubes, formatted manually::
uk: Ось та сама таблиця квадратів і кубів, відформатована вручну:

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
uk: (Зверніть увагу, що один пробіл між кожним стовпцем було додано так, як працює :func:`print`: він завжди додає пробіли між своїми аргументами.)

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
uk: Метод :meth:`str.rjust` рядкових об’єктів вирівнює рядок по правому краю в полі заданої ширини, доповнюючи його пробілами зліва. Існують схожі методи :meth:`str.ljust` і :meth:`str.center`. Ці методи нічого не записують, вони просто повертають новий рядок. Якщо вхідний рядок надто довгий, вони не скорочують його, а повертають без змін; це зіпсує ваш макет стовпців, але це зазвичай краще, ніж альтернатива, яка б брехала про значення. (Якщо вам дійсно потрібно скорочення, ви завжди можете додати операцію зрізу, як у ``x.ljust(n)[:n]``.)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
uk: Є інший метод, :meth:`str.zfill`, який доповнює числовий рядок зліва нулями. Він розуміє знаки плюс і мінус:

source: Old string formatting
uk: Старе форматування рядка

source: The % operator (modulo) can also be used for string formatting. Given ``'string' % values``, instances of ``%`` in ``string`` are replaced with zero or more elements of ``values``. This operation is commonly known as string interpolation. For example::
uk: Оператор % (по модулю) також можна використовувати для форматування рядків. З урахуванням % значень ``'string'`` екземпляри ``%`` в ``string`` замінюються нулем або більше елементами ``values``. Ця операція широко відома як інтерполяція рядків. Наприклад::

source: More information can be found in the :ref:`old-string-formatting` section.
uk: Більше інформації можна знайти в розділі :ref:`old-string-formatting`.

source: Reading and Writing Files
uk: Читання та запис файлів

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
uk: :func:`open` повертає об’єкт :term:`file object` і найчастіше використовується з двома позиційними аргументами та одним ключовим аргументом: ``open(filename, mode, encoding=None)``

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
uk: Перший аргумент - це рядок, що містить назву файлу. Другий аргумент — це інший рядок, що містить декілька символів, що описують спосіб використання файлу. *режим* може бути ``'r'``, коли файл буде лише читатися, ``'w''`` лише для запису (існуючий файл із такою ж назвою буде стерто) і ``'a'`` відкриває файл для додавання; будь-які дані, записані у файл, автоматично додаються в кінець. ``'r+'`` відкриває файл як для читання, так і для запису. Аргумент *mode* необов’язковий; ``'r'`` передбачається, якщо його опустити.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
uk: Зазвичай файли відкриваються в :dfn:`text mode`, це означає, що ви читаєте та записуєте рядки з і до файлу, які закодовані в певному *кодуванні*. Якщо *кодування* не вказано, типове значення залежить від платформи (див. :func:`open`). Оскільки UTF-8 є сучасним стандартом де-факто, рекомендується ``encoding="utf-8"``, якщо ви не знаєте, що вам потрібно використовувати інше кодування. Додавання ``'b'`` до режиму відкриває файл у :dfn:`binary mode`. Дані у двійковому режимі читаються та записуються як об’єкти :class:`bytes`. Ви не можете вказати *кодування* під час відкриття файлу в двійковому режимі.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
uk: У текстовому режимі під час читання за замовчуванням закінчення рядків для певної платформи (``\n`` в Unix, ``\r\n`` у Windows) перетворюються лише на ``\n``. Під час написання в текстовому режимі за замовчуванням символи ``\n`` перетворюються на закінчення рядків, що залежать від платформи. Ця закулісна модифікація даних файлу підходить для текстових файлів, але пошкодить двійкові дані, як у файлах :file:`JPEG` або :file:`EXE`. Будьте дуже обережні, використовуйте двійковий режим під час читання та запису таких файлів.

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
uk: Під час роботи з файловими об’єктами корисно використовувати ключове слово :keyword:`with`. Перевагою є те, що файл закривається належним чином після завершення його набору, навіть якщо в якийсь момент виникає виняток. Використання :keyword:`!with` також набагато коротше, ніж написання еквівалента :keyword:`try`\ -\ :keyword:`finally` блоків::

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
uk: Якщо ви не використовуєте ключове слово :keyword:`with`, вам слід викликати ``f.close()``, щоб закрити файл і негайно звільнити всі системні ресурси, які він використовує.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
uk: Виклик ``f.write()`` без використання ключового слова :keyword:`!with` або виклик ``f.close()`` **може** привести до аргументів ``f.write()`` не повністю записується на диск, навіть якщо програма успішно завершує роботу.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
uk: Після того, як файловий об’єкт закрито за допомогою оператора :keyword:`with` або виклику ``f.close()``, спроби використати файловий об’єкт автоматично зазнають невдачі. ::

source: Methods of File Objects
uk: Методи файлових об'єктів

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
uk: У решті прикладів у цьому розділі буде припущено, що файловий об’єкт під назвою ``f`` уже створено.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
uk: Щоб прочитати вміст файлу, викличте ``f.read(size)``, який зчитує певну кількість даних і повертає їх як рядок (у текстовому режимі) або об’єкт байтів (у двійковому режимі). *розмір* є необов’язковим числовим аргументом. Якщо *size* пропущений або негативний, весь вміст файлу буде прочитано та повернено; це ваша проблема, якщо розмір файлу вдвічі перевищує пам'ять вашої машини. В іншому випадку зчитуються та повертаються щонайбільше *size* символів (у текстовому режимі) або *size* байтів (у двійковому режимі). Якщо досягнуто кінця файлу, f.read() поверне порожній рядок (``''``). ::

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
uk: ``f.readline()`` читає один рядок із файлу; символ нового рядка (``\n``) залишається в кінці рядка та пропускається лише в останньому рядку файлу, якщо файл не закінчується символом нового рядка. Це робить значення, що повертається, однозначним; якщо ``f.readline()`` повертає порожній рядок, це означає, що кінець файлу досягнуто, тоді як порожній рядок представлений ``'\n'``, рядок, що містить лише один новий рядок. ::

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
uk: Щоб прочитати рядки з файлу, ви можете виконати цикл по об'єкту файлу. Це ефективне використання пам’яті, швидке та веде до простого коду::

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
uk: Якщо ви хочете прочитати всі рядки файлу у списку, ви також можете скористатися ``list(f)`` або ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
uk: ``f.write(string)`` записує вміст *string* у файл, повертаючи кількість записаних символів. ::

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
uk: Інші типи об’єктів потрібно перетворити — або на рядок (у текстовому режимі), або на об’єкт bytes (у двійковому режимі) — перед їх записом:

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
uk: ``f.tell()`` повертає ціле число, що вказує поточну позицію файлового об’єкта у файлі, представлену як кількість байтів від початку файлу в двійковому режимі та непрозоре число в текстовому режимі.

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
uk: Щоб змінити позицію об’єкта файлу, використовуйте ``f.seek(offset, wherece)``. Положення обчислюється шляхом додавання *зміщення* до опорної точки; опорна точка вибирається аргументом *whence*. Значення *whence* 0 вимірюється від початку файлу, 1 використовує поточну позицію файлу, а 2 використовує кінець файлу як контрольну точку. *whence* можна опустити і за умовчанням дорівнює 0, використовуючи початок файлу як контрольну точку. ::

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
uk: У текстових файлах (відкритих без ``b`` у рядку режиму) дозволений лише пошук відносно початку файлу (виняток полягає в пошуку до самого кінця файлу за допомогою ``seek(0, 2)``), і єдиними дійсними значеннями *offset* є ті, які повертає ``f.tell()`` або нуль. Будь-яке інше значення *offset* призводить до невизначеної поведінки.

source: File objects have some additional methods, such as :meth:`~file.isatty` and :meth:`~file.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
uk: Файлові об’єкти мають деякі додаткові методи, такі як :meth:`~file.isatty` і :meth:`~file.truncate`, які використовуються рідше; зверніться до бібліотечного довідника, щоб отримати повний посібник щодо файлових об’єктів.

source: Saving structured data with :mod:`json`
uk: Збереження структурованих даних за допомогою :mod:`json`
