Repository: python/python-docs-uk
Catalog: tutorial/inputoutput.po
Languages: uk

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
uk: Рядки можна легко записувати та читати з файлу. Числа вимагають трохи більше зусиль, оскільки метод :meth:`read` повертає лише рядки, які потрібно буде передати до функції на зразок :func:`int`, яка приймає рядок типу ``'123'`` і повертає числове значення 123. Якщо ви хочете зберегти складніші типи даних, як-от вкладені списки та словники, розбір і серіалізація вручну ускладнюються.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <http://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
uk: Замість того, щоб користувачі постійно писали та налагоджували код для збереження складних типів даних у файли, Python дозволяє використовувати популярний формат обміну даними під назвою `JSON (JavaScript Object Notation) <http://json.org>`_. Стандартний модуль під назвою :mod:`json` може приймати ієрархії даних Python і перетворювати їх у представлення рядків; цей процес називається :dfn:`serializing`. Реконструкція даних із представлення рядка називається :dfn:`deserializing`. Між серіалізацією та десеріалізацією рядок, що представляє об’єкт, міг бути збережений у файлі чи даних або надісланий через мережеве з’єднання на якусь віддалену машину.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
uk: Формат JSON зазвичай використовується сучасними програмами для обміну даними. Багато програмістів уже знайомі з ним, що робить його хорошим вибором для сумісності.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
uk: Якщо у вас є об’єкт ``x``, ви можете переглянути його представлення рядка JSON за допомогою простого рядка коду::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
uk: Інший варіант функції :func:`~json.dumps`, який називається :func:`~json.dump`, просто серіалізує об’єкт у :term:`text file`. Отже, якщо ``f`` є об'єктом :term:`text file`, відкритим для запису, ми можемо зробити це:

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
uk: Щоб знову декодувати об’єкт, якщо ``f`` є об’єктом :term:`binary file` або :term:`text file`, який було відкрито для читання::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
uk: Файли JSON мають бути закодовані в UTF-8. Використовуйте ``encoding="utf-8"``, коли відкриваєте файл JSON як :term:`text file` як для читання, так і для запису.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
uk: Ця проста техніка серіалізації може працювати зі списками та словниками, але серіалізація довільних екземплярів класу в JSON потребує додаткових зусиль. Посилання на модуль :mod:`json` містить пояснення цього.

source: :mod:`pickle` - the pickle module
uk: :mod:`pickle` - модуль pickle

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
uk: На відміну від :ref:`JSON <tut-json>`, *pickle* — це протокол, який дозволяє серіалізувати довільно складні об’єкти Python. Як такий, він специфічний для Python і не може використовуватися для зв’язку з програмами, написаними іншими мовами. Це також небезпечно за замовчуванням: десеріалізація даних pickle, що надходять із ненадійного джерела, може виконувати довільний код, якщо дані були створені кваліфікованим зловмисником.
