Repository: python/python-docs-uk
Catalog: tutorial/interpreter.po
Languages: uk

source: Using the Python Interpreter
uk: Використання інтерпретатора Python

source: Invoking the Interpreter
uk: Виклик Інтерпретатора

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
uk: до оболонки. [#]_ Оскільки вибір каталогу, де знаходиться інтерпретатор, є опцією встановлення, можливі інші місця; зверніться до місцевого гуру Python або системного адміністратора. (Наприклад, :file:`/usr/local/python` є популярним альтернативним розташуванням.)

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
uk: Введення символу кінця файлу (:kbd:`Control-D` в Unix, :kbd:`Control-Z` в Windows) у первинному запиті призводить до виходу інтерпретатора з нульовим статусом виходу. Якщо це не спрацює, ви можете вийти з інтерпретатора, ввівши таку команду: ``quit()``.

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
uk: Функції рядкового редагування інтерпретатора включають інтерактивне редагування, заміну історії та завершення коду в системах, які підтримують бібліотеку `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_. Можливо, найшвидший спосіб перевірити, чи підтримується редагування командного рядка, це ввести :kbd:`Control-P` у перше запрошення Python, яке ви отримаєте. Якщо він подає звуковий сигнал, у вас є редагування командного рядка; дивіться Додаток :ref:`tut-interacting` для ознайомлення з ключами. Якщо нічого не відбувається або відображається ``^P``, редагування командного рядка недоступне; Ви зможете використовувати клавішу Backspace лише для видалення символів із поточного рядка.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
uk: Інтерпретатор працює дещо подібно до оболонки Unix: при виклику зі стандартним введенням, підключеним до пристрою tty, він читає та виконує команди в інтерактивному режимі; при виклику з аргументом імені файлу або з файлом як стандартним введенням він читає та виконує *сценарій* із цього файлу.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
uk: Деякі модулі Python також корисні як сценарії. Їх можна викликати за допомогою ``python -m module [arg] ...``, яка виконує вихідний файл для *module* так, ніби ви ввели його повне ім’я в командному рядку.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
uk: Коли використовується файл сценарію, іноді корисно мати можливість запустити сценарій і перейти в інтерактивний режим після цього. Це можна зробити, передавши :option:`-i` перед сценарієм.

source: All command line options are described in :ref:`using-on-general`.
uk: Усі параметри командного рядка описані в :ref:`using-on-general`.

source: Argument Passing
uk: Передача аргументу

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
uk: Якщо ім’я сценарію та додаткові аргументи відомі інтерпретатору, вони перетворюються на список рядків і призначаються змінній ``argv`` у модулі ``sys``. Ви можете отримати доступ до цього списку, виконавши ``import sys``. Довжина списку принаймні одна; якщо сценарій і аргументи не задані, sys.argv[0] є порожнім рядком. Якщо ім’я сценарію вказано як ``'-''`` (що означає стандартний ввід), ``sys.argv[0]`` має значення ``'-'``. Коли :option:`-c` *команда* використовується, ``sys.argv[0]`` має значення ``'-c'``. Коли :option:`-m` *module* використовується, ``sys.argv[0]`` встановлюється на повну назву розташованого модуля. Параметри, знайдені після :option:`-c` *command* або :option:`-m` *module*, не використовуються обробкою параметрів інтерпретатора Python, а залишаються в ``sys.argv`` для обробки команди або модуля .

source: Interactive Mode
uk: Інтерактивний режим

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
uk: Коли команди читаються з tty, кажуть, що інтерпретатор перебуває в *інтерактивному режимі*. У цьому режимі він запитує наступну команду за допомогою *основного підказки*, як правило, трьох знаків "більше" (``>>>``); для рядків продовження він запитує *другорядним запитом*, за замовчуванням три крапки (``...``). Інтерпретатор друкує вітальне повідомлення із зазначенням номера версії та повідомлення про авторські права перед друком першого запиту:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
uk: Під час введення багаторядкової конструкції потрібні рядки продовження. Як приклад, подивіться на цей оператор :keyword:`if`::

source: For more on interactive mode, see :ref:`tut-interac`.
uk: Щоб дізнатися більше про інтерактивний режим, перегляньте :ref:`tut-interac`.

source: The Interpreter and Its Environment
uk: Інтерпретатор і його середовище

source: Source Code Encoding
uk: Кодування вихідного коду

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
uk: За замовчуванням вихідні файли Python розглядаються як закодовані в UTF-8. У цьому кодуванні символи більшості мов світу можуть використовуватися одночасно в рядкових літералах, ідентифікаторах і коментарях --- хоча стандартна бібліотека використовує лише символи ASCII для ідентифікаторів, угоду, якої повинен дотримуватися будь-який портативний код. Щоб правильно відобразити всі ці символи, ваш редактор має розпізнати, що файл має UTF-8, і він має використовувати шрифт, який підтримує всі символи у файлі.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
uk: Щоб оголосити кодування, відмінне від кодування за замовчуванням, слід додати спеціальний рядок коментаря як *перший* рядок файлу. Синтаксис такий::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
uk: де *кодування* є одним із дійсних :mod:`codecs`, які підтримуються Python.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
uk: Наприклад, щоб оголосити, що потрібно використовувати кодування Windows-1252, перший рядок вашого файлу вихідного коду має бути::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
uk: Одним винятком із правила *першого рядка* є випадки, коли вихідний код починається з рядка :ref:`UNIX "shebang" <tut-scripts>`. У цьому випадку оголошення кодування має бути додано як другий рядок файлу. Наприклад::

source: Footnotes
uk: Виноски

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
uk: В Unix інтерпретатор Python 3.x за замовчуванням не встановлюється з виконуваним файлом під назвою ``python``, тому він не конфліктує з одночасно встановленим виконуваним файлом Python 2.x.
