Repository: python/python-docs-uk
Catalog: tutorial/introduction.po
Languages: uk

source: An Informal Introduction to Python
uk: Неформальний вступ до Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
uk: У наступних прикладах вхід і вихід відрізняються наявністю або відсутністю підказок (:term:`>>>` і :term:`...`): щоб повторити приклад, ви повинні ввести все після підказки, коли з'явиться підказка; рядки, які не починаються з підказки, виводяться з інтерпретатора. Зауважте, що другорядна підказка в окремому рядку у прикладі означає, що ви повинні ввести порожній рядок; це використовується для завершення багаторядкової команди.

source: You can toggle the display of prompts and output by clicking on ``>>>`` in the upper-right corner of an example box. If you hide the prompts and output for an example, then you can easily copy and paste the input lines into your interpreter.
uk: Ви можете перемкнути відображення підказок і вихід, натиснувши ``>>>`` у верхньому правому куті вікна прикладу. Якщо ви приховаєте підказки та вивід для прикладу, ви зможете легко скопіювати та вставити рядки введення у свій інтерпретатор.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
uk: Багато прикладів у цьому посібнику, навіть ті, що вводяться в інтерактивному вікні, містять коментарі. Коментарі в Python починаються з символу решетки ``#`` і тягнуться до кінця фізичного рядка. Коментар може з’явитися на початку рядка або після пробілу чи коду, але не в рядковому літералі. Хеш-символ у рядковому літералі є просто хеш-символом. Оскільки коментарі призначені для прояснення коду та не інтерпретуються Python, їх можна опустити під час введення прикладів.

source: Some examples::
uk: Деякі приклади::

source: Using Python as a Calculator
uk: Використання Python як калькулятора

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
uk: Давайте спробуємо кілька простих команд Python. Запустіть інтерпретатор і дочекайтеся первинної підказки ``>>>``. (Це не повинно зайняти багато часу.)

source: Numbers
uk: Числа

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` work just like in most other languages (for example, Pascal or C); parentheses (``()``) can be used for grouping. For example::
uk: Інтерпретатор діє як простий калькулятор: ви можете ввести в нього вираз, і він запише значення. Синтаксис виразу простий: оператори ``+``, ``-``, ``*`` і ``/`` працюють так само, як і в більшості інших мов (наприклад, Pascal або C); дужки (``()``) можна використовувати для групування. Наприклад::

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
uk: Цілі числа (наприклад, ``2``, ``4``, ``20``) мають тип :class:`int`, ті з дробовою частиною (наприклад ``5.0``, ``1.6``) мають тип :class:`float`. Ми побачимо більше про числові типи пізніше в підручнику.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result (discarding any fractional result) you can use the ``//`` operator; to calculate the remainder you can use ``%``::
uk: Ділення (``/``) завжди повертає число з плаваючою точкою. Щоб виконати :term:`floor division` та отримати цілочисельний результат (відкидаючи будь-який дробовий результат), ви можете використати оператор ``//``; щоб обчислити залишок, ви можете використовувати ``%``::

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
uk: У Python можна використовувати оператор ``**`` для обчислення степенів [#]_::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
uk: Знак рівності (``=``) використовується для призначення значення змінній. Після цього результат не відображається до наступного інтерактивного запиту::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
uk: Якщо змінна не "визначена" (присвоєно значення), спроба використати її призведе до помилки::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
uk: Є повна підтримка для плаваючої коми; оператори з операндами змішаного типу перетворюють цілий операнд на плаваючу крапку::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
uk: В інтерактивному режимі останній надрукований вираз призначається змінній ``_``. Це означає, що коли ви використовуєте Python як настільний калькулятор, продовжувати обчислення дещо легше, наприклад:

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
uk: Користувач має розглядати цю змінну як доступну лише для читання. Не призначайте їй явно значення --- ви створили б незалежну локальну змінну з такою самою назвою, маскуючи вбудовану змінну своєю чарівною поведінкою.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
uk: Окрім :class:`int` і :class:`float`, Python підтримує інші типи чисел, такі як :class:`~decimal.Decimal` і :class:`~fractions.Fraction`. Python також має вбудовану підтримку :ref:`комплексних чисел <typesnumeric>` і використовує ``j`` або ``J`` суфікс для позначення уявної частини (наприклад, ``3+5j``).

source: Strings
uk: рядки

source: Besides numbers, Python can also manipulate strings, which can be expressed in several ways. They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_. ``\`` can be used to escape quotes::
uk: Крім чисел, Python також може працювати з рядками, які можна виразити кількома способами. Вони можуть бути взяті в одинарні лапки (``'...'``) або подвійні лапки (``"..."``) з однаковим результатом [#]_. ``\`` можна використовувати для екранування лапок::

source: In the interactive interpreter, the output string is enclosed in quotes and special characters are escaped with backslashes. While this might sometimes look different from the input (the enclosing quotes could change), the two strings are equivalent. The string is enclosed in double quotes if the string contains a single quote and no double quotes, otherwise it is enclosed in single quotes. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
uk: В інтерактивному інтерпретаторі вихідний рядок береться в лапки, а спеціальні символи екрануються зворотними скісними рисками. Хоча іноді це може відрізнятися від вхідних даних (лапки можуть змінюватися), ці два рядки еквівалентні. Рядок береться в подвійні лапки, якщо рядок містить одинарні лапки та не містить подвійних лапок, інакше він береться в одинарні лапки. Функція :func:`print` створює більш читабельний результат, опускаючи лапки та друкуючи екрановані та спеціальні символи::

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
uk: Якщо ви не хочете, щоб символи, перед якими стоїть ``\``, інтерпретувалися як спеціальні символи, ви можете використовувати *необроблені рядки*, додавши ``r`` перед першою лапкою::

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
uk: Рядкові літерали можуть займати кілька рядків. Одним із способів є використання потрійних лапок: ``"""..."""`` або ``'''...'''``. Кінець рядків автоматично включається в рядок, але можна запобігти цьому, додавши ``\`` в кінці рядка. Наступний приклад::

source: produces the following output (note that the initial newline is not included):
uk: створює наступний вихід (зауважте, що початковий новий рядок не включено):

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
uk: Рядки можна об’єднати (склеїти) за допомогою оператора ``+`` і повторити за допомогою ``*``::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
uk: Два або більше *рядкових літералів* (тобто ті, що взяті в лапки) поруч один з одним автоматично об’єднуються. ::

source: This feature is particularly useful when you want to break long strings::
uk: Ця функція особливо корисна, коли ви хочете розірвати довгі рядки::

source: This only works with two literals though, not with variables or expressions::
uk: Це працює лише з двома літералами, але не зі змінними чи виразами:

source: If you want to concatenate variables or a variable and a literal, use ``+``::
uk: Якщо ви хочете об’єднати змінні або змінну та літерал, використовуйте ``+``::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
uk: Рядки можуть бути *індексованими* (з індексом), при цьому перший символ має індекс 0. Немає окремого типу символу; символ - це просто рядок розміру один::

source: Indices may also be negative numbers, to start counting from the right::
uk: Індекси також можуть бути від’ємними числами, щоб почати відлік справа:

source: Note that since -0 is the same as 0, negative indices start from -1.
uk: Зауважте, що оскільки -0 дорівнює 0, від'ємні індекси починаються з -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain substring::
uk: Окрім індексування, також підтримується *нарізка*. Хоча індексування використовується для отримання окремих символів, *зрізання* дозволяє отримати підрядок::

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
uk: Індекси зрізів мають корисні значення за замовчуванням; пропущений перший індекс за замовчуванням дорівнює нулю, пропущений другий індекс за замовчуванням відповідає розміру рядка, що нарізається. ::

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
uk: Зверніть увагу, що початок завжди включається, а кінець завжди виключається. Це гарантує, що ``s[:i] + s[i:]`` завжди дорівнює ``s``::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
uk: Один із способів запам’ятати, як працюють зрізи, — уявити собі індекси як такі, що вказують *між* символами, при цьому лівий край першого символу має номер 0. Тоді правий край останнього символу рядка з *n* символів має індекс *n*, наприклад::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
uk: Перший рядок чисел задає положення індексів 0...6 у рядку; другий рядок дає відповідні від’ємні індекси. Фрагмент від *i* до *j* складається з усіх символів між краями, позначених *i* та *j* відповідно.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
uk: Для невід’ємних індексів довжина зрізу є різницею індексів, якщо обидва знаходяться в межах. Наприклад, довжина ``word[1:3]`` дорівнює 2.

source: Attempting to use an index that is too large will result in an error::
uk: Спроба використати занадто великий індекс призведе до помилки::

source: However, out of range slice indexes are handled gracefully when used for slicing::
uk: Однак індекси зрізів поза діапазоном обробляються витончено, коли використовуються для зрізу::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
uk: Рядки Python не можна змінити --- вони :term:`immutable`. Таким чином, призначення індексованої позиції в рядку призводить до помилки::

source: If you need a different string, you should create a new one::
uk: Якщо вам потрібен інший рядок, вам слід створити новий:

source: The built-in function :func:`len` returns the length of a string::
uk: Вбудована функція :func:`len` повертає довжину рядка::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
uk: Рядки є прикладами *типів послідовностей* і підтримують загальні операції, які підтримують такі типи.

source: Strings support a large number of methods for basic transformations and searching.
uk: Рядки підтримують велику кількість методів для основних перетворень і пошуку.

source: String literals that have embedded expressions.
uk: Рядкові літерали, які мають вбудовані вирази.

source: Information about string formatting with :meth:`str.format`.
uk: Інформація про форматування рядка за допомогою :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
uk: Старі операції форматування, що викликані, коли рядки є лівим операндом оператора ``%``, описані більш детально тут.

source: Lists
uk: списки

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
uk: Python знає кілька *складених* типів даних, які використовуються для групування інших значень. Найбільш універсальним є *список*, який можна записати як список розділених комами значень (елементів) у квадратних дужках. Списки можуть містити елементи різних типів, але зазвичай усі елементи мають однаковий тип. ::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
uk: Як і рядки (та всі інші вбудовані типи :term:`sequence`), списки можна індексувати та нарізати:

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
uk: Усі операції надрізу повертають новий список із запитаними елементами. Це означає, що наступний фрагмент повертає :ref:`неглибоку копію <shallow_vs_deep_copy>` списку::

source: Lists also support operations like concatenation::
uk: Списки також підтримують такі операції, як конкатенація::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
uk: На відміну від рядків, які є :term:`immutable`, списки мають тип :term:`mutable`, тобто їх вміст можна змінювати:

source: You can also add new items at the end of the list, by using the :meth:`~list.append` *method* (we will see more about methods later)::
uk: Ви також можете додавати нові елементи в кінець списку, використовуючи :meth:`~list.append` *метод* (ми побачимо більше про методи пізніше)::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
uk: Також можливе призначення фрагментам, і це навіть може змінити розмір списку або повністю його очистити::

source: The built-in function :func:`len` also applies to lists::
uk: Вбудована функція :func:`len` також застосовується до списків::

source: It is possible to nest lists (create lists containing other lists), for example::
uk: Можна вкладати списки (створювати списки, що містять інші списки), наприклад:

source: First Steps Towards Programming
uk: Перші кроки до програмування

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_number>`_ as follows::
uk: Звичайно, ми можемо використовувати Python для більш складних завдань, ніж додавання двох і двох. Наприклад, ми можемо записати початкову підпослідовність `ряду Фібоначчі <https://en.wikipedia.org/wiki/Fibonacci_number>`_ таким чином::

source: This example introduces several new features.
uk: Цей приклад представляє кілька нових функцій.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
uk: Перший рядок містить *множинне призначення*: змінні ``a`` і ``b`` одночасно отримують нові значення 0 і 1. В останньому рядку це використовується знову, демонструючи, що вирази праворуч усі сторони оцінюються перш ніж виконати будь-яке завдання. Вирази правої частини обчислюються зліва направо.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
uk: Цикл :keyword:`while` виконується, доки виконується умова (тут: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (більше), ``==`` (дорівнює), ``<=`` (less than or equal to), ``> =`` (більше або дорівнює to) і ``!=`` (не дорівнює).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
uk: *Тіло* циклу має *відступ*: відступ — це спосіб групування операторів у Python. У інтерактивному запиті ви повинні ввести табуляцію або пробіл для кожного рядка з відступом. На практиці ви підготуєте складніші введення для Python за допомогою текстового редактора; усі пристойні текстові редактори мають функцію автоматичного відступу. Коли складений оператор вводиться в інтерактивному режимі, після нього має йти порожній рядок, щоб вказати завершення (оскільки аналізатор не може вгадати, коли ви ввели останній рядок). Зауважте, що кожен рядок у базовому блоці має мати однаковий відступ.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
uk: Функція :func:`print` записує значення аргументів, які вона надає. Він відрізняється від простого написання виразу, який ви хочете написати (як ми робили раніше в прикладах калькулятора), тим, як він обробляє кілька аргументів, величини з плаваючою комою та рядки. Рядки друкуються без лапок, а між елементами вставляється пробіл, щоб ви могли гарно форматувати речі, наприклад:

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
uk: Аргумент ключового слова *end* можна використовувати, щоб уникнути нового рядка після виводу або завершити вивід іншим рядком::

source: Footnotes
uk: Виноски

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
uk: Оскільки ``**`` має вищий пріоритет, ніж ``-``, ``-3**2`` буде інтерпретовано як ``-(3**2)`` і, таким чином, призведе до ``-9``. Щоб уникнути цього та отримати ``9``, ви можете використовувати ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
uk: На відміну від інших мов, спеціальні символи, такі як ``\n``, мають однакове значення з одинарними (``'...'``) і подвійними (``"..."``) лапками. Єдина різниця між ними полягає в тому, що в одинарних лапках вам не потрібно екранувати ``"`` (але вам потрібно екранувати ``\'``) і навпаки.
