Repository: python/python-docs-uk
Catalog: tutorial/modules.po
Languages: uk

source: Modules
uk: Модулі

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
uk: Якщо ви вийшли з інтерпретатора Python і ввели його знову, зроблені вами визначення (функції та змінні) буде втрачено. Тому, якщо ви хочете написати дещо довшу програму, вам краще використовувати текстовий редактор, щоб підготувати вхідні дані для інтерпретатора, а замість цього запустити її з цим файлом як вхідними. Це відоме як створення *сценарію*. Коли ваша програма стає довшою, ви можете розділити її на кілька файлів для полегшення обслуговування. Ви також можете використати зручну функцію, яку ви написали в кількох програмах, не копіюючи її визначення в кожну програму.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
uk: Для підтримки цього Python має спосіб помістити визначення у файл і використовувати їх у сценарії або в інтерактивному екземплярі інтерпретатора. Такий файл називається *модулем*; визначення з модуля можна *імпортувати* в інші модулі або в *головний* модуль (набір змінних, до яких ви маєте доступ у сценарії, що виконується на верхньому рівні та в режимі калькулятора).

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
uk: Модуль — це файл, що містить визначення та оператори Python. Ім’я файлу — це ім’я модуля з суфіксом :file:`.py`. У межах модуля ім’я модуля (у вигляді рядка) доступне як значення глобальної змінної ``__name__``. Наприклад, скористайтеся своїм улюбленим текстовим редактором, щоб створити файл під назвою :file:`fibo.py` у поточному каталозі з таким вмістом::

source: Now enter the Python interpreter and import this module with the following command::
uk: Тепер увійдіть до інтерпретатора Python та імпортуйте цей модуль за допомогою наступної команди:

source: This does not enter the names of the functions defined in ``fibo`` directly in the current symbol table; it only enters the module name ``fibo`` there. Using the module name you can access the functions::
uk: Це не вводить назви функцій, визначених у ``fibo`` безпосередньо в поточну таблицю символів; він вводить туди лише назву модуля ``fibo``. Використовуючи назву модуля, ви можете отримати доступ до функцій::

source: If you intend to use a function often you can assign it to a local name::
uk: Якщо ви маєте намір часто використовувати функцію, ви можете призначити їй локальну назву:

source: More on Modules
uk: Детальніше про модулі

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
uk: Модуль може містити виконувані оператори, а також визначення функцій. Ці оператори призначені для ініціалізації модуля. Вони виконуються лише *вперше*, коли ім’я модуля зустрічається в операторі імпорту. [#]_ (Вони також запускаються, якщо файл виконується як сценарій.)

source: Each module has its own private symbol table, which is used as the global symbol table by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
uk: Кожен модуль має власну приватну таблицю символів, яка використовується як глобальна таблиця символів усіма функціями, визначеними в модулі. Таким чином, автор модуля може використовувати глобальні змінні в модулі, не турбуючись про випадкові зіткнення з глобальними змінними користувача. З іншого боку, якщо ви знаєте, що робите, ви можете торкнутися глобальних змінних модуля за допомогою тієї самої нотації, яка використовується для посилань на його функції, ``modname.itemname``.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names are placed in the importing module's global symbol table.
uk: Модулі можуть імпортувати інші модулі. Зазвичай, але не обов’язково, розміщувати всі оператори :keyword:`import` на початку модуля (або сценарію, якщо на те пішло). Назви імпортованих модулів розміщуються в глобальній таблиці символів модуля імпорту.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's symbol table. For example::
uk: Існує варіант оператора :keyword:`import`, який імпортує імена з модуля безпосередньо в таблицю символів модуля імпорту. Наприклад::

source: This does not introduce the module name from which the imports are taken in the local symbol table (so in the example, ``fibo`` is not defined).
uk: Це не вводить назву модуля, з якого беруться імпорти, у локальній таблиці символів (тому в прикладі, ``fibo`` не визначено).

source: There is even a variant to import all names that a module defines::
uk: Існує навіть варіант імпорту всіх імен, які визначає модуль:

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
uk: Це імпортує всі імена, крім тих, що починаються з підкреслення (``_``). У більшості випадків програмісти Python не використовують цю можливість, оскільки вона вводить невідомий набір імен в інтерпретатор, можливо, приховуючи деякі речі, які ви вже визначили.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
uk: Зауважте, що загалом практика імпортування ``*`` з модуля чи пакету викликає негативне ставлення, оскільки це часто призводить до поганої читабельності коду. Однак його можна використовувати, щоб не вводити текст під час інтерактивних сеансів.

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
uk: Якщо ім’я модуля супроводжується :keyword:`!as`, тоді ім’я після :keyword:`!as` прив’язується безпосередньо до імпортованого модуля.

source: This is effectively importing the module in the same way that ``import fibo`` will do, with the only difference of it being available as ``fib``.
uk: Це фактично імпортує модуль таким же чином, як і ``import fibo``, з тією лише різницею, що він доступний як ``fib``.

source: It can also be used when utilising :keyword:`from` with similar effects::
uk: Його також можна використовувати при використанні :keyword:`from` з подібними ефектами::

source: For efficiency reasons, each module is only imported once per interpreter session. Therefore, if you change your modules, you must restart the interpreter -- or, if it's just one module you want to test interactively, use :func:`importlib.reload`, e.g. ``import importlib; importlib.reload(modulename)``.
uk: З міркувань ефективності кожен модуль імпортується лише один раз за сеанс інтерпретатора. Таким чином, якщо ви змінюєте свої модулі, ви повинні перезапустити інтерпретатор -- або, якщо це лише один модуль, який ви хочете протестувати в інтерактивному режимі, використайте :func:`importlib.reload`, напр. ``імпорт importlib; importlib.reload(modulename)``.

source: Executing modules as scripts
uk: Виконання модулів у вигляді скриптів

source: When you run a Python module with ::
uk: Коли ви запускаєте модуль Python з ::

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
uk: код у модулі буде виконано так само, як якщо б ви його імпортували, але з ``__name__`` встановленим на ``"__main__"``. Це означає, що додавши цей код у кінці вашого модуля:

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file:
uk: ви можете зробити файл придатним для використання як сценарій, а також як імпортований модуль, оскільки код, який аналізує командний рядок, запускається, лише якщо модуль виконується як "основний" файл:

source: If the module is imported, the code is not run::
uk: Якщо модуль імпортовано, код не виконується::

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
uk: Це часто використовується або для забезпечення зручного інтерфейсу користувача для модуля, або для цілей тестування (запуск модуля як сценарію виконує набір тестів).

source: The Module Search Path
uk: Шлях пошуку модуля

source: When a module named :mod:`spam` is imported, the interpreter first searches for a built-in module with that name. These module names are listed in :data:`sys.builtin_module_names`. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
uk: Коли імпортується модуль із назвою :mod:`spam`, інтерпретатор спочатку шукає вбудований модуль із такою назвою. Назви цих модулів перераховані в :data:`sys.builtin_module_names`. Якщо не знайдено, він шукає файл із назвою :file:`spam.py` у списку каталогів, заданому змінною :data:`sys.path`. :data:`sys.path` ініціалізується з цих місць:

source: The directory containing the input script (or the current directory when no file is specified).
uk: Каталог, що містить вхідний сценарій (або поточний каталог, якщо файл не вказано).

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
uk: :envvar:`PYTHONPATH` (список імен каталогів із тим самим синтаксисом, що й змінна оболонки :envvar:`PATH`).

source: The installation-dependent default (by convention including a ``site-packages`` directory, handled by the :mod:`site` module).
uk: Типове значення, що залежить від встановлення (за домовленістю включає каталог ``site-packages``, який обробляється модулем :mod:`site`).

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
uk: У файлових системах, які підтримують символічні посилання, каталог, що містить вхідний сценарій, обчислюється після переходу за символічним посиланням. Іншими словами, каталог, що містить символічне посилання, **не** додається до шляху пошуку модуля.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
uk: Після ініціалізації програми Python можуть змінювати :data:`sys.path`. Каталог, що містить запущений скрипт, розміщується на початку шляху пошуку, перед стандартним шляхом до бібліотеки. Це означає, що скрипти в цьому каталозі будуть завантажені замість однойменних модулів у каталозі бібліотеки. Це помилка, якщо заміна не призначена. Перегляньте розділ :ref:`tut-standardmodules` для отримання додаткової інформації.

source: "Compiled" Python files
uk: "Компільовані" файли Python

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
uk: Щоб прискорити завантаження модулів, Python кешує скомпільовану версію кожного модуля в каталозі ``__pycache__`` під назвою :file:`module.{version}.pyc`, де версія кодує формат скомпільованого файлу; зазвичай містить номер версії Python. Наприклад, у випуску CPython 3.3 скомпільована версія spam.py буде кешована як ``__pycache__/spam.cpython-33.pyc``. Ця угода про іменування дозволяє співіснувати скомпільованим модулям з різних випусків і різних версій Python.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
uk: Python порівнює дату модифікації вихідного коду зі скомпільованою версією, щоб перевірити, чи вона застаріла та потребує перекомпіляції. Це повністю автоматичний процес. Крім того, скомпільовані модулі не залежать від платформи, тому одна й та сама бібліотека може використовуватися між системами з різними архітектурами.

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
uk: Python не перевіряє кеш у двох випадках. По-перше, він завжди перекомпілює і не зберігає результат для модуля, який завантажується безпосередньо з командного рядка. По-друге, він не перевіряє кеш, якщо немає вихідного модуля. Щоб підтримувати дистрибутив без вихідного коду (лише скомпільований), скомпільований модуль має бути у вихідному каталозі, а вихідного модуля не повинно бути.

source: Some tips for experts:
uk: Деякі поради експертам:

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
uk: Ви можете використовувати перемикачі :option:`-O` або :option:`-OO` у команді Python, щоб зменшити розмір скомпільованого модуля. Перемикач ``-O`` видаляє оператори assert, перемикач ``-OO`` видаляє як оператори assert, так і рядки __doc__. Оскільки деякі програми можуть покладатися на їх наявність, вам слід використовувати цей параметр, лише якщо ви знаєте, що робите. "Оптимізовані" модулі мають тег ``opt-`` і зазвичай менші. Майбутні випуски можуть змінити результати оптимізації.

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
uk: Програма не працює швидше, коли вона читається з файлу ``.pyc``, ніж коли вона зчитується з файлу ``.py``; єдине, що є швидшим у файлах ``.pyc``, це швидкість, з якою вони завантажуються.

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
uk: Модуль :mod:`compileall` може створювати файли .pyc для всіх модулів у каталозі.

source: There is more detail on this process, including a flow chart of the decisions, in :pep:`3147`.
uk: Більш детальну інформацію про цей процес, включаючи блок-схему рішень, можна знайти в :pep:`3147`.

source: Standard Modules
uk: Стандартні модулі

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
uk: Python постачається з бібліотекою стандартних модулів, описаних в окремому документі, Довідник бібліотеки Python (далі "Довідник бібліотеки"). Деякі модулі вбудовані в інтерпретатор; вони надають доступ до операцій, які не є частиною ядра мови, але, тим не менш, вбудовані, або для ефективності, або для забезпечення доступу до примітивів операційної системи, таких як системні виклики. Набір таких модулів є опцією конфігурації, яка також залежить від базової платформи. Наприклад, модуль :mod:`winreg` доступний лише в системах Windows. Один окремий модуль заслуговує на увагу: :mod:`sys`, який вбудовано в кожен інтерпретатор Python. Змінні ``sys.ps1`` і ``sys.ps2`` визначають рядки, які використовуються як первинні та додаткові підказки:

source: These two variables are only defined if the interpreter is in interactive mode.
uk: Ці дві змінні визначені, лише якщо інтерпретатор перебуває в інтерактивному режимі.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
uk: Змінна ``sys.path`` - це список рядків, який визначає шлях пошуку модулів інтерпретатором. Він ініціалізується шляхом за замовчуванням, взятим із змінної середовища :envvar:`PYTHONPATH`, або з вбудованого за замовчуванням, якщо :envvar:`PYTHONPATH` не встановлено. Ви можете змінити його за допомогою стандартних операцій зі списком:

source: The :func:`dir` Function
uk: Функція :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
uk: Вбудована функція :func:`dir` використовується, щоб дізнатися, які імена визначає модуль. Він повертає відсортований список рядків::

source: Without arguments, :func:`dir` lists the names you have defined currently::
uk: Без аргументів :func:`dir` перераховує імена, які ви визначили на даний момент::

source: Note that it lists all types of names: variables, modules, functions, etc.
uk: Зверніть увагу, що в ньому перераховано всі типи імен: змінні, модулі, функції тощо.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
uk: :func:`dir` не містить списку вбудованих функцій і змінних. Якщо вам потрібен їх список, вони визначені в стандартному модулі :mod:`builtins`::

source: Packages
uk: пакети

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
uk: Пакети — це спосіб структурування простору імен модулів Python за допомогою "пунктирних імен модулів". Наприклад, назва модуля :mod:`A.B` позначає підмодуль під назвою ``B`` у пакеті під назвою ``A``. Подібно до того, як використання модулів позбавляє авторів різних модулів від необхідності турбуватися про глобальні імена змінних один одного, використання пунктирних імен модулів позбавляє авторів багатомодульних пакетів, таких як NumPy або Pillow, від необхідності турбуватися про імена модулів один одного .

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
uk: Припустімо, ви хочете розробити набір модулів ("пакет") для однакової обробки звукових файлів і звукових даних. Існує багато різних форматів звукових файлів (зазвичай розпізнаються за їх розширенням, наприклад: :file:`.wav`, :file:`.aiff`, :file:`.au`), тому вам може знадобитися створювати та підтримувати зростаюча колекція модулів для перетворення між різними форматами файлів. Існує також багато різних операцій, які ви можете виконати зі звуковими даними (наприклад, мікшування, додавання відлуння, застосування функції еквалайзера, створення штучного стереоефекту), тож на додаток ви будете писати нескінченний потік модулів для виконання ці операції. Ось можлива структура для вашого пакета (виражена в термінах ієрархічної файлової системи):

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
uk: Під час імпортування пакета Python шукає підкаталог пакета в каталогах ``sys.path``.
