Repository: python/python-docs-uk
Catalog: tutorial/modules.po
Languages: uk

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages. This prevents directories with a common name, such as ``string``, unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
uk: Файли :file:`__init__.py` потрібні, щоб Python розглядав каталоги, що містять файл, як пакети. Це запобігає випадковому приховуванню дійсних модулів у каталогах із загальною назвою, як-от ``рядок``, які з’являються пізніше на шляху пошуку модуля. У найпростішому випадку :file:`__init__.py` може бути просто порожнім файлом, але він також може виконувати код ініціалізації для пакета або встановлювати змінну ``__all__``, описану пізніше.

source: Users of the package can import individual modules from the package, for example::
uk: Користувачі пакету можуть імпортувати окремі модулі з пакета, наприклад:

source: This loads the submodule :mod:`sound.effects.echo`. It must be referenced with its full name. ::
uk: Це завантажує підмодуль :mod:`sound.effects.echo`. На нього має бути повна назва. ::

source: An alternative way of importing the submodule is::
uk: Альтернативний спосіб імпорту субмодуля:

source: This also loads the submodule :mod:`echo`, and makes it available without its package prefix, so it can be used as follows::
uk: Це також завантажує підмодуль :mod:`echo` і робить його доступним без префікса пакету, тому його можна використовувати наступним чином::

source: Yet another variation is to import the desired function or variable directly::
uk: Ще одним варіантом є імпорт потрібної функції або змінної безпосередньо:

source: Again, this loads the submodule :mod:`echo`, but this makes its function :func:`echofilter` directly available::
uk: Знову ж таки, це завантажує підмодуль :mod:`echo`, але це робить його функцію :func:`echofilter` безпосередньо доступною::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
uk: Зауважте, що при використанні ``з елемента імпорту пакета``, елемент може бути або підмодулем (або підпакетом) пакета, або іншим ім’ям, визначеним у пакеті, як-от функція, клас або змінна. Оператор ``import`` спочатку перевіряє, чи визначено елемент у пакеті; якщо ні, він припускає, що це модуль, і намагається його завантажити. Якщо не вдається знайти його, виникає виняток :exc:`ImportError`.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
uk: Навпаки, при використанні такого синтаксису, як ``import item.subitem.subsubitem``, кожен елемент, крім останнього, має бути пакетом; останній елемент може бути модулем або пакетом, але не може бути класом, функцією чи змінною, визначеною в попередньому елементі.

source: Importing \* From a Package
uk: Імпортування \* з пакету

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
uk: Тепер що відбувається, коли користувач пише ``from sound.effects import *``? В ідеалі можна було б сподіватися, що це якимось чином переходить до файлової системи, знаходить, які підмодулі присутні в пакунку, і імпортує їх усі. Це може зайняти багато часу, а імпортування субмодулів може мати небажані побічні ефекти, які мають статися лише тоді, коли субмодуль імпортовано явно.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
uk: Єдине рішення полягає в тому, щоб автор пакета надав явний індекс пакета. Інструкція :keyword:`import` використовує таку умову: якщо код :file:`__init__.py` пакета визначає список під назвою ``__all__``, він вважається списком імен модулів, які слід імпортувати, коли Зустрічається ``from package import *``. Автор пакета повинен підтримувати цей список актуальним, коли виходить нова версія пакета. Автори пакетів також можуть вирішити не підтримувати його, якщо вони не бачать користі для імпортування \* зі свого пакета. Наприклад, файл :file:`sound/effects/__init__.py` може містити такий код:

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`sound.effects` package.
uk: Це означатиме, що ``from sound.effects import *`` імпортуватиме три названі підмодулі пакета :mod:`sound.effects`.

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`sound.effects` into the current namespace; it only ensures that the package :mod:`sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
uk: Якщо ``__all__`` не визначено, оператор ``from sound.effects import *`` *не* імпортує всі субмодулі з пакета :mod:`sound.effects` в поточний простір імен; він лише гарантує, що пакунок :mod:`sound.effects` було імпортовано (можливо, запустивши будь-який код ініціалізації в :file:`__init__.py`), а потім імпортує всі імена, визначені в пакунку. Це включає будь-які імена, визначені (і підмодулі, явно завантажені) :file:`__init__.py`. Він також включає будь-які підмодулі пакета, які були явно завантажені попередніми операторами :keyword:`import`. Розгляньте цей код::

source: In this example, the :mod:`echo` and :mod:`surround` modules are imported in the current namespace because they are defined in the :mod:`sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
uk: У цьому прикладі модулі :mod:`echo` і :mod:`surround` імпортовано в поточний простір імен, оскільки вони визначені в пакеті :mod:`sound.effects`, коли ``from...import`` виконується оператор. (Це також працює, якщо визначено ``__all__``.)

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
uk: Хоча певні модулі призначені для експорту лише імен, які відповідають певним шаблонам, коли ви використовуєте ``import *``, це все ще вважається поганою практикою у робочому коді.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
uk: Пам’ятайте, що немає нічого поганого у використанні ``from package import specific_submodule``! Фактично, це рекомендована нотація, якщо тільки імпортуючому модулю не потрібно використовувати підмодулі з однаковими назвами з різних пакунків.

source: Intra-package References
uk: Внутрішньопакетні посилання

source: When packages are structured into subpackages (as with the :mod:`sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`sound.filters.vocoder` needs to use the :mod:`echo` module in the :mod:`sound.effects` package, it can use ``from sound.effects import echo``.
uk: Коли пакунки структуровані на підпакунки (як у випадку з пакетом :mod:`sound` у прикладі), ви можете використовувати абсолютний імпорт для посилання на підмодулі пакетів-братів. Наприклад, якщо модуль :mod:`sound.filters.vocoder` потребує використання модуля :mod:`echo` у пакунку :mod:`sound.effects`, він може використовувати ``from sound.effects import echo``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`surround` module for example, you might use::
uk: Ви також можете написати відносні імпорти за допомогою форми оператора імпорту ``from module import name``. У цих імпортах використовуються крапки на початку для позначення поточного та батьківського пакетів, які беруть участь у відносному імпорті. Наприклад, у модулі :mod:`surround` можна використовувати::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
uk: Зауважте, що відносний імпорт базується на назві поточного модуля. Оскільки назва головного модуля завжди ``"__main__"``, модулі, призначені для використання як головного модуля програми Python, повинні завжди використовувати абсолютний імпорт.

source: Packages in Multiple Directories
uk: Пакунки в кількох каталогах

source: Packages support one more special attribute, :attr:`__path__`. This is initialized to be a list containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
uk: Пакунки підтримують ще один спеціальний атрибут, :attr:`__path__`. Це ініціалізується як список, що містить ім’я каталогу, що містить :file:`__init__.py` пакета перед виконанням коду в цьому файлі. Ця змінна може бути змінена; це впливає на майбутній пошук модулів і підпакетів, що містяться в пакеті.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
uk: Хоча ця функція не часто потрібна, її можна використовувати для розширення набору модулів, які містяться в пакеті.

source: Footnotes
uk: Виноски

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition enters the function name in the module's global symbol table.
uk: Насправді визначення функцій також є "операторами", які "виконуються"; виконання визначення функції на рівні модуля вводить назву функції в глобальну таблицю символів модуля.
