Repository: python/python-docs-uk
Catalog: tutorial/stdlib.po
Languages: uk

source: Brief Tour of the Standard Library
uk: Коротка екскурсія Стандартною бібліотекою

source: Operating System Interface
uk: Інтерфейс операційної системи

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
uk: Модуль :mod:`os` надає десятки функцій для взаємодії з операційною системою:

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
uk: Обов’язково використовуйте стиль ``import os`` замість ``from os import *``. Це не дасть :func:`os.open` затіняти вбудовану функцію :func:`open`, яка працює значно інакше.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
uk: Вбудовані функції :func:`dir` і :func:`help` корисні як інтерактивні допоміжні засоби для роботи з великими модулями, такими як :mod:`os`::

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
uk: Для щоденних завдань керування файлами та каталогами модуль :mod:`shutil` надає інтерфейс вищого рівня, який легше використовувати:

source: File Wildcards
uk: Символи підстановки файлів

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
uk: Модуль :mod:`glob` надає функцію для створення списків файлів із пошуку в каталозі за символами підстановки:

source: Command Line Arguments
uk: Аргументи командного рядка

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
uk: Модуль :mod:`argparse` забезпечує більш складний механізм обробки аргументів командного рядка. Наступний сценарій витягує одне або кілька імен файлів і необов’язкову кількість рядків для відображення:

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
uk: Якщо запустити в командному рядку з ``python top.py --lines=5 alpha.txt beta.txt``, сценарій встановлює ``args.lines`` значення ``5`` і ``args.filenames`` до ``['alpha.txt', 'beta.txt']``.

source: Error Output Redirection and Program Termination
uk: Перенаправлення виводу помилки та завершення програми

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
uk: Модуль :mod:`sys` також має атрибути для *stdin*, *stdout* і *stderr*. Останній корисний для видачі попереджень і повідомлень про помилки, щоб зробити їх видимими, навіть якщо *stdout* було перенаправлено::

source: The most direct way to terminate a script is to use ``sys.exit()``.
uk: Найпряміший спосіб завершити сценарій – це використати ``sys.exit()``.

source: String Pattern Matching
uk: Відповідність шаблону рядка

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
uk: Модуль :mod:`re` надає інструменти регулярних виразів для розширеної обробки рядків. Для складних відповідностей і маніпуляцій регулярні вирази пропонують короткі, оптимізовані рішення:

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
uk: Коли потрібні лише прості можливості, краще використовувати рядкові методи, оскільки їх легше читати та налагоджувати:

source: Mathematics
uk: Математика

source: The :mod:`random` module provides tools for making random selections::
uk: Модуль :mod:`random` надає інструменти для випадкового вибору:

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
uk: Модуль :mod:`statistics` обчислює основні статистичні властивості (середнє, медіана, дисперсія тощо) числових даних:

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
uk: Проект SciPy <https://scipy.org> має багато інших модулів для чисельних обчислень.

source: Internet Access
uk: Доступ в інтернет

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
uk: Існує ряд модулів для доступу до Інтернету та обробки Інтернет-протоколів. Двома найпростішими є :mod:`urllib.request` для отримання даних з URL-адрес і :mod:`smtplib` для надсилання пошти::

source: (Note that the second example needs a mailserver running on localhost.)
uk: (Зверніть увагу, що для другого прикладу потрібен поштовий сервер, який працює на локальному хості.)

source: Dates and Times
uk: Дати та час

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
uk: Модуль :mod:`datetime` містить класи для обробки дат і часу як простими, так і складними способами. Хоча арифметика дати й часу підтримується, основна увага при реалізації зосереджена на ефективному вилученні членів для форматування виводу та маніпуляції. Модуль також підтримує об’єкти, які знають часовий пояс. ::

source: Data Compression
uk: Стиснення даних

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
uk: Загальні формати архівування та стиснення даних безпосередньо підтримуються такими модулями, як: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` і :mod:`tarfile`. ::

source: Performance Measurement
uk: Вимірювання ефективності

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
uk: Деякі користувачі Python відчувають глибокий інтерес до знання відносної ефективності різних підходів до однієї проблеми. Python надає інструмент вимірювання, який миттєво відповідає на ці запитання.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
uk: Наприклад, може виникнути спокуса використовувати функцію пакування та розпакування кортежів замість традиційного підходу до заміни аргументів. Модуль :mod:`timeit` швидко демонструє помірну перевагу продуктивності:

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
uk: На відміну від високого рівня деталізації :mod:`timeit`, модулі :mod:`profile` і :mod:`pstats` надають інструменти для ідентифікації критичних за часом розділів у великих блоках коду.

source: Quality Control
uk: Контроль якості

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
uk: Одним із підходів до розробки високоякісного програмного забезпечення є написання тестів для кожної функції в міру її розробки та часте виконання цих тестів у процесі розробки.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
uk: Модуль :mod:`doctest` надає інструмент для сканування модуля та перевірки тестів, вбудованих у рядки документів програми. Побудова тесту така ж проста, як вирізання та вставлення типового виклику разом із його результатами в рядок документації. Це покращує документацію, надаючи користувачеві приклад, і це дозволяє модулю doctest переконатися, що код залишається вірним документації::

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
uk: Модуль :mod:`unittest` не такий легкий, як модуль :mod:`doctest`, але він дозволяє підтримувати більш повний набір тестів в окремому файлі::

source: Batteries Included
uk: Батарейки в комплекті

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
uk: Python має філософію "батареї включені". Це найкраще видно через складні та надійні можливості його більших пакетів. Наприклад:

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules' names, no direct knowledge or handling of XML is needed.
uk: Модулі :mod:`xmlrpc.client` і :mod:`xmlrpc.server` роблять реалізацію викликів віддалених процедур майже тривіальним завданням. Незважаючи на назви модулів, не потрібні прямі знання або робота з XML.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
uk: Пакет :mod:`email` — це бібліотека для керування повідомленнями електронної пошти, включаючи MIME та інші документи повідомлень на основі :rfc:`2822`. На відміну від :mod:`smtplib` і :mod:`poplib`, які фактично надсилають і отримують повідомлення, пакет електронної пошти має повний набір інструментів для побудови або декодування складних структур повідомлень (включно з вкладеннями) і для реалізації інтернет-кодування та протоколів заголовків.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
uk: Пакет :mod:`json` забезпечує надійну підтримку аналізу цього популярного формату обміну даними. Модуль :mod:`csv` підтримує пряме читання та запис файлів у форматі значень, розділених комами, який зазвичай підтримується базами даних і електронними таблицями. Обробка XML підтримується пакетами :mod:`xml.etree.ElementTree`, :mod:`xml.dom` і :mod:`xml.sax`. Разом ці модулі та пакети значно спрощують обмін даними між програмами Python та іншими інструментами.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
uk: Модуль :mod:`sqlite3` — це оболонка для бібліотеки бази даних SQLite, яка забезпечує постійну базу даних, яку можна оновлювати та отримати до якої можна отримати доступ за допомогою дещо нестандартного синтаксису SQL.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
uk: Інтернаціоналізація підтримується кількома модулями, зокрема :mod:`gettext`, :mod:`locale` і пакетом :mod:`codecs`.

source: built-in function
uk: вбудована функція

source: help
uk: допомогти
