Repository: python/python-docs-uk
Catalog: tutorial/venv.po
Languages: uk

source: Virtual Environments and Packages
uk: Віртуальні середовища та пакети

source: Introduction
uk: вступ

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
uk: Програми Python часто використовують пакети та модулі, які не є частиною стандартної бібліотеки. Програмам іноді потрібна конкретна версія бібліотеки, тому що програма може вимагати виправлення певної помилки або програма може бути написана з використанням застарілої версії інтерфейсу бібліотеки.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
uk: Це означає, що одна установка Python може не відповідати вимогам кожної програми. Якщо програмі A потрібна версія 1.0 певного модуля, а програмі B потрібна версія 2.0, тоді вимоги суперечать, і встановлення версії 1.0 або 2.0 призведе до того, що одна програма не зможе працювати.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
uk: Рішенням цієї проблеми є створення :term:`virtual environment`, самостійного дерева каталогів, яке містить інсталяцію Python для певної версії Python, а також низку додаткових пакетів.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
uk: Тоді різні програми можуть використовувати різні віртуальні середовища. Щоб вирішити попередній приклад суперечливих вимог, програма A може мати власне віртуальне середовище з версією 1.0, а програма B має інше віртуальне середовище з версією 2.0. Якщо програма B потребує оновлення бібліотеки до версії 3.0, це не вплине на середовище програми A.

source: Creating Virtual Environments
uk: Створення віртуальних середовищ

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will usually install the most recent version of Python that you have available. If you have multiple versions of Python on your system, you can select a specific Python version by running ``python3`` or whichever version you want.
uk: Модуль, який використовується для створення та керування віртуальними середовищами, називається :mod:`venv`. :mod:`venv` зазвичай встановлює останню доступну версію Python. Якщо у вас є кілька версій Python у вашій системі, ви можете вибрати конкретну версію Python, запустивши ``python3`` або будь-яку іншу версію.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
uk: Щоб створити віртуальне середовище, виберіть каталог, куди ви хочете його розмістити, і запустіть модуль :mod:`venv` як сценарій із шляхом до каталогу::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
uk: Це створить каталог ``tutorial-env``, якщо він не існує, а також створить каталоги всередині нього, що містять копію інтерпретатора Python і різні допоміжні файли.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
uk: Загальним розташуванням каталогу для віртуального середовища є ``.venv``. Ця назва зберігає каталог, як правило, прихованим у вашій оболонці і, таким чином, не заважаючи, водночас надаючи йому назву, яка пояснює, чому каталог існує. Це також запобігає зіткненню з файлами визначення змінних середовища ``.env``, які підтримують деякі інструменти.

source: Once you've created a virtual environment, you may activate it.
uk: Створивши віртуальне середовище, ви можете його активувати.

source: On Windows, run::
uk: У Windows запустіть::

source: On Unix or MacOS, run::
uk: В Unix або MacOS запустіть:

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
uk: (Цей сценарій написаний для оболонки bash. Якщо ви використовуєте оболонки :program:`csh` або :program:`fish`, існують альтернативні сценарії ``activate.csh`` і ``activate.fish``, які вам слід використовувати замість цього.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
uk: Активація віртуального середовища змінить підказку вашої оболонки, щоб показати, яке віртуальне середовище ви використовуєте, і змінить середовище таким чином, що запуск ``python`` дасть вам цю конкретну версію та інсталяцію Python. Наприклад:

source: Managing Packages with pip
uk: Керування пакетами за допомогою pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the Python Package Index, <https://pypi.org>. You can browse the Python Package Index by going to it in your web browser.
uk: Ви можете встановлювати, оновлювати та видаляти пакунки за допомогою програми під назвою :program:`pip`. За замовчуванням ``pip`` встановить пакунки з індексу пакетів Python, <https://pypi.org>. Ви можете переглянути індекс пакетів Python, перейшовши до нього у своєму веб-браузері.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
uk: ``pip`` має низку підкоманд: "встановити", "видалити", "заморозити" тощо. (Зверніться до посібника :ref:`installing-index`, щоб отримати повну документацію для ``pip``.)

source: You can install the latest version of a package by specifying a package's name:
uk: Ви можете встановити останню версію пакета, вказавши назву пакета:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
uk: Ви також можете встановити певну версію пакета, вказавши ім’я пакета, а потім ``==`` і номер версії:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``pip install --upgrade`` to upgrade the package to the latest version:
uk: Якщо ви повторно запустите цю команду, ``pip`` помітить, що запитувана версія вже встановлена, і нічого не зробить. Ви можете вказати інший номер версії, щоб отримати цю версію, або ви можете запустити ``pip install --upgrade``, щоб оновити пакет до останньої версії:

source: ``pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
uk: ``pip uninstall``, за яким слідує одне або кілька імен пакетів, вилучить пакети з віртуального середовища.

source: ``pip show`` will display information about a particular package:
uk: ``pip show`` відобразить інформацію про певний пакет:

source: ``pip list`` will display all of the packages installed in the virtual environment:
uk: ``pip list`` відобразить усі пакети, встановлені у віртуальному середовищі:

source: ``pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
uk: ``pip freeze`` створить подібний список встановлених пакетів, але у форматі, який очікує ``pip install``. Прийнято це зберігати у файлі ``requirements.txt``:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
uk: Після цього ``requirements.txt`` можна закріпити для контролю версій і відправити як частину програми. Потім користувачі можуть інсталювати всі необхідні пакети за допомогою ``install -r``:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the :ref:`distributing-index` guide.
uk: ``pip`` має багато інших параметрів. Зверніться до посібника :ref:`installing-index`, щоб отримати повну документацію для ``pip``. Якщо ви написали пакунок і хочете зробити його доступним в індексі пакетів Python, зверніться до посібника :ref:`distributing-index`.
