Repository: python/python-docs-uk
Catalog: tutorial/whatnow.po
Languages: uk

source: What Now?
uk: Що тепер?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
uk: Читання цього підручника, мабуть, підсилило ваш інтерес до використання Python --- ви повинні бути готові застосувати Python для вирішення ваших реальних проблем. Куди вам звернутися, щоб дізнатися більше?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
uk: Цей посібник є частиною набору документації Python. Деякі інші документи в наборі:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
uk: Вам слід переглянути цей посібник, який надає повний (хоча й стислий) довідковий матеріал про типи, функції та модулі стандартної бібліотеки. Стандартний дистрибутив Python містить *багато* додаткового коду. Є модулі для читання поштових скриньок Unix, отримання документів через HTTP, генерації випадкових чисел, розбору параметрів командного рядка, стиснення даних і виконання багатьох інших завдань. Швидкий перегляд довідника бібліотеки дасть вам уявлення про те, що доступно.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
uk: :ref:`installing-index` пояснює, як встановити додаткові модулі, написані іншими користувачами Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
uk: :ref:`reference-index`: докладне пояснення синтаксису та семантики Python. Це важке читання, але корисне як повний путівник з самої мови.

source: More Python resources:
uk: Більше ресурсів Python:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
uk: https://www.python.org: Основний вебсайт Python. Він містить код, документацію та посилання на сторінки, пов'язані з Python, у мережі.

source: https://docs.python.org: Fast access to Python's documentation.
uk: https://docs.python.org: швидкий доступ до документації Python.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
uk: https://pypi.org: Індекс пакетів Python, який раніше також називався Cheese Shop [#]_, — це індекс створених користувачами модулів Python, доступних для завантаження. Коли ви почнете випускати код, ви можете зареєструвати його тут, щоб інші могли його знайти.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
uk: https://code.activestate.com/recipes/langs/python/: Кулінарна книга Python — це значна колекція прикладів коду, більших модулів і корисних сценаріїв. Особливо помітні внески зібрані в книзі, яка також називається Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3).

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
uk: https://pyvideo.org містить у собі посилання на відео, пов'язані з Python, з конференцій та з користувацьких зустрічей.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
uk: https://scipy.org: проект Scientific Python включає модулі для швидких обчислень масивів і маніпуляцій, а також безліч пакетів для таких речей, як лінійна алгебра, перетворення Фур’є, нелінійні розв’язувачі, розподіл випадкових чисел, статистичний аналіз тощо.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
uk: Питання та звіти про проблеми, пов’язані з Python, можна опублікувати в групі новин :newsgroup:`comp.lang.python` або надіслати їх до списку розсилки за адресою python-list@python.org. Група новин і список розсилки є шлюзовими, тому повідомлення, опубліковані в одній, автоматично пересилатимуться в іншу. Щодня публікуються сотні повідомлень, які ставлять запитання (і відповідають на них), пропонують нові функції та анонсують нові модулі. Архіви списків розсилки доступні за адресою https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
uk: Перш ніж опублікувати, обов’язково перевірте список :ref:`Частих запитань <faq-index>` (також називається FAQ). Поширені запитання відповідають на багато питань, які виникають знову і знову, і, можливо, вже містять рішення вашої проблеми.

source: Footnotes
uk: Виноски

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
uk: "Cheese Shop" — це скетч Монті Пайтона: покупець заходить у сироварню, але який би сир він не просив, продавець каже, що його не вистачає.
