Repository: python/python-docs-uk
Catalog: about.po
Languages: uk

source: About these documents
uk: Про ці документи

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
uk: Ці документи генеруються з джерел `reStructuredText`_ за допомогою `Sphinx`_, процесором документів який спеціально розроблений для документації Python.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
uk: Розробка документації та її інструментарію є повністю волонтерською роботою, як і сам Python. Якщо ви хочете внести свій внесок, подивіться на сторінку :ref:`reporting-bugs`, щоб дізнатися, як це зробити. Завжди раді новим волонтерам!

source: Many thanks go to:
uk: Велика подяка:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
uk: Fred L. Drake, Jr., творцю оригінального набору інструментів документації Python і автору більшої частини контенту;

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
uk: `Docutils <https://docutils.sourceforge.io/>`_ проект для створення reStructuredText and і пакету Docutils;

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
uk: Fredrik Lundh за його проєкт Alternative Python Reference, з якого Sphinx взяв багато хороших ідей.

source: Contributors to the Python Documentation
uk: Учасникам створення документації Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
uk: Багато людей зробили внесок у мову Python, стандартну бібліотеку Python і документацію Python. Перегляньте :source:`Misc/ACKS` у вихідному коді Python з неповним списком учасників.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
uk: Лише завдяки внеску спільноти Python має таку чудову документацію -- Дякуємо!
