Repository: python/python-docs-uk
Catalog: bugs.po
Languages: uk

source: Dealing with Bugs
uk: Робота з помилками

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
uk: Python — це розвинута мова програмування, яка заслужила репутацію стабільної. Щоб зберегти цю репутацію, розробники хотіли б знати про будь-які недоліки, які ви знайдете в Python.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
uk: Іноді швидше виправити помилки самостійно та внести виправлення в Python, оскільки це спрощує процес і залучає менше людей. Прочитайте як :ref:`зробити внесок <contributing-to-python>`.

source: Documentation bugs
uk: Помилки в документації

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
uk: Якщо ви знайшли помилку в цій документації або бажаєте запропонувати покращення, надішліть звіт про помилку на :ref:`трекер <using-the-tracker>`. Якщо у вас є пропозиції щодо того, як це виправити, також додайте їх у звіт.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
uk: Ви також можете відкрити тему для обговорення на нашому `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.

source: If you find a bug in the theme (HTML / CSS / JavaScript) of the documentation, please submit a bug report on the `python-doc-theme bug tracker <https://github.com/python/python-docs-theme>`_.
uk: Якщо ви знайдете помилку в темі (HTML / CSS / JavaScript) документації, будь ласка, подайте звіт про помилку в `системі відстеження помилок python-doc-theme <https://github.com/python/python-docs-theme>`_.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
uk: Якщо у вас мало часу, ви також можете надіслати звіт про помилки в документації електронною поштою на адресу docs@python.org (поведінкові помилки можна надіслати на адресу python-list@python.org). 'docs@' — це список розсилки, який ведуть волонтери; ваш запит буде занотовано, хоча і обробка може зайняти деякий час.

source: `Documentation bugs`_
uk: Помилки в документації - `Documentation bugs`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
uk: Список помилок в документації, які були надіслані до трекера помилок Python.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
uk: `Трекер помилок <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
uk: Огляд процесу інформування щодо покращення на трекері.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
uk: `Допомога з документацією <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
uk: Вичерпний посібник для осіб, що зацікавлені у внесенні змін в документацію Python.

source: `Documentation Translations <https://devguide.python.org/documentation/translating/>`_
uk: `Переклади документації <https://devguide.python.org/documentation/translating/>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
uk: Список сторінок GitHub для перекладу документації та їхні основні контакти.

source: Using the Python issue tracker
uk: Використання трекеру помилок Python

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
uk: Звіти про проблеми для самого Python слід надсилати через засіб відстеження проблем GitHub (https://github.com/python/cpython/issues). Відстеження проблем GitHub пропонує веб-форму, яка дозволяє вводити відповідну інформацію та надсилати її розробникам.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
uk: Першим кроком у поданні звіту є визначення того, чи вже повідомлялося про проблему. Перевага в цьому, окрім економії часу розробників, полягає в тому, що ви дізнаєтесь, що було зроблено, щоб це виправити; можливо, проблему вже виправлено для наступного випуску або потрібна додаткова інформація (у такому випадку ви можете надати її, якщо можете!). Для цього виконайте пошук у трекері за допомогою вікна пошуку у верхній частині сторінки.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
uk: Якщо проблема, про яку ви повідомляєте, ще немає у списку, увійдіть на GitHub. Якщо у вас ще немає облікового запису GitHub, створіть новий обліковий запис за допомогою посилання «Sign up». Неможливо подати звіт про помилку анонімно.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
uk: Увійшовши в систему, ви можете надіслати проблему. Натисніть кнопку "New issue" на верхній панелі, щоб повідомити про нову проблему.

source: The submission form has two fields, "Title" and "Comment".
uk: Форма подання має два поля "Title" та "Comment".

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
uk: У полі "Назва" введіть *дуже* короткий опис проблеми; достатньо менше десяти слів.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
uk: У полі "Comment" детально опишіть проблему, включно з тим, що ви очікували статися і що сталося. Обов’язково вкажіть, чи були задіяні якісь модулі розширення, а також яку апаратну та програмну платформу ви використовували (включно з інформацією про версію, якщо це необхідно).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
uk: Кожен звіт про проблему розглядатиметься розробником, який визначить, що потрібно зробити, щоб вирішити проблему. Ви отримуватимете оновлення щоразу, коли буде виконано певну дію щодо проблеми.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
uk: `Як ефективно повідомляти про помилки <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
uk: Стаття, в якій детально описано, як створити корисний звіт про помилку. Вона описує, яка інформація є корисною та чому вона корисна.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
uk: `Правила опису помилок <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
uk: Інформація про написання хорошого звіту про помилку. Дещо з цього стосується лише проєкту Mozilla, але взагалом описані загальні хороші практики.

source: Getting started contributing to Python yourself
uk: Початок власного внеску в Python

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
uk: Окрім повідомлення про знайдені помилки, ви також можете виправлення їх самостійно. Ви можете знайти більше інформації про те, як почати виправляти Python, у посібнику `Python Developer's Guide`_. Якщо у вас є запитання, `core-mentorship mailing list`_ — це дружнє місце, де можна отримати відповіді на будь-які питання, що стосуються процесу вирішення проблем у Python.
