Repository: python/python-docs-uk
Catalog: extending/building.po
Languages: uk

source: Building C and C++ Extensions
uk: Створення розширень C і C++

source: A C extension for CPython is a shared library (e.g. a ``.so`` file on Linux, ``.pyd`` on Windows), which exports an *initialization function*.
uk: Розширення C для CPython — це спільна бібліотека (наприклад, файл ``.so`` у Linux, ``.pyd`` у Windows), яка експортує *функцію ініціалізації*.

source: To be importable, the shared library must be available on :envvar:`PYTHONPATH`, and must be named after the module name, with an appropriate extension. When using distutils, the correct filename is generated automatically.
uk: Щоб бути імпортованою, спільна бібліотека має бути доступною на :envvar:`PYTHONPATH` і мати назву за назвою модуля з відповідним розширенням. Під час використання distutils правильна назва файлу генерується автоматично.

source: The initialization function has the signature:
uk: Функція ініціалізації має сигнатуру:

source: It returns either a fully-initialized module, or a :c:type:`PyModuleDef` instance. See :ref:`initializing-modules` for details.
uk: Він повертає або повністю ініціалізований модуль, або екземпляр :c:type:`PyModuleDef`. Перегляньте :ref:`initializing-modules` для деталей.

source: For modules with ASCII-only names, the function must be named ``PyInit_<modulename>``, with ``<modulename>`` replaced by the name of the module. When using :ref:`multi-phase-initialization`, non-ASCII module names are allowed. In this case, the initialization function name is ``PyInitU_<modulename>``, with ``<modulename>`` encoded using Python's *punycode* encoding with hyphens replaced by underscores. In Python::
uk: Для модулів із іменами лише у форматі ASCII функція має мати назву ``PyInit_ <modulename>``, при цьому ``<modulename>`` замінюється назвою модуля. При використанні :ref:`multi-phase-initialization` дозволені назви модулів, відмінні від ASCII. У цьому випадку ім’я функції ініціалізації – ``PyInitU_ <modulename>``, де ``<modulename>`` закодовано з використанням *punycode* кодування Python із дефісами, заміненими підкресленням. У Python::

source: It is possible to export multiple modules from a single shared library by defining multiple initialization functions. However, importing them requires using symbolic links or a custom importer, because by default only the function corresponding to the filename is found. See the *"Multiple modules in one library"* section in :pep:`489` for details.
uk: Можна експортувати кілька модулів з однієї спільної бібліотеки, визначивши кілька функцій ініціалізації. Однак для їх імпортування потрібно використовувати символічні посилання або спеціальний імпортер, оскільки за замовчуванням знайдено лише функцію, яка відповідає назві файлу. Подробиці див. у розділі *"Кілька модулів в одній бібліотеці"* у :pep:`489`.

source: Building C and C++ Extensions with distutils
uk: Створення розширень C і C++ за допомогою distutils

source: Extension modules can be built using distutils, which is included in Python. Since distutils also supports creation of binary packages, users don't necessarily need a compiler and distutils to install the extension.
uk: Модулі розширення можна створити за допомогою distutils, який входить до складу Python. Оскільки distutils також підтримує створення двійкових пакетів, користувачам не обов’язково потрібен компілятор і distutils для встановлення розширення.

source: A distutils package contains a driver script, :file:`setup.py`. This is a plain Python file, which, in the most simple case, could look like this:
uk: Пакет distutils містить сценарій драйвера :file:`setup.py`. Це звичайний файл Python, який у найпростішому випадку може виглядати так:

source: With this :file:`setup.py`, and a file :file:`demo.c`, running ::
uk: З цим :file:`setup.py` і файлом :file:`demo.c`, запускаючи ::

source: will compile :file:`demo.c`, and produce an extension module named ``demo`` in the :file:`build` directory. Depending on the system, the module file will end up in a subdirectory :file:`build/lib.system`, and may have a name like :file:`demo.so` or :file:`demo.pyd`.
uk: скомпілює :file:`demo.c` і створить модуль розширення під назвою ``demo`` у каталозі :file:`build`. Залежно від системи, файл модуля буде розміщено в підкаталозі :file:`build/lib.system` і може мати таку назву, як :file:`demo.so` або :file:`demo.pyd`.

source: In the :file:`setup.py`, all execution is performed by calling the ``setup`` function. This takes a variable number of keyword arguments, of which the example above uses only a subset. Specifically, the example specifies meta-information to build packages, and it specifies the contents of the package. Normally, a package will contain additional modules, like Python source modules, documentation, subpackages, etc. Please refer to the distutils documentation in :ref:`distutils-index` to learn more about the features of distutils; this section explains building extension modules only.
uk: У :file:`setup.py` все виконання виконується шляхом виклику функції ``setup``. Це вимагає змінної кількості аргументів ключових слів, з яких у прикладі вище використовується лише підмножина. Зокрема, у прикладі вказується мета-інформація для створення пакетів і вказується вміст пакета. Зазвичай пакунок містить додаткові модулі, як-от вихідні модулі Python, документацію, підпакунки тощо. Будь ласка, зверніться до документації distutils у :ref:`distutils-index`, щоб дізнатися більше про функції distutils; у цьому розділі пояснюється лише створення модулів розширення.

source: It is common to pre-compute arguments to :func:`setup`, to better structure the driver script. In the example above, the ``ext_modules`` argument to :func:`~distutils.core.setup` is a list of extension modules, each of which is an instance of the :class:`~distutils.extension.Extension`. In the example, the instance defines an extension named ``demo`` which is build by compiling a single source file, :file:`demo.c`.
uk: Зазвичай попередньо обчислюють аргументи :func:`setup`, щоб краще структурувати сценарій драйвера. У наведеному вище прикладі аргумент ``ext_modules`` для :func:`~distutils.core.setup` є списком модулів розширення, кожен з яких є екземпляром :class:`~distutils.extension.Extension` . У цьому прикладі примірник визначає розширення під назвою ``demo``, яке створюється шляхом компіляції єдиного вихідного файлу :file:`demo.c`.

source: In many cases, building an extension is more complex, since additional preprocessor defines and libraries may be needed. This is demonstrated in the example below.
uk: У багатьох випадках створення розширення є більш складним, оскільки можуть знадобитися додаткові визначення препроцесора та бібліотеки. Це показано на прикладі нижче.

source: In this example, :func:`~distutils.core.setup` is called with additional meta-information, which is recommended when distribution packages have to be built. For the extension itself, it specifies preprocessor defines, include directories, library directories, and libraries. Depending on the compiler, distutils passes this information in different ways to the compiler. For example, on Unix, this may result in the compilation commands ::
uk: У цьому прикладі :func:`~distutils.core.setup` викликається з додатковою мета-інформацією, яку рекомендується використовувати, коли потрібно створити дистрибутивні пакунки. Для самого розширення воно вказує визначення препроцесора, включає каталоги, каталоги бібліотек і бібліотеки. Залежно від компілятора distutils передає цю інформацію компілятору різними способами. Наприклад, в Unix це може призвести до команд компіляції:

source: These lines are for demonstration purposes only; distutils users should trust that distutils gets the invocations right.
uk: Ці рядки призначені лише для демонстрації; Користувачі distutils повинні вірити, що distutils виконує правильні виклики.

source: Distributing your extension modules
uk: Розповсюдження ваших модулів розширення

source: When an extension has been successfully built, there are three ways to use it.
uk: Якщо розширення успішно створено, є три способи його використання.

source: End-users will typically want to install the module, they do so by running ::
uk: Кінцеві користувачі зазвичай хочуть встановити модуль, вони роблять це, запустивши ::

source: Module maintainers should produce source packages; to do so, they run ::
uk: Супроводжувачі модулів повинні створювати пакети вихідних кодів; для цього вони запускають ::

source: In some cases, additional files need to be included in a source distribution; this is done through a :file:`MANIFEST.in` file; see :ref:`manifest` for details.
uk: У деяких випадках додаткові файли потрібно включити до вихідного дистрибутива; це робиться через файл :file:`MANIFEST.in`; подробиці див. :ref:`manifest`.

source: If the source distribution has been built successfully, maintainers can also create binary distributions. Depending on the platform, one of the following commands can be used to do so. ::
uk: Якщо вихідний дистрибутив було створено успішно, супроводжувачі також можуть створювати двійкові дистрибутиви. Залежно від платформи для цього можна використати одну з наведених нижче команд. ::
