Repository: python/python-docs-uk
Catalog: extending/extending.po
Languages: uk

source: Extending Python with C or C++
uk: Розширення Python за допомогою C або C++

source: It is quite easy to add new built-in modules to Python, if you know how to program in C. Such :dfn:`extension modules` can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls.
uk: Доволі легко додати нові вбудовані модулі до Python, якщо ви знаєте, як програмувати на C. Такі :dfn:`extension modules` можуть робити дві речі, які не можна зробити безпосередньо в Python: вони можуть реалізувати нові вбудовані модулі. -in типи об'єктів, і вони можуть викликати функції бібліотеки C і системні виклики.

source: To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header ``"Python.h"``.
uk: Для підтримки розширень API Python (інтерфейс прикладного програмування) визначає набір функцій, макросів і змінних, які надають доступ до більшості аспектів системи виконання Python. API Python включено у вихідний файл C шляхом включення заголовка ``"Python.h"``.

source: The compilation of an extension module depends on its intended use as well as on your system setup; details are given in later chapters.
uk: Компіляція модуля розширення залежить від його цільового використання, а також від налаштування вашої системи; подробиці наведено в наступних розділах.

source: The C extension interface is specific to CPython, and extension modules do not work on other Python implementations. In many cases, it is possible to avoid writing C extensions and preserve portability to other implementations. For example, if your use case is calling C library functions or system calls, you should consider using the :mod:`ctypes` module or the `cffi <https://cffi.readthedocs.io/>`_ library rather than writing custom C code. These modules let you write Python code to interface with C code and are more portable between implementations of Python than writing and compiling a C extension module.
uk: Інтерфейс розширення C є специфічним для CPython, а модулі розширення не працюють в інших реалізаціях Python. У багатьох випадках можна уникнути написання розширень C і зберегти переносимість на інші реалізації. Наприклад, якщо ви використовуєте виклик функцій бібліотеки C або системних викликів, вам слід розглянути можливість використання модуля :mod:`ctypes` або бібліотеки `cffi <https://cffi.readthedocs.io/>`_ замість написання спеціального коду C. Ці модулі дозволяють писати код Python для взаємодії з кодом C і є більш переносимими між реалізаціями Python, ніж написання та компіляція модуля розширення C.

source: A Simple Example
uk: Простий приклад

source: Let's create an extension module called ``spam`` (the favorite food of Monty Python fans...) and let's say we want to create a Python interface to the C library function :c:func:`system` [#]_. This function takes a null-terminated character string as argument and returns an integer. We want this function to be callable from Python as follows:
uk: Давайте створимо модуль розширення під назвою ``spam`` (улюблена їжа шанувальників Monty Python...) і, скажімо, ми хочемо створити інтерфейс Python для функції бібліотеки C :c:func:`system` [#]_ . Ця функція приймає рядок символів із нулем у кінці як аргумент і повертає ціле число. Ми хочемо, щоб цю функцію можна було викликати з Python наступним чином:

source: Begin by creating a file :file:`spammodule.c`. (Historically, if a module is called ``spam``, the C file containing its implementation is called :file:`spammodule.c`; if the module name is very long, like ``spammify``, the module name can be just :file:`spammify.c`.)
uk: Почніть із створення файлу :file:`spammodule.c`. (Історично склалося так, що якщо модуль називається ``спам``, файл C, що містить його реалізацію, називається :file:`spammodule.c`; якщо назва модуля дуже довга, наприклад ``spammify``, назва модуля може бути просто :file:`spammify.c`.)

source: The first two lines of our file can be::
uk: Перші два рядки нашого файлу можуть бути:

source: which pulls in the Python API (you can add a comment describing the purpose of the module and a copyright notice if you like).
uk: який залучає API Python (ви можете додати коментар із описом призначення модуля та повідомлення про авторські права, якщо хочете).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
uk: Оскільки Python може визначати деякі визначення попереднього процесора, які впливають на стандартні заголовки в деяких системах, ви *мусите* включити :file:`Python.h` перед тим, як включити будь-які стандартні заголовки.

source: All user-visible symbols defined by :file:`Python.h` have a prefix of ``Py`` or ``PY``, except those defined in standard header files. For convenience, and since they are used extensively by the Python interpreter, ``"Python.h"`` includes a few standard header files: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, and ``<stdlib.h>``. If the latter header file does not exist on your system, it declares the functions :c:func:`malloc`, :c:func:`free` and :c:func:`realloc` directly.
uk: Усі видимі користувачем символи, визначені :file:`Python.h`, мають префікс ``Py`` або ``PY``, за винятком тих, що визначені у стандартних файлах заголовків. Для зручності та оскільки вони широко використовуються інтерпретатором Python, ``"Python.h"`` містить кілька стандартних файлів заголовків: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, і ``<stdlib.h>``. Якщо останнього файлу заголовка не існує у вашій системі, він безпосередньо оголошує функції :c:func:`malloc`, :c:func:`free` і :c:func:`realloc`.

source: The next thing we add to our module file is the C function that will be called when the Python expression ``spam.system(string)`` is evaluated (we'll see shortly how it ends up being called)::
uk: Наступне, що ми додаємо до нашого файлу модуля, це функція C, яка буде викликана, коли буде обчислено вираз Python ``spam.system(string)`` (незабаром ми побачимо, як вона буде викликана):

source: There is a straightforward translation from the argument list in Python (for example, the single expression ``"ls -l"``) to the arguments passed to the C function. The C function always has two arguments, conventionally named *self* and *args*.
uk: Існує прямий переклад зі списку аргументів у Python (наприклад, один вираз ``"ls -l"``) в аргументи, передані функції C. Функція C завжди має два аргументи, умовно названі *self* і *args*.

source: The *self* argument points to the module object for module-level functions; for a method it would point to the object instance.
uk: Аргумент *self* вказує на об’єкт модуля для функцій рівня модуля; для методу він вказував би на екземпляр об’єкта.

source: The *args* argument will be a pointer to a Python tuple object containing the arguments. Each item of the tuple corresponds to an argument in the call's argument list. The arguments are Python objects --- in order to do anything with them in our C function we have to convert them to C values. The function :c:func:`PyArg_ParseTuple` in the Python API checks the argument types and converts them to C values. It uses a template string to determine the required types of the arguments as well as the types of the C variables into which to store the converted values. More about this later.
uk: Аргумент *args* буде вказівником на об’єкт кортежу Python, що містить аргументи. Кожен елемент кортежу відповідає аргументу в списку аргументів виклику. Аргументи є об’єктами Python --- щоб щось робити з ними в нашій функції C, ми повинні перетворити їх на значення C. Функція :c:func:`PyArg_ParseTuple` в API Python перевіряє типи аргументів і перетворює їх на значення C. Він використовує рядок шаблону для визначення необхідних типів аргументів, а також типів змінних C, у яких зберігатимуться перетворені значення. Про це пізніше.

source: :c:func:`PyArg_ParseTuple` returns true (nonzero) if all arguments have the right type and its components have been stored in the variables whose addresses are passed. It returns false (zero) if an invalid argument list was passed. In the latter case it also raises an appropriate exception so the calling function can return ``NULL`` immediately (as we saw in the example).
uk: :c:func:`PyArg_ParseTuple` повертає істину (не нуль), якщо всі аргументи мають правильний тип і його компоненти зберігаються в змінних, адреси яких передано. Він повертає false (нуль), якщо було передано недійсний список аргументів. В останньому випадку він також викликає відповідний виняток, щоб функція, що викликає, могла негайно повернути ``NULL`` (як ми бачили в прикладі).

source: Intermezzo: Errors and Exceptions
uk: Intermezzo: помилки та винятки

source: An important convention throughout the Python interpreter is the following: when a function fails, it should set an exception condition and return an error value (usually ``-1`` or a ``NULL`` pointer). Exception information is stored in three members of the interpreter's thread state. These are ``NULL`` if there is no exception. Otherwise they are the C equivalents of the members of the Python tuple returned by :meth:`sys.exc_info`. These are the exception type, exception instance, and a traceback object. It is important to know about them to understand how errors are passed around.
uk: Важлива конвенція в інтерпретаторі Python полягає в наступному: коли функція виходить з ладу, вона повинна встановити умову винятку та повернути значення помилки (зазвичай ``-1`` або ``NULL`` покажчик). Інформація про винятки зберігається в трьох членах стану потоку інтерпретатора. Це ``NULL``, якщо немає винятку. В іншому випадку вони є еквівалентами C членів кортежу Python, які повертає :meth:`sys.exc_info`. Це тип винятку, екземпляр винятку та об’єкт трасування. Важливо знати про них, щоб зрозуміти, як передаються помилки.

source: The Python API defines a number of functions to set various types of exceptions.
uk: API Python визначає низку функцій для встановлення різних типів винятків.

source: The most common one is :c:func:`PyErr_SetString`. Its arguments are an exception object and a C string. The exception object is usually a predefined object like :c:data:`PyExc_ZeroDivisionError`. The C string indicates the cause of the error and is converted to a Python string object and stored as the "associated value" of the exception.
uk: Найпоширенішим є :c:func:`PyErr_SetString`. Його аргументами є об’єкт винятку та рядок C. Об’єкт винятку зазвичай є попередньо визначеним об’єктом, наприклад :c:data:`PyExc_ZeroDivisionError`. Рядок C вказує на причину помилки, перетворюється на об’єкт рядка Python і зберігається як "пов’язане значення" винятку.

source: Another useful function is :c:func:`PyErr_SetFromErrno`, which only takes an exception argument and constructs the associated value by inspection of the global variable :c:data:`errno`. The most general function is :c:func:`PyErr_SetObject`, which takes two object arguments, the exception and its associated value. You don't need to :c:func:`Py_INCREF` the objects passed to any of these functions.
uk: Іншою корисною функцією є :c:func:`PyErr_SetFromErrno`, яка приймає лише аргумент винятку та створює пов’язане значення шляхом перевірки глобальної змінної :c:data:`errno`. Найбільш загальною функцією є :c:func:`PyErr_SetObject`, яка приймає два аргументи об’єкта, виняток і пов’язане з ним значення. Вам не потрібно :c:func:`Py_INCREF` об’єкти, передані в будь-яку з цих функцій.

source: You can test non-destructively whether an exception has been set with :c:func:`PyErr_Occurred`. This returns the current exception object, or ``NULL`` if no exception has occurred. You normally don't need to call :c:func:`PyErr_Occurred` to see whether an error occurred in a function call, since you should be able to tell from the return value.
uk: За допомогою :c:func:`PyErr_Occurred` можна неруйнівним чином перевірити, чи встановлено виняток. Це повертає поточний об’єкт винятку або ``NULL``, якщо винятку не сталося. Зазвичай вам не потрібно викликати :c:func:`PyErr_Occurred`, щоб перевірити, чи сталася помилка під час виклику функції, оскільки ви зможете визначити це за значенням, що повертається.

source: To ignore an exception set by a function call that failed, the exception condition must be cleared explicitly by calling :c:func:`PyErr_Clear`. The only time C code should call :c:func:`PyErr_Clear` is if it doesn't want to pass the error on to the interpreter but wants to handle it completely by itself (possibly by trying something else, or pretending nothing went wrong).
uk: Щоб проігнорувати виняток, встановлений невдалим викликом функції, умову виключення потрібно явно очистити, викликавши :c:func:`PyErr_Clear`. Єдиний раз, коли C-код повинен викликати :c:func:`PyErr_Clear`, це якщо він не хоче передавати помилку інтерпретатору, а хоче обробити її повністю сам (можливо, спробувавши щось інше або вдаючи, що нічого не пішло не так). ).

source: Every failing :c:func:`malloc` call must be turned into an exception --- the direct caller of :c:func:`malloc` (or :c:func:`realloc`) must call :c:func:`PyErr_NoMemory` and return a failure indicator itself. All the object-creating functions (for example, :c:func:`PyLong_FromLong`) already do this, so this note is only relevant to those who call :c:func:`malloc` directly.
uk: Кожен невдалий виклик :c:func:`malloc` має бути перетворений на виняток --- прямий виклик :c:func:`malloc` (або :c:func:`realloc`) повинен викликати :c:func:`PyErr_NoMemory` і повертає сам індикатор помилки. Усі функції створення об’єктів (наприклад, :c:func:`PyLong_FromLong`) уже це роблять, тому ця примітка актуальна лише для тих, хто викликає :c:func:`malloc` безпосередньо.

source: Also note that, with the important exception of :c:func:`PyArg_ParseTuple` and friends, functions that return an integer status usually return a positive value or zero for success and ``-1`` for failure, like Unix system calls.
uk: Також зауважте, що, за винятком :c:func:`PyArg_ParseTuple` та друзів, функції, які повертають цілочисельний статус, зазвичай повертають додатне значення або нуль у разі успіху та ``-1`` у разі невдачі, як системні виклики Unix.

source: Finally, be careful to clean up garbage (by making :c:func:`Py_XDECREF` or :c:func:`Py_DECREF` calls for objects you have already created) when you return an error indicator!
uk: Нарешті, будьте обережні, щоб очистити сміття (за допомогою викликів :c:func:`Py_XDECREF` або :c:func:`Py_DECREF` для об’єктів, які ви вже створили), коли ви повертаєте індикатор помилки!

source: You can also define a new exception that is unique to your module. For this, you usually declare a static object variable at the beginning of your file::
uk: Ви також можете визначити новий виняток, унікальний для вашого модуля. Для цього ви зазвичай оголошуєте змінну статичного об’єкта на початку вашого файлу::

source: Back to the Example
uk: Повернемося до прикладу

source: Going back to our example function, you should now be able to understand this statement::
uk: Повертаючись до нашого прикладу функції, тепер ви зможете зрозуміти цей оператор:

source: The next statement is a call to the Unix function :c:func:`system`, passing it the string we just got from :c:func:`PyArg_ParseTuple`::
uk: Наступний оператор — це виклик функції Unix :c:func:`system`, передаючи їй рядок, який ми щойно отримали з :c:func:`PyArg_ParseTuple`::

source: In this case, it will return an integer object. (Yes, even integers are objects on the heap in Python!)
uk: У цьому випадку він поверне цілочисельний об’єкт. (Так, навіть цілі числа є об’єктами в купі в Python!)

source: :c:data:`Py_None` is the C name for the special Python object ``None``. It is a genuine Python object rather than a ``NULL`` pointer, which means "error" in most contexts, as we have seen.
uk: :c:data:`Py_None` — це ім’я C для спеціального об’єкта Python ``None``. Це справжній об’єкт Python, а не покажчик ``NULL``, що означає "помилку" в більшості контекстів, як ми бачили.

source: The Module's Method Table and Initialization Function
uk: Таблиця методів модуля та функція ініціалізації

source: Note the third entry (``METH_VARARGS``). This is a flag telling the interpreter the calling convention to be used for the C function. It should normally always be ``METH_VARARGS`` or ``METH_VARARGS | METH_KEYWORDS``; a value of ``0`` means that an obsolete variant of :c:func:`PyArg_ParseTuple` is used.
uk: Зверніть увагу на третій запис (``METH_VARARGS``). Це прапорець, який повідомляє інтерпретатору умову виклику, яка буде використовуватися для функції C. Зазвичай це завжди має бути ``METH_VARARGS`` або ``METH_VARARGS | METH_KEYWORDS``; значення ``0`` означає, що використовується застарілий варіант :c:func:`PyArg_ParseTuple`.

source: When using only ``METH_VARARGS``, the function should expect the Python-level parameters to be passed in as a tuple acceptable for parsing via :c:func:`PyArg_ParseTuple`; more information on this function is provided below.
uk: Якщо використовується лише ``METH_VARARGS``, функція повинна очікувати, що параметри рівня Python будуть передані як кортеж, прийнятний для аналізу через :c:func:`PyArg_ParseTuple`; більше інформації про цю функцію наведено нижче.

source: The method table must be referenced in the module definition structure::
uk: На таблицю методів має бути посилання в структурі визначення модуля:

source: Removing entries from ``sys.modules`` or importing compiled modules into multiple interpreters within a process (or following a :c:func:`fork` without an intervening :c:func:`exec`) can create problems for some extension modules. Extension module authors should exercise caution when initializing internal data structures.
uk: Видалення записів із ``sys.modules`` або імпортування скомпільованих модулів у кілька інтерпретаторів у межах процесу (або виконання :c:func:`fork` без втручання :c:func:`exec`) може створити проблеми для деяких розширень модулі. Авторам модулів розширення слід бути обережними під час ініціалізації внутрішніх структур даних.

source: A more substantial example module is included in the Python source distribution as :file:`Modules/xxmodule.c`. This file may be used as a template or simply read as an example.
uk: Більш суттєвий приклад модуля включено в вихідний код Python як :file:`Modules/xxmodule.c`. Цей файл можна використовувати як шаблон або просто прочитати як приклад.

source: Unlike our ``spam`` example, ``xxmodule`` uses *multi-phase initialization* (new in Python 3.5), where a PyModuleDef structure is returned from ``PyInit_spam``, and creation of the module is left to the import machinery. For details on multi-phase initialization, see :PEP:`489`.
uk: На відміну від нашого прикладу ``спаму``, ``xxmodule`` використовує *багатофазову ініціалізацію* (нове в Python 3.5), де структура PyModuleDef повертається з ``PyInit_spam``, а створення модуля залишається за імпортне обладнання. Докладніше про багатофазову ініціалізацію див. :PEP:`489`.

source: Compilation and Linkage
uk: Компіляція та зв'язування

source: There are two more things to do before you can use your new extension: compiling and linking it with the Python system. If you use dynamic loading, the details may depend on the style of dynamic loading your system uses; see the chapters about building extension modules (chapter :ref:`building`) and additional information that pertains only to building on Windows (chapter :ref:`building-on-windows`) for more information about this.
uk: Перш ніж використовувати нове розширення, потрібно зробити ще дві речі: скомпілювати та зв’язати його з системою Python. Якщо ви використовуєте динамічне завантаження, деталі можуть залежати від стилю динамічного завантаження, який використовує ваша система; дивіться розділи про створення модулів розширення (глава :ref:`building`) та додаткову інформацію, яка стосується лише збірки на Windows (глава :ref:`building-on-windows`), щоб отримати додаткові відомості про це.

source: If you can't use dynamic loading, or if you want to make your module a permanent part of the Python interpreter, you will have to change the configuration setup and rebuild the interpreter. Luckily, this is very simple on Unix: just place your file (:file:`spammodule.c` for example) in the :file:`Modules/` directory of an unpacked source distribution, add a line to the file :file:`Modules/Setup.local` describing your file:
uk: Якщо ви не можете використовувати динамічне завантаження або якщо ви хочете зробити свій модуль постійною частиною інтерпретатора Python, вам доведеться змінити налаштування конфігурації та перебудувати інтерпретатор. На щастя, в Unix це дуже просто: просто розмістіть свій файл (наприклад, :file:`spammodule.c`) у каталозі :file:`Modules/` розпакованого вихідного дистрибутива, додайте рядок до файлу :file:`Modules/Setup.local`, що описує ваш файл:

source: and rebuild the interpreter by running :program:`make` in the toplevel directory. You can also run :program:`make` in the :file:`Modules/` subdirectory, but then you must first rebuild :file:`Makefile` there by running ':program:`make` Makefile'. (This is necessary each time you change the :file:`Setup` file.)
uk: і перебудуйте інтерпретатор, запустивши :program:`make` у каталозі верхнього рівня. Ви також можете запустити :program:`make` у підкаталозі :file:`Modules/`, але тоді ви повинні спочатку перебудувати :file:`Makefile` там, запустивши ':program:`make` Makefile'. (Це необхідно щоразу, коли ви змінюєте файл :file:`Setup`.)

source: If your module requires additional libraries to link with, these can be listed on the line in the configuration file as well, for instance:
uk: Якщо вашому модулю потрібні додаткові бібліотеки для зв’язування, їх також можна вказати в рядку у файлі конфігурації, наприклад:

source: Calling Python Functions from C
uk: Виклик функцій Python із C

source: So far we have concentrated on making C functions callable from Python. The reverse is also useful: calling Python functions from C. This is especially the case for libraries that support so-called "callback" functions. If a C interface makes use of callbacks, the equivalent Python often needs to provide a callback mechanism to the Python programmer; the implementation will require calling the Python callback functions from a C callback. Other uses are also imaginable.
uk: Поки що ми зосереджувалися на тому, щоб зробити функції C викликаними з Python. Корисним є і зворотний шлях: виклик функцій Python із C. Особливо це стосується бібліотек, які підтримують так звані функції "зворотного виклику". Якщо інтерфейс C використовує зворотні виклики, еквівалентний Python часто потребує надання механізму зворотного виклику для програміста Python; реалізація вимагатиме виклику функцій зворотного виклику Python із зворотного виклику C. Можна уявити й інші способи використання.

source: Fortunately, the Python interpreter is easily called recursively, and there is a standard interface to call a Python function. (I won't dwell on how to call the Python parser with a particular string as input --- if you're interested, have a look at the implementation of the :option:`-c` command line option in :file:`Modules/main.c` from the Python source code.)
uk: На щастя, інтерпретатор Python легко викликати рекурсивно, і існує стандартний інтерфейс для виклику функції Python. (Я не буду зупинятися на тому, як викликати синтаксичний аналізатор Python за допомогою певного рядка як вхідних даних --- якщо вам цікаво, подивіться на реалізацію параметра командного рядка :option:`-c` у :file:`Modules/main.c` з вихідного коду Python.)
