Repository: python/python-docs-uk
Catalog: extending/extending.po
Languages: uk

source: Calling a Python function is easy. First, the Python program must somehow pass you the Python function object. You should provide a function (or some other interface) to do this. When this function is called, save a pointer to the Python function object (be careful to :c:func:`Py_INCREF` it!) in a global variable --- or wherever you see fit. For example, the following function might be part of a module definition::
uk: Викликати функцію Python легко. По-перше, програма Python повинна якимось чином передати вам об’єкт функції Python. Ви повинні надати функцію (або інший інтерфейс), щоб це зробити. Під час виклику цієї функції збережіть вказівник на об’єкт функції Python (будьте обережні, щоб :c:func:`Py_INCREF` це!) у глобальній змінній --- або будь-де, де ви вважаєте за потрібне. Наприклад, наступна функція може бути частиною визначення модуля:

source: The macros :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` increment/decrement the reference count of an object and are safe in the presence of ``NULL`` pointers (but note that *temp* will not be ``NULL`` in this context). More info on them in section :ref:`refcounts`.
uk: Макроси :c:func:`Py_XINCREF` і :c:func:`Py_XDECREF` збільшують/зменшують кількість посилань на об’єкт і безпечні за наявності покажчиків ``NULL`` (але зауважте, що *temp* не буде бути ``NULL`` у цьому контексті). Детальніше про них у розділі :ref:`refcounts`.

source: Later, when it is time to call the function, you call the C function :c:func:`PyObject_CallObject`. This function has two arguments, both pointers to arbitrary Python objects: the Python function, and the argument list. The argument list must always be a tuple object, whose length is the number of arguments. To call the Python function with no arguments, pass in ``NULL``, or an empty tuple; to call it with one argument, pass a singleton tuple. :c:func:`Py_BuildValue` returns a tuple when its format string consists of zero or more format codes between parentheses. For example::
uk: Пізніше, коли прийде час викликати функцію, ви викликаєте функцію C :c:func:`PyObject_CallObject`. Ця функція має два аргументи, обидва вказують на довільні об’єкти Python: функція Python і список аргументів. Список аргументів завжди має бути об’єктом кортежу, довжина якого дорівнює кількості аргументів. Щоб викликати функцію Python без аргументів, передайте ``NULL`` або пустий кортеж; щоб викликати його з одним аргументом, передайте одиночний кортеж. :c:func:`Py_BuildValue` повертає кортеж, якщо його рядок формату складається з нуля або більше кодів формату в дужках. Наприклад::

source: :c:func:`PyObject_CallObject` returns a Python object pointer: this is the return value of the Python function. :c:func:`PyObject_CallObject` is "reference-count-neutral" with respect to its arguments. In the example a new tuple was created to serve as the argument list, which is :c:func:`Py_DECREF`\ -ed immediately after the :c:func:`PyObject_CallObject` call.
uk: :c:func:`PyObject_CallObject` повертає покажчик на об’єкт Python: це значення, яке повертає функція Python. :c:func:`PyObject_CallObject` є "нейтральним щодо кількості посилань" щодо своїх аргументів. У прикладі було створено новий кортеж, який слугуватиме списком аргументів, який :c:func:`Py_DECREF`\ -редагується відразу після виклику :c:func:`PyObject_CallObject`.

source: The return value of :c:func:`PyObject_CallObject` is "new": either it is a brand new object, or it is an existing object whose reference count has been incremented. So, unless you want to save it in a global variable, you should somehow :c:func:`Py_DECREF` the result, even (especially!) if you are not interested in its value.
uk: Значення, що повертається :c:func:`PyObject_CallObject`, є "новим": або це абсолютно новий об’єкт, або це вже існуючий об’єкт, кількість посилань на який було збільшено. Отже, якщо ви не хочете зберегти його в глобальній змінній, ви повинні якимось чином :c:func:`Py_DECREF` результат, навіть (особливо!), якщо вас не цікавить його значення.

source: Before you do this, however, it is important to check that the return value isn't ``NULL``. If it is, the Python function terminated by raising an exception. If the C code that called :c:func:`PyObject_CallObject` is called from Python, it should now return an error indication to its Python caller, so the interpreter can print a stack trace, or the calling Python code can handle the exception. If this is not possible or desirable, the exception should be cleared by calling :c:func:`PyErr_Clear`. For example::
uk: Однак перед тим, як це зробити, важливо переконатися, що значення, що повертається, не ``NULL``. Якщо так, функція Python припиняється, викликаючи виняток. Якщо код C, який викликав :c:func:`PyObject_CallObject`, викликається з Python, тепер він має повернути вказівку про помилку своєму виклику Python, щоб інтерпретатор міг надрукувати трасування стека, або викликаючий код Python міг обробити виняткову ситуацію. Якщо це неможливо чи бажано, виняток слід очистити, викликавши :c:func:`PyErr_Clear`. Наприклад::

source: Depending on the desired interface to the Python callback function, you may also have to provide an argument list to :c:func:`PyObject_CallObject`. In some cases the argument list is also provided by the Python program, through the same interface that specified the callback function. It can then be saved and used in the same manner as the function object. In other cases, you may have to construct a new tuple to pass as the argument list. The simplest way to do this is to call :c:func:`Py_BuildValue`. For example, if you want to pass an integral event code, you might use the following code::
uk: Залежно від бажаного інтерфейсу для функції зворотного виклику Python, вам також може знадобитися надати список аргументів для :c:func:`PyObject_CallObject`. У деяких випадках список аргументів також надається програмою Python через той самий інтерфейс, який вказав функцію зворотного виклику. Потім його можна зберегти та використовувати так само, як і об’єкт функції. В інших випадках вам, можливо, доведеться створити новий кортеж для передачі як списку аргументів. Найпростіший спосіб зробити це — викликати :c:func:`Py_BuildValue`. Наприклад, якщо ви хочете передати інтегральний код події, ви можете використати такий код:

source: Note the placement of ``Py_DECREF(arglist)`` immediately after the call, before the error check! Also note that strictly speaking this code is not complete: :c:func:`Py_BuildValue` may run out of memory, and this should be checked.
uk: Зверніть увагу на розміщення ``Py_DECREF(arglist)`` одразу після виклику, перед перевіркою помилок! Також зауважте, що строго кажучи, цей код неповний: :c:func:`Py_BuildValue` може не вистачати пам’яті, і це слід перевірити.

source: You may also call a function with keyword arguments by using :c:func:`PyObject_Call`, which supports arguments and keyword arguments. As in the above example, we use :c:func:`Py_BuildValue` to construct the dictionary. ::
uk: Ви також можете викликати функцію з ключовими аргументами за допомогою :c:func:`PyObject_Call`, який підтримує аргументи та ключові аргументи. Як і в наведеному вище прикладі, ми використовуємо :c:func:`Py_BuildValue` для створення словника. ::

source: Extracting Parameters in Extension Functions
uk: Вилучення параметрів у функціях розширення

source: The :c:func:`PyArg_ParseTuple` function is declared as follows::
uk: Функція :c:func:`PyArg_ParseTuple` оголошується таким чином:

source: The *arg* argument must be a tuple object containing an argument list passed from Python to a C function. The *format* argument must be a format string, whose syntax is explained in :ref:`arg-parsing` in the Python/C API Reference Manual. The remaining arguments must be addresses of variables whose type is determined by the format string.
uk: Аргумент *arg* має бути об’єктом кортежу, що містить список аргументів, переданий з Python до функції C. Аргумент *format* має бути рядком формату, синтаксис якого пояснюється в :ref:`arg-parsing` у довідковому посібнику Python/C API. Решта аргументів мають бути адресами змінних, тип яких визначається рядком формату.

source: Note that while :c:func:`PyArg_ParseTuple` checks that the Python arguments have the required types, it cannot check the validity of the addresses of C variables passed to the call: if you make mistakes there, your code will probably crash or at least overwrite random bits in memory. So be careful!
uk: Зауважте, що хоча :c:func:`PyArg_ParseTuple` перевіряє, чи аргументи Python мають необхідні типи, він не може перевірити дійсність адрес змінних C, переданих до виклику: якщо ви припуститеся там помилки, ваш код, ймовірно, аварійно завершить роботу. найменше перезаписувати випадкові біти в пам'яті. Тому будьте обережні!

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
uk: Зауважте, що будь-які посилання на об’єкти Python, які надаються абоненту, є *позиченими* посиланнями; не зменшуйте кількість посилань!

source: Some example calls::
uk: Деякі приклади викликів::

source: Keyword Parameters for Extension Functions
uk: Параметри ключових слів для функцій розширення

source: The :c:func:`PyArg_ParseTupleAndKeywords` function is declared as follows::
uk: Функція :c:func:`PyArg_ParseTupleAndKeywords` оголошується таким чином:

source: The *arg* and *format* parameters are identical to those of the :c:func:`PyArg_ParseTuple` function. The *kwdict* parameter is the dictionary of keywords received as the third parameter from the Python runtime. The *kwlist* parameter is a ``NULL``-terminated list of strings which identify the parameters; the names are matched with the type information from *format* from left to right. On success, :c:func:`PyArg_ParseTupleAndKeywords` returns true, otherwise it returns false and raises an appropriate exception.
uk: Параметри *arg* і *format* ідентичні параметрам функції :c:func:`PyArg_ParseTuple`. Параметр *kwdict* — це словник ключових слів, отриманий як третій параметр із середовища виконання Python. Параметр *kwlist* — це список рядків, що завершуються ``NULL`` і ідентифікують параметри; імена зіставляються з інформацією про тип із *format* зліва направо. У разі успіху :c:func:`PyArg_ParseTupleAndKeywords` повертає true, інакше повертає false і викликає відповідний виняток.

source: Nested tuples cannot be parsed when using keyword arguments! Keyword parameters passed in which are not present in the *kwlist* will cause :exc:`TypeError` to be raised.
uk: Вкладені кортежі неможливо проаналізувати за допомогою аргументів ключових слів! Передані параметри ключового слова, яких немає в *kwlist*, призведуть до появи :exc:`TypeError`.

source: Here is an example module which uses keywords, based on an example by Geoff Philbrick (philbrick@hks.com)::
uk: Ось приклад модуля, який використовує ключові слова, на основі прикладу Джеффа Філбріка (philbrick@hks.com):

source: Building Arbitrary Values
uk: Побудова довільних значень

source: This function is the counterpart to :c:func:`PyArg_ParseTuple`. It is declared as follows::
uk: Ця функція є аналогом :c:func:`PyArg_ParseTuple`. Це оголошено наступним чином:

source: It recognizes a set of format units similar to the ones recognized by :c:func:`PyArg_ParseTuple`, but the arguments (which are input to the function, not output) must not be pointers, just values. It returns a new Python object, suitable for returning from a C function called from Python.
uk: Він розпізнає набір одиниць формату, подібних до тих, які розпізнає :c:func:`PyArg_ParseTuple`, але аргументи (які є вхідними для функції, а не виведеними) не повинні бути вказівниками, а просто значеннями. Він повертає новий об’єкт Python, придатний для повернення з функції C, викликаної з Python.

source: One difference with :c:func:`PyArg_ParseTuple`: while the latter requires its first argument to be a tuple (since Python argument lists are always represented as tuples internally), :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
uk: Одна відмінність із :c:func:`PyArg_ParseTuple`: у той час як останній вимагає, щоб його перший аргумент був кортежем (оскільки списки аргументів Python завжди представлені у вигляді кортежів), :c:func:`Py_BuildValue` не завжди створює кортеж . Він створює кортеж, лише якщо його рядок формату містить дві або більше одиниць формату. Якщо рядок формату порожній, повертається ``None``; якщо він містить рівно одну одиницю формату, він повертає будь-який об’єкт, описаний цією одиницею формату. Щоб змусити його повертати кортеж розміром 0 або одиницю, візьміть рядок формату в дужки.

source: Examples (to the left the call, to the right the resulting Python value):
uk: Приклади (ліворуч виклик, праворуч результуюче значення Python):

source: Reference Counts
uk: Довідкова кількість

source: In languages like C or C++, the programmer is responsible for dynamic allocation and deallocation of memory on the heap. In C, this is done using the functions :c:func:`malloc` and :c:func:`free`. In C++, the operators ``new`` and ``delete`` are used with essentially the same meaning and we'll restrict the following discussion to the C case.
uk: У таких мовах, як C або C++, програміст відповідає за динамічний розподіл і звільнення пам’яті в купі. У C це робиться за допомогою функцій :c:func:`malloc` і :c:func:`free`. У C++ оператори ``new`` і ``delete`` використовуються, по суті, з однаковим значенням, і ми обмежимо наступне обговорення випадком C.

source: Common causes of memory leaks are unusual paths through the code. For instance, a function may allocate a block of memory, do some calculation, and then free the block again. Now a change in the requirements for the function may add a test to the calculation that detects an error condition and can return prematurely from the function. It's easy to forget to free the allocated memory block when taking this premature exit, especially when it is added later to the code. Such leaks, once introduced, often go undetected for a long time: the error exit is taken only in a small fraction of all calls, and most modern machines have plenty of virtual memory, so the leak only becomes apparent in a long-running process that uses the leaking function frequently. Therefore, it's important to prevent leaks from happening by having a coding convention or strategy that minimizes this kind of errors.
uk: Поширеними причинами витоку пам'яті є незвичайні шляхи через код. Наприклад, функція може виділити блок пам'яті, виконати деякі обчислення, а потім знову звільнити блок. Тепер зміна вимог до функції може додати перевірку до обчислення, яка виявляє помилку та може передчасно повернутися з функції. Легко забути звільнити виділений блок пам’яті під час цього передчасного виходу, особливо коли він додається пізніше до коду. Такі витоки, щойно виникли, часто залишаються непоміченими протягом тривалого часу: вихід із помилкою відбувається лише в невеликій частині всіх викликів, а більшість сучасних машин мають багато віртуальної пам’яті, тому витік стає очевидним лише під час тривалого процесу який часто використовує функцію витоку. Тому важливо запобігти витокам, маючи угоду або стратегію кодування, яка мінімізує цей тип помилок.

source: Since Python makes heavy use of :c:func:`malloc` and :c:func:`free`, it needs a strategy to avoid memory leaks as well as the use of freed memory. The chosen method is called :dfn:`reference counting`. The principle is simple: every object contains a counter, which is incremented when a reference to the object is stored somewhere, and which is decremented when a reference to it is deleted. When the counter reaches zero, the last reference to the object has been deleted and the object is freed.
uk: Оскільки Python активно використовує :c:func:`malloc` і :c:func:`free`, йому потрібна стратегія, щоб уникнути витоку пам’яті, а також використання звільненої пам’яті. Обраний метод називається :dfn:`reference counting`. Принцип простий: кожен об’єкт містить лічильник, який збільшується, коли десь зберігається посилання на об’єкт, і зменшується, коли посилання на нього видаляється. Коли лічильник досягає нуля, останнє посилання на об’єкт було видалено, а об’єкт звільнено.

source: An alternative strategy is called :dfn:`automatic garbage collection`. (Sometimes, reference counting is also referred to as a garbage collection strategy, hence my use of "automatic" to distinguish the two.) The big advantage of automatic garbage collection is that the user doesn't need to call :c:func:`free` explicitly. (Another claimed advantage is an improvement in speed or memory usage --- this is no hard fact however.) The disadvantage is that for C, there is no truly portable automatic garbage collector, while reference counting can be implemented portably (as long as the functions :c:func:`malloc` and :c:func:`free` are available --- which the C Standard guarantees). Maybe some day a sufficiently portable automatic garbage collector will be available for C. Until then, we'll have to live with reference counts.
uk: Альтернативна стратегія називається :dfn:`автоматична збірка сміття <automatic garbage collection>`. (Іноді підрахунок посилань також називають стратегією збирання сміття, тому я використовую "автоматичний", щоб відрізнити ці два.) Великою перевагою автоматичного збирання сміття є те, що користувачеві не потрібно викликати :c:func:`free` явно. (Іншою заявленою перевагою є покращення швидкості або використання пам’яті --- однак це непереконливий факт.) Недоліком є те, що для C немає справді портативного автоматичного збирача сміття, тоді як підрахунок посилань можна реалізувати портативно (за умови, що функції :c:func:`malloc` і :c:func:`free` доступні --- що гарантує стандарт C). Можливо, колись достатньо портативний автоматичний збирач сміття буде доступний для C. До того часу нам доведеться жити з кількістю посилань.

source: While Python uses the traditional reference counting implementation, it also offers a cycle detector that works to detect reference cycles. This allows applications to not worry about creating direct or indirect circular references; these are the weakness of garbage collection implemented using only reference counting. Reference cycles consist of objects which contain (possibly indirect) references to themselves, so that each object in the cycle has a reference count which is non-zero. Typical reference counting implementations are not able to reclaim the memory belonging to any objects in a reference cycle, or referenced from the objects in the cycle, even though there are no further references to the cycle itself.
uk: Хоча Python використовує традиційну реалізацію підрахунку посилань, він також пропонує детектор циклів, який працює для виявлення опорних циклів. Це дозволяє програмам не турбуватися про створення прямих чи непрямих циклічних посилань; це слабкі місця збирання сміття, реалізованого лише за допомогою підрахунку посилань. Посилальні цикли складаються з об’єктів, які містять (можливо, непрямі) посилання на себе, так що кожен об’єкт у циклі має кількість посилань, відмінну від нуля. Типові реалізації підрахунку посилань не можуть відновити пам’ять, що належить до будь-яких об’єктів у циклі посилань, або на яку посилаються об’єкти в циклі, навіть якщо немає подальших посилань на сам цикл.

source: The cycle detector is able to detect garbage cycles and can reclaim them. The :mod:`gc` module exposes a way to run the detector (the :func:`~gc.collect` function), as well as configuration interfaces and the ability to disable the detector at runtime.
uk: Детектор циклів здатний виявляти цикли сміття та повертати їх. Модуль :mod:`gc` надає спосіб запуску детектора (функція :func:`~gc.collect`), а також інтерфейси налаштування та можливість вимкнути детектор під час виконання.

source: Reference Counting in Python
uk: Підрахунок посилань у Python

source: There are two macros, ``Py_INCREF(x)`` and ``Py_DECREF(x)``, which handle the incrementing and decrementing of the reference count. :c:func:`Py_DECREF` also frees the object when the count reaches zero. For flexibility, it doesn't call :c:func:`free` directly --- rather, it makes a call through a function pointer in the object's :dfn:`type object`. For this purpose (and others), every object also contains a pointer to its type object.
uk: Є два макроси, ``Py_INCREF(x)`` і ``Py_DECREF(x)``, які обробляють збільшення та зменшення лічильника посилань. :c:func:`Py_DECREF` також звільняє об’єкт, коли кількість досягає нуля. З міркувань гнучкості він не викликає :c:func:`free` напряму --- він робить виклик через вказівник на функцію в об’єкті :dfn:`type object`. Для цієї мети (та інших) кожен об’єкт також містить покажчик на об’єкт свого типу.

source: The big question now remains: when to use ``Py_INCREF(x)`` and ``Py_DECREF(x)``? Let's first introduce some terms. Nobody "owns" an object; however, you can :dfn:`own a reference` to an object. An object's reference count is now defined as the number of owned references to it. The owner of a reference is responsible for calling :c:func:`Py_DECREF` when the reference is no longer needed. Ownership of a reference can be transferred. There are three ways to dispose of an owned reference: pass it on, store it, or call :c:func:`Py_DECREF`. Forgetting to dispose of an owned reference creates a memory leak.
uk: Тепер залишається велике питання: коли використовувати ``Py_INCREF(x)`` і ``Py_DECREF(x)``? Давайте спочатку введемо деякі терміни. Ніхто не "володіє" об'єктом; проте ви можете :dfn:`володіти посиланням <own a reference>` на об'єкт. Кількість посилань на об’єкт тепер визначається як кількість належних посилань на нього. Власник посилання відповідає за виклик :c:func:`Py_DECREF`, коли посилання більше не потрібне. Право власності на посилання можна передати. Є три способи позбутися посилання, яке належить: передати, зберегти або викликати :c:func:`Py_DECREF`. Якщо забути позбутися посилання, що належить, це призводить до витоку пам’яті.

source: It is also possible to :dfn:`borrow` [#]_ a reference to an object. The borrower of a reference should not call :c:func:`Py_DECREF`. The borrower must not hold on to the object longer than the owner from which it was borrowed. Using a borrowed reference after the owner has disposed of it risks using freed memory and should be avoided completely [#]_.
uk: Також можна :dfn:`borrow` [#]_ посилання на об’єкт. Позичальник посилання не повинен викликати :c:func:`Py_DECREF`. Позичальник не повинен утримувати річ довше, ніж власник, у якого вона була позичена. Використання запозиченого посилання після того, як власник позбувся його, ризикує використати звільнену пам’ять, і його слід повністю уникати [#]_.
