Repository: python/python-docs-uk
Catalog: extending/extending.po
Languages: uk

source: The advantage of borrowing over owning a reference is that you don't need to take care of disposing of the reference on all possible paths through the code --- in other words, with a borrowed reference you don't run the risk of leaking when a premature exit is taken. The disadvantage of borrowing over owning is that there are some subtle situations where in seemingly correct code a borrowed reference can be used after the owner from which it was borrowed has in fact disposed of it.
uk: Перевага запозичення перед володінням посиланням полягає в тому, що вам не потрібно піклуватися про утилізацію посилання на всіх можливих шляхах через код --- іншими словами, з запозиченим посиланням ви не ризикуєте витоком коли зроблено передчасний вихід. Недоліком запозичення перед володінням є те, що існують деякі тонкі ситуації, коли в, здавалося б, правильному коді запозичене посилання може бути використано після того, як власник, у якого воно було запозичено, фактично позбувся його.

source: A borrowed reference can be changed into an owned reference by calling :c:func:`Py_INCREF`. This does not affect the status of the owner from which the reference was borrowed --- it creates a new owned reference, and gives full owner responsibilities (the new owner must dispose of the reference properly, as well as the previous owner).
uk: Позичене посилання можна змінити на власне, викликавши :c:func:`Py_INCREF`. Це не впливає на статус власника, у якого було запозичено посилання --- створюється нове посилання, яке належить, і надається повна відповідальність власника (новий власник повинен правильно розпоряджатися посиланням, як і попередній власник).

source: Ownership Rules
uk: Правила власності

source: Whenever an object reference is passed into or out of a function, it is part of the function's interface specification whether ownership is transferred with the reference or not.
uk: Кожного разу, коли посилання на об’єкт передається у функцію або з неї, воно є частиною специфікації інтерфейсу функції незалежно від того, передається право власності з посиланням чи ні.

source: Most functions that return a reference to an object pass on ownership with the reference. In particular, all functions whose function it is to create a new object, such as :c:func:`PyLong_FromLong` and :c:func:`Py_BuildValue`, pass ownership to the receiver. Even if the object is not actually new, you still receive ownership of a new reference to that object. For instance, :c:func:`PyLong_FromLong` maintains a cache of popular values and can return a reference to a cached item.
uk: Більшість функцій, які повертають посилання на об’єкт, передають право власності разом із посиланням. Зокрема, усі функції, функцією яких є створення нового об’єкта, такі як :c:func:`PyLong_FromLong` і :c:func:`Py_BuildValue`, передають право власності одержувачу. Навіть якщо об’єкт насправді не новий, ви все одно отримуєте право власності на нове посилання на цей об’єкт. Наприклад, :c:func:`PyLong_FromLong` підтримує кеш популярних значень і може повертати посилання на кешований елемент.

source: Many functions that extract objects from other objects also transfer ownership with the reference, for instance :c:func:`PyObject_GetAttrString`. The picture is less clear, here, however, since a few common routines are exceptions: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem`, and :c:func:`PyDict_GetItemString` all return references that you borrow from the tuple, list or dictionary.
uk: Багато функцій, які витягують об’єкти з інших об’єктів, також передають право власності разом із посиланням, наприклад :c:func:`PyObject_GetAttrString`. Однак тут картина менш зрозуміла, оскільки кілька типових процедур є винятками: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem` і :c:func:`PyDict_GetItemString` повертає всі посилання, які ви запозичили з кортежу, списку або словника.

source: The function :c:func:`PyImport_AddModule` also returns a borrowed reference, even though it may actually create the object it returns: this is possible because an owned reference to the object is stored in ``sys.modules``.
uk: Функція :c:func:`PyImport_AddModule` також повертає запозичене посилання, навіть якщо вона може фактично створити об’єкт, який повертає: це можливо, оскільки власне посилання на об’єкт зберігається в ``sys.modules``.

source: When you pass an object reference into another function, in general, the function borrows the reference from you --- if it needs to store it, it will use :c:func:`Py_INCREF` to become an independent owner. There are exactly two important exceptions to this rule: :c:func:`PyTuple_SetItem` and :c:func:`PyList_SetItem`. These functions take over ownership of the item passed to them --- even if they fail! (Note that :c:func:`PyDict_SetItem` and friends don't take over ownership --- they are "normal.")
uk: Коли ви передаєте посилання на об’єкт в іншу функцію, функція, як правило, запозичує посилання у вас --- якщо їй потрібно її зберегти, вона використовуватиме :c:func:`Py_INCREF`, щоб стати незалежним власником. З цього правила є два важливих винятки: :c:func:`PyTuple_SetItem` і :c:func:`PyList_SetItem`. Ці функції беруть на себе право власності на переданий їм елемент --- навіть якщо вони виходять з ладу! (Зауважте, що :c:func:`PyDict_SetItem` і друзі не беруть на себе право власності --- вони "нормальні".)

source: When a C function is called from Python, it borrows references to its arguments from the caller. The caller owns a reference to the object, so the borrowed reference's lifetime is guaranteed until the function returns. Only when such a borrowed reference must be stored or passed on, it must be turned into an owned reference by calling :c:func:`Py_INCREF`.
uk: Коли функція C викликається з Python, вона запозичує посилання на свої аргументи від викликаючого. Виклик володіє посиланням на об’єкт, тому час життя позиченого посилання гарантується до повернення функції. Лише тоді, коли таке запозичене посилання потрібно зберегти або передати, його потрібно перетворити на власне посилання шляхом виклику :c:func:`Py_INCREF`.

source: The object reference returned from a C function that is called from Python must be an owned reference --- ownership is transferred from the function to its caller.
uk: Посилання на об’єкт, що повертається функцією C, яка викликається з Python, має бути посиланням у власності --- право власності передається від функції до її викликаючого.

source: Thin Ice
uk: Тонкий лід

source: There are a few situations where seemingly harmless use of a borrowed reference can lead to problems. These all have to do with implicit invocations of the interpreter, which can cause the owner of a reference to dispose of it.
uk: Є кілька ситуацій, коли, здавалося б, нешкідливе використання запозиченого посилання може призвести до проблем. Усе це пов’язано з неявними викликами інтерпретатора, які можуть змусити власника посилання позбутися його.

source: The first and most important case to know about is using :c:func:`Py_DECREF` on an unrelated object while borrowing a reference to a list item. For instance::
uk: Перший і найважливіший випадок, про який варто знати, це використання :c:func:`Py_DECREF` для непов’язаного об’єкта під час запозичення посилання на елемент списку. Наприклад::

source: This function first borrows a reference to ``list[0]``, then replaces ``list[1]`` with the value ``0``, and finally prints the borrowed reference. Looks harmless, right? But it's not!
uk: Ця функція спочатку запозичує посилання на ``list[0]``, потім замінює ``list[1]`` на значення ``0`` і, нарешті, друкує запозичене посилання. Виглядає нешкідливо, правда? Але це не так!

source: The solution, once you know the source of the problem, is easy: temporarily increment the reference count. The correct version of the function reads::
uk: Якщо ви дізнаєтеся про джерело проблеми, вирішити її легко: тимчасово збільште кількість посилань. Правильна версія функції виглядає так:

source: The second case of problems with a borrowed reference is a variant involving threads. Normally, multiple threads in the Python interpreter can't get in each other's way, because there is a global lock protecting Python's entire object space. However, it is possible to temporarily release this lock using the macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, and to re-acquire it using :c:macro:`Py_END_ALLOW_THREADS`. This is common around blocking I/O calls, to let other threads use the processor while waiting for the I/O to complete. Obviously, the following function has the same problem as the previous one::
uk: Другий випадок проблем із запозиченим посиланням – це варіант із залученням потоків. Зазвичай кілька потоків в інтерпретаторі Python не можуть перешкоджати один одному, оскільки існує глобальне блокування, яке захищає весь простір об’єктів Python. Однак можна тимчасово зняти це блокування за допомогою макросу :c:macro:`Py_BEGIN_ALLOW_THREADS` і повторно отримати його за допомогою :c:macro:`Py_END_ALLOW_THREADS`. Це часто зустрічається під час блокування викликів введення-виведення, щоб дозволити іншим потокам використовувати процесор під час очікування завершення введення-виведення. Очевидно, що наступна функція має ту саму проблему, що й попередня:

source: NULL Pointers
uk: NULL покажчики

source: In general, functions that take object references as arguments do not expect you to pass them ``NULL`` pointers, and will dump core (or cause later core dumps) if you do so. Functions that return object references generally return ``NULL`` only to indicate that an exception occurred. The reason for not testing for ``NULL`` arguments is that functions often pass the objects they receive on to other function --- if each function were to test for ``NULL``, there would be a lot of redundant tests and the code would run more slowly.
uk: Загалом, функції, які приймають посилання на об’єкти як аргументи, не очікують, що ви передасте їм покажчики ``NULL``, і, якщо ви це зробите, створять дамп ядра (або викликатимуть дамп ядра пізніше). Функції, які повертають посилання на об’єкт, зазвичай повертають ``NULL`` лише для того, щоб вказати, що стався виняток. Причина не перевіряти аргументи ``NULL`` полягає в тому, що функції часто передають отримані об’єкти іншій функції --- якби кожна функція перевіряла ``NULL``, було б багато зайвих перевірок і код працюватиме повільніше.

source: It is better to test for ``NULL`` only at the "source:" when a pointer that may be ``NULL`` is received, for example, from :c:func:`malloc` or from a function that may raise an exception.
uk: Краще перевіряти ``NULL`` лише на "джерело:", коли вказівник, який може бути ``NULL`` отримано, наприклад, від :c:func:`malloc` або від функції, яка може створити виняток.

source: The macros :c:func:`Py_INCREF` and :c:func:`Py_DECREF` do not check for ``NULL`` pointers --- however, their variants :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` do.
uk: Макроси :c:func:`Py_INCREF` і :c:func:`Py_DECREF` не перевіряють покажчики ``NULL`` --- однак їх варіанти :c:func:`Py_XINCREF` і :c:func:`Py_XDECREF` робити.

source: The macros for checking for a particular object type (``Pytype_Check()``) don't check for ``NULL`` pointers --- again, there is much code that calls several of these in a row to test an object against various different expected types, and this would generate redundant tests. There are no variants with ``NULL`` checking.
uk: Макроси для перевірки певного типу об’єкта (``Pytype_Check()``) не перевіряють покажчики ``NULL`` --- знову ж таки, є багато коду, який викликає кілька з них поспіль для перевірки об’єкта проти різних очікуваних типів, і це створить надлишкові тести. Варіантів із перевіркою ``NULL`` немає.

source: The C function calling mechanism guarantees that the argument list passed to C functions (``args`` in the examples) is never ``NULL`` --- in fact it guarantees that it is always a tuple [#]_.
uk: Механізм виклику функції C гарантує, що список аргументів, переданий функціям C (``args`` у прикладах), ніколи не буде ``NULL`` --- фактично він гарантує, що це завжди кортеж [#]_.

source: It is a severe error to ever let a ``NULL`` pointer "escape" to the Python user.
uk: Дозволити вказівнику ``NULL`` "вийти" користувачеві Python є серйозною помилкою.

source: Writing Extensions in C++
uk: Написання розширень на C++

source: It is possible to write extension modules in C++. Some restrictions apply. If the main program (the Python interpreter) is compiled and linked by the C compiler, global or static objects with constructors cannot be used. This is not a problem if the main program is linked by the C++ compiler. Functions that will be called by the Python interpreter (in particular, module initialization functions) have to be declared using ``extern "C"``. It is unnecessary to enclose the Python header files in ``extern "C" {...}`` --- they use this form already if the symbol ``__cplusplus`` is defined (all recent C++ compilers define this symbol).
uk: На C++ можна писати модулі розширення. Застосовуються деякі обмеження. Якщо основна програма (інтерпретатор Python) скомпільована та зв’язана компілятором C, глобальні чи статичні об’єкти з конструкторами використовувати не можна. Це не проблема, якщо основна програма зв’язана компілятором C++. Функції, які буде викликатися інтерпретатором Python (зокрема, функції ініціалізації модуля), мають бути оголошені за допомогою ``extern "C"``. Немає необхідності вкладати файли заголовків Python у ``extern "C" {...}`` --- вони вже використовують цю форму, якщо визначено символ ``__cplusplus`` (усі останні компілятори C++ визначають цей символ) .

source: Providing a C API for an Extension Module
uk: Надання C API для модуля розширення

source: Many extension modules just provide new functions and types to be used from Python, but sometimes the code in an extension module can be useful for other extension modules. For example, an extension module could implement a type "collection" which works like lists without order. Just like the standard Python list type has a C API which permits extension modules to create and manipulate lists, this new collection type should have a set of C functions for direct manipulation from other extension modules.
uk: Багато модулів розширення просто надають нові функції та типи для використання з Python, але іноді код у модулі розширення може бути корисним для інших модулів розширення. Наприклад, модуль розширення може реалізувати тип "колекція", який працює як списки без порядку. Подібно до того, як стандартний тип списку Python має C API, який дозволяє модулям розширення створювати списки та маніпулювати ними, цей новий тип колекції повинен мати набір функцій C для прямого маніпулювання з інших модулів розширення.

source: At first sight this seems easy: just write the functions (without declaring them ``static``, of course), provide an appropriate header file, and document the C API. And in fact this would work if all extension modules were always linked statically with the Python interpreter. When modules are used as shared libraries, however, the symbols defined in one module may not be visible to another module. The details of visibility depend on the operating system; some systems use one global namespace for the Python interpreter and all extension modules (Windows, for example), whereas others require an explicit list of imported symbols at module link time (AIX is one example), or offer a choice of different strategies (most Unices). And even if symbols are globally visible, the module whose functions one wishes to call might not have been loaded yet!
uk: На перший погляд це здається легким: просто напишіть функції (звичайно, не оголошуючи їх "статичними"), надайте відповідний файл заголовка та задокументуйте C API. І насправді це працювало б, якби всі модулі розширення завжди були статично пов’язані з інтерпретатором Python. Проте коли модулі використовуються як спільні бібліотеки, символи, визначені в одному модулі, можуть бути невидимими для іншого модуля. Деталі видимості залежать від операційної системи; деякі системи використовують один глобальний простір імен для інтерпретатора Python і всіх модулів розширення (наприклад, Windows), тоді як інші вимагають явного списку імпортованих символів під час зв’язування модуля (прикладом є AIX) або пропонують вибір різних стратегій (більшість Unices). І навіть якщо символи видимі глобально, модуль, функції якого потрібно викликати, можливо, ще не завантажено!

source: Portability therefore requires not to make any assumptions about symbol visibility. This means that all symbols in extension modules should be declared ``static``, except for the module's initialization function, in order to avoid name clashes with other extension modules (as discussed in section :ref:`methodtable`). And it means that symbols that *should* be accessible from other extension modules must be exported in a different way.
uk: Тому портативність вимагає не робити жодних припущень щодо видимості символу. Це означає, що всі символи в модулях розширення мають бути оголошені ``статичними``, за винятком функції ініціалізації модуля, щоб уникнути зіткнення імен з іншими модулями розширення (як описано в розділі :ref:`methodtable`). І це означає, що символи, які *мають* бути доступні з інших модулів розширення, повинні бути експортовані в інший спосіб.

source: There are many ways in which Capsules can be used to export the C API of an extension module. Each function could get its own Capsule, or all C API pointers could be stored in an array whose address is published in a Capsule. And the various tasks of storing and retrieving the pointers can be distributed in different ways between the module providing the code and the client modules.
uk: Є багато способів використання Capsules для експорту C API модуля розширення. Кожна функція може отримати власну капсулу, або всі покажчики C API можуть зберігатися в масиві, адреса якого опублікована в капсулі. Різні завдання зі зберігання та отримання покажчиків можуть бути розподілені різними способами між модулем, що надає код, і клієнтськими модулями.

source: In particular, Capsules used to expose C APIs should be given a name following this convention::
uk: Зокрема, капсулам, які використовуються для розкриття C API, слід присвоїти назву відповідно до цієї угоди:

source: The convenience function :c:func:`PyCapsule_Import` makes it easy to load a C API provided via a Capsule, but only if the Capsule's name matches this convention. This behavior gives C API users a high degree of certainty that the Capsule they load contains the correct C API.
uk: Зручна функція :c:func:`PyCapsule_Import` спрощує завантаження C API, що надається через Capsule, але лише якщо назва Capsule відповідає цій умові. Така поведінка дає користувачам C API високий ступінь впевненості, що капсула, яку вони завантажують, містить правильний C API.

source: In the beginning of the module, right after the line ::
uk: На початку модуля, відразу після рядка ::

source: two more lines must be added::
uk: потрібно додати ще два рядки::

source: The ``#define`` is used to tell the header file that it is being included in the exporting module, not a client module. Finally, the module's initialization function must take care of initializing the C API pointer array::
uk: ``#define`` використовується, щоб повідомити файлу заголовка, що його включено до модуля експорту, а не клієнтського модуля. Нарешті, функція ініціалізації модуля повинна подбати про ініціалізацію масиву покажчиків C API::

source: The bulk of the work is in the header file :file:`spammodule.h`, which looks like this::
uk: Основна частина роботи знаходиться у файлі заголовка :file:`spammodule.h`, який виглядає так:

source: The main disadvantage of this approach is that the file :file:`spammodule.h` is rather complicated. However, the basic structure is the same for each function that is exported, so it has to be learned only once.
uk: Основним недоліком цього підходу є те, що файл :file:`spammodule.h` досить складний. Однак базова структура однакова для кожної функції, яка експортується, тому її потрібно вивчати лише один раз.

source: Finally it should be mentioned that Capsules offer additional functionality, which is especially useful for memory allocation and deallocation of the pointer stored in a Capsule. The details are described in the Python/C API Reference Manual in the section :ref:`capsules` and in the implementation of Capsules (files :file:`Include/pycapsule.h` and :file:`Objects/pycapsule.c` in the Python source code distribution).
uk: Насамкінець слід зазначити, що капсули пропонують додаткову функціональність, яка особливо корисна для виділення пам’яті та зняття вказівника, що зберігається в капсулі. Подробиці описано в довідковому посібнику Python/C API у розділі :ref:`capsules` і в реалізації капсул (файли :file:`Include/pycapsule.h` і :file:`Objects/pycapsule.c` у дистрибутиві вихідного коду Python).

source: Footnotes
uk: Виноски

source: An interface for this function already exists in the standard module :mod:`os` --- it was chosen as a simple and straightforward example.
uk: Інтерфейс для цієї функції вже існує в стандартному модулі :mod:`os` --- він був обраний як простий і зрозумілий приклад.

source: The metaphor of "borrowing" a reference is not completely correct: the owner still has a copy of the reference.
uk: Метафора "позичити" довідку не зовсім коректна: власник досі має копію довідки.

source: Checking that the reference count is at least 1 **does not work** --- the reference count itself could be in freed memory and may thus be reused for another object!
uk: Перевірка того, що кількість посилань дорівнює принаймні 1, **не працює** --- сама кількість посилань може бути у звільненій пам’яті та, таким чином, може бути повторно використана для іншого об’єкта!

source: These guarantees don't hold when you use the "old" style calling convention --- this is still found in much existing code.
uk: Ці гарантії не діють, якщо ви використовуєте "старий" стиль викликів --- він все ще міститься в більшості існуючих кодів.
