Repository: python/python-docs-uk
Catalog: extending/index.po
Languages: uk

source: Extending and Embedding the Python Interpreter
uk: Розширення та вбудовування інтерпретатора Python

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can not only define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
uk: У цьому документі описано, як писати модулі на C або C++, щоб розширити інтерпретатор Python новими модулями. Ці модулі можуть не лише визначати нові функції, але й нові типи об’єктів та їхні методи. У документі також описано, як вбудувати інтерпретатор Python в іншу програму для використання як мови розширення. Нарешті, показано, як компілювати та зв’язувати модулі розширення, щоб їх можна було динамічно завантажувати (під час виконання) в інтерпретатор, якщо базова операційна система підтримує цю функцію.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
uk: Цей документ передбачає базові знання про Python. Для неформального ознайомлення з мовою див. :ref:`tutorial-index`. :ref:`reference-index` дає більш формальне визначення мови. :ref:`library-index` документує існуючі типи об’єктів, функції та модулі (як вбудовані, так і написані на Python), які надають мові широкий спектр застосування.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
uk: Для детального опису всього API Python/C перегляньте окремий :ref:`c-api-index`.

source: Recommended third party tools
uk: Рекомендовані сторонні інструменти

source: This guide only covers the basic tools for creating extensions provided as part of this version of CPython. Third party tools like `Cython <http://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <http://www.swig.org>`_ and `Numba <https://numba.pydata.org/>`_ offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
uk: Цей посібник охоплює лише основні інструменти для створення розширень, які надаються як частина цієї версії CPython. Інструменти сторонніх розробників, як-от `Cython <http://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <http://www.swig.org>`_ і `Numba <https://numba.pydata.org/>`_ пропонують як простіші, так і складніші підходи до створення розширень C і C++ для Python

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
uk: `Посібник користувача з упаковки Python: двійкові розширення <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
uk: Посібник користувача з упакування Python не лише охоплює кілька доступних інструментів, які спрощують створення бінарних розширень, але й обговорює різні причини, чому створення модуля розширення може бути бажаним у першу чергу.

source: Creating extensions without third party tools
uk: Створення розширень без сторонніх інструментів

source: This section of the guide covers creating C and C++ extensions without assistance from third party tools. It is intended primarily for creators of those tools, rather than being a recommended way to create your own C extensions.
uk: У цьому розділі посібника описано створення розширень C і C++ без допомоги сторонніх інструментів. Він призначений насамперед для розробників цих інструментів, а не як рекомендований спосіб створення власних розширень C.

source: Embedding the CPython runtime in a larger application
uk: Вбудовування середовища виконання CPython у більшу програму

source: Sometimes, rather than creating an extension that runs inside the Python interpreter as the main application, it is desirable to instead embed the CPython runtime inside a larger application. This section covers some of the details involved in doing that successfully.
uk: Іноді замість створення розширення, яке працює в інтерпретаторі Python як основної програми, бажано замість цього вбудувати середовище виконання CPython у більшу програму. У цьому розділі описано деякі деталі, необхідні для успішного виконання цього завдання.
