Repository: python/python-docs-uk
Catalog: reference/compound_stmts.po
Languages: uk

source: With more than one item, the context managers are processed as if multiple :keyword:`with` statements were nested::
uk: З більш ніж одним елементом менеджери контексту обробляються так, ніби кілька операторів :keyword:`with` були вкладеними::

source: You can also write multi-item context managers in multiple lines if the items are surrounded by parentheses. For example::
uk: Ви також можете писати багатоелементні контекстні менеджери в кілька рядків, якщо елементи оточені дужками. Наприклад::

source: Support for multiple context expressions.
uk: Підтримка кількох контекстних виразів.

source: Support for using grouping parentheses to break the statement in multiple lines.
uk: Підтримка використання групування дужок для розбиття оператора на кілька рядків.

source: :pep:`343` - The "with" statement
uk: :pep:`343` - оператор "з".

source: The specification, background, and examples for the Python :keyword:`with` statement.
uk: Специфікація, передумови та приклади оператора Python :keyword:`with`.

source: The :keyword:`!match` statement
uk: Оператор :keyword:`!match`

source: The match statement is used for pattern matching. Syntax:
uk: Оператор match використовується для зіставлення шаблону. Синтаксис:

source: This section uses single quotes to denote :ref:`soft keywords <soft-keywords>`.
uk: У цьому розділі використовуються одинарні лапки для позначення :ref:`м’яких ключових слів <soft-keywords>`.

source: Pattern matching takes a pattern as input (following ``case``) and a subject value (following ``match``). The pattern (which may contain subpatterns) is matched against the subject value. The outcomes are:
uk: Зіставлення шаблону приймає шаблон як вхідні дані (після ``case``) і значення теми (після ``match``). Шаблон (який може містити підшаблони) зіставляється зі значенням теми. Результати:

source: A match success or failure (also termed a pattern success or failure).
uk: Успіх або невдача збігу (також називається успішним або невдалим шаблоном).

source: Possible binding of matched values to a name. The prerequisites for this are further discussed below.
uk: Можливе прив’язування відповідних значень до імені. Передумови для цього обговорюються нижче.

source: The ``match`` and ``case`` keywords are :ref:`soft keywords <soft-keywords>`.
uk: Ключові слова ``match`` і ``case`` є :ref:`м'якими ключовими словами <soft-keywords>`.

source: :pep:`634` -- Structural Pattern Matching: Specification
uk: :pep:`634` -- Зіставлення структурних шаблонів: Специфікація

source: :pep:`636` -- Structural Pattern Matching: Tutorial
uk: :pep:`636` -- Зіставлення структурних шаблонів: підручник

source: Overview
uk: Огляд

source: Here's an overview of the logical flow of a match statement:
uk: Ось огляд логічної послідовності оператора збігу:

source: The subject expression ``subject_expr`` is evaluated and a resulting subject value obtained. If the subject expression contains a comma, a tuple is constructed using :ref:`the standard rules <typesseq-tuple>`.
uk: Вираз суб’єкта ``subject_expr`` обчислюється та отримується результуюче значення предмета. Якщо вираз теми містить кому, кортеж створюється за допомогою :ref:`стандартних правил <typesseq-tuple>`.

source: Each pattern in a ``case_block`` is attempted to match with the subject value. The specific rules for success or failure are described below. The match attempt can also bind some or all of the standalone names within the pattern. The precise pattern binding rules vary per pattern type and are specified below. **Name bindings made during a successful pattern match outlive the executed block and can be used after the match statement**.
uk: Кожен шаблон у ``case_block`` намагається зіставити зі значенням теми. Конкретні правила успіху чи невдачі описані нижче. Спроба збігу також може пов’язати деякі або всі окремі імена в шаблоні. Точні правила зв’язування шаблону залежать від типу шаблону та вказані нижче. **Прив’язки імен, зроблені під час успішного збігу шаблону, переживають виконаний блок і можуть використовуватися після оператора збігу**.

source: During failed pattern matches, some subpatterns may succeed. Do not rely on bindings being made for a failed match. Conversely, do not rely on variables remaining unchanged after a failed match. The exact behavior is dependent on implementation and may vary. This is an intentional decision made to allow different implementations to add optimizations.
uk: Під час невдалих збігів шаблонів деякі підшаблони можуть бути успішними. Не покладайтеся на прив’язки, зроблені для невдалого матчу. І навпаки, не покладайтеся на те, що змінні залишаться незмінними після невдалого збігу. Точна поведінка залежить від реалізації та може відрізнятися. Це навмисне рішення, яке дозволяє оптимізувати різні реалізації.

source: If the pattern succeeds, the corresponding guard (if present) is evaluated. In this case all name bindings are guaranteed to have happened.
uk: Якщо шаблон успішний, відповідний охоронець (якщо присутній) оцінюється. У цьому випадку всі прив’язки імен гарантовано відбулися.

source: If the guard evaluates as true or is missing, the ``block`` inside ``case_block`` is executed.
uk: Якщо guard оцінює як true або відсутній, виконується ``block`` всередині ``case_block``.

source: Otherwise, the next ``case_block`` is attempted as described above.
uk: Інакше виконується спроба наступного ``case_block``, як описано вище.

source: If there are no further case blocks, the match statement is completed.
uk: Якщо немає інших блоків регістру, оператор збігу завершується.

source: Users should generally never rely on a pattern being evaluated. Depending on implementation, the interpreter may cache values or use other optimizations which skip repeated evaluations.
uk: Зазвичай користувачі ніколи не повинні покладатися на шаблон, що оцінюється. Залежно від реалізації, інтерпретатор може кешувати значення або використовувати інші оптимізації, які пропускають повторні оцінки.

source: A sample match statement::
uk: Зразок заяви про відповідність::

source: In this case, ``if flag`` is a guard. Read more about that in the next section.
uk: У цьому випадку ``if flag`` є охороною. Докладніше про це читайте в наступному розділі.

source: Guards
uk: Охоронці

source: A ``guard`` (which is part of the ``case``) must succeed for code inside the ``case`` block to execute. It takes the form: :keyword:`if` followed by an expression.
uk: ``guard`` (який є частиною ``case``) має бути успішним для виконання коду всередині блоку ``case``. Він приймає форму: :keyword:`if`, після якого йде вираз.

source: The logical flow of a ``case`` block with a ``guard`` follows:
uk: Логічний послідовність блоку ``case`` з ``guard`` наступна:

source: Check that the pattern in the ``case`` block succeeded. If the pattern failed, the ``guard`` is not evaluated and the next ``case`` block is checked.
uk: Переконайтеся, що шаблон у блоці ``case`` виконано успішно. Якщо шаблон не вдається, ``guard`` не оцінюється, і перевіряється наступний ``case`` блок.

source: If the pattern succeeded, evaluate the ``guard``.
uk: Якщо шаблон вдався, оцініть ``guard``.

source: If the ``guard`` condition evaluates as true, the case block is selected.
uk: Якщо умова ``guard`` оцінюється як істинна, вибирається блок регістру.

source: If the ``guard`` condition evaluates as false, the case block is not selected.
uk: Якщо умова ``guard`` оцінюється як false, блок регістру не вибрано.

source: If the ``guard`` raises an exception during evaluation, the exception bubbles up.
uk: Якщо ``охоронець`` викликає виняток під час оцінки, виняток з'являється.

source: Guards are allowed to have side effects as they are expressions. Guard evaluation must proceed from the first to the last case block, one at a time, skipping case blocks whose pattern(s) don't all succeed. (I.e., guard evaluation must happen in order.) Guard evaluation must stop once a case block is selected.
uk: Охоронцям дозволено мати побічні ефекти, оскільки вони є виразами. Оцінка Guard повинна проходити від першого до останнього блоку регістрів, по одному, пропускаючи блоки регістрів, шаблон(и) яких не всі є успішними. (Тобто оцінка охорони має відбуватися в порядку.) Оцінка охорони має припинитися, коли вибрано блок справи.

source: Irrefutable Case Blocks
uk: Незаперечні блоки випадків

source: An irrefutable case block is a match-all case block. A match statement may have at most one irrefutable case block, and it must be last.
uk: Незаперечний блок регістрів — це блок регістрів, що відповідає всім регістрам. Інструкція збігу може мати щонайбільше один неспростовний блок регістру, і він має бути останнім.

source: A case block is considered irrefutable if it has no guard and its pattern is irrefutable. A pattern is considered irrefutable if we can prove from its syntax alone that it will always succeed. Only the following patterns are irrefutable:
uk: Блок футляра вважається незаперечним, якщо він не має захисного елемента і його візерунок є неспростовним. Патерн вважається неспростовним, якщо ми можемо довести лише з його синтаксису, що він завжди матиме успіх. Незаперечними є лише такі закономірності:

source: :ref:`as-patterns` whose left-hand side is irrefutable
uk: :ref:`as-patterns`, ліва сторона якого неспростовна

source: :ref:`or-patterns` containing at least one irrefutable pattern
uk: :ref:`or-patterns`, що містить принаймні один неспростовний шаблон

source: parenthesized irrefutable patterns
uk: в дужках неспростовні закономірності

source: Patterns
uk: Візерунки

source: This section uses grammar notations beyond standard EBNF:
uk: У цьому розділі використовуються граматичні нотації поза стандартними EBNF:

source: the notation ``SEP.RULE+`` is shorthand for ``RULE (SEP RULE)*``
uk: позначення ``SEP.RULE+`` є скороченням для ``RULE (SEP RULE)*``

source: the notation ``!RULE`` is shorthand for a negative lookahead assertion
uk: нотація ``!RULE`` є скороченням для негативного твердження попереднього перегляду

source: The top-level syntax for ``patterns`` is:
uk: Синтаксис верхнього рівня для ``патернів`` такий:

source: The descriptions below will include a description "in simple terms" of what a pattern does for illustration purposes (credits to Raymond Hettinger for a document that inspired most of the descriptions). Note that these descriptions are purely for illustration purposes and **may not** reflect the underlying implementation. Furthermore, they do not cover all valid forms.
uk: Наведені нижче описи включатимуть опис "у простих термінах" того, що робить шаблон для цілей ілюстрації (заслуга Реймонда Геттінгера за документ, який надихнув більшість описів). Зауважте, що ці описи наведено лише для ілюстрації та **можуть** не відображати базову реалізацію. Крім того, вони не охоплюють усіх дійсних форм.

source: OR Patterns
uk: АБО Шаблони

source: An OR pattern is two or more patterns separated by vertical bars ``|``. Syntax:
uk: Шаблон АБО — це два або більше шаблонів, розділених вертикальними рисками ``|``. Синтаксис:

source: Only the final subpattern may be :ref:`irrefutable <irrefutable_case>`, and each subpattern must bind the same set of names to avoid ambiguity.
uk: Лише остаточний підшаблон може бути :ref:`irrefutable <irrefutable_case>`, і кожен підшаблон повинен пов’язувати однаковий набір імен, щоб уникнути двозначності.

source: An OR pattern matches each of its subpatterns in turn to the subject value, until one succeeds. The OR pattern is then considered successful. Otherwise, if none of the subpatterns succeed, the OR pattern fails.
uk: Шаблон АБО зіставляє кожен зі своїх підшаблонів по черзі зі значенням суб’єкта, поки один не досягне успіху. Потім шаблон АБО вважається успішним. В іншому випадку, якщо жоден із підшаблонів не вдасться, шаблон АБО буде невдалим.

source: In simple terms, ``P1 | P2 | ...`` will try to match ``P1``, if it fails it will try to match ``P2``, succeeding immediately if any succeeds, failing otherwise.
uk: Простіше кажучи, ``P1 | P2 | ...`` намагатиметься знайти відповідність ``P1``, якщо це не вдасться, вона спробує знайти ``P2``, успішно негайно, якщо будь-який з них вдасться, інакше не вдасться.

source: An AS pattern matches an OR pattern on the left of the :keyword:`as` keyword against a subject. Syntax:
uk: Шаблон AS відповідає шаблону АБО ліворуч від ключового слова :keyword:`as` щодо теми. Синтаксис:

source: If the OR pattern fails, the AS pattern fails. Otherwise, the AS pattern binds the subject to the name on the right of the as keyword and succeeds. ``capture_pattern`` cannot be a a ``_``.
uk: Якщо шаблон АБО не працює, шаблон AS не працює. В іншому випадку шаблон AS прив’язує тему до імені праворуч від ключового слова as і виконується успішно. ``capture_pattern`` не може бути ``_``.

source: In simple terms ``P as NAME`` will match with ``P``, and on success it will set ``NAME = <subject>``.
uk: Простіше кажучи, ``P as NAME`` співпадатиме з ``P``, і в разі успіху буде встановлено ``NAME = <subject>``.

source: Literal Patterns
uk: Літеральні візерунки

source: A literal pattern corresponds to most :ref:`literals <literals>` in Python. Syntax:
uk: Шаблон літералів відповідає більшості :ref:`літералів <literals>` у Python. Синтаксис:

source: The rule ``strings`` and the token ``NUMBER`` are defined in the :doc:`standard Python grammar <./grammar>`. Triple-quoted strings are supported. Raw strings and byte strings are supported. :ref:`f-strings` are not supported.
uk: Правило ``рядки`` і токен ``ЧИСЛО`` визначено в :doc:`стандартній граматиці Python <./grammar>`. Підтримуються рядки в потрійних лапках. Підтримуються необроблені рядки та рядки байтів. :ref:`f-strings` не підтримуються.

source: The forms ``signed_number '+' NUMBER`` and ``signed_number '-' NUMBER`` are for expressing :ref:`complex numbers <imaginary>`; they require a real number on the left and an imaginary number on the right. E.g. ``3 + 4j``.
uk: Форми ``число_знак '+' ЧИСЛО`` і ``число_знак '-' ЧИСЛО`` призначені для вираження :ref:`комплексних чисел <imaginary>`; вони вимагають дійсного числа зліва та уявного числа справа. наприклад ``3 + 4j``.

source: In simple terms, ``LITERAL`` will succeed only if ``<subject> == LITERAL``. For the singletons ``None``, ``True`` and ``False``, the :keyword:`is` operator is used.
uk: Простіше кажучи, ``LITERAL`` буде успішним, лише якщо ``<subject> == LITERAL``. Для синглтонів ``None``, ``True`` і ``False`` використовується оператор :keyword:`is`.

source: Capture Patterns
uk: Захоплення шаблонів

source: A capture pattern binds the subject value to a name. Syntax:
uk: Шаблон захоплення прив’язує значення теми до імені. Синтаксис:

source: A single underscore ``_`` is not a capture pattern (this is what ``!'_'`` expresses). It is instead treated as a :token:`~python-grammar:wildcard_pattern`.
uk: Одне підкреслення ``_`` не є шаблоном захоплення (це те, що ``!'_''`` виражає). Натомість він розглядається як :token:`~python-grammar:wildcard_pattern`.

source: In a given pattern, a given name can only be bound once. E.g. ``case x, x: ...`` is invalid while ``case [x] | x: ...`` is allowed.
uk: У заданому шаблоні дане ім’я може бути пов’язане лише один раз. наприклад ``case x, x: ...`` недійсний, тоді як ``case [x] | x: ...`` дозволено.

source: Capture patterns always succeed. The binding follows scoping rules established by the assignment expression operator in :pep:`572`; the name becomes a local variable in the closest containing function scope unless there's an applicable :keyword:`global` or :keyword:`nonlocal` statement.
uk: Захоплення шаблонів завжди вдається. Зв’язування відповідає правилам області видимості, встановленим оператором виразу присвоєння в :pep:`572`; ім'я стає локальною змінною в найближчій області видимості функції, якщо немає відповідного оператора :keyword:`global` або :keyword:`nonlocal`.

source: In simple terms ``NAME`` will always succeed and it will set ``NAME = <subject>``.
uk: Простіше кажучи, ``NAME`` завжди матиме успіх і встановлюватиме ``NAME = <subject>``.

source: Wildcard Patterns
uk: Шаблони підстановок

source: A wildcard pattern always succeeds (matches anything) and binds no name. Syntax:
uk: Шаблон підстановки завжди успішний (відповідає будь-чому) і не прив’язує жодного імені. Синтаксис:

source: ``_`` is a :ref:`soft keyword <soft-keywords>` within any pattern, but only within patterns. It is an identifier, as usual, even within ``match`` subject expressions, ``guard``\ s, and ``case`` blocks.
uk: ``_`` є :ref:`м'яким ключовим словом <soft-keywords>` у будь-якому шаблоні, але лише всередині шаблонів. Це ідентифікатор, як зазвичай, навіть у виразах теми ``match``, ``guard``\ s і ``case`` блоків.

source: In simple terms, ``_`` will always succeed.
uk: Простіше кажучи, ``_`` завжди матиме успіх.

source: Value Patterns
uk: Шаблони цінностей

source: A value pattern represents a named value in Python. Syntax:
uk: Шаблон значення представляє іменоване значення в Python. Синтаксис:

source: The dotted name in the pattern is looked up using standard Python :ref:`name resolution rules <resolve_names>`. The pattern succeeds if the value found compares equal to the subject value (using the ``==`` equality operator).
uk: Пунктирна назва в шаблоні шукається за допомогою стандартних Python :ref:`правил розпізнавання імен <resolve_names>`. Шаблон виконується успішно, якщо знайдене значення порівнюється зі значенням предмета (з використанням оператора рівності ``==``).

source: In simple terms ``NAME1.NAME2`` will succeed only if ``<subject> == NAME1.NAME2``
uk: Простіше кажучи, ``NAME1.NAME2`` буде успішним, лише якщо ``<subject> == NAME1.NAME2``

source: If the same value occurs multiple times in the same match statement, the interpreter may cache the first value found and reuse it rather than repeat the same lookup. This cache is strictly tied to a given execution of a given match statement.
uk: Якщо те саме значення зустрічається кілька разів у тому самому операторі збігу, інтерпретатор може кешувати перше знайдене значення та використовувати його повторно, а не повторювати той самий пошук. Цей кеш суворо прив’язаний до заданого виконання даного оператора відповідності.

source: Group Patterns
uk: Шаблони груп

source: A group pattern allows users to add parentheses around patterns to emphasize the intended grouping. Otherwise, it has no additional syntax. Syntax:
uk: Груповий шаблон дозволяє користувачам додавати дужки навколо шаблонів, щоб підкреслити передбачуване групування. В іншому випадку він не має додаткового синтаксису. Синтаксис:

source: In simple terms ``(P)`` has the same effect as ``P``.
uk: Простіше кажучи, ``(P)`` має той самий ефект, що ``P``.

source: Sequence Patterns
uk: Шаблони послідовності

source: A sequence pattern contains several subpatterns to be matched against sequence elements. The syntax is similar to the unpacking of a list or tuple.
uk: Шаблон послідовності містить кілька підшаблонів, які потрібно зіставити з елементами послідовності. Синтаксис подібний до розпакування списку або кортежу.

source: There is no difference if parentheses or square brackets are used for sequence patterns (i.e. ``(...)`` vs ``[...]`` ).
uk: Немає різниці, якщо дужки або квадратні дужки використовуються для шаблонів послідовності (тобто ``(...)`` проти ``[...]`` ).

source: A single pattern enclosed in parentheses without a trailing comma (e.g. ``(3 | 4)``) is a :ref:`group pattern <group-patterns>`. While a single pattern enclosed in square brackets (e.g. ``[3 | 4]``) is still a sequence pattern.
uk: Один шаблон, укладений у дужки без кінцевої коми (наприклад, ``(3 | 4)``), є :ref:`груповим шаблоном <group-patterns>`. У той час як один шаблон, укладений у квадратні дужки (наприклад, ``[3 | 4]``), все ще є шаблоном послідовності.

source: At most one star subpattern may be in a sequence pattern. The star subpattern may occur in any position. If no star subpattern is present, the sequence pattern is a fixed-length sequence pattern; otherwise it is a variable-length sequence pattern.
uk: Щонайбільше один зірковий підшаблон може бути в шаблоні послідовності. Підшаблон зірки може з’являтися в будь-якій позиції. Якщо підшаблон зірки відсутній, шаблон послідовності є шаблоном послідовності фіксованої довжини; інакше це шаблон послідовності змінної довжини.

source: The following is the logical flow for matching a sequence pattern against a subject value:
uk: Нижче наведено логічний потік для зіставлення шаблону послідовності зі значенням предмета:

source: If the subject value is not a sequence [#]_, the sequence pattern fails.
uk: Якщо значення теми не є послідовністю [#]_, шаблон послідовності не виконується.

source: If the subject value is an instance of ``str``, ``bytes`` or ``bytearray`` the sequence pattern fails.
uk: Якщо значення теми є екземпляром ``str``, ``bytes`` або ``bytearray``, шаблон послідовності не виконується.

source: The subsequent steps depend on whether the sequence pattern is fixed or variable-length.
uk: Подальші кроки залежать від того, чи є шаблон послідовності фіксованою чи змінною довжиною.

source: If the sequence pattern is fixed-length:
uk: Якщо шаблон послідовності має фіксовану довжину:

source: If the length of the subject sequence is not equal to the number of subpatterns, the sequence pattern fails
uk: Якщо довжина предметної послідовності не дорівнює кількості підшаблонів, шаблон послідовності не вдається

source: Subpatterns in the sequence pattern are matched to their corresponding items in the subject sequence from left to right. Matching stops as soon as a subpattern fails. If all subpatterns succeed in matching their corresponding item, the sequence pattern succeeds.
uk: Підшаблони в шаблоні послідовності зіставляються з відповідними елементами в послідовності предметів зліва направо. Зіставлення припиняється, як тільки підшаблон не вдається. Якщо всі підшаблони успішно відповідають їхньому відповідному елементу, шаблон послідовності вдається.

source: Otherwise, if the sequence pattern is variable-length:
uk: В іншому випадку, якщо шаблон послідовності має змінну довжину:

source: If the length of the subject sequence is less than the number of non-star subpatterns, the sequence pattern fails.
uk: Якщо довжина предметної послідовності менша за кількість незіркових підшаблонів, шаблон послідовності не вдається.

source: The leading non-star subpatterns are matched to their corresponding items as for fixed-length sequences.
uk: Провідні незіркові підшаблони зіставляються з відповідними елементами, як для послідовностей фіксованої довжини.

source: If the previous step succeeds, the star subpattern matches a list formed of the remaining subject items, excluding the remaining items corresponding to non-star subpatterns following the star subpattern.
uk: Якщо попередній крок виконано успішно, підшаблон зірочки збігається зі списком, сформованим із решти предметних елементів, за винятком решти елементів, що відповідають підшаблонам без зірочки, які слідують за підшаблоном зірочки.

source: Remaining non-star subpatterns are matched to their corresponding subject items, as for a fixed-length sequence.
uk: Решта підшаблонів без зірок зіставляються з відповідними предметними елементами, як для послідовності фіксованої довжини.

source: The length of the subject sequence is obtained via :func:`len` (i.e. via the :meth:`__len__` protocol). This length may be cached by the interpreter in a similar manner as :ref:`value patterns <value-patterns>`.
uk: Довжина предметної послідовності визначається через :func:`len` (тобто через :meth:`__len__` протокол). Ця довжина може бути кешована інтерпретатором подібним чином, як :ref:`шаблони значень <value-patterns>`.
