Repository: python/python-docs-uk
Catalog: reference/compound_stmts.po
Languages: uk

source: The order in which attributes are defined in the class body is preserved in the new class's ``__dict__``. Note that this is reliable only right after the class is created and only for classes that were defined using the definition syntax.
uk: Порядок, у якому атрибути визначені в тілі класу, зберігається в ``__dict__`` нового класу. Зауважте, що це надійно лише відразу після створення класу та лише для класів, які були визначені за допомогою синтаксису визначення.

source: Class creation can be customized heavily using :ref:`metaclasses <metaclasses>`.
uk: Створення класів можна значно налаштувати за допомогою :ref:`metaclasses <metaclasses>`.

source: Classes can also be decorated: just like when decorating functions, ::
uk: Класи також можна декорувати: як і при декоруванні функцій, ::

source: The evaluation rules for the decorator expressions are the same as for function decorators. The result is then bound to the class name.
uk: Правила оцінки для виразів декоратора такі ж, як і для декораторів функцій. Потім результат прив’язується до імені класу.

source: Classes may be decorated with any valid :token:`~python-grammar:assignment_expression`. Previously, the grammar was much more restrictive; see :pep:`614` for details.
uk: Класи можуть бути прикрашені будь-яким дійсним :token:`~python-grammar:assignment_expression`. Раніше граматика була набагато більш обмежувальною; подробиці див. :pep:`614`.

source: **Programmer's note:** Variables defined in the class definition are class attributes; they are shared by instances. Instance attributes can be set in a method with ``self.name = value``. Both class and instance attributes are accessible through the notation "``self.name``", and an instance attribute hides a class attribute with the same name when accessed in this way. Class attributes can be used as defaults for instance attributes, but using mutable values there can lead to unexpected results. :ref:`Descriptors <descriptors>` can be used to create instance variables with different implementation details.
uk: **Примітка програміста:** Змінні, визначені у визначенні класу, є атрибутами класу; їх ділять інстанції. Атрибути екземпляра можна встановити в методі за допомогою ``self.name = value``. Як атрибути класу, так і атрибути екземпляра доступні через нотацію "``self.name``", а атрибут екземпляра приховує атрибут класу з таким самим іменем, коли до нього звертаються таким чином. Атрибути класу можна використовувати як значення за замовчуванням для атрибутів екземплярів, але використання там змінних значень може призвести до неочікуваних результатів. :ref:`Дескриптори <descriptors>` можна використовувати для створення змінних екземпляра з різними деталями реалізації.

source: :pep:`3115` - Metaclasses in Python 3000
uk: :pep:`3115` - Метакласи в Python 3000

source: The proposal that changed the declaration of metaclasses to the current syntax, and the semantics for how classes with metaclasses are constructed.
uk: Пропозиція, яка змінила оголошення метакласів на поточний синтаксис і семантику того, як будуються класи з метакласами.

source: :pep:`3129` - Class Decorators
uk: :pep:`3129` - Декоратори класу

source: The proposal that added class decorators. Function and method decorators were introduced in :pep:`318`.
uk: Пропозиція, яка додала декоратори класу. Декоратори функцій і методів були представлені в :pep:`318`.

source: Coroutines
uk: Співпрограми

source: Coroutine function definition
uk: Визначення функції співпрограми

source: Execution of Python coroutines can be suspended and resumed at many points (see :term:`coroutine`). :keyword:`await` expressions, :keyword:`async for` and :keyword:`async with` can only be used in the body of a coroutine function.
uk: Виконання співпрограм Python можна призупинити та відновити в багатьох точках (див. :term:`coroutine`). Вирази :keyword:`await`, :keyword:`async for` і :keyword:`async with` можна використовувати лише в тілі функції співпрограми.

source: Functions defined with ``async def`` syntax are always coroutine functions, even if they do not contain ``await`` or ``async`` keywords.
uk: Функції, визначені за допомогою синтаксису ``async def``, завжди є функціями співпрограми, навіть якщо вони не містять ключових слів ``await`` або ``async``.

source: It is a :exc:`SyntaxError` to use a ``yield from`` expression inside the body of a coroutine function.
uk: Використання виразу ``yield from`` всередині тіла функції співпрограми є :exc:`SyntaxError`.

source: An example of a coroutine function::
uk: Приклад функції співпрограми::

source: ``await`` and ``async`` are now keywords; previously they were only treated as such inside the body of a coroutine function.
uk: ``await`` і ``async`` тепер є ключовими словами; раніше вони розглядалися як такі лише всередині тіла співпрограми.

source: The :keyword:`!async for` statement
uk: Оператор :keyword:`!async for`

source: An :term:`asynchronous iterable` provides an ``__aiter__`` method that directly returns an :term:`asynchronous iterator`, which can call asynchronous code in its ``__anext__`` method.
uk: :term:`asynchronous iterable` надає метод ``__aiter__``, який безпосередньо повертає :term:`asynchronous iterator`, який може викликати асинхронний код у своєму методі ``__anext__``.

source: The ``async for`` statement allows convenient iteration over asynchronous iterables.
uk: Оператор ``async for`` дозволяє зручно виконувати ітерації над асинхронними ітераціями.

source: Is semantically equivalent to::
uk: Семантично еквівалентний::

source: See also :meth:`__aiter__` and :meth:`__anext__` for details.
uk: Дивіться також :meth:`__aiter__` і :meth:`__anext__` для деталей.

source: It is a :exc:`SyntaxError` to use an ``async for`` statement outside the body of a coroutine function.
uk: Це :exc:`SyntaxError`, якщо використовувати оператор ``async for`` поза тілом функції співпрограми.

source: The :keyword:`!async with` statement
uk: Оператор :keyword:`!async with`

source: An :term:`asynchronous context manager` is a :term:`context manager` that is able to suspend execution in its *enter* and *exit* methods.
uk: Асинхронний менеджер контексту (:term:`asynchronous context manager`) — це менеджер контексту (:term:`context manager`),який може призупинити виконання своїх методів *enter* і *exit*.

source: See also :meth:`__aenter__` and :meth:`__aexit__` for details.
uk: Дивіться також :meth:`__aenter__` і :meth:`__aexit__` для деталей.

source: It is a :exc:`SyntaxError` to use an ``async with`` statement outside the body of a coroutine function.
uk: Це :exc:`SyntaxError`, якщо використовувати оператор ``async with`` поза тілом функції співпрограми.

source: :pep:`492` - Coroutines with async and await syntax
uk: :pep:`492` - Співпрограми з синтаксисом async і await

source: The proposal that made coroutines a proper standalone concept in Python, and added supporting syntax.
uk: Пропозиція, яка зробила співпрограми справжньою автономною концепцією в Python і додала допоміжний синтаксис.

source: Footnotes
uk: Виноски

source: The exception is propagated to the invocation stack unless there is a :keyword:`finally` clause which happens to raise another exception. That new exception causes the old one to be lost.
uk: Виняток поширюється на стек викликів, якщо немає пункту :keyword:`finally`, який викликає інший виняток. Цей новий виняток призводить до втрати старого.

source: In pattern matching, a sequence is defined as one of the following:
uk: У відповідності за зразком послідовність визначається як одне з наступного:

source: a class that inherits from :class:`collections.abc.Sequence`
uk: клас, який успадковує :class:`collections.abc.Sequence`

source: a Python class that has been registered as :class:`collections.abc.Sequence`
uk: клас Python, зареєстрований як :class:`collections.abc.Sequence`

source: a builtin class that has its (CPython) :data:`Py_TPFLAGS_SEQUENCE` bit set
uk: вбудований клас, який має встановлений біт (CPython) :data:`Py_TPFLAGS_SEQUENCE`

source: a class that inherits from any of the above
uk: клас, який успадковує будь-який з перерахованих вище

source: The following standard library classes are sequences:
uk: Наступні стандартні бібліотечні класи є послідовностями:

source: Subject values of type ``str``, ``bytes``, and ``bytearray`` do not match sequence patterns.
uk: Значення суб’єктів типу ``str``, ``bytes`` і ``bytearray`` не відповідають шаблонам послідовності.

source: In pattern matching, a mapping is defined as one of the following:
uk: У відповідності за шаблоном відображення визначається як одне з наступного:

source: a class that inherits from :class:`collections.abc.Mapping`
uk: клас, який успадковує :class:`collections.abc.Mapping`

source: a Python class that has been registered as :class:`collections.abc.Mapping`
uk: клас Python, зареєстрований як :class:`collections.abc.Mapping`

source: a builtin class that has its (CPython) :data:`Py_TPFLAGS_MAPPING` bit set
uk: вбудований клас, який має встановлений біт (CPython) :data:`Py_TPFLAGS_MAPPING`

source: The standard library classes :class:`dict` and :class:`types.MappingProxyType` are mappings.
uk: Класи стандартної бібліотеки :class:`dict` і :class:`types.MappingProxyType` є відображеннями.

source: A string literal appearing as the first statement in the function body is transformed into the function's ``__doc__`` attribute and therefore the function's :term:`docstring`.
uk: Рядковий літерал, який з’являється як перший оператор у тілі функції, перетворюється на атрибут функції ``__doc__`` і, отже, функцію :term:`docstring`.

source: A string literal appearing as the first statement in the class body is transformed into the namespace's ``__doc__`` item and therefore the class's :term:`docstring`.
uk: Рядковий літерал, що з’являється як перший оператор у тілі класу, перетворюється на елемент простору імен ``__doc__`` і, отже, на :term:`docstring` класу.
