Repository: python/python-docs-uk
Catalog: reference/compound_stmts.po
Languages: uk

source: Compound statements
uk: Складені висловлювання

source: Compound statements contain (groups of) other statements; they affect or control the execution of those other statements in some way. In general, compound statements span multiple lines, although in simple incarnations a whole compound statement may be contained in one line.
uk: Складені висловлювання містять (групи) інші висловлювання; вони певним чином впливають або контролюють виконання цих інших операторів. Загалом складені висловлювання охоплюють кілька рядків, хоча в простих варіантах ціле складене висловлювання може міститися в одному рядку.

source: The :keyword:`if`, :keyword:`while` and :keyword:`for` statements implement traditional control flow constructs. :keyword:`try` specifies exception handlers and/or cleanup code for a group of statements, while the :keyword:`with` statement allows the execution of initialization and finalization code around a block of code. Function and class definitions are also syntactically compound statements.
uk: Оператори :keyword:`if`, :keyword:`while` і :keyword:`for` реалізують традиційні конструкції потоку керування. :keyword:`try` визначає обробники винятків та/або код очищення для групи операторів, тоді як оператор :keyword:`with` дозволяє виконувати код ініціалізації та фіналізації навколо блоку коду. Визначення функцій і класів також є синтаксично складеними висловлюваннями.

source: A compound statement consists of one or more 'clauses.' A clause consists of a header and a 'suite.' The clause headers of a particular compound statement are all at the same indentation level. Each clause header begins with a uniquely identifying keyword and ends with a colon. A suite is a group of statements controlled by a clause. A suite can be one or more semicolon-separated simple statements on the same line as the header, following the header's colon, or it can be one or more indented statements on subsequent lines. Only the latter form of a suite can contain nested compound statements; the following is illegal, mostly because it wouldn't be clear to which :keyword:`if` clause a following :keyword:`else` clause would belong::
uk: Складений оператор складається з одного або кількох "речень". Речення складається із заголовка та "набору". Усі заголовки речень певного складеного оператора мають однаковий рівень відступу. Кожен заголовок пропозиції починається з унікального ключового слова та закінчується двокрапкою. Набір — це група висловлювань, керованих реченням. Набір може складатися з одного або кількох простих операторів, розділених крапкою з комою, у тому самому рядку, що й заголовок, після двокрапки заголовка, або це може бути один чи більше операторів із відступом у наступних рядках. Лише остання форма набору може містити вкладені складені оператори; наступне є незаконним, здебільшого тому, що було б незрозуміло, до якого пункту :keyword:`if` належало б таке положення :keyword:`else`::

source: Also note that the semicolon binds tighter than the colon in this context, so that in the following example, either all or none of the :func:`print` calls are executed::
uk: Також зауважте, що в цьому контексті крапка з комою зв’язується сильніше, ніж двокрапка, тому в наступному прикладі виконуються або всі, або жоден із викликів :func:`print`::

source: Summarizing:
uk: Підведення підсумків:

source: Note that statements always end in a ``NEWLINE`` possibly followed by a ``DEDENT``. Also note that optional continuation clauses always begin with a keyword that cannot start a statement, thus there are no ambiguities (the 'dangling :keyword:`else`' problem is solved in Python by requiring nested :keyword:`if` statements to be indented).
uk: Зауважте, що оператори завжди закінчуються на ``NEWLINE``, після якого, можливо, йде ``DEDENT``. Також зауважте, що необов’язкові речення продовження завжди починаються з ключового слова, яке не може розпочинати оператор, тому немає ніяких двозначностей (проблему "висячих :keyword:`else`" вирішено в Python, вимагаючи вкладених операторів :keyword:`if` з відступом).

source: The formatting of the grammar rules in the following sections places each clause on a separate line for clarity.
uk: Форматування правил граматики в наступних розділах розміщує кожне речення в окремому рядку для ясності.

source: The :keyword:`!if` statement
uk: Оператор :keyword:`!if`

source: The :keyword:`if` statement is used for conditional execution:
uk: Оператор :keyword:`if` використовується для умовного виконання:

source: It selects exactly one of the suites by evaluating the expressions one by one until one is found to be true (see section :ref:`booleans` for the definition of true and false); then that suite is executed (and no other part of the :keyword:`if` statement is executed or evaluated). If all expressions are false, the suite of the :keyword:`else` clause, if present, is executed.
uk: Він вибирає точно один із наборів, обчислюючи вирази один за іншим, доки один не буде визнаний істинним (див. розділ :ref:`booleans` для визначення істинного та хибного); тоді цей набір виконується (і жодна інша частина оператора :keyword:`if` не виконується і не оцінюється). Якщо всі вирази хибні, виконується набір пропозиції :keyword:`else`, якщо вона є.

source: The :keyword:`!while` statement
uk: Оператор :keyword:`!while`

source: The :keyword:`while` statement is used for repeated execution as long as an expression is true:
uk: Інструкція :keyword:`while` використовується для повторного виконання, доки вираз є істинним:

source: This repeatedly tests the expression and, if it is true, executes the first suite; if the expression is false (which may be the first time it is tested) the suite of the :keyword:`!else` clause, if present, is executed and the loop terminates.
uk: Це багаторазово перевіряє вираз і, якщо воно вірне, виконує перший набір; якщо вираз є хибним (що може бути першим, коли його перевіряють), набір пропозиції :keyword:`!else` виконується, і цикл припиняється.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`!else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and goes back to testing the expression.
uk: Інструкція :keyword:`break`, виконана в першому наборі, завершує цикл без виконання набору речень :keyword:`!else`. Інструкція :keyword:`continue`, виконана в першому наборі, пропускає решту пакета і повертається до перевірки виразу.

source: The :keyword:`!for` statement
uk: Оператор :keyword:`!for`

source: The :keyword:`for` statement is used to iterate over the elements of a sequence (such as a string, tuple or list) or other iterable object:
uk: Оператор :keyword:`for` використовується для повторення елементів послідовності (таких як рядок, кортеж або список) або іншого ітерованого об’єкта:

source: The expression list is evaluated once; it should yield an iterable object. An iterator is created for the result of the ``expression_list``. The suite is then executed once for each item provided by the iterator, in the order returned by the iterator. Each item in turn is assigned to the target list using the standard rules for assignments (see :ref:`assignment`), and then the suite is executed. When the items are exhausted (which is immediately when the sequence is empty or an iterator raises a :exc:`StopIteration` exception), the suite in the :keyword:`!else` clause, if present, is executed, and the loop terminates.
uk: Список виразів обчислюється один раз; він повинен давати ітерований об’єкт. Для результату ``expression_list`` створюється ітератор. Потім набір виконується один раз для кожного елемента, наданого ітератором, у порядку, який повертає ітератор. Кожен елемент по черзі призначається цільовому списку за допомогою стандартних правил призначення (див. :ref:`assignment`), а потім набір виконується. Коли елементи вичерпуються (тобто відразу, коли послідовність стає порожньою або ітератор викликає виняткову ситуацію :exc:`StopIteration`), виконується набір у реченні :keyword:`!else`, якщо він присутній, і цикл припиняється.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`!else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and continues with the next item, or with the :keyword:`!else` clause if there is no next item.
uk: Інструкція :keyword:`break`, виконана в першому наборі, завершує цикл без виконання набору речень :keyword:`!else`. Інструкція :keyword:`continue`, виконана в першому наборі, пропускає решту набору і продовжує з наступним елементом або з пропозицією :keyword:`!else`, якщо наступного елемента немає.

source: The for-loop makes assignments to the variables in the target list. This overwrites all previous assignments to those variables including those made in the suite of the for-loop::
uk: Цикл for виконує призначення змінним у цільовому списку. Це перезаписує всі попередні призначення цим змінним, включаючи ті, що зроблені в наборі циклу for::

source: Names in the target list are not deleted when the loop is finished, but if the sequence is empty, they will not have been assigned to at all by the loop. Hint: the built-in function :func:`range` returns an iterator of integers suitable to emulate the effect of Pascal's ``for i := a to b do``; e.g., ``list(range(3))`` returns the list ``[0, 1, 2]``.
uk: Імена в цільовому списку не видаляються після завершення циклу, але якщо послідовність порожня, вони взагалі не будуть призначені циклом. Підказка: вбудована функція :func:`range` повертає ітератор цілих чисел, придатний для імітації ефекту Pascal ``for i := a to b do``; наприклад, ``list(range(3))`` повертає список ``[0, 1, 2]``.

source: The :keyword:`!try` statement
uk: Оператор :keyword:`!try`

source: The :keyword:`try` statement specifies exception handlers and/or cleanup code for a group of statements:
uk: Оператор :keyword:`try` визначає обробники винятків та/або код очищення для групи операторів:

source: The :keyword:`except` clause(s) specify one or more exception handlers. When no exception occurs in the :keyword:`try` clause, no exception handler is executed. When an exception occurs in the :keyword:`!try` suite, a search for an exception handler is started. This search inspects the except clauses in turn until one is found that matches the exception. An expression-less except clause, if present, must be last; it matches any exception. For an except clause with an expression, that expression is evaluated, and the clause matches the exception if the resulting object is "compatible" with the exception. An object is compatible with an exception if the object is the class or a :term:`non-virtual base class <abstract base class>` of the exception object, or a tuple containing an item that is the class or a non-virtual base class of the exception object.
uk: Умова(и) :keyword:`except` визначає один або більше обробників винятків. Якщо в реченні :keyword:`try` не виникає жодного винятку, обробник винятків не виконується. Коли в наборі :keyword:`!try` виникає виняткова ситуація, починається пошук обробника виняткової ситуації. Цей пошук перевіряє пропозиції винятків по черзі, поки не буде знайдено те, що відповідає винятку. Речення без виразу, крім, якщо воно присутнє, має бути останнім; він відповідає будь-якому винятку. Для речення винятку з виразом цей вираз оцінюється, і речення відповідає винятку, якщо отриманий об’єкт "сумісний" з винятком. Об’єкт сумісний із винятком, якщо він є класом або :term:`невіртуальним базовим класом <abstract base class>` об’єкта винятку, або кортежем, що містить елемент, який є класом або невіртуальним базовим класом об'єкт винятку.

source: If no except clause matches the exception, the search for an exception handler continues in the surrounding code and on the invocation stack. [#]_
uk: Якщо жоден пункт винятку не відповідає винятку, пошук обробника винятку продовжується в навколишньому коді та в стеку викликів. [#]_

source: If the evaluation of an expression in the header of an except clause raises an exception, the original search for a handler is canceled and a search starts for the new exception in the surrounding code and on the call stack (it is treated as if the entire :keyword:`try` statement raised the exception).
uk: Якщо обчислення виразу в заголовку пропозиції винятку викликає виняток, початковий пошук обробника скасовується та починається пошук нового винятку в навколишньому коді та в стеку викликів (це розглядається так, ніби весь оператор :keyword:`try` викликав виняток).

source: When a matching except clause is found, the exception is assigned to the target specified after the :keyword:`!as` keyword in that except clause, if present, and the except clause's suite is executed. All except clauses must have an executable block. When the end of this block is reached, execution continues normally after the entire try statement. (This means that if two nested handlers exist for the same exception, and the exception occurs in the try clause of the inner handler, the outer handler will not handle the exception.)
uk: Якщо знайдено відповідне речення, виняток призначається цільовому об’єкту, указаному після ключового слова :keyword:`!as` у цьому речення, якщо воно є, і виконується набір речень. Усі речення, крім, повинні мати виконуваний блок. Коли досягнуто кінця цього блоку, виконання продовжується в звичайному режимі після всього оператора try. (Це означає, що якщо існують два вкладені обробники для одного винятку, і виняток виникає в пропозиції try внутрішнього обробника, зовнішній обробник не оброблятиме виняток.)

source: When an exception has been assigned using ``as target``, it is cleared at the end of the except clause. This is as if ::
uk: Якщо виняток було призначено за допомогою ``as target``, воно очищається в кінці пропозиції винятку. Це ніби ::

source: was translated to ::
uk: було перекладено на::

source: This means the exception must be assigned to a different name to be able to refer to it after the except clause. Exceptions are cleared because with the traceback attached to them, they form a reference cycle with the stack frame, keeping all locals in that frame alive until the next garbage collection occurs.
uk: Це означає, що винятку потрібно призначити інше ім’я, щоб можна було посилатися на нього після пропозиції винятку. Винятки очищаються, оскільки з підключеною до них трасуванням вони утворюють еталонний цикл із фреймом стека, зберігаючи всіх локальних у цьому фреймі живими до наступного збирання сміття.

source: Before an except clause's suite is executed, details about the exception are stored in the :mod:`sys` module and can be accessed via :func:`sys.exc_info`. :func:`sys.exc_info` returns a 3-tuple consisting of the exception class, the exception instance and a traceback object (see section :ref:`types`) identifying the point in the program where the exception occurred. The details about the exception accessed via :func:`sys.exc_info` are restored to their previous values when leaving an exception handler::
uk: Перед тим, як буде виконано набір речень винятків, деталі про виняток зберігаються в модулі :mod:`sys` і доступ до них можна отримати через :func:`sys.exc_info`. :func:`sys.exc_info` повертає 3-кортеж, що складається з класу виключення, екземпляру виключення та об’єкта трасування (див. розділ :ref:`types`), що визначає точку в програмі, де сталася виняток. Деталі про виняток, доступ до якого здійснюється через :func:`sys.exc_info`, відновлюються до своїх попередніх значень, коли залишають обробник винятків::

source: The optional :keyword:`!else` clause is executed if the control flow leaves the :keyword:`try` suite, no exception was raised, and no :keyword:`return`, :keyword:`continue`, or :keyword:`break` statement was executed. Exceptions in the :keyword:`!else` clause are not handled by the preceding :keyword:`except` clauses.
uk: Необов’язкова пропозиція :keyword:`!else` виконується, якщо потік керування виходить із набору :keyword:`try`, не було викликано винятків і немає :keyword:`return`, :keyword:`continue` або Інструкція :keyword:`break` була виконана. Винятки в пункті :keyword:`!else` не обробляються попередніми пунктами :keyword:`except`.

source: If :keyword:`finally` is present, it specifies a 'cleanup' handler. The :keyword:`try` clause is executed, including any :keyword:`except` and :keyword:`!else` clauses. If an exception occurs in any of the clauses and is not handled, the exception is temporarily saved. The :keyword:`!finally` clause is executed. If there is a saved exception it is re-raised at the end of the :keyword:`!finally` clause. If the :keyword:`!finally` clause raises another exception, the saved exception is set as the context of the new exception. If the :keyword:`!finally` clause executes a :keyword:`return`, :keyword:`break` or :keyword:`continue` statement, the saved exception is discarded::
uk: Якщо :keyword:`finally` присутній, він визначає обробник 'очищення'. Речення :keyword:`try` виконується, включаючи будь-які пропозиції :keyword:`except` і :keyword:`!else`. Якщо виняток виникає в будь-якому з пунктів і не обробляється, виняток тимчасово зберігається. Речення :keyword:`!finally` виконується. Якщо є збережений виняток, він повторно викликається в кінці пропозиції :keyword:`!finally`. Якщо речення :keyword:`!finally` викликає інший виняток, збережений виняток встановлюється як контекст нового виключення. Якщо пропозиція :keyword:`!finally` виконує оператор :keyword:`return`, :keyword:`break` або :keyword:`continue`, збережений виняток скидається:

source: The exception information is not available to the program during execution of the :keyword:`finally` clause.
uk: Інформація про винятки недоступна для програми під час виконання пропозиції :keyword:`finally`.

source: When a :keyword:`return`, :keyword:`break` or :keyword:`continue` statement is executed in the :keyword:`try` suite of a :keyword:`!try`...\ :keyword:`!finally` statement, the :keyword:`finally` clause is also executed 'on the way out.'
uk: Коли оператор :keyword:`return`, :keyword:`break` або :keyword:`continue` виконується в наборі :keyword:`try` :keyword:`!try`...\ оператор :keyword:`!finally`, пункт :keyword:`finally` також виконується "на виході".

source: The return value of a function is determined by the last :keyword:`return` statement executed. Since the :keyword:`finally` clause always executes, a :keyword:`!return` statement executed in the :keyword:`!finally` clause will always be the last one executed::
uk: Повернене значення функції визначається останнім виконаним оператором :keyword:`return`. Оскільки пропозиція :keyword:`finally` завжди виконується, оператор :keyword:`!return`, що виконується в пропозиції :keyword:`!finally`, завжди буде виконуватися останнім::

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information on using the :keyword:`raise` statement to generate exceptions may be found in section :ref:`raise`.
uk: Додаткову інформацію про винятки можна знайти в розділі :ref:`exceptions`, а інформацію про використання оператора :keyword:`raise` для створення винятків можна знайти в розділі :ref:`raise`.

source: Prior to Python 3.8, a :keyword:`continue` statement was illegal in the :keyword:`finally` clause due to a problem with the implementation.
uk: До Python 3.8 оператор :keyword:`continue` був незаконним у пункті :keyword:`finally` через проблему з реалізацією.

source: The :keyword:`!with` statement
uk: Оператор :keyword:`!with`

source: The :keyword:`with` statement is used to wrap the execution of a block with methods defined by a context manager (see section :ref:`context-managers`). This allows common :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` usage patterns to be encapsulated for convenient reuse.
uk: Оператор :keyword:`with` використовується для обгортання виконання блоку методами, визначеними контекстним менеджером (див. розділ :ref:`context-managers`). Це дозволяє інкапсулювати загальні :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` моделі використання для зручного повторного використання.

source: The execution of the :keyword:`with` statement with one "item" proceeds as follows:
uk: Виконання оператора :keyword:`with` з одним "елементом" відбувається наступним чином:

source: The context expression (the expression given in the :token:`~python-grammar:with_item`) is evaluated to obtain a context manager.
uk: Контекстний вираз (вираз, поданий у :token:`~python-grammar:with_item`) обчислюється для отримання контекстного менеджера.

source: The context manager's :meth:`__enter__` is loaded for later use.
uk: Менеджер контексту :meth:`__enter__` завантажується для подальшого використання.

source: The context manager's :meth:`__exit__` is loaded for later use.
uk: Менеджер контексту :meth:`__exit__` завантажується для подальшого використання.

source: The context manager's :meth:`__enter__` method is invoked.
uk: Викликається метод :meth:`__enter__` контекстного менеджера.

source: If a target was included in the :keyword:`with` statement, the return value from :meth:`__enter__` is assigned to it.
uk: Якщо мета була включена в оператор :keyword:`with`, їй призначається значення, що повертається з :meth:`__enter__`.

source: The :keyword:`with` statement guarantees that if the :meth:`__enter__` method returns without an error, then :meth:`__exit__` will always be called. Thus, if an error occurs during the assignment to the target list, it will be treated the same as an error occurring within the suite would be. See step 6 below.
uk: Оператор :keyword:`with` гарантує, що якщо метод :meth:`__enter__` повертає без помилки, то :meth:`__exit__` завжди буде викликатися. Таким чином, якщо під час призначення цільового списку виникає помилка, вона розглядатиметься так само, як і помилка, яка сталася в наборі. Дивіться крок 6 нижче.

source: The suite is executed.
uk: Сюїта виконана.

source: The context manager's :meth:`__exit__` method is invoked. If an exception caused the suite to be exited, its type, value, and traceback are passed as arguments to :meth:`__exit__`. Otherwise, three :const:`None` arguments are supplied.
uk: Викликається метод :meth:`__exit__` контекстного менеджера. Якщо виняткова ситуація призвела до виходу з набору, його тип, значення та відстеження передаються як аргументи :meth:`__exit__`. В іншому випадку надається три аргументи :const:`None`.

source: If the suite was exited due to an exception, and the return value from the :meth:`__exit__` method was false, the exception is reraised. If the return value was true, the exception is suppressed, and execution continues with the statement following the :keyword:`with` statement.
uk: Якщо набір було закрито через виняток, а значення, яке повертає метод :meth:`__exit__`, було false, виняток створюється повторно. Якщо повернене значення було істинним, виняток пригнічується, і виконання продовжується з оператором, наступним за оператором :keyword:`with`.

source: If the suite was exited for any reason other than an exception, the return value from :meth:`__exit__` is ignored, and execution proceeds at the normal location for the kind of exit that was taken.
uk: Якщо вихід із набору було завершено з будь-якої причини, крім винятку, значення, що повертається з :meth:`__exit__`, ігнорується, і виконання продовжується у звичайному місці для того виду виходу, який було зроблено.

source: The following code::
uk: Наступний код::

source: is semantically equivalent to::
uk: семантично еквівалентний::
