Repository: python/python-docs-uk
Catalog: reference/expressions.po
Languages: uk

source: The unary ``-`` (minus) operator yields the negation of its numeric argument; the operation can be overridden with the :meth:`__neg__` special method.
uk: Унарний оператор ``-`` (мінус) дає заперечення свого числового аргументу; операцію можна перевизначити спеціальним методом :meth:`__neg__`.

source: The unary ``+`` (plus) operator yields its numeric argument unchanged; the operation can be overridden with the :meth:`__pos__` special method.
uk: Унарний оператор ``+`` (плюс) повертає свій числовий аргумент без змін; операцію можна перевизначити спеціальним методом :meth:`__pos__`.

source: The unary ``~`` (invert) operator yields the bitwise inversion of its integer argument. The bitwise inversion of ``x`` is defined as ``-(x+1)``. It only applies to integral numbers or to custom objects that override the :meth:`__invert__` special method.
uk: Унарний оператор ``~`` (інвертування) дає порозрядну інверсію свого цілочисельного аргументу. Побітова інверсія ``x`` визначається як ``-(x+1)``. Це стосується лише цілих чисел або користувацьких об’єктів, які замінюють спеціальний метод :meth:`__invert__`.

source: In all three cases, if the argument does not have the proper type, a :exc:`TypeError` exception is raised.
uk: В усіх трьох випадках, якщо аргумент не має належного типу, виникає виняток :exc:`TypeError`.

source: Binary arithmetic operations
uk: Двійкові арифметичні операції

source: The binary arithmetic operations have the conventional priority levels. Note that some of these operations also apply to certain non-numeric types. Apart from the power operator, there are only two levels, one for multiplicative operators and one for additive operators:
uk: Двійкові арифметичні операції мають загальноприйняті рівні пріоритету. Зверніть увагу, що деякі з цих операцій також застосовуються до певних нечислових типів. Окрім оператора степеня, існує лише два рівні: один для мультиплікативних операторів і один для адитивних операторів:

source: The ``*`` (multiplication) operator yields the product of its arguments. The arguments must either both be numbers, or one argument must be an integer and the other must be a sequence. In the former case, the numbers are converted to a common type and then multiplied together. In the latter case, sequence repetition is performed; a negative repetition factor yields an empty sequence.
uk: Оператор ``*`` (множення) повертає добуток своїх аргументів. Обидва аргументи мають бути числами, або один аргумент має бути цілим числом, а інший — послідовністю. У першому випадку числа перетворюються на загальний тип, а потім перемножуються. В останньому випадку виконується повторення послідовності; негативний коефіцієнт повторення дає порожню послідовність.

source: This operation can be customized using the special :meth:`__mul__` and :meth:`__rmul__` methods.
uk: Цю операцію можна налаштувати за допомогою спеціальних методів :meth:`__mul__` і :meth:`__rmul__`.

source: The ``@`` (at) operator is intended to be used for matrix multiplication. No builtin Python types implement this operator.
uk: Оператор ``@`` (at) призначений для використання для множення матриці. Жодні вбудовані типи Python не реалізують цей оператор.

source: The ``/`` (division) and ``//`` (floor division) operators yield the quotient of their arguments. The numeric arguments are first converted to a common type. Division of integers yields a float, while floor division of integers results in an integer; the result is that of mathematical division with the 'floor' function applied to the result. Division by zero raises the :exc:`ZeroDivisionError` exception.
uk: Оператори ``/`` (поділ) і ``//`` (поділ на поверх) видають приватне своїх аргументів. Числові аргументи спочатку перетворюються на загальний тип. Ділення цілих чисел дає значення з плаваючою точкою, а поділення цілих чисел дає ціле число; результатом є математичне ділення із застосованою до результату функцією "підлога". Ділення на нуль викликає виключення :exc:`ZeroDivisionError`.

source: This operation can be customized using the special :meth:`__truediv__` and :meth:`__floordiv__` methods.
uk: Цю операцію можна налаштувати за допомогою спеціальних методів :meth:`__truediv__` і :meth:`__floordiv__`.

source: The ``%`` (modulo) operator yields the remainder from the division of the first argument by the second. The numeric arguments are first converted to a common type. A zero right argument raises the :exc:`ZeroDivisionError` exception. The arguments may be floating point numbers, e.g., ``3.14%0.7`` equals ``0.34`` (since ``3.14`` equals ``4*0.7 + 0.34``.) The modulo operator always yields a result with the same sign as its second operand (or zero); the absolute value of the result is strictly smaller than the absolute value of the second operand [#]_.
uk: Оператор ``%`` (по модулю) дає залишок від ділення першого аргументу на другий. Числові аргументи спочатку перетворюються на загальний тип. Нульовий правий аргумент викликає виняток :exc:`ZeroDivisionError`. Аргументи можуть бути числами з плаваючою комою, наприклад, "3,14%0,7" дорівнює "0,34" (оскільки "3,14" дорівнює "4*0,7 + 0,34"). Оператор модуля завжди дає результат із той же знак, що і його другий операнд (або нуль); абсолютне значення результату строго менше, ніж абсолютне значення другого операнда [#]_.

source: The floor division and modulo operators are connected by the following identity: ``x == (x//y)*y + (x%y)``. Floor division and modulo are also connected with the built-in function :func:`divmod`: ``divmod(x, y) == (x//y, x%y)``. [#]_.
uk: Оператори поділу поверху та модульні оператори з’єднані такою тотожністю: ``x == (x//y)*y + (x%y)``. Поділ на поверх і модуль також пов’язані з вбудованою функцією :func:`divmod`: ``divmod(x, y) == (x//y, x%y)``. [#]_.

source: In addition to performing the modulo operation on numbers, the ``%`` operator is also overloaded by string objects to perform old-style string formatting (also known as interpolation). The syntax for string formatting is described in the Python Library Reference, section :ref:`old-string-formatting`.
uk: На додаток до виконання операції за модулем над числами, оператор ``%`` також перевантажується рядковими об’єктами для виконання старого форматування рядків (також відомого як інтерполяція). Синтаксис для форматування рядків описано в Довіднику з бібліотеки Python, розділ :ref:`old-string-formatting`.

source: The *modulo* operation can be customized using the special :meth:`__mod__` method.
uk: Операцію *modulo* можна налаштувати за допомогою спеціального методу :meth:`__mod__`.

source: The floor division operator, the modulo operator, and the :func:`divmod` function are not defined for complex numbers. Instead, convert to a floating point number using the :func:`abs` function if appropriate.
uk: Оператор поверхового ділення, оператор модуля та функція :func:`divmod` не визначені для комплексних чисел. Замість цього перетворіть на число з плаваючою комою за допомогою функції :func:`abs`, якщо потрібно.

source: The ``+`` (addition) operator yields the sum of its arguments. The arguments must either both be numbers or both be sequences of the same type. In the former case, the numbers are converted to a common type and then added together. In the latter case, the sequences are concatenated.
uk: Оператор ``+`` (додавання) повертає суму своїх аргументів. Обидва аргументи мають бути числами або обома послідовностями одного типу. У першому випадку числа перетворюються на загальний тип, а потім сумуються. В останньому випадку послідовності об’єднані.

source: This operation can be customized using the special :meth:`__add__` and :meth:`__radd__` methods.
uk: Цю операцію можна налаштувати за допомогою спеціальних методів :meth:`__add__` і :meth:`__radd__`.

source: The ``-`` (subtraction) operator yields the difference of its arguments. The numeric arguments are first converted to a common type.
uk: Оператор ``-`` (віднімання) повертає різницю своїх аргументів. Числові аргументи спочатку перетворюються на загальний тип.

source: This operation can be customized using the special :meth:`__sub__` method.
uk: Цю операцію можна налаштувати за допомогою спеціального методу :meth:`__sub__`.

source: Shifting operations
uk: Змінні операції

source: The shifting operations have lower priority than the arithmetic operations:
uk: Операції зсуву мають нижчий пріоритет, ніж арифметичні операції:

source: These operators accept integers as arguments. They shift the first argument to the left or right by the number of bits given by the second argument.
uk: Ці оператори приймають цілі числа як аргументи. Вони зсувають перший аргумент вліво або вправо на кількість бітів, задану другим аргументом.

source: This operation can be customized using the special :meth:`__lshift__` and :meth:`__rshift__` methods.
uk: Цю операцію можна налаштувати за допомогою спеціальних методів :meth:`__lshift__` і :meth:`__rshift__`.

source: A right shift by *n* bits is defined as floor division by ``pow(2,n)``. A left shift by *n* bits is defined as multiplication with ``pow(2,n)``.
uk: Зсув праворуч на *n* бітів визначається як нижнє ділення на ``pow(2,n)``. Зсув ліворуч на *n* бітів визначається як множення на ``pow(2,n)``.

source: Binary bitwise operations
uk: Бінарні побітові операції

source: Each of the three bitwise operations has a different priority level:
uk: Кожна з трьох побітових операцій має різний рівень пріоритету:

source: The ``&`` operator yields the bitwise AND of its arguments, which must be integers or one of them must be a custom object overriding :meth:`__and__` or :meth:`__rand__` special methods.
uk: Оператор ``&`` повертає порозрядне І своїх аргументів, які мають бути цілими числами або один із них має бути спеціальним об’єктом, що перекриває спеціальні методи :meth:`__and__` або :meth:`__rand__`.

source: The ``^`` operator yields the bitwise XOR (exclusive OR) of its arguments, which must be integers or one of them must be a custom object overriding :meth:`__xor__` or :meth:`__rxor__` special methods.
uk: Оператор ``^`` повертає порозрядне XOR (виключаюче АБО) своїх аргументів, які мають бути цілими числами або один із них має бути спеціальним об’єктом, що перекриває спеціальні методи :meth:`__xor__` або :meth:`__rxor__`.

source: The ``|`` operator yields the bitwise (inclusive) OR of its arguments, which must be integers or one of them must be a custom object overriding :meth:`__or__` or :meth:`__ror__` special methods.
uk: Оператор ``|`` повертає порозрядне (включне) АБО своїх аргументів, які мають бути цілими числами або один із них має бути спеціальним об’єктом, що перекриває спеціальні методи :meth:`__or__` або :meth:`__ror__`.

source: Comparisons
uk: Порівняння

source: Unlike C, all comparison operations in Python have the same priority, which is lower than that of any arithmetic, shifting or bitwise operation. Also unlike C, expressions like ``a < b < c`` have the interpretation that is conventional in mathematics:
uk: На відміну від C, усі операції порівняння в Python мають однаковий пріоритет, який нижчий, ніж у будь-якої арифметичної операції, операції зсуву чи побітової операції. Крім того, на відміну від C, такі вирази, як ``a < b < c``, мають тлумачення, яке є звичайним у математиці:

source: Comparisons yield boolean values: ``True`` or ``False``. Custom :dfn:`rich comparison methods` may return non-boolean values. In this case Python will call :func:`bool` on such value in boolean contexts.
uk: Порівняння дають логічні значення: ``True`` або ``False``. Спеціальні :dfn:`rich comparison methods` можуть повертати не логічні значення. У цьому випадку Python викличе :func:`bool` для такого значення в логічних контекстах.

source: Comparisons can be chained arbitrarily, e.g., ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that ``y`` is evaluated only once (but in both cases ``z`` is not evaluated at all when ``x < y`` is found to be false).
uk: Порівняння можна довільно об’єднати в ланцюжок, наприклад, ``x < y <= z`` еквівалентно ``x < y і y <= z``, за винятком того, що ``y`` обчислюється лише один раз (але в обох випадках ``z`` взагалі не обчислюється, якщо ``x < y`` виявляється хибним).

source: Formally, if *a*, *b*, *c*, ..., *y*, *z* are expressions and *op1*, *op2*, ..., *opN* are comparison operators, then ``a op1 b op2 c ... y opN z`` is equivalent to ``a op1 b and b op2 c and ... y opN z``, except that each expression is evaluated at most once.
uk: Формально, якщо *a*, *b*, *c*, ..., *y*, *z* є виразами, а *op1*, *op2*, ..., *opN* є операторами порівняння, тоді ``a op1 b op2 c ... y opN z`` еквівалентний ``a op1 b і b op2 c і ... y opN z``, за винятком того, що кожен вираз обчислюється щонайбільше один раз.

source: Note that ``a op1 b op2 c`` doesn't imply any kind of comparison between *a* and *c*, so that, e.g., ``x < y > z`` is perfectly legal (though perhaps not pretty).
uk: Зауважте, що ``a op1 b op2 c`` не передбачає жодного порівняння між *a* і *c*, тому, наприклад, ``x < y > z`` є абсолютно законним (хоча, можливо, не дуже).

source: Value comparisons
uk: Порівняння цінностей

source: The operators ``<``, ``>``, ``==``, ``>=``, ``<=``, and ``!=`` compare the values of two objects. The objects do not need to have the same type.
uk: Оператори ``<``, ``>``, ``==``, ``>=``, ``<=`` і ``!=`` порівнюють значення двох об’єктів. Об’єкти не обов’язково мають однаковий тип.

source: Chapter :ref:`objects` states that objects have a value (in addition to type and identity). The value of an object is a rather abstract notion in Python: For example, there is no canonical access method for an object's value. Also, there is no requirement that the value of an object should be constructed in a particular way, e.g. comprised of all its data attributes. Comparison operators implement a particular notion of what the value of an object is. One can think of them as defining the value of an object indirectly, by means of their comparison implementation.
uk: У розділі :ref:`objects` зазначено, що об’єкти мають значення (крім типу та ідентичності). Значення об’єкта є досить абстрактним поняттям у Python: наприклад, не існує канонічного методу доступу до значення об’єкта. Крім того, немає вимоги, щоб значення об’єкта було сконструйовано певним чином, напр. складається з усіх своїх атрибутів даних. Оператори порівняння реалізують певне уявлення про цінність об’єкта. Можна думати про них як про визначення значення об’єкта опосередковано, за допомогою реалізації порівняння.

source: Because all types are (direct or indirect) subtypes of :class:`object`, they inherit the default comparison behavior from :class:`object`. Types can customize their comparison behavior by implementing :dfn:`rich comparison methods` like :meth:`__lt__`, described in :ref:`customization`.
uk: Оскільки всі типи є (прямими чи непрямими) підтипами :class:`object`, вони успадковують типову поведінку порівняння від :class:`object`. Типи можуть налаштувати свою поведінку порівняння, реалізувавши :dfn:`багаті методи порівняння`, такі як :meth:`__lt__`, описані в :ref:`customization`.

source: The default behavior for equality comparison (``==`` and ``!=``) is based on the identity of the objects. Hence, equality comparison of instances with the same identity results in equality, and equality comparison of instances with different identities results in inequality. A motivation for this default behavior is the desire that all objects should be reflexive (i.e. ``x is y`` implies ``x == y``).
uk: Поведінка за умовчанням для порівняння рівності (``==`` і ``!=``) базується на ідентичності об’єктів. Отже, порівняння рівності екземплярів з однаковою тотожністю призводить до рівності, а порівняння рівності екземплярів з різними ідентичністями призводить до нерівності. Мотивацією такої поведінки за замовчуванням є бажання, щоб усі об’єкти були рефлексивними (тобто ``x є y`` означає ``x == y``).

source: A default order comparison (``<``, ``>``, ``<=``, and ``>=``) is not provided; an attempt raises :exc:`TypeError`. A motivation for this default behavior is the lack of a similar invariant as for equality.
uk: Порівняння порядку за замовчуванням (``<``, ``>``, ``<=``, and ``> =``) не надається; спроба викликає :exc:`TypeError`. Мотивацією такої поведінки за замовчуванням є відсутність аналогічного інваріанта, як для рівності.

source: The behavior of the default equality comparison, that instances with different identities are always unequal, may be in contrast to what types will need that have a sensible definition of object value and value-based equality. Such types will need to customize their comparison behavior, and in fact, a number of built-in types have done that.
uk: Поведінка порівняння рівності за замовчуванням, тобто екземпляри з різними ідентифікаторами завжди нерівні, може відрізнятися від того, які типи потребуватимуть розумного визначення значення об’єкта та рівності на основі значення. Таким типам потрібно буде налаштувати свою поведінку порівняння, і насправді це зробили кілька вбудованих типів.

source: The following list describes the comparison behavior of the most important built-in types.
uk: У наведеному нижче списку описано поведінку порівняння найважливіших вбудованих типів.

source: Numbers of built-in numeric types (:ref:`typesnumeric`) and of the standard library types :class:`fractions.Fraction` and :class:`decimal.Decimal` can be compared within and across their types, with the restriction that complex numbers do not support order comparison. Within the limits of the types involved, they compare mathematically (algorithmically) correct without loss of precision.
uk: Числа вбудованих числових типів (:ref:`typesnumeric`) і стандартних бібліотечних типів :class:`fractions.Fraction` і :class:`decimal.Decimal` можна порівнювати всередині та між типами, з обмеженням що комплексні числа не підтримують порівняння порядку. У межах залучених типів вони порівнюють математично (алгоритмічно) правильно без втрати точності.

source: The not-a-number values ``float('NaN')`` and ``decimal.Decimal('NaN')`` are special. Any ordered comparison of a number to a not-a-number value is false. A counter-intuitive implication is that not-a-number values are not equal to themselves. For example, if ``x = float('NaN')``, ``3 < x``, ``x < 3`` and ``x == x`` are all false, while ``x != x`` is true. This behavior is compliant with IEEE 754.
uk: Нечислові значення ``float('NaN')`` і ``decimal.Decimal('NaN')`` є спеціальними. Будь-яке впорядковане порівняння числа з нечисловим значенням є хибним. Протиінтуїтивний висновок полягає в тому, що нечислові значення не дорівнюють самі собі. Наприклад, якщо ``x = float('NaN')``, ``3 < x``, ``x < 3`` і ``x == x`` є помилковими, тоді як ``x ! = x`` вірно. Така поведінка відповідає стандарту IEEE 754.

source: ``None`` and ``NotImplemented`` are singletons. :PEP:`8` advises that comparisons for singletons should always be done with ``is`` or ``is not``, never the equality operators.
uk: ``None`` і ``NotImplemented`` є одиночними елементами. :PEP:`8` радить, що порівняння одиночних елементів завжди слід виконувати за допомогою ``is`` або ``is not``, а не операторів рівності.

source: Binary sequences (instances of :class:`bytes` or :class:`bytearray`) can be compared within and across their types. They compare lexicographically using the numeric values of their elements.
uk: Двійкові послідовності (екземпляри :class:`bytes` або :class:`bytearray`) можна порівнювати всередині та між типами. Вони порівнюють лексикографічно, використовуючи числові значення своїх елементів.

source: Strings (instances of :class:`str`) compare lexicographically using the numerical Unicode code points (the result of the built-in function :func:`ord`) of their characters. [#]_
uk: Рядки (примірники :class:`str`) порівнюються лексикографічно за допомогою числових кодових точок Unicode (результат вбудованої функції :func:`ord`) їхніх символів. [#]_

source: Strings and binary sequences cannot be directly compared.
uk: Рядки та двійкові послідовності не можна безпосередньо порівнювати.

source: Sequences (instances of :class:`tuple`, :class:`list`, or :class:`range`) can be compared only within each of their types, with the restriction that ranges do not support order comparison. Equality comparison across these types results in inequality, and ordering comparison across these types raises :exc:`TypeError`.
uk: Послідовності (екземпляри :class:`tuple`, :class:`list` або :class:`range`) можна порівнювати лише в межах кожного зі своїх типів, з обмеженням, що діапазони не підтримують порівняння порядку. Порівняння рівності між цими типами призводить до нерівності, а впорядковане порівняння між цими типами викликає :exc:`TypeError`.

source: Sequences compare lexicographically using comparison of corresponding elements. The built-in containers typically assume identical objects are equal to themselves. That lets them bypass equality tests for identical objects to improve performance and to maintain their internal invariants.
uk: Послідовності порівнюють лексикографічно за допомогою порівняння відповідних елементів. Вбудовані контейнери зазвичай припускають, що ідентичні об’єкти рівні самі собі. Це дозволяє їм обійти тести на рівність для ідентичних об’єктів, щоб підвищити продуктивність і зберегти свої внутрішні інваріанти.

source: Lexicographical comparison between built-in collections works as follows:
uk: Лексикографічне порівняння між вбудованими колекціями працює таким чином:

source: For two collections to compare equal, they must be of the same type, have the same length, and each pair of corresponding elements must compare equal (for example, ``[1,2] == (1,2)`` is false because the type is not the same).
uk: Щоб дві колекції порівнювалися однаково, вони повинні бути одного типу, мати однакову довжину, і кожна пара відповідних елементів має порівнюватися однаковими (наприклад, ``[1,2] == (1,2)`` false, оскільки тип не той самий).

source: Collections that support order comparison are ordered the same as their first unequal elements (for example, ``[1,2,x] <= [1,2,y]`` has the same value as ``x <= y``). If a corresponding element does not exist, the shorter collection is ordered first (for example, ``[1,2] < [1,2,3]`` is true).
uk: Колекції, які підтримують порівняння порядку, упорядковуються так само, як і їхні перші нерівні елементи (наприклад, ``[1,2,x] <= [1,2,y]`` має те саме значення, що ``x <= y``). Якщо відповідний елемент не існує, коротша колекція впорядковується першою (наприклад, ``[1,2] < [1,2,3]`` є істинним).

source: Mappings (instances of :class:`dict`) compare equal if and only if they have equal `(key, value)` pairs. Equality comparison of the keys and values enforces reflexivity.
uk: Відображення (екземпляри :class:`dict`) порівнюються рівними тоді і тільки тоді, коли вони мають однакові пари `(ключ, значення)`. Порівняння рівності ключів і значень забезпечує рефлексивність.

source: Order comparisons (``<``, ``>``, ``<=``, and ``>=``) raise :exc:`TypeError`.
uk: Порівняння порядку (``<``, ``>``, ``<=``, and ``> =``) викликає :exc:`TypeError`.

source: Sets (instances of :class:`set` or :class:`frozenset`) can be compared within and across their types.
uk: Набори (екземпляри :class:`set` або :class:`frozenset`) можна порівнювати всередині та між типами.
