Repository: python/python-docs-uk
Catalog: reference/expressions.po
Languages: uk

source: They define order comparison operators to mean subset and superset tests. Those relations do not define total orderings (for example, the two sets ``{1,2}`` and ``{2,3}`` are not equal, nor subsets of one another, nor supersets of one another). Accordingly, sets are not appropriate arguments for functions which depend on total ordering (for example, :func:`min`, :func:`max`, and :func:`sorted` produce undefined results given a list of sets as inputs).
uk: Вони визначають оператори порівняння порядку, щоб означати тести підмножини та надмножини. Ці відносини не визначають загальних порядків (наприклад, дві множини ``{1,2}`` і ``{2,3}`` не є рівними, ані підмножини одна одної, ані надмножини одна одної). Відповідно, набори не є відповідними аргументами для функцій, які залежать від загального порядку (наприклад, :func:`min`, :func:`max` і :func:`sorted` дають невизначені результати, якщо ввести список наборів як вхідні дані) .

source: Comparison of sets enforces reflexivity of its elements.
uk: Порівняння множин посилює рефлексивність її елементів.

source: Most other built-in types have no comparison methods implemented, so they inherit the default comparison behavior.
uk: Більшість інших вбудованих типів не мають реалізованих методів порівняння, тому вони успадковують типову поведінку порівняння.

source: User-defined classes that customize their comparison behavior should follow some consistency rules, if possible:
uk: Визначені користувачем класи, які налаштовують свою поведінку порівняння, повинні дотримуватися деяких правил узгодженості, якщо це можливо:

source: Equality comparison should be reflexive. In other words, identical objects should compare equal:
uk: Порівняння рівності має бути рефлексивним. Іншими словами, ідентичні об'єкти повинні порівнюватися рівними:

source: ``x is y`` implies ``x == y``
uk: ``x є y`` означає ``x == y``

source: Comparison should be symmetric. In other words, the following expressions should have the same result:
uk: Порівняння має бути симетричним. Іншими словами, наступні вирази повинні мати однаковий результат:

source: ``x == y`` and ``y == x``
uk: ``x == y`` і ``y == x``

source: ``x != y`` and ``y != x``
uk: ``x != y`` і ``y != x``

source: Comparison should be transitive. The following (non-exhaustive) examples illustrate that:
uk: Порівняння має бути транзитивним. Наступні (невичерпні) приклади ілюструють це:

source: ``x > y and y > z`` implies ``x > z``
uk: ``x > y і y > z`` передбачає ``x > z``

source: ``x < y and y <= z`` implies ``x < z``
uk: ``x < y і y <= z`` передбачає ``x < z``

source: Inverse comparison should result in the boolean negation. In other words, the following expressions should have the same result:
uk: Зворотне порівняння має призвести до логічного заперечення. Іншими словами, наступні вирази повинні мати однаковий результат:

source: ``x == y`` and ``not x != y``
uk: ``x == y`` і ``не x != y``

source: ``x < y`` and ``not x >= y`` (for total ordering)
uk: ``x < y`` and ``not x > = y`` (для загального впорядкування)

source: ``x > y`` and ``not x <= y`` (for total ordering)
uk: ``x > y`` і ``not x <= y`` (для загального порядку)

source: The last two expressions apply to totally ordered collections (e.g. to sequences, but not to sets or mappings). See also the :func:`~functools.total_ordering` decorator.
uk: Останні два вирази застосовуються до повністю впорядкованих колекцій (наприклад, до послідовностей, але не до наборів чи відображень). Дивіться також декоратор :func:`~functools.total_ordering`.

source: The :func:`hash` result should be consistent with equality. Objects that are equal should either have the same hash value, or be marked as unhashable.
uk: Результат :func:`hash` має відповідати рівності. Рівні об’єкти повинні або мати однакове хеш-значення, або бути позначеними як нехешовані.

source: Python does not enforce these consistency rules. In fact, the not-a-number values are an example for not following these rules.
uk: Python не забезпечує виконання цих правил узгодженості. Фактично, нечислові значення є прикладом недотримання цих правил.

source: Membership test operations
uk: Тестові операції членства

source: The operators :keyword:`in` and :keyword:`not in` test for membership. ``x in s`` evaluates to ``True`` if *x* is a member of *s*, and ``False`` otherwise. ``x not in s`` returns the negation of ``x in s``. All built-in sequences and set types support this as well as dictionary, for which :keyword:`!in` tests whether the dictionary has a given key. For container types such as list, tuple, set, frozenset, dict, or collections.deque, the expression ``x in y`` is equivalent to ``any(x is e or x == e for e in y)``.
uk: Оператори :keyword:`in` і :keyword:`not in` перевіряють членство. ``x in s`` обчислюється як ``True``, якщо *x* є членом *s*, і ``False`` в іншому випадку. ``x not in s`` повертає заперечення ``x in s``. Усі вбудовані послідовності та типи наборів підтримують це, а також словник, для якого :keyword:`!in` перевіряє, чи має словник заданий ключ. Для типів контейнерів, таких як список, кортеж, набір, frozenset, dict або collections.deque, вираз ``x in y`` еквівалентний ``any(x is e or x == e for e in y)``.

source: For the string and bytes types, ``x in y`` is ``True`` if and only if *x* is a substring of *y*. An equivalent test is ``y.find(x) != -1``. Empty strings are always considered to be a substring of any other string, so ``"" in "abc"`` will return ``True``.
uk: Для типів рядків і байтів ``x в y`` є ``True`` тоді і тільки тоді, коли *x* є підрядком *y*. Еквівалентним тестом є ``y.find(x) != -1``. Порожні рядки завжди вважаються підрядками будь-яких інших рядків, тому ``"" у "abc`` поверне ``True``.

source: For user-defined classes which define the :meth:`__contains__` method, ``x in y`` returns ``True`` if ``y.__contains__(x)`` returns a true value, and ``False`` otherwise.
uk: Для визначених користувачем класів, які визначають метод :meth:`__contains__`, ``x in y`` повертає ``True``, якщо ``y.__contains__(x)`` повертає істинне значення, і ``False`` інакше.

source: For user-defined classes which do not define :meth:`__contains__` but do define :meth:`__iter__`, ``x in y`` is ``True`` if some value ``z``, for which the expression ``x is z or x == z`` is true, is produced while iterating over ``y``. If an exception is raised during the iteration, it is as if :keyword:`in` raised that exception.
uk: Для визначених користувачем класів, які не визначають :meth:`__contains__`, але визначають :meth:`__iter__`, ``x в y`` є ``True``, якщо деяке значення ``z``, для якого вираз ``x є z або x == z`` є істинним, створюється під час повторення ``y``. Якщо під час ітерації виникає виняток, це ніби :keyword:`in` викликав цей виняток.

source: Lastly, the old-style iteration protocol is tried: if a class defines :meth:`__getitem__`, ``x in y`` is ``True`` if and only if there is a non-negative integer index *i* such that ``x is y[i] or x == y[i]``, and no lower integer index raises the :exc:`IndexError` exception. (If any other exception is raised, it is as if :keyword:`in` raised that exception).
uk: Нарешті, випробувано старий протокол ітерації: якщо клас визначає :meth:`__getitem__`, ``x in y`` є ``True`` тоді і тільки тоді, коли існує невід’ємне ціле число *i* таким чином, що ``x є y[i] або x == y[i]``, і жоден нижній цілий індекс не викликає виключення :exc:`IndexError`. (Якщо виникає будь-який інший виняток, це ніби :keyword:`in` викликав цей виняток).

source: The operator :keyword:`not in` is defined to have the inverse truth value of :keyword:`in`.
uk: Оператор :keyword:`not in` визначено таким, що має зворотне значення істинності :keyword:`in`.

source: Identity comparisons
uk: Порівняння тотожності

source: The operators :keyword:`is` and :keyword:`is not` test for an object's identity: ``x is y`` is true if and only if *x* and *y* are the same object. An Object's identity is determined using the :meth:`id` function. ``x is not y`` yields the inverse truth value. [#]_
uk: Оператори :keyword:`is` і :keyword:`is not` перевіряють ідентичність об’єкта: ``x is y`` є істинним тоді і тільки тоді, коли *x* і *y* є одним і тим же об’єктом. Ідентичність об’єкта визначається за допомогою функції :meth:`id`. "x не є y" дає зворотне значення істинності. [#]_

source: Boolean operations
uk: Логічні операції

source: In the context of Boolean operations, and also when expressions are used by control flow statements, the following values are interpreted as false: ``False``, ``None``, numeric zero of all types, and empty strings and containers (including strings, tuples, lists, dictionaries, sets and frozensets). All other values are interpreted as true. User-defined objects can customize their truth value by providing a :meth:`__bool__` method.
uk: У контексті логічних операцій, а також коли вирази використовуються операторами потоку керування, такі значення інтерпретуються як false: ``False``, ``None``, числові нулі всіх типів, а також порожні рядки та контейнери ( включаючи рядки, кортежі, списки, словники, набори та заморожені набори). Усі інші значення інтерпретуються як істинні. Визначені користувачем об’єкти можуть налаштувати своє значення істинності, надаючи метод :meth:`__bool__`.

source: The operator :keyword:`not` yields ``True`` if its argument is false, ``False`` otherwise.
uk: Оператор :keyword:`not` видає ``True``, якщо його аргумент false, ``False`` в іншому випадку.

source: The expression ``x and y`` first evaluates *x*; if *x* is false, its value is returned; otherwise, *y* is evaluated and the resulting value is returned.
uk: Вираз ``x і y`` спочатку обчислює *x*; якщо *x* false, повертається його значення; інакше обчислюється *y* і повертається отримане значення.

source: The expression ``x or y`` first evaluates *x*; if *x* is true, its value is returned; otherwise, *y* is evaluated and the resulting value is returned.
uk: Вираз ``x або y`` спочатку обчислює *x*; якщо *x* істинне, повертається його значення; інакше обчислюється *y* і повертається отримане значення.

source: Note that neither :keyword:`and` nor :keyword:`or` restrict the value and type they return to ``False`` and ``True``, but rather return the last evaluated argument. This is sometimes useful, e.g., if ``s`` is a string that should be replaced by a default value if it is empty, the expression ``s or 'foo'`` yields the desired value. Because :keyword:`not` has to create a new value, it returns a boolean value regardless of the type of its argument (for example, ``not 'foo'`` produces ``False`` rather than ``''``.)
uk: Зауважте, що ані :keyword:`and`, ані :keyword:`or` не обмежують значення та тип, які вони повертають, значеннями ``False`` і ``True``, а радше повертають останній оцінений аргумент. Це іноді корисно, наприклад, якщо ``s`` є рядком, який слід замінити значенням за замовчуванням, якщо він порожній, вираз ``s або 'foo'`` дає потрібне значення. Оскільки :keyword:`not` має створити нове значення, воно повертає логічне значення незалежно від типу свого аргументу (наприклад, ``not 'foo'`` створює ``False``, а не ``''`` .)

source: Assignment expressions
uk: Вирази присвоєння

source: An assignment expression (sometimes also called a "named expression" or "walrus") assigns an :token:`~python-grammar:expression` to an :token:`~python-grammar:identifier`, while also returning the value of the :token:`~python-grammar:expression`.
uk: Вираз присвоєння (іноді його також називають "іменованим виразом" або "моржем") призначає :token:`~python-grammar:expression` :token:`~python-grammar:identifier`, а також повертає значення :token:`~python-grammar:expression`.

source: One common use case is when handling matched regular expressions:
uk: Одним із поширених випадків використання є обробка зіставлених регулярних виразів:

source: Or, when processing a file stream in chunks:
uk: Або при обробці потоку файлів у частинах:

source: See :pep:`572` for more details about assignment expressions.
uk: Перегляньте :pep:`572` для отримання додаткової інформації про вирази присвоєння.

source: Conditional expressions
uk: Умовні вирази

source: Conditional expressions (sometimes called a "ternary operator") have the lowest priority of all Python operations.
uk: Умовні вирази (іноді їх називають "потрійним оператором") мають найнижчий пріоритет з усіх операцій Python.

source: The expression ``x if C else y`` first evaluates the condition, *C* rather than *x*. If *C* is true, *x* is evaluated and its value is returned; otherwise, *y* is evaluated and its value is returned.
uk: Вираз x if C else y спочатку обчислює умову *C*, а не *x*. Якщо *C* істинне, *x* обчислюється і повертається його значення; інакше обчислюється *y* і повертається його значення.

source: See :pep:`308` for more details about conditional expressions.
uk: Перегляньте :pep:`308` для отримання додаткової інформації про умовні вирази.

source: Lambdas
uk: Лямбда

source: Lambda expressions (sometimes called lambda forms) are used to create anonymous functions. The expression ``lambda parameters: expression`` yields a function object. The unnamed object behaves like a function object defined with:
uk: Лямбда-вирази (іноді їх називають лямбда-формами) використовуються для створення анонімних функцій. Вираз ``параметри лямбда: вираз`` дає об’єкт функції. Безіменний об’єкт поводиться як об’єкт-функція, визначений за допомогою:

source: See section :ref:`function` for the syntax of parameter lists. Note that functions created with lambda expressions cannot contain statements or annotations.
uk: Перегляньте розділ :ref:`function` для синтаксису списків параметрів. Зауважте, що функції, створені за допомогою лямбда-виразів, не можуть містити оператори чи анотації.

source: Expression lists
uk: Списки виразів

source: Except when part of a list or set display, an expression list containing at least one comma yields a tuple. The length of the tuple is the number of expressions in the list. The expressions are evaluated from left to right.
uk: За винятком випадків, коли є частиною списку або відображення набору, список виразів, що містить принаймні одну кому, дає кортеж. Довжина кортежу — це кількість виразів у списку. Вирази обчислюються зліва направо.

source: An asterisk ``*`` denotes :dfn:`iterable unpacking`. Its operand must be an :term:`iterable`. The iterable is expanded into a sequence of items, which are included in the new tuple, list, or set, at the site of the unpacking.
uk: Зірочка ``*`` позначає :dfn:`iterable unpacking`. Його операнд має бути :term:`iterable`. Ітерація розгортається в послідовність елементів, які включені в новий кортеж, список або набір на місці розпакування.

source: Iterable unpacking in expression lists, originally proposed by :pep:`448`.
uk: Ітераційне розпакування в списках виразів, спочатку запропоноване :pep:`448`.

source: The trailing comma is required only to create a single tuple (a.k.a. a *singleton*); it is optional in all other cases. A single expression without a trailing comma doesn't create a tuple, but rather yields the value of that expression. (To create an empty tuple, use an empty pair of parentheses: ``()``.)
uk: Кінцева кома потрібна лише для створення одного кортежу (він же *singleton*); у всіх інших випадках це необов'язково. Один вираз без кінцевої коми не створює кортеж, а скоріше видає значення цього виразу. (Щоб створити порожній кортеж, використовуйте порожню пару круглих дужок: ``()``.)

source: Evaluation order
uk: Порядок оцінювання

source: Python evaluates expressions from left to right. Notice that while evaluating an assignment, the right-hand side is evaluated before the left-hand side.
uk: Python обчислює вирази зліва направо. Зауважте, що під час оцінювання завдання права частина оцінюється перед лівою.

source: In the following lines, expressions will be evaluated in the arithmetic order of their suffixes::
uk: У наступних рядках вирази обчислюватимуться в арифметичному порядку їх суфіксів:

source: Operator precedence
uk: Пріоритет оператора

source: The following table summarizes the operator precedence in Python, from highest precedence (most binding) to lowest precedence (least binding). Operators in the same box have the same precedence. Unless the syntax is explicitly given, operators are binary. Operators in the same box group left to right (except for exponentiation, which groups from right to left).
uk: У наведеній нижче таблиці підсумовано пріоритет операторів у Python від найвищого пріоритету (найбільш обов’язковий) до найнижчого пріоритету (найменший обов’язковий). Оператори в одному полі мають однаковий пріоритет. Якщо синтаксис не задано явно, оператори є двійковими. Оператори в одному полі групуються зліва направо (за винятком піднесення до степеня, яке групується справа наліво).

source: Note that comparisons, membership tests, and identity tests, all have the same precedence and have a left-to-right chaining feature as described in the :ref:`comparisons` section.
uk: Зауважте, що порівняння, тести на приналежність і тести ідентичності мають однаковий пріоритет і функцію ланцюжка зліва направо, як описано в розділі :ref:`comparisons`.

source: Operator
uk: Оператор

source: Description
uk: опис

source: ``(expressions...)``,
uk: ``(вирази...)``,

source: ``[expressions...]``, ``{key: value...}``, ``{expressions...}``
uk: ``[вирази...]``, ``{ключ: значення...}``, ``{вирази...}``

source: Binding or parenthesized expression, list display, dictionary display, set display
uk: Прив’язка або вираз у дужках, відображення списку, відображення словника, відображення набору

source: Subscription, slicing, call, attribute reference
uk: Підписка, нарізка, виклик, посилання на атрибути

source: Exponentiation [#]_
uk: Піднесення до степеня [#]_

source: Positive, negative, bitwise NOT
uk: Позитивне, негативне, побітове НІ

source: Multiplication, matrix multiplication, division, floor division, remainder [#]_
uk: Множення, матричне множення, ділення, поверхове ділення, залишок [#]_

source: Addition and subtraction
uk: Додавання і віднімання

source: Shifts
uk: Зміни

source: Bitwise AND
uk: Побітове І

source: Bitwise XOR
uk: Побітове XOR

source: Bitwise OR
uk: Порозрядне АБО

source: Comparisons, including membership tests and identity tests
uk: Порівняння, включаючи тести на приналежність і тести на ідентифікацію

source: Boolean NOT
uk: Логічне НІ

source: Boolean AND
uk: Логічне І

source: Boolean OR
uk: Логічне АБО

source: Conditional expression
uk: Умовний вираз

source: Lambda expression
uk: Лямбда-вираз

source: Assignment expression
uk: Вираз присвоєння

source: Footnotes
uk: Виноски

source: While ``abs(x%y) < abs(y)`` is true mathematically, for floats it may not be true numerically due to roundoff. For example, and assuming a platform on which a Python float is an IEEE 754 double-precision number, in order that ``-1e-100 % 1e100`` have the same sign as ``1e100``, the computed result is ``-1e-100 + 1e100``, which is numerically exactly equal to ``1e100``. The function :func:`math.fmod` returns a result whose sign matches the sign of the first argument instead, and so returns ``-1e-100`` in this case. Which approach is more appropriate depends on the application.
uk: У той час як ``abs(x%y) < abs(y)`` є істинним математично, для чисельних чисел це може не бути істинним через округлення. Наприклад, якщо припустити, що платформа Python з плаваючою точкою є числом подвійної точності IEEE 754, для того, щоб ``-1e-100 % 1e100`` мали той самий знак, що ``1e100``, обчислений результат буде ``-1e-100 + 1e100``, що чисельно точно дорівнює ``1e100``. Функція :func:`math.fmod` повертає результат, знак якого збігається зі знаком першого аргументу, і тому в цьому випадку повертає ``-1e-100``. Який підхід є більш доцільним, залежить від програми.

source: If x is very close to an exact integer multiple of y, it's possible for ``x//y`` to be one larger than ``(x-x%y)//y`` due to rounding. In such cases, Python returns the latter result, in order to preserve that ``divmod(x,y)[0] * y + x % y`` be very close to ``x``.
uk: Якщо x дуже близький до точного цілого числа, кратного y, через округлення ``x//y`` може бути на одиницю більшим за ``(x-x%y)//y``. У таких випадках Python повертає останній результат, щоб зберегти те, що ``divmod(x,y)[0] * y + x % y`` буде дуже близьким до ``x``.

source: The Unicode standard distinguishes between :dfn:`code points` (e.g. U+0041) and :dfn:`abstract characters` (e.g. "LATIN CAPITAL LETTER A"). While most abstract characters in Unicode are only represented using one code point, there is a number of abstract characters that can in addition be represented using a sequence of more than one code point. For example, the abstract character "LATIN CAPITAL LETTER C WITH CEDILLA" can be represented as a single :dfn:`precomposed character` at code position U+00C7, or as a sequence of a :dfn:`base character` at code position U+0043 (LATIN CAPITAL LETTER C), followed by a :dfn:`combining character` at code position U+0327 (COMBINING CEDILLA).
uk: Стандарт Unicode розрізняє :dfn:`code points` (наприклад, U+0041) і :dfn:`abstract characters` (наприклад, "ЛАТИНСЬКА ВЕЛИКА ЛІТЕРА A"). У той час як більшість абстрактних символів у Unicode представлено лише за допомогою однієї кодової точки, існує ряд абстрактних символів, які, крім того, можуть бути представлені за допомогою послідовності з кількох кодових точок. Наприклад, абстрактний символ "ВЕЛИКА ЛАТИНСЬКА ЛІТЕРА C З ЦЕДІЛЬЄЮ" може бути представлений як один :dfn:`precomposed character` у позиції коду U+00C7 або як послідовність :dfn:`base character` у позиції коду U+0043 (ВЕЛИКА ЛАТИНСЬКА ЛІТЕРА C), за якою йде :dfn:`combining character` у позиції коду U+0327 (КОМБІНУЮЧА CEDILLA).

source: The comparison operators on strings compare at the level of Unicode code points. This may be counter-intuitive to humans. For example, ``"\u00C7" == "\u0043\u0327"`` is ``False``, even though both strings represent the same abstract character "LATIN CAPITAL LETTER C WITH CEDILLA".
uk: Оператори порівняння рядків порівнюються на рівні кодових точок Unicode. Людям це може бути не зрозуміло. Наприклад, ``"\u00C7" == "\u0043\u0327"`` є ``False``, навіть якщо обидва рядки представляють той самий абстрактний символ "ЛАТИНСЬКА ВЕЛИКА ЛІТЕРА C З ЦЕДІЛЬЄЮ".

source: To compare strings at the level of abstract characters (that is, in a way intuitive to humans), use :func:`unicodedata.normalize`.
uk: Щоб порівняти рядки на рівні абстрактних символів (тобто інтуїтивно зрозумілим людям), використовуйте :func:`unicodedata.normalize`.

source: Due to automatic garbage-collection, free lists, and the dynamic nature of descriptors, you may notice seemingly unusual behaviour in certain uses of the :keyword:`is` operator, like those involving comparisons between instance methods, or constants. Check their documentation for more info.
uk: Завдяки автоматичному збиранню сміття, вільним спискам і динамічній природі дескрипторів ви можете помітити, здавалося б, незвичайну поведінку в певних випадках використання оператора :keyword:`is`, як-от порівняння між методами екземплярів або константами. Щоб дізнатися більше, перегляньте їхню документацію.

source: The power operator ``**`` binds less tightly than an arithmetic or bitwise unary operator on its right, that is, ``2**-1`` is ``0.5``.
uk: Оператор степені ``**`` прив’язує менш тісно, ніж арифметичний або порозрядний унарний оператор справа, тобто ``2**-1`` дорівнює ``0,5``.

source: The ``%`` operator is also used for string formatting; the same precedence applies.
uk: Оператор ``%`` також використовується для форматування рядків; застосовується той самий пріоритет.
