Repository: python/python-docs-uk
Catalog: reference/expressions.po
Languages: uk

source: Returns an awaitable that raises an exception of type ``type`` at the point where the asynchronous generator was paused, and returns the next value yielded by the generator function as the value of the raised :exc:`StopIteration` exception. If the asynchronous generator exits without yielding another value, a :exc:`StopAsyncIteration` exception is raised by the awaitable. If the generator function does not catch the passed-in exception, or raises a different exception, then when the awaitable is run that exception propagates to the caller of the awaitable.
uk: Повертає awaitable, який викликає виняток типу ``type`` у точці, де асинхронний генератор було призупинено, і повертає наступне значення, отримане функцією генератора як значення викликаного винятку :exc:`StopIteration`. Якщо асинхронний генератор завершує роботу, не видаючи іншого значення, очікуваний виклик викликає виняток :exc:`StopAsyncIteration`. Якщо функція генератора не перехоплює переданий виняток або викликає інший виняток, тоді, коли виконується очікуваний, цей виняток поширюється на виклик очікуваного.

source: Returns an awaitable that when run will throw a :exc:`GeneratorExit` into the asynchronous generator function at the point where it was paused. If the asynchronous generator function then exits gracefully, is already closed, or raises :exc:`GeneratorExit` (by not catching the exception), then the returned awaitable will raise a :exc:`StopIteration` exception. Any further awaitables returned by subsequent calls to the asynchronous generator will raise a :exc:`StopAsyncIteration` exception. If the asynchronous generator yields a value, a :exc:`RuntimeError` is raised by the awaitable. If the asynchronous generator raises any other exception, it is propagated to the caller of the awaitable. If the asynchronous generator has already exited due to an exception or normal exit, then further calls to :meth:`aclose` will return an awaitable that does nothing.
uk: Повертає awaitable, який під час виконання видає :exc:`GeneratorExit` у функцію асинхронного генератора в точці, де її було призупинено. Якщо функція асинхронного генератора завершує роботу належним чином, уже закрита або викликає :exc:`GeneratorExit` (не перехоплюючи виняток), тоді повернутий awaitable викличе виняток :exc:`StopIteration`. Будь-які подальші очікування, повернуті наступними викликами асинхронного генератора, викличуть виняток :exc:`StopAsyncIteration`. Якщо асинхронний генератор видає значення, awaitable викликає :exc:`RuntimeError`. Якщо асинхронний генератор викликає будь-який інший виняток, він поширюється на виклик очікуваного. Якщо асинхронний генератор уже завершив роботу через виняток або звичайний вихід, тоді подальші виклики :meth:`aclose` повернуть очікуваний, який нічого не робить.

source: Primaries
uk: Праймеріз

source: Primaries represent the most tightly bound operations of the language. Their syntax is:
uk: Основні представляють найбільш тісно зв'язані операції мови. Їх синтаксис:

source: Attribute references
uk: Посилання на атрибути

source: An attribute reference is a primary followed by a period and a name:
uk: Посилання на атрибут є основним, за яким йдуть крапка та ім’я:

source: The primary must evaluate to an object of a type that supports attribute references, which most objects do. This object is then asked to produce the attribute whose name is the identifier. This production can be customized by overriding the :meth:`__getattr__` method. If this attribute is not available, the exception :exc:`AttributeError` is raised. Otherwise, the type and value of the object produced is determined by the object. Multiple evaluations of the same attribute reference may yield different objects.
uk: Первинний має обчислювати об’єкт типу, який підтримує посилання на атрибути, що більшість об’єктів підтримує. Потім цього об’єкта просять створити атрибут, ім’я якого є ідентифікатором. Цю продукцію можна налаштувати, замінивши метод :meth:`__getattr__`. Якщо цей атрибут недоступний, виникає виняток :exc:`AttributeError`. В іншому випадку тип і вартість виробленого об'єкта визначаються об'єктом. Кілька оцінок одного посилання на атрибути можуть давати різні об’єкти.

source: Subscriptions
uk: Підписки

source: The subscription of an instance of a :ref:`container class <sequence-types>` will generally select an element from the container. The subscription of a :term:`generic class <generic type>` will generally return a :ref:`GenericAlias <types-genericalias>` object.
uk: Підписка екземпляра :ref:`класу контейнера <sequence-types>` зазвичай вибирає елемент із контейнера. Підписка :term:`загального класу <generic type>` зазвичай повертатиме об’єкт :ref:`GenericAlias <types-genericalias>`.

source: When an object is subscripted, the interpreter will evaluate the primary and the expression list.
uk: Коли об’єкт має індекс, інтерпретатор обчислить основний і список виразів.

source: The primary must evaluate to an object that supports subscription. An object may support subscription through defining one or both of :meth:`~object.__getitem__` and :meth:`~object.__class_getitem__`. When the primary is subscripted, the evaluated result of the expression list will be passed to one of these methods. For more details on when ``__class_getitem__`` is called instead of ``__getitem__``, see :ref:`classgetitem-versus-getitem`.
uk: Основний має обчислювати об’єкт, який підтримує підписку. Об’єкт може підтримувати підписку через визначення одного або обох :meth:`~object.__getitem__` і :meth:`~object.__class_getitem__`. Коли основний має індекс, обчислений результат списку виразів буде передано одному з цих методів. Щоб дізнатися більше про те, коли ``__class_getitem__`` викликається замість ``__getitem__``, перегляньте :ref:`classgetitem-versus-getitem`.

source: If the expression list contains at least one comma, it will evaluate to a :class:`tuple` containing the items of the expression list. Otherwise, the expression list will evaluate to the value of the list's sole member.
uk: Якщо список виразів містить принаймні одну кому, він обчислиться як :class:`tuple`, що містить елементи списку виразів. В іншому випадку список виразів обчислюватиметься значенням єдиного члена списку.

source: For built-in objects, there are two types of objects that support subscription via :meth:`~object.__getitem__`:
uk: Для вбудованих об’єктів є два типи об’єктів, які підтримують підписку через :meth:`~object.__getitem__`:

source: Mappings. If the primary is a :term:`mapping`, the expression list must evaluate to an object whose value is one of the keys of the mapping, and the subscription selects the value in the mapping that corresponds to that key. An example of a builtin mapping class is the :class:`dict` class.
uk: Відображення. Якщо основним є :term:`mapping`, список виразів має обчислювати об’єкт, значення якого є одним із ключів відображення, а підписка вибирає значення у відображенні, яке відповідає цьому ключу. Прикладом вбудованого класу відображення є клас :class:`dict`.

source: Sequences. If the primary is a :term:`sequence`, the expression list must evaluate to an :class:`int` or a :class:`slice` (as discussed in the following section). Examples of builtin sequence classes include the :class:`str`, :class:`list` and :class:`tuple` classes.
uk: Послідовності. Якщо основним є :term:`sequence`, список виразів має обчислюватися як :class:`int` або :class:`slice` (як описано в наступному розділі). Приклади вбудованих класів послідовності включають класи :class:`str`, :class:`list` і :class:`tuple`.

source: The formal syntax makes no special provision for negative indices in :term:`sequences <sequence>`. However, built-in sequences all provide a :meth:`~object.__getitem__` method that interprets negative indices by adding the length of the sequence to the index so that, for example, ``x[-1]`` selects the last item of ``x``. The resulting value must be a nonnegative integer less than the number of items in the sequence, and the subscription selects the item whose index is that value (counting from zero). Since the support for negative indices and slicing occurs in the object's :meth:`__getitem__` method, subclasses overriding this method will need to explicitly add that support.
uk: Формальний синтаксис не містить спеціальних положень щодо від’ємних індексів у :term:`послідовностях <sequence>`. Однак усі вбудовані послідовності забезпечують метод :meth:`~object.__getitem__`, який інтерпретує негативні індекси, додаючи довжину послідовності до індексу, щоб, наприклад, ``x[-1]`` вибирати останній елемент ``x``. Отримане значення має бути невід’ємним цілим числом, меншим за кількість елементів у послідовності, і підписка вибирає елемент, індекс якого є цим значенням (відлік від нуля). Оскільки підтримка негативних індексів і нарізки відбувається в методі :meth:`__getitem__` об’єкта, підкласи, які замінюють цей метод, повинні будуть явно додати цю підтримку.

source: A :class:`string <str>` is a special kind of sequence whose items are *characters*. A character is not a separate data type but a string of exactly one character.
uk: :class:`string <str>` — це особливий вид послідовності, елементами якої є *символи*. Символ — це не окремий тип даних, а рядок із рівно одного символу.

source: Slicings
uk: Нарізки

source: A slicing selects a range of items in a sequence object (e.g., a string, tuple or list). Slicings may be used as expressions or as targets in assignment or :keyword:`del` statements. The syntax for a slicing:
uk: Нарізка вибирає діапазон елементів в об’єкті послідовності (наприклад, рядок, кортеж або список). Зрізи можуть використовуватися як вирази або як цілі в операторах призначення або :keyword:`del`. Синтаксис нарізки:

source: There is ambiguity in the formal syntax here: anything that looks like an expression list also looks like a slice list, so any subscription can be interpreted as a slicing. Rather than further complicating the syntax, this is disambiguated by defining that in this case the interpretation as a subscription takes priority over the interpretation as a slicing (this is the case if the slice list contains no proper slice).
uk: Тут існує неоднозначність у формальному синтаксисі: все, що виглядає як список виразів, також виглядає як список фрагментів, тому будь-яку підписку можна інтерпретувати як фрагмент. Замість подальшого ускладнення синтаксису, це усувається визначенням того, що в цьому випадку інтерпретація як підписка має пріоритет над інтерпретацією як нарізка (це випадок, якщо список зрізів не містить належного зрізу).

source: The semantics for a slicing are as follows. The primary is indexed (using the same :meth:`__getitem__` method as normal subscription) with a key that is constructed from the slice list, as follows. If the slice list contains at least one comma, the key is a tuple containing the conversion of the slice items; otherwise, the conversion of the lone slice item is the key. The conversion of a slice item that is an expression is that expression. The conversion of a proper slice is a slice object (see section :ref:`types`) whose :attr:`~slice.start`, :attr:`~slice.stop` and :attr:`~slice.step` attributes are the values of the expressions given as lower bound, upper bound and stride, respectively, substituting ``None`` for missing expressions.
uk: Семантика нарізки така. Основний індексується (використовуючи той самий метод :meth:`__getitem__`, що й звичайна підписка) за допомогою ключа, створеного зі списку фрагментів, як показано нижче. Якщо список фрагментів містить принаймні одну кому, ключ є кортежем, що містить перетворення елементів фрагмента; в іншому випадку ключовим є перетворення елемента окремого фрагмента. Перетворення елемента фрагмента, який є виразом, є цим виразом. Перетворення правильного фрагмента є об’єктом фрагмента (див. розділ :ref:`types`), у якого :attr:`~slice.start`, :attr:`~slice.stop` і :attr:`~slice.step` Атрибути — це значення виразів, поданих як нижня межа, верхня межа та крок, відповідно, замінюючи відсутні вирази на ``None``.

source: Calls
uk: Дзвінки

source: A call calls a callable object (e.g., a :term:`function`) with a possibly empty series of :term:`arguments <argument>`:
uk: Виклик викликає об’єкт, який можна викликати (наприклад, :term:`function`) з можливо порожньою серією :term:`аргументів <argument>`:

source: An optional trailing comma may be present after the positional and keyword arguments but does not affect the semantics.
uk: Необов’язкова кінцева кома може бути присутнім після позиційних і ключових аргументів, але не впливає на семантику.

source: The primary must evaluate to a callable object (user-defined functions, built-in functions, methods of built-in objects, class objects, methods of class instances, and all objects having a :meth:`__call__` method are callable). All argument expressions are evaluated before the call is attempted. Please refer to section :ref:`function` for the syntax of formal :term:`parameter` lists.
uk: Основний має обчислювати об’єкт, який можна викликати (визначені користувачем функції, вбудовані функції, методи вбудованих об’єктів, об’єкти класу, методи екземплярів класу та всі об’єкти, що мають метод :meth:`__call__`, є викликаними). Усі вирази аргументів оцінюються перед спробою виклику. Зверніться до розділу :ref:`function` щодо синтаксису формальних списків :term:`parameter`.

source: An implementation may provide built-in functions whose positional parameters do not have names, even if they are 'named' for the purpose of documentation, and which therefore cannot be supplied by keyword. In CPython, this is the case for functions implemented in C that use :c:func:`PyArg_ParseTuple` to parse their arguments.
uk: Реалізація може надавати вбудовані функції, чиї позиційні параметри не мають імен, навіть якщо вони "іменовані" з метою документації, і які, отже, не можуть бути надані за ключовими словами. У CPython це стосується функцій, реалізованих у C, які використовують :c:func:`PyArg_ParseTuple` для аналізу своїх аргументів.

source: If there are more positional arguments than there are formal parameter slots, a :exc:`TypeError` exception is raised, unless a formal parameter using the syntax ``*identifier`` is present; in this case, that formal parameter receives a tuple containing the excess positional arguments (or an empty tuple if there were no excess positional arguments).
uk: Якщо позиційних аргументів більше, ніж слотів формальних параметрів, виникає виняток :exc:`TypeError`, якщо не існує формального параметра, що використовує синтаксис ``*identifier``; у цьому випадку формальний параметр отримує кортеж, що містить зайві позиційні аргументи (або порожній кортеж, якщо надлишкових позиційних аргументів не було).

source: If any keyword argument does not correspond to a formal parameter name, a :exc:`TypeError` exception is raised, unless a formal parameter using the syntax ``**identifier`` is present; in this case, that formal parameter receives a dictionary containing the excess keyword arguments (using the keywords as keys and the argument values as corresponding values), or a (new) empty dictionary if there were no excess keyword arguments.
uk: Якщо будь-який аргумент ключового слова не відповідає офіційній назві параметра, виникає виняток :exc:`TypeError`, якщо не існує формального параметра, що використовує синтаксис ``**ідентифікатор``; у цьому випадку формальний параметр отримує словник, що містить надлишкові аргументи ключового слова (з використанням ключових слів як ключів і значень аргументів як відповідних значень), або (новий) порожній словник, якщо не було надлишкових аргументів ключового слова.

source: If the syntax ``*expression`` appears in the function call, ``expression`` must evaluate to an :term:`iterable`. Elements from these iterables are treated as if they were additional positional arguments. For the call ``f(x1, x2, *y, x3, x4)``, if *y* evaluates to a sequence *y1*, ..., *yM*, this is equivalent to a call with M+4 positional arguments *x1*, *x2*, *y1*, ..., *yM*, *x3*, *x4*.
uk: Якщо у виклику функції з’являється синтаксис ``*expression``, ``expression`` має обчислюватися як :term:`iterable`. Елементи з цих ітерованих елементів розглядаються як додаткові позиційні аргументи. Для виклику ``f(x1, x2, *y, x3, x4)``, якщо *y* обчислюється як послідовність *y1*, ..., *yM*, це еквівалентно виклику з M+ 4 позиційні аргументи *x1*, *x2*, *y1*, ..., *yM*, *x3*, *x4*.

source: A consequence of this is that although the ``*expression`` syntax may appear *after* explicit keyword arguments, it is processed *before* the keyword arguments (and any ``**expression`` arguments -- see below). So::
uk: Наслідком цього є те, що хоча синтаксис ``*виразу`` може з’явитися *після* явних аргументів ключового слова, він обробляється *перед* аргументами ключового слова (та будь-якими аргументами ``**виразу`` – див. нижче). Тому::

source: If the syntax ``**expression`` appears in the function call, ``expression`` must evaluate to a :term:`mapping`, the contents of which are treated as additional keyword arguments. If a keyword is already present (as an explicit keyword argument, or from another unpacking), a :exc:`TypeError` exception is raised.
uk: Якщо у виклику функції з’являється синтаксис ``**expression``, ``expression`` має обчислювати :term:`mapping`, вміст якого розглядається як додаткові аргументи ключового слова. Якщо ключове слово вже присутнє (як явний аргумент ключового слова або з іншого розпакування), виникає виняток :exc:`TypeError`.

source: Formal parameters using the syntax ``*identifier`` or ``**identifier`` cannot be used as positional argument slots or as keyword argument names.
uk: Формальні параметри, що використовують синтаксис ``*ідентифікатор`` або ``**ідентифікатор``, не можуть використовуватися як слоти позиційних аргументів або як імена аргументів ключових слів.

source: Function calls accept any number of ``*`` and ``**`` unpackings, positional arguments may follow iterable unpackings (``*``), and keyword arguments may follow dictionary unpackings (``**``). Originally proposed by :pep:`448`.
uk: Виклики функцій приймають будь-яку кількість розпакувань ``*`` і ``**``, позиційні аргументи можуть слідувати за ітерованими розпакуваннями (``*``), а аргументи ключових слів можуть слідувати за розпакуваннями словника (``**``). Спочатку запропоновано :pep:`448`.

source: A call always returns some value, possibly ``None``, unless it raises an exception. How this value is computed depends on the type of the callable object.
uk: Виклик завжди повертає певне значення, можливо, ``None``, якщо тільки це не викликає виняткову ситуацію. Спосіб обчислення цього значення залежить від типу викликаного об’єкта.

source: If it is---
uk: Якщо це---

source: a user-defined function:
uk: функція, визначена користувачем:

source: The code block for the function is executed, passing it the argument list. The first thing the code block will do is bind the formal parameters to the arguments; this is described in section :ref:`function`. When the code block executes a :keyword:`return` statement, this specifies the return value of the function call.
uk: Блок коду для функції виконується, передаючи їй список аргументів. Перше, що зробить блок коду, це прив’яже формальні параметри до аргументів; це описано в розділі :ref:`function`. Коли блок коду виконує оператор :keyword:`return`, це визначає значення, що повертається викликом функції.

source: a built-in function or method:
uk: вбудована функція або метод:

source: The result is up to the interpreter; see :ref:`built-in-funcs` for the descriptions of built-in functions and methods.
uk: Результат залежить від перекладача; див. :ref:`built-in-funcs` для опису вбудованих функцій і методів.

source: a class object:
uk: об'єкт класу:

source: A new instance of that class is returned.
uk: Повертається новий екземпляр цього класу.

source: a class instance method:
uk: метод екземпляра класу:

source: The corresponding user-defined function is called, with an argument list that is one longer than the argument list of the call: the instance becomes the first argument.
uk: Викликається відповідна функція, визначена користувачем, зі списком аргументів, який на один довший за список аргументів виклику: екземпляр стає першим аргументом.

source: a class instance:
uk: екземпляр класу:

source: The class must define a :meth:`__call__` method; the effect is then the same as if that method was called.
uk: Клас повинен визначати метод :meth:`__call__`; тоді ефект буде таким самим, якби цей метод був викликаний.

source: Await expression
uk: Очікуйте вираження

source: Suspend the execution of :term:`coroutine` on an :term:`awaitable` object. Can only be used inside a :term:`coroutine function`.
uk: Призупинити виконання :term:`coroutine` на об’єкті :term:`awaitable`. Можна використовувати лише всередині функції співпрограми (:term:`coroutine function`).

source: The power operator
uk: Оператор енергетики

source: The power operator binds more tightly than unary operators on its left; it binds less tightly than unary operators on its right. The syntax is:
uk: Потужний оператор прив’язується сильніше, ніж унарні оператори зліва; він зв'язується менш тісно, ніж унарні оператори справа. Синтаксис:

source: Thus, in an unparenthesized sequence of power and unary operators, the operators are evaluated from right to left (this does not constrain the evaluation order for the operands): ``-1**2`` results in ``-1``.
uk: Таким чином, у послідовності степеневих і унарних операторів без дужок оператори обчислюються справа наліво (це не обмежує порядок обчислення для операндів): ``-1**2`` призводить до ``-1`` .

source: The power operator has the same semantics as the built-in :func:`pow` function, when called with two arguments: it yields its left argument raised to the power of its right argument. The numeric arguments are first converted to a common type, and the result is of that type.
uk: Оператор ступеня має таку саму семантику, як і вбудована функція :func:`pow`, коли викликається з двома аргументами: він повертає свій лівий аргумент, зведений до степеня правого аргументу. Числові аргументи спочатку перетворюються на загальний тип, і результат має відповідний тип.

source: For int operands, the result has the same type as the operands unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``10**2`` returns ``100``, but ``10**-2`` returns ``0.01``.
uk: Для операндів int результат має той самий тип, що й операнди, якщо другий аргумент не є від’ємним; у цьому випадку всі аргументи перетворюються на значення float і видає результат float. Наприклад, ``10**2`` повертає ``100``, а ``10**-2`` повертає ``0,01``.

source: Raising ``0.0`` to a negative power results in a :exc:`ZeroDivisionError`. Raising a negative number to a fractional power results in a :class:`complex` number. (In earlier versions it raised a :exc:`ValueError`.)
uk: Піднесення ``0.0`` до негативного степеня призводить до :exc:`ZeroDivisionError`. Зведення від’ємного числа до дробового степеня призводить до :class:`complex` числа. (У попередніх версіях це викликало :exc:`ValueError`.)

source: This operation can be customized using the special :meth:`__pow__` method.
uk: Цю операцію можна налаштувати за допомогою спеціального методу :meth:`__pow__`.

source: Unary arithmetic and bitwise operations
uk: Унарні арифметичні та порозрядні операції

source: All unary arithmetic and bitwise operations have the same priority:
uk: Усі унарні арифметичні та порозрядні операції мають однаковий пріоритет:
