Repository: python/python-docs-uk
Catalog: reference/expressions.po
Languages: uk

source: When a generator function is called, it returns an iterator known as a generator. That generator then controls the execution of the generator function. The execution starts when one of the generator's methods is called. At that time, the execution proceeds to the first yield expression, where it is suspended again, returning the value of :token:`~python-grammar:expression_list` to the generator's caller. By suspended, we mean that all local state is retained, including the current bindings of local variables, the instruction pointer, the internal evaluation stack, and the state of any exception handling. When the execution is resumed by calling one of the generator's methods, the function can proceed exactly as if the yield expression were just another external call. The value of the yield expression after resuming depends on the method which resumed the execution. If :meth:`~generator.__next__` is used (typically via either a :keyword:`for` or the :func:`next` builtin) then the result is :const:`None`. Otherwise, if :meth:`~generator.send` is used, then the result will be the value passed in to that method.
uk: Коли функція генератора викликається, вона повертає ітератор, відомий як генератор. Потім цей генератор керує виконанням функції генератора. Виконання починається при виклику одного з методів генератора. У цей час виконання переходить до першого виразу yield, де воно знову призупиняється, повертаючи значення :token:`~python-grammar:expression_list` до викликаючого генератора. Під призупиненням ми маємо на увазі, що весь локальний стан зберігається, включаючи поточні прив’язки локальних змінних, вказівник інструкцій, внутрішній стек оцінки та стан будь-якої обробки винятків. Коли виконання відновлюється викликом одного з методів генератора, функція може продовжувати роботу точно так, якби вираз yield був ще одним зовнішнім викликом. Значення виразу yield після відновлення залежить від методу, який відновив виконання. Якщо :meth:`~generator.__next__` використовується (зазвичай через :keyword:`for` або вбудований :func:`next`), тоді результатом буде :const:`None`. В іншому випадку, якщо :meth:`~generator.send` використовується, результатом буде значення, передане цьому методу.

source: All of this makes generator functions quite similar to coroutines; they yield multiple times, they have more than one entry point and their execution can be suspended. The only difference is that a generator function cannot control where the execution should continue after it yields; the control is always transferred to the generator's caller.
uk: Усе це робить функції генератора досить схожими на співпрограми; вони поступаються кілька разів, вони мають більше однієї точки входу, і їхнє виконання може бути призупинено. Єдина відмінність полягає в тому, що функція-генератор не може контролювати, де має продовжуватися виконання після того, як вона виходить; керування завжди передається абоненту генератора.

source: Yield expressions are allowed anywhere in a :keyword:`try` construct. If the generator is not resumed before it is finalized (by reaching a zero reference count or by being garbage collected), the generator-iterator's :meth:`~generator.close` method will be called, allowing any pending :keyword:`finally` clauses to execute.
uk: Вирази yield дозволені будь-де в конструкції :keyword:`try`. Якщо генератор не відновлено до його завершення (досягнувши нульової кількості посилань або збираючи сміття), буде викликано метод :meth:`~generator.close` генератора-ітератора, дозволяючи будь-які очікуючі :keyword:`finally` пропозиції для виконання.

source: When ``yield from <expr>`` is used, the supplied expression must be an iterable. The values produced by iterating that iterable are passed directly to the caller of the current generator's methods. Any values passed in with :meth:`~generator.send` and any exceptions passed in with :meth:`~generator.throw` are passed to the underlying iterator if it has the appropriate methods. If this is not the case, then :meth:`~generator.send` will raise :exc:`AttributeError` or :exc:`TypeError`, while :meth:`~generator.throw` will just raise the passed in exception immediately.
uk: Коли використовується ``yield from <expr>``, наданий вираз має бути повторюваним. Значення, отримані шляхом ітерації цього ітерованого, передаються безпосередньо до виклику методів поточного генератора. Будь-які значення, передані за допомогою :meth:`~generator.send`, і будь-які винятки, передані за допомогою :meth:`~generator.throw`, передаються базовому ітератору, якщо він має відповідні методи. Якщо це не так, то :meth:`~generator.send` викличе :exc:`AttributeError` або :exc:`TypeError`, а :meth:`~generator.throw` просто викличе переданий виняток негайно.

source: When the underlying iterator is complete, the :attr:`~StopIteration.value` attribute of the raised :exc:`StopIteration` instance becomes the value of the yield expression. It can be either set explicitly when raising :exc:`StopIteration`, or automatically when the subiterator is a generator (by returning a value from the subgenerator).
uk: Коли основний ітератор завершено, атрибут :attr:`~StopIteration.value` піднятого екземпляра :exc:`StopIteration` стає значенням виразу yield. Його можна встановити явно під час виклику :exc:`StopIteration` або автоматично, коли субітератор є генератором (шляхом повернення значення з субгенератора).

source: Added ``yield from <expr>`` to delegate control flow to a subiterator.
uk: Додано ``yield from <expr>`` для делегування потоку керування субітератору.

source: The parentheses may be omitted when the yield expression is the sole expression on the right hand side of an assignment statement.
uk: Дужки можуть бути опущені, якщо вираз yield є єдиним виразом у правій частині оператора призначення.

source: :pep:`255` - Simple Generators
uk: :pep:`255` - Прості генератори

source: The proposal for adding generators and the :keyword:`yield` statement to Python.
uk: Пропозиція щодо додавання генераторів і оператора :keyword:`yield` до Python.

source: :pep:`342` - Coroutines via Enhanced Generators
uk: :pep:`342` - Співпрограми через розширені генератори

source: The proposal to enhance the API and syntax of generators, making them usable as simple coroutines.
uk: Пропозиція покращити API та синтаксис генераторів, зробивши їх придатними для використання як простих співпрограм.

source: :pep:`380` - Syntax for Delegating to a Subgenerator
uk: :pep:`380` - Синтаксис для делегування підгенератору

source: The proposal to introduce the :token:`~python-grammar:yield_from` syntax, making delegation to subgenerators easy.
uk: Пропозиція запровадити синтаксис :token:`~python-grammar:yield_from`, що спрощує делегування субгенераторам.

source: :pep:`525` - Asynchronous Generators
uk: :pep:`525` - Асинхронні генератори

source: The proposal that expanded on :pep:`492` by adding generator capabilities to coroutine functions.
uk: Пропозиція, яка розширила :pep:`492` шляхом додавання можливостей генератора до функцій співпрограми.

source: Generator-iterator methods
uk: Методи генератор-ітератор

source: This subsection describes the methods of a generator iterator. They can be used to control the execution of a generator function.
uk: У цьому підрозділі описано методи ітератора генератора. Вони можуть використовуватися для керування виконанням функції генератора.

source: Note that calling any of the generator methods below when the generator is already executing raises a :exc:`ValueError` exception.
uk: Зауважте, що виклик будь-якого з наведених нижче методів генератора, коли генератор уже виконується, викликає виняткову ситуацію :exc:`ValueError`.

source: Starts the execution of a generator function or resumes it at the last executed yield expression. When a generator function is resumed with a :meth:`~generator.__next__` method, the current yield expression always evaluates to :const:`None`. The execution then continues to the next yield expression, where the generator is suspended again, and the value of the :token:`~python-grammar:expression_list` is returned to :meth:`__next__`'s caller. If the generator exits without yielding another value, a :exc:`StopIteration` exception is raised.
uk: Починає виконання функції генератора або відновлює його після останнього виконаного виразу yield. Коли функцію генератора відновлено за допомогою методу :meth:`~generator.__next__`, поточний вираз yield завжди оцінюється як :const:`None`. Потім виконання продовжується до наступного виразу yield, де генератор знову призупиняється, а значення :token:`~python-grammar:expression_list` повертається до викликаючого :meth:`__next__`. Якщо генератор завершує роботу, не видаючи іншого значення, виникає виняток :exc:`StopIteration`.

source: This method is normally called implicitly, e.g. by a :keyword:`for` loop, or by the built-in :func:`next` function.
uk: Цей метод зазвичай викликається неявно, напр. за допомогою циклу :keyword:`for` або за допомогою вбудованої функції :func:`next`.

source: Resumes the execution and "sends" a value into the generator function. The *value* argument becomes the result of the current yield expression. The :meth:`send` method returns the next value yielded by the generator, or raises :exc:`StopIteration` if the generator exits without yielding another value. When :meth:`send` is called to start the generator, it must be called with :const:`None` as the argument, because there is no yield expression that could receive the value.
uk: Відновлює виконання та "надсилає" значення у функцію генератора. Аргумент *value* стає результатом поточного виразу yield. Метод :meth:`send` повертає наступне значення, отримане генератором, або викликає :exc:`StopIteration`, якщо генератор завершує роботу, не видаючи іншого значення. Коли :meth:`send` викликається для запуску генератора, його потрібно викликати з :const:`None` як аргументом, оскільки немає виразу yield, який міг би отримати значення.

source: Raises an exception at the point where the generator was paused, and returns the next value yielded by the generator function. If the generator exits without yielding another value, a :exc:`StopIteration` exception is raised. If the generator function does not catch the passed-in exception, or raises a different exception, then that exception propagates to the caller.
uk: Викликає виняток у точці, де генератор було призупинено, і повертає наступне значення, отримане функцією генератора. Якщо генератор завершує роботу, не видаючи іншого значення, виникає виняток :exc:`StopIteration`. Якщо функція генератора не перехоплює переданий виняток або викликає інший виняток, тоді цей виняток поширюється на виклик.

source: In typical use, this is called with a single exception instance similar to the way the :keyword:`raise` keyword is used.
uk: У типовому використанні це викликається з одним винятком, подібним до того, як використовується ключове слово :keyword:`raise`.

source: Raises a :exc:`GeneratorExit` at the point where the generator function was paused. If the generator function then exits gracefully, is already closed, or raises :exc:`GeneratorExit` (by not catching the exception), close returns to its caller. If the generator yields a value, a :exc:`RuntimeError` is raised. If the generator raises any other exception, it is propagated to the caller. :meth:`close` does nothing if the generator has already exited due to an exception or normal exit.
uk: Викликає :exc:`GeneratorExit` у точці, де функцію генератора було призупинено. Якщо функція-генератор завершує роботу належним чином, уже закрита або викликає :exc:`GeneratorExit` (не перехоплюючи виняток), close повертається до свого виклику. Якщо генератор видає значення, виникає :exc:`RuntimeError`. Якщо генератор викликає будь-який інший виняток, він передається до абонента. :meth:`close` нічого не робить, якщо генератор уже завершив роботу через виняток або нормальний вихід.

source: Examples
uk: Приклади

source: Here is a simple example that demonstrates the behavior of generators and generator functions::
uk: Ось простий приклад, який демонструє поведінку генераторів і функцій генератора:

source: For examples using ``yield from``, see :ref:`pep-380` in "What's New in Python."
uk: Приклади використання ``yield from`` див. :ref:`pep-380` у розділі "Що нового в Python".

source: Asynchronous generator functions
uk: Функції асинхронного генератора

source: The presence of a yield expression in a function or method defined using :keyword:`async def` further defines the function as an :term:`asynchronous generator` function.
uk: Наявність виразу yield у функції чи методі, визначеному за допомогою :keyword:`async def`, далі визначає функцію як функцію :term:`asynchronous generator`.

source: When an asynchronous generator function is called, it returns an asynchronous iterator known as an asynchronous generator object. That object then controls the execution of the generator function. An asynchronous generator object is typically used in an :keyword:`async for` statement in a coroutine function analogously to how a generator object would be used in a :keyword:`for` statement.
uk: Коли викликається функція асинхронного генератора, вона повертає асинхронний ітератор, відомий як об’єкт асинхронного генератора. Потім цей об’єкт керує виконанням функції генератора. Асинхронний об’єкт генератора зазвичай використовується в операторі :keyword:`async for` у функції співпрограми аналогічно тому, як об’єкт генератора використовувався б у операторі :keyword:`for`.

source: Calling one of the asynchronous generator's methods returns an :term:`awaitable` object, and the execution starts when this object is awaited on. At that time, the execution proceeds to the first yield expression, where it is suspended again, returning the value of :token:`~python-grammar:expression_list` to the awaiting coroutine. As with a generator, suspension means that all local state is retained, including the current bindings of local variables, the instruction pointer, the internal evaluation stack, and the state of any exception handling. When the execution is resumed by awaiting on the next object returned by the asynchronous generator's methods, the function can proceed exactly as if the yield expression were just another external call. The value of the yield expression after resuming depends on the method which resumed the execution. If :meth:`~agen.__anext__` is used then the result is :const:`None`. Otherwise, if :meth:`~agen.asend` is used, then the result will be the value passed in to that method.
uk: Виклик одного з методів асинхронного генератора повертає об’єкт :term:`awaitable`, і виконання починається, коли цей об’єкт очікується. У цей час виконання переходить до першого виразу yield, де воно знову призупиняється, повертаючи значення :token:`~python-grammar:expression_list` до співпрограми очікування. Як і у випадку з генератором, призупинення означає, що весь локальний стан зберігається, включаючи поточні прив’язки локальних змінних, покажчик інструкцій, внутрішній стек оцінки та стан будь-якої обробки винятків. Коли виконання відновлюється шляхом очікування наступного об’єкта, повернутого методами асинхронного генератора, функція може продовжувати роботу точно так, якби вираз yield був просто ще одним зовнішнім викликом. Значення виразу yield після відновлення залежить від методу, який відновив виконання. Якщо використано :meth:`~agen.__anext__`, результатом буде :const:`None`. В іншому випадку, якщо :meth:`~agen.asend` використовується, результатом буде значення, передане цьому методу.

source: If an asynchronous generator happens to exit early by :keyword:`break`, the caller task being cancelled, or other exceptions, the generator's async cleanup code will run and possibly raise exceptions or access context variables in an unexpected context--perhaps after the lifetime of tasks it depends, or during the event loop shutdown when the async-generator garbage collection hook is called. To prevent this, the caller must explicitly close the async generator by calling :meth:`~agen.aclose` method to finalize the generator and ultimately detach it from the event loop.
uk: Якщо асинхронний генератор завершує роботу раніше через :keyword:`break`, скасування завдання виклику або інші винятки, запуститься асинхронний код очищення генератора та, можливо, викличе винятки або отримає доступ до змінних контексту в неочікуваному контексті — можливо, після час життя завдань залежить від цього, або під час завершення циклу подій, коли викликається хук збирання сміття асинхронного генератора. Щоб запобігти цьому, абонент повинен явно закрити асинхронний генератор, викликавши метод :meth:`~agen.aclose`, щоб завершити генератор і остаточно від’єднати його від циклу подій.

source: In an asynchronous generator function, yield expressions are allowed anywhere in a :keyword:`try` construct. However, if an asynchronous generator is not resumed before it is finalized (by reaching a zero reference count or by being garbage collected), then a yield expression within a :keyword:`!try` construct could result in a failure to execute pending :keyword:`finally` clauses. In this case, it is the responsibility of the event loop or scheduler running the asynchronous generator to call the asynchronous generator-iterator's :meth:`~agen.aclose` method and run the resulting coroutine object, thus allowing any pending :keyword:`!finally` clauses to execute.
uk: У функції асинхронного генератора вирази yield дозволені будь-де в конструкції :keyword:`try`. Однак, якщо асинхронний генератор не відновлено до його завершення (досягнувши нульового підрахунку посилань або збираючи сміття), тоді вираз yield у конструкції :keyword:`!try` може призвести до збою виконання очікуваного :keyword:`finally`. У цьому випадку цикл подій або планувальник, який запускає асинхронний генератор, відповідає за виклик методу :meth:`~agen.aclose` асинхронного генератора-ітератора та запуск отриманого об’єкта співпрограми, таким чином дозволяючи будь-які очікуючі :keyword:`!finally` для виконання.

source: To take care of finalization upon event loop termination, an event loop should define a *finalizer* function which takes an asynchronous generator-iterator and presumably calls :meth:`~agen.aclose` and executes the coroutine. This *finalizer* may be registered by calling :func:`sys.set_asyncgen_hooks`. When first iterated over, an asynchronous generator-iterator will store the registered *finalizer* to be called upon finalization. For a reference example of a *finalizer* method see the implementation of ``asyncio.Loop.shutdown_asyncgens`` in :source:`Lib/asyncio/base_events.py`.
uk: Щоб подбати про фіналізацію після завершення циклу подій, цикл подій має визначати функцію *finalizer*, яка приймає асинхронний генератор-ітератор і, ймовірно, викликає :meth:`~agen.aclose` і виконує співпрограму. Цей *фіналізатор* можна зареєструвати, викликавши :func:`sys.set_asyncgen_hooks`. Під час першого повторення асинхронний генератор-ітератор зберігатиме зареєстрований *фіналізатор*, який буде викликаний під час фіналізації. Для довідкового прикладу методу *finalizer* перегляньте реалізацію ``asyncio.Loop.shutdown_asyncgens`` у :source:`Lib/asyncio/base_events.py`.

source: The expression ``yield from <expr>`` is a syntax error when used in an asynchronous generator function.
uk: Вираз ``yield from <expr>`` є синтаксичною помилкою під час використання у функції асинхронного генератора.

source: Asynchronous generator-iterator methods
uk: Методи асинхронного генератора-ітератора

source: This subsection describes the methods of an asynchronous generator iterator, which are used to control the execution of a generator function.
uk: У цьому підрозділі описано методи ітератора асинхронного генератора, які використовуються для керування виконанням функції генератора.

source: Returns an awaitable which when run starts to execute the asynchronous generator or resumes it at the last executed yield expression. When an asynchronous generator function is resumed with an :meth:`~agen.__anext__` method, the current yield expression always evaluates to :const:`None` in the returned awaitable, which when run will continue to the next yield expression. The value of the :token:`~python-grammar:expression_list` of the yield expression is the value of the :exc:`StopIteration` exception raised by the completing coroutine. If the asynchronous generator exits without yielding another value, the awaitable instead raises a :exc:`StopAsyncIteration` exception, signalling that the asynchronous iteration has completed.
uk: Повертає awaitable, який під час запуску починає виконувати асинхронний генератор або відновлює його після останнього виконаного виразу yield. Коли функцію асинхронного генератора відновлено за допомогою методу :meth:`~agen.__anext__`, поточний вираз yield завжди обчислюється як :const:`None` у поверненому очікуваному, який під час виконання продовжиться до наступного виразу yield. Значення :token:`~python-grammar:expression_list` виразу yield є значенням винятку :exc:`StopIteration`, викликаного завершальною співпрограмою. Якщо асинхронний генератор завершує роботу, не видаючи іншого значення, awaitable натомість викликає виняток :exc:`StopAsyncIteration`, сигналізуючи, що асинхронну ітерацію завершено.

source: This method is normally called implicitly by a :keyword:`async for` loop.
uk: Цей метод зазвичай викликається неявно циклом :keyword:`async for`.

source: Returns an awaitable which when run resumes the execution of the asynchronous generator. As with the :meth:`~generator.send()` method for a generator, this "sends" a value into the asynchronous generator function, and the *value* argument becomes the result of the current yield expression. The awaitable returned by the :meth:`asend` method will return the next value yielded by the generator as the value of the raised :exc:`StopIteration`, or raises :exc:`StopAsyncIteration` if the asynchronous generator exits without yielding another value. When :meth:`asend` is called to start the asynchronous generator, it must be called with :const:`None` as the argument, because there is no yield expression that could receive the value.
uk: Повертає awaitable, який після запуску відновлює виконання асинхронного генератора. Як і у випадку з методом :meth:`~generator.send()` для генератора, це "надсилає" значення у функцію асинхронного генератора, а аргумент *value* стає результатом поточного виразу yield. Awaitable, повернений методом :meth:`asend`, поверне наступне значення, отримане генератором, як значення підвищеної :exc:`StopIteration`, або підвищить :exc:`StopAsyncIteration`, якщо асинхронний генератор завершує роботу, не даючи іншого. значення. Коли :meth:`asend` викликається для запуску асинхронного генератора, його потрібно викликати з :const:`None` як аргументом, оскільки немає виразу yield, який міг би отримати значення.
