Repository: python/python-docs-uk
Catalog: reference/expressions.po
Languages: uk

source: Expressions
uk: Вирази

source: This chapter explains the meaning of the elements of expressions in Python.
uk: У цьому розділі пояснюється значення елементів виразів у Python.

source: **Syntax Notes:** In this and the following chapters, extended BNF notation will be used to describe syntax, not lexical analysis. When (one alternative of) a syntax rule has the form
uk: **Примітки до синтаксису:** У цьому та наступних розділах для опису синтаксису буде використано розширену нотацію BNF, а не лексичний аналіз. Коли (одна альтернатива) синтаксичне правило має форму

source: and no semantics are given, the semantics of this form of ``name`` are the same as for ``othername``.
uk: і семантика не вказана, семантика цієї форми ``name`` така сама, як і ``othername``.

source: Arithmetic conversions
uk: Арифметичні перетворення

source: When a description of an arithmetic operator below uses the phrase "the numeric arguments are converted to a common type", this means that the operator implementation for built-in types works as follows:
uk: Коли в описі арифметичного оператора нижче використовується фраза "числові аргументи перетворюються на загальний тип", це означає, що реалізація оператора для вбудованих типів працює наступним чином:

source: If either argument is a complex number, the other is converted to complex;
uk: Якщо будь-який аргумент є комплексним числом, інший перетворюється на комплексне;

source: otherwise, if either argument is a floating point number, the other is converted to floating point;
uk: інакше, якщо будь-який аргумент є числом з плаваючою комою, інший перетворюється на число з плаваючою комою;

source: otherwise, both must be integers and no conversion is necessary.
uk: інакше обидва мають бути цілими числами, і перетворення не потрібне.

source: Some additional rules apply for certain operators (e.g., a string as a left argument to the '%' operator). Extensions must define their own conversion behavior.
uk: Деякі додаткові правила застосовуються до певних операторів (наприклад, рядок як лівий аргумент для оператора "%"). Розширення мають визначати власну поведінку перетворення.

source: Atoms
uk: Атоми

source: Atoms are the most basic elements of expressions. The simplest atoms are identifiers or literals. Forms enclosed in parentheses, brackets or braces are also categorized syntactically as atoms. The syntax for atoms is:
uk: Атоми є основними елементами виразів. Найпростішими атомами є ідентифікатори або літерали. Форми, укладені в дужки, дужки або дужки, також класифікуються синтаксично як атоми. Синтаксис для атомів:

source: Identifiers (Names)
uk: Ідентифікатори (імена)

source: An identifier occurring as an atom is a name. See section :ref:`identifiers` for lexical definition and section :ref:`naming` for documentation of naming and binding.
uk: Ідентифікатор, що зустрічається як атом, є ім'ям. Перегляньте розділ :ref:`identifiers` для лексичного визначення та розділ :ref:`naming` для документації іменування та прив’язки.

source: When the name is bound to an object, evaluation of the atom yields that object. When a name is not bound, an attempt to evaluate it raises a :exc:`NameError` exception.
uk: Коли ім’я пов’язане з об’єктом, оцінка атома дає цей об’єкт. Коли ім’я не прив’язане, спроба його оцінити викликає виняток :exc:`NameError`.

source: **Private name mangling:** When an identifier that textually occurs in a class definition begins with two or more underscore characters and does not end in two or more underscores, it is considered a :dfn:`private name` of that class. Private names are transformed to a longer form before code is generated for them. The transformation inserts the class name, with leading underscores removed and a single underscore inserted, in front of the name. For example, the identifier ``__spam`` occurring in a class named ``Ham`` will be transformed to ``_Ham__spam``. This transformation is independent of the syntactical context in which the identifier is used. If the transformed name is extremely long (longer than 255 characters), implementation defined truncation may happen. If the class name consists only of underscores, no transformation is done.
uk: **Приватне спотворення імені:** Якщо ідентифікатор, який текстово зустрічається у визначенні класу, починається з двох або більше символів підкреслення і не закінчується двома або більше підкресленнями, він вважається :dfn:`приватним ім’ям` цього класу. Приватні імена перетворюються на довшу форму перед тим, як для них буде згенеровано код. Трансформація вставляє ім’я класу з видаленням початкового підкреслення та вставленням одного підкреслення перед ім’ям. Наприклад, ідентифікатор ``__spam``, що зустрічається в класі з назвою ``Ham``, буде перетворено на ``_Ham__spam``. Це перетворення не залежить від синтаксичного контексту, у якому використовується ідентифікатор. Якщо перетворене ім’я надзвичайно довге (більше 255 символів), може статися скорочення, визначене реалізацією. Якщо ім'я класу складається лише з підкреслення, перетворення не виконується.

source: Literals
uk: Літерали

source: Python supports string and bytes literals and various numeric literals:
uk: Python підтримує рядкові та байтові літерали та різні числові літерали:

source: Evaluation of a literal yields an object of the given type (string, bytes, integer, floating point number, complex number) with the given value. The value may be approximated in the case of floating point and imaginary (complex) literals. See section :ref:`literals` for details.
uk: Обчислення літералу дає об’єкт заданого типу (рядок, байти, ціле число, число з плаваючою комою, комплексне число) із заданим значенням. Значення може бути наближено у випадку плаваючої коми та уявних (комплексних) літералів. Перегляньте розділ :ref:`literals` для деталей.

source: All literals correspond to immutable data types, and hence the object's identity is less important than its value. Multiple evaluations of literals with the same value (either the same occurrence in the program text or a different occurrence) may obtain the same object or a different object with the same value.
uk: Усі літерали відповідають незмінним типам даних, і, отже, ідентичність об’єкта менш важлива, ніж його значення. Кілька обчислень літералів з однаковим значенням (або те саме входження в текст програми, або інше входження) можуть отримати той самий об’єкт або інший об’єкт з тим самим значенням.

source: Parenthesized forms
uk: Форми в дужках

source: A parenthesized form is an optional expression list enclosed in parentheses:
uk: Форма в дужках – це необов’язковий список виразів, укладений у дужки:

source: A parenthesized expression list yields whatever that expression list yields: if the list contains at least one comma, it yields a tuple; otherwise, it yields the single expression that makes up the expression list.
uk: Список виразів у дужках дає все, що дає цей список виразів: якщо список містить принаймні одну кому, він дає кортеж; інакше він дає єдиний вираз, який складає список виразів.

source: An empty pair of parentheses yields an empty tuple object. Since tuples are immutable, the same rules as for literals apply (i.e., two occurrences of the empty tuple may or may not yield the same object).
uk: Порожня пара круглих дужок дає порожній об’єкт кортежу. Оскільки кортежі є незмінними, застосовуються ті ж правила, що й для літералів (тобто два входження порожнього кортежу можуть або не можуть давати той самий об’єкт).

source: Note that tuples are not formed by the parentheses, but rather by use of the comma operator. The exception is the empty tuple, for which parentheses *are* required --- allowing unparenthesized "nothing" in expressions would cause ambiguities and allow common typos to pass uncaught.
uk: Зауважте, що кортежі утворюються не за допомогою дужок, а за допомогою оператора коми. Винятком є порожній кортеж, для якого *потрібні* круглі дужки --- дозволяючи без дужок "нічого" у виразах, це призведе до неоднозначності та дозволить типовим помилкам залишитися нерозпізнаними.

source: Displays for lists, sets and dictionaries
uk: Відображення списків, наборів і словників

source: For constructing a list, a set or a dictionary Python provides special syntax called "displays", each of them in two flavors:
uk: Для побудови списку, набору або словника Python надає спеціальний синтаксис, званий "дисплеями", кожен з яких у двох варіантах:

source: either the container contents are listed explicitly, or
uk: або вміст контейнера перераховано явно, або

source: they are computed via a set of looping and filtering instructions, called a :dfn:`comprehension`.
uk: вони обчислюються за допомогою набору інструкцій циклу та фільтрації, які називаються :dfn:`comprehension`.

source: Common syntax elements for comprehensions are:
uk: Загальні синтаксичні елементи для розуміння:

source: The comprehension consists of a single expression followed by at least one :keyword:`!for` clause and zero or more :keyword:`!for` or :keyword:`!if` clauses. In this case, the elements of the new container are those that would be produced by considering each of the :keyword:`!for` or :keyword:`!if` clauses a block, nesting from left to right, and evaluating the expression to produce an element each time the innermost block is reached.
uk: Розуміння складається з одного виразу, за яким слідує принаймні одна пропозиція :keyword:`!for` і нуль або більше пропозицій :keyword:`!for` або :keyword:`!if`. У цьому випадку елементи нового контейнера — це ті, які були б створені шляхом розгляду кожного з пропозицій :keyword:`!for` або :keyword:`!if` блоку, вкладення зліва направо та оцінювання виразу створювати елемент кожного разу, коли досягнуто внутрішнього блоку.

source: However, aside from the iterable expression in the leftmost :keyword:`!for` clause, the comprehension is executed in a separate implicitly nested scope. This ensures that names assigned to in the target list don't "leak" into the enclosing scope.
uk: Однак, окрім ітераційного виразу в крайньому лівому реченні :keyword:`!for`, розуміння виконується в окремій неявно вкладеній області. Це гарантує, що імена, призначені в цільовому списку, не "просочуються" в охоплюючу область.

source: The iterable expression in the leftmost :keyword:`!for` clause is evaluated directly in the enclosing scope and then passed as an argument to the implicitly nested scope. Subsequent :keyword:`!for` clauses and any filter condition in the leftmost :keyword:`!for` clause cannot be evaluated in the enclosing scope as they may depend on the values obtained from the leftmost iterable. For example: ``[x*y for x in range(10) for y in range(x, x+10)]``.
uk: Ітераційний вираз у крайньому лівому реченні :keyword:`!for` обчислюється безпосередньо в охоплюючій області, а потім передається як аргумент до неявно вкладеної області. Наступні пропозиції :keyword:`!for` і будь-яка умова фільтра в крайньому лівому пункті :keyword:`!for` не можуть бути оцінені в охоплюючій області, оскільки вони можуть залежати від значень, отриманих від крайнього лівого ітератора. Наприклад: ``[x*y для x в діапазоні (10) для y в діапазоні (x, x+10)]``.

source: To ensure the comprehension always results in a container of the appropriate type, ``yield`` and ``yield from`` expressions are prohibited in the implicitly nested scope.
uk: Щоб гарантувати, що розуміння завжди призводить до контейнера відповідного типу, вирази ``yield`` і ``yield from`` заборонені в неявно вкладеній області.

source: Asynchronous comprehensions were introduced.
uk: Були введені асинхронні розуміння.

source: ``yield`` and ``yield from`` prohibited in the implicitly nested scope.
uk: ``yield`` і ``yield from`` заборонені в неявно вкладеній області.

source: List displays
uk: Відображається список

source: A list display is a possibly empty series of expressions enclosed in square brackets:
uk: Відображення списку – це, можливо, порожня серія виразів, укладених у квадратні дужки:

source: A list display yields a new list object, the contents being specified by either a list of expressions or a comprehension. When a comma-separated list of expressions is supplied, its elements are evaluated from left to right and placed into the list object in that order. When a comprehension is supplied, the list is constructed from the elements resulting from the comprehension.
uk: Відображення списку дає новий об’єкт списку, вміст якого визначається або списком виразів, або розумінням. Коли надається список виразів, розділених комами, його елементи обчислюються зліва направо та розміщуються в об’єкті списку в такому порядку. Коли надається розуміння, список складається з елементів, отриманих у результаті розуміння.

source: Set displays
uk: Встановити дисплеї

source: A set display is denoted by curly braces and distinguishable from dictionary displays by the lack of colons separating keys and values:
uk: Відображення набору позначається фігурними дужками та відрізняється від відображення словника відсутністю двокрапки, що розділяє ключі та значення:

source: A set display yields a new mutable set object, the contents being specified by either a sequence of expressions or a comprehension. When a comma-separated list of expressions is supplied, its elements are evaluated from left to right and added to the set object. When a comprehension is supplied, the set is constructed from the elements resulting from the comprehension.
uk: Відображення набору дає новий змінний об’єкт набору, вміст якого визначається або послідовністю виразів, або розумінням. Коли надається список виразів, розділених комами, його елементи обчислюються зліва направо та додаються до набору об’єктів. Коли надається розуміння, набір будується з елементів, отриманих у результаті розуміння.

source: An empty set cannot be constructed with ``{}``; this literal constructs an empty dictionary.
uk: Порожній набір не можна створити за допомогою ``{}``; цей літерал створює порожній словник.

source: Dictionary displays
uk: Відображення словника

source: A dictionary display is a possibly empty series of key/datum pairs enclosed in curly braces:
uk: Відображення словника – це, можливо, порожня серія пар ключ/дата, укладена у фігурні дужки:

source: A dictionary display yields a new dictionary object.
uk: Відображення словника дає новий об’єкт словника.

source: If a comma-separated sequence of key/datum pairs is given, they are evaluated from left to right to define the entries of the dictionary: each key object is used as a key into the dictionary to store the corresponding datum. This means that you can specify the same key multiple times in the key/datum list, and the final dictionary's value for that key will be the last one given.
uk: Якщо подано розділену комами послідовність пар ключ/дані, вони оцінюються зліва направо, щоб визначити записи словника: кожен ключовий об’єкт використовується як ключ у словнику для збереження відповідних даних. Це означає, що ви можете вказати той самий ключ кілька разів у списку ключів/даних, і остаточне значення словника для цього ключа буде останнім наданим.

source: A double asterisk ``**`` denotes :dfn:`dictionary unpacking`. Its operand must be a :term:`mapping`. Each mapping item is added to the new dictionary. Later values replace values already set by earlier key/datum pairs and earlier dictionary unpackings.
uk: Подвійна зірочка ``**`` позначає :dfn:`dictionary unpacking`. Його операнд має бути :term:`mapping`. Кожен елемент зіставлення додається до нового словника. Пізніші значення замінюють значення, уже встановлені попередніми парами ключ/дані та попередніми розпакуваннями словника.

source: Unpacking into dictionary displays, originally proposed by :pep:`448`.
uk: Розпакування у словникові відображення, спочатку запропоноване :pep:`448`.

source: A dict comprehension, in contrast to list and set comprehensions, needs two expressions separated with a colon followed by the usual "for" and "if" clauses. When the comprehension is run, the resulting key and value elements are inserted in the new dictionary in the order they are produced.
uk: Розуміння dict, на відміну від списків і набору, потребує двох виразів, розділених двокрапкою, за якими слідують звичайні пропозиції "for" і "if". Коли виконується розуміння, отримані елементи ключа та значення вставляються в новий словник у тому порядку, в якому вони створені.

source: Restrictions on the types of the key values are listed earlier in section :ref:`types`. (To summarize, the key type should be :term:`hashable`, which excludes all mutable objects.) Clashes between duplicate keys are not detected; the last datum (textually rightmost in the display) stored for a given key value prevails.
uk: Обмеження щодо типів значень ключів перелічені раніше в розділі :ref:`types`. (Підсумовуючи, тип ключа має бути :term:`hashable`, що виключає всі змінні об’єкти.) Конфлікти між повторюваними ключами не виявляються; переважає остання дата (текстово крайня права на дисплеї), збережена для заданого значення ключа.

source: Prior to Python 3.8, in dict comprehensions, the evaluation order of key and value was not well-defined. In CPython, the value was evaluated before the key. Starting with 3.8, the key is evaluated before the value, as proposed by :pep:`572`.
uk: До Python 3.8 у розуміннях dict порядок оцінки ключа та значення не був чітко визначений. У CPython значення було обчислено перед ключем. Починаючи з 3.8, ключ оцінюється перед значенням, як запропоновано :pep:`572`.

source: Generator expressions
uk: Генератор виразів

source: A generator expression is a compact generator notation in parentheses:
uk: Генеруючий вираз — це компактний генераторний запис у круглих дужках:

source: A generator expression yields a new generator object. Its syntax is the same as for comprehensions, except that it is enclosed in parentheses instead of brackets or curly braces.
uk: Генеруючий вираз дає новий генераторний об’єкт. Його синтаксис такий самий, як і для розуміння, за винятком того, що він узятий у дужки замість дужок або фігурних дужок.

source: Variables used in the generator expression are evaluated lazily when the :meth:`~generator.__next__` method is called for the generator object (in the same fashion as normal generators). However, the iterable expression in the leftmost :keyword:`!for` clause is immediately evaluated, so that an error produced by it will be emitted at the point where the generator expression is defined, rather than at the point where the first value is retrieved. Subsequent :keyword:`!for` clauses and any filter condition in the leftmost :keyword:`!for` clause cannot be evaluated in the enclosing scope as they may depend on the values obtained from the leftmost iterable. For example: ``(x*y for x in range(10) for y in range(x, x+10))``.
uk: Змінні, які використовуються у виразі генератора, обчислюються ліниво, коли метод :meth:`~generator.__next__` викликається для об’єкта генератора (так само, як і звичайні генератори). Однак ітераційний вираз у крайньому лівому реченні :keyword:`!for` негайно обчислюється, тому помилка, створена ним, буде видана в точці, де визначено вираз генератора, а не в точці, де перше значення відновлено. Наступні пропозиції :keyword:`!for` і будь-яка умова фільтра в крайньому лівому пункті :keyword:`!for` не можуть бути оцінені в охоплюючій області, оскільки вони можуть залежати від значень, отриманих від крайнього лівого ітератора. Наприклад: ``(x*y для x в діапазоні (10) для y в діапазоні (x, x+10))``.

source: The parentheses can be omitted on calls with only one argument. See section :ref:`calls` for details.
uk: У викликах лише з одним аргументом дужки можна опускати. Подробиці див. у розділі :ref:`calls`.

source: To avoid interfering with the expected operation of the generator expression itself, ``yield`` and ``yield from`` expressions are prohibited in the implicitly defined generator.
uk: Щоб уникнути перешкоджання очікуваній роботі самого виразу генератора, вирази ``yield`` і ``yield from`` заборонені в неявно визначеному генераторі.

source: If a generator expression contains either :keyword:`!async for` clauses or :keyword:`await` expressions it is called an :dfn:`asynchronous generator expression`. An asynchronous generator expression returns a new asynchronous generator object, which is an asynchronous iterator (see :ref:`async-iterators`).
uk: Якщо вираз генератора містить пропозиції :keyword:`!async for` або вирази :keyword:`await`, це називається :dfn:`asynchronous generator expression`. Вираз асинхронного генератора повертає новий об’єкт асинхронного генератора, який є асинхронним ітератором (див. :ref:`async-iterators`).

source: Asynchronous generator expressions were introduced.
uk: Було введено асинхронні генераторні вирази.

source: Prior to Python 3.7, asynchronous generator expressions could only appear in :keyword:`async def` coroutines. Starting with 3.7, any function can use asynchronous generator expressions.
uk: До Python 3.7 вирази асинхронного генератора могли з’являтися лише в співпрограмах :keyword:`async def`. Починаючи з 3.7, будь-яка функція може використовувати вирази асинхронного генератора.

source: Yield expressions
uk: Вирази дохідності

source: The yield expression is used when defining a :term:`generator` function or an :term:`asynchronous generator` function and thus can only be used in the body of a function definition. Using a yield expression in a function's body causes that function to be a generator function, and using it in an :keyword:`async def` function's body causes that coroutine function to be an asynchronous generator function. For example::
uk: Вираз yield використовується під час визначення функції :term:`generator` або функції :term:`asynchronous generator` і тому може використовуватися лише в тілі визначення функції. Використання виразу yield у тілі функції робить цю функцію функцією-генератором, а використання його в тілі функції :keyword:`async def` призводить до того, що функція співпрограми стає асинхронною функцією-генератором. Наприклад::

source: Due to their side effects on the containing scope, ``yield`` expressions are not permitted as part of the implicitly defined scopes used to implement comprehensions and generator expressions.
uk: Через їхній побічний вплив на область, що містить, вирази ``yield`` не дозволені як частина неявно визначених областей, які використовуються для реалізації розуміння та виразів генератора.

source: Yield expressions prohibited in the implicitly nested scopes used to implement comprehensions and generator expressions.
uk: Вирази yield, заборонені в неявно вкладених областях, що використовуються для реалізації виразів розуміння та генератора.

source: Generator functions are described below, while asynchronous generator functions are described separately in section :ref:`asynchronous-generator-functions`.
uk: Функції генератора описані нижче, тоді як функції асинхронного генератора описані окремо в розділі :ref:`asynchronous-generator-functions`.
