Repository: python/python-docs-uk
Catalog: reference/import.po
Languages: uk

source: :meth:`~importlib.abc.PathEntryFinder.find_spec` takes two arguments: the fully qualified name of the module being imported, and the (optional) target module. ``find_spec()`` returns a fully populated spec for the module. This spec will always have "loader" set (with one exception).
uk: :meth:`~importlib.abc.PathEntryFinder.find_spec` приймає два аргументи: повне ім’я модуля, який імпортується, і (необов’язковий) цільовий модуль. ``find_spec()`` повертає повністю заповнену специфікацію для модуля. Ця специфікація завжди матиме встановлений "завантажувач" (за одним винятком).

source: To indicate to the import machinery that the spec represents a namespace :term:`portion`, the path entry finder sets "submodule_search_locations" to a list containing the portion.
uk: Щоб вказати механізму імпорту, що специфікація представляє простір імен :term:`portion`, засіб пошуку записів шляху встановлює "submodule_search_locations" у список, що містить цю частину.

source: :meth:`~importlib.abc.PathEntryFinder.find_spec` replaced :meth:`~importlib.abc.PathEntryFinder.find_loader` and :meth:`~importlib.abc.PathEntryFinder.find_module`, both of which are now deprecated, but will be used if ``find_spec()`` is not defined.
uk: :meth:`~importlib.abc.PathEntryFinder.find_spec` замінив :meth:`~importlib.abc.PathEntryFinder.find_loader` і :meth:`~importlib.abc.PathEntryFinder.find_module`, обидва з яких тепер застаріли, але використовуватиметься, якщо ``find_spec()`` не визначено.

source: Older path entry finders may implement one of these two deprecated methods instead of ``find_spec()``. The methods are still respected for the sake of backward compatibility. However, if ``find_spec()`` is implemented on the path entry finder, the legacy methods are ignored.
uk: Старіші засоби пошуку запису шляху можуть використовувати один із цих двох застарілих методів замість ``find_spec()``. Методи досі поважаються заради зворотної сумісності. Однак, якщо ``find_spec()`` реалізовано в пошуку запису шляху, застарілі методи ігноруються.

source: :meth:`~importlib.abc.PathEntryFinder.find_loader` takes one argument, the fully qualified name of the module being imported. ``find_loader()`` returns a 2-tuple where the first item is the loader and the second item is a namespace :term:`portion`.
uk: :meth:`~importlib.abc.PathEntryFinder.find_loader` приймає один аргумент, повну назву модуля, який імпортується. ``find_loader()`` повертає 2-кортеж, де перший елемент є завантажувачем, а другий — простором імен :term:`portion`.

source: For backwards compatibility with other implementations of the import protocol, many path entry finders also support the same, traditional ``find_module()`` method that meta path finders support. However path entry finder ``find_module()`` methods are never called with a ``path`` argument (they are expected to record the appropriate path information from the initial call to the path hook).
uk: Для зворотної сумісності з іншими реалізаціями протоколу імпорту багато засобів пошуку шляхів також підтримують той самий традиційний метод ``find_module()``, який підтримують засоби пошуку меташляхів. Однак методи Find_module() засобу пошуку записів шляху ніколи не викликаються з аргументом ``path`` (вони мають записати відповідну інформацію про шлях від початкового виклику до перехоплення шляху).

source: The ``find_module()`` method on path entry finders is deprecated, as it does not allow the path entry finder to contribute portions to namespace packages. If both ``find_loader()`` and ``find_module()`` exist on a path entry finder, the import system will always call ``find_loader()`` in preference to ``find_module()``.
uk: Метод ``find_module()`` для засобів пошуку записів шляху застарів, оскільки він не дозволяє засобу пошуку записів шляху вносити частини до пакетів простору імен. Якщо і "find_loader()", і "find_module()" існують у пошуку запису шляху, система імпорту завжди викличе "find_loader()", а не "find_module()".

source: Calls to :meth:`~importlib.abc.PathEntryFinder.find_module` and :meth:`~importlib.abc.PathEntryFinder.find_loader` by the import system will raise :exc:`ImportWarning`.
uk: Виклики :meth:`~importlib.abc.PathEntryFinder.find_module` і :meth:`~importlib.abc.PathEntryFinder.find_loader` системою імпорту викликають :exc:`ImportWarning`.

source: Replacing the standard import system
uk: Заміна стандартної системи імпорту

source: The most reliable mechanism for replacing the entire import system is to delete the default contents of :data:`sys.meta_path`, replacing them entirely with a custom meta path hook.
uk: Найнадійнішим механізмом заміни всієї системи імпорту є видалення вмісту за замовчуванням :data:`sys.meta_path`, повністю замінивши його спеціальним хуком мета-шляху.

source: If it is acceptable to only alter the behaviour of import statements without affecting other APIs that access the import system, then replacing the builtin :func:`__import__` function may be sufficient. This technique may also be employed at the module level to only alter the behaviour of import statements within that module.
uk: Якщо прийнятно лише змінювати поведінку операторів імпорту, не впливаючи на інші API, які отримують доступ до системи імпорту, тоді заміни вбудованої функції :func:`__import__` може бути достатньо. Цю техніку також можна використовувати на рівні модуля лише для зміни поведінки операторів імпорту в цьому модулі.

source: To selectively prevent the import of some modules from a hook early on the meta path (rather than disabling the standard import system entirely), it is sufficient to raise :exc:`ModuleNotFoundError` directly from :meth:`~importlib.abc.MetaPathFinder.find_spec` instead of returning ``None``. The latter indicates that the meta path search should continue, while raising an exception terminates it immediately.
uk: Щоб вибірково запобігти імпорту деяких модулів із хука на ранній стадії меташляху (замість повного відключення стандартної системи імпорту), достатньо викликати :exc:`ModuleNotFoundError` безпосередньо з :meth:`~importlib.abc.MetaPathFinder .find_spec` замість повернення ``None``. Останнє вказує на те, що пошук меташляху має продовжуватися, тоді як виклик винятку негайно припиняє його.

source: Package Relative Imports
uk: Відносний імпорт пакетів

source: Relative imports use leading dots. A single leading dot indicates a relative import, starting with the current package. Two or more leading dots indicate a relative import to the parent(s) of the current package, one level per dot after the first. For example, given the following package layout::
uk: Для відносного імпорту використовуються крапки на початку. Одна крапка на початку вказує на відносний імпорт, починаючи з поточного пакета. Дві або більше крапок на початку вказують на відносний імпорт до батьківського(их) пакета(ів) поточного пакета, один рівень на кожну крапку після першого. Наприклад, враховуючи такий макет пакета:

source: In either ``subpackage1/moduleX.py`` or ``subpackage1/__init__.py``, the following are valid relative imports::
uk: У ``subpackage1/moduleX.py`` або ``subpackage1/__init__.py`` наступні дійсні відносні імпорти:

source: Absolute imports may use either the ``import <>`` or ``from <> import <>`` syntax, but relative imports may only use the second form; the reason for this is that::
uk: Абсолютний імпорт може використовувати або синтаксис ``import <>`` або ``from <> import <>``, але відносний імпорт може використовувати лише другу форму; причина цього в тому, що::

source: should expose ``XXX.YYY.ZZZ`` as a usable expression, but .moduleY is not a valid expression.
uk: має показувати ``XXX.YYY.ZZZ`` як придатний вираз, але .moduleY не є дійсним виразом.

source: Special considerations for __main__
uk: Особливі міркування для __main__

source: The :mod:`__main__` module is a special case relative to Python's import system. As noted :ref:`elsewhere <programs>`, the ``__main__`` module is directly initialized at interpreter startup, much like :mod:`sys` and :mod:`builtins`. However, unlike those two, it doesn't strictly qualify as a built-in module. This is because the manner in which ``__main__`` is initialized depends on the flags and other options with which the interpreter is invoked.
uk: Модуль :mod:`__main__` є окремим випадком щодо системи імпорту Python. Як зазначено :ref:`в іншому місці <programs>`, модуль ``__main__`` безпосередньо ініціалізується під час запуску інтерпретатора, подібно до :mod:`sys` і :mod:`builtins`. Однак, на відміну від цих двох, він не кваліфікується як вбудований модуль. Це пояснюється тим, що спосіб ініціалізації ``__main__`` залежить від прапорів та інших параметрів, з якими викликається інтерпретатор.

source: Depending on how :mod:`__main__` is initialized, ``__main__.__spec__`` gets set appropriately or to ``None``.
uk: Залежно від того, як :mod:`__main__` ініціалізовано, ``__main__.__spec__`` встановлюється відповідним чином або має значення ``None``.

source: When Python is started with the :option:`-m` option, ``__spec__`` is set to the module spec of the corresponding module or package. ``__spec__`` is also populated when the ``__main__`` module is loaded as part of executing a directory, zipfile or other :data:`sys.path` entry.
uk: Коли Python запускається з параметром :option:`-m`, ``__spec__`` встановлюється на специфікацію модуля відповідного модуля або пакета. ``__spec__`` також заповнюється, коли модуль ``__main__`` завантажується як частина виконання каталогу, zip-файлу або іншого запису :data:`sys.path`.

source: In :ref:`the remaining cases <using-on-interface-options>` ``__main__.__spec__`` is set to ``None``, as the code used to populate the :mod:`__main__` does not correspond directly with an importable module:
uk: У :ref:`решті випадків <using-on-interface-options>` ``__main__.__spec__`` встановлено на ``None``, оскільки код, який використовується для заповнення :mod:`__main__`, не відповідає безпосередньо імпортованому модулю:

source: interactive prompt
uk: інтерактивна підказка

source: :option:`-c` option
uk: Параметр :option:`-c`

source: running from stdin
uk: працює з stdin

source: running directly from a source or bytecode file
uk: працює безпосередньо з джерела або файлу байт-коду

source: Note that ``__main__.__spec__`` is always ``None`` in the last case, *even if* the file could technically be imported directly as a module instead. Use the :option:`-m` switch if valid module metadata is desired in :mod:`__main__`.
uk: Зауважте, що ``__main__.__spec__`` завжди має значення ``None`` в останньому випадку, *навіть якщо* технічно файл можна імпортувати безпосередньо як модуль. Використовуйте перемикач :option:`-m`, якщо потрібні дійсні метадані модуля в :mod:`__main__`.

source: Note also that even when ``__main__`` corresponds with an importable module and ``__main__.__spec__`` is set accordingly, they're still considered *distinct* modules. This is due to the fact that blocks guarded by ``if __name__ == "__main__":`` checks only execute when the module is used to populate the ``__main__`` namespace, and not during normal import.
uk: Зауважте також, що навіть якщо ``__main__`` відповідає імпортованому модулю, а ``__main__.__spec__`` встановлено відповідно, вони все одно вважаються *окремими* модулями. Це пов’язано з тим, що блоки, які захищаються перевірками ``if __name__ == "__main__":``, виконуються лише тоді, коли модуль використовується для заповнення простору імен ``__main__``, а не під час звичайного імпорту.

source: Open issues
uk: Відкриті питання

source: XXX It would be really nice to have a diagram.
uk: XXX Було б дуже добре мати діаграму.

source: XXX * (import_machinery.rst) how about a section devoted just to the attributes of modules and packages, perhaps expanding upon or supplanting the related entries in the data model reference page?
uk: XXX * (import_machinery.rst) як щодо розділу, присвяченого лише атрибутам модулів і пакетів, можливо, розширюючи або замінюючи відповідні записи на довідковій сторінці моделі даних?

source: XXX runpy, pkgutil, et al in the library manual should all get "See Also" links at the top pointing to the new import system section.
uk: Усі XXX runpy, pkgutil та інші в посібнику з бібліотеки мають отримати посилання "Див. також" угорі, які вказують на новий розділ системи імпорту.

source: XXX Add more explanation regarding the different ways in which ``__main__`` is initialized?
uk: XXX Додати додаткові пояснення щодо різних способів ініціалізації ``__main__``?

source: XXX Add more info on ``__main__`` quirks/pitfalls (i.e. copy from :pep:`395`).
uk: XXX Додайте більше інформації про особливості/підводні камені ``__main__`` (наприклад, копія з :pep:`395`).

source: References
uk: Список літератури

source: The import machinery has evolved considerably since Python's early days. The original `specification for packages <https://www.python.org/doc/essays/packages/>`_ is still available to read, although some details have changed since the writing of that document.
uk: Механізм імпорту значно розвинувся з перших днів Python. Оригінальна `специфікація пакетів <https://www.python.org/doc/essays/packages/>`_ все ще доступна для читання, хоча деякі деталі змінилися з моменту написання цього документа.

source: The original specification for :data:`sys.meta_path` was :pep:`302`, with subsequent extension in :pep:`420`.
uk: Початкова специфікація для :data:`sys.meta_path` була :pep:`302` з подальшим розширенням у :pep:`420`.

source: :pep:`420` introduced :term:`namespace packages <namespace package>` for Python 3.3. :pep:`420` also introduced the :meth:`find_loader` protocol as an alternative to :meth:`find_module`.
uk: :pep:`420` представлено :term:`пакети простору імен <namespace package>` для Python 3.3. :pep:`420` також представив протокол :meth:`find_loader` як альтернативу :meth:`find_module`.

source: :pep:`366` describes the addition of the ``__package__`` attribute for explicit relative imports in main modules.
uk: :pep:`366` описує додавання атрибута ``__package__`` для явного відносного імпорту в основні модулі.

source: :pep:`328` introduced absolute and explicit relative imports and initially proposed ``__name__`` for semantics :pep:`366` would eventually specify for ``__package__``.
uk: :pep:`328` ввів абсолютний і явний відносний імпорт і спочатку запропонував ``__name__`` для семантики :pep:`366` згодом вказав би для ``__package__``.

source: :pep:`338` defines executing modules as scripts.
uk: :pep:`338` визначає модулі виконання як скрипти.

source: :pep:`451` adds the encapsulation of per-module import state in spec objects. It also off-loads most of the boilerplate responsibilities of loaders back onto the import machinery. These changes allow the deprecation of several APIs in the import system and also addition of new methods to finders and loaders.
uk: :pep:`451` додає інкапсуляцію стану імпорту кожного модуля в специфікаційні об’єкти. Це також перекладає більшість шаблонних обов’язків вантажників назад на імпортну техніку. Ці зміни дозволяють припинити підтримку кількох API у системі імпорту, а також додати нові методи до засобів пошуку та завантаження.

source: Footnotes
uk: Виноски

source: See :class:`types.ModuleType`.
uk: Див. :class:`types.ModuleType`.

source: The importlib implementation avoids using the return value directly. Instead, it gets the module object by looking the module name up in :data:`sys.modules`. The indirect effect of this is that an imported module may replace itself in :data:`sys.modules`. This is implementation-specific behavior that is not guaranteed to work in other Python implementations.
uk: Реалізація importlib уникає безпосереднього використання значення, що повертається. Натомість він отримує об’єкт module, шукаючи ім’я модуля в :data:`sys.modules`. Непрямим наслідком цього є те, що імпортований модуль може замінити себе в :data:`sys.modules`. Це специфічна поведінка реалізації, яка не гарантовано працюватиме в інших реалізаціях Python.

source: In legacy code, it is possible to find instances of :class:`imp.NullImporter` in the :data:`sys.path_importer_cache`. It is recommended that code be changed to use ``None`` instead. See :ref:`portingpythoncode` for more details.
uk: У застарілому коді можна знайти екземпляри :class:`imp.NullImporter` в :data:`sys.path_importer_cache`. Рекомендується змінити код, щоб замість нього використовувати ``None``. Додаткову інформацію див. у :ref:`portingpythoncode`.
