Repository: python/python-docs-uk
Catalog: reference/import.po
Languages: uk

source: The import system
uk: Система імпорту

source: Python code in one :term:`module` gains access to the code in another module by the process of :term:`importing` it. The :keyword:`import` statement is the most common way of invoking the import machinery, but it is not the only way. Functions such as :func:`importlib.import_module` and built-in :func:`__import__` can also be used to invoke the import machinery.
uk: Код Python в одному :term:`module` отримує доступ до коду в іншому модулі шляхом процесу :term:`importing` його. Інструкція :keyword:`import` є найпоширенішим способом виклику механізму імпорту, але це не єдиний спосіб. Такі функції, як :func:`importlib.import_module` і вбудований :func:`__import__` також можна використовувати для виклику механізму імпорту.

source: The :keyword:`import` statement combines two operations; it searches for the named module, then it binds the results of that search to a name in the local scope. The search operation of the :keyword:`!import` statement is defined as a call to the :func:`__import__` function, with the appropriate arguments. The return value of :func:`__import__` is used to perform the name binding operation of the :keyword:`!import` statement. See the :keyword:`!import` statement for the exact details of that name binding operation.
uk: Оператор :keyword:`import` поєднує дві операції; він шукає названий модуль, а потім прив’язує результати цього пошуку до імені в локальній області. Операція пошуку оператора :keyword:`!import` визначається як виклик функції :func:`__import__` з відповідними аргументами. Значення, що повертається :func:`__import__`, використовується для виконання операції зв’язування імені оператора :keyword:`!import`. Перегляньте оператор :keyword:`!import` для отримання точних деталей цієї операції зв’язування імені.

source: A direct call to :func:`__import__` performs only the module search and, if found, the module creation operation. While certain side-effects may occur, such as the importing of parent packages, and the updating of various caches (including :data:`sys.modules`), only the :keyword:`import` statement performs a name binding operation.
uk: Прямий виклик :func:`__import__` виконує лише пошук модуля та, якщо знайдено, операцію створення модуля. Хоча можуть виникнути певні побічні ефекти, такі як імпортування батьківських пакетів і оновлення різних кешів (включаючи :data:`sys.modules`), тільки оператор :keyword:`import` виконує операцію зв’язування імені.

source: When an :keyword:`import` statement is executed, the standard builtin :func:`__import__` function is called. Other mechanisms for invoking the import system (such as :func:`importlib.import_module`) may choose to bypass :func:`__import__` and use their own solutions to implement import semantics.
uk: Коли виконується оператор :keyword:`import`, викликається стандартна вбудована функція :func:`__import__`. Інші механізми для виклику системи імпорту (такі як :func:`importlib.import_module`) можуть вибрати обхід :func:`__import__` і використовувати власні рішення для реалізації семантики імпорту.

source: When a module is first imported, Python searches for the module and if found, it creates a module object [#fnmo]_, initializing it. If the named module cannot be found, a :exc:`ModuleNotFoundError` is raised. Python implements various strategies to search for the named module when the import machinery is invoked. These strategies can be modified and extended by using various hooks described in the sections below.
uk: Коли модуль імпортовано вперше, Python шукає модуль і, якщо знайдено, створює об’єкт модуля [#fnmo]_, ініціалізуючи його. Якщо вказаний модуль не знайдено, виникає помилка :exc:`ModuleNotFoundError`. Python реалізує різні стратегії для пошуку названого модуля під час виклику механізму імпорту. Ці стратегії можна модифікувати та розширювати за допомогою різноманітних хуків, описаних у розділах нижче.

source: The import system has been updated to fully implement the second phase of :pep:`302`. There is no longer any implicit import machinery - the full import system is exposed through :data:`sys.meta_path`. In addition, native namespace package support has been implemented (see :pep:`420`).
uk: Систему імпорту оновлено для повної реалізації другої фази :pep:`302`. Більше немає механізму неявного імпорту – повна система імпорту доступна через :data:`sys.meta_path`. Крім того, була реалізована підтримка рідного пакету простору імен (див. :pep:`420`).

source: The :mod:`importlib` module provides a rich API for interacting with the import system. For example :func:`importlib.import_module` provides a recommended, simpler API than built-in :func:`__import__` for invoking the import machinery. Refer to the :mod:`importlib` library documentation for additional detail.
uk: Модуль :mod:`importlib` надає багатий API для взаємодії із системою імпорту. Наприклад, :func:`importlib.import_module` надає рекомендований простіший API, ніж вбудований :func:`__import__` для виклику механізму імпорту. Зверніться до документації бібліотеки :mod:`importlib` для отримання додаткової інформації.

source: Packages
uk: пакети

source: Python has only one type of module object, and all modules are of this type, regardless of whether the module is implemented in Python, C, or something else. To help organize modules and provide a naming hierarchy, Python has a concept of :term:`packages <package>`.
uk: Python має лише один тип об’єкта модуля, і всі модулі належать до цього типу, незалежно від того, чи реалізовано модуль на Python, C чи в чомусь іншому. Щоб допомогти організувати модулі та забезпечити ієрархію імен, Python має концепцію :term:`packages <package>`.

source: You can think of packages as the directories on a file system and modules as files within directories, but don't take this analogy too literally since packages and modules need not originate from the file system. For the purposes of this documentation, we'll use this convenient analogy of directories and files. Like file system directories, packages are organized hierarchically, and packages may themselves contain subpackages, as well as regular modules.
uk: Ви можете розглядати пакети як каталоги у файловій системі, а модулі як файли в каталогах, але не сприймайте цю аналогію надто буквально, оскільки пакети та модулі не обов’язково походять із файлової системи. Для цілей цієї документації ми будемо використовувати цю зручну аналогію каталогів і файлів. Як і каталоги файлової системи, пакунки організовані ієрархічно, і самі пакунки можуть містити підпакети, а також звичайні модулі.

source: It's important to keep in mind that all packages are modules, but not all modules are packages. Or put another way, packages are just a special kind of module. Specifically, any module that contains a ``__path__`` attribute is considered a package.
uk: Важливо мати на увазі, що всі пакети є модулями, але не всі модулі є пакетами. Або інакше кажучи, пакунки - це просто особливий вид модулів. Зокрема, будь-який модуль, який містить атрибут ``__path__``, вважається пакетом.

source: All modules have a name. Subpackage names are separated from their parent package name by a dot, akin to Python's standard attribute access syntax. Thus you might have a package called :mod:`email`, which in turn has a subpackage called :mod:`email.mime` and a module within that subpackage called :mod:`email.mime.text`.
uk: Усі модулі мають назву. Назви підпакетів відокремлюються від назви батьківського пакета крапкою, подібно до стандартного синтаксису доступу до атрибутів Python. Таким чином, у вас може бути пакет під назвою :mod:`email`, який, у свою чергу, має підпакет під назвою :mod:`email.mime` і модуль у цьому підпакеті під назвою :mod:`email.mime.text`.

source: Regular packages
uk: Звичайні пакети

source: Python defines two types of packages, :term:`regular packages <regular package>` and :term:`namespace packages <namespace package>`. Regular packages are traditional packages as they existed in Python 3.2 and earlier. A regular package is typically implemented as a directory containing an ``__init__.py`` file. When a regular package is imported, this ``__init__.py`` file is implicitly executed, and the objects it defines are bound to names in the package's namespace. The ``__init__.py`` file can contain the same Python code that any other module can contain, and Python will add some additional attributes to the module when it is imported.
uk: Python визначає два типи пакетів: :term:`звичайні пакунки <regular package>` і :term:`пакети простору імен <namespace package>`. Звичайні пакунки — це традиційні пакунки, які існували в Python 3.2 і раніше. Звичайний пакет зазвичай реалізується як каталог, що містить файл ``__init__.py``. Коли імпортується звичайний пакет, цей файл ``__init__.py`` виконується неявно, а об’єкти, які він визначає, прив’язуються до імен у просторі імен пакета. Файл ``__init__.py`` може містити той самий код Python, який може містити будь-який інший модуль, і Python додасть деякі додаткові атрибути до модуля під час його імпорту.

source: For example, the following file system layout defines a top level ``parent`` package with three subpackages::
uk: Наприклад, наведений нижче макет файлової системи визначає "батьківський" пакет верхнього рівня з трьома підпакетами:

source: Importing ``parent.one`` will implicitly execute ``parent/__init__.py`` and ``parent/one/__init__.py``. Subsequent imports of ``parent.two`` or ``parent.three`` will execute ``parent/two/__init__.py`` and ``parent/three/__init__.py`` respectively.
uk: Імпорт ``parent.one`` неявно виконає ``parent/__init__.py`` і ``parent/one/__init__.py``. Наступні імпорти ``parent.two`` або ``parent.three`` виконають ``parent/two/__init__.py`` та ``parent/three/__init__.py`` відповідно.

source: Namespace packages
uk: Пакети простору імен

source: A namespace package is a composite of various :term:`portions <portion>`, where each portion contributes a subpackage to the parent package. Portions may reside in different locations on the file system. Portions may also be found in zip files, on the network, or anywhere else that Python searches during import. Namespace packages may or may not correspond directly to objects on the file system; they may be virtual modules that have no concrete representation.
uk: Пакет простору імен — це сукупність різноманітних :term:`частин <portion>`, де кожна частина додає підпакет до батьківського пакета. Частини можуть знаходитися в різних місцях файлової системи. Частини також можна знайти в zip-файлах, у мережі чи будь-де ще, де Python шукає під час імпорту. Пакети простору імен можуть або не можуть відповідати безпосередньо об'єктам у файловій системі; вони можуть бути віртуальними модулями, які не мають конкретного представлення.

source: Namespace packages do not use an ordinary list for their ``__path__`` attribute. They instead use a custom iterable type which will automatically perform a new search for package portions on the next import attempt within that package if the path of their parent package (or :data:`sys.path` for a top level package) changes.
uk: Пакунки простору імен не використовують звичайний список для свого атрибута ``__path__``. Натомість вони використовують настроюваний ітерований тип, який автоматично виконає новий пошук частин пакета під час наступної спроби імпорту в цьому пакеті, якщо шлях до їх батьківського пакета (або :data:`sys.path` для пакета верхнього рівня) зміниться.

source: With namespace packages, there is no ``parent/__init__.py`` file. In fact, there may be multiple ``parent`` directories found during import search, where each one is provided by a different portion. Thus ``parent/one`` may not be physically located next to ``parent/two``. In this case, Python will create a namespace package for the top-level ``parent`` package whenever it or one of its subpackages is imported.
uk: У пакетах простору імен немає файлу ``parent/__init__.py``. Насправді під час пошуку імпорту може бути знайдено кілька ``батьківських`` каталогів, де кожен надається окремою частиною. Таким чином, ``батьківський/один`` може фізично не знаходитися поруч із ``батьківським/два``. У цьому випадку Python створюватиме пакет простору імен для ``батьківського`` пакета верхнього рівня кожного разу, коли він або один із його підпакетів імпортується.

source: See also :pep:`420` for the namespace package specification.
uk: Дивіться також :pep:`420` для специфікації пакета простору імен.

source: Searching
uk: Пошук

source: To begin the search, Python needs the :term:`fully qualified <qualified name>` name of the module (or package, but for the purposes of this discussion, the difference is immaterial) being imported. This name may come from various arguments to the :keyword:`import` statement, or from the parameters to the :func:`importlib.import_module` or :func:`__import__` functions.
uk: Щоб розпочати пошук, Python потребує :term:`повної <qualified name>` назви модуля (або пакета, але для цілей цього обговорення різниця несуттєва), який імпортується. Це ім’я може походити з різних аргументів оператора :keyword:`import` або з параметрів функцій :func:`importlib.import_module` або :func:`__import__`.

source: This name will be used in various phases of the import search, and it may be the dotted path to a submodule, e.g. ``foo.bar.baz``. In this case, Python first tries to import ``foo``, then ``foo.bar``, and finally ``foo.bar.baz``. If any of the intermediate imports fail, a :exc:`ModuleNotFoundError` is raised.
uk: Ця назва використовуватиметься на різних етапах пошуку імпорту, і це може бути пунктирний шлях до підмодуля, напр. ``foo.bar.baz``. У цьому випадку Python спочатку намагається імпортувати ``foo``, потім ``foo.bar`` і, нарешті, ``foo.bar.baz``. Якщо будь-який із проміжних імпортів не вдається, виникає помилка :exc:`ModuleNotFoundError`.

source: The module cache
uk: Кеш модуля

source: The first place checked during import search is :data:`sys.modules`. This mapping serves as a cache of all modules that have been previously imported, including the intermediate paths. So if ``foo.bar.baz`` was previously imported, :data:`sys.modules` will contain entries for ``foo``, ``foo.bar``, and ``foo.bar.baz``. Each key will have as its value the corresponding module object.
uk: Перше місце, яке перевіряється під час пошуку імпорту, це :data:`sys.modules`. Це відображення служить кеш-пам’яттю всіх модулів, які були раніше імпортовані, включаючи проміжні шляхи. Отже, якщо ``foo.bar.baz`` був раніше імпортований, :data:`sys.modules` міститиме записи для ``foo``, ``foo.bar`` і ``foo.bar.baz``. Кожен ключ матиме значення відповідного об’єкта модуля.

source: During import, the module name is looked up in :data:`sys.modules` and if present, the associated value is the module satisfying the import, and the process completes. However, if the value is ``None``, then a :exc:`ModuleNotFoundError` is raised. If the module name is missing, Python will continue searching for the module.
uk: Під час імпорту ім’я модуля шукається в :data:`sys.modules` і, якщо воно присутнє, пов’язане значення означає модуль, який задовольняє імпорт, і процес завершується. Однак, якщо значенням є ``None``, тоді виникає :exc:`ModuleNotFoundError`. Якщо ім’я модуля відсутнє, Python продовжить пошук модуля.

source: :data:`sys.modules` is writable. Deleting a key may not destroy the associated module (as other modules may hold references to it), but it will invalidate the cache entry for the named module, causing Python to search anew for the named module upon its next import. The key can also be assigned to ``None``, forcing the next import of the module to result in a :exc:`ModuleNotFoundError`.
uk: :data:`sys.modules` доступний для запису. Видалення ключа може не знищити пов’язаний модуль (оскільки інші модулі можуть містити посилання на нього), але це зробить недійсним запис кешу для названого модуля, змусивши Python знову шукати названий модуль під час наступного імпорту. Ключ також може бути призначений як ``None``, змушуючи наступний імпорт модуля призводити до :exc:`ModuleNotFoundError`.

source: Beware though, as if you keep a reference to the module object, invalidate its cache entry in :data:`sys.modules`, and then re-import the named module, the two module objects will *not* be the same. By contrast, :func:`importlib.reload` will reuse the *same* module object, and simply reinitialise the module contents by rerunning the module's code.
uk: Але будьте обережні: якби ви зберегли посилання на об’єкт модуля, зробили недійсним запис кешу в :data:`sys.modules`, а потім повторно імпортували названий модуль, два об’єкти модуля *не* будуть однаковими. Навпаки, :func:`importlib.reload` повторно використовуватиме *той самий* об’єкт модуля та просто повторно ініціалізує вміст модуля, повторно запускаючи код модуля.

source: Finders and loaders
uk: Шукачі та вантажники

source: If the named module is not found in :data:`sys.modules`, then Python's import protocol is invoked to find and load the module. This protocol consists of two conceptual objects, :term:`finders <finder>` and :term:`loaders <loader>`. A finder's job is to determine whether it can find the named module using whatever strategy it knows about. Objects that implement both of these interfaces are referred to as :term:`importers <importer>` - they return themselves when they find that they can load the requested module.
uk: Якщо названий модуль не знайдено в :data:`sys.modules`, тоді для пошуку та завантаження модуля викликається протокол імпорту Python. Цей протокол складається з двох концептуальних об’єктів, :term:`finders <finder>` і :term:`loaders <loader>`. Робота шукача полягає в тому, щоб визначити, чи зможе він знайти названий модуль, використовуючи ту стратегію, про яку він знає. Об’єкти, які реалізують обидва ці інтерфейси, називаються :term:`імпортерами <importer>` — вони повертаються самі, коли виявляють, що можуть завантажити запитаний модуль.

source: Python includes a number of default finders and importers. The first one knows how to locate built-in modules, and the second knows how to locate frozen modules. A third default finder searches an :term:`import path` for modules. The :term:`import path` is a list of locations that may name file system paths or zip files. It can also be extended to search for any locatable resource, such as those identified by URLs.
uk: Python містить ряд засобів пошуку та імпорту за замовчуванням. Перший знає, як знайти вбудовані модулі, а другий знає, як знайти заморожені модулі. Третій засіб пошуку за умовчанням шукає модулі в :term:`шляху імпорту <import path>`. :term:`шлях імпорту <import path>` — це список розташувань, які можуть іменувати шляхи файлової системи або файли zip. Його також можна розширити для пошуку будь-якого ресурсу, який можна знайти, наприклад, ідентифікованого за URL-адресами.

source: The import machinery is extensible, so new finders can be added to extend the range and scope of module searching.
uk: Механізм імпорту можна розширювати, тому можна додавати нові шукачі, щоб розширити діапазон і обсяг пошуку модулів.

source: Finders do not actually load modules. If they can find the named module, they return a :dfn:`module spec`, an encapsulation of the module's import-related information, which the import machinery then uses when loading the module.
uk: Шукачі фактично не завантажують модулі. Якщо їм вдається знайти названий модуль, вони повертають :dfn:`module spec`, інкапсуляцію інформації, пов’язаної з імпортом модуля, яку потім використовує механізм імпорту під час завантаження модуля.

source: The following sections describe the protocol for finders and loaders in more detail, including how you can create and register new ones to extend the import machinery.
uk: У наступних розділах більш детально описано протоколи для шукачів і завантажувачів, зокрема те, як ви можете створити та зареєструвати нові протоколи для розширення механізму імпорту.

source: In previous versions of Python, finders returned :term:`loaders <loader>` directly, whereas now they return module specs which *contain* loaders. Loaders are still used during import but have fewer responsibilities.
uk: У попередніх версіях Python шукачі повертали :term:`loaders <loader>` безпосередньо, тоді як тепер вони повертають специфікації модулів, які *містять* завантажувачі. Завантажувачі все ще використовуються під час імпорту, але мають менше обов’язків.

source: Import hooks
uk: Імпортні гачки

source: The import machinery is designed to be extensible; the primary mechanism for this are the *import hooks*. There are two types of import hooks: *meta hooks* and *import path hooks*.
uk: Імпортна техніка розрахована на розширення; основним механізмом для цього є *перехоплення імпорту*. Існує два типи хуків імпорту: *мета-хуки* та *хуки шляху імпорту*.

source: Meta hooks are called at the start of import processing, before any other import processing has occurred, other than :data:`sys.modules` cache look up. This allows meta hooks to override :data:`sys.path` processing, frozen modules, or even built-in modules. Meta hooks are registered by adding new finder objects to :data:`sys.meta_path`, as described below.
uk: Мета-хуки викликаються на початку обробки імпорту, до того, як відбулася будь-яка інша обробка імпорту, окрім пошуку кешу :data:`sys.modules`. Це дозволяє мета-хукам перевизначати :data:`sys.path` обробку, заморожені модулі або навіть вбудовані модулі. Мета-хуки реєструються шляхом додавання нових об’єктів пошуку до :data:`sys.meta_path`, як описано нижче.

source: Import path hooks are called as part of :data:`sys.path` (or ``package.__path__``) processing, at the point where their associated path item is encountered. Import path hooks are registered by adding new callables to :data:`sys.path_hooks` as described below.
uk: Перехоплювачі шляхів імпорту викликаються як частина обробки :data:`sys.path` (або ``package.__path__``) у точці, де зустрічається пов’язаний з ними елемент шляху. Хуки шляхів імпорту реєструються шляхом додавання нових викликів до :data:`sys.path_hooks`, як описано нижче.

source: The meta path
uk: Меташлях

source: When the named module is not found in :data:`sys.modules`, Python next searches :data:`sys.meta_path`, which contains a list of meta path finder objects. These finders are queried in order to see if they know how to handle the named module. Meta path finders must implement a method called :meth:`~importlib.abc.MetaPathFinder.find_spec()` which takes three arguments: a name, an import path, and (optionally) a target module. The meta path finder can use any strategy it wants to determine whether it can handle the named module or not.
uk: Якщо вказаний модуль не знайдено в :data:`sys.modules`, Python далі шукає :data:`sys.meta_path`, який містить список об’єктів пошуку мета-шляху. Ці шукачі запитуються, щоб побачити, чи знають вони, як працювати з названим модулем. Шукачі меташляхів повинні реалізувати метод під назвою :meth:`~importlib.abc.MetaPathFinder.find_spec()`, який приймає три аргументи: ім’я, шлях імпорту та (необов’язково) цільовий модуль. Шукач меташляху може використовувати будь-яку стратегію, щоб визначити, чи може він обробляти названий модуль чи ні.
