Repository: python/python-docs-uk
Catalog: reference/import.po
Languages: uk

source: If the meta path finder knows how to handle the named module, it returns a spec object. If it cannot handle the named module, it returns ``None``. If :data:`sys.meta_path` processing reaches the end of its list without returning a spec, then a :exc:`ModuleNotFoundError` is raised. Any other exceptions raised are simply propagated up, aborting the import process.
uk: Якщо засіб пошуку меташляху знає, як обробляти названий модуль, він повертає специфікаційний об’єкт. Якщо він не може обробити названий модуль, він повертає ``None``. Якщо обробка :data:`sys.meta_path` досягає кінця свого списку без повернення специфікації, тоді виникає :exc:`ModuleNotFoundError`. Будь-які інші викликані винятки просто поширюються, перериваючи процес імпорту.

source: The :meth:`~importlib.abc.MetaPathFinder.find_spec()` method of meta path finders is called with two or three arguments. The first is the fully qualified name of the module being imported, for example ``foo.bar.baz``. The second argument is the path entries to use for the module search. For top-level modules, the second argument is ``None``, but for submodules or subpackages, the second argument is the value of the parent package's ``__path__`` attribute. If the appropriate ``__path__`` attribute cannot be accessed, a :exc:`ModuleNotFoundError` is raised. The third argument is an existing module object that will be the target of loading later. The import system passes in a target module only during reload.
uk: Метод :meth:`~importlib.abc.MetaPathFinder.find_spec()` засобів пошуку меташляху викликається з двома або трьома аргументами. Перше — це повна назва модуля, який імпортується, наприклад ``foo.bar.baz``. Другим аргументом є записи шляху, які слід використовувати для пошуку модулів. Для модулів верхнього рівня другим аргументом є ``None``, але для підмодулів або підпакетів другим аргументом є значення атрибута ``__path__`` батьківського пакета. Якщо неможливо отримати доступ до відповідного атрибута ``__path__``, виникає :exc:`ModuleNotFoundError`. Третій аргумент — це існуючий об’єкт модуля, який буде метою завантаження пізніше. Система імпорту передає цільовий модуль лише під час перезавантаження.

source: The meta path may be traversed multiple times for a single import request. For example, assuming none of the modules involved has already been cached, importing ``foo.bar.baz`` will first perform a top level import, calling ``mpf.find_spec("foo", None, None)`` on each meta path finder (``mpf``). After ``foo`` has been imported, ``foo.bar`` will be imported by traversing the meta path a second time, calling ``mpf.find_spec("foo.bar", foo.__path__, None)``. Once ``foo.bar`` has been imported, the final traversal will call ``mpf.find_spec("foo.bar.baz", foo.bar.__path__, None)``.
uk: Мета-шлях може проходити кілька разів для одного запиту на імпорт. Наприклад, якщо припустити, що жоден із задіяних модулів уже не кешовано, імпорт ``foo.bar.baz`` спочатку виконає імпорт верхнього рівня, викликаючи ``mpf.find_spec("foo", None, None)`` на шукач кожного меташляху (``mpf``). Після того, як ``foo`` було імпортовано, ``foo.bar`` буде імпортовано шляхом проходження меташляху вдруге, викликавши ``mpf.find_spec("foo.bar", foo.__path__, None)`` . Після того, як ``foo.bar`` буде імпортовано, остаточний обхід викличе ``mpf.find_spec("foo.bar.baz", foo.bar.__path__, None)``.

source: Some meta path finders only support top level imports. These importers will always return ``None`` when anything other than ``None`` is passed as the second argument.
uk: Деякі засоби пошуку меташляхів підтримують лише імпорт верхнього рівня. Ці імпортери завжди повертатимуть ``None``, якщо будь-що інше, ніж ``None``, передається як другий аргумент.

source: Python's default :data:`sys.meta_path` has three meta path finders, one that knows how to import built-in modules, one that knows how to import frozen modules, and one that knows how to import modules from an :term:`import path` (i.e. the :term:`path based finder`).
uk: За замовчуванням :data:`sys.meta_path` Python має три засоби пошуку меташляху: один, який знає, як імпортувати вбудовані модулі, інший, який знає, як імпортувати заморожені модулі, і інший, який знає, як імпортувати модулі зі шляху імпорту (:term:`import path`, тобто :term:`path based finder`).

source: The :meth:`~importlib.abc.MetaPathFinder.find_spec` method of meta path finders replaced :meth:`~importlib.abc.MetaPathFinder.find_module`, which is now deprecated. While it will continue to work without change, the import machinery will try it only if the finder does not implement ``find_spec()``.
uk: Метод :meth:`~importlib.abc.MetaPathFinder.find_spec` для пошуку меташляхів замінив :meth:`~importlib.abc.MetaPathFinder.find_module`, який зараз не підтримується. Хоча він продовжуватиме працювати без змін, механізм імпорту спробує його, лише якщо шукач не реалізує ``find_spec()``.

source: Use of :meth:`~importlib.abc.MetaPathFinder.find_module` by the import system now raises :exc:`ImportWarning`.
uk: Використання :meth:`~importlib.abc.MetaPathFinder.find_module` системою імпорту тепер викликає :exc:`ImportWarning`.

source: Loading
uk: Завантаження

source: If and when a module spec is found, the import machinery will use it (and the loader it contains) when loading the module. Here is an approximation of what happens during the loading portion of import::
uk: Якщо специфікація модуля буде знайдена, механізм імпорту використовуватиме її (і завантажувач, який вона містить) під час завантаження модуля. Ось приблизно те, що відбувається під час завантаження частини імпорту:

source: Note the following details:
uk: Зверніть увагу на такі деталі:

source: If there is an existing module object with the given name in :data:`sys.modules`, import will have already returned it.
uk: Якщо в :data:`sys.modules` є існуючий об’єкт модуля з вказаною назвою, імпортування його вже повернуло.

source: The module will exist in :data:`sys.modules` before the loader executes the module code. This is crucial because the module code may (directly or indirectly) import itself; adding it to :data:`sys.modules` beforehand prevents unbounded recursion in the worst case and multiple loading in the best.
uk: Модуль існуватиме в :data:`sys.modules` до того, як завантажувач виконає код модуля. Це важливо, оскільки код модуля може (прямо чи опосередковано) імпортувати сам себе; додавання його до :data:`sys.modules` заздалегідь запобігає необмеженій рекурсії в гіршому випадку та багаторазовому завантаженню в найкращому.

source: If loading fails, the failing module -- and only the failing module -- gets removed from :data:`sys.modules`. Any module already in the :data:`sys.modules` cache, and any module that was successfully loaded as a side-effect, must remain in the cache. This contrasts with reloading where even the failing module is left in :data:`sys.modules`.
uk: Якщо завантаження не вдасться, модуль із помилкою -- і тільки модуль із помилкою -- видаляється з :data:`sys.modules`. Будь-який модуль, який уже знаходиться в кеші :data:`sys.modules`, і будь-який модуль, який було успішно завантажено як побічний ефект, повинні залишатися в кеші. Це контрастує з перезавантаженням, коли навіть несправний модуль залишається в :data:`sys.modules`.

source: After the module is created but before execution, the import machinery sets the import-related module attributes ("_init_module_attrs" in the pseudo-code example above), as summarized in a :ref:`later section <import-mod-attrs>`.
uk: Після створення модуля, але перед його виконанням, механізм імпорту встановлює пов’язані з імпортом атрибути модуля ("_init_module_attrs" у наведеному вище прикладі псевдокоду), як підсумовано в :ref:`пізнішому розділі <import-mod-attrs>`.

source: Module execution is the key moment of loading in which the module's namespace gets populated. Execution is entirely delegated to the loader, which gets to decide what gets populated and how.
uk: Виконання модуля є ключовим моментом завантаження, під час якого простір імен модуля заповнюється. Виконання повністю делеговано завантажувачу, який вирішує, що заповнювати і як.

source: The module created during loading and passed to exec_module() may not be the one returned at the end of import [#fnlo]_.
uk: Модуль, створений під час завантаження та переданий у exec_module(), може не бути тим, що повертається в кінці імпорту [#fnlo]_.

source: The import system has taken over the boilerplate responsibilities of loaders. These were previously performed by the :meth:`importlib.abc.Loader.load_module` method.
uk: Система імпорту взяла на себе шаблонні обов’язки вантажників. Раніше вони виконувалися методом :meth:`importlib.abc.Loader.load_module`.

source: Loaders
uk: Вантажники

source: Module loaders provide the critical function of loading: module execution. The import machinery calls the :meth:`importlib.abc.Loader.exec_module` method with a single argument, the module object to execute. Any value returned from :meth:`~importlib.abc.Loader.exec_module` is ignored.
uk: Завантажувачі модулів забезпечують критичну функцію завантаження: виконання модуля. Механізм імпорту викликає метод :meth:`importlib.abc.Loader.exec_module` з одним аргументом, об’єктом модуля, який потрібно виконати. Будь-яке значення, повернуте з :meth:`~importlib.abc.Loader.exec_module` ігнорується.

source: Loaders must satisfy the following requirements:
uk: Вантажники повинні відповідати таким вимогам:

source: If the module is a Python module (as opposed to a built-in module or a dynamically loaded extension), the loader should execute the module's code in the module's global name space (``module.__dict__``).
uk: Якщо модуль є модулем Python (на відміну від вбудованого модуля або динамічно завантажуваного розширення), завантажувач повинен виконати код модуля в глобальному просторі імен модуля (``module.__dict__``).

source: If the loader cannot execute the module, it should raise an :exc:`ImportError`, although any other exception raised during :meth:`~importlib.abc.Loader.exec_module` will be propagated.
uk: Якщо завантажувач не може виконати модуль, він має викликати :exc:`ImportError`, хоча будь-які інші винятки, викликані під час :meth:`~importlib.abc.Loader.exec_module`, будуть поширені.

source: In many cases, the finder and loader can be the same object; in such cases the :meth:`~importlib.abc.MetaPathFinder.find_spec` method would just return a spec with the loader set to ``self``.
uk: У багатьох випадках шукач і завантажувач можуть бути одним і тим же об'єктом; у таких випадках метод :meth:`~importlib.abc.MetaPathFinder.find_spec` просто повертатиме специфікацію із завантажувачем, встановленим на ``self``.

source: Module loaders may opt in to creating the module object during loading by implementing a :meth:`~importlib.abc.Loader.create_module` method. It takes one argument, the module spec, and returns the new module object to use during loading. ``create_module()`` does not need to set any attributes on the module object. If the method returns ``None``, the import machinery will create the new module itself.
uk: Завантажувачі модулів можуть вибрати створення об’єкта модуля під час завантаження, реалізувавши метод :meth:`~importlib.abc.Loader.create_module`. Він приймає один аргумент, специфікацію модуля, і повертає новий об’єкт модуля для використання під час завантаження. ``create_module()`` не потребує встановлення жодних атрибутів для об’єкта модуля. Якщо метод повертає ``None``, механізм імпорту створить новий модуль сам.

source: The :meth:`~importlib.abc.Loader.create_module` method of loaders.
uk: Метод завантажувачів :meth:`~importlib.abc.Loader.create_module`.

source: The :meth:`~importlib.abc.Loader.load_module` method was replaced by :meth:`~importlib.abc.Loader.exec_module` and the import machinery assumed all the boilerplate responsibilities of loading.
uk: Метод :meth:`~importlib.abc.Loader.load_module` було замінено на :meth:`~importlib.abc.Loader.exec_module`, а механізм імпорту взяв на себе всі шаблонні обов’язки щодо завантаження.

source: For compatibility with existing loaders, the import machinery will use the ``load_module()`` method of loaders if it exists and the loader does not also implement ``exec_module()``. However, ``load_module()`` has been deprecated and loaders should implement ``exec_module()`` instead.
uk: Для сумісності з існуючими завантажувачами механізм імпорту використовуватиме метод завантажувачів ``load_module()``, якщо він існує, а завантажувач також не реалізує ``exec_module()``. Однак ``load_module()`` застаріло, і завантажувачі повинні використовувати ``exec_module()`` замість нього.

source: The ``load_module()`` method must implement all the boilerplate loading functionality described above in addition to executing the module. All the same constraints apply, with some additional clarification:
uk: Метод ``load_module()`` має реалізовувати всі стандартні функції завантаження, описані вище, на додаток до виконання модуля. Застосовуються ті самі обмеження з деякими додатковими уточненнями:

source: If there is an existing module object with the given name in :data:`sys.modules`, the loader must use that existing module. (Otherwise, :func:`importlib.reload` will not work correctly.) If the named module does not exist in :data:`sys.modules`, the loader must create a new module object and add it to :data:`sys.modules`.
uk: Якщо в :data:`sys.modules` є існуючий об’єкт модуля з вказаною назвою, завантажувач повинен використати цей існуючий модуль. (Інакше :func:`importlib.reload` не працюватиме належним чином.) Якщо названий модуль не існує в :data:`sys.modules`, завантажувач має створити новий об’єкт модуля та додати його до :data:`sys.modules`.

source: The module *must* exist in :data:`sys.modules` before the loader executes the module code, to prevent unbounded recursion or multiple loading.
uk: Модуль *має* існувати в :data:`sys.modules` до того, як завантажувач виконає код модуля, щоб запобігти необмеженій рекурсії або багаторазовому завантаженню.

source: If loading fails, the loader must remove any modules it has inserted into :data:`sys.modules`, but it must remove **only** the failing module(s), and only if the loader itself has loaded the module(s) explicitly.
uk: Якщо завантаження не вдається, завантажувач повинен видалити будь-які модулі, які він вставив у :data:`sys.modules`, але він повинен видалити **лише** модуль(и) з помилкою, і лише якщо завантажувач сам завантажив модуль( s) явно.

source: A :exc:`DeprecationWarning` is raised when ``exec_module()`` is defined but ``create_module()`` is not.
uk: :exc:`DeprecationWarning` виникає, коли ``exec_module()`` визначено, а ``create_module()`` ні.

source: An :exc:`ImportError` is raised when ``exec_module()`` is defined but ``create_module()`` is not.
uk: Помилка :exc:`ImportError` виникає, коли ``exec_module()`` визначено, а ``create_module()`` ні.

source: Use of ``load_module()`` will raise :exc:`ImportWarning`.
uk: Використання ``load_module()`` призведе до :exc:`ImportWarning`.

source: Submodules
uk: Підмодулі

source: When a submodule is loaded using any mechanism (e.g. ``importlib`` APIs, the ``import`` or ``import-from`` statements, or built-in ``__import__()``) a binding is placed in the parent module's namespace to the submodule object. For example, if package ``spam`` has a submodule ``foo``, after importing ``spam.foo``, ``spam`` will have an attribute ``foo`` which is bound to the submodule. Let's say you have the following directory structure::
uk: Коли підмодуль завантажується за допомогою будь-якого механізму (наприклад, ``importlib`` API, ``import`` або ``import-from`` оператори, або вбудований ``__import__()``), прив’язка розміщується в простір імен батьківського модуля до об’єкта підмодуля. Наприклад, якщо пакет ``spam`` має підмодуль ``foo``, після імпорту ``spam.foo``, ``spam`` матиме атрибут ``foo``, який прив’язаний до підмодуля. Скажімо, у вас є така структура каталогів:

source: and ``spam/__init__.py`` has the following line in it::
uk: а ``spam/__init__.py`` містить такий рядок::

source: then executing the following puts name bindings for ``foo`` and ``Foo`` in the ``spam`` module::
uk: потім виконання наступного ставить прив’язки імен для ``foo`` і ``Foo`` в ``spam`` модуль::

source: Given Python's familiar name binding rules this might seem surprising, but it's actually a fundamental feature of the import system. The invariant holding is that if you have ``sys.modules['spam']`` and ``sys.modules['spam.foo']`` (as you would after the above import), the latter must appear as the ``foo`` attribute of the former.
uk: Враховуючи знайомі правила прив’язки імен Python, це може здатися дивним, але насправді це фундаментальна функція системи імпорту. Незмінним є те, що якщо у вас є ``sys.modules['spam']`` і ``sys.modules['spam.foo']`` (як після імпорту вище), останній повинен відображатися як атрибут ``foo`` першого.

source: Module spec
uk: Специфікація модуля

source: The import machinery uses a variety of information about each module during import, especially before loading. Most of the information is common to all modules. The purpose of a module's spec is to encapsulate this import-related information on a per-module basis.
uk: Механізм імпорту використовує різноманітну інформацію про кожен модуль під час імпорту, особливо перед завантаженням. Більшість інформації є спільною для всіх модулів. Метою специфікації модуля є інкапсуляція цієї інформації, пов’язаної з імпортом, на основі кожного модуля.

source: Using a spec during import allows state to be transferred between import system components, e.g. between the finder that creates the module spec and the loader that executes it. Most importantly, it allows the import machinery to perform the boilerplate operations of loading, whereas without a module spec the loader had that responsibility.
uk: Використання специфікації під час імпорту дозволяє передавати стан між компонентами системи імпорту, наприклад. між шукачем, який створює специфікацію модуля, і завантажувачем, який його виконує. Найважливіше те, що це дозволяє імпортним механізмам виконувати стандартні операції завантаження, тоді як без специфікації модуля цю відповідальність несе завантажувач.

source: The module's spec is exposed as the ``__spec__`` attribute on a module object. See :class:`~importlib.machinery.ModuleSpec` for details on the contents of the module spec.
uk: Специфікація модуля представлена як атрибут ``__spec__`` в об’єкті модуля. Дивіться :class:`~importlib.machinery.ModuleSpec`, щоб дізнатися більше про вміст специфікації модуля.

source: Import-related module attributes
uk: Атрибути модуля, пов’язані з імпортом

source: The import machinery fills in these attributes on each module object during loading, based on the module's spec, before the loader executes the module.
uk: Механізм імпорту заповнює ці атрибути кожного об’єкта модуля під час завантаження на основі специфікації модуля, перш ніж завантажувач виконає модуль.

source: The ``__name__`` attribute must be set to the fully-qualified name of the module. This name is used to uniquely identify the module in the import system.
uk: Атрибут ``__name__`` має бути встановлений на повну назву модуля. Це ім’я використовується для унікальної ідентифікації модуля в системі імпорту.

source: The ``__loader__`` attribute must be set to the loader object that the import machinery used when loading the module. This is mostly for introspection, but can be used for additional loader-specific functionality, for example getting data associated with a loader.
uk: Атрибут ``__loader__`` повинен бути встановлений на об’єкт завантажувача, який імпорт використовував під час завантаження модуля. Це здебільшого для самоаналізу, але може використовуватися для додаткових функцій завантажувача, наприклад для отримання даних, пов’язаних із завантажувачем.

source: The module's ``__package__`` attribute must be set. Its value must be a string, but it can be the same value as its ``__name__``. When the module is a package, its ``__package__`` value should be set to its ``__name__``. When the module is not a package, ``__package__`` should be set to the empty string for top-level modules, or for submodules, to the parent package's name. See :pep:`366` for further details.
uk: Необхідно встановити атрибут ``__package__`` модуля. Його значення має бути рядком, але воно може збігатися з його ``__name__``. Якщо модуль є пакетом, його значення ``__package__`` має бути встановлено на його ``__name__``. Якщо модуль не є пакетом, для ``__package__`` має бути встановлено порожній рядок для модулів верхнього рівня або для підмодулів — ім’я батьківського пакета. Додаткові відомості див. :pep:`366`.

source: This attribute is used instead of ``__name__`` to calculate explicit relative imports for main modules, as defined in :pep:`366`. It is expected to have the same value as ``__spec__.parent``.
uk: Цей атрибут використовується замість ``__name__`` для обчислення явного відносного імпорту для основних модулів, як визначено в :pep:`366`. Очікується, що він матиме те саме значення, що й ``__spec__.parent``.

source: The value of ``__package__`` is expected to be the same as ``__spec__.parent``.
uk: Очікується, що значення ``__package__`` буде таким самим, як ``__spec__.parent``.

source: The ``__spec__`` attribute must be set to the module spec that was used when importing the module. Setting ``__spec__`` appropriately applies equally to :ref:`modules initialized during interpreter startup <programs>`. The one exception is ``__main__``, where ``__spec__`` is :ref:`set to None in some cases <main_spec>`.
uk: Атрибут ``__spec__`` має бути встановлений на специфікацію модуля, яка використовувалася під час імпорту модуля. Налаштування ``__spec__`` належним чином застосовується до :ref:`модулів, ініціалізованих під час запуску інтерпретатора <programs>`. Єдиним винятком є ``__main__``, де ``__spec__`` :ref:`встановлено на None у деяких випадках <main_spec>`.

source: When ``__package__`` is not defined, ``__spec__.parent`` is used as a fallback.
uk: Якщо ``__package__`` не визначено, ``__spec__.parent`` використовується як запасний варіант.

source: ``__spec__.parent`` is used as a fallback when ``__package__`` is not defined.
uk: ``__spec__.parent`` використовується як запасний варіант, коли ``__package__`` не визначено.

source: If the module is a package (either regular or namespace), the module object's ``__path__`` attribute must be set. The value must be iterable, but may be empty if ``__path__`` has no further significance. If ``__path__`` is not empty, it must produce strings when iterated over. More details on the semantics of ``__path__`` are given :ref:`below <package-path-rules>`.
uk: Якщо модуль є пакетом (звичайним або простором імен), необхідно встановити атрибут ``__path__`` об’єкта модуля. Значення має бути повторюваним, але може бути порожнім, якщо ``__path__`` не має подальшого значення. Якщо ``__path__`` не порожній, він повинен створювати рядки під час повторення. Детальніше про семантику ``__path__`` наведено :ref:`нижче <package-path-rules>`.

source: Non-package modules should not have a ``__path__`` attribute.
uk: Непакетні модулі не повинні мати атрибут ``__path__``.

source: By definition, if a module has a ``__path__`` attribute, it is a package.
uk: За визначенням, якщо модуль має атрибут ``__path__``, це пакет.
