Repository: python/python-docs-uk
Catalog: reference/import.po
Languages: uk

source: A package's ``__path__`` attribute is used during imports of its subpackages. Within the import machinery, it functions much the same as :data:`sys.path`, i.e. providing a list of locations to search for modules during import. However, ``__path__`` is typically much more constrained than :data:`sys.path`.
uk: Атрибут ``__path__`` пакета використовується під час імпорту його підпакетів. У механізмі імпорту він функціонує майже так само, як :data:`sys.path`, тобто надає список місць для пошуку модулів під час імпорту. Однак ``__path__`` зазвичай набагато більш обмежений, ніж :data:`sys.path`.

source: ``__path__`` must be an iterable of strings, but it may be empty. The same rules used for :data:`sys.path` also apply to a package's ``__path__``, and :data:`sys.path_hooks` (described below) are consulted when traversing a package's ``__path__``.
uk: ``__path__`` має бути повторюваним рядком, але він може бути порожнім. Ті самі правила, що використовуються для :data:`sys.path`, також застосовуються до ``__path__`` пакета, а :data:`sys.path_hooks` (описані нижче) звертаються під час проходження ``__path__`` пакета.

source: A package's ``__init__.py`` file may set or alter the package's ``__path__`` attribute, and this was typically the way namespace packages were implemented prior to :pep:`420`. With the adoption of :pep:`420`, namespace packages no longer need to supply ``__init__.py`` files containing only ``__path__`` manipulation code; the import machinery automatically sets ``__path__`` correctly for the namespace package.
uk: Файл ``__init__.py`` пакета може встановлювати або змінювати атрибут ``__path__`` пакета, і це був типовий спосіб реалізації пакетів простору імен до :pep:`420`. Із застосуванням :pep:`420` пакетам простору імен більше не потрібно надавати файли ``__init__.py``, що містять лише ``__path__`` код маніпуляції; механізм імпорту автоматично встановлює ``__path__`` правильно для пакета простору імен.

source: Module reprs
uk: Репрезентація модуля

source: By default, all modules have a usable repr, however depending on the attributes set above, and in the module's spec, you can more explicitly control the repr of module objects.
uk: За замовчуванням усі модулі мають придатне для використання відображення, однак, залежно від атрибутів, налаштованих вище, і в специфікації модуля ви можете чіткіше керувати відтворенням об’єктів модуля.

source: If the module has a spec (``__spec__``), the import machinery will try to generate a repr from it. If that fails or there is no spec, the import system will craft a default repr using whatever information is available on the module. It will try to use the ``module.__name__``, ``module.__file__``, and ``module.__loader__`` as input into the repr, with defaults for whatever information is missing.
uk: Якщо модуль має специфікацію (``__spec__``), механізм імпорту спробує згенерувати з неї repr. Якщо це не вдається або немає специфікації, система імпорту створить відображення за замовчуванням, використовуючи будь-яку інформацію, доступну в модулі. Він намагатиметься використати ``module.__name__``, ``module.__file__`` і ``module.__loader__`` як вхідні дані в repr, із значеннями за замовчуванням для будь-якої інформації, якої немає.

source: Here are the exact rules used:
uk: Ось точні правила, які використовуються:

source: If the module has a ``__spec__`` attribute, the information in the spec is used to generate the repr. The "name", "loader", "origin", and "has_location" attributes are consulted.
uk: Якщо модуль має атрибут ``__spec__``, інформація в специфікації використовується для створення repr. Переглядаються атрибути "name", "loader", "origin" і "has_location".

source: If the module has a ``__file__`` attribute, this is used as part of the module's repr.
uk: Якщо модуль має атрибут ``__file__``, він використовується як частина repr модуля.

source: If the module has no ``__file__`` but does have a ``__loader__`` that is not ``None``, then the loader's repr is used as part of the module's repr.
uk: Якщо модуль не має ``__file__``, але має ``__loader__``, який не є ``None``, тоді repr завантажувача використовується як частина repr модуля.

source: Otherwise, just use the module's ``__name__`` in the repr.
uk: В іншому випадку просто використовуйте ``__name__`` модуля в repr.

source: Use of :meth:`loader.module_repr() <importlib.abc.Loader.module_repr>` has been deprecated and the module spec is now used by the import machinery to generate a module repr.
uk: Використання :meth:`loader.module_repr() <importlib.abc.Loader.module_repr>` застаріло, і тепер специфікація модуля використовується механізмом імпорту для створення модуля repr.

source: For backward compatibility with Python 3.3, the module repr will be generated by calling the loader's :meth:`~importlib.abc.Loader.module_repr` method, if defined, before trying either approach described above. However, the method is deprecated.
uk: Для зворотної сумісності з Python 3.3 модуль repr буде згенеровано шляхом виклику методу :meth:`~importlib.abc.Loader.module_repr` завантажувача, якщо він визначений, перед спробою будь-якого з описаних вище підходів. Однак метод застарів.

source: Calling :meth:`~importlib.abc.Loader.module_repr` now occurs after trying to use a module's ``__spec__`` attribute but before falling back on ``__file__``. Use of :meth:`~importlib.abc.Loader.module_repr` is slated to stop in Python 3.12.
uk: Виклик :meth:`~importlib.abc.Loader.module_repr` тепер відбувається після спроби використати атрибут ``__spec__`` модуля, але перед поверненням до ``__file__``. Використання :meth:`~importlib.abc.Loader.module_repr` планується припинити в Python 3.12.

source: Cached bytecode invalidation
uk: Анулювання кешованого байт-коду

source: Before Python loads cached bytecode from a ``.pyc`` file, it checks whether the cache is up-to-date with the source ``.py`` file. By default, Python does this by storing the source's last-modified timestamp and size in the cache file when writing it. At runtime, the import system then validates the cache file by checking the stored metadata in the cache file against the source's metadata.
uk: Перед тим, як Python завантажить кешований байт-код із файлу ``.pyc``, він перевіряє, чи оновлений кеш із вихідним файлом ``.py``. За замовчуванням Python робить це, зберігаючи мітку часу останньої зміни джерела та розмір у файлі кешу під час його запису. Під час виконання система імпорту потім перевіряє кеш-файл, перевіряючи збережені в кеш-файлі метадані з метаданими джерела.

source: Python also supports "hash-based" cache files, which store a hash of the source file's contents rather than its metadata. There are two variants of hash-based ``.pyc`` files: checked and unchecked. For checked hash-based ``.pyc`` files, Python validates the cache file by hashing the source file and comparing the resulting hash with the hash in the cache file. If a checked hash-based cache file is found to be invalid, Python regenerates it and writes a new checked hash-based cache file. For unchecked hash-based ``.pyc`` files, Python simply assumes the cache file is valid if it exists. Hash-based ``.pyc`` files validation behavior may be overridden with the :option:`--check-hash-based-pycs` flag.
uk: Python також підтримує кеш-файли на основі хешів, які зберігають хеш вмісту вихідного файлу, а не його метаданих. Існує два варіанти хеш-файлів ``.pyc``: позначений і не позначений. Для перевірених хеш-файлів ``.pyc`` Python перевіряє файл кешу, хешуючи вихідний файл і порівнюючи отриманий хеш із хешем у файлі кешу. Якщо перевірений файл кешу на основі хешу виявляється недійсним, Python повторно генерує його та записує новий перевірений файл кешу на основі хешу. Для неперевірених файлів ``.pyc`` на основі хешу Python просто припускає, що файл кешу дійсний, якщо він існує. Поведінка перевірки файлів ``.pyc`` на основі хешу може бути замінена прапором :option:`--check-hash-based-pycs`.

source: Added hash-based ``.pyc`` files. Previously, Python only supported timestamp-based invalidation of bytecode caches.
uk: Додано файли ``.pyc`` на основі хешу. Раніше Python підтримував лише недійсність кешів байт-кодів на основі часових позначок.

source: The Path Based Finder
uk: Пошук на основі шляху

source: As mentioned previously, Python comes with several default meta path finders. One of these, called the :term:`path based finder` (:class:`~importlib.machinery.PathFinder`), searches an :term:`import path`, which contains a list of :term:`path entries <path entry>`. Each path entry names a location to search for modules.
uk: Як згадувалося раніше, Python поставляється з декількома типовими засобами пошуку меташляхів. Один із них, який називається :term:`пошук на основі шляху` (:class:`~importlib.machinery.PathFinder`), шукає :term:`шлях імпорту`, який містить список :term:`записів шляху <path entry>`. Кожен запис шляху називає розташування для пошуку модулів.

source: The path based finder itself doesn't know how to import anything. Instead, it traverses the individual path entries, associating each of them with a path entry finder that knows how to handle that particular kind of path.
uk: Сам шукач на основі шляху не знає, як нічого імпортувати. Замість цього він проходить окремі записи шляху, пов’язуючи кожен із них із інструментом пошуку записів шляху, який знає, як обробляти цей конкретний шлях.

source: The default set of path entry finders implement all the semantics for finding modules on the file system, handling special file types such as Python source code (``.py`` files), Python byte code (``.pyc`` files) and shared libraries (e.g. ``.so`` files). When supported by the :mod:`zipimport` module in the standard library, the default path entry finders also handle loading all of these file types (other than shared libraries) from zipfiles.
uk: Стандартний набір засобів пошуку шляхів реалізує всю семантику для пошуку модулів у файловій системі, обробки спеціальних типів файлів, таких як вихідний код Python (файли ``.py``), байт-код Python (файли ``.pyc``) і спільні бібліотеки (наприклад, файли ``.so``). Якщо підтримується модулем :mod:`zipimport` у стандартній бібліотеці, засоби пошуку шляхів за замовчуванням також обробляють завантаження всіх цих типів файлів (окрім спільних бібліотек) із файлів zip.

source: Path entries need not be limited to file system locations. They can refer to URLs, database queries, or any other location that can be specified as a string.
uk: Записи шляху не повинні обмежуватися розташуванням файлової системи. Вони можуть посилатися на URL-адреси, запити до бази даних або будь-яке інше розташування, яке можна вказати як рядок.

source: The path based finder provides additional hooks and protocols so that you can extend and customize the types of searchable path entries. For example, if you wanted to support path entries as network URLs, you could write a hook that implements HTTP semantics to find modules on the web. This hook (a callable) would return a :term:`path entry finder` supporting the protocol described below, which was then used to get a loader for the module from the web.
uk: Шукач на основі шляху надає додаткові перехоплювачі та протоколи, щоб ви могли розширювати та налаштовувати типи записів шляху для пошуку. Наприклад, якщо ви хочете підтримувати записи шляху як мережеві URL-адреси, ви можете написати хук, який реалізує семантику HTTP для пошуку модулів в Інтернеті. Цей хук (об’єкт виклику) повертав би :term:`path entry finder`, що підтримує описаний нижче протокол, який потім використовувався для отримання завантажувача для модуля з Інтернету.

source: A word of warning: this section and the previous both use the term *finder*, distinguishing between them by using the terms :term:`meta path finder` and :term:`path entry finder`. These two types of finders are very similar, support similar protocols, and function in similar ways during the import process, but it's important to keep in mind that they are subtly different. In particular, meta path finders operate at the beginning of the import process, as keyed off the :data:`sys.meta_path` traversal.
uk: Попередження: у цьому та попередньому розділах використовується термін *finder*, розрізняючи їх за допомогою термінів :term:`meta path finder` і :term:`path entry finder`. Ці два типи шукачів дуже схожі, підтримують схожі протоколи та функціонують однаково під час процесу імпорту, але важливо мати на увазі, що вони дещо відрізняються. Зокрема, шукачі меташляху працюють на початку процесу імпорту, як ключ від обходу :data:`sys.meta_path`.

source: By contrast, path entry finders are in a sense an implementation detail of the path based finder, and in fact, if the path based finder were to be removed from :data:`sys.meta_path`, none of the path entry finder semantics would be invoked.
uk: Навпаки, засоби пошуку запису шляху є в певному сенсі деталлю реалізації засобу пошуку шляху, і фактично, якби засіб пошуку шляху було вилучено з :data:`sys.meta_path`, жодна семантика засобу пошуку шляху не буде викликатися.

source: Path entry finders
uk: Шукачі входу в шлях

source: The :term:`path based finder` is responsible for finding and loading Python modules and packages whose location is specified with a string :term:`path entry`. Most path entries name locations in the file system, but they need not be limited to this.
uk: :term:`path based finder` відповідає за пошук і завантаження модулів і пакетів Python, розташування яких вказано за допомогою рядка :term:`path entry`. Більшість записів шляхів іменують розташування у файловій системі, але вони не повинні обмежуватися цим.

source: As a meta path finder, the :term:`path based finder` implements the :meth:`~importlib.abc.MetaPathFinder.find_spec` protocol previously described, however it exposes additional hooks that can be used to customize how modules are found and loaded from the :term:`import path`.
uk: Як мета-пошук шляху, :term:`пошук на основі шляху <path based finder>` реалізує :meth:`~importlib.abc.MetaPathFinder.find_spec` протокол, описаний раніше, однак він надає додаткові перехоплювачі, які можна використовувати для налаштування способу пошуку модулів і завантажується з :term:`шляху імпорту <import path>`.

source: Three variables are used by the :term:`path based finder`, :data:`sys.path`, :data:`sys.path_hooks` and :data:`sys.path_importer_cache`. The ``__path__`` attributes on package objects are also used. These provide additional ways that the import machinery can be customized.
uk: Три змінні використовуються :term:`path based finder`, :data:`sys.path`, :data:`sys.path_hooks` і :data:`sys.path_importer_cache`. Також використовуються атрибути ``__path__`` об’єктів пакета. Це надає додаткові способи налаштування імпортного обладнання.

source: :data:`sys.path` contains a list of strings providing search locations for modules and packages. It is initialized from the :data:`PYTHONPATH` environment variable and various other installation- and implementation-specific defaults. Entries in :data:`sys.path` can name directories on the file system, zip files, and potentially other "locations" (see the :mod:`site` module) that should be searched for modules, such as URLs, or database queries. Only strings and bytes should be present on :data:`sys.path`; all other data types are ignored. The encoding of bytes entries is determined by the individual :term:`path entry finders <path entry finder>`.
uk: :data:`sys.path` містить список рядків, що містять місця пошуку для модулів і пакетів. Він ініціалізується зі змінної оточення :data:`PYTHONPATH` та інших інших значень за замовчуванням, які залежать від інсталяції та реалізації. Записи в :data:`sys.path` можуть іменувати каталоги у файловій системі, zip-файли та потенційно інші "розташування" (див. модуль :mod:`site`), у яких слід шукати модулі, наприклад URL-адреси або запити до бази даних. У :data:`sys.path` мають бути лише рядки та байти; всі інші типи даних ігноруються. Кодування записів байтів визначається окремими :term:`засобами пошуку записів шляху <path entry finder>`.

source: The :term:`path based finder` is a :term:`meta path finder`, so the import machinery begins the :term:`import path` search by calling the path based finder's :meth:`~importlib.machinery.PathFinder.find_spec` method as described previously. When the ``path`` argument to :meth:`~importlib.machinery.PathFinder.find_spec` is given, it will be a list of string paths to traverse - typically a package's ``__path__`` attribute for an import within that package. If the ``path`` argument is ``None``, this indicates a top level import and :data:`sys.path` is used.
uk: :term:`пошук на основі шляху <meta path finder>` є :term:`метапошуком шляху <meta path finder>`, тому механізм імпорту починає пошук :term:`шляху імпорту <import path>`, викликаючи :meth:`~importlib.machinery.PathFinder засобу пошуку на основі шляху метод .find_spec, як описано раніше. Коли вказано аргумент ``path`` для :meth:`~importlib.machinery.PathFinder.find_spec`, це буде список шляхів до рядків, які потрібно пройти - зазвичай атрибут ``__path__`` пакета для імпорту в цьому пакет. Якщо аргумент ``path`` має значення ``None``, це вказує на імпорт верхнього рівня та :data:`sys.path` використовується.

source: The path based finder iterates over every entry in the search path, and for each of these, looks for an appropriate :term:`path entry finder` (:class:`~importlib.abc.PathEntryFinder`) for the path entry. Because this can be an expensive operation (e.g. there may be `stat()` call overheads for this search), the path based finder maintains a cache mapping path entries to path entry finders. This cache is maintained in :data:`sys.path_importer_cache` (despite the name, this cache actually stores finder objects rather than being limited to :term:`importer` objects). In this way, the expensive search for a particular :term:`path entry` location's :term:`path entry finder` need only be done once. User code is free to remove cache entries from :data:`sys.path_importer_cache` forcing the path based finder to perform the path entry search again [#fnpic]_.
uk: Шукач на основі шляху повторює кожен запис у шляху пошуку та для кожного з них шукає відповідний :term:`path entry finder` (:class:`~importlib.abc.PathEntryFinder`) для запису шляху. Оскільки це може бути дорогою операцією (наприклад, для цього пошуку можуть виникати додаткові витрати на виклик `stat()`), засіб пошуку на основі шляху підтримує кеш-пам’ять записів шляхів у засоби пошуку записів шляху. Цей кеш зберігається в :data:`sys.path_importer_cache` (незважаючи на назву, цей кеш насправді зберігає об’єкти пошуку, а не обмежується об’єктами :term:`importer`). Таким чином, дорогий пошук конкретного :term:`path entry` розташування :term:`path entry finder` потрібно виконати лише один раз. Код користувача може вільно видаляти записи кешу з :data:`sys.path_importer_cache`, змушуючи шукач на основі шляху знову виконати пошук запису шляху [#fnpic]_.

source: If the path entry is not present in the cache, the path based finder iterates over every callable in :data:`sys.path_hooks`. Each of the :term:`path entry hooks <path entry hook>` in this list is called with a single argument, the path entry to be searched. This callable may either return a :term:`path entry finder` that can handle the path entry, or it may raise :exc:`ImportError`. An :exc:`ImportError` is used by the path based finder to signal that the hook cannot find a :term:`path entry finder` for that :term:`path entry`. The exception is ignored and :term:`import path` iteration continues. The hook should expect either a string or bytes object; the encoding of bytes objects is up to the hook (e.g. it may be a file system encoding, UTF-8, or something else), and if the hook cannot decode the argument, it should raise :exc:`ImportError`.
uk: Якщо запису шляху немає в кеші, пошук на основі шляху повторює кожен виклик у :data:`sys.path_hooks`. Кожен із :term:`перехоплювачів запису шляху <path entry hook>` у цьому списку викликається з одним аргументом, записом шляху, який потрібно шукати. Цей виклик може повертати :term:`пошук запису шляху <path entry finder>`, який може обробити запис шляху, або може викликати :exc:`ImportError`. Помилка :exc:`ImportError` використовується шукачем на основі шляху, щоб сигналізувати про те, що хук не може знайти :term:`пошук запису шляху <path entry finder>` для цього :term:`запису шляху <path entry>`. Виняток ігнорується, і повторення :term:`шляху імпорту <import path>` продовжується. Хук повинен очікувати об'єкт string або bytes; кодування об’єктів bytes залежить від хука (наприклад, це може бути кодування файлової системи, UTF-8 або щось інше), і якщо хук не може декодувати аргумент, він має викликати :exc:`ImportError`.

source: If :data:`sys.path_hooks` iteration ends with no :term:`path entry finder` being returned, then the path based finder's :meth:`~importlib.machinery.PathFinder.find_spec` method will store ``None`` in :data:`sys.path_importer_cache` (to indicate that there is no finder for this path entry) and return ``None``, indicating that this :term:`meta path finder` could not find the module.
uk: Якщо :data:`sys.path_hooks` ітерація закінчується без повернення :term:`path entry finder`, тоді метод пошуку на основі шляху :meth:`~importlib.machinery.PathFinder.find_spec` зберігатиме ``None`` у :data:`sys.path_importer_cache` (щоб вказати, що немає засобу пошуку для цього запису шляху) і повернути ``None``, вказуючи, що цей :term:`meta path finder` не зміг знайти модуль.

source: If a :term:`path entry finder` *is* returned by one of the :term:`path entry hook` callables on :data:`sys.path_hooks`, then the following protocol is used to ask the finder for a module spec, which is then used when loading the module.
uk: Якщо :term:`path entry finder` *повертається* одним із викликів :term:`path entry hook` на :data:`sys.path_hooks`, тоді використовується наступний протокол, щоб запитати модуль на пошуковик spec, який потім використовується під час завантаження модуля.

source: The current working directory -- denoted by an empty string -- is handled slightly differently from other entries on :data:`sys.path`. First, if the current working directory is found to not exist, no value is stored in :data:`sys.path_importer_cache`. Second, the value for the current working directory is looked up fresh for each module lookup. Third, the path used for :data:`sys.path_importer_cache` and returned by :meth:`importlib.machinery.PathFinder.find_spec` will be the actual current working directory and not the empty string.
uk: Поточний робочий каталог, позначений порожнім рядком, обробляється дещо інакше, ніж інші записи в :data:`sys.path`. По-перше, якщо поточний робочий каталог не існує, жодне значення не зберігається в :data:`sys.path_importer_cache`. По-друге, значення для поточного робочого каталогу оновлюється для кожного пошуку модуля. По-третє, шлях, який використовується для :data:`sys.path_importer_cache` і повертається :meth:`importlib.machinery.PathFinder.find_spec`, буде фактичним поточним робочим каталогом, а не порожнім рядком.

source: Path entry finder protocol
uk: Протокол пошуку входу шляху

source: In order to support imports of modules and initialized packages and also to contribute portions to namespace packages, path entry finders must implement the :meth:`~importlib.abc.PathEntryFinder.find_spec` method.
uk: Для того, щоб підтримувати імпорт модулів та ініціалізованих пакетів, а також вносити частини до пакетів простору імен, засоби пошуку запису шляху повинні реалізувати метод :meth:`~importlib.abc.PathEntryFinder.find_spec`.
