Repository: python/python-docs-uk
Catalog: reference/introduction.po
Languages: uk

source: Introduction
uk: вступ

source: This reference manual describes the Python programming language. It is not intended as a tutorial.
uk: Цей довідковий посібник описує мову програмування Python. Він не призначений як підручник.

source: While I am trying to be as precise as possible, I chose to use English rather than formal specifications for everything except syntax and lexical analysis. This should make the document more understandable to the average reader, but will leave room for ambiguities. Consequently, if you were coming from Mars and tried to re-implement Python from this document alone, you might have to guess things and in fact you would probably end up implementing quite a different language. On the other hand, if you are using Python and wonder what the precise rules about a particular area of the language are, you should definitely be able to find them here. If you would like to see a more formal definition of the language, maybe you could volunteer your time --- or invent a cloning machine :-).
uk: Хоча я намагаюся бути максимально точним, я вирішив використовувати англійську, а не формальні специфікації для всього, крім синтаксису та лексичного аналізу. Це повинно зробити документ більш зрозумілим для пересічного читача, але залишить місце для неоднозначностей. Отже, якби ви прилетіли з Марса й спробували повторно впровадити Python лише з цього документу, вам, можливо, доведеться щось здогадуватися, і насправді ви, ймовірно, закінчили б впровадженням зовсім іншої мови. З іншого боку, якщо ви використовуєте Python і вам цікаво, якими є точні правила щодо певної області мови, ви точно зможете знайти їх тут. Якщо ви бажаєте побачити більш формальне визначення мови, можливо, ви можете приділити свій час --- або винайти машину для клонування :-).

source: It is dangerous to add too many implementation details to a language reference document --- the implementation may change, and other implementations of the same language may work differently. On the other hand, CPython is the one Python implementation in widespread use (although alternate implementations continue to gain support), and its particular quirks are sometimes worth being mentioned, especially where the implementation imposes additional limitations. Therefore, you'll find short "implementation notes" sprinkled throughout the text.
uk: Небезпечно додавати забагато деталей реалізації до довідкового документа про мову -- реалізація може змінитися, а інші реалізації тієї самої мови можуть працювати по-різному. З іншого боку, CPython є єдиною реалізацією Python, яка широко використовується (хоча альтернативні реалізації продовжують отримувати підтримку), і іноді варто згадати його особливості, особливо якщо реалізація накладає додаткові обмеження. Таким чином, ви знайдете короткі "нотатки щодо реалізації", розкидані по всьому тексту.

source: Every Python implementation comes with a number of built-in and standard modules. These are documented in :ref:`library-index`. A few built-in modules are mentioned when they interact in a significant way with the language definition.
uk: Кожна реалізація Python має низку вбудованих і стандартних модулів. Вони задокументовані в :ref:`library-index`. Кілька вбудованих модулів згадуються, коли вони суттєво взаємодіють із визначенням мови.

source: Alternate Implementations
uk: Альтернативні реалізації

source: Though there is one Python implementation which is by far the most popular, there are some alternate implementations which are of particular interest to different audiences.
uk: Хоча існує одна реалізація Python, яка на сьогоднішній день є найпопулярнішою, є кілька альтернативних реалізацій, які становлять особливий інтерес для різних аудиторій.

source: Known implementations include:
uk: Відомі реалізації включають:

source: This is the original and most-maintained implementation of Python, written in C. New language features generally appear here first.
uk: Це оригінальна і найбільш підтримувана реалізація Python, написана мовою C. Нові функції мови зазвичай з’являються тут першими.

source: Python implemented in Java. This implementation can be used as a scripting language for Java applications, or can be used to create applications using the Java class libraries. It is also often used to create tests for Java libraries. More information can be found at `the Jython website <http://www.jython.org/>`_.
uk: Python реалізований на Java. Цю реалізацію можна використовувати як мову сценаріїв для програм Java або для створення програм за допомогою бібліотек класів Java. Він також часто використовується для створення тестів для бібліотек Java. Більше інформації можна знайти на `веб-сайті Jython <http://www.jython.org/>`_.

source: Python for .NET
uk: Python для .NET

source: This implementation actually uses the CPython implementation, but is a managed .NET application and makes .NET libraries available. It was created by Brian Lloyd. For more information, see the `Python for .NET home page <https://pythonnet.github.io/>`_.
uk: Ця реалізація фактично використовує реалізацію CPython, але є керованою програмою .NET і робить доступними бібліотеки .NET. Його створив Браян Ллойд. Щоб отримати додаткові відомості, перегляньте `домашню сторінку Python для .NET <https://pythonnet.github.io/>`_.

source: An alternate Python for .NET. Unlike Python.NET, this is a complete Python implementation that generates IL, and compiles Python code directly to .NET assemblies. It was created by Jim Hugunin, the original creator of Jython. For more information, see `the IronPython website <http://ironpython.net/>`_.
uk: Альтернативний Python для .NET. На відміну від Python.NET, це повна реалізація Python, яка генерує IL і компілює код Python безпосередньо до збірок .NET. Його створив Джим Гугунін, оригінальний творець Jython. Для отримання додаткової інформації перегляньте `веб-сайт IronPython <http://ironpython.net/>`_.

source: An implementation of Python written completely in Python. It supports several advanced features not found in other implementations like stackless support and a Just in Time compiler. One of the goals of the project is to encourage experimentation with the language itself by making it easier to modify the interpreter (since it is written in Python). Additional information is available on `the PyPy project's home page <http://pypy.org/>`_.
uk: Реалізація Python, повністю написана на Python. Він підтримує кілька розширених функцій, яких немає в інших реалізаціях, як-от безстекова підтримка та компілятор Just in Time. Однією з цілей проекту є заохочення експериментувати з самою мовою, спрощуючи модифікацію інтерпретатора (оскільки він написаний на Python). Додаткова інформація доступна на `домашній сторінці проекту PyPy <http://pypy.org/>`_.

source: Each of these implementations varies in some way from the language as documented in this manual, or introduces specific information beyond what's covered in the standard Python documentation. Please refer to the implementation-specific documentation to determine what else you need to know about the specific implementation you're using.
uk: Кожна з цих реалізацій певним чином відрізняється від мови, задокументованої в цьому посібнику, або вводить певну інформацію, окрім того, що описано в стандартній документації Python. Зверніться до документації щодо реалізації, щоб визначити, що ще вам потрібно знати про конкретну реалізацію, яку ви використовуєте.

source: Notation
uk: Позначення

source: The descriptions of lexical analysis and syntax use a modified BNF grammar notation. This uses the following style of definition:
uk: В описах лексичного аналізу та синтаксису використовується модифікована нотація граматики BNF. Тут використовується такий стиль визначення:

source: The first line says that a ``name`` is an ``lc_letter`` followed by a sequence of zero or more ``lc_letter``\ s and underscores. An ``lc_letter`` in turn is any of the single characters ``'a'`` through ``'z'``. (This rule is actually adhered to for the names defined in lexical and grammar rules in this document.)
uk: Перший рядок говорить, що ``name`` є ``lc_letter``, за яким слідує послідовність нуля або більше ``lc_letter``\ і підкреслення. ``lc_letter``, у свою чергу, є будь-яким із окремих символів ``'a'`` до ``'z'``. (Це правило фактично дотримується для імен, визначених у лексичних і граматичних правилах у цьому документі.)

source: Each rule begins with a name (which is the name defined by the rule) and ``::=``. A vertical bar (``|``) is used to separate alternatives; it is the least binding operator in this notation. A star (``*``) means zero or more repetitions of the preceding item; likewise, a plus (``+``) means one or more repetitions, and a phrase enclosed in square brackets (``[ ]``) means zero or one occurrences (in other words, the enclosed phrase is optional). The ``*`` and ``+`` operators bind as tightly as possible; parentheses are used for grouping. Literal strings are enclosed in quotes. White space is only meaningful to separate tokens. Rules are normally contained on a single line; rules with many alternatives may be formatted alternatively with each line after the first beginning with a vertical bar.
uk: Кожне правило починається з назви (яка є назвою, визначеною правилом) і ``::=``. Вертикальна риска (``|``) використовується для розділення альтернатив; це найменш обов'язковий оператор у цій нотації. Зірочка (``*``) означає нуль або більше повторень попереднього елемента; аналогічно, плюс (``+``) означає одне або більше повторень, а фраза, взята в квадратні дужки (``[ ]``), означає нуль або одне повторення (іншими словами, фраза всередині є необов’язковою). Оператори ``*`` і ``+`` прив'язуються якомога тісніше; дужки використовуються для групування. Літеральні рядки беруться в лапки. Пробіл має значення лише для розділення токенів. Зазвичай правила містяться в одному рядку; правила з багатьма альтернативами можуть бути відформатовані альтернативно, коли кожен рядок після першого починається з вертикальної смуги.

source: In lexical definitions (as the example above), two more conventions are used: Two literal characters separated by three dots mean a choice of any single character in the given (inclusive) range of ASCII characters. A phrase between angular brackets (``<...>``) gives an informal description of the symbol defined; e.g., this could be used to describe the notion of 'control character' if needed.
uk: У лексичних визначеннях (як у прикладі вище) використовуються ще дві конвенції: два літеральні символи, розділені трьома крапками, означають вибір будь-якого окремого символу в заданому (включно) діапазоні символів ASCII. Фраза в кутових дужках (``<...>``) дає неформальний опис визначеного символу; наприклад, це можна використовувати для опису поняття "керуючий характер", якщо це необхідно.

source: Even though the notation used is almost the same, there is a big difference between the meaning of lexical and syntactic definitions: a lexical definition operates on the individual characters of the input source, while a syntax definition operates on the stream of tokens generated by the lexical analysis. All uses of BNF in the next chapter ("Lexical Analysis") are lexical definitions; uses in subsequent chapters are syntactic definitions.
uk: Незважаючи на те, що використана нотація майже однакова, існує велика різниця між значенням лексичних і синтаксичних визначень: лексичне визначення працює з окремими символами джерела вхідних даних, тоді як визначення синтаксису працює з потоком лексем, згенерованих лексичний аналіз. Усі використання BNF у наступному розділі ("Лексичний аналіз") є лексичними визначеннями; використання в наступних розділах є синтаксичними визначеннями.
