Repository: python/python-docs-uk
Catalog: reference/lexical_analysis.po
Languages: uk

source: An imaginary literal yields a complex number with a real part of 0.0. Complex numbers are represented as a pair of floating point numbers and have the same restrictions on their range. To create a complex number with a nonzero real part, add a floating point number to it, e.g., ``(3+4j)``. Some examples of imaginary literals::
uk: Уявний літерал дає комплексне число з дійсною частиною 0,0. Комплексні числа представлені у вигляді пари чисел з плаваючою комою та мають однакові обмеження щодо свого діапазону. Щоб створити комплексне число з ненульовою дійсною частиною, додайте до нього число з плаваючою комою, наприклад, ``(3+4j)``. Деякі приклади уявних літералів:

source: Operators
uk: Оператори

source: The following tokens are operators:
uk: Наступні токени є операторами:

source: Delimiters
uk: Роздільники

source: The following tokens serve as delimiters in the grammar:
uk: Наступні лексеми служать роздільниками в граматиці:

source: The period can also occur in floating-point and imaginary literals. A sequence of three periods has a special meaning as an ellipsis literal. The second half of the list, the augmented assignment operators, serve lexically as delimiters, but also perform an operation.
uk: Крапка також може зустрічатися в літералах із плаваючою комою та уявних літералах. Послідовність із трьох періодів має особливе значення як літерали еліпсису. Друга половина списку, розширені оператори присвоєння, лексично служать роздільниками, але також виконують операції.

source: The following printing ASCII characters have special meaning as part of other tokens or are otherwise significant to the lexical analyzer:
uk: Наступні друковані символи ASCII мають спеціальне значення як частина інших токенів або іншим чином важливі для лексичного аналізатора:

source: The following printing ASCII characters are not used in Python. Their occurrence outside string literals and comments is an unconditional error:
uk: Наступні друковані символи ASCII не використовуються в Python. Їх поява поза рядковими літералами та коментарями є безумовною помилкою:

source: Footnotes
uk: Виноски
