Repository: python/python-docs-uk
Catalog: reference/lexical_analysis.po
Languages: uk

source: Lexical analysis
uk: Лексичний аналіз

source: A Python program is read by a *parser*. Input to the parser is a stream of *tokens*, generated by the *lexical analyzer*. This chapter describes how the lexical analyzer breaks a file into tokens.
uk: Програма Python читається *парсером*. Вхідними даними для аналізатора є потік *токенів*, згенерованих *лексичним аналізатором*. У цьому розділі описано, як лексичний аналізатор розбиває файл на токени.

source: Python reads program text as Unicode code points; the encoding of a source file can be given by an encoding declaration and defaults to UTF-8, see :pep:`3120` for details. If the source file cannot be decoded, a :exc:`SyntaxError` is raised.
uk: Python читає текст програми як кодові точки Unicode; кодування вихідного файлу може бути задано декларацією кодування та за замовчуванням UTF-8, подробиці див. :pep:`3120`. Якщо вихідний файл не може бути декодований, виникає :exc:`SyntaxError`.

source: Line structure
uk: Лінійна структура

source: A Python program is divided into a number of *logical lines*.
uk: Програма Python розділена на кілька *логічних рядків*.

source: Logical lines
uk: Логічні лінії

source: The end of a logical line is represented by the token NEWLINE. Statements cannot cross logical line boundaries except where NEWLINE is allowed by the syntax (e.g., between statements in compound statements). A logical line is constructed from one or more *physical lines* by following the explicit or implicit *line joining* rules.
uk: Кінець логічного рядка представлено маркером NEWLINE. Інструкції не можуть перетинати межі логічного рядка, за винятком випадків, коли синтаксис дозволяє NEWLINE (наприклад, між операторами в складених операторах). Логічна лінія складається з однієї або кількох *фізичних ліній* за дотриманням явних або неявних правил *об’єднання ліній*.

source: Physical lines
uk: Фізичні лінії

source: A physical line is a sequence of characters terminated by an end-of-line sequence. In source files and strings, any of the standard platform line termination sequences can be used - the Unix form using ASCII LF (linefeed), the Windows form using the ASCII sequence CR LF (return followed by linefeed), or the old Macintosh form using the ASCII CR (return) character. All of these forms can be used equally, regardless of platform. The end of input also serves as an implicit terminator for the final physical line.
uk: Фізичний рядок — це послідовність символів, що завершується послідовністю в кінці рядка. У вихідних файлах і рядках можна використовувати будь-яку зі стандартних послідовностей завершення рядків платформи – форму Unix із використанням ASCII LF (переведення рядка), форму Windows із використанням послідовності ASCII CR LF (повернення з наступним переходом рядка) або стару форму Macintosh із використанням символ ASCII CR (повернення). Усі ці форми можна використовувати однаково, незалежно від платформи. Кінець введення також служить неявним термінатором для останнього фізичного рядка.

source: When embedding Python, source code strings should be passed to Python APIs using the standard C conventions for newline characters (the ``\n`` character, representing ASCII LF, is the line terminator).
uk: Під час вбудовування Python рядки вихідного коду слід передавати в API Python, використовуючи стандартні угоди C для символів нового рядка (символ ``\n``, що представляє ASCII LF, є символом закінчення рядка).

source: Comments
uk: Коментарі

source: A comment starts with a hash character (``#``) that is not part of a string literal, and ends at the end of the physical line. A comment signifies the end of the logical line unless the implicit line joining rules are invoked. Comments are ignored by the syntax.
uk: Коментар починається з символу решетки (``#``), який не є частиною рядкового літералу, і закінчується в кінці фізичного рядка. Коментар означає кінець логічного рядка, якщо не викликаються неявні правила з’єднання рядків. Коментарі ігноруються синтаксисом.

source: Encoding declarations
uk: Оголошення кодування

source: If a comment in the first or second line of the Python script matches the regular expression ``coding[=:]\s*([-\w.]+)``, this comment is processed as an encoding declaration; the first group of this expression names the encoding of the source code file. The encoding declaration must appear on a line of its own. If it is the second line, the first line must also be a comment-only line. The recommended forms of an encoding expression are ::
uk: Якщо коментар у першому чи другому рядку сценарію Python відповідає регулярному виразу ``coding[=:]\s*([-\w.]+)``, цей коментар обробляється як оголошення кодування; перша група цього виразу називає кодування файлу вихідного коду. Оголошення кодування має з’являтися в окремому рядку. Якщо це другий рядок, перший рядок також має бути рядком лише для коментарів. Рекомендовані форми виразу кодування:

source: which is recognized also by GNU Emacs, and ::
uk: який також розпізнається GNU Emacs і ::

source: which is recognized by Bram Moolenaar's VIM.
uk: який розпізнається VIM Брема Муленаара.

source: If no encoding declaration is found, the default encoding is UTF-8. In addition, if the first bytes of the file are the UTF-8 byte-order mark (``b'\xef\xbb\xbf'``), the declared file encoding is UTF-8 (this is supported, among others, by Microsoft's :program:`notepad`).
uk: Якщо кодування не знайдено, кодуванням за замовчуванням є UTF-8. Крім того, якщо перші байти файлу є позначкою порядку байтів UTF-8 (``b'\xef\xbb\xbf''``), заявленим кодуванням файлу є UTF-8 (це підтримується, серед інших :program:`notepad` від Microsoft).

source: If an encoding is declared, the encoding name must be recognized by Python (see :ref:`standard-encodings`). The encoding is used for all lexical analysis, including string literals, comments and identifiers.
uk: Якщо оголошено кодування, Python має розпізнавати назву кодування (див. :ref:`standard-encodings`). Кодування використовується для всього лексичного аналізу, включаючи рядкові літерали, коментарі та ідентифікатори.

source: Explicit line joining
uk: Явне з'єднання рядків

source: Two or more physical lines may be joined into logical lines using backslash characters (``\``), as follows: when a physical line ends in a backslash that is not part of a string literal or comment, it is joined with the following forming a single logical line, deleting the backslash and the following end-of-line character. For example::
uk: Два або більше фізичних рядків можна об’єднати в логічні рядки за допомогою символів зворотної похилої риски (``\``), таким чином: коли фізичний рядок закінчується зворотною похилою рискою, яка не є частиною рядкового літералу чи коментаря, він об’єднується за допомогою наступного: утворюючи один логічний рядок, видаляючи зворотну косу риску та наступний символ кінця рядка. Наприклад::

source: A line ending in a backslash cannot carry a comment. A backslash does not continue a comment. A backslash does not continue a token except for string literals (i.e., tokens other than string literals cannot be split across physical lines using a backslash). A backslash is illegal elsewhere on a line outside a string literal.
uk: Рядок, який закінчується зворотною скісною рискою, не може містити коментаря. Зворотна коса риска не продовжує коментар. Зворотний слеш не продовжує лексему, за винятком рядкових літералів (тобто лексеми, окрім рядкових літералів, не можна розділити на фізичні рядки за допомогою зворотної похилої риски). Зворотний слеш неприпустимий в іншому місці рядка за межами рядкового літералу.

source: Implicit line joining
uk: Неявне з'єднання ліній

source: Expressions in parentheses, square brackets or curly braces can be split over more than one physical line without using backslashes. For example::
uk: Вирази в дужках, квадратних або фігурних дужках можна розділити на кілька фізичних рядків без використання зворотних скісних риск. Наприклад::

source: Implicitly continued lines can carry comments. The indentation of the continuation lines is not important. Blank continuation lines are allowed. There is no NEWLINE token between implicit continuation lines. Implicitly continued lines can also occur within triple-quoted strings (see below); in that case they cannot carry comments.
uk: Неявно продовжені рядки можуть містити коментарі. Відступ рядків продовження не важливий. Допускаються порожні рядки продовження. Немає маркера NEWLINE між рядками неявного продовження. Неявно продовжені рядки також можуть зустрічатися в рядках із потрійними лапками (див. нижче); у цьому випадку вони не можуть нести коментарі.

source: Blank lines
uk: Порожні рядки

source: A logical line that contains only spaces, tabs, formfeeds and possibly a comment, is ignored (i.e., no NEWLINE token is generated). During interactive input of statements, handling of a blank line may differ depending on the implementation of the read-eval-print loop. In the standard interactive interpreter, an entirely blank logical line (i.e. one containing not even whitespace or a comment) terminates a multi-line statement.
uk: Логічний рядок, який містить лише пробіли, табуляції, канали форми та, можливо, коментар, ігнорується (тобто маркер NEWLINE не генерується). Під час інтерактивного введення операторів обробка порожнього рядка може відрізнятися залежно від реалізації циклу читання-оцінки-друку. У стандартному інтерактивному інтерпретаторі повністю порожній логічний рядок (тобто такий, що не містить навіть пробілів або коментаря) завершує багаторядковий оператор.

source: Indentation
uk: Відступ

source: Leading whitespace (spaces and tabs) at the beginning of a logical line is used to compute the indentation level of the line, which in turn is used to determine the grouping of statements.
uk: Пробіли (пробіли та табуляції) на початку логічного рядка використовуються для обчислення рівня відступу рядка, який, у свою чергу, використовується для визначення групування операторів.

source: Tabs are replaced (from left to right) by one to eight spaces such that the total number of characters up to and including the replacement is a multiple of eight (this is intended to be the same rule as used by Unix). The total number of spaces preceding the first non-blank character then determines the line's indentation. Indentation cannot be split over multiple physical lines using backslashes; the whitespace up to the first backslash determines the indentation.
uk: Табуляції замінюються (зліва направо) на один-вісім пробілів, щоб загальна кількість символів до заміни включно була кратною восьми (це те саме правило, яке використовується в Unix). Тоді загальна кількість пробілів перед першим символом, що не є пробілом, визначає відступ рядка. Відступи не можна розділити на кілька фізичних рядків за допомогою зворотної косої риски; пробіл до першої зворотної скісної риски визначає відступ.

source: Indentation is rejected as inconsistent if a source file mixes tabs and spaces in a way that makes the meaning dependent on the worth of a tab in spaces; a :exc:`TabError` is raised in that case.
uk: Відступи відхиляються як непослідовні, якщо вихідний файл змішує табуляції та пробіли таким чином, що робить значення залежним від цінності табуляції в пробілах; У цьому випадку виникає :exc:`TabError`.

source: **Cross-platform compatibility note:** because of the nature of text editors on non-UNIX platforms, it is unwise to use a mixture of spaces and tabs for the indentation in a single source file. It should also be noted that different platforms may explicitly limit the maximum indentation level.
uk: **Примітка щодо крос-платформної сумісності:** через характер текстових редакторів на платформах, відмінних від UNIX, нерозумно використовувати суміш пробілів і табуляції для відступу в одному вихідному файлі. Слід також зазначити, що різні платформи можуть явно обмежувати максимальний рівень відступу.

source: A formfeed character may be present at the start of the line; it will be ignored for the indentation calculations above. Formfeed characters occurring elsewhere in the leading whitespace have an undefined effect (for instance, they may reset the space count to zero).
uk: Символ переходу форми може бути присутнім на початку рядка; він буде проігнорований для обчислень відступів вище. Символи передачі форми, що зустрічаються в інших місцях у першому пробілі, мають невизначений ефект (наприклад, вони можуть скинути кількість пробілів до нуля).

source: The indentation levels of consecutive lines are used to generate INDENT and DEDENT tokens, using a stack, as follows.
uk: Рівні відступів послідовних рядків використовуються для створення токенів INDENT і DEDENT за допомогою стека, як показано нижче.

source: Before the first line of the file is read, a single zero is pushed on the stack; this will never be popped off again. The numbers pushed on the stack will always be strictly increasing from bottom to top. At the beginning of each logical line, the line's indentation level is compared to the top of the stack. If it is equal, nothing happens. If it is larger, it is pushed on the stack, and one INDENT token is generated. If it is smaller, it *must* be one of the numbers occurring on the stack; all numbers on the stack that are larger are popped off, and for each number popped off a DEDENT token is generated. At the end of the file, a DEDENT token is generated for each number remaining on the stack that is larger than zero.
uk: Перш ніж буде зчитано перший рядок файлу, у стек вставляється один нуль; це ніколи більше не вискочить. Числа в стеку завжди суворо зростатимуть знизу вгору. На початку кожного логічного рядка рівень відступу рядка порівнюється з верхньою частиною стека. Якщо воно рівне, нічого не відбувається. Якщо він більший, він поміщається в стек і генерується один токен INDENT. Якщо воно менше, воно *повинно* бути одним із чисел, які зустрічаються в стеку; усі номери зі стеку, які є більшими, вилучаються, і для кожного числа, що виривається, генерується маркер DEDENT. У кінці файлу генерується маркер DEDENT для кожного числа, що залишилося в стеку і є більшим за нуль.

source: Here is an example of a correctly (though confusingly) indented piece of Python code::
uk: Ось приклад правильного (хоча і заплутаного) фрагмента коду Python з відступом:

source: The following example shows various indentation errors::
uk: У наступному прикладі показано різні помилки відступів:

source: (Actually, the first three errors are detected by the parser; only the last error is found by the lexical analyzer --- the indentation of ``return r`` does not match a level popped off the stack.)
uk: (Насправді, перші три помилки виявляються синтаксичним аналізатором; лише остання помилка знаходить лексичний аналізатор --- відступ ``return r`` не відповідає рівню, витягненому зі стеку.)

source: Whitespace between tokens
uk: Пробіли між маркерами

source: Except at the beginning of a logical line or in string literals, the whitespace characters space, tab and formfeed can be used interchangeably to separate tokens. Whitespace is needed between two tokens only if their concatenation could otherwise be interpreted as a different token (e.g., ab is one token, but a b is two tokens).
uk: За винятком початку логічного рядка або в рядкових літералах, символи пропуску, символи табуляції та переходу форми можуть використовуватися як взаємозамінні для розділення токенів. Пробіл потрібен між двома лексемами, лише якщо їх конкатенація інакше може бути інтерпретована як інша лексема (наприклад, ab — одна лексема, а b — це дві лексеми).

source: Other tokens
uk: Інші жетони

source: Besides NEWLINE, INDENT and DEDENT, the following categories of tokens exist: *identifiers*, *keywords*, *literals*, *operators*, and *delimiters*. Whitespace characters (other than line terminators, discussed earlier) are not tokens, but serve to delimit tokens. Where ambiguity exists, a token comprises the longest possible string that forms a legal token, when read from left to right.
uk: Окрім NEWLINE, INDENT і DEDENT, існують такі категорії токенів: *ідентифікатори*, *ключові слова*, *літерали*, *оператори* та *роздільники*. Пробільні символи (окрім символів закінчення рядків, які обговорювалися раніше) не є маркерами, але служать для розмежування маркерів. Якщо існує неоднозначність, токен містить найдовший можливий рядок, який утворює законний токен, коли читається зліва направо.

source: Identifiers and keywords
uk: Ідентифікатори та ключові слова

source: Identifiers (also referred to as *names*) are described by the following lexical definitions.
uk: Ідентифікатори (також згадувані як *імена*) описуються наступними лексичними визначеннями.

source: The syntax of identifiers in Python is based on the Unicode standard annex UAX-31, with elaboration and changes as defined below; see also :pep:`3131` for further details.
uk: Синтаксис ідентифікаторів у Python базується на стандартному додатку Unicode UAX-31 із уточненнями та змінами, як визначено нижче; див. також :pep:`3131` для отримання додаткової інформації.

source: Within the ASCII range (U+0001..U+007F), the valid characters for identifiers are the same as in Python 2.x: the uppercase and lowercase letters ``A`` through ``Z``, the underscore ``_`` and, except for the first character, the digits ``0`` through ``9``.
uk: У діапазоні ASCII (U+0001..U+007F) дійсні символи для ідентифікаторів такі ж, як і в Python 2.x: великі та малі літери від ``A`` до ``Z``, символ підкреслення ``_`` і, за винятком першого символу, цифри ``0`` до ``9``.

source: Python 3.0 introduces additional characters from outside the ASCII range (see :pep:`3131`). For these characters, the classification uses the version of the Unicode Character Database as included in the :mod:`unicodedata` module.
uk: Python 3.0 представляє додаткові символи поза межами діапазону ASCII (див. :pep:`3131`). Для цих символів у класифікації використовується версія бази даних символів Unicode, яка включена в модуль :mod:`unicodedata`.

source: Identifiers are unlimited in length. Case is significant.
uk: Довжина ідентифікаторів необмежена. Справа знакова.

source: The Unicode category codes mentioned above stand for:
uk: Зазначені вище коди категорій Unicode означають:

source: *Lu* - uppercase letters
uk: *Lu* - великі літери

source: *Ll* - lowercase letters
uk: *Ll* - малі літери

source: *Lt* - titlecase letters
uk: *Lt* - заголовні літери

source: *Lm* - modifier letters
uk: *Lm* - літери-модифікатори

source: *Lo* - other letters
uk: *Lo* - інші букви

source: *Nl* - letter numbers
uk: *Nl* - цифри літер

source: *Mn* - nonspacing marks
uk: *Mn* - непробільні знаки

source: *Mc* - spacing combining marks
uk: *Mc* - знаки поєднання інтервалів

source: *Nd* - decimal numbers
uk: *Nd* - десяткові числа

source: *Pc* - connector punctuations
uk: *Pc* - розділові знаки сполучника

source: *Other_ID_Continue* - likewise
uk: *Other_ID_Continue* - так само

source: All identifiers are converted into the normal form NFKC while parsing; comparison of identifiers is based on NFKC.
uk: Під час синтаксичного аналізу всі ідентифікатори перетворюються в нормальну форму NFKC; порівняння ідентифікаторів базується на NFKC.

source: Keywords
uk: Ключові слова

source: The following identifiers are used as reserved words, or *keywords* of the language, and cannot be used as ordinary identifiers. They must be spelled exactly as written here:
uk: Наступні ідентифікатори використовуються як зарезервовані слова або *ключові слова* мови, і їх не можна використовувати як звичайні ідентифікатори. Вони мають бути написані точно так, як тут написано:

source: Soft Keywords
uk: М'які ключові слова

source: Some identifiers are only reserved under specific contexts. These are known as *soft keywords*. The identifiers ``match``, ``case`` and ``_`` can syntactically act as keywords in contexts related to the pattern matching statement, but this distinction is done at the parser level, not when tokenizing.
uk: Деякі ідентифікатори зарезервовані лише в певних контекстах. Вони відомі як *м’які ключові слова*. Ідентифікатори ``match``, ``case`` і ``_`` можуть синтаксично діяти як ключові слова в контекстах, пов’язаних із оператором відповідності шаблону, але це розрізнення виконується на рівні аналізатора, а не під час токенізації.

source: As soft keywords, their use with pattern matching is possible while still preserving compatibility with existing code that uses ``match``, ``case`` and ``_`` as identifier names.
uk: Як м’які ключові слова, їх використання зі збігом шаблонів можливе, зберігаючи сумісність із існуючим кодом, який використовує ``match``, ``case`` і ``_`` як імена ідентифікаторів.

source: Reserved classes of identifiers
uk: Зарезервовані класи ідентифікаторів

source: Certain classes of identifiers (besides keywords) have special meanings. These classes are identified by the patterns of leading and trailing underscore characters:
uk: Певні класи ідентифікаторів (крім ключових слів) мають спеціальні значення. Ці класи ідентифікуються шаблонами початкових і кінцевих символів підкреслення:

source: Not imported by ``from module import *``.
uk: Не імпортовано ``з імпорту модуля *``.

source: In a ``case`` pattern within a :keyword:`match` statement, ``_`` is a :ref:`soft keyword <soft-keywords>` that denotes a :ref:`wildcard <wildcard-patterns>`.
uk: У шаблоні ``case`` в операторі :keyword:`match`, ``_`` є :ref:`м'яким ключовим словом <soft-keywords>`, яке позначає :ref:`знак підстановки <wildcard-patterns>`.

source: Separately, the interactive interpreter makes the result of the last evaluation available in the variable ``_``. (It is stored in the :mod:`builtins` module, alongside built-in functions like ``print``.)
uk: Окремо інтерактивний інтерпретатор робить результат останньої оцінки доступним у змінній ``_``. (Він зберігається в модулі :mod:`builtins` разом із вбудованими функціями, такими як ``print``.)

source: Elsewhere, ``_`` is a regular identifier. It is often used to name "special" items, but it is not special to Python itself.
uk: В інших місцях ``_`` є звичайним ідентифікатором. Його часто використовують для назви "особливих" елементів, але це не є особливим для самого Python.

source: The name ``_`` is often used in conjunction with internationalization; refer to the documentation for the :mod:`gettext` module for more information on this convention.
uk: Назва ``_`` часто використовується в поєднанні з інтернаціоналізацією; зверніться до документації для модуля :mod:`gettext` для отримання додаткової інформації про цю угоду.

source: It is also commonly used for unused variables.
uk: Він також зазвичай використовується для невикористаних змінних.

source: System-defined names, informally known as "dunder" names. These names are defined by the interpreter and its implementation (including the standard library). Current system names are discussed in the :ref:`specialnames` section and elsewhere. More will likely be defined in future versions of Python. *Any* use of ``__*__`` names, in any context, that does not follow explicitly documented use, is subject to breakage without warning.
uk: Імена, визначені системою, неофіційно відомі як імена "дундерів". Ці імена визначаються інтерпретатором і його реалізацією (включаючи стандартну бібліотеку). Поточні назви систем обговорюються в розділі :ref:`specialnames` та в інших місцях. Більше можливо буде визначено в майбутніх версіях Python. *Будь-яке* використання імен ``__*__`` у будь-якому контексті, яке не відповідає явно задокументованому використанню, може бути порушено без попередження.
