Repository: python/python-docs-uk
Catalog: reference/lexical_analysis.po
Languages: uk

source: Class-private names. Names in this category, when used within the context of a class definition, are re-written to use a mangled form to help avoid name clashes between "private" attributes of base and derived classes. See section :ref:`atom-identifiers`.
uk: Приватні імена класів. Імена в цій категорії, якщо вони використовуються в контексті визначення класу, переписуються, щоб використовувати спотворену форму, щоб уникнути зіткнень імен між "приватними" атрибутами базового та похідних класів. Дивіться розділ :ref:`atom-identifiers`.

source: Literals
uk: Літерали

source: Literals are notations for constant values of some built-in types.
uk: Літерали — це позначення постійних значень деяких вбудованих типів.

source: String and Bytes literals
uk: Рядкові та байтові літерали

source: String literals are described by the following lexical definitions:
uk: Рядкові літерали описуються такими лексичними визначеннями:

source: One syntactic restriction not indicated by these productions is that whitespace is not allowed between the :token:`~python-grammar:stringprefix` or :token:`~python-grammar:bytesprefix` and the rest of the literal. The source character set is defined by the encoding declaration; it is UTF-8 if no encoding declaration is given in the source file; see section :ref:`encodings`.
uk: Одне синтаксичне обмеження, яке не вказується цими продуктами, полягає в тому, що пробіли не допускаються між :token:`~python-grammar:stringprefix` або :token:`~python-grammar:bytesprefix` та рештою літералу. Вихідний набір символів визначається оголошенням кодування; це UTF-8, якщо у вихідному файлі не вказано кодування; див. розділ :ref:`encodings`.

source: Bytes literals are always prefixed with ``'b'`` or ``'B'``; they produce an instance of the :class:`bytes` type instead of the :class:`str` type. They may only contain ASCII characters; bytes with a numeric value of 128 or greater must be expressed with escapes.
uk: Байтові літерали завжди мають префікс ``'b'`` або ``'B'``; вони створюють екземпляр типу :class:`bytes` замість типу :class:`str`. Вони можуть містити лише символи ASCII; байти з числовим значенням 128 або більше повинні бути виражені за допомогою екранованих символів.

source: Both string and bytes literals may optionally be prefixed with a letter ``'r'`` or ``'R'``; such strings are called :dfn:`raw strings` and treat backslashes as literal characters. As a result, in string literals, ``'\U'`` and ``'\u'`` escapes in raw strings are not treated specially. Given that Python 2.x's raw unicode literals behave differently than Python 3.x's the ``'ur'`` syntax is not supported.
uk: І рядкові, і байтові літерали можуть додатково мати префікс ``'r'`` або ``'R'``; такі рядки називаються :dfn:`raw strings` і розглядають зворотні косі риски як буквальні символи. Як наслідок, у рядкових літералах екранування ``'\U'`` і ``'\u'`` у необроблених рядках не обробляються спеціально. Враховуючи те, що необроблені літерали Unicode Python 2.x поводяться інакше, ніж Python 3.x, синтаксис ``'ur'`` не підтримується.

source: The ``'rb'`` prefix of raw bytes literals has been added as a synonym of ``'br'``.
uk: Префікс ``'rb`` до літералів із необробленими байтами було додано як синонім ``'br'``.

source: Support for the unicode legacy literal (``u'value'``) was reintroduced to simplify the maintenance of dual Python 2.x and 3.x codebases. See :pep:`414` for more information.
uk: Підтримку застарілого літералу Unicode (``u'value``) було знову запроваджено для спрощення обслуговування подвійних кодових баз Python 2.x і 3.x. Перегляньте :pep:`414` для отримання додаткової інформації.

source: A string literal with ``'f'`` or ``'F'`` in its prefix is a :dfn:`formatted string literal`; see :ref:`f-strings`. The ``'f'`` may be combined with ``'r'``, but not with ``'b'`` or ``'u'``, therefore raw formatted strings are possible, but formatted bytes literals are not.
uk: Рядковий літерал із ``'f''`` або ``'F''`` у своєму префіксі є :dfn:`formatted string literal`; див. :ref:`f-strings`. ``'f'`` можна поєднувати з ``'r'``, але не з ``'b''`` або ``'u''``, тому можливі необроблені форматовані рядки, але форматовані байтові літерали не є.

source: In triple-quoted literals, unescaped newlines and quotes are allowed (and are retained), except that three unescaped quotes in a row terminate the literal. (A "quote" is the character used to open the literal, i.e. either ``'`` or ``"``.)
uk: У літералах із потрійними лапками дозволені (і зберігаються) неекрановані нові рядки та лапки, за винятком того, що три неекрановані лапки поспіль завершують літерал. ("Лапка" - це символ, який використовується для відкриття літералу, тобто ``'`` або ``"``.)

source: Unless an ``'r'`` or ``'R'`` prefix is present, escape sequences in string and bytes literals are interpreted according to rules similar to those used by Standard C. The recognized escape sequences are:
uk: Якщо немає префікса ``'r'`` або ``'R'``, керуючі послідовності в рядкових і байтових літералах інтерпретуються відповідно до правил, подібних до тих, що використовуються стандартом C. Розпізнаними керуючими послідовностями є:

source: Escape Sequence
uk: Ескейп-послідовність

source: Meaning
uk: Значення

source: Notes
uk: Примітки

source: ``\newline``
uk: ``\новий рядок``

source: Backslash and newline ignored
uk: Зворотна коса риска та новий рядок ігноруються

source: Backslash (``\``)
uk: Зворотна коса риска (``\``)

source: Single quote (``'``)
uk: Одинарні лапки (``'``)

source: Double quote (``"``)
uk: Подвійні лапки (``"``)

source: ASCII Carriage Return (CR)
uk: ASCII повернення каретки (CR)

source: ASCII Horizontal Tab (TAB)
uk: Горизонтальна вкладка ASCII (TAB)

source: ASCII Vertical Tab (VT)
uk: Вертикальна вкладка ASCII (VT)

source: ``\ooo``
uk: ``\ооо``

source: Character with octal value *ooo*
uk: Символ із вісімковим значенням *ooo*

source: Character with hex value *hh*
uk: Символ із шістнадцятковим значенням *hh*

source: Escape sequences only recognized in string literals are:
uk: Екран-послідовності, розпізнані лише в рядкових літералах:

source: Character named *name* in the Unicode database
uk: Символ із назвою *name* у базі даних Unicode

source: Character with 16-bit hex value *xxxx*
uk: Символ із 16-бітним шістнадцятковим значенням *xxxx*

source: ``\Uxxxxxxxx``
uk: ``\Uxxxxxxxxx``

source: Character with 32-bit hex value *xxxxxxxx*
uk: Символ із 32-розрядним шістнадцятковим значенням *xxxxxxx*

source: Notes:
uk: Примітки:

source: As in Standard C, up to three octal digits are accepted.
uk: Як і в стандарті C, допускається до трьох вісімкових цифр.

source: Unlike in Standard C, exactly two hex digits are required.
uk: На відміну від стандарту C, потрібні рівно дві шістнадцяткові цифри.

source: In a bytes literal, hexadecimal and octal escapes denote the byte with the given value. In a string literal, these escapes denote a Unicode character with the given value.
uk: У байтовому літералі шістнадцяткове та вісімкове екранування позначають байт із заданим значенням. У рядковому літералі ці екрановані символи позначають символ Unicode із заданим значенням.

source: Support for name aliases [#]_ has been added.
uk: Додано підтримку псевдонімів [#]_.

source: Exactly four hex digits are required.
uk: Потрібні рівно чотири шістнадцяткові цифри.

source: Any Unicode character can be encoded this way. Exactly eight hex digits are required.
uk: Таким чином можна закодувати будь-який символ Unicode. Необхідно рівно вісім шістнадцяткових цифр.

source: Unlike Standard C, all unrecognized escape sequences are left in the string unchanged, i.e., *the backslash is left in the result*. (This behavior is useful when debugging: if an escape sequence is mistyped, the resulting output is more easily recognized as broken.) It is also important to note that the escape sequences only recognized in string literals fall into the category of unrecognized escapes for bytes literals.
uk: На відміну від стандартного C, усі нерозпізнані керуючі послідовності залишаються в рядку без змін, тобто *зворотний слеш залишається в результаті*. (Ця поведінка корисна під час налагодження: якщо escape-послідовність введена неправильно, результат легше розпізнати як несправний.) Важливо також зазначити, що escape-послідовності, розпізнані лише в рядкових літералах, належать до категорії нерозпізнаних escape-сигналів для байтів. літерали.

source: Unrecognized escape sequences produce a :exc:`DeprecationWarning`. In a future Python version they will be a :exc:`SyntaxWarning` and eventually a :exc:`SyntaxError`.
uk: Нерозпізнані керуючі послідовності створюють :exc:`DeprecationWarning`. У майбутній версії Python вони будуть :exc:`SyntaxWarning` і, зрештою, :exc:`SyntaxError`.

source: Even in a raw literal, quotes can be escaped with a backslash, but the backslash remains in the result; for example, ``r"\""`` is a valid string literal consisting of two characters: a backslash and a double quote; ``r"\"`` is not a valid string literal (even a raw string cannot end in an odd number of backslashes). Specifically, *a raw literal cannot end in a single backslash* (since the backslash would escape the following quote character). Note also that a single backslash followed by a newline is interpreted as those two characters as part of the literal, *not* as a line continuation.
uk: Навіть у необробленому літералі лапки можна екранувати за допомогою зворотної косої риски, але зворотна коса риска залишається в результаті; наприклад, ``r"\""`` є дійсним рядковим літералом, що складається з двох символів: зворотної косої риски та подвійних лапок; ``r"\"`` не є дійсним рядковим літералом (навіть необроблений рядок не може закінчуватися у непарній кількості зворотних скісних рисок). Зокрема, *необроблений літерал не може закінчуватися однією зворотною скісною рискою* (оскільки зворотна скісна риска виключатиме наступний символ лапок). Зауважте також, що одна зворотна скісна риска, за якою йде новий рядок, інтерпретується як ці два символи як частина літералу, *не* як продовження рядка.

source: String literal concatenation
uk: Конкатенація рядкового літералу

source: Multiple adjacent string or bytes literals (delimited by whitespace), possibly using different quoting conventions, are allowed, and their meaning is the same as their concatenation. Thus, ``"hello" 'world'`` is equivalent to ``"helloworld"``. This feature can be used to reduce the number of backslashes needed, to split long strings conveniently across long lines, or even to add comments to parts of strings, for example::
uk: Кілька суміжних рядкових або байтових літералів (розмежованих пробілами), можливо, з використанням різних угод про цитування, дозволено, і їхнє значення таке ж, як і їх об’єднання. Таким чином, ``"hello" 'world'`` еквівалентно ``"helloworld"``. Цю функцію можна використати, щоб зменшити кількість потрібних зворотних похилих рис, щоб зручно розділити довгі рядки на довгі рядки або навіть додати коментарі до частин рядків, наприклад::

source: Note that this feature is defined at the syntactical level, but implemented at compile time. The '+' operator must be used to concatenate string expressions at run time. Also note that literal concatenation can use different quoting styles for each component (even mixing raw strings and triple quoted strings), and formatted string literals may be concatenated with plain string literals.
uk: Зауважте, що ця функція визначена на синтаксичному рівні, але реалізована під час компіляції. Для об’єднання рядкових виразів під час виконання необхідно використовувати оператор "+". Також зауважте, що конкатенація літералів може використовувати різні стилі лапок для кожного компонента (навіть змішування необроблених рядків і рядків у потрійних лапках), а форматовані рядкові літерали можуть бути об’єднані з простими рядковими літералами.

source: Formatted string literals
uk: Відформатовані рядкові літерали

source: A :dfn:`formatted string literal` or :dfn:`f-string` is a string literal that is prefixed with ``'f'`` or ``'F'``. These strings may contain replacement fields, which are expressions delimited by curly braces ``{}``. While other string literals always have a constant value, formatted strings are really expressions evaluated at run time.
uk: :dfn:`formatted string literal` або :dfn:`f-string` — це рядковий літерал, який має префікс ``'f'`` або ``'F'``. Ці рядки можуть містити поля заміни, які є виразами, розділеними фігурними дужками ``{}``. Хоча інші рядкові літерали завжди мають постійне значення, форматовані рядки насправді є виразами, які обчислюються під час виконання.

source: Escape sequences are decoded like in ordinary string literals (except when a literal is also marked as a raw string). After decoding, the grammar for the contents of the string is:
uk: Екран-послідовності декодуються як у звичайних рядкових літералах (за винятком випадків, коли літерал також позначено як необроблений рядок). Після декодування граматика вмісту рядка така:

source: The parts of the string outside curly braces are treated literally, except that any doubled curly braces ``'{{'`` or ``'}}'`` are replaced with the corresponding single curly brace. A single opening curly bracket ``'{'`` marks a replacement field, which starts with a Python expression. To display both the expression text and its value after evaluation, (useful in debugging), an equal sign ``'='`` may be added after the expression. A conversion field, introduced by an exclamation point ``'!'`` may follow. A format specifier may also be appended, introduced by a colon ``':'``. A replacement field ends with a closing curly bracket ``'}'``.
uk: Частини рядка поза фігурними дужками трактуються буквально, за винятком того, що будь-які подвоєні фігурні дужки ``'{{'`` або ``'}}'`` замінюються відповідною одинарною фігурною дужкою. Одна відкривна фігурна дужка ``'{'`` позначає поле заміни, яке починається з виразу Python. Щоб відобразити як текст виразу, так і його значення після оцінки (корисно під час налагодження), після виразу можна додати знак рівності ``'='``. Поле перетворення, введене знаком оклику ``'!'`` може слідувати за ним. Специфікатор формату також може бути доданий двокрапкою ``':''``. Поле заміни закінчується фігурною дужкою, що закривається, ``'}''``.

source: Expressions in formatted string literals are treated like regular Python expressions surrounded by parentheses, with a few exceptions. An empty expression is not allowed, and both :keyword:`lambda` and assignment expressions ``:=`` must be surrounded by explicit parentheses. Replacement expressions can contain line breaks (e.g. in triple-quoted strings), but they cannot contain comments. Each expression is evaluated in the context where the formatted string literal appears, in order from left to right.
uk: Вирази у форматованих рядкових літералах розглядаються як звичайні вирази Python, оточені дужками, за кількома винятками. Порожній вираз не дозволяється, і як :keyword:`lambda`, так і вирази присвоєння ``:=`` мають бути оточені явними дужками. Вирази заміни можуть містити розриви рядків (наприклад, у рядках у потрійних лапках), але вони не можуть містити коментарів. Кожен вираз обчислюється в контексті, де з’являється відформатований рядковий літерал, у порядку зліва направо.

source: Prior to Python 3.7, an :keyword:`await` expression and comprehensions containing an :keyword:`async for` clause were illegal in the expressions in formatted string literals due to a problem with the implementation.
uk: До Python 3.7 вираз :keyword:`await` і розуміння, що містять пропозицію :keyword:`async for`, були незаконними у виразах у форматованих рядкових літералах через проблему з реалізацією.

source: When the equal sign ``'='`` is provided, the output will have the expression text, the ``'='`` and the evaluated value. Spaces after the opening brace ``'{'``, within the expression and after the ``'='`` are all retained in the output. By default, the ``'='`` causes the :func:`repr` of the expression to be provided, unless there is a format specified. When a format is specified it defaults to the :func:`str` of the expression unless a conversion ``'!r'`` is declared.
uk: Якщо вказано знак рівності ``'='``, вихідні дані матимуть текст виразу, ``'='`` і обчислене значення. Пробіли після відкриваючої фігурної дужки ``'{'`` у виразі та після ``'='`` зберігаються у виводі. За замовчуванням ``'='`` надає :func:`repr` виразу, якщо не вказано формат. Коли вказано формат, за замовчуванням використовується :func:`str` виразу, якщо не оголошено перетворення ``'!r''``.

source: The equal sign ``'='``.
uk: Знак рівності ``'='``.

source: If a conversion is specified, the result of evaluating the expression is converted before formatting. Conversion ``'!s'`` calls :func:`str` on the result, ``'!r'`` calls :func:`repr`, and ``'!a'`` calls :func:`ascii`.
uk: Якщо вказано перетворення, результат обчислення виразу перетворюється перед форматуванням. Перетворення ``'!s'`` викликає :func:`str` результату, ``'!r''`` викликає :func:`repr`, а ``'!a'`` викликає :func:`ascii`.

source: The result is then formatted using the :func:`format` protocol. The format specifier is passed to the :meth:`__format__` method of the expression or conversion result. An empty string is passed when the format specifier is omitted. The formatted result is then included in the final value of the whole string.
uk: Потім результат форматується за допомогою протоколу :func:`format`. Специфікатор формату передається в метод :meth:`__format__` виразу або результату перетворення. Порожній рядок передається, якщо специфікатор формату опущено. Потім відформатований результат включається в кінцеве значення всього рядка.

source: Top-level format specifiers may include nested replacement fields. These nested fields may include their own conversion fields and :ref:`format specifiers <formatspec>`, but may not include more deeply-nested replacement fields. The :ref:`format specifier mini-language <formatspec>` is the same as that used by the :meth:`str.format` method.
uk: Специфікатори формату верхнього рівня можуть включати вкладені поля заміни. Ці вкладені поля можуть містити власні поля перетворення та :ref:`специфікатори формату <formatspec>`, але не можуть містити більш глибоко вкладені поля заміни. :ref:`міні-мова специфікатора формату <formatspec>` така сама, як і в методі :meth:`str.format`.

source: Formatted string literals may be concatenated, but replacement fields cannot be split across literals.
uk: Відформатовані рядкові літерали можуть бути об’єднані, але поля заміни не можуть бути розділені на літерали.

source: Some examples of formatted string literals::
uk: Деякі приклади відформатованих рядкових літералів::

source: A consequence of sharing the same syntax as regular string literals is that characters in the replacement fields must not conflict with the quoting used in the outer formatted string literal::
uk: Наслідком спільного використання такого ж синтаксису, як і звичайні рядкові літерали, є те, що символи в полях заміни не повинні конфліктувати з лапками, які використовуються у зовнішньому форматованому рядковому літералі::

source: Backslashes are not allowed in format expressions and will raise an error::
uk: Зворотні скісні риски не дозволені у виразах формату та призведуть до помилки::

source: To include a value in which a backslash escape is required, create a temporary variable.
uk: Щоб включити значення, у якому необхідний символ зворотної скісної риски, створіть тимчасову змінну.

source: Formatted string literals cannot be used as docstrings, even if they do not include expressions.
uk: Відформатовані рядкові літерали не можна використовувати як рядки документації, навіть якщо вони не містять виразів.

source: See also :pep:`498` for the proposal that added formatted string literals, and :meth:`str.format`, which uses a related format string mechanism.
uk: Дивіться також :pep:`498` для пропозиції, яка додала відформатовані рядкові літерали, і :meth:`str.format`, який використовує пов’язаний механізм форматування рядків.

source: Numeric literals
uk: Числові літерали

source: There are three types of numeric literals: integers, floating point numbers, and imaginary numbers. There are no complex literals (complex numbers can be formed by adding a real number and an imaginary number).
uk: Існує три типи числових літералів: цілі числа, числа з плаваючою комою та уявні числа. Комплексних літералів немає (комплексні числа можна утворити додаванням дійсного числа та уявного числа).

source: Note that numeric literals do not include a sign; a phrase like ``-1`` is actually an expression composed of the unary operator '``-``' and the literal ``1``.
uk: Зауважте, що числові літерали не містять знака; така фраза, як ``-1``, насправді є виразом, що складається з унарного оператора '``-``' і літерала ``1``.

source: Integer literals
uk: Цілі літерали

source: Integer literals are described by the following lexical definitions:
uk: Цілі літерали описуються такими лексичними визначеннями:

source: There is no limit for the length of integer literals apart from what can be stored in available memory.
uk: Немає обмежень щодо довжини цілочисельних літералів, крім того, що може зберігатися у доступній пам’яті.

source: Underscores are ignored for determining the numeric value of the literal. They can be used to group digits for enhanced readability. One underscore can occur between digits, and after base specifiers like ``0x``.
uk: Підкреслення ігноруються для визначення числового значення літералу. Їх можна використовувати для групування цифр для кращої читабельності. Одне підкреслення може бути між цифрами та після основних специфікаторів, таких як ``0x``.

source: Note that leading zeros in a non-zero decimal number are not allowed. This is for disambiguation with C-style octal literals, which Python used before version 3.0.
uk: Зауважте, що нулі на початку ненульового десяткового числа не допускаються. Це для усунення неоднозначності з вісімковими літералами у стилі C, які Python використовував до версії 3.0.

source: Some examples of integer literals::
uk: Деякі приклади цілих літералів::

source: Underscores are now allowed for grouping purposes in literals.
uk: Підкреслення тепер дозволено для цілей групування в літералах.

source: Floating point literals
uk: Літерали з плаваючою комою

source: Floating point literals are described by the following lexical definitions:
uk: Літерали з плаваючою комою описуються такими лексичними визначеннями:

source: Note that the integer and exponent parts are always interpreted using radix 10. For example, ``077e010`` is legal, and denotes the same number as ``77e10``. The allowed range of floating point literals is implementation-dependent. As in integer literals, underscores are supported for digit grouping.
uk: Зауважте, що ціла та експонента завжди інтерпретуються з використанням основи 10. Наприклад, ``077e010`` є допустимим і позначає те саме число, що ``77e10``. Дозволений діапазон літералів із плаваючою комою залежить від реалізації. Як і в цілих літералах, підкреслення підтримуються для групування цифр.

source: Some examples of floating point literals::
uk: Деякі приклади літералів з плаваючою комою::

source: Imaginary literals
uk: Уявні літерали

source: Imaginary literals are described by the following lexical definitions:
uk: Уявні літерали описуються такими лексичними визначеннями:
