Repository: python/python-docs-uk
Catalog: reference/simple_stmts.po
Languages: uk

source: The :keyword:`!pass` statement
uk: Оператор :keyword:`!pass`

source: :keyword:`pass` is a null operation --- when it is executed, nothing happens. It is useful as a placeholder when a statement is required syntactically, but no code needs to be executed, for example::
uk: :keyword:`pass` є нульовою операцією --- коли вона виконується, нічого не відбувається. Це корисно як заповнювач, коли оператор потрібний синтаксично, але не потрібно виконувати код, наприклад::

source: The :keyword:`!del` statement
uk: Оператор :keyword:`!del`

source: Deletion is recursively defined very similar to the way assignment is defined. Rather than spelling it out in full details, here are some hints.
uk: Видалення рекурсивно визначається дуже подібно до того, як визначається призначення. Замість того, щоб викладати все детально, ось кілька підказок.

source: Deletion of a target list recursively deletes each target, from left to right.
uk: Видалення списку цілей рекурсивно видаляє кожну ціль зліва направо.

source: Deletion of a name removes the binding of that name from the local or global namespace, depending on whether the name occurs in a :keyword:`global` statement in the same code block. If the name is unbound, a :exc:`NameError` exception will be raised.
uk: Видалення імені видаляє прив’язку цього імені до локального чи глобального простору імен, залежно від того, чи зустрічається ім’я в операторі :keyword:`global` у тому самому блоці коду. Якщо ім’я не зв’язане, буде викликано виняток :exc:`NameError`.

source: Deletion of attribute references, subscriptions and slicings is passed to the primary object involved; deletion of a slicing is in general equivalent to assignment of an empty slice of the right type (but even this is determined by the sliced object).
uk: Видалення посилань на атрибути, підписок і фрагментів передається до основного задіяного об’єкта; Видалення фрагмента загалом еквівалентно присвоєнню порожньому фрагменту потрібного типу (але навіть це визначається об’єктом фрагмента).

source: Previously it was illegal to delete a name from the local namespace if it occurs as a free variable in a nested block.
uk: Раніше було заборонено видаляти ім’я з локального простору імен, якщо воно зустрічається як вільна змінна у вкладеному блоці.

source: The :keyword:`!return` statement
uk: Оператор :keyword:`!return`

source: :keyword:`return` may only occur syntactically nested in a function definition, not within a nested class definition.
uk: :keyword:`return` може бути лише синтаксично вкладеним у визначення функції, а не у визначенні вкладеного класу.

source: If an expression list is present, it is evaluated, else ``None`` is substituted.
uk: Якщо присутній список виразів, він обчислюється, інакше замінюється ``None``.

source: :keyword:`return` leaves the current function call with the expression list (or ``None``) as return value.
uk: :keyword:`return` залишає поточний виклик функції зі списком виразів (або ``None``) як значення повернення.

source: When :keyword:`return` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the function.
uk: Коли :keyword:`return` передає керування оператору :keyword:`try` з пропозицією :keyword:`finally`, ця пропозиція :keyword:`!finally` виконується перед фактичним виходом із функції.

source: In a generator function, the :keyword:`return` statement indicates that the generator is done and will cause :exc:`StopIteration` to be raised. The returned value (if any) is used as an argument to construct :exc:`StopIteration` and becomes the :attr:`StopIteration.value` attribute.
uk: У функції генератора оператор :keyword:`return` вказує на те, що генератор завершено та спричинить виклик :exc:`StopIteration`. Повернене значення (за наявності) використовується як аргумент для створення :exc:`StopIteration` і стає атрибутом :attr:`StopIteration.value`.

source: In an asynchronous generator function, an empty :keyword:`return` statement indicates that the asynchronous generator is done and will cause :exc:`StopAsyncIteration` to be raised. A non-empty :keyword:`!return` statement is a syntax error in an asynchronous generator function.
uk: У функції асинхронного генератора порожній оператор :keyword:`return` вказує на те, що асинхронний генератор завершено та призведе до виклику :exc:`StopAsyncIteration`. Непорожній оператор :keyword:`!return` є синтаксичною помилкою у функції асинхронного генератора.

source: The :keyword:`!yield` statement
uk: Оператор :keyword:`!yield`

source: A :keyword:`yield` statement is semantically equivalent to a :ref:`yield expression <yieldexpr>`. The yield statement can be used to omit the parentheses that would otherwise be required in the equivalent yield expression statement. For example, the yield statements ::
uk: Оператор :keyword:`yield` семантично еквівалентний виразу :ref:`yield <yieldexpr>`. Оператор yield можна використовувати, щоб опустити дужки, які в іншому випадку були б потрібні в еквівалентному операторі виразу yield. Наприклад, оператори yield::

source: are equivalent to the yield expression statements ::
uk: еквівалентні операторам виразу yield ::

source: Yield expressions and statements are only used when defining a :term:`generator` function, and are only used in the body of the generator function. Using yield in a function definition is sufficient to cause that definition to create a generator function instead of a normal function.
uk: Вирази й оператори yield використовуються лише під час визначення функції :term:`generator` і лише в тілі функції-генератора. Використання yield у визначенні функції достатньо, щоб це визначення створювало функцію-генератор замість звичайної функції.

source: For full details of :keyword:`yield` semantics, refer to the :ref:`yieldexpr` section.
uk: Щоб отримати повну інформацію про семантику :keyword:`yield`, зверніться до розділу :ref:`yieldexpr`.

source: The :keyword:`!raise` statement
uk: Оператор :keyword:`!raise`

source: If no expressions are present, :keyword:`raise` re-raises the exception that is currently being handled, which is also known as the *active exception*. If there isn't currently an active exception, a :exc:`RuntimeError` exception is raised indicating that this is an error.
uk: Якщо виразів немає, :keyword:`raise` повторно викликає виняток, який зараз обробляється, який також відомий як *активний виняток*. Якщо наразі немає активного винятку, виникає виняток :exc:`RuntimeError`, який вказує на те, що це помилка.

source: Otherwise, :keyword:`raise` evaluates the first expression as the exception object. It must be either a subclass or an instance of :class:`BaseException`. If it is a class, the exception instance will be obtained when needed by instantiating the class with no arguments.
uk: В іншому випадку :keyword:`raise` обчислює перший вираз як об’єкт винятку. Це має бути або підклас, або екземпляр :class:`BaseException`. Якщо це клас, екземпляр винятку буде отримано за потреби шляхом створення екземпляра класу без аргументів.

source: The :dfn:`type` of the exception is the exception instance's class, the :dfn:`value` is the instance itself.
uk: :dfn:`type` винятку — це клас екземпляра винятку, :dfn:`value` — це сам екземпляр.

source: A traceback object is normally created automatically when an exception is raised and attached to it as the :attr:`__traceback__` attribute, which is writable. You can create an exception and set your own traceback in one step using the :meth:`~BaseException.with_traceback` exception method (which returns the same exception instance, with its traceback set to its argument), like so::
uk: Об’єкт трасування зазвичай створюється автоматично, коли виникає виняток і додається до нього як атрибут :attr:`__traceback__`, який доступний для запису. Ви можете створити виняток і встановити власну трасування одним кроком за допомогою методу винятку :meth:`~BaseException.with_traceback` (який повертає той самий екземпляр винятку, з його трасуванням, встановленим для його аргументу), наприклад:

source: The ``from`` clause is used for exception chaining: if given, the second *expression* must be another exception class or instance. If the second expression is an exception instance, it will be attached to the raised exception as the :attr:`__cause__` attribute (which is writable). If the expression is an exception class, the class will be instantiated and the resulting exception instance will be attached to the raised exception as the :attr:`__cause__` attribute. If the raised exception is not handled, both exceptions will be printed::
uk: Речення ``from`` використовується для ланцюжка винятків: якщо задано, другий *вираз* має бути іншим класом винятків або екземпляром. Якщо другий вираз є екземпляром винятку, його буде приєднано до викликаного винятку як атрибут :attr:`__cause__` (який доступний для запису). Якщо вираз є класом винятку, екземпляр класу буде створено, а отриманий екземпляр винятку буде додано до викликаного винятку як атрибут :attr:`__cause__`. Якщо викликаний виняток не оброблено, обидва виключення будуть надруковані::

source: A similar mechanism works implicitly if a new exception is raised when an exception is already being handled. An exception may be handled when an :keyword:`except` or :keyword:`finally` clause, or a :keyword:`with` statement, is used. The previous exception is then attached as the new exception's :attr:`__context__` attribute::
uk: Подібний механізм працює неявно, якщо виникає новий виняток, коли виняток уже обробляється. Виняток може бути оброблено, коли використовується речення :keyword:`except` або :keyword:`finally` або оператор :keyword:`with`. Потім попередній виняток додається як атрибут :attr:`__context__` нового винятку::

source: Exception chaining can be explicitly suppressed by specifying :const:`None` in the ``from`` clause::
uk: Ланцюжки винятків можна явно придушити, вказавши :const:`None` у пункті ``from``::

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information about handling exceptions is in section :ref:`try`.
uk: Додаткову інформацію про винятки можна знайти в розділі :ref:`exceptions`, а інформацію про обробку винятків — у розділі :ref:`try`.

source: :const:`None` is now permitted as ``Y`` in ``raise X from Y``.
uk: :const:`None` тепер дозволено як ``Y`` у ``raise X from Y``.

source: The ``__suppress_context__`` attribute to suppress automatic display of the exception context.
uk: Атрибут ``__suppress_context__`` для придушення автоматичного відображення контексту винятку.

source: The :keyword:`!break` statement
uk: Оператор :keyword:`!break`

source: :keyword:`break` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop.
uk: :keyword:`break` може бути лише синтаксично вкладеним у циклі :keyword:`for` або :keyword:`while`, але не вкладеним у визначення функції чи класу в цьому циклі.

source: It terminates the nearest enclosing loop, skipping the optional :keyword:`!else` clause if the loop has one.
uk: Він завершує найближчий охоплюючий цикл, пропускаючи необов’язкову пропозицію :keyword:`!else`, якщо вона є в циклі.

source: If a :keyword:`for` loop is terminated by :keyword:`break`, the loop control target keeps its current value.
uk: Якщо цикл :keyword:`for` завершується :keyword:`break`, мета керування циклом зберігає своє поточне значення.

source: When :keyword:`break` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the loop.
uk: Коли :keyword:`break` передає керування оператору :keyword:`try` з пропозицією :keyword:`finally`, ця пропозиція :keyword:`!finally` виконується перед тим, як фактично вийти з циклу.

source: The :keyword:`!continue` statement
uk: Оператор :keyword:`!continue`

source: :keyword:`continue` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop. It continues with the next cycle of the nearest enclosing loop.
uk: :keyword:`continue` може бути лише синтаксично вкладеним у циклі :keyword:`for` або :keyword:`while`, але не вкладеним у визначення функції чи класу в цьому циклі. Він продовжується наступним циклом найближчого охоплюючого циклу.

source: When :keyword:`continue` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really starting the next loop cycle.
uk: Коли :keyword:`continue` передає керування оператору :keyword:`try` з пропозицією :keyword:`finally`, ця пропозиція :keyword:`!finally` виконується перед тим, як справді розпочнеться наступний цикл циклу.

source: The :keyword:`!import` statement
uk: Оператор :keyword:`!import`

source: The basic import statement (no :keyword:`from` clause) is executed in two steps:
uk: Базовий оператор імпорту (без пропозиції :keyword:`from`) виконується у два кроки:

source: find a module, loading and initializing it if necessary
uk: знайти модуль, завантаживши та ініціалізувавши його, якщо необхідно

source: define a name or names in the local namespace for the scope where the :keyword:`import` statement occurs.
uk: визначте ім’я або імена в локальному просторі імен для області, де виникає оператор :keyword:`import`.

source: When the statement contains multiple clauses (separated by commas) the two steps are carried out separately for each clause, just as though the clauses had been separated out into individual import statements.
uk: Якщо оператор містить кілька пунктів (розділених комами), два кроки виконуються окремо для кожного пункту, так само, як якщо б пункти були розділені на окремі оператори імпорту.

source: The details of the first step, finding and loading modules are described in greater detail in the section on the :ref:`import system <importsystem>`, which also describes the various types of packages and modules that can be imported, as well as all the hooks that can be used to customize the import system. Note that failures in this step may indicate either that the module could not be located, *or* that an error occurred while initializing the module, which includes execution of the module's code.
uk: Деталі першого кроку, пошуку та завантаження модулів, описано більш детально в розділі про :ref:`систему імпорту <importsystem>`, де також описано різні типи пакетів і модулів, які можна імпортувати, а також усі хуки, які можна використовувати для налаштування системи імпорту. Зауважте, що помилки на цьому кроці можуть означати те, що модуль не вдалося знайти, *або* те, що під час ініціалізації модуля сталася помилка, яка включає виконання коду модуля.

source: If the requested module is retrieved successfully, it will be made available in the local namespace in one of three ways:
uk: Якщо запитуваний модуль успішно отримано, він стане доступним у локальному просторі імен одним із трьох способів:

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
uk: Якщо ім’я модуля супроводжується :keyword:`!as`, тоді ім’я після :keyword:`!as` прив’язується безпосередньо до імпортованого модуля.

source: If no other name is specified, and the module being imported is a top level module, the module's name is bound in the local namespace as a reference to the imported module
uk: Якщо інше ім’я не вказано, а імпортований модуль є модулем верхнього рівня, ім’я модуля зв’язується в локальному просторі імен як посилання на імпортований модуль

source: If the module being imported is *not* a top level module, then the name of the top level package that contains the module is bound in the local namespace as a reference to the top level package. The imported module must be accessed using its full qualified name rather than directly
uk: Якщо імпортований модуль *не* є модулем верхнього рівня, тоді ім’я пакета верхнього рівня, який містить модуль, прив’язується до локального простору імен як посилання на пакет верхнього рівня. Доступ до імпортованого модуля потрібно отримати, використовуючи його повне кваліфіковане ім’я, а не безпосередньо

source: The :keyword:`from` form uses a slightly more complex process:
uk: Форма :keyword:`from` використовує дещо складніший процес:

source: find the module specified in the :keyword:`from` clause, loading and initializing it if necessary;
uk: знайти модуль, указаний у пункті :keyword:`from`, завантажуючи та ініціалізуючи його, якщо необхідно;

source: for each of the identifiers specified in the :keyword:`import` clauses:
uk: для кожного з ідентифікаторів, указаних у пунктах :keyword:`import`:

source: check if the imported module has an attribute by that name
uk: перевірте, чи імпортований модуль має атрибут із таким іменем

source: if not, attempt to import a submodule with that name and then check the imported module again for that attribute
uk: якщо ні, спробуйте імпортувати підмодуль із такою назвою, а потім знову перевірте імпортований модуль на наявність цього атрибута

source: if the attribute is not found, :exc:`ImportError` is raised.
uk: якщо атрибут не знайдено, виникає :exc:`ImportError`.

source: otherwise, a reference to that value is stored in the local namespace, using the name in the :keyword:`!as` clause if it is present, otherwise using the attribute name
uk: інакше посилання на це значення зберігається в локальному просторі імен, використовуючи ім’я в реченні :keyword:`!as`, якщо воно присутнє, інакше використовується ім’я атрибута

source: Examples::
uk: Приклади::

source: If the list of identifiers is replaced by a star (``'*'``), all public names defined in the module are bound in the local namespace for the scope where the :keyword:`import` statement occurs.
uk: Якщо список ідентифікаторів замінено зірочкою (``'*'``), усі загальнодоступні імена, визначені в модулі, прив’язуються до локального простору імен для області, де виникає оператор :keyword:`import`.

source: The *public names* defined by a module are determined by checking the module's namespace for a variable named ``__all__``; if defined, it must be a sequence of strings which are names defined or imported by that module. The names given in ``__all__`` are all considered public and are required to exist. If ``__all__`` is not defined, the set of public names includes all names found in the module's namespace which do not begin with an underscore character (``'_'``). ``__all__`` should contain the entire public API. It is intended to avoid accidentally exporting items that are not part of the API (such as library modules which were imported and used within the module).
uk: *Відкриті імена*, визначені модулем, визначаються шляхом перевірки простору імен модуля для змінної з назвою ``__all__``; якщо визначено, це має бути послідовність рядків, які є іменами, визначеними або імпортованими цим модулем. Усі назви, наведені в ``__all__``, вважаються загальнодоступними та мають існувати. Якщо ``__all__`` не визначено, набір загальнодоступних імен включає всі імена, знайдені в просторі імен модуля, які не починаються зі символу підкреслення (``'_'``). ``__all__`` має містити весь публічний API. Це призначено для уникнення випадкового експорту елементів, які не є частиною API (наприклад, бібліотечних модулів, які були імпортовані та використані в модулі).

source: The wild card form of import --- ``from module import *`` --- is only allowed at the module level. Attempting to use it in class or function definitions will raise a :exc:`SyntaxError`.
uk: Форма імпорту із символом підстановки --- ``з імпорту модуля *`` --- дозволена лише на рівні модуля. Спроба використати його у визначеннях класу чи функції викличе :exc:`SyntaxError`.

source: When specifying what module to import you do not have to specify the absolute name of the module. When a module or package is contained within another package it is possible to make a relative import within the same top package without having to mention the package name. By using leading dots in the specified module or package after :keyword:`from` you can specify how high to traverse up the current package hierarchy without specifying exact names. One leading dot means the current package where the module making the import exists. Two dots means up one package level. Three dots is up two levels, etc. So if you execute ``from . import mod`` from a module in the ``pkg`` package then you will end up importing ``pkg.mod``. If you execute ``from ..subpkg2 import mod`` from within ``pkg.subpkg1`` you will import ``pkg.subpkg2.mod``. The specification for relative imports is contained in the :ref:`relativeimports` section.
uk: Визначаючи, який модуль імпортувати, не потрібно вказувати абсолютну назву модуля. Коли модуль або пакунок міститься в іншому пакунку, можна виконати відносний імпорт у той самий верхній пакунок, не вказуючи назву пакунка. Використовуючи крапки на початку у вказаному модулі чи пакеті після :keyword:`from`, ви можете вказати, наскільки високо потрібно перейти вгору по поточній ієрархії пакету, не вказуючи точні назви. Одна крапка на початку означає поточний пакет, у якому існує модуль, що виконує імпорт. Дві крапки означають підвищення на один рівень пакета. Три крапки — це два рівні вище тощо. Отже, якщо ви виконаєте ``з . імпортуйте mod`` з модуля в пакеті ``pkg``, тоді ви імпортуєте ``pkg.mod``. Якщо ви виконаєте ``from ..subpkg2 import mod`` з ``pkg.subpkg1``, ви імпортуєте ``pkg.subpkg2.mod``. Специфікація відносного імпорту міститься в розділі :ref:`relativeimports`.

source: :func:`importlib.import_module` is provided to support applications that determine dynamically the modules to be loaded.
uk: :func:`importlib.import_module` надається для підтримки програм, які динамічно визначають модулі для завантаження.

source: Raises an :ref:`auditing event <auditing>` ``import`` with arguments ``module``, ``filename``, ``sys.path``, ``sys.meta_path``, ``sys.path_hooks``.
uk: Викликає :ref:`подію аудиту <auditing>` ``import`` з аргументами ``module``, ``filename``, ``sys.path``, ``sys.meta_path``, ``sys.path_hooks``.

source: Future statements
uk: Майбутні заяви

source: A :dfn:`future statement` is a directive to the compiler that a particular module should be compiled using syntax or semantics that will be available in a specified future release of Python where the feature becomes standard.
uk: :dfn:`future statement` — це вказівка компілятору про те, що певний модуль має бути скомпільовано з використанням синтаксису чи семантики, які будуть доступні у визначеному майбутньому випуску Python, де ця функція стане стандартною.

source: The future statement is intended to ease migration to future versions of Python that introduce incompatible changes to the language. It allows use of the new features on a per-module basis before the release in which the feature becomes standard.
uk: Заява майбутнього призначена для полегшення переходу на майбутні версії Python, які вносять несумісні зміни в мову. Це дозволяє використовувати нові функції окремо для кожного модуля до випуску, у якому ця функція стане стандартною.

source: A future statement must appear near the top of the module. The only lines that can appear before a future statement are:
uk: У верхній частині модуля має бути майбутня заява. Єдині рядки, які можуть відображатися перед майбутнім оператором:

source: the module docstring (if any),
uk: рядок документації модуля (якщо є),

source: comments,
uk: коментарі,

source: blank lines, and
uk: порожні рядки та

source: other future statements.
uk: інші майбутні заяви.
