Repository: python/python-docs-uk
Catalog: reference/simple_stmts.po
Languages: uk

source: Simple statements
uk: Прості твердження

source: A simple statement is comprised within a single logical line. Several simple statements may occur on a single line separated by semicolons. The syntax for simple statements is:
uk: Просте твердження міститься в одному логічному рядку. В одному рядку, розділених крапкою з комою, може бути кілька простих операторів. Синтаксис простих операторів такий:

source: Expression statements
uk: Вирази

source: Expression statements are used (mostly interactively) to compute and write a value, or (usually) to call a procedure (a function that returns no meaningful result; in Python, procedures return the value ``None``). Other uses of expression statements are allowed and occasionally useful. The syntax for an expression statement is:
uk: Інструкції-вирази використовуються (здебільшого в інтерактивному режимі) для обчислення та запису значення або (зазвичай) для виклику процедури (функції, яка не повертає значущого результату; у Python процедури повертають значення ``None``). Інші способи використання операторів-виразів дозволені та інколи корисні. Синтаксис оператора виразу:

source: An expression statement evaluates the expression list (which may be a single expression).
uk: Оператор виразу обчислює список виразів (який може бути одним виразом).

source: In interactive mode, if the value is not ``None``, it is converted to a string using the built-in :func:`repr` function and the resulting string is written to standard output on a line by itself (except if the result is ``None``, so that procedure calls do not cause any output.)
uk: В інтерактивному режимі, якщо значення не є ``None``, воно перетворюється на рядок за допомогою вбудованої функції :func:`repr`, а отриманий рядок записується до стандартного виводу в окремому рядку (крім випадків, коли результатом є ``None``, так що виклики процедур не викликають жодних виводів.)

source: Assignment statements
uk: Заяви про призначення

source: Assignment statements are used to (re)bind names to values and to modify attributes or items of mutable objects:
uk: Оператори присвоєння використовуються для (повторного) прив’язування імен до значень і для зміни атрибутів або елементів змінних об’єктів:

source: (See section :ref:`primaries` for the syntax definitions for *attributeref*, *subscription*, and *slicing*.)
uk: (Див. розділ :ref:`primaries` для визначення синтаксису для *attributeref*, *subscription* і *slicing*.)

source: An assignment statement evaluates the expression list (remember that this can be a single expression or a comma-separated list, the latter yielding a tuple) and assigns the single resulting object to each of the target lists, from left to right.
uk: Інструкція присвоєння оцінює список виразів (пам’ятайте, що це може бути один вираз або список, розділений комами, останній дає кортеж) і призначає єдиний результуючий об’єкт кожному з цільових списків зліва направо.

source: Assignment is defined recursively depending on the form of the target (list). When a target is part of a mutable object (an attribute reference, subscription or slicing), the mutable object must ultimately perform the assignment and decide about its validity, and may raise an exception if the assignment is unacceptable. The rules observed by various types and the exceptions raised are given with the definition of the object types (see section :ref:`types`).
uk: Присвоєння визначається рекурсивно залежно від форми цілі (списку). Коли ціль є частиною змінного об’єкта (посилання на атрибут, підписка або зріз), змінний об’єкт повинен остаточно виконати призначення та прийняти рішення про його достовірність і може викликати виняток, якщо призначення є неприйнятним. Правила, яких дотримуються різні типи, і винятки, які виникають, наведені разом із визначенням типів об’єктів (див. розділ :ref:`types`).

source: Assignment of an object to a target list, optionally enclosed in parentheses or square brackets, is recursively defined as follows.
uk: Призначення об’єкта цільовому списку, необов’язково укладеному в круглі або квадратні дужки, рекурсивно визначається наступним чином.

source: If the target list is a single target with no trailing comma, optionally in parentheses, the object is assigned to that target.
uk: Якщо цільовий список є одним цільовим об’єктом без кінцевої коми, необов’язково в дужках, об’єкт призначається цій цільовій цілі.

source: Else:
uk: ще:

source: If the target list contains one target prefixed with an asterisk, called a "starred" target: The object must be an iterable with at least as many items as there are targets in the target list, minus one. The first items of the iterable are assigned, from left to right, to the targets before the starred target. The final items of the iterable are assigned to the targets after the starred target. A list of the remaining items in the iterable is then assigned to the starred target (the list can be empty).
uk: Якщо цільовий список містить одну ціль із префіксом зірочки, це називається ціль із зірочкою: об’єкт має бути ітерованим із принаймні такою кількістю елементів, скільки цілей у списку цілей, мінус один. Перші елементи iterable призначаються, зліва направо, цілям перед ціллю, позначеною зірочкою. Останні елементи iterable призначаються цілям після цілі, позначеної зірочкою. Список елементів, що залишилися в iterable, потім призначається позначеній цілі (список може бути порожнім).

source: Else: The object must be an iterable with the same number of items as there are targets in the target list, and the items are assigned, from left to right, to the corresponding targets.
uk: Інакше: об’єкт має бути ітерованим із такою ж кількістю елементів, як цілей у списку цілей, а елементи призначаються зліва направо відповідним цілям.

source: Assignment of an object to a single target is recursively defined as follows.
uk: Призначення об'єкта одній меті рекурсивно визначається наступним чином.

source: If the target is an identifier (name):
uk: Якщо метою є ідентифікатор (ім’я):

source: If the name does not occur in a :keyword:`global` or :keyword:`nonlocal` statement in the current code block: the name is bound to the object in the current local namespace.
uk: Якщо ім’я не зустрічається в операторі :keyword:`global` або :keyword:`nonlocal` у поточному блоці коду: ім’я прив’язується до об’єкта в поточному локальному просторі імен.

source: Otherwise: the name is bound to the object in the global namespace or the outer namespace determined by :keyword:`nonlocal`, respectively.
uk: Інакше: ім’я прив’язується до об’єкта в глобальному просторі імен або зовнішньому просторі імен, визначеному :keyword:`nonlocal` відповідно.

source: The name is rebound if it was already bound. This may cause the reference count for the object previously bound to the name to reach zero, causing the object to be deallocated and its destructor (if it has one) to be called.
uk: Ім'я повертається, якщо воно вже було зв'язане. Це може призвести до того, що кількість посилань для об’єкта, раніше прив’язаного до імені, досягне нуля, що призведе до звільнення об’єкта та виклику його деструктора (якщо він є).

source: If the target is an attribute reference: The primary expression in the reference is evaluated. It should yield an object with assignable attributes; if this is not the case, :exc:`TypeError` is raised. That object is then asked to assign the assigned object to the given attribute; if it cannot perform the assignment, it raises an exception (usually but not necessarily :exc:`AttributeError`).
uk: Якщо метою є посилання на атрибут: обчислюється основний вираз у посиланні. Він повинен давати об’єкт із присвоюваними атрибутами; якщо це не так, виникає :exc:`TypeError`. Тоді цей об’єкт запитується призначити призначений об’єкт даному атрибуту; якщо він не може виконати призначення, він викликає виняток (зазвичай, але не обов’язково :exc:`AttributeError`).

source: Note: If the object is a class instance and the attribute reference occurs on both sides of the assignment operator, the right-hand side expression, ``a.x`` can access either an instance attribute or (if no instance attribute exists) a class attribute. The left-hand side target ``a.x`` is always set as an instance attribute, creating it if necessary. Thus, the two occurrences of ``a.x`` do not necessarily refer to the same attribute: if the right-hand side expression refers to a class attribute, the left-hand side creates a new instance attribute as the target of the assignment::
uk: Примітка. Якщо об’єкт є екземпляром класу, а посилання на атрибут міститься з обох сторін оператора присвоєння, вираз у правому боці ``a.x`` може отримати доступ або до атрибута екземпляра, або (якщо атрибут екземпляра не існує) до класу атрибут. Ліва ціль ``a.x`` завжди встановлюється як атрибут екземпляра, створюючи його за необхідності. Таким чином, два входження ``a.x`` не обов’язково посилаються на той самий атрибут: якщо правий вираз посилається на атрибут класу, ліва частина створює новий атрибут екземпляра як ціль призначення: :

source: This description does not necessarily apply to descriptor attributes, such as properties created with :func:`property`.
uk: Цей опис не обов’язково стосується атрибутів дескрипторів, таких як властивості, створені за допомогою :func:`property`.

source: If the target is a subscription: The primary expression in the reference is evaluated. It should yield either a mutable sequence object (such as a list) or a mapping object (such as a dictionary). Next, the subscript expression is evaluated.
uk: Якщо метою є підписка: обчислюється основний вираз у посиланні. Він повинен давати або об’єкт змінної послідовності (наприклад, список), або об’єкт відображення (наприклад, словник). Далі обчислюється нижній індекс.

source: If the primary is a mutable sequence object (such as a list), the subscript must yield an integer. If it is negative, the sequence's length is added to it. The resulting value must be a nonnegative integer less than the sequence's length, and the sequence is asked to assign the assigned object to its item with that index. If the index is out of range, :exc:`IndexError` is raised (assignment to a subscripted sequence cannot add new items to a list).
uk: Якщо основний об’єкт є змінним об’єктом послідовності (наприклад, список), нижній індекс повинен давати ціле число. Якщо він від’ємний, до нього додається довжина послідовності. Отримане значення має бути невід’ємним цілим числом, меншим за довжину послідовності, і послідовності пропонується призначити призначений об’єкт своєму елементу з цим індексом. Якщо індекс виходить за межі діапазону, виникає :exc:`IndexError` (присвоєння послідовності з індексом не може додавати нові елементи до списку).

source: If the primary is a mapping object (such as a dictionary), the subscript must have a type compatible with the mapping's key type, and the mapping is then asked to create a key/datum pair which maps the subscript to the assigned object. This can either replace an existing key/value pair with the same key value, or insert a new key/value pair (if no key with the same value existed).
uk: Якщо основним є об’єкт відображення (наприклад, словник), нижній індекс повинен мати тип, сумісний із типом ключа відображення, а потім відображення запитується створити пару ключ/дані, яка відображає підіндекс у призначений об’єкт. Це може або замінити наявну пару ключ/значення тим самим значенням ключа, або вставити нову пару ключ/значення (якщо ключа з таким самим значенням не існує).

source: For user-defined objects, the :meth:`__setitem__` method is called with appropriate arguments.
uk: Для об’єктів, визначених користувачем, метод :meth:`__setitem__` викликається з відповідними аргументами.

source: If the target is a slicing: The primary expression in the reference is evaluated. It should yield a mutable sequence object (such as a list). The assigned object should be a sequence object of the same type. Next, the lower and upper bound expressions are evaluated, insofar they are present; defaults are zero and the sequence's length. The bounds should evaluate to integers. If either bound is negative, the sequence's length is added to it. The resulting bounds are clipped to lie between zero and the sequence's length, inclusive. Finally, the sequence object is asked to replace the slice with the items of the assigned sequence. The length of the slice may be different from the length of the assigned sequence, thus changing the length of the target sequence, if the target sequence allows it.
uk: Якщо метою є нарізка: обчислюється основний вираз у посиланні. Він повинен давати змінний об’єкт послідовності (наприклад, список). Призначений об’єкт має бути об’єктом послідовності того самого типу. Далі обчислюються вирази нижньої та верхньої межі, якщо вони присутні; за замовчуванням нуль і довжина послідовності. Межі повинні обчислюватися як цілі числа. Якщо будь-яка межа негативна, до неї додається довжина послідовності. Отримані межі обрізаються між нулем і довжиною послідовності включно. Нарешті, об’єкту послідовності пропонується замінити зріз елементами призначеної послідовності. Довжина зрізу може відрізнятися від довжини призначеної послідовності, таким чином змінюючи довжину цільової послідовності, якщо це дозволяє цільова послідовність.

source: In the current implementation, the syntax for targets is taken to be the same as for expressions, and invalid syntax is rejected during the code generation phase, causing less detailed error messages.
uk: У поточній реалізації синтаксис для цілей вважається таким самим, як і для виразів, а недійсний синтаксис відхиляється під час фази генерації коду, викликаючи менш докладні повідомлення про помилки.

source: Although the definition of assignment implies that overlaps between the left-hand side and the right-hand side are 'simultaneous' (for example ``a, b = b, a`` swaps two variables), overlaps *within* the collection of assigned-to variables occur left-to-right, sometimes resulting in confusion. For instance, the following program prints ``[0, 2]``::
uk: Хоча визначення присвоєння передбачає, що збіги між лівою та правою сторонами є "одночасними" (наприклад, ``a, b = b, a`` міняє місцями дві змінні), збіги *в* колекції присвоєні змінним відбуваються зліва направо, що іноді призводить до плутанини. Наприклад, наступна програма друкує ``[0, 2]``::

source: :pep:`3132` - Extended Iterable Unpacking
uk: :pep:`3132` - Розширене ітераційне розпакування

source: The specification for the ``*target`` feature.
uk: Специфікація функції ``*target``.

source: Augmented assignment statements
uk: Доповнені заяви про призначення

source: Augmented assignment is the combination, in a single statement, of a binary operation and an assignment statement:
uk: Розширене присвоєння — це комбінація в одному операторі двійкової операції та оператора присвоєння:

source: (See section :ref:`primaries` for the syntax definitions of the last three symbols.)
uk: (Див. розділ :ref:`primaries` для визначення синтаксису останніх трьох символів.)

source: An augmented assignment evaluates the target (which, unlike normal assignment statements, cannot be an unpacking) and the expression list, performs the binary operation specific to the type of assignment on the two operands, and assigns the result to the original target. The target is only evaluated once.
uk: Розширене призначення оцінює ціль (яка, на відміну від звичайних операторів призначення, не може бути розпаковуванням) і список виразів, виконує двійкову операцію, специфічну для типу призначення над двома операндами, і призначає результат вихідній цільовій цілі. Ціль оцінюється лише один раз.

source: An augmented assignment expression like ``x += 1`` can be rewritten as ``x = x + 1`` to achieve a similar, but not exactly equal effect. In the augmented version, ``x`` is only evaluated once. Also, when possible, the actual operation is performed *in-place*, meaning that rather than creating a new object and assigning that to the target, the old object is modified instead.
uk: Вираз розширеного присвоєння, як-от ``x += 1``, можна переписати як ``x = x + 1``, щоб досягти подібного, але не зовсім рівного ефекту. У доповненій версії ``x`` обчислюється лише один раз. Крім того, якщо можливо, фактична операція виконується *на місці*, тобто замість створення нового об’єкта та призначення його цільовому об’єкту змінюється старий об’єкт.

source: Unlike normal assignments, augmented assignments evaluate the left-hand side *before* evaluating the right-hand side. For example, ``a[i] += f(x)`` first looks-up ``a[i]``, then it evaluates ``f(x)`` and performs the addition, and lastly, it writes the result back to ``a[i]``.
uk: На відміну від звичайних завдань, розширені завдання оцінюють ліву сторону *перед* оцінкою правої сторони. Наприклад, ``a[i] += f(x)`` спочатку шукає ``a[i]``, потім обчислює ``f(x)`` і виконує додавання, і, нарешті, він записує результат назад до ``a[i]``.

source: With the exception of assigning to tuples and multiple targets in a single statement, the assignment done by augmented assignment statements is handled the same way as normal assignments. Similarly, with the exception of the possible *in-place* behavior, the binary operation performed by augmented assignment is the same as the normal binary operations.
uk: За винятком призначення кортежам і декільком цілям в одному операторі, призначення, виконане доповненими операторами призначення, обробляється так само, як і звичайні призначення. Подібним чином, за винятком можливої поведінки *на місці*, двійкова операція, що виконується розширеним призначенням, є такою самою, як і звичайні двійкові операції.

source: For targets which are attribute references, the same :ref:`caveat about class and instance attributes <attr-target-note>` applies as for regular assignments.
uk: Для цілей, які є посиланнями на атрибути, застосовується те саме :ref:`застереження щодо атрибутів класу та екземпляра <attr-target-note>`, що й для звичайних призначень.

source: Annotated assignment statements
uk: Анотовані заяви про призначення

source: :term:`Annotation <variable annotation>` assignment is the combination, in a single statement, of a variable or attribute annotation and an optional assignment statement:
uk: :term:`Анотація <variable annotation>` присвоєння — це комбінація в одному операторі анотації змінної або атрибута та необов’язкового оператора призначення:

source: The difference from normal :ref:`assignment` is that only single target is allowed.
uk: Відмінність від звичайного :ref:`assignment` полягає в тому, що дозволена лише одна мета.

source: For simple names as assignment targets, if in class or module scope, the annotations are evaluated and stored in a special class or module attribute :attr:`__annotations__` that is a dictionary mapping from variable names (mangled if private) to evaluated annotations. This attribute is writable and is automatically created at the start of class or module body execution, if annotations are found statically.
uk: Для простих імен як цілей призначення, якщо вони знаходяться в області класу або модуля, анотації оцінюються та зберігаються в спеціальному атрибуті класу або модуля :attr:`__annotations__`, який є словниковим відображенням імен змінних (спотворених, якщо приватні) до оцінюваних анотацій. Цей атрибут доступний для запису та автоматично створюється на початку виконання класу або тіла модуля, якщо анотації знайдено статично.

source: For expressions as assignment targets, the annotations are evaluated if in class or module scope, but not stored.
uk: Для виразів як цілей призначення анотації оцінюються, якщо вони знаходяться в області класу або модуля, але не зберігаються.

source: If a name is annotated in a function scope, then this name is local for that scope. Annotations are never evaluated and stored in function scopes.
uk: Якщо ім’я анотовано в області видимості функції, то це ім’я є локальним для цієї області. Анотації ніколи не оцінюються та зберігаються в областях функцій.

source: If the right hand side is present, an annotated assignment performs the actual assignment before evaluating annotations (where applicable). If the right hand side is not present for an expression target, then the interpreter evaluates the target except for the last :meth:`__setitem__` or :meth:`__setattr__` call.
uk: Якщо присутня права сторона, анотоване призначення виконує фактичне призначення перед оцінкою анотацій (де це можливо). Якщо права сторона відсутня для цільового виразу, то інтерпретатор оцінює ціль, за винятком останнього виклику :meth:`__setitem__` або :meth:`__setattr__`.

source: :pep:`526` - Syntax for Variable Annotations
uk: :pep:`526` - Синтаксис для анотацій змінних

source: The proposal that added syntax for annotating the types of variables (including class variables and instance variables), instead of expressing them through comments.
uk: Пропозиція, яка додала синтаксис для анотування типів змінних (включаючи змінні класу та змінні екземпляра), замість вираження їх через коментарі.

source: :pep:`484` - Type hints
uk: :pep:`484` - Тип підказок

source: The proposal that added the :mod:`typing` module to provide a standard syntax for type annotations that can be used in static analysis tools and IDEs.
uk: Пропозиція, яка додала модуль :mod:`typing`, щоб забезпечити стандартний синтаксис для анотацій типів, які можна використовувати в інструментах статичного аналізу та IDE.

source: Now annotated assignments allow same expressions in the right hand side as the regular assignments. Previously, some expressions (like un-parenthesized tuple expressions) caused a syntax error.
uk: Тепер анотовані призначення допускають ті самі вирази в правій частині, що й звичайні призначення. Раніше деякі вирази (наприклад, вирази кортежу без дужок) викликали синтаксичну помилку.

source: The :keyword:`!assert` statement
uk: Оператор :keyword:`!assert`

source: Assert statements are a convenient way to insert debugging assertions into a program:
uk: Оператори Assert — це зручний спосіб вставити в програму твердження налагодження:

source: The simple form, ``assert expression``, is equivalent to ::
uk: Проста форма, ``assert expression``, еквівалентна ::

source: The extended form, ``assert expression1, expression2``, is equivalent to ::
uk: Розширена форма, ``assert expression1, expression2``, еквівалентна ::

source: These equivalences assume that :const:`__debug__` and :exc:`AssertionError` refer to the built-in variables with those names. In the current implementation, the built-in variable :const:`__debug__` is ``True`` under normal circumstances, ``False`` when optimization is requested (command line option :option:`-O`). The current code generator emits no code for an assert statement when optimization is requested at compile time. Note that it is unnecessary to include the source code for the expression that failed in the error message; it will be displayed as part of the stack trace.
uk: Ці еквівалентності припускають, що :const:`__debug__` і :exc:`AssertionError` посилаються на вбудовані змінні з цими іменами. У поточній реалізації вбудована змінна :const:`__debug__` має значення ``True`` за звичайних обставин, ``False``, коли запитується оптимізація (параметр командного рядка :option:`-O`). Поточний генератор коду не видає код для оператора assert, коли під час компіляції запитується оптимізація. Зауважте, що немає потреби включати вихідний код для виразу, що не вдалося виконати, у повідомленні про помилку; він буде відображатися як частина трасування стека.

source: Assignments to :const:`__debug__` are illegal. The value for the built-in variable is determined when the interpreter starts.
uk: Присвоєння :const:`__debug__` є незаконним. Значення для вбудованої змінної визначається під час запуску інтерпретатора.
