Repository: python/python-docs-uk
Catalog: reference/simple_stmts.po
Languages: uk

source: The only feature that requires using the future statement is ``annotations`` (see :pep:`563`).
uk: Єдина функція, яка вимагає використання оператора future, це ``анотації`` (див. :pep:`563`).

source: All historical features enabled by the future statement are still recognized by Python 3. The list includes ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` and ``with_statement``. They are all redundant because they are always enabled, and only kept for backwards compatibility.
uk: Python 3 усе ще розпізнає всі історичні функції, увімкнені оператором future. Список включає ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` і ``with_statement``. Усі вони зайві, оскільки завжди ввімкнені та зберігаються лише для зворотної сумісності.

source: A future statement is recognized and treated specially at compile time: Changes to the semantics of core constructs are often implemented by generating different code. It may even be the case that a new feature introduces new incompatible syntax (such as a new reserved word), in which case the compiler may need to parse the module differently. Such decisions cannot be pushed off until runtime.
uk: Майбутній оператор розпізнається та обробляється спеціально під час компіляції: зміни в семантиці основних конструкцій часто впроваджуються шляхом генерації іншого коду. Може навіть статися так, що нова функція вводить новий несумісний синтаксис (наприклад, нове зарезервоване слово), і в цьому випадку компілятору може знадобитися розібрати модуль по-іншому. Такі рішення не можуть бути відкладені до часу виконання.

source: For any given release, the compiler knows which feature names have been defined, and raises a compile-time error if a future statement contains a feature not known to it.
uk: Для будь-якого конкретного випуску компілятор знає, які назви функцій були визначені, і викликає помилку під час компіляції, якщо майбутній оператор містить функцію, яка йому невідома.

source: The direct runtime semantics are the same as for any import statement: there is a standard module :mod:`__future__`, described later, and it will be imported in the usual way at the time the future statement is executed.
uk: Пряма семантика часу виконання така ж, як і для будь-якого оператора імпорту: є стандартний модуль :mod:`__future__`, описаний пізніше, і його буде імпортовано звичайним способом під час виконання оператора майбутнього.

source: The interesting runtime semantics depend on the specific feature enabled by the future statement.
uk: Цікава семантика часу виконання залежить від конкретної функції, увімкненої майбутнім оператором.

source: Note that there is nothing special about the statement::
uk: Зауважте, що в заяві немає нічого особливого::

source: That is not a future statement; it's an ordinary import statement with no special semantics or syntax restrictions.
uk: Це не заява про майбутнє; це звичайний оператор імпорту без спеціальних семантичних або синтаксичних обмежень.

source: Code compiled by calls to the built-in functions :func:`exec` and :func:`compile` that occur in a module :mod:`M` containing a future statement will, by default, use the new syntax or semantics associated with the future statement. This can be controlled by optional arguments to :func:`compile` --- see the documentation of that function for details.
uk: Код, скомпільований за допомогою викликів вбудованих функцій :func:`exec` і :func:`compile`, які виникають у модулі :mod:`M`, що містить майбутній оператор, за замовчуванням використовуватиме новий пов’язаний синтаксис або семантику з майбутньою заявою. Цим можна керувати необов’язковими аргументами :func:`compile` --- подробиці дивіться в документації цієї функції.

source: A future statement typed at an interactive interpreter prompt will take effect for the rest of the interpreter session. If an interpreter is started with the :option:`-i` option, is passed a script name to execute, and the script includes a future statement, it will be in effect in the interactive session started after the script is executed.
uk: Майбутній оператор, набраний у підказці інтерактивного перекладача, матиме чинність до кінця сеансу перекладача. Якщо інтерпретатор запускається з параметром :option:`-i`, йому передається ім’я сценарію для виконання, і сценарій містить майбутній оператор, він діятиме в інтерактивному сеансі, розпочатому після виконання сценарію.

source: :pep:`236` - Back to the __future__
uk: :pep:`236` - Назад у __future__

source: The original proposal for the __future__ mechanism.
uk: Оригінальна пропозиція щодо механізму __future__.

source: The :keyword:`!global` statement
uk: Оператор :keyword:`!global`

source: The :keyword:`global` statement is a declaration which holds for the entire current code block. It means that the listed identifiers are to be interpreted as globals. It would be impossible to assign to a global variable without :keyword:`!global`, although free variables may refer to globals without being declared global.
uk: Оператор :keyword:`global` — це оголошення, яке зберігається для всього поточного блоку коду. Це означає, що перелічені ідентифікатори слід інтерпретувати як глобальні. Було б неможливо призначити глобальну змінну без :keyword:`!global`, хоча вільні змінні можуть посилатися на глобальні, не будучи оголошеними глобальними.

source: Names listed in a :keyword:`global` statement must not be used in the same code block textually preceding that :keyword:`!global` statement.
uk: Імена, перелічені в операторі :keyword:`global`, не можна використовувати в тому самому блоці коду, що текстово передує оператору :keyword:`!global`.

source: Names listed in a :keyword:`global` statement must not be defined as formal parameters, or as targets in :keyword:`with` statements or :keyword:`except` clauses, or in a :keyword:`for` target list, :keyword:`class` definition, function definition, :keyword:`import` statement, or variable annotation.
uk: Імена, перелічені в операторі :keyword:`global`, не можна визначати як формальні параметри або як цілі в операторах :keyword:`with` або в пунктах :keyword:`except` або в списку цілей :keyword:`for` , визначення :keyword:`class`, визначення функції, оператор :keyword:`import` або анотація змінної.

source: The current implementation does not enforce some of these restrictions, but programs should not abuse this freedom, as future implementations may enforce them or silently change the meaning of the program.
uk: Поточна реалізація не передбачає дотримання деяких із цих обмежень, але програми не повинні зловживати цією свободою, оскільки майбутні реалізації можуть посилити їх дотримання або мовчки змінити значення програми.

source: **Programmer's note:** :keyword:`global` is a directive to the parser. It applies only to code parsed at the same time as the :keyword:`!global` statement. In particular, a :keyword:`!global` statement contained in a string or code object supplied to the built-in :func:`exec` function does not affect the code block *containing* the function call, and code contained in such a string is unaffected by :keyword:`!global` statements in the code containing the function call. The same applies to the :func:`eval` and :func:`compile` functions.
uk: **Примітка програміста:** :keyword:`global` — це директива для аналізатора. Це стосується лише коду, аналізованого одночасно з оператором :keyword:`!global`. Зокрема, оператор :keyword:`!global`, що міститься в рядку або об’єкті коду, що надається вбудованій функції :func:`exec`, не впливає на блок коду, *що містить* виклик функції, і код, що міститься в таких на рядок не впливають оператори :keyword:`!global` у коді, що містить виклик функції. Те саме стосується функцій :func:`eval` і :func:`compile`.

source: The :keyword:`!nonlocal` statement
uk: Оператор :keyword:`!nonlocal`

source: The :keyword:`nonlocal` statement causes the listed identifiers to refer to previously bound variables in the nearest enclosing scope excluding globals. This is important because the default behavior for binding is to search the local namespace first. The statement allows encapsulated code to rebind variables outside of the local scope besides the global (module) scope.
uk: Оператор :keyword:`nonlocal` змушує перелічені ідентифікатори посилатися на раніше зв’язані змінні в найближчій охоплюючій області, за винятком глобальних. Це важливо, тому що поведінка за замовчуванням для зв’язування полягає в тому, щоб спочатку шукати локальний простір імен. Цей оператор дозволяє інкапсульованому коду перезв’язувати змінні за межами локальної області окрім глобальної (модульної) області.

source: Names listed in a :keyword:`nonlocal` statement, unlike those listed in a :keyword:`global` statement, must refer to pre-existing bindings in an enclosing scope (the scope in which a new binding should be created cannot be determined unambiguously).
uk: Імена, перелічені в операторі :keyword:`nonlocal`, на відміну від тих, що перераховані в операторі :keyword:`global`, мають посилатися на вже існуючі прив’язки в охоплюючій області (область, у якій має бути створено нову прив’язку, не може бути визначена однозначно).

source: Names listed in a :keyword:`nonlocal` statement must not collide with pre-existing bindings in the local scope.
uk: Імена, перелічені в операторі :keyword:`nonlocal`, не повинні конфліктувати з уже існуючими зв’язками в локальній області.

source: :pep:`3104` - Access to Names in Outer Scopes
uk: :pep:`3104` - Доступ до імен у зовнішніх областях

source: The specification for the :keyword:`nonlocal` statement.
uk: Специфікація оператора :keyword:`nonlocal`.
