Repository: python/python-docs-uk
Catalog: reference/toplevel_components.po
Languages: uk

source: Top-level components
uk: Компоненти верхнього рівня

source: The Python interpreter can get its input from a number of sources: from a script passed to it as standard input or as program argument, typed in interactively, from a module source file, etc. This chapter gives the syntax used in these cases.
uk: Інтерпретатор Python може отримувати вхідні дані з кількох джерел: зі сценарію, переданого йому як стандартний ввід, або як аргумент програми, введений інтерактивно, з вихідного файлу модуля тощо. У цій главі наведено синтаксис, який використовується в цих випадках.

source: Complete Python programs
uk: Повні програми на Python

source: While a language specification need not prescribe how the language interpreter is invoked, it is useful to have a notion of a complete Python program. A complete Python program is executed in a minimally initialized environment: all built-in and standard modules are available, but none have been initialized, except for :mod:`sys` (various system services), :mod:`builtins` (built-in functions, exceptions and ``None``) and :mod:`__main__`. The latter is used to provide the local and global namespace for execution of the complete program.
uk: Хоча в специфікації мови не обов’язково вказувати, як викликається інтерпретатор мови, корисно мати уявлення про повну програму Python. Повна програма Python виконується в мінімально ініціалізованому середовищі: усі вбудовані та стандартні модулі доступні, але жоден не ініціалізований, за винятком :mod:`sys` (різні системні служби), :mod:`builtins` (вбудований -in функції, винятки та ``None``) і :mod:`__main__`. Останній використовується для надання локального та глобального простору імен для виконання повної програми.

source: The syntax for a complete Python program is that for file input, described in the next section.
uk: Синтаксис повної програми на Python такий же, як і для введення файлів, описаний у наступному розділі.

source: The interpreter may also be invoked in interactive mode; in this case, it does not read and execute a complete program but reads and executes one statement (possibly compound) at a time. The initial environment is identical to that of a complete program; each statement is executed in the namespace of :mod:`__main__`.
uk: Інтерпретатор також може бути викликаний в інтерактивному режимі; в цьому випадку він не читає і не виконує повну програму, а читає і виконує один оператор (можливо, складений) за раз. Початкове середовище ідентично повній програмі; кожен оператор виконується в просторі імен :mod:`__main__`.

source: A complete program can be passed to the interpreter in three forms: with the :option:`-c` *string* command line option, as a file passed as the first command line argument, or as standard input. If the file or standard input is a tty device, the interpreter enters interactive mode; otherwise, it executes the file as a complete program.
uk: Повну програму можна передати інтерпретатору в трьох формах: за допомогою параметра командного рядка :option:`-c` *string*, як файл, переданий як перший аргумент командного рядка, або як стандартний ввід. Якщо файл або стандартний вхід є пристроєм tty, інтерпретатор переходить в інтерактивний режим; інакше він виконує файл як повну програму.

source: File input
uk: Введення файлу

source: All input read from non-interactive files has the same form:
uk: Усі вхідні дані, зчитані з неінтерактивних файлів, мають однакову форму:

source: This syntax is used in the following situations:
uk: Цей синтаксис використовується в таких ситуаціях:

source: when parsing a complete Python program (from a file or from a string);
uk: при розборі повної програми Python (з файлу або з рядка);

source: when parsing a module;
uk: при розборі модуля;

source: when parsing a string passed to the :func:`exec` function;
uk: під час аналізу рядка, переданого функції :func:`exec`;

source: Interactive input
uk: Інтерактивне введення

source: Input in interactive mode is parsed using the following grammar:
uk: Введення в інтерактивному режимі аналізується за такою граматикою:

source: Note that a (top-level) compound statement must be followed by a blank line in interactive mode; this is needed to help the parser detect the end of the input.
uk: Зауважте, що в інтерактивному режимі після складеного оператора (вищого рівня) має йти порожній рядок; це потрібно, щоб допомогти аналізатору визначити кінець введення.

source: Expression input
uk: Введення виразу

source: :func:`eval` is used for expression input. It ignores leading whitespace. The string argument to :func:`eval` must have the following form:
uk: :func:`eval` використовується для введення виразу. Він ігнорує початкові пробіли. Рядковий аргумент :func:`eval` повинен мати такий вигляд:

source: module
uk: модуль

source: sys
uk: система

source: builtins
uk: вбудовані елементи

source: Windows
uk: вікна

source: built-in function
uk: вбудована функція
