Repository: python/python-docs-uk
Catalog: library/__future__.po
Languages: uk

source: :mod:`__future__` --- Future statement definitions
uk: :mod:`__future__` --- Визначення майбутніх операторів

source: **Source code:** :source:`Lib/__future__.py`
uk: **Вихідний код:** :source:`Lib/__future__.py`

source: :mod:`__future__` is a real module, and serves three purposes:
uk: :mod:`__future__` — це реальний модуль, який служить трьом цілям:

source: To avoid confusing existing tools that analyze import statements and expect to find the modules they're importing.
uk: Щоб не плутати існуючі інструменти, які аналізують оператори імпорту та очікують знайти модулі, які вони імпортують.

source: To ensure that :ref:`future statements <future>` run under releases prior to 2.1 at least yield runtime exceptions (the import of :mod:`__future__` will fail, because there was no module of that name prior to 2.1).
uk: Щоб переконатися, що :ref:`future statements <future>` виконуються у випусках до 2.1, принаймні створюватимуться винятки часу виконання (імпорт :mod:`__future__` не вдасться, оскільки не було модуля з такою назвою до 2.1).

source: To document when incompatible changes were introduced, and when they will be --- or were --- made mandatory. This is a form of executable documentation, and can be inspected programmatically via importing :mod:`__future__` and examining its contents.
uk: Щоб задокументувати, коли були внесені несумісні зміни, і коли вони будуть --- або були --- зроблені обов'язковими. Це форма виконуваної документації, яку можна перевірити програмним шляхом, імпортувавши :mod:`__future__` і перевіривши його вміст.

source: Each statement in :file:`__future__.py` is of the form::
uk: Кожен оператор у :file:`__future__.py` має форму::

source: where, normally, *OptionalRelease* is less than *MandatoryRelease*, and both are 5-tuples of the same form as :data:`sys.version_info`::
uk: де, як правило, *OptionalRelease* менше ніж *MandatoryRelease*, і обидва є 5-кортежами тієї самої форми, що й :data:`sys.version_info`::

source: *OptionalRelease* records the first release in which the feature was accepted.
uk: *OptionalRelease* записує перший випуск, у якому цю функцію було прийнято.

source: In the case of a *MandatoryRelease* that has not yet occurred, *MandatoryRelease* predicts the release in which the feature will become part of the language.
uk: У випадку *MandatoryRelease*, який ще не відбувся, *MandatoryRelease* передбачає випуск, у якому ця функція стане частиною мови.

source: Else *MandatoryRelease* records when the feature became part of the language; in releases at or after that, modules no longer need a future statement to use the feature in question, but may continue to use such imports.
uk: Інакше *MandatoryRelease* записує, коли функція стала частиною мови; у випусках на цьому або після цього модулям більше не потрібен майбутній оператор для використання відповідної функції, але вони можуть продовжувати використовувати такий імпорт.

source: *MandatoryRelease* may also be ``None``, meaning that a planned feature got dropped.
uk: *MandatoryRelease* також може бути ``None``, що означає, що заплановану функцію було видалено.

source: Instances of class :class:`_Feature` have two corresponding methods, :meth:`getOptionalRelease` and :meth:`getMandatoryRelease`.
uk: Екземпляри класу :class:`_Feature` мають два відповідні методи, :meth:`getOptionalRelease` і :meth:`getMandatoryRelease`.

source: *CompilerFlag* is the (bitfield) flag that should be passed in the fourth argument to the built-in function :func:`compile` to enable the feature in dynamically compiled code. This flag is stored in the :attr:`compiler_flag` attribute on :class:`_Feature` instances.
uk: *CompilerFlag* — це прапор (бітове поле), який слід передати в четвертому аргументі вбудованої функції :func:`compile`, щоб увімкнути функцію в динамічно скомпільованому коді. Цей прапорець зберігається в атрибуті :attr:`compiler_flag` екземплярів :class:`_Feature`.

source: No feature description will ever be deleted from :mod:`__future__`. Since its introduction in Python 2.1 the following features have found their way into the language using this mechanism:
uk: Жоден опис функції ніколи не буде видалено з :mod:`__future__`. З моменту появи в Python 2.1 наступні функції знайшли шлях до мови за допомогою цього механізму:

source: feature
uk: функція

source: optional in
uk: факультативно в

source: mandatory in
uk: обов'язкове в

source: effect
uk: ефект

source: nested_scopes
uk: вкладені_області

source: :pep:`227`: *Statically Nested Scopes*
uk: :pep:`227`: *Статично вкладені області*

source: generators
uk: генератори

source: :pep:`255`: *Simple Generators*
uk: :pep:`255`: *Прості генератори*

source: division
uk: поділ

source: :pep:`238`: *Changing the Division Operator*
uk: :pep:`238`: *Зміна оператора ділення*

source: absolute_import
uk: абсолютний_імпорт

source: :pep:`328`: *Imports: Multi-Line and Absolute/Relative*
uk: :pep:`328`: *Імпорт: багаторядковий і абсолютний/відносний*

source: :pep:`343`: *The "with" Statement*
uk: :pep:`343`: *Заява "з"*

source: print_function
uk: функція друку

source: :pep:`3105`: *Make print a function*
uk: :pep:`3105`: *Зробити функцію друку*

source: :pep:`3112`: *Bytes literals in Python 3000*
uk: :pep:`3112`: *Байтові літерали в Python 3000*

source: :pep:`479`: *StopIteration handling inside generators*
uk: :pep:`479`: *Обробка StopIteration всередині генераторів*

source: annotations
uk: анотації

source: TBD [1]_
uk: Уточнюється [1]_

source: :pep:`563`: *Postponed evaluation of annotations*
uk: :pep:`563`: *Відкладена оцінка анотацій*

source: ``from __future__ import annotations`` was previously scheduled to become mandatory in Python 3.10, but the Python Steering Council twice decided to delay the change (`announcement for Python 3.10 <https://mail.python.org/archives/list/python-dev@python.org/message/CLVXXPQ2T2LQ5MP2Y53VVQFCXYWQJHKZ/>`__; `announcement for Python 3.11 <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__). No final decision has been made yet. See also :pep:`563` and :pep:`649`.
uk: ``from __future__ import annotations`` раніше було заплановано, щоб стати обов’язковим у Python 3.10, але Керівна рада Python двічі вирішила відкласти цю зміну (`оголошення для Python 3.10 <https://mail.python.org/archives/list/python-dev@python.org/message/CLVXXPQ2T2LQ5MP2Y53VVQFCXYWQJHKZ/>`__; `оголошення для Python 3.11 <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__). Остаточне рішення ще не прийнято. Дивіться також :pep:`563` і :pep:`649`.

source: How the compiler treats future imports.
uk: Як компілятор обробляє майбутні імпорти.
