Repository: python/python-docs-uk
Catalog: library/__main__.po
Languages: uk

source: In Python, the special name ``__main__`` is used for two important constructs:
uk: У Python спеціальна назва ``__main__`` використовується для двох важливих конструкцій:

source: the name of the top-level environment of the program, which can be checked using the ``__name__ == '__main__'`` expression; and
uk: ім'я середовища верхнього рівня програми, яке можна перевірити за допомогою виразу ``__name__ == '__main__'``; і

source: the ``__main__.py`` file in Python packages.
uk: файл ``__main__.py`` в пакетах Python.

source: Both of these mechanisms are related to Python modules; how users interact with them and how they interact with each other. They are explained in detail below. If you're new to Python modules, see the tutorial section :ref:`tut-modules` for an introduction.
uk: Обидва ці механізми пов’язані з модулями Python; як користувачі взаємодіють з ними та як вони взаємодіють один з одним. Вони детально пояснюються нижче. Якщо ви новачок у роботі з модулями Python, ознайомтеся з розділом посібника :ref:`tut-modules`.

source: When a Python module or package is imported, ``__name__`` is set to the module's name. Usually, this is the name of the Python file itself without the ``.py`` extension::
uk: Коли імпортується модуль або пакет Python, ``__name__`` встановлюється на ім’я модуля. Зазвичай це назва самого файлу Python без розширення ``.py``::

source: If the file is part of a package, ``__name__`` will also include the parent package's path::
uk: Якщо файл є частиною пакета, ``__name__`` також включатиме шлях до батьківського пакета::

source: However, if the module is executed in the top-level code environment, its ``__name__`` is set to the string ``'__main__'``.
uk: Однак, якщо модуль виконується в кодовому середовищі верхнього рівня, його ``__name__`` встановлюється на рядок ``'__main__'``.

source: What is the "top-level code environment"?
uk: Що таке "середовище коду верхнього рівня"?

source: ``__main__`` is the name of the environment where top-level code is run. "Top-level code" is the first user-specified Python module that starts running. It's "top-level" because it imports all other modules that the program needs. Sometimes "top-level code" is called an *entry point* to the application.
uk: ``__main__`` — це назва середовища, де виконується код верхнього рівня. "Код верхнього рівня" — це перший зазначений користувачем модуль Python, який запускається. Це "верхній рівень", тому що він імпортує всі інші модулі, які потрібні програмі. Іноді "код верхнього рівня" називають *точкою входу* до програми.

source: The top-level code environment can be:
uk: Кодове середовище верхнього рівня може бути:

source: the scope of an interactive prompt::
uk: область дії інтерактивної підказки:

source: the Python module passed to the Python interpreter as a file argument:
uk: модуль Python передається інтерпретатору Python як аргумент файлу:

source: the Python module or package passed to the Python interpreter with the :option:`-m` argument:
uk: модуль або пакет Python передається інтерпретатору Python з аргументом :option:`-m`:

source: Python code read by the Python interpreter from standard input:
uk: Код Python, який читається інтерпретатором Python зі стандартного введення:

source: Python code passed to the Python interpreter with the :option:`-c` argument:
uk: Код Python передається інтерпретатору Python з аргументом :option:`-c`:

source: In each of these situations, the top-level module's ``__name__`` is set to ``'__main__'``.
uk: У кожній із цих ситуацій ``__name__`` модуля верхнього рівня встановлено на ``'__main__'``.

source: As a result, a module can discover whether or not it is running in the top-level environment by checking its own ``__name__``, which allows a common idiom for conditionally executing code when the module is not initialized from an import statement::
uk: Як наслідок, модуль може виявити, чи працює він у середовищі верхнього рівня, перевіряючи власне ``__name__``, що дозволяє загальну ідіому для умовного виконання коду, коли модуль не ініціалізовано оператором імпорту: :

source: For a more detailed look at how ``__name__`` is set in all situations, see the tutorial section :ref:`tut-modules`.
uk: Для більш детального ознайомлення з тим, як ``__name__`` встановлюється в усіх ситуаціях, перегляньте розділ підручника :ref:`tut-modules`.

source: Idiomatic Usage
uk: Ідіоматичне використання

source: Some modules contain code that is intended for script use only, like parsing command-line arguments or fetching data from standard input. If a module like this was imported from a different module, for example to unit test it, the script code would unintentionally execute as well.
uk: Деякі модулі містять код, призначений лише для використання сценарієм, як-от аналіз аргументів командного рядка або отримання даних зі стандартного введення. Якщо подібний модуль було імпортовано з іншого модуля, наприклад, для модульного тестування, код сценарію також буде ненавмисно виконано.

source: This is where using the ``if __name__ == '__main__'`` code block comes in handy. Code within this block won't run unless the module is executed in the top-level environment.
uk: Тут стане в нагоді використання блоку коду ``if __name__ == '__main__''``. Код у цьому блоці не працюватиме, якщо модуль не буде виконано в середовищі верхнього рівня.

source: Note that if the module didn't encapsulate code inside the ``main`` function but instead put it directly within the ``if __name__ == '__main__'`` block, the ``phrase`` variable would be global to the entire module. This is error-prone as other functions within the module could be unintentionally using the global variable instead of a local name. A ``main`` function solves this problem.
uk: Зауважте, що якби модуль не інкапсулював код у функцію ``main``, а поміщав його безпосередньо в блок ``if __name__ == '__main__'``, змінна ``phrase`` буде глобальною для весь модуль. Це загрожує помилками, оскільки інші функції в модулі можуть ненавмисно використовувати глобальну змінну замість локального імені. Функція ``main`` вирішує цю проблему.

source: Using a ``main`` function has the added benefit of the ``echo`` function itself being isolated and importable elsewhere. When ``echo.py`` is imported, the ``echo`` and ``main`` functions will be defined, but neither of them will be called, because ``__name__ != '__main__'``.
uk: Використання функції ``main`` має додаткову перевагу в тому, що сама функція ``echo`` є ізольованою та її можна імпортувати в інше місце. Коли імпортується ``echo.py``, функції ``echo`` і ``main`` будуть визначені, але жодна з них не буде викликана, оскільки ``__name__ != '__main__'``.

source: Packaging Considerations
uk: Зауваження щодо упаковки

source: ``main`` functions are often used to create command-line tools by specifying them as entry points for console scripts. When this is done, `pip <https://pip.pypa.io/>`_ inserts the function call into a template script, where the return value of ``main`` is passed into :func:`sys.exit`. For example::
uk: Функції ``main`` часто використовуються для створення інструментів командного рядка, вказуючи їх як точки входу для сценаріїв консолі. Коли це зроблено, `pip <https://pip.pypa.io/>`_ вставляє виклик функції в сценарій шаблону, де повернуте значення ``main`` передається в :func:`sys.exit`. Наприклад::

source: Since the call to ``main`` is wrapped in :func:`sys.exit`, the expectation is that your function will return some value acceptable as an input to :func:`sys.exit`; typically, an integer or ``None`` (which is implicitly returned if your function does not have a return statement).
uk: Оскільки виклик ``main`` загорнутий у :func:`sys.exit`, очікується, що ваша функція поверне деяке значення, прийнятне як вхідні дані для :func:`sys.exit`; як правило, ціле число або ``None`` (що неявно повертається, якщо ваша функція не має оператора return).

source: In particular, be careful about returning strings from your ``main`` function. :func:`sys.exit` will interpret a string argument as a failure message, so your program will have an exit code of ``1``, indicating failure, and the string will be written to :data:`sys.stderr`. The ``echo.py`` example from earlier exemplifies using the ``sys.exit(main())`` convention.
uk: Зокрема, будьте обережні щодо повернення рядків з вашої функції ``main``. :func:`sys.exit` інтерпретує рядковий аргумент як повідомлення про помилку, тому ваша програма матиме код виходу ``1``, що вказує на помилку, і рядок буде записано в :data:`sys.stderr`. Приклад ``echo.py`` з попереднього прикладу використання угоди ``sys.exit(main())``.

source: `Python Packaging User Guide <https://packaging.python.org/>`_ contains a collection of tutorials and references on how to distribute and install Python packages with modern tools.
uk: `Посібник користувача з пакування Python <https://packaging.python.org/>`_ містить колекцію посібників і довідок про те, як розповсюджувати та встановлювати пакунки Python за допомогою сучасних інструментів.

source: ``__main__.py`` in Python Packages
uk: ``__main__.py`` в пакетах Python

source: If you are not familiar with Python packages, see section :ref:`tut-packages` of the tutorial. Most commonly, the ``__main__.py`` file is used to provide a command-line interface for a package. Consider the following hypothetical package, "bandclass":
uk: Якщо ви не знайомі з пакетами Python, перегляньте розділ :ref:`tut-packages` підручника. Найчастіше файл ``__main__.py`` використовується для забезпечення інтерфейсу командного рядка для пакета. Розглянемо наступний гіпотетичний пакет, "bandclass":

source: ``__main__.py`` will be executed when the package itself is invoked directly from the command line using the :option:`-m` flag. For example:
uk: ``__main__.py`` буде виконано, коли сам пакет викликається безпосередньо з командного рядка за допомогою прапорця :option:`-m`. Наприклад:

source: This command will cause ``__main__.py`` to run. How you utilize this mechanism will depend on the nature of the package you are writing, but in this hypothetical case, it might make sense to allow the teacher to search for students::
uk: Ця команда призведе до запуску ``__main__.py``. Те, як ви використовуєте цей механізм, залежатиме від характеру пакету, який ви пишете, але в цьому гіпотетичному випадку може мати сенс дозволити вчителю шукати учнів:

source: Note that ``from .student import search_students`` is an example of a relative import. This import style can be used when referencing modules within a package. For more details, see :ref:`intra-package-references` in the :ref:`tut-modules` section of the tutorial.
uk: Зауважте, що ``from .student import search_students`` є прикладом відносного імпорту. Цей стиль імпорту можна використовувати під час посилань на модулі в пакеті. Для отримання додаткової інформації перегляньте :ref:`intra-package-references` у розділі :ref:`tut-modules` підручника.

source: If used, an ``if __name__ == '__main__'`` block will still work as expected for a ``__main__.py`` file within a package, because its ``__name__`` attribute will include the package's path if imported::
uk: Якщо використовується, блок ``if __name__ == '__main__'`` все одно працюватиме належним чином для файлу ``__main__.py`` у пакеті, тому що його атрибут ``__name__`` включатиме шлях до пакета, якщо імпортовано ::

source: See :mod:`runpy` for more details on the :option:`-m` flag to the interpreter executable.
uk: Перегляньте :mod:`runpy` для отримання додаткової інформації про прапорець :option:`-m` для виконуваного файлу інтерпретатора.

source: See :mod:`zipapp` for how to run applications packaged as *.zip* files. In this case Python looks for a ``__main__.py`` file in the root directory of the archive.
uk: Перегляньте :mod:`zipapp`, щоб дізнатися, як запускати програми, упаковані у файли *.zip*. У цьому випадку Python шукає файл ``__main__.py`` в кореневому каталозі архіву.

source: ``import __main__``
uk: ``імпорт __main__``

source: Regardless of which module a Python program was started with, other modules running within that same program can import the top-level environment's scope (:term:`namespace`) by importing the ``__main__`` module. This doesn't import a ``__main__.py`` file but rather whichever module that received the special name ``'__main__'``.
uk: Незалежно від того, з якого модуля була запущена програма Python, інші модулі, що працюють у цій же програмі, можуть імпортувати область верхнього рівня середовища (:term:`namespace`), імпортуючи модуль ``__main__``. Це імпортує не файл ``__main__.py``, а будь-який модуль, який отримав спеціальну назву ``'__main__'``.

source: Here is an example module that consumes the ``__main__`` namespace::
uk: Ось приклад модуля, який використовує простір імен ``__main__``::

source: Example usage of this module could be as follows::
uk: Приклад використання цього модуля може бути наступним:

source: Now, if we started our program, the result would look like this:
uk: Тепер, якби ми запустили нашу програму, результат виглядав би так:

source: The exit code of the program would be 1, indicating an error. Uncommenting the line with ``my_name = "Dinsdale"`` fixes the program and now it exits with status code 0, indicating success:
uk: Код виходу програми буде 1, що вказуватиме на помилку. Розкоментування рядка ``my_name = "Dinsdale"`` виправляє програму, і тепер вона завершує роботу з кодом статусу 0, що вказує на успіх:

source: Note that importing ``__main__`` doesn't cause any issues with unintentionally running top-level code meant for script use which is put in the ``if __name__ == "__main__"`` block of the ``start`` module. Why does this work?
uk: Зауважте, що імпорт ``__main__`` не викликає жодних проблем із ненавмисним запуском коду верхнього рівня, призначеного для використання сценарію, який розміщено в ``if __name__ == "__main__"`` блоку ``start`` модуля . Чому це працює?

source: The Python REPL is another example of a "top-level environment", so anything defined in the REPL becomes part of the ``__main__`` scope::
uk: Python REPL є ще одним прикладом "середовища верхнього рівня", тому все, що визначено в REPL, стає частиною області ``__main__``::

source: Note that in this case the ``__main__`` scope doesn't contain a ``__file__`` attribute as it's interactive.
uk: Зауважте, що в цьому випадку область ``__main__`` не містить атрибут ``__file__``, оскільки вона інтерактивна.

source: The ``__main__`` scope is used in the implementation of :mod:`pdb` and :mod:`rlcompleter`.
uk: Область ``__main__`` використовується в реалізації :mod:`pdb` і :mod:`rlcompleter`.
