Repository: python/python-docs-uk
Catalog: library/abc.po
Languages: uk

source: :mod:`abc` --- Abstract Base Classes
uk: :mod:`abc` --- Абстрактні базові класи

source: **Source code:** :source:`Lib/abc.py`
uk: **Вихідний код:** :source:`Lib/abc.py`

source: This module provides the infrastructure for defining :term:`abstract base classes <abstract base class>` (ABCs) in Python, as outlined in :pep:`3119`; see the PEP for why this was added to Python. (See also :pep:`3141` and the :mod:`numbers` module regarding a type hierarchy for numbers based on ABCs.)
uk: Цей модуль забезпечує інфраструктуру для визначення :term:`абстрактних базових класів <abstract base class>` (ABC) у Python, як описано в :pep:`3119`; див. PEP, чому це було додано до Python. (Див. також :pep:`3141` і модуль :mod:`numbers` щодо ієрархії типів для чисел на основі ABC.)

source: The :mod:`collections` module has some concrete classes that derive from ABCs; these can, of course, be further derived. In addition, the :mod:`collections.abc` submodule has some ABCs that can be used to test whether a class or instance provides a particular interface, for example, if it is hashable or if it is a mapping.
uk: Модуль :mod:`collections` має деякі конкретні класи, які походять від ABC; вони, звичайно, можуть бути отримані далі. Крім того, субмодуль :mod:`collections.abc` має деякі азбуки, які можна використовувати, щоб перевірити, чи надає клас або примірник певний інтерфейс, наприклад, чи є він хешованим або чи є це відображенням.

source: This module provides the metaclass :class:`ABCMeta` for defining ABCs and a helper class :class:`ABC` to alternatively define ABCs through inheritance:
uk: Цей модуль надає метаклас :class:`ABCMeta` для визначення ABC і допоміжний клас :class:`ABC` для альтернативного визначення ABC через успадкування:

source: A helper class that has :class:`ABCMeta` as its metaclass. With this class, an abstract base class can be created by simply deriving from :class:`ABC` avoiding sometimes confusing metaclass usage, for example::
uk: Допоміжний клас, який має метаклас :class:`ABCMeta`. За допомогою цього класу можна створити абстрактний базовий клас, просто похідним від :class:`ABC`, уникаючи інколи заплутаного використання метакласу, наприклад::

source: Note that the type of :class:`ABC` is still :class:`ABCMeta`, therefore inheriting from :class:`ABC` requires the usual precautions regarding metaclass usage, as multiple inheritance may lead to metaclass conflicts. One may also define an abstract base class by passing the metaclass keyword and using :class:`ABCMeta` directly, for example::
uk: Зауважте, що тип :class:`ABC` все ще :class:`ABCMeta`, тому успадкування від :class:`ABC` вимагає звичайних запобіжних заходів щодо використання метакласу, оскільки множинне успадкування може призвести до конфліктів метакласів. Можна також визначити абстрактний базовий клас, передавши ключове слово metaclass і безпосередньо використовуючи :class:`ABCMeta`, наприклад::

source: Metaclass for defining Abstract Base Classes (ABCs).
uk: Метаклас для визначення абстрактних базових класів (ABC).

source: Use this metaclass to create an ABC. An ABC can be subclassed directly, and then acts as a mix-in class. You can also register unrelated concrete classes (even built-in classes) and unrelated ABCs as "virtual subclasses" -- these and their descendants will be considered subclasses of the registering ABC by the built-in :func:`issubclass` function, but the registering ABC won't show up in their MRO (Method Resolution Order) nor will method implementations defined by the registering ABC be callable (not even via :func:`super`). [#]_
uk: Використовуйте цей метаклас для створення ABC. ABC може бути безпосередньо підкласом, а потім діяти як змішаний клас. Ви також можете зареєструвати непов’язані конкретні класи (навіть вбудовані) і непов’язані ABC як "віртуальні підкласи" — ці та їхні нащадки вважатимуться підкласами реєструючого ABC вбудованою функцією :func:`issubclass`, але реєструючий ABC не відображатиметься в їхньому MRO (Method Resolution Order), а також реалізації методів, визначені реєструючим ABC, не можна буде викликати (навіть через :func:`super`). [#]_

source: Classes created with a metaclass of :class:`ABCMeta` have the following method:
uk: Класи, створені за допомогою метакласу :class:`ABCMeta`, мають такий метод:

source: Register *subclass* as a "virtual subclass" of this ABC. For example::
uk: Зареєструйте *підклас* як "віртуальний підклас" цього ABC. Наприклад::

source: Returns the registered subclass, to allow usage as a class decorator.
uk: Повертає зареєстрований підклас, щоб дозволити використання як декоратор класу.

source: To detect calls to :meth:`register`, you can use the :func:`get_cache_token` function.
uk: Щоб виявити виклики :meth:`register`, ви можете використати функцію :func:`get_cache_token`.

source: You can also override this method in an abstract base class:
uk: Ви також можете перевизначити цей метод в абстрактному базовому класі:

source: (Must be defined as a class method.)
uk: (Повинен бути визначений як метод класу.)

source: Check whether *subclass* is considered a subclass of this ABC. This means that you can customize the behavior of ``issubclass`` further without the need to call :meth:`register` on every class you want to consider a subclass of the ABC. (This class method is called from the :meth:`__subclasscheck__` method of the ABC.)
uk: Перевірте, чи вважається *підклас* підкласом цього ABC. Це означає, що ви можете налаштувати поведінку ``issubclass`` без необхідності викликати :meth:`register` для кожного класу, який ви хочете вважати підкласом ABC. (Цей метод класу викликається з методу :meth:`__subclasscheck__` ABC.)

source: This method should return ``True``, ``False`` or ``NotImplemented``. If it returns ``True``, the *subclass* is considered a subclass of this ABC. If it returns ``False``, the *subclass* is not considered a subclass of this ABC, even if it would normally be one. If it returns ``NotImplemented``, the subclass check is continued with the usual mechanism.
uk: Цей метод має повертати ``True``, ``False`` або ``NotImplemented``. Якщо він повертає ``True``, *підклас* вважається підкласом цього ABC. Якщо він повертає ``False``, *підклас* не вважається підкласом цього ABC, навіть якщо він зазвичай є ним. Якщо він повертає ``NotImplemented``, перевірка підкласу продовжується за звичайним механізмом.

source: For a demonstration of these concepts, look at this example ABC definition::
uk: Для демонстрації цих концепцій подивіться на цей приклад визначення ABC:

source: The ABC ``MyIterable`` defines the standard iterable method, :meth:`~iterator.__iter__`, as an abstract method. The implementation given here can still be called from subclasses. The :meth:`get_iterator` method is also part of the ``MyIterable`` abstract base class, but it does not have to be overridden in non-abstract derived classes.
uk: ABC ``MyIterable`` визначає стандартний ітераційний метод, :meth:`~iterator.__iter__`, як абстрактний метод. Наведену тут реалізацію все ще можна викликати з підкласів. Метод :meth:`get_iterator` також є частиною абстрактного базового класу ``MyIterable``, але його не потрібно перевизначати в неабстрактних похідних класах.

source: The :meth:`__subclasshook__` class method defined here says that any class that has an :meth:`~iterator.__iter__` method in its :attr:`~object.__dict__` (or in that of one of its base classes, accessed via the :attr:`~class.__mro__` list) is considered a ``MyIterable`` too.
uk: Метод класу :meth:`__subclasshook__`, визначений тут, говорить, що будь-який клас, який має метод :meth:`~iterator.__iter__` у своєму :attr:`~object.__dict__` (або в одному зі своїх базових класів, доступ через список :attr:`~class.__mro__` також вважається ``MyIterable``.

source: Finally, the last line makes ``Foo`` a virtual subclass of ``MyIterable``, even though it does not define an :meth:`~iterator.__iter__` method (it uses the old-style iterable protocol, defined in terms of :meth:`__len__` and :meth:`__getitem__`). Note that this will not make ``get_iterator`` available as a method of ``Foo``, so it is provided separately.
uk: Нарешті, останній рядок робить ``Foo`` віртуальним підкласом ``MyIterable``, навіть якщо він не визначає метод :meth:`~iterator.__iter__` (він використовує старий ітераційний протокол, визначений у умови :meth:`__len__` і :meth:`__getitem__`). Зверніть увагу, що це не зробить ``get_iterator`` доступним як метод ``Foo``, тому він надається окремо.

source: The :mod:`abc` module also provides the following decorator:
uk: Модуль :mod:`abc` також надає наступний декоратор:

source: A decorator indicating abstract methods.
uk: Декоратор, що вказує на абстрактні методи.

source: Using this decorator requires that the class's metaclass is :class:`ABCMeta` or is derived from it. A class that has a metaclass derived from :class:`ABCMeta` cannot be instantiated unless all of its abstract methods and properties are overridden. The abstract methods can be called using any of the normal 'super' call mechanisms. :func:`abstractmethod` may be used to declare abstract methods for properties and descriptors.
uk: Використання цього декоратора вимагає, щоб метаклас класу був :class:`ABCMeta` або був похідним від нього. Клас, який має метаклас, похідний від :class:`ABCMeta`, не може бути створений, якщо всі його абстрактні методи та властивості не перевизначено. Абстрактні методи можна викликати за допомогою будь-якого звичайних механізмів "супер" виклику. :func:`abstractmethod` можна використовувати для оголошення абстрактних методів властивостей і дескрипторів.

source: Dynamically adding abstract methods to a class, or attempting to modify the abstraction status of a method or class once it is created, are only supported using the :func:`update_abstractmethods` function. The :func:`abstractmethod` only affects subclasses derived using regular inheritance; "virtual subclasses" registered with the ABC's :meth:`register` method are not affected.
uk: Динамічне додавання абстрактних методів до класу або спроба змінити стан абстракції методу чи класу після його створення підтримується лише за допомогою функції :func:`update_abstractmethods`. :func:`abstractmethod` впливає лише на підкласи, отримані за допомогою звичайного успадкування; "віртуальні підкласи", зареєстровані за допомогою методу :meth:`register` ABC, не впливають.

source: When :func:`abstractmethod` is applied in combination with other method descriptors, it should be applied as the innermost decorator, as shown in the following usage examples::
uk: Коли :func:`abstractmethod` застосовано в поєднанні з іншими дескрипторами методу, його слід застосовувати як внутрішній декоратор, як показано в наведених нижче прикладах використання:

source: In order to correctly interoperate with the abstract base class machinery, the descriptor must identify itself as abstract using :attr:`__isabstractmethod__`. In general, this attribute should be ``True`` if any of the methods used to compose the descriptor are abstract. For example, Python's built-in :class:`property` does the equivalent of::
uk: Щоб правильно взаємодіяти з механізмом абстрактного базового класу, дескриптор повинен ідентифікувати себе як абстрактний за допомогою :attr:`__isabstractmethod__`. Загалом цей атрибут має бути ``True``, якщо будь-який із методів, використаних для складання дескриптора, є абстрактним. Наприклад, вбудована властивість Python :class:`property` виконує еквівалент:

source: Unlike Java abstract methods, these abstract methods may have an implementation. This implementation can be called via the :func:`super` mechanism from the class that overrides it. This could be useful as an end-point for a super-call in a framework that uses cooperative multiple-inheritance.
uk: На відміну від абстрактних методів Java, ці абстрактні методи можуть мати реалізацію. Цю реалізацію можна викликати через механізм :func:`super` з класу, який її замінює. Це може бути корисним як кінцева точка для супервиклику в структурі, яка використовує кооперативне множинне успадкування.

source: The :mod:`abc` module also supports the following legacy decorators:
uk: Модуль :mod:`abc` також підтримує наступні застарілі декоратори:

source: It is now possible to use :class:`classmethod` with :func:`abstractmethod`, making this decorator redundant.
uk: Тепер можна використовувати :class:`classmethod` з :func:`abstractmethod`, що робить цей декоратор зайвим.

source: A subclass of the built-in :func:`classmethod`, indicating an abstract classmethod. Otherwise it is similar to :func:`abstractmethod`.
uk: Підклас вбудованого :func:`classmethod`, що вказує на абстрактний метод класу. В іншому він схожий на :func:`abstractmethod`.

source: This special case is deprecated, as the :func:`classmethod` decorator is now correctly identified as abstract when applied to an abstract method::
uk: Цей спеціальний випадок застарів, оскільки декоратор :func:`classmethod` тепер правильно ідентифікується як абстрактний, коли застосовується до абстрактного методу::

source: It is now possible to use :class:`staticmethod` with :func:`abstractmethod`, making this decorator redundant.
uk: Тепер можна використовувати :class:`staticmethod` з :func:`abstractmethod`, що робить цей декоратор зайвим.

source: A subclass of the built-in :func:`staticmethod`, indicating an abstract staticmethod. Otherwise it is similar to :func:`abstractmethod`.
uk: Підклас вбудованого :func:`staticmethod`, що вказує на абстрактний статичний метод. В іншому він схожий на :func:`abstractmethod`.

source: This special case is deprecated, as the :func:`staticmethod` decorator is now correctly identified as abstract when applied to an abstract method::
uk: Цей окремий випадок застарів, оскільки декоратор :func:`staticmethod` тепер правильно ідентифікується як абстрактний, коли застосовується до абстрактного методу::

source: It is now possible to use :class:`property`, :meth:`property.getter`, :meth:`property.setter` and :meth:`property.deleter` with :func:`abstractmethod`, making this decorator redundant.
uk: Тепер можна використовувати :class:`property`, :meth:`property.getter`, :meth:`property.setter` і :meth:`property.deleter` з :func:`abstractmethod`, створюючи цей декоратор надлишковий.

source: A subclass of the built-in :func:`property`, indicating an abstract property.
uk: Підклас вбудованої :func:`property`, що вказує на абстрактну властивість.

source: This special case is deprecated, as the :func:`property` decorator is now correctly identified as abstract when applied to an abstract method::
uk: Цей окремий випадок застарів, оскільки декоратор :func:`property` тепер правильно ідентифікується як абстрактний, коли застосовується до абстрактного методу::

source: The above example defines a read-only property; you can also define a read-write abstract property by appropriately marking one or more of the underlying methods as abstract::
uk: Наведений вище приклад визначає властивість лише для читання; ви також можете визначити абстрактну властивість читання-запису, відповідним чином позначивши один або більше основних методів як абстрактні:

source: If only some components are abstract, only those components need to be updated to create a concrete property in a subclass::
uk: Якщо лише деякі компоненти є абстрактними, лише ці компоненти потрібно оновити, щоб створити конкретну властивість у підкласі::

source: The :mod:`abc` module also provides the following functions:
uk: Модуль :mod:`abc` також надає такі функції:

source: Returns the current abstract base class cache token.
uk: Повертає поточний маркер кешу абстрактного базового класу.

source: The token is an opaque object (that supports equality testing) identifying the current version of the abstract base class cache for virtual subclasses. The token changes with every call to :meth:`ABCMeta.register` on any ABC.
uk: Маркер — це непрозорий об’єкт (який підтримує перевірку рівності), що ідентифікує поточну версію кешу абстрактного базового класу для віртуальних підкласів. Маркер змінюється з кожним викликом :meth:`ABCMeta.register` на будь-якому ABC.

source: A function to recalculate an abstract class's abstraction status. This function should be called if a class's abstract methods have been implemented or changed after it was created. Usually, this function should be called from within a class decorator.
uk: Функція для повторного обчислення статусу абстракції абстрактного класу. Цю функцію слід викликати, якщо абстрактні методи класу були реалізовані або змінені після його створення. Зазвичай цю функцію слід викликати з декоратора класу.

source: Returns *cls*, to allow usage as a class decorator.
uk: Повертає *cls*, щоб дозволити використання як декоратора класу.

source: If *cls* is not an instance of :class:`ABCMeta`, does nothing.
uk: Якщо *cls* не є екземпляром :class:`ABCMeta`, нічого не робить.

source: This function assumes that *cls*'s superclasses are already updated. It does not update any subclasses.
uk: Ця функція передбачає, що суперкласи *cls* вже оновлені. Він не оновлює жодних підкласів.

source: Footnotes
uk: Виноски

source: C++ programmers should note that Python's virtual base class concept is not the same as C++'s.
uk: Програмісти на C++ повинні мати на увазі, що концепція віртуального базового класу Python не збігається з концепцією C++.
