Repository: python/python-docs-uk
Catalog: library/aifc.po
Languages: uk

source: :mod:`aifc` --- Read and write AIFF and AIFC files
uk: :mod:`aifc` --- Читання та запис файлів AIFF та AIFC

source: **Source code:** :source:`Lib/aifc.py`
uk: **Вихідний код:** :source:`Lib/aifc.py`

source: The :mod:`aifc` module is deprecated (see :pep:`PEP 594 <594#aifc>` for details).
uk: Модуль :mod:`aifc` є застарілим (див. :pep:`PEP 594 <594#aifc>` для деталей).

source: This module provides support for reading and writing AIFF and AIFF-C files. AIFF is Audio Interchange File Format, a format for storing digital audio samples in a file. AIFF-C is a newer version of the format that includes the ability to compress the audio data.
uk: Цей модуль підтримує читання та запис файлів AIFF і AIFF-C. AIFF — це формат файлів обміну аудіо, формат для зберігання зразків цифрового аудіо у файлі. AIFF-C — це нова версія формату, яка включає можливість стискати аудіодані.

source: Audio files have a number of parameters that describe the audio data. The sampling rate or frame rate is the number of times per second the sound is sampled. The number of channels indicate if the audio is mono, stereo, or quadro. Each frame consists of one sample per channel. The sample size is the size in bytes of each sample. Thus a frame consists of ``nchannels * samplesize`` bytes, and a second's worth of audio consists of ``nchannels * samplesize * framerate`` bytes.
uk: Аудіофайли мають ряд параметрів, які описують аудіодані. Частота дискретизації або частота кадрів – це кількість разів на секунду, коли звук дискретизується. Кількість каналів вказує, чи є звук моно, стерео чи квадро. Кожен кадр складається з однієї вибірки на канал. Розмір вибірки — це розмір кожної вибірки в байтах. Таким чином, кадр складається з байтів ``nchannels * samplesize``, а аудіо в секунду складається з ``nchannels * samplesize * framerate`` байтів.

source: For example, CD quality audio has a sample size of two bytes (16 bits), uses two channels (stereo) and has a frame rate of 44,100 frames/second. This gives a frame size of 4 bytes (2\*2), and a second's worth occupies 2\*2\*44100 bytes (176,400 bytes).
uk: Наприклад, аудіо якості CD має розмір вибірки два байти (16 біт), використовує два канали (стерео) і має частоту кадрів 44 100 кадрів/секунду. Це дає розмір кадру 4 байти (2\*2), а вартість секунди займає 2\*2\*44100 байт (176 400 байт).

source: Module :mod:`aifc` defines the following function:
uk: Модуль :mod:`aifc` визначає таку функцію:

source: Open an AIFF or AIFF-C file and return an object instance with methods that are described below. The argument *file* is either a string naming a file or a :term:`file object`. *mode* must be ``'r'`` or ``'rb'`` when the file must be opened for reading, or ``'w'`` or ``'wb'`` when the file must be opened for writing. If omitted, ``file.mode`` is used if it exists, otherwise ``'rb'`` is used. When used for writing, the file object should be seekable, unless you know ahead of time how many samples you are going to write in total and use :meth:`writeframesraw` and :meth:`setnframes`. The :func:`.open` function may be used in a :keyword:`with` statement. When the :keyword:`!with` block completes, the :meth:`~aifc.close` method is called.
uk: Відкрийте файл AIFF або AIFF-C і поверніть екземпляр об’єкта за допомогою методів, описаних нижче. Аргумент *file* є або рядком з іменем файлу, або :term:`file object`. *mode* має бути ``'r'`` або ``'rb'``, коли файл потрібно відкрити для читання, або ``'w'`` або ``'wb'``, коли файл має бути відкритим відкрито для запису. Якщо опущено, використовується ``file.mode``, якщо він існує, інакше ``'rb'`` використовується. Коли об’єкт файлу використовується для запису, він має бути доступним для пошуку, якщо ви не знаєте заздалегідь, скільки зразків ви збираєтеся написати загалом і використовуєте :meth:`writeframesraw` і :meth:`setnframes`. Функцію :func:`.open` можна використовувати в операторі :keyword:`with`. Коли блок :keyword:`!with` завершується, викликається метод :meth:`~aifc.close`.

source: Support for the :keyword:`with` statement was added.
uk: Додано підтримку оператора :keyword:`with`.

source: Objects returned by :func:`.open` when a file is opened for reading have the following methods:
uk: Об’єкти, які повертає :func:`.open`, коли файл відкрито для читання, мають такі методи:

source: Return the number of audio channels (1 for mono, 2 for stereo).
uk: Повертає кількість аудіоканалів (1 для моно, 2 для стерео).

source: Return the size in bytes of individual samples.
uk: Повертає розмір у байтах окремих зразків.

source: Return the sampling rate (number of audio frames per second).
uk: Повертає частоту дискретизації (кількість звукових кадрів за секунду).

source: Return the number of audio frames in the file.
uk: Повертає кількість звукових кадрів у файлі.

source: Return a bytes array of length 4 describing the type of compression used in the audio file. For AIFF files, the returned value is ``b'NONE'``.
uk: Повертає масив байтів довжиною 4, що описує тип стиснення, що використовується в аудіофайлі. Для файлів AIFF повертається значення ``b'NONE``.

source: Return a bytes array convertible to a human-readable description of the type of compression used in the audio file. For AIFF files, the returned value is ``b'not compressed'``.
uk: Повертає масив байтів, який можна перетворити на зрозумілий людині опис типу стиснення, який використовується в аудіофайлі. Для файлів AIFF повертається значення ``b'not compressed``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the :meth:`get\*` methods.
uk: Повертає :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, еквівалентний виводу методів :meth:`get\*`.

source: Return a list of markers in the audio file. A marker consists of a tuple of three elements. The first is the mark ID (an integer), the second is the mark position in frames from the beginning of the data (an integer), the third is the name of the mark (a string).
uk: Повернути список маркерів у звуковому файлі. Маркер складається з кортежу з трьох елементів. Перший — ID позначки (ціле число), другий — позиція позначки у кадрах від початку даних (ціле число), третій — назва позначки (рядок).

source: Return the tuple as described in :meth:`getmarkers` for the mark with the given *id*.
uk: Поверніть кортеж, як описано в :meth:`getmarkers` для позначки з заданим *id*.

source: Read and return the next *nframes* frames from the audio file. The returned data is a string containing for each frame the uncompressed samples of all channels.
uk: Прочитати та повернути наступні *nframes* кадри з аудіофайлу. Повернуті дані — це рядок, що містить для кожного кадру нестиснуті зразки всіх каналів.

source: Rewind the read pointer. The next :meth:`readframes` will start from the beginning.
uk: Перемотати вказівник читання назад. Наступний :meth:`readframes` почнеться спочатку.

source: Seek to the specified frame number.
uk: Перейти до вказаного номера кадру.

source: Return the current frame number.
uk: Повернути поточний номер кадру.

source: Close the AIFF file. After calling this method, the object can no longer be used.
uk: Закрийте файл AIFF. Після виклику цього методу об’єкт більше не можна використовувати.

source: Objects returned by :func:`.open` when a file is opened for writing have all the above methods, except for :meth:`readframes` and :meth:`setpos`. In addition the following methods exist. The :meth:`get\*` methods can only be called after the corresponding :meth:`set\*` methods have been called. Before the first :meth:`writeframes` or :meth:`writeframesraw`, all parameters except for the number of frames must be filled in.
uk: Об’єкти, які повертає :func:`.open`, коли файл відкривається для запису, мають усі наведені вище методи, крім :meth:`readframes` і :meth:`setpos`. Крім того, існують такі методи. Методи :meth:`get\*` можна викликати лише після виклику відповідних методів :meth:`set\*`. Перед першим :meth:`writeframes` або :meth:`writeframesraw` необхідно заповнити всі параметри, крім кількості кадрів.

source: Create an AIFF file. The default is that an AIFF-C file is created, unless the name of the file ends in ``'.aiff'`` in which case the default is an AIFF file.
uk: Створіть файл AIFF. За замовчуванням створюється файл AIFF-C, якщо ім’я файлу не закінчується на ``'.aiff'``, у цьому випадку за замовчуванням використовується файл AIFF.

source: Create an AIFF-C file. The default is that an AIFF-C file is created, unless the name of the file ends in ``'.aiff'`` in which case the default is an AIFF file.
uk: Створіть файл AIFF-C. За замовчуванням створюється файл AIFF-C, якщо ім’я файлу не закінчується на '``.aiff''``, у цьому випадку за замовчуванням використовується файл AIFF.

source: Specify the number of channels in the audio file.
uk: Вкажіть кількість каналів у звуковому файлі.

source: Specify the size in bytes of audio samples.
uk: Вкажіть розмір аудіосемплів у байтах.

source: Specify the sampling frequency in frames per second.
uk: Вкажіть частоту дискретизації в кадрах за секунду.

source: Specify the number of frames that are to be written to the audio file. If this parameter is not set, or not set correctly, the file needs to support seeking.
uk: Вкажіть кількість кадрів, які потрібно записати в аудіофайл. Якщо цей параметр не встановлено або встановлено неправильно, файл має підтримувати пошук.

source: Specify the compression type. If not specified, the audio data will not be compressed. In AIFF files, compression is not possible. The name parameter should be a human-readable description of the compression type as a bytes array, the type parameter should be a bytes array of length 4. Currently the following compression types are supported: ``b'NONE'``, ``b'ULAW'``, ``b'ALAW'``, ``b'G722'``.
uk: Вкажіть тип стиснення. Якщо не вказано, аудіодані не будуть стиснуті. У файлах AIFF стиснення неможливе. Параметр імені має бути зрозумілим для людини описом типу стиснення у вигляді масиву байтів, параметр типу має бути масивом байтів довжиною 4. Наразі підтримуються такі типи стиснення: ``b'NONE'``, ``b'ULAW'``, ``b'ALAW''``, ``b'G722''``.

source: Set all the above parameters at once. The argument is a tuple consisting of the various parameters. This means that it is possible to use the result of a :meth:`getparams` call as argument to :meth:`setparams`.
uk: Встановіть всі перераховані вище параметри відразу. Аргумент - це кортеж, що складається з різних параметрів. Це означає, що можна використовувати результат виклику :meth:`getparams` як аргумент для :meth:`setparams`.

source: Add a mark with the given id (larger than 0), and the given name at the given position. This method can be called at any time before :meth:`close`.
uk: Додайте позначку з заданим ідентифікатором (більшим за 0) і заданим ім’ям у вказаній позиції. Цей метод можна викликати будь-коли до :meth:`close`.

source: Return the current write position in the output file. Useful in combination with :meth:`setmark`.
uk: Повертає поточну позицію запису у вихідний файл. Корисно в поєднанні з :meth:`setmark`.

source: Write data to the output file. This method can only be called after the audio file parameters have been set.
uk: Записати дані у вихідний файл. Цей метод можна викликати лише після встановлення параметрів аудіофайлу.

source: Any :term:`bytes-like object` is now accepted.
uk: Тепер приймається будь-який :term:`bytes-like object`.

source: Like :meth:`writeframes`, except that the header of the audio file is not updated.
uk: Як :meth:`writeframes`, за винятком того, що заголовок аудіофайлу не оновлюється.

source: Close the AIFF file. The header of the file is updated to reflect the actual size of the audio data. After calling this method, the object can no longer be used.
uk: Закрийте файл AIFF. Заголовок файлу оновлюється відповідно до фактичного розміру аудіоданих. Після виклику цього методу об’єкт більше не можна використовувати.
