Repository: python/python-docs-uk
Catalog: library/array.po
Languages: uk

source: :mod:`array` --- Efficient arrays of numeric values
uk: :mod:`array` --- Ефективні масиви числових значень

source: This module defines an object type which can compactly represent an array of basic values: characters, integers, floating point numbers. Arrays are sequence types and behave very much like lists, except that the type of objects stored in them is constrained. The type is specified at object creation time by using a :dfn:`type code`, which is a single character. The following type codes are defined:
uk: Цей модуль визначає тип об’єкта, який може компактно представляти масив основних значень: символів, цілих чисел, чисел з плаваючою комою. Масиви є типами послідовностей і поводяться дуже подібно до списків, за винятком того, що тип об’єктів, які в них зберігаються, обмежений. Тип вказується під час створення об’єкта за допомогою :dfn:`type code`, який є одним символом. Визначаються такі коди типів:

source: Type code
uk: Введіть код

source: C Type
uk: C Тип

source: Python Type
uk: Тип Python

source: Minimum size in bytes
uk: Мінімальний розмір у байтах

source: Notes
uk: Примітки

source: signed char
uk: підписаний символ

source: int
uk: внутр

source: unsigned char
uk: беззнаковий символ

source: Unicode character
uk: символ Unicode

source: signed short
uk: підписаний короткий

source: unsigned short
uk: непідписаний короткий

source: ``'i'``
uk: ``'я''``

source: signed int
uk: підписаний внутр

source: ``'I'``
uk: ``'Я''``

source: signed long
uk: підписаний довго

source: unsigned long
uk: беззнаковий довгий

source: signed long long
uk: підписаний довгий довгий

source: unsigned long long
uk: без знака довгий довгий

source: float
uk: плавати

source: double
uk: подвійний

source: Notes:
uk: Примітки:

source: It can be 16 bits or 32 bits depending on the platform.
uk: Це може бути 16 або 32 біти залежно від платформи.

source: ``array('u')`` now uses ``wchar_t`` as C type instead of deprecated ``Py_UNICODE``. This change doesn't affect its behavior because ``Py_UNICODE`` is alias of ``wchar_t`` since Python 3.3.
uk: ``array('u')`` тепер використовує ``wchar_t`` як тип C замість застарілого ``Py_UNICODE``. Ця зміна не впливає на його поведінку, оскільки ``Py_UNICODE`` є псевдонімом ``wchar_t``, починаючи з Python 3.3.

source: The actual representation of values is determined by the machine architecture (strictly speaking, by the C implementation). The actual size can be accessed through the :attr:`itemsize` attribute.
uk: Фактичне представлення значень визначається архітектурою машини (строго кажучи, реалізацією C). Фактичний розмір можна отримати через атрибут :attr:`itemsize`.

source: The module defines the following type:
uk: Модуль визначає наступний тип:

source: A new array whose items are restricted by *typecode*, and initialized from the optional *initializer* value, which must be a list, a :term:`bytes-like object`, or iterable over elements of the appropriate type.
uk: Новий масив, елементи якого обмежені *typecode* та ініціалізуються необов’язковим значенням *ініціалізатора*, яке має бути списком, :term:`bytes-like object` або повторюваним над елементами відповідного типу.

source: If given a list or string, the initializer is passed to the new array's :meth:`fromlist`, :meth:`frombytes`, or :meth:`fromunicode` method (see below) to add initial items to the array. Otherwise, the iterable initializer is passed to the :meth:`extend` method.
uk: Якщо задано список або рядок, ініціалізатор передається в новий метод :meth:`fromlist`, :meth:`frombytes` або :meth:`fromunicode` нового масиву (див. нижче), щоб додати початкові елементи до масиву. В іншому випадку ітераційний ініціалізатор передається в метод :meth:`extend`.

source: Raises an :ref:`auditing event <auditing>` ``array.__new__`` with arguments ``typecode``, ``initializer``.
uk: Викликає :ref:`подію аудиту <auditing>` ``array.__new__`` з аргументами ``typecode``, ``initializer``.

source: A string with all available type codes.
uk: Рядок із усіма доступними кодами типів.

source: Array objects support the ordinary sequence operations of indexing, slicing, concatenation, and multiplication. When using slice assignment, the assigned value must be an array object with the same type code; in all other cases, :exc:`TypeError` is raised. Array objects also implement the buffer interface, and may be used wherever :term:`bytes-like objects <bytes-like object>` are supported.
uk: Об’єкти-масиви підтримують звичайні операції послідовності індексування, нарізки, конкатенації та множення. Якщо використовується призначення фрагментів, призначене значення має бути об’єктом масиву з таким же кодом типу; у всіх інших випадках виникає :exc:`TypeError`. Об’єкти-масиви також реалізують інтерфейс буфера, і їх можна використовувати скрізь, де підтримуються :term:`байтоподібні об’єкти <bytes-like object>`.

source: The following data items and methods are also supported:
uk: Також підтримуються такі елементи даних і методи:

source: The typecode character used to create the array.
uk: Символ коду типу, який використовується для створення масиву.

source: The length in bytes of one array item in the internal representation.
uk: Довжина в байтах одного елемента масиву у внутрішньому представленні.

source: Append a new item with value *x* to the end of the array.
uk: Додайте новий елемент зі значенням *x* у кінець масиву.

source: Return a tuple ``(address, length)`` giving the current memory address and the length in elements of the buffer used to hold array's contents. The size of the memory buffer in bytes can be computed as ``array.buffer_info()[1] * array.itemsize``. This is occasionally useful when working with low-level (and inherently unsafe) I/O interfaces that require memory addresses, such as certain :c:func:`ioctl` operations. The returned numbers are valid as long as the array exists and no length-changing operations are applied to it.
uk: Повертає кортеж ``(адреса, довжина)``, що вказує поточну адресу пам’яті та довжину в елементах буфера, який використовується для зберігання вмісту масиву. Розмір буфера пам'яті в байтах можна обчислити як ``array.buffer_info()[1] * array.itemsize``. Іноді це корисно під час роботи з низькорівневими (і за своєю суттю небезпечними) інтерфейсами вводу/виводу, які вимагають адреси пам’яті, наприклад певні операції :c:func:`ioctl`. Повернені числа дійсні, доки існує масив і до нього не застосовуються операції зміни довжини.

source: When using array objects from code written in C or C++ (the only way to effectively make use of this information), it makes more sense to use the buffer interface supported by array objects. This method is maintained for backward compatibility and should be avoided in new code. The buffer interface is documented in :ref:`bufferobjects`.
uk: При використанні об’єктів масиву з коду, написаного на C або C++ (єдиний спосіб ефективного використання цієї інформації), має сенс використовувати інтерфейс буфера, який підтримується об’єктами масиву. Цей метод підтримується для зворотної сумісності, і його слід уникати в новому коді. Інтерфейс буфера задокументовано в :ref:`bufferobjects`.

source: "Byteswap" all items of the array. This is only supported for values which are 1, 2, 4, or 8 bytes in size; for other types of values, :exc:`RuntimeError` is raised. It is useful when reading data from a file written on a machine with a different byte order.
uk: "Побайтувати" всі елементи масиву. Це підтримується лише для значень розміром 1, 2, 4 або 8 байтів; для інших типів значень виникає :exc:`RuntimeError`. Це корисно під час читання даних із файлу, записаного на машині з іншим порядком байтів.

source: Return the number of occurrences of *x* in the array.
uk: Повертає кількість входжень *x* в масиві.

source: Append items from *iterable* to the end of the array. If *iterable* is another array, it must have *exactly* the same type code; if not, :exc:`TypeError` will be raised. If *iterable* is not an array, it must be iterable and its elements must be the right type to be appended to the array.
uk: Додайте елементи з *iterable* у кінець масиву. Якщо *iterable* є іншим масивом, він повинен мати *точно* той самий код типу; якщо ні, буде викликано :exc:`TypeError`. Якщо *iterable* не є масивом, він має бути повторюваним, а його елементи мають мати правильний тип для додавання до масиву.

source: Appends items from the string, interpreting the string as an array of machine values (as if it had been read from a file using the :meth:`fromfile` method).
uk: Додає елементи з рядка, інтерпретуючи рядок як масив машинних значень (наче його було прочитано з файлу за допомогою методу :meth:`fromfile`).

source: :meth:`fromstring` is renamed to :meth:`frombytes` for clarity.
uk: :meth:`fromstring` перейменовано на :meth:`frombytes` для ясності.

source: Read *n* items (as machine values) from the :term:`file object` *f* and append them to the end of the array. If less than *n* items are available, :exc:`EOFError` is raised, but the items that were available are still inserted into the array.
uk: Прочитайте *n* елементів (як машинні значення) з :term:`file object` *f* і додайте їх у кінець масиву. Якщо доступно менше *n* елементів, виникає :exc:`EOFError`, але доступні елементи все одно вставляються в масив.

source: Append items from the list. This is equivalent to ``for x in list: a.append(x)`` except that if there is a type error, the array is unchanged.
uk: Додавання елементів зі списку. Це еквівалентно ``для x у списку: a.append(x)`` за винятком того, що якщо є помилка типу, масив не змінюється.

source: Extends this array with data from the given unicode string. The array must be a type ``'u'`` array; otherwise a :exc:`ValueError` is raised. Use ``array.frombytes(unicodestring.encode(enc))`` to append Unicode data to an array of some other type.
uk: Розширює цей масив даними з заданого рядка Юнікод. Масив має бути масиву типу ``'u''``; інакше виникає помилка :exc:`ValueError`. Використовуйте ``array.frombytes(unicodestring.encode(enc))``, щоб додати дані Unicode до масиву іншого типу.

source: Return the smallest *i* such that *i* is the index of the first occurrence of *x* in the array. The optional arguments *start* and *stop* can be specified to search for *x* within a subsection of the array. Raise :exc:`ValueError` if *x* is not found.
uk: Повертає найменше *i* таке, що *i* є індексом першого входження *x* в масиві. Для пошуку *x* у підрозділі масиву можна вказати необов’язкові аргументи *start* і *stop*. Викликати :exc:`ValueError`, якщо *x* не знайдено.

source: Added optional *start* and *stop* parameters.
uk: Додано додаткові параметри *start* і *stop*.

source: Insert a new item with value *x* in the array before position *i*. Negative values are treated as being relative to the end of the array.
uk: Вставте новий елемент зі значенням *x* в масив перед позицією *i*. Від’ємні значення розглядаються як відносні до кінця масиву.

source: Removes the item with the index *i* from the array and returns it. The optional argument defaults to ``-1``, so that by default the last item is removed and returned.
uk: Вилучає з масиву елемент з індексом *i* і повертає його. Необов’язковий аргумент за умовчанням має значення ``-1``, тому за замовчуванням останній елемент видаляється та повертається.

source: Remove the first occurrence of *x* from the array.
uk: Видаліть перше входження *x* з масиву.

source: Reverse the order of the items in the array.
uk: Змінити порядок елементів у масиві.

source: Convert the array to an array of machine values and return the bytes representation (the same sequence of bytes that would be written to a file by the :meth:`tofile` method.)
uk: Перетворіть масив на масив машинних значень і поверніть представлення байтів (та сама послідовність байтів, яка була б записана у файл за допомогою методу :meth:`tofile`).

source: :meth:`tostring` is renamed to :meth:`tobytes` for clarity.
uk: :meth:`tostring` перейменовано на :meth:`tobytes` для ясності.

source: Write all items (as machine values) to the :term:`file object` *f*.
uk: Запишіть усі елементи (як машинні значення) в :term:`file object` *f*.

source: Convert the array to an ordinary list with the same items.
uk: Перетворіть масив на звичайний список з тими самими елементами.

source: Convert the array to a unicode string. The array must be a type ``'u'`` array; otherwise a :exc:`ValueError` is raised. Use ``array.tobytes().decode(enc)`` to obtain a unicode string from an array of some other type.
uk: Перетворіть масив на рядок Unicode. Масив має бути масиву типу ``'u''``; інакше виникає помилка :exc:`ValueError`. Використовуйте ``array.tobytes().decode(enc)``, щоб отримати рядок Юнікод із масиву іншого типу.

source: When an array object is printed or converted to a string, it is represented as ``array(typecode, initializer)``. The *initializer* is omitted if the array is empty, otherwise it is a string if the *typecode* is ``'u'``, otherwise it is a list of numbers. The string is guaranteed to be able to be converted back to an array with the same type and value using :func:`eval`, so long as the :class:`~array.array` class has been imported using ``from array import array``. Examples::
uk: Коли об’єкт масиву друкується або перетворюється на рядок, він представляється як ``array(typecode, initializer)``. *Ініціалізатор* пропускається, якщо масив порожній, інакше це рядок, якщо *код типу* є ``'u'``, інакше це список чисел. Гарантовано, що рядок можна буде перетворити назад на масив із тим самим типом і значенням за допомогою :func:`eval`, якщо клас :class:`~array.array` було імпортовано за допомогою ``from array import array``. Приклади::

source: Module :mod:`struct`
uk: Модуль :mod:`struct`

source: Packing and unpacking of heterogeneous binary data.
uk: Упаковка та розпакування різнорідних двійкових даних.

source: Module :mod:`xdrlib`
uk: Модуль :mod:`xdrlib`

source: Packing and unpacking of External Data Representation (XDR) data as used in some remote procedure call systems.
uk: Пакування та розпакування даних зовнішнього представлення даних (XDR), які використовуються в деяких системах віддаленого виклику процедур.

source: The NumPy package defines another array type.
uk: Пакет NumPy визначає інший тип масиву.
