Repository: python/python-docs-uk
Catalog: library/asyncio-api-index.po
Languages: uk

source: High-level API Index
uk: Індекс API високого рівня

source: This page lists all high-level async/await enabled asyncio APIs.
uk: На цій сторінці перераховано всі асинхронні API високого рівня з підтримкою функції очікування.

source: Tasks
uk: завдання

source: Utilities to run asyncio programs, create Tasks, and await on multiple things with timeouts.
uk: Утиліти для запуску асинхронних програм, створення завдань і очікування кількох речей із тайм-аутом.

source: Create event loop, run a coroutine, close the loop.
uk: Створіть цикл подій, запустіть співпрограму, закрийте цикл.

source: Task object.
uk: Об'єкт завдання.

source: :func:`current_task`
uk: :func:`поточне_завдання`

source: Return the current Task.
uk: Повернути поточне завдання.

source: :func:`all_tasks`
uk: :func:`усі_завдання`

source: ``await`` :func:`sleep`
uk: ``чекати`` :func:`sleep`

source: Sleep for a number of seconds.
uk: Поспати кілька секунд.

source: ``await`` :func:`gather`
uk: ``чекати`` :func:`gather`

source: Schedule and wait for things concurrently.
uk: Плануйте та чекайте подій одночасно.

source: ``await`` :func:`wait_for`
uk: ``очікувати`` :func:`wait_for`

source: Run with a timeout.
uk: Запустити з тайм-аутом.

source: ``await`` :func:`shield`
uk: ``чекати`` :func:`shield`

source: Shield from cancellation.
uk: Щит від скасування.

source: ``await`` :func:`wait`
uk: ``чекати`` :func:`wait`

source: Monitor for completion.
uk: Монітор для завершення.

source: :func:`to_thread`
uk: :func:`до_потоку`

source: Asynchronously run a function in a separate OS thread.
uk: Асинхронний запуск функції в окремому потоці ОС.

source: Schedule a coroutine from another OS thread.
uk: Заплануйте співпрограму з іншого потоку ОС.

source: Monitor for completion with a ``for`` loop.
uk: Контроль завершення за допомогою циклу ``for``.

source: Examples
uk: Приклади

source: :ref:`Using asyncio.gather() to run things in parallel <asyncio_example_gather>`.
uk: :ref:`Використання asyncio.gather() для паралельного запуску <asyncio_example_gather>`.

source: :ref:`Using asyncio.wait_for() to enforce a timeout <asyncio_example_waitfor>`.
uk: :ref:`Використання asyncio.wait_for() для застосування тайм-ауту <asyncio_example_waitfor>`.

source: :ref:`Cancellation <asyncio_example_task_cancel>`.
uk: :ref:`Скасування <asyncio_example_task_cancel>`.

source: :ref:`Using asyncio.sleep() <asyncio_example_sleep>`.
uk: :ref:`Використання asyncio.sleep() <asyncio_example_sleep>`.

source: See also the main :ref:`Tasks documentation page <coroutine>`.
uk: Дивіться також головну :ref:`сторінку документації завдань <coroutine>`.

source: Queues
uk: Черги

source: Queues should be used to distribute work amongst multiple asyncio Tasks, implement connection pools, and pub/sub patterns.
uk: Черги слід використовувати для розподілу роботи між декількома асинхронними завданнями, впровадження пулів підключень і шаблонів pub/sub.

source: A FIFO queue.
uk: Черга FIFO.

source: A priority queue.
uk: Пріоритетна черга.

source: A LIFO queue.
uk: Черга LIFO.

source: :ref:`Using asyncio.Queue to distribute workload between several Tasks <asyncio_example_queue_dist>`.
uk: :ref:`Використання asyncio.Queue для розподілу робочого навантаження між кількома завданнями <asyncio_example_queue_dist>`.

source: See also the :ref:`Queues documentation page <asyncio-queues>`.
uk: Дивіться також :ref:`сторінку документації про черги <asyncio-queues>`.

source: Subprocesses
uk: Підпроцеси

source: Utilities to spawn subprocesses and run shell commands.
uk: Утиліти для створення підпроцесів і виконання команд оболонки.

source: ``await`` :func:`create_subprocess_exec`
uk: ``чекати`` :func:`create_subprocess_exec`

source: Create a subprocess.
uk: Створіть підпроцес.

source: ``await`` :func:`create_subprocess_shell`
uk: ``чекати`` :func:`create_subprocess_shell`

source: Run a shell command.
uk: Виконайте команду оболонки.

source: :ref:`Executing a shell command <asyncio_example_subprocess_shell>`.
uk: :ref:`Виконання команди оболонки <asyncio_example_subprocess_shell>`.

source: See also the :ref:`subprocess APIs <asyncio-subprocess>` documentation.
uk: Дивіться також документацію :ref:`API підпроцесів <asyncio-subprocess>`.

source: Streams
uk: Потоки

source: High-level APIs to work with network IO.
uk: API високого рівня для роботи з мережевим вводом-виводом.

source: ``await`` :func:`open_connection`
uk: ``чекати`` :func:`open_connection`

source: Establish a TCP connection.
uk: Встановіть з'єднання TCP.

source: ``await`` :func:`open_unix_connection`
uk: ``чекати`` :func:`open_unix_connection`

source: Establish a Unix socket connection.
uk: Встановіть підключення через сокет Unix.

source: ``await`` :func:`start_server`
uk: ``чекати`` :func:`start_server`

source: Start a TCP server.
uk: Запустіть сервер TCP.

source: ``await`` :func:`start_unix_server`
uk: ``чекати`` :func:`start_unix_server`

source: Start a Unix socket server.
uk: Запустіть сокет-сервер Unix.

source: High-level async/await object to receive network data.
uk: Високорівневий об’єкт async/wait для отримання мережевих даних.

source: High-level async/await object to send network data.
uk: Високорівневий об’єкт async/await для надсилання мережевих даних.

source: :ref:`Example TCP client <asyncio_example_stream>`.
uk: :ref:`Приклад TCP-клієнта <asyncio_example_stream>`.

source: See also the :ref:`streams APIs <asyncio-streams>` documentation.
uk: Дивіться також документацію :ref:`streams APIs <asyncio-streams>`.

source: Synchronization
uk: Синхронізація

source: Threading-like synchronization primitives that can be used in Tasks.
uk: Примітиви потокової синхронізації, які можна використовувати в Завданнях.

source: A mutex lock.
uk: Блокування м'ютексу.

source: An event object.
uk: Об'єкт події.

source: A condition object.
uk: Об'єкт умови.

source: A semaphore.
uk: Семафор.

source: A bounded semaphore.
uk: Обмежений семафор.

source: :ref:`Using asyncio.Event <asyncio_example_sync_event>`.
uk: :ref:`Використання asyncio.Event <asyncio_example_sync_event>`.

source: See also the documentation of asyncio :ref:`synchronization primitives <asyncio-sync>`.
uk: Дивіться також документацію asyncio :ref:`примітивів синхронізації <asyncio-sync>`.

source: Exceptions
uk: Винятки

source: Raised when a Task is cancelled. See also :meth:`Task.cancel`.
uk: Піднімається, коли завдання скасовано. Дивіться також :meth:`Task.cancel`.

source: :ref:`Handling CancelledError to run code on cancellation request <asyncio_example_task_cancel>`.
uk: :ref:`Обробка CancelledError для запуску коду запиту на скасування <asyncio_example_task_cancel>`.

source: See also the full list of :ref:`asyncio-specific exceptions <asyncio-exceptions>`.
uk: Дивіться також повний список :ref:`специфічних винятків asyncio <asyncio-exceptions>`.
