Repository: python/python-docs-uk
Catalog: library/asyncio-queue.po
Languages: uk

source: Queues
uk: Черги

source: **Source code:** :source:`Lib/asyncio/queues.py`
uk: **Вихідний код:** :source:`Lib/asyncio/queues.py`

source: asyncio queues are designed to be similar to classes of the :mod:`queue` module. Although asyncio queues are not thread-safe, they are designed to be used specifically in async/await code.
uk: асинхронні черги розроблені таким чином, щоб бути подібними до класів модуля :mod:`queue`. Хоча асинхронні черги не є потокобезпечними, вони розроблені спеціально для використання в асинхронному коді/коді очікування.

source: Note that methods of asyncio queues don't have a *timeout* parameter; use :func:`asyncio.wait_for` function to do queue operations with a timeout.
uk: Зауважте, що методи асинхронних черг не мають параметра *timeout*; використовуйте функцію :func:`asyncio.wait_for`, щоб виконувати операції в черзі з тайм-аутом.

source: See also the `Examples`_ section below.
uk: Дивіться також розділ `Examples`_ нижче.

source: Queue
uk: Чергу

source: A first in, first out (FIFO) queue.
uk: Черга першим прийшов, першим вийшов (FIFO).

source: If *maxsize* is less than or equal to zero, the queue size is infinite. If it is an integer greater than ``0``, then ``await put()`` blocks when the queue reaches *maxsize* until an item is removed by :meth:`get`.
uk: Якщо *maxsize* менше або дорівнює нулю, розмір черги є нескінченним. Якщо це ціле число, більше за ``0``, тоді ``await put()`` блокує, коли черга досягає *maxsize*, доки елемент не буде видалено :meth:`get`.

source: Unlike the standard library threading :mod:`queue`, the size of the queue is always known and can be returned by calling the :meth:`qsize` method.
uk: На відміну від стандартної потокової обробки бібліотеки :mod:`queue`, розмір черги завжди відомий і може бути повернутий викликом методу :meth:`qsize`.

source: Removed the *loop* parameter.
uk: Видалено параметр *loop*.

source: This class is :ref:`not thread safe <asyncio-multithreading>`.
uk: Цей клас :ref:`не потоково безпечний <asyncio-multithreading>`.

source: Number of items allowed in the queue.
uk: Кількість елементів, дозволених у черзі.

source: Return ``True`` if the queue is empty, ``False`` otherwise.
uk: Повертає ``True``, якщо черга порожня, ``False`` інакше.

source: Return ``True`` if there are :attr:`maxsize` items in the queue.
uk: Повертає ``True``, якщо в черзі є елементи :attr:`maxsize`.

source: Remove and return an item from the queue. If queue is empty, wait until an item is available.
uk: Видалити та повернути елемент із черги. Якщо черга порожня, зачекайте, поки елемент стане доступним.

source: Return an item if one is immediately available, else raise :exc:`QueueEmpty`.
uk: Повернути елемент, якщо він одразу доступний, інакше підняти :exc:`QueueEmpty`.

source: Block until all items in the queue have been received and processed.
uk: Блокуйте, доки всі елементи в черзі не будуть отримані та оброблені.

source: The count of unfinished tasks goes up whenever an item is added to the queue. The count goes down whenever a consumer coroutine calls :meth:`task_done` to indicate that the item was retrieved and all work on it is complete. When the count of unfinished tasks drops to zero, :meth:`join` unblocks.
uk: Кількість незавершених завдань зростає щоразу, коли елемент додається до черги. Підрахунок зменшується щоразу, коли співпрограма споживача викликає :meth:`task_done`, щоб вказати, що елемент було отримано та вся робота над ним завершена. Коли кількість незавершених завдань падає до нуля, :meth:`join` розблоковується.

source: Put an item into the queue. If the queue is full, wait until a free slot is available before adding the item.
uk: Помістіть товар у чергу. Якщо черга заповнена, зачекайте, поки з’явиться вільне місце, перш ніж додавати елемент.

source: Put an item into the queue without blocking.
uk: Поставте елемент у чергу без блокування.

source: If no free slot is immediately available, raise :exc:`QueueFull`.
uk: Якщо вільного місця немає, підніміть :exc:`QueueFull`.

source: Return the number of items in the queue.
uk: Повернути кількість елементів у черзі.

source: Indicate that a formerly enqueued task is complete.
uk: Вказує на те, що завдання, яке раніше було в черзі, виконано.

source: Used by queue consumers. For each :meth:`~Queue.get` used to fetch a task, a subsequent call to :meth:`task_done` tells the queue that the processing on the task is complete.
uk: Використовується споживачами черги. Для кожного :meth:`~Queue.get`, який використовується для отримання завдання, наступний виклик :meth:`task_done` повідомляє черзі, що обробку завдання завершено.

source: If a :meth:`join` is currently blocking, it will resume when all items have been processed (meaning that a :meth:`task_done` call was received for every item that had been :meth:`~Queue.put` into the queue).
uk: Якщо :meth:`join` зараз блокує, воно відновиться, коли всі елементи буде оброблено (це означає, що виклик :meth:`task_done` отримано для кожного елемента, який був :meth:`~Queue.put` в черга).

source: Raises :exc:`ValueError` if called more times than there were items placed in the queue.
uk: Викликає :exc:`ValueError`, якщо викликається стільки разів, скільки було елементів, розміщених у черзі.

source: Priority Queue
uk: Пріоритетна черга

source: A variant of :class:`Queue`; retrieves entries in priority order (lowest first).
uk: Варіант :class:`Queue`; отримує записи в порядку пріоритету (найнижчий спочатку).

source: Entries are typically tuples of the form ``(priority_number, data)``.
uk: Записи зазвичай є кортежами у формі ``(число_пріоритету, дані)``.

source: LIFO Queue
uk: Черга LIFO

source: A variant of :class:`Queue` that retrieves most recently added entries first (last in, first out).
uk: Варіант :class:`Queue`, який першими отримує нещодавно додані записи (останнім увійшов, першим вийшов).

source: Exceptions
uk: Винятки

source: This exception is raised when the :meth:`~Queue.get_nowait` method is called on an empty queue.
uk: Цей виняток виникає, коли метод :meth:`~Queue.get_nowait` викликається в порожній черзі.

source: Exception raised when the :meth:`~Queue.put_nowait` method is called on a queue that has reached its *maxsize*.
uk: Виняток виникає, коли метод :meth:`~Queue.put_nowait` викликається в черзі, яка досягла *максимального розміру*.

source: Examples
uk: Приклади

source: Queues can be used to distribute workload between several concurrent tasks::
uk: Черги можна використовувати для розподілу робочого навантаження між кількома одночасними завданнями:
