Repository: python/python-docs-uk
Catalog: library/asyncio-exceptions.po
Languages: uk

source: Exceptions
uk: Винятки

source: **Source code:** :source:`Lib/asyncio/exceptions.py`
uk: **Вихідний код:** :source:`Lib/asyncio/exceptions.py`

source: This class was made an alias of :exc:`TimeoutError`.
uk: Цей клас отримав псевдонім :exc:`TimeoutError`.

source: The operation has been cancelled.
uk: Операцію скасовано.

source: This exception can be caught to perform custom operations when asyncio Tasks are cancelled. In almost all situations the exception must be re-raised.
uk: Цей виняток можна перехопити для виконання спеціальних операцій, коли асинхронні завдання скасовуються. Майже в усіх ситуаціях виняток потрібно підняти повторно.

source: Invalid internal state of :class:`Task` or :class:`Future`.
uk: Недійсний внутрішній стан :class:`Task` або :class:`Future`.

source: Can be raised in situations like setting a result value for a *Future* object that already has a result value set.
uk: Може бути викликано в таких ситуаціях, як встановлення значення результату для об’єкта *Future*, для якого вже встановлено значення результату.

source: The "sendfile" syscall is not available for the given socket or file type.
uk: Системний виклик "sendfile" недоступний для даного сокета або типу файлу.

source: A subclass of :exc:`RuntimeError`.
uk: Підклас :exc:`RuntimeError`.

source: The requested read operation did not complete fully.
uk: Запитана операція читання не завершена повністю.

source: Raised by the :ref:`asyncio stream APIs<asyncio-streams>`.
uk: Створено :ref:`asyncio stream API <asyncio-streams>`.

source: This exception is a subclass of :exc:`EOFError`.
uk: Цей виняток є підкласом :exc:`EOFError`.

source: The total number (:class:`int`) of expected bytes.
uk: Загальна кількість (:class:`int`) очікуваних байтів.

source: A string of :class:`bytes` read before the end of stream was reached.
uk: Рядок із :class:`bytes` прочитано до кінця потоку.

source: Reached the buffer size limit while looking for a separator.
uk: Досягнуто обмеження розміру буфера під час пошуку роздільника.

source: Raised by the :ref:`asyncio stream APIs <asyncio-streams>`.
uk: Створено :ref:`asyncio stream API <asyncio-streams>`.

source: The total number of to be consumed bytes.
uk: Загальна кількість спожитих байтів.
