Repository: python/python-docs-uk
Catalog: library/asyncio-policy.po
Languages: uk

source: Policies
uk: політики

source: An event loop policy is a global per-process object that controls the management of the event loop. Each event loop has a default policy, which can be changed and customized using the policy API.
uk: Політика циклу подій — це глобальний об’єкт для кожного процесу, який контролює керування циклом подій. Кожен цикл подій має стандартну політику, яку можна змінити та налаштувати за допомогою API політики.

source: A policy defines the notion of *context* and manages a separate event loop per context. The default policy defines *context* to be the current thread.
uk: Політика визначає поняття *контексту* та керує окремим циклом подій для кожного контексту. Політика за умовчанням визначає *контекст* як поточний потік.

source: By using a custom event loop policy, the behavior of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop` functions can be customized.
uk: За допомогою спеціальної політики циклу подій можна налаштувати поведінку функцій :func:`get_event_loop`, :func:`set_event_loop` і :func:`new_event_loop`.

source: Policy objects should implement the APIs defined in the :class:`AbstractEventLoopPolicy` abstract base class.
uk: Об’єкти політики мають реалізовувати API, визначені в :class:`AbstractEventLoopPolicy` абстрактному базовому класі.

source: Getting and Setting the Policy
uk: Отримання та налаштування політики

source: The following functions can be used to get and set the policy for the current process:
uk: Наступні функції можна використовувати для отримання та налаштування політики для поточного процесу:

source: Return the current process-wide policy.
uk: Повернути поточну політику для всього процесу.

source: Set the current process-wide policy to *policy*.
uk: Установіть поточну політику для всього процесу на *policy*.

source: If *policy* is set to ``None``, the default policy is restored.
uk: Якщо *policy* встановлено на ``None``, політика за замовчуванням буде відновлена.

source: Policy Objects
uk: Об'єкти політики

source: The abstract event loop policy base class is defined as follows:
uk: Базовий клас політики абстрактного циклу подій визначається наступним чином:

source: An abstract base class for asyncio policies.
uk: Абстрактний базовий клас для асинхронних політик.

source: Get the event loop for the current context.
uk: Отримати цикл подій для поточного контексту.

source: Return an event loop object implementing the :class:`AbstractEventLoop` interface.
uk: Повертає об’єкт циклу подій, що реалізує інтерфейс :class:`AbstractEventLoop`.

source: This method should never return ``None``.
uk: Цей метод ніколи не повинен повертати ``None``.

source: Set the event loop for the current context to *loop*.
uk: Встановіть для циклу подій для поточного контексту значення *loop*.

source: Create and return a new event loop object.
uk: Створити та повернути новий об’єкт циклу подій.

source: Get a child process watcher object.
uk: Отримайте дочірній об’єкт спостереження за процесом.

source: Return a watcher object implementing the :class:`AbstractChildWatcher` interface.
uk: Повертає об’єкт спостереження, що реалізує інтерфейс :class:`AbstractChildWatcher`.

source: This function is Unix specific.
uk: Ця функція є специфічною для Unix.

source: Set the current child process watcher to *watcher*.
uk: Встановіть для поточного спостерігача дочірнього процесу значення *watcher*.

source: asyncio ships with the following built-in policies:
uk: asyncio поставляється з такими вбудованими політиками:

source: The default asyncio policy. Uses :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
uk: Стандартна асинхронна політика. Використовує :class:`SelectorEventLoop` в Unix і :class:`ProactorEventLoop` у Windows.

source: There is no need to install the default policy manually. asyncio is configured to use the default policy automatically.
uk: Немає необхідності встановлювати стандартну політику вручну. asyncio налаштовано на автоматичне використання політики за замовчуванням.

source: On Windows, :class:`ProactorEventLoop` is now used by default.
uk: У Windows :class:`ProactorEventLoop` тепер використовується за замовчуванням.

source: An alternative event loop policy that uses the :class:`SelectorEventLoop` event loop implementation.
uk: Альтернативна політика циклу подій, яка використовує реалізацію циклу подій :class:`SelectorEventLoop`.

source: :ref:`Availability <availability>`: Windows.
uk: :ref:`Наявність <availability>`: Windows.

source: An alternative event loop policy that uses the :class:`ProactorEventLoop` event loop implementation.
uk: Альтернативна політика циклу подій, яка використовує реалізацію циклу подій :class:`ProactorEventLoop`.

source: Process Watchers
uk: Спостерігачі процесів

source: A process watcher allows customization of how an event loop monitors child processes on Unix. Specifically, the event loop needs to know when a child process has exited.
uk: Спостерігач процесів дозволяє налаштувати те, як цикл подій відстежує дочірні процеси в Unix. Зокрема, цикл подій повинен знати, коли завершився дочірній процес.

source: In asyncio, child processes are created with :func:`create_subprocess_exec` and :meth:`loop.subprocess_exec` functions.
uk: В asyncio дочірні процеси створюються за допомогою функцій :func:`create_subprocess_exec` і :meth:`loop.subprocess_exec`.

source: asyncio defines the :class:`AbstractChildWatcher` abstract base class, which child watchers should implement, and has four different implementations: :class:`ThreadedChildWatcher` (configured to be used by default), :class:`MultiLoopChildWatcher`, :class:`SafeChildWatcher`, and :class:`FastChildWatcher`.
uk: asyncio визначає абстрактний базовий клас :class:`AbstractChildWatcher`, який повинні реалізувати дочірні спостерігачі, і має чотири різні реалізації: :class:`ThreadedChildWatcher` (налаштований для використання за замовчуванням), :class:`MultiLoopChildWatcher`, :class:`SafeChildWatcher` і :class:`FastChildWatcher`.

source: See also the :ref:`Subprocess and Threads <asyncio-subprocess-threads>` section.
uk: Дивіться також розділ :ref:`Subprocess and Threads <asyncio-subprocess-threads>`.

source: The following two functions can be used to customize the child process watcher implementation used by the asyncio event loop:
uk: Наступні дві функції можна використовувати для налаштування реалізації спостерігача дочірніх процесів, що використовується циклом асинхронних подій:

source: Return the current child watcher for the current policy.
uk: Повертає поточний дочірній спостерігач для поточної політики.

source: Set the current child watcher to *watcher* for the current policy. *watcher* must implement methods defined in the :class:`AbstractChildWatcher` base class.
uk: Установіть для поточного дочірнього спостерігача значення *watcher* для поточної політики. *watcher* повинен реалізовувати методи, визначені в базовому класі :class:`AbstractChildWatcher`.

source: Third-party event loops implementations might not support custom child watchers. For such event loops, using :func:`set_child_watcher` might be prohibited or have no effect.
uk: Реалізації сторонніх циклів подій можуть не підтримувати користувацькі дочірні спостерігачі. Для таких циклів подій використання :func:`set_child_watcher` може бути заборонено або не матиме ефекту.

source: Register a new child handler.
uk: Зареєструвати нового дочірнього обробника.

source: Arrange for ``callback(pid, returncode, *args)`` to be called when a process with PID equal to *pid* terminates. Specifying another callback for the same process replaces the previous handler.
uk: Організуйте виклик ``callback(pid, returncode, *args)`` під час завершення процесу з PID, рівним *pid*. Зазначення іншого зворотного виклику для того самого процесу замінює попередній обробник.

source: The *callback* callable must be thread-safe.
uk: Функція *callback* має бути потокобезпечною.

source: Removes the handler for process with PID equal to *pid*.
uk: Видаляє обробник для процесу з PID рівним *pid*.

source: The function returns ``True`` if the handler was successfully removed, ``False`` if there was nothing to remove.
uk: Функція повертає ``True``, якщо обробник було успішно видалено, ``False``, якщо не було нічого для видалення.

source: Attach the watcher to an event loop.
uk: Приєднайте спостерігач до циклу подій.

source: If the watcher was previously attached to an event loop, then it is first detached before attaching to the new loop.
uk: Якщо спостерігач був раніше приєднаний до циклу подій, то він спочатку від'єднується перед приєднанням до нового циклу.

source: Note: loop may be ``None``.
uk: Примітка: цикл може бути ``None``.

source: Return ``True`` if the watcher is ready to use.
uk: Повертає ``True``, якщо спостерігач готовий до використання.

source: Spawning a subprocess with *inactive* current child watcher raises :exc:`RuntimeError`.
uk: Створення підпроцесу з *неактивним* поточним дочірнім спостерігачем викликає :exc:`RuntimeError`.

source: Close the watcher.
uk: Закрийте спостерігач.

source: This method has to be called to ensure that underlying resources are cleaned-up.
uk: Цей метод потрібно викликати, щоб переконатися, що базові ресурси очищені.

source: This implementation starts a new waiting thread for every subprocess spawn.
uk: Ця реалізація запускає новий потік очікування для кожного породження підпроцесу.

source: It works reliably even when the asyncio event loop is run in a non-main OS thread.
uk: Він працює надійно, навіть якщо цикл асинхронних подій виконується в неосновному потоці ОС.

source: There is no noticeable overhead when handling a big number of children (*O(1)* each time a child terminates), but starting a thread per process requires extra memory.
uk: Немає помітних накладних витрат при обробці великої кількості дітей (*O(1)* кожного разу, коли дитина завершується), але для запуску потоку для кожного процесу потрібна додаткова пам’ять.

source: This watcher is used by default.
uk: Цей спостерігач використовується за замовчуванням.

source: This implementation registers a :py:data:`SIGCHLD` signal handler on instantiation. That can break third-party code that installs a custom handler for :py:data:`SIGCHLD` signal.
uk: Ця реалізація реєструє обробник сигналу :py:data:`SIGCHLD` під час створення екземпляра. Це може порушити код третьої сторони, який встановлює спеціальний обробник для сигналу :py:data:`SIGCHLD`.

source: The watcher avoids disrupting other code spawning processes by polling every process explicitly on a :py:data:`SIGCHLD` signal.
uk: Спостерігач уникає порушення інших процесів створення коду, явно опитуючи кожен процес за сигналом :py:data:`SIGCHLD`.

source: There is no limitation for running subprocesses from different threads once the watcher is installed.
uk: Немає обмежень для запуску підпроцесів з різних потоків після встановлення спостерігача.

source: The solution is safe but it has a significant overhead when handling a big number of processes (*O(n)* each time a :py:data:`SIGCHLD` is received).
uk: Рішення є безпечним, але воно має значні витрати під час обробки великої кількості процесів (*O(n)* щоразу, коли отримується :py:data:`SIGCHLD`).

source: This implementation uses active event loop from the main thread to handle :py:data:`SIGCHLD` signal. If the main thread has no running event loop another thread cannot spawn a subprocess (:exc:`RuntimeError` is raised).
uk: Ця реалізація використовує активний цикл подій з основного потоку для обробки сигналу :py:data:`SIGCHLD`. Якщо основний потік не має запущеного циклу подій, інший потік не може породити підпроцес (виникає :exc:`RuntimeError`).

source: This solution is as safe as :class:`MultiLoopChildWatcher` and has the same *O(N)* complexity but requires a running event loop in the main thread to work.
uk: Це рішення таке ж безпечне, як і :class:`MultiLoopChildWatcher`, і має таку ж складність *O(N)*, але для роботи потрібен запущений цикл подій у головному потоці.

source: This implementation reaps every terminated processes by calling ``os.waitpid(-1)`` directly, possibly breaking other code spawning processes and waiting for their termination.
uk: Ця реалізація збирає всі завершені процеси шляхом безпосереднього виклику ``os.waitpid(-1)``, можливо, порушуючи інші процеси породження коду та чекаючи їх завершення.

source: There is no noticeable overhead when handling a big number of children (*O(1)* each time a child terminates).
uk: Немає помітних накладних витрат при обробці великої кількості дітей (*O(1)* кожного разу, коли дитина завершує роботу).

source: This solution requires a running event loop in the main thread to work, as :class:`SafeChildWatcher`.
uk: Для роботи цього рішення потрібен запущений цикл подій у головному потоці, як :class:`SafeChildWatcher`.

source: This implementation polls process file descriptors (pidfds) to await child process termination. In some respects, :class:`PidfdChildWatcher` is a "Goldilocks" child watcher implementation. It doesn't require signals or threads, doesn't interfere with any processes launched outside the event loop, and scales linearly with the number of subprocesses launched by the event loop. The main disadvantage is that pidfds are specific to Linux, and only work on recent (5.3+) kernels.
uk: Ця реалізація опитує дескриптори файлів процесу (pidfds) для очікування завершення дочірнього процесу. У деяких відношеннях :class:`PidfdChildWatcher` є реалізацією дочірнього спостерігача "Золотовласка". Він не потребує сигналів чи потоків, не заважає жодним процесам, запущеним поза циклом подій, і масштабується лінійно залежно від кількості підпроцесів, запущених циклом подій. Основним недоліком є те, що pidfds є специфічними для Linux і працюють лише на останніх (5.3+) ядрах.

source: Custom Policies
uk: Спеціальна політика

source: To implement a new event loop policy, it is recommended to subclass :class:`DefaultEventLoopPolicy` and override the methods for which custom behavior is wanted, e.g.::
uk: Щоб запровадити нову політику циклу подій, рекомендується створити підклас :class:`DefaultEventLoopPolicy` і перевизначити методи, для яких потрібна спеціальна поведінка, наприклад::
