Repository: python/python-docs-uk
Catalog: library/asyncio-stream.po
Languages: uk

source: Streams
uk: Потоки

source: **Source code:** :source:`Lib/asyncio/streams.py`
uk: **Вихідний код:** :source:`Lib/asyncio/streams.py`

source: Streams are high-level async/await-ready primitives to work with network connections. Streams allow sending and receiving data without using callbacks or low-level protocols and transports.
uk: Потоки — це високорівневі асинхронні/готові до очікування примітиви для роботи з мережевими підключеннями. Потоки дозволяють надсилати й отримувати дані без використання зворотних викликів або низькорівневих протоколів і транспортів.

source: Here is an example of a TCP echo client written using asyncio streams::
uk: Ось приклад клієнта відлуння TCP, написаного з використанням асинхронних потоків::

source: See also the `Examples`_ section below.
uk: Дивіться також розділ `Examples`_ нижче.

source: Stream Functions
uk: Потокові функції

source: The following top-level asyncio functions can be used to create and work with streams:
uk: Наступні асинхронні функції верхнього рівня можна використовувати для створення та роботи з потоками:

source: Establish a network connection and return a pair of ``(reader, writer)`` objects.
uk: Встановіть мережеве з’єднання та поверніть пару об’єктів ``(reader, writer)``.

source: The returned *reader* and *writer* objects are instances of :class:`StreamReader` and :class:`StreamWriter` classes.
uk: Повернені об’єкти *reader* і *writer* є екземплярами класів :class:`StreamReader` і :class:`StreamWriter`.

source: *limit* determines the buffer size limit used by the returned :class:`StreamReader` instance. By default the *limit* is set to 64 KiB.
uk: *limit* визначає обмеження розміру буфера, який використовується повернутим екземпляром :class:`StreamReader`. За замовчуванням *обмеження* встановлено на 64 КБ.

source: The rest of the arguments are passed directly to :meth:`loop.create_connection`.
uk: Решта аргументів передаються безпосередньо до :meth:`loop.create_connection`.

source: Added the *ssl_handshake_timeout* parameter.
uk: Додано параметр *ssl_handshake_timeout*.

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
uk: Додано параметри *happy_eyeballs_delay* і *interleave*.

source: Removed the *loop* parameter.
uk: Видалено параметр *loop*.

source: Start a socket server.
uk: Запустіть сервер сокетів.

source: The *client_connected_cb* callback is called whenever a new client connection is established. It receives a ``(reader, writer)`` pair as two arguments, instances of the :class:`StreamReader` and :class:`StreamWriter` classes.
uk: Зворотний виклик *client_connected_cb* викликається щоразу, коли встановлюється нове підключення клієнта. Він отримує пару ``(reader, writer)`` як два аргументи, екземпляри класів :class:`StreamReader` і :class:`StreamWriter`.

source: *client_connected_cb* can be a plain callable or a :ref:`coroutine function <coroutine>`; if it is a coroutine function, it will be automatically scheduled as a :class:`Task`.
uk: *client_connected_cb* може бути простим викликом або :ref:`функцією співпрограми <coroutine>`; якщо це функція співпрограми, вона буде автоматично запланована як :class:`Task`.

source: The rest of the arguments are passed directly to :meth:`loop.create_server`.
uk: Решта аргументів передаються безпосередньо до :meth:`loop.create_server`.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters.
uk: Додано параметри *ssl_handshake_timeout* і *start_serving*.

source: Unix Sockets
uk: Unix-сокети

source: Establish a Unix socket connection and return a pair of ``(reader, writer)``.
uk: Встановіть з’єднання через сокет Unix і поверніть пару ``(reader, writer)``.

source: Similar to :func:`open_connection` but operates on Unix sockets.
uk: Подібно до :func:`open_connection`, але працює на сокетах Unix.

source: See also the documentation of :meth:`loop.create_unix_connection`.
uk: Дивіться також документацію :meth:`loop.create_unix_connection`.

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`
uk: Додано параметр *ssl_handshake_timeout*. Параметр *path* тепер може бути :term:`path-like object`

source: Start a Unix socket server.
uk: Запустіть сокет-сервер Unix.

source: Similar to :func:`start_server` but works with Unix sockets.
uk: Подібно до :func:`start_server`, але працює з сокетами Unix.

source: See also the documentation of :meth:`loop.create_unix_server`.
uk: Дивіться також документацію :meth:`loop.create_unix_server`.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :term:`path-like object`.
uk: Додано параметри *ssl_handshake_timeout* і *start_serving*. Параметр *path* тепер може бути :term:`path-like object`.

source: It is not recommended to instantiate *StreamReader* objects directly; use :func:`open_connection` and :func:`start_server` instead.
uk: Не рекомендується безпосередньо створювати екземпляри об’єктів *StreamReader*; замість цього використовуйте :func:`open_connection` і :func:`start_server`.

source: Read one line, where "line" is a sequence of bytes ending with ``\n``.
uk: Прочитати один рядок, де "рядок" — це послідовність байтів, що закінчуються на ``\n``.

source: If EOF is received and ``\n`` was not found, the method returns partially read data.
uk: Якщо EOF отримано, а ``\n`` не знайдено, метод повертає частково прочитані дані.

source: If EOF is received and the internal buffer is empty, return an empty ``bytes`` object.
uk: Якщо EOF отримано, а внутрішній буфер порожній, поверніть порожній об’єкт ``bytes``.

source: Read exactly *n* bytes.
uk: Прочитайте рівно *n* байт.

source: Raise an :exc:`IncompleteReadError` if EOF is reached before *n* can be read. Use the :attr:`IncompleteReadError.partial` attribute to get the partially read data.
uk: Викликати :exc:`IncompleteReadError`, якщо EOF досягнуто до того, як *n* можна буде прочитати. Використовуйте атрибут :attr:`IncompleteReadError.partial`, щоб отримати частково прочитані дані.

source: Read data from the stream until *separator* is found.
uk: Читати дані з потоку, доки не буде знайдено *роздільник*.

source: On success, the data and separator will be removed from the internal buffer (consumed). Returned data will include the separator at the end.
uk: У разі успіху дані та роздільник буде видалено з внутрішнього буфера (використано). Повернуті дані включатимуть роздільник у кінці.

source: If the amount of data read exceeds the configured stream limit, a :exc:`LimitOverrunError` exception is raised, and the data is left in the internal buffer and can be read again.
uk: Якщо обсяг зчитаних даних перевищує налаштований ліміт потоку, виникає виняток :exc:`LimitOverrunError`, і дані залишаються у внутрішньому буфері та можуть бути прочитані знову.

source: If EOF is reached before the complete separator is found, an :exc:`IncompleteReadError` exception is raised, and the internal buffer is reset. The :attr:`IncompleteReadError.partial` attribute may contain a portion of the separator.
uk: Якщо EOF досягнуто до того, як знайдено повний роздільник, виникає виняток :exc:`IncompleteReadError`, і внутрішній буфер скидається. Атрибут :attr:`IncompleteReadError.partial` може містити частину роздільника.

source: Return ``True`` if the buffer is empty and :meth:`feed_eof` was called.
uk: Повертає ``True``, якщо буфер порожній і було викликано :meth:`feed_eof`.

source: Represents a writer object that provides APIs to write data to the IO stream.
uk: Представляє об’єкт запису, який надає API для запису даних у потік вводу-виводу.

source: It is not recommended to instantiate *StreamWriter* objects directly; use :func:`open_connection` and :func:`start_server` instead.
uk: Не рекомендується безпосередньо створювати екземпляри об’єктів *StreamWriter*; замість цього використовуйте :func:`open_connection` і :func:`start_server`.

source: The method attempts to write the *data* to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
uk: Метод намагається негайно записати *дані* в основний сокет. Якщо це не вдається, дані ставляться в чергу у внутрішній буфер запису, доки їх не буде надіслано.

source: The method should be used along with the ``drain()`` method::
uk: Цей метод слід використовувати разом із методом ``drain()``:

source: The method writes a list (or any iterable) of bytes to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
uk: Метод негайно записує список (або будь-яку ітерацію) байтів у базовий сокет. Якщо це не вдається, дані ставляться в чергу у внутрішній буфер запису, доки їх не буде надіслано.

source: The method closes the stream and the underlying socket.
uk: Метод закриває потік і базовий сокет.

source: Return ``True`` if the underlying transport supports the :meth:`write_eof` method, ``False`` otherwise.
uk: Повертає ``True``, якщо основний транспорт підтримує метод :meth:`write_eof`, ``False`` інакше.

source: Close the write end of the stream after the buffered write data is flushed.
uk: Закрийте кінець запису потоку після очищення буферизованих даних запису.

source: Return the underlying asyncio transport.
uk: Повернути базовий асинхронний транспорт.

source: Access optional transport information; see :meth:`BaseTransport.get_extra_info` for details.
uk: Доступ до додаткової транспортної інформації; подробиці див. :meth:`BaseTransport.get_extra_info`.

source: Wait until it is appropriate to resume writing to the stream. Example::
uk: Зачекайте, доки буде прийнятно продовжити запис у потік. Приклад::

source: This is a flow control method that interacts with the underlying IO write buffer. When the size of the buffer reaches the high watermark, *drain()* blocks until the size of the buffer is drained down to the low watermark and writing can be resumed. When there is nothing to wait for, the :meth:`drain` returns immediately.
uk: Це метод керування потоком, який взаємодіє з базовим буфером запису вводу-виводу. Коли розмір буфера досягає верхнього водяного знака, *drain()* блокує, доки розмір буфера не зменшиться до низького водяного знака, і запис можна буде відновити. Коли нема чого чекати, :meth:`drain` повертається негайно.

source: Parameters:
uk: Параметри:

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
uk: *sslcontext*: налаштований екземпляр :class:`~ssl.SSLContext`.

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
uk: *server_hostname*: встановлює або замінює ім’я хоста, з яким буде зіставлятися сертифікат цільового сервера.

source: Return ``True`` if the stream is closed or in the process of being closed.
uk: Повертає ``True``, якщо потік закрито або знаходиться в процесі закриття.

source: Wait until the stream is closed.
uk: Зачекайте, поки потік закриється.

source: Examples
uk: Приклади

source: TCP echo client using streams
uk: TCP echo client використовує потоки

source: TCP echo client using the :func:`asyncio.open_connection` function::
uk: TCP-клієнт відлуння за допомогою функції :func:`asyncio.open_connection`::

source: The :ref:`TCP echo client protocol <asyncio_example_tcp_echo_client_protocol>` example uses the low-level :meth:`loop.create_connection` method.
uk: У прикладі :ref:`TCP echo client protocol <asyncio_example_tcp_echo_client_protocol>` використовується метод низького рівня :meth:`loop.create_connection`.

source: TCP echo server using streams
uk: Сервер відлуння TCP з використанням потоків

source: TCP echo server using the :func:`asyncio.start_server` function::
uk: Сервер відлуння TCP за допомогою функції :func:`asyncio.start_server`::

source: The :ref:`TCP echo server protocol <asyncio_example_tcp_echo_server_protocol>` example uses the :meth:`loop.create_server` method.
uk: У прикладі :ref:`TCP echo server protocol <asyncio_example_tcp_echo_server_protocol>` використовується метод :meth:`loop.create_server`.

source: Get HTTP headers
uk: Отримайте заголовки HTTP

source: Simple example querying HTTP headers of the URL passed on the command line::
uk: Простий приклад запиту HTTP-заголовків URL-адреси, переданої в командному рядку::

source: Usage::
uk: Використання::

source: or with HTTPS::
uk: або з HTTPS::

source: Register an open socket to wait for data using streams
uk: Зареєструйте відкритий сокет для очікування даних за допомогою потоків

source: Coroutine waiting until a socket receives data using the :func:`open_connection` function::
uk: Співпрограма очікує, доки сокет не отримає дані за допомогою функції :func:`open_connection`::

source: The :ref:`register an open socket to wait for data using a protocol <asyncio_example_create_connection>` example uses a low-level protocol and the :meth:`loop.create_connection` method.
uk: У прикладі :ref:`реєструвати відкритий сокет для очікування даних за допомогою протоколу <asyncio_example_create_connection>` використовується протокол низького рівня та метод :meth:`loop.create_connection`.

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to watch a file descriptor.
uk: У прикладі :ref:`спостерігати за подіями читання файлового дескриптора <asyncio_example_watch_fd>` використовується низькорівневий метод :meth:`loop.add_reader` для спостереження за файловим дескриптором.
