Repository: python/python-docs-uk
Catalog: library/asyncio-protocol.po
Languages: uk

source: Transports and Protocols
uk: Транспорт і протоколи

source: Preface
uk: Передмова

source: Transports and Protocols are used by the **low-level** event loop APIs such as :meth:`loop.create_connection`. They use callback-based programming style and enable high-performance implementations of network or IPC protocols (e.g. HTTP).
uk: Транспорти та протоколи використовуються API циклу подій **низького рівня**, наприклад :meth:`loop.create_connection`. Вони використовують стиль програмування на основі зворотного виклику та дозволяють високопродуктивні реалізації мережевих або IPC-протоколів (наприклад, HTTP).

source: Essentially, transports and protocols should only be used in libraries and frameworks and never in high-level asyncio applications.
uk: По суті, транспорти та протоколи слід використовувати лише в бібліотеках і фреймворках, а не в асинхронних програмах високого рівня.

source: This documentation page covers both `Transports`_ and `Protocols`_.
uk: Ця сторінка документації охоплює як `Transports`_, так і `Protocols`_.

source: Introduction
uk: Вступ

source: At the highest level, the transport is concerned with *how* bytes are transmitted, while the protocol determines *which* bytes to transmit (and to some extent when).
uk: На найвищому рівні транспорт стосується того, *як* передаються байти, тоді як протокол визначає, *які* байти передавати (і певною мірою коли).

source: A different way of saying the same thing: a transport is an abstraction for a socket (or similar I/O endpoint) while a protocol is an abstraction for an application, from the transport's point of view.
uk: Інший спосіб сказати те саме: транспорт є абстракцією для сокета (або подібної кінцевої точки вводу/виводу), тоді як протокол є абстракцією для програми з точки зору транспорту.

source: Yet another view is the transport and protocol interfaces together define an abstract interface for using network I/O and interprocess I/O.
uk: Ще один погляд полягає в тому, що транспортний і протокольний інтерфейси разом визначають абстрактний інтерфейс для використання мережевого вводу-виводу та міжпроцесного введення-виведення.

source: There is always a 1:1 relationship between transport and protocol objects: the protocol calls transport methods to send data, while the transport calls protocol methods to pass it data that has been received.
uk: Між транспортними об’єктами та об’єктами протоколу завжди існує зв’язок 1:1: протокол викликає транспортні методи для надсилання даних, тоді як транспорт викликає протокольні методи для передачі йому отриманих даних.

source: Most of connection oriented event loop methods (such as :meth:`loop.create_connection`) usually accept a *protocol_factory* argument used to create a *Protocol* object for an accepted connection, represented by a *Transport* object. Such methods usually return a tuple of ``(transport, protocol)``.
uk: Більшість методів циклу подій, орієнтованих на підключення (таких як :meth:`loop.create_connection`), зазвичай приймають аргумент *protocol_factory*, який використовується для створення об’єкта *Protocol* для прийнятного з’єднання, представленого об’єктом *Transport*. Такі методи зазвичай повертають кортеж ``(транспорт, протокол)``.

source: Contents
uk: Зміст

source: This documentation page contains the following sections:
uk: Ця сторінка документації містить такі розділи:

source: The `Transports`_ section documents asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport`, and :class:`SubprocessTransport` classes.
uk: Розділ `Transports`_ документує asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport` і :class:`SubprocessTransport` класи.

source: The `Protocols`_ section documents asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol`, and :class:`SubprocessProtocol` classes.
uk: Розділ `Protocols`_ документує асинхронні класи :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol` і :class:`SubprocessProtocol`.

source: The `Examples`_ section showcases how to work with transports, protocols, and low-level event loop APIs.
uk: Розділ `Examples`_ демонструє, як працювати з транспортами, протоколами та API низькорівневого циклу подій.

source: Transports
uk: Транспорти

source: **Source code:** :source:`Lib/asyncio/transports.py`
uk: **Вихідний код:** :source:`Lib/asyncio/transports.py`

source: Transports are classes provided by :mod:`asyncio` in order to abstract various kinds of communication channels.
uk: Транспорти — це класи, надані :mod:`asyncio` для абстрагування різних видів каналів зв’язку.

source: Transport objects are always instantiated by an :ref:`asyncio event loop <asyncio-event-loop>`.
uk: Транспортні об’єкти завжди створюються :ref:`асинхронним циклом подій <asyncio-event-loop>`.

source: asyncio implements transports for TCP, UDP, SSL, and subprocess pipes. The methods available on a transport depend on the transport's kind.
uk: asyncio реалізує транспорти для каналів TCP, UDP, SSL і підпроцесів. Методи, доступні на транспорті, залежать від типу транспорту.

source: The transport classes are :ref:`not thread safe <asyncio-multithreading>`.
uk: Транспортні класи :ref:`не потоково безпечні <asyncio-multithreading>`.

source: Transports Hierarchy
uk: Ієрархія транспортів

source: Base class for all transports. Contains methods that all asyncio transports share.
uk: Базовий клас для всіх видів транспорту. Містить методи, спільні для всіх асинхронних транспортів.

source: A base transport for write-only connections.
uk: Базовий транспорт для підключень лише для запису.

source: Instances of the *WriteTransport* class are returned from the :meth:`loop.connect_write_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
uk: Екземпляри класу *WriteTransport* повертаються з методу циклу подій :meth:`loop.connect_write_pipe`, а також використовуються пов’язаними з підпроцесами методами, наприклад :meth:`loop.subprocess_exec`.

source: A base transport for read-only connections.
uk: Базовий транспорт для підключень лише для читання.

source: Instances of the *ReadTransport* class are returned from the :meth:`loop.connect_read_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
uk: Екземпляри класу *ReadTransport* повертаються з методу циклу подій :meth:`loop.connect_read_pipe`, а також використовуються пов’язаними з підпроцесами методами, наприклад :meth:`loop.subprocess_exec`.

source: Interface representing a bidirectional transport, such as a TCP connection.
uk: Інтерфейс, що представляє двонаправлений транспорт, наприклад TCP-з'єднання.

source: The user does not instantiate a transport directly; they call a utility function, passing it a protocol factory and other information necessary to create the transport and protocol.
uk: Користувач не створює екземпляр транспорту безпосередньо; вони викликають службову функцію, передаючи їй фабрику протоколів та іншу інформацію, необхідну для створення транспорту та протоколу.

source: Instances of the *Transport* class are returned from or used by event loop methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.
uk: Екземпляри класу *Transport* повертаються або використовуються такими методами циклу подій, як :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop. sendfile` тощо.

source: A transport for datagram (UDP) connections.
uk: Транспорт для з’єднань дейтаграм (UDP).

source: Instances of the *DatagramTransport* class are returned from the :meth:`loop.create_datagram_endpoint` event loop method.
uk: Екземпляри класу *DatagramTransport* повертаються з методу циклу подій :meth:`loop.create_datagram_endpoint`.

source: An abstraction to represent a connection between a parent and its child OS process.
uk: Абстракція для представлення зв’язку між батьківським і дочірнім процесами ОС.

source: Instances of the *SubprocessTransport* class are returned from event loop methods :meth:`loop.subprocess_shell` and :meth:`loop.subprocess_exec`.
uk: Екземпляри класу *SubprocessTransport* повертаються з методів циклу подій :meth:`loop.subprocess_shell` і :meth:`loop.subprocess_exec`.

source: Base Transport
uk: Базовий транспорт

source: Close the transport.
uk: Закрити транспорт.

source: If the transport has a buffer for outgoing data, buffered data will be flushed asynchronously. No more data will be received. After all buffered data is flushed, the protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will be called with :const:`None` as its argument.
uk: Якщо транспорт має буфер для вихідних даних, буферизовані дані будуть скидані асинхронно. Дані більше не надходитимуть. Після того, як усі буферизовані дані скинуто, буде викликано метод протоколу :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` з аргументом :const:`None`.

source: Return ``True`` if the transport is closing or is closed.
uk: Повертає ``True``, якщо транспорт закривається або закритий.

source: Return information about the transport or underlying resources it uses.
uk: Повертає інформацію про транспорт або основні ресурси, які він використовує.

source: *name* is a string representing the piece of transport-specific information to get.
uk: *ім’я* — це рядок, що представляє частину транспортної інформації, яку потрібно отримати.

source: *default* is the value to return if the information is not available, or if the transport does not support querying it with the given third-party event loop implementation or on the current platform.
uk: *default* — це значення, яке повертається, якщо інформація недоступна або якщо транспорт не підтримує її запит за допомогою сторонньої реалізації циклу подій або на поточній платформі.

source: For example, the following code attempts to get the underlying socket object of the transport::
uk: Наприклад, наступний код намагається отримати базовий об’єкт сокета транспорту::

source: Categories of information that can be queried on some transports:
uk: Категорії інформації, які можна запитувати на деяких транспортах:

source: socket:
uk: розетка:

source: ``'peername'``: the remote address to which the socket is connected, result of :meth:`socket.socket.getpeername` (``None`` on error)
uk: ``'peername'``: віддалена адреса, до якої підключено сокет, результат :meth:`socket.socket.getpeername` (``None`` у разі помилки)

source: ``'socket'``: :class:`socket.socket` instance
uk: ``'socket'``: :class:`socket.socket` екземпляр

source: ``'sockname'``: the socket's own address, result of :meth:`socket.socket.getsockname`
uk: ``'sockname'``: власна адреса сокета, результат :meth:`socket.socket.getsockname`

source: SSL socket:
uk: SSL-сокет:

source: ``'compression'``: the compression algorithm being used as a string, or ``None`` if the connection isn't compressed; result of :meth:`ssl.SSLSocket.compression`
uk: ``'стиснення'``: алгоритм стиснення, що використовується як рядок, або ``None``, якщо з'єднання не стиснуте; результат :meth:`ssl.SSLSocket.compression`

source: ``'cipher'``: a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used; result of :meth:`ssl.SSLSocket.cipher`
uk: ``'cipher'``: кортеж з трьох значень, що містить назву використовуваного шифру, версію протоколу SSL, яка визначає його використання, і кількість секретних бітів, що використовуються; результат :meth:`ssl.SSLSocket.cipher`

source: ``'peercert'``: peer certificate; result of :meth:`ssl.SSLSocket.getpeercert`
uk: ``'peercert'``: одноранговий сертифікат; результат :meth:`ssl.SSLSocket.getpeercert`

source: ``'sslcontext'``: :class:`ssl.SSLContext` instance
uk: ``'sslcontext'``: екземпляр :class:`ssl.SSLContext`

source: ``'ssl_object'``: :class:`ssl.SSLObject` or :class:`ssl.SSLSocket` instance
uk: ``'ssl_object'``: :class:`ssl.SSLObject` або :class:`ssl.SSLSocket` екземпляр

source: pipe:
uk: труба:

source: ``'pipe'``: pipe object
uk: ``'pipe'``: об'єкт труби

source: subprocess:
uk: підпроцес:

source: ``'subprocess'``: :class:`subprocess.Popen` instance
uk: екземпляр ``'subprocess'``: :class:`subprocess.Popen`

source: Set a new protocol.
uk: Встановіть новий протокол.

source: Switching protocol should only be done when both protocols are documented to support the switch.
uk: Протокол перемикання слід виконувати лише тоді, коли обидва протоколи задокументовано для підтримки перемикання.

source: Return the current protocol.
uk: Повернути поточний протокол.

source: Read-only Transports
uk: Транспорти лише для читання

source: Return ``True`` if the transport is receiving new data.
uk: Повертає ``True``, якщо транспорт отримує нові дані.

source: Pause the receiving end of the transport. No data will be passed to the protocol's :meth:`protocol.data_received() <Protocol.data_received>` method until :meth:`resume_reading` is called.
uk: Призупинити приймальний кінець транспорту. Жодні дані не будуть передані в метод протоколу :meth:`protocol.data_received() <Protocol.data_received>`, доки не буде викликано :meth:`resume_reading`.

source: The method is idempotent, i.e. it can be called when the transport is already paused or closed.
uk: Метод є ідемпотентним, тобто його можна викликати, коли транспорт вже призупинено або закрито.

source: Resume the receiving end. The protocol's :meth:`protocol.data_received() <Protocol.data_received>` method will be called once again if some data is available for reading.
uk: Відновіть приймальний кінець. Метод :meth:`protocol.data_received() <Protocol.data_received>` протоколу буде викликано ще раз, якщо деякі дані доступні для читання.

source: The method is idempotent, i.e. it can be called when the transport is already reading.
uk: Метод є ідемпотентним, тобто його можна викликати, коли транспорт вже читає.

source: Write-only Transports
uk: Транспорти лише для запису

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
uk: Закрийте транспорт негайно, не чекаючи завершення незавершених операцій. Буферизовані дані буде втрачено. Дані більше не надходитимуть. Метод :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` протоколу зрештою буде викликано з :const:`None` як аргумент.

source: Return :const:`True` if the transport supports :meth:`~WriteTransport.write_eof`, :const:`False` if not.
uk: Повертає :const:`True`, якщо транспорт підтримує :meth:`~WriteTransport.write_eof`, :const:`False`, якщо ні.

source: Return the current size of the output buffer used by the transport.
uk: Повертає поточний розмір вихідного буфера, який використовується транспортом.

source: Get the *high* and *low* watermarks for write flow control. Return a tuple ``(low, high)`` where *low* and *high* are positive number of bytes.
uk: Отримайте *високий* і *низький* водяні знаки для керування потоком запису. Повертає кортеж ``(low, high)``, де *low* і *high* є додатною кількістю байтів.

source: Use :meth:`set_write_buffer_limits` to set the limits.
uk: Використовуйте :meth:`set_write_buffer_limits`, щоб встановити обмеження.

source: Set the *high* and *low* watermarks for write flow control.
uk: Встановіть *високий* і *низький* водяні знаки для керування потоком запису.

source: These two values (measured in number of bytes) control when the protocol's :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` and :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` methods are called. If specified, the low watermark must be less than or equal to the high watermark. Neither *high* nor *low* can be negative.
uk: Ці два значення (вимірюються в кількості байтів) контролюють, коли викликаються методи протоколу :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` і :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>`. Якщо вказано, нижній водяний знак має бути меншим або дорівнювати високому водяному знаку. Ні *високий*, ні *низький* не можуть бути негативними.

source: :meth:`~BaseProtocol.pause_writing` is called when the buffer size becomes greater than or equal to the *high* value. If writing has been paused, :meth:`~BaseProtocol.resume_writing` is called when the buffer size becomes less than or equal to the *low* value.
uk: :meth:`~BaseProtocol.pause_writing` викликається, коли розмір буфера стає більшим або рівним значенню *high*. Якщо запис призупинено, :meth:`~BaseProtocol.resume_writing` викликається, коли розмір буфера стає меншим або рівним *низькому* значенню.

source: The defaults are implementation-specific. If only the high watermark is given, the low watermark defaults to an implementation-specific value less than or equal to the high watermark. Setting *high* to zero forces *low* to zero as well, and causes :meth:`~BaseProtocol.pause_writing` to be called whenever the buffer becomes non-empty. Setting *low* to zero causes :meth:`~BaseProtocol.resume_writing` to be called only once the buffer is empty. Use of zero for either limit is generally sub-optimal as it reduces opportunities for doing I/O and computation concurrently.
uk: Значення за замовчуванням залежать від реалізації. Якщо вказано лише високий водяний знак, низький водяний знак за замовчуванням має значення, що залежить від реалізації, менше або дорівнює верхньому водяному знаку. Якщо встановити *high* на нуль, *low* також буде встановлено на нуль і спричинить виклик :meth:`~BaseProtocol.pause_writing` щоразу, коли буфер стає непорожнім. Якщо встановити *low* на нуль, :meth:`~BaseProtocol.resume_writing` буде викликатися лише після того, як буфер буде порожнім. Використання нуля для будь-якого обмеження, як правило, є неоптимальним, оскільки воно зменшує можливості одночасного виконання вводу-виводу та обчислень.

source: Use :meth:`~WriteTransport.get_write_buffer_limits` to get the limits.
uk: Використовуйте :meth:`~WriteTransport.get_write_buffer_limits`, щоб отримати обмеження.

source: Write some *data* bytes to the transport.
uk: Запишіть кілька байтів *data* в транспорт.

source: This method does not block; it buffers the data and arranges for it to be sent out asynchronously.
uk: Цей спосіб не блокує; він буферизує дані та організовує їх асинхронне надсилання.

source: Write a list (or any iterable) of data bytes to the transport. This is functionally equivalent to calling :meth:`write` on each element yielded by the iterable, but may be implemented more efficiently.
uk: Запишіть список (або будь-яку ітерацію) байтів даних у транспорт. Це функціонально еквівалентно виклику :meth:`write` для кожного елемента, отриманого iterable, але може бути реалізовано більш ефективно.

source: Close the write end of the transport after flushing all buffered data. Data may still be received.
uk: Закрийте кінець запису транспорту після очищення всіх буферизованих даних. Дані ще можуть бути отримані.

source: This method can raise :exc:`NotImplementedError` if the transport (e.g. SSL) doesn't support half-closed connections.
uk: Цей метод може викликати :exc:`NotImplementedError`, якщо транспорт (наприклад, SSL) не підтримує напівзакриті з’єднання.

source: Datagram Transports
uk: Транспортування дейтаграм

source: Send the *data* bytes to the remote peer given by *addr* (a transport-dependent target address). If *addr* is :const:`None`, the data is sent to the target address given on transport creation.
uk: Надішліть байти *data* до віддаленого однорангового вузла, заданого *addr* (цільова адреса, що залежить від транспорту). Якщо *addr* має значення :const:`None`, дані надсилаються на цільову адресу, указану під час створення транспорту.

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
uk: Закрийте транспорт негайно, не чекаючи завершення незавершених операцій. Буферизовані дані буде втрачено. Дані більше не надходитимуть. Метод :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` протоколу зрештою буде викликано з :const:`None` як аргумент.

source: Subprocess Transports
uk: Транспортування підпроцесів

source: Return the subprocess process id as an integer.
uk: Повертає ідентифікатор процесу підпроцесу як ціле число.

source: Return the transport for the communication pipe corresponding to the integer file descriptor *fd*:
uk: Повертає транспорт для комунікаційного каналу, що відповідає цілочисельному файловому дескриптору *fd*:

source: ``0``: readable streaming transport of the standard input (*stdin*), or :const:`None` if the subprocess was not created with ``stdin=PIPE``
uk: ``0``: доступний для читання потоковий транспорт стандартного введення (*stdin*) або :const:`None`, якщо підпроцес не було створено за допомогою ``stdin=PIPE``

source: ``1``: writable streaming transport of the standard output (*stdout*), or :const:`None` if the subprocess was not created with ``stdout=PIPE``
uk: ``1``: доступний для запису потоковий транспорт стандартного виводу (*stdout*) або :const:`None`, якщо підпроцес не було створено за допомогою ``stdout=PIPE``

source: ``2``: writable streaming transport of the standard error (*stderr*), or :const:`None` if the subprocess was not created with ``stderr=PIPE``
uk: ``2``: доступний для запису потоковий транспорт стандартної помилки (*stderr*) або :const:`None`, якщо підпроцес не було створено за допомогою ``stderr=PIPE``

source: other *fd*: :const:`None`
uk: інший *fd*: :const:`None`

source: Return the subprocess return code as an integer or :const:`None` if it hasn't returned, which is similar to the :attr:`subprocess.Popen.returncode` attribute.
uk: Повертає код повернення підпроцесу як ціле число або :const:`None`, якщо він не повернувся, що подібно до атрибута :attr:`subprocess.Popen.returncode`.

source: Kill the subprocess.
uk: Закрийте підпроцес.

source: On POSIX systems, the function sends SIGKILL to the subprocess. On Windows, this method is an alias for :meth:`terminate`.
uk: У системах POSIX функція надсилає SIGKILL підпроцесу. У Windows цей метод є псевдонімом для :meth:`terminate`.

source: See also :meth:`subprocess.Popen.kill`.
uk: Дивіться також :meth:`subprocess.Popen.kill`.

source: Send the *signal* number to the subprocess, as in :meth:`subprocess.Popen.send_signal`.
uk: Надішліть номер *сигналу* підпроцесу, як у :meth:`subprocess.Popen.send_signal`.

source: Stop the subprocess.
uk: Зупиніть підпроцес.

source: On POSIX systems, this method sends SIGTERM to the subprocess. On Windows, the Windows API function TerminateProcess() is called to stop the subprocess.
uk: У системах POSIX цей метод надсилає SIGTERM підпроцесу. У Windows для зупинки підпроцесу викликається функція Windows API TerminateProcess().

source: See also :meth:`subprocess.Popen.terminate`.
uk: Дивіться також :meth:`subprocess.Popen.terminate`.

source: Kill the subprocess by calling the :meth:`kill` method.
uk: Закрийте підпроцес, викликавши метод :meth:`kill`.

source: If the subprocess hasn't returned yet, and close transports of *stdin*, *stdout*, and *stderr* pipes.
uk: Якщо підпроцес ще не повернувся, закрийте транспорти каналів *stdin*, *stdout* і *stderr*.

source: Protocols
uk: Протоколи
