Repository: python/python-docs-uk
Catalog: library/asyncio-dev.po
Languages: uk

source: Developing with asyncio
uk: Розробка з asyncio

source: Asynchronous programming is different from classic "sequential" programming.
uk: Асинхронне програмування відрізняється від класичного "послідовного" програмування.

source: This page lists common mistakes and traps and explains how to avoid them.
uk: На цій сторінці наведено типові помилки та пастки та пояснено, як їх уникнути.

source: Debug Mode
uk: Режим налагодження

source: By default asyncio runs in production mode. In order to ease the development asyncio has a *debug mode*.
uk: За замовчуванням asyncio працює у робочому режимі. Щоб полегшити розробку, asyncio має *режим налагодження*.

source: There are several ways to enable asyncio debug mode:
uk: Є кілька способів увімкнути асинхронний режим налагодження:

source: Setting the :envvar:`PYTHONASYNCIODEBUG` environment variable to ``1``.
uk: Встановлення змінної середовища :envvar:`PYTHONASYNCIODEBUG` на ``1``.

source: Using the :ref:`Python Development Mode <devmode>`.
uk: Використання :ref:`режиму розробки Python <devmode>`.

source: Passing ``debug=True`` to :func:`asyncio.run`.
uk: Передача ``debug=True`` до :func:`asyncio.run`.

source: Calling :meth:`loop.set_debug`.
uk: Виклик :meth:`loop.set_debug`.

source: In addition to enabling the debug mode, consider also:
uk: Окрім увімкнення режиму налагодження, враховуйте також:

source: configuring the :mod:`warnings` module to display :exc:`ResourceWarning` warnings. One way of doing that is by using the :option:`-W` ``default`` command line option.
uk: налаштування модуля :mod:`warnings` для відображення попереджень :exc:`ResourceWarning`. Один із способів зробити це — скористатися параметром командного рядка :option:`-W` ``default``.

source: When the debug mode is enabled:
uk: Коли ввімкнено режим налагодження:

source: asyncio checks for :ref:`coroutines that were not awaited <asyncio-coroutine-not-scheduled>` and logs them; this mitigates the "forgotten await" pitfall.
uk: asyncio перевіряє :ref:`співпрограми, які не були очікувані <asyncio-coroutine-not-scheduled>`, і записує їх у журнал; це пом'якшує помилку "забутого очікування".

source: Many non-threadsafe asyncio APIs (such as :meth:`loop.call_soon` and :meth:`loop.call_at` methods) raise an exception if they are called from a wrong thread.
uk: Багато небезпечних для потоків асинхронних API (таких як методи :meth:`loop.call_soon` і :meth:`loop.call_at`) викликають виняток, якщо вони викликаються з неправильного потоку.

source: The execution time of the I/O selector is logged if it takes too long to perform an I/O operation.
uk: Час виконання селектора введення-виведення реєструється, якщо виконання операції введення-виведення займає надто багато часу.

source: Concurrency and Multithreading
uk: Паралельність і багатопотоковість

source: An event loop runs in a thread (typically the main thread) and executes all callbacks and Tasks in its thread. While a Task is running in the event loop, no other Tasks can run in the same thread. When a Task executes an ``await`` expression, the running Task gets suspended, and the event loop executes the next Task.
uk: Цикл подій виконується в потоці (зазвичай головному) і виконує всі зворотні виклики та завдання у своєму потоці. Поки Завдання виконується в циклі подій, жодні інші Завдання не можуть виконуватися в тому самому потоці. Коли Завдання виконує вираз ``очікування``, запущене Завдання призупиняється, а цикл подій виконує наступне Завдання.

source: To schedule a :term:`callback` from another OS thread, the :meth:`loop.call_soon_threadsafe` method should be used. Example::
uk: Щоб запланувати :term:`callback` з іншого потоку ОС, слід використовувати метод :meth:`loop.call_soon_threadsafe`. Приклад::

source: Almost all asyncio objects are not thread safe, which is typically not a problem unless there is code that works with them from outside of a Task or a callback. If there's a need for such code to call a low-level asyncio API, the :meth:`loop.call_soon_threadsafe` method should be used, e.g.::
uk: Майже всі асинхронні об’єкти не є потокобезпечними, що зазвичай не є проблемою, якщо немає коду, який працює з ними поза Завданням або зворотним викликом. Якщо існує потреба в такому коді для виклику низькорівневого асинхронного API, слід використовувати метод :meth:`loop.call_soon_threadsafe`, наприклад::

source: To schedule a coroutine object from a different OS thread, the :func:`run_coroutine_threadsafe` function should be used. It returns a :class:`concurrent.futures.Future` to access the result::
uk: Щоб запланувати об’єкт співпрограми з іншого потоку ОС, слід використати функцію :func:`run_coroutine_threadsafe`. Він повертає :class:`concurrent.futures.Future` для доступу до результату::

source: The :meth:`loop.run_in_executor` method can be used with a :class:`concurrent.futures.ThreadPoolExecutor` to execute blocking code in a different OS thread without blocking the OS thread that the event loop runs in.
uk: Метод :meth:`loop.run_in_executor` можна використовувати з :class:`concurrent.futures.ThreadPoolExecutor` для виконання коду блокування в іншому потоці ОС, не блокуючи потік ОС, у якому виконується цикл подій.

source: Running Blocking Code
uk: Запуск коду блокування

source: Blocking (CPU-bound) code should not be called directly. For example, if a function performs a CPU-intensive calculation for 1 second, all concurrent asyncio Tasks and IO operations would be delayed by 1 second.
uk: Код блокування (прив’язаний до процесора) не слід викликати безпосередньо. Наприклад, якщо функція виконує інтенсивне обчислення ЦП протягом 1 секунди, усі одночасні асинхронні завдання та операції введення-виведення будуть відкладені на 1 секунду.

source: An executor can be used to run a task in a different thread or even in a different process to avoid blocking the OS thread with the event loop. See the :meth:`loop.run_in_executor` method for more details.
uk: Виконавець можна використовувати для запуску завдання в іншому потоці або навіть в іншому процесі, щоб уникнути блокування потоку ОС за допомогою циклу подій. Додаткову інформацію див. у методі :meth:`loop.run_in_executor`.

source: Logging
uk: Лісозаготівля

source: asyncio uses the :mod:`logging` module and all logging is performed via the ``"asyncio"`` logger.
uk: asyncio використовує модуль :mod:`logging`, і все журналювання виконується через ``"asyncio"`` реєстратор.

source: Detect never-awaited coroutines
uk: Виявляти ніколи не очікувані співпрограми

source: When a coroutine function is called, but not awaited (e.g. ``coro()`` instead of ``await coro()``) or the coroutine is not scheduled with :meth:`asyncio.create_task`, asyncio will emit a :exc:`RuntimeWarning`::
uk: Коли функція співпрограми викликається, але не очікується (наприклад, ``coro()`` замість ``await coro()``) або співпрограма не запланована за допомогою :meth:`asyncio.create_task`, asyncio видасть :exc:`RuntimeWarning`::

source: Output::
uk: Вихід::

source: Output in debug mode::
uk: Вивід у режимі налагодження::

source: The usual fix is to either await the coroutine or call the :meth:`asyncio.create_task` function::
uk: Звичайним виправленням є або очікування співпрограми, або виклик функції :meth:`asyncio.create_task`::

source: Detect never-retrieved exceptions
uk: Виявлення ніколи не отриманих винятків

source: If a :meth:`Future.set_exception` is called but the Future object is never awaited on, the exception would never be propagated to the user code. In this case, asyncio would emit a log message when the Future object is garbage collected.
uk: Якщо викликається :meth:`Future.set_exception`, але об’єкт Future ніколи не очікується, виняток ніколи не поширюватиметься на код користувача. У цьому випадку asyncio створюватиме повідомлення журналу, коли об’єкт Future збиратиме сміття.

source: Example of an unhandled exception::
uk: Приклад необробленого винятку::

source: :ref:`Enable the debug mode <asyncio-debug-mode>` to get the traceback where the task was created::
uk: :ref:`Увімкніть режим налагодження <asyncio-debug-mode>`, щоб отримати відстеження місця створення завдання:
