Repository: python/python-docs-uk
Catalog: library/asyncio-sync.po
Languages: uk

source: Synchronization Primitives
uk: Примітиви синхронізації

source: **Source code:** :source:`Lib/asyncio/locks.py`
uk: **Вихідний код:** :source:`Lib/asyncio/locks.py`

source: asyncio synchronization primitives are designed to be similar to those of the :mod:`threading` module with two important caveats:
uk: Примітиви синхронізації asyncio розроблені таким чином, щоб бути подібними до модулів :mod:`threading` з двома важливими застереженнями:

source: asyncio primitives are not thread-safe, therefore they should not be used for OS thread synchronization (use :mod:`threading` for that);
uk: примітиви asyncio не є потокобезпечними, тому їх не слід використовувати для синхронізації потоків ОС (для цього використовуйте :mod:`threading`);

source: methods of these synchronization primitives do not accept the *timeout* argument; use the :func:`asyncio.wait_for` function to perform operations with timeouts.
uk: методи цих примітивів синхронізації не приймають аргумент *timeout*; використовуйте функцію :func:`asyncio.wait_for` для виконання операцій із тайм-аутами.

source: asyncio has the following basic synchronization primitives:
uk: asyncio має такі базові примітиви синхронізації:

source: Lock
uk: Замок

source: Implements a mutex lock for asyncio tasks. Not thread-safe.
uk: Реалізує блокування м'ютексу для асинхронних завдань. Небезпечно для потоків.

source: An asyncio lock can be used to guarantee exclusive access to a shared resource.
uk: Асинхронне блокування можна використовувати, щоб гарантувати ексклюзивний доступ до спільного ресурсу.

source: The preferred way to use a Lock is an :keyword:`async with` statement::
uk: Найкращим способом використання Lock є оператор :keyword:`async with`::

source: which is equivalent to::
uk: що еквівалентно::

source: Removed the *loop* parameter.
uk: Видалено параметр *loop*.

source: Acquire the lock.
uk: Придбайте замок.

source: This method waits until the lock is *unlocked*, sets it to *locked* and returns ``True``.
uk: Цей метод очікує, поки блокування буде *розблоковано*, встановлює його на *заблоковано* та повертає ``True``.

source: When more than one coroutine is blocked in :meth:`acquire` waiting for the lock to be unlocked, only one coroutine eventually proceeds.
uk: Якщо в :meth:`acquire` заблоковано більше ніж одну співпрограму, яка очікує розблокування блокування, зрештою виконується лише одна співпрограма.

source: Acquiring a lock is *fair*: the coroutine that proceeds will be the first coroutine that started waiting on the lock.
uk: Отримання блокування є *чесним*: співпрограма, яка продовжується, буде першою співпрограмою, яка почала очікувати на блокування.

source: Release the lock.
uk: Відпустіть замок.

source: When the lock is *locked*, reset it to *unlocked* and return.
uk: Коли замок *заблоковано*, скиньте його на *розблоковано* та поверніться.

source: If the lock is *unlocked*, a :exc:`RuntimeError` is raised.
uk: Якщо блокування *розблоковано*, виникає :exc:`RuntimeError`.

source: Return ``True`` if the lock is *locked*.
uk: Повертає ``True``, якщо блокування *заблоковано*.

source: Event
uk: Подія

source: An event object. Not thread-safe.
uk: Об'єкт події. Небезпечно для потоків.

source: An asyncio event can be used to notify multiple asyncio tasks that some event has happened.
uk: Асинхронну подію можна використовувати для сповіщення кількох асинхронних завдань про те, що сталася якась подія.

source: An Event object manages an internal flag that can be set to *true* with the :meth:`~Event.set` method and reset to *false* with the :meth:`clear` method. The :meth:`~Event.wait` method blocks until the flag is set to *true*. The flag is set to *false* initially.
uk: Об’єкт Event керує внутрішнім прапором, який можна встановити на *true* за допомогою методу :meth:`~Event.set` і скинути на *false* за допомогою методу :meth:`clear`. Метод :meth:`~Event.wait` блокується, доки прапор не буде встановлено на *true*. Спочатку для прапора встановлено значення *false*.

source: Example::
uk: Приклад::

source: Wait until the event is set.
uk: Дочекайтеся встановлення події.

source: If the event is set, return ``True`` immediately. Otherwise block until another task calls :meth:`~Event.set`.
uk: Якщо подія встановлена, негайно поверніть ``True``. Інакше заблокуйте, доки інше завдання не викличе :meth:`~Event.set`.

source: Set the event.
uk: Встановити подію.

source: All tasks waiting for event to be set will be immediately awakened.
uk: Усі завдання, які очікують встановлення події, будуть негайно активовані.

source: Clear (unset) the event.
uk: Очистити (скасувати) подію.

source: Tasks awaiting on :meth:`~Event.wait` will now block until the :meth:`~Event.set` method is called again.
uk: Завдання, що очікують на :meth:`~Event.wait`, тепер блокуватимуться, доки метод :meth:`~Event.set` не буде викликано знову.

source: Return ``True`` if the event is set.
uk: Повертає ``True``, якщо подія встановлена.

source: Condition
uk: Хвороба

source: A Condition object. Not thread-safe.
uk: Об’єкт Condition. Небезпечно для потоків.

source: An asyncio condition primitive can be used by a task to wait for some event to happen and then get exclusive access to a shared resource.
uk: Примітив асинхронної умови може використовуватися завданням для очікування настання певної події та отримання ексклюзивного доступу до спільного ресурсу.

source: In essence, a Condition object combines the functionality of an :class:`Event` and a :class:`Lock`. It is possible to have multiple Condition objects share one Lock, which allows coordinating exclusive access to a shared resource between different tasks interested in particular states of that shared resource.
uk: По суті, об’єкт Condition поєднує функціональні можливості :class:`Event` і :class:`Lock`. Кілька об’єктів Condition можуть використовувати один Lock, що дозволяє координувати ексклюзивний доступ до спільного ресурсу між різними завданнями, зацікавленими в певних станах цього спільного ресурсу.

source: The optional *lock* argument must be a :class:`Lock` object or ``None``. In the latter case a new Lock object is created automatically.
uk: Додатковий аргумент *lock* має бути об’єктом :class:`Lock` або ``None``. В останньому випадку новий об’єкт Lock створюється автоматично.

source: The preferred way to use a Condition is an :keyword:`async with` statement::
uk: Найкращим способом використання умови є оператор :keyword:`async with`::

source: Acquire the underlying lock.
uk: Отримайте основний замок.

source: This method waits until the underlying lock is *unlocked*, sets it to *locked* and returns ``True``.
uk: Цей метод чекає, доки базове блокування *розблокується*, встановлює його на *locked* і повертає ``True``.

source: The lock must be acquired before this method is called and released shortly after. If called with an *unlocked* lock a :exc:`RuntimeError` error is raised.
uk: Блокування має бути отримано перед викликом цього методу та звільнено незабаром після цього. У разі виклику з *розблокованим* блокуванням виникає помилка :exc:`RuntimeError`.

source: Return ``True`` if the underlying lock is acquired.
uk: Повертає ``True``, якщо основне блокування отримано.

source: Wake up all tasks waiting on this condition.
uk: Розбудіть усі завдання, що очікують за цієї умови.

source: This method acts like :meth:`notify`, but wakes up all waiting tasks.
uk: Цей метод діє як :meth:`notify`, але активує всі завдання, що очікують.

source: Release the underlying lock.
uk: Звільніть базовий замок.

source: When invoked on an unlocked lock, a :exc:`RuntimeError` is raised.
uk: Під час виклику для розблокованого блокування виникає :exc:`RuntimeError`.

source: Wait until notified.
uk: Дочекайтеся повідомлення.

source: If the calling task has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
uk: Якщо завдання, що викликає, не отримало блокування під час виклику цього методу, виникає :exc:`RuntimeError`.

source: This method releases the underlying lock, and then blocks until it is awakened by a :meth:`notify` or :meth:`notify_all` call. Once awakened, the Condition re-acquires its lock and this method returns ``True``.
uk: Цей метод знімає основне блокування, а потім блокує, доки його не розбудить виклик :meth:`notify` або :meth:`notify_all`. Після пробудження умова знову блокується, і цей метод повертає ``True``.

source: Wait until a predicate becomes *true*.
uk: Зачекайте, поки предикат стане *true*.

source: Semaphore
uk: Семафор

source: A Semaphore object. Not thread-safe.
uk: Об'єкт Semaphore. Небезпечно для потоків.

source: A semaphore manages an internal counter which is decremented by each :meth:`acquire` call and incremented by each :meth:`release` call. The counter can never go below zero; when :meth:`acquire` finds that it is zero, it blocks, waiting until some task calls :meth:`release`.
uk: Семафор керує внутрішнім лічильником, який зменшується при кожному виклику :meth:`acquire` і збільшується при кожному виклику :meth:`release`. Лічильник ніколи не може опускатися нижче нуля; коли :meth:`acquire` виявляє, що він дорівнює нулю, він блокується, чекаючи, поки якесь завдання викличе :meth:`release`.

source: The optional *value* argument gives the initial value for the internal counter (``1`` by default). If the given value is less than ``0`` a :exc:`ValueError` is raised.
uk: Необов’язковий аргумент *value* дає початкове значення для внутрішнього лічильника (``1`` за замовчуванням). Якщо вказане значення менше ніж ``0``, виникає :exc:`ValueError`.

source: The preferred way to use a Semaphore is an :keyword:`async with` statement::
uk: Кращим способом використання семафора є оператор :keyword:`async with`::

source: Acquire a semaphore.
uk: Придбайте семафор.

source: If the internal counter is greater than zero, decrement it by one and return ``True`` immediately. If it is zero, wait until a :meth:`release` is called and return ``True``.
uk: Якщо внутрішній лічильник більший за нуль, зменште його на одиницю та негайно поверніть ``True``. Якщо він дорівнює нулю, дочекайтеся виклику :meth:`release` і поверніть ``True``.

source: Returns ``True`` if semaphore can not be acquired immediately.
uk: Повертає ``True``, якщо семафор не може бути отриманий негайно.

source: Release a semaphore, incrementing the internal counter by one. Can wake up a task waiting to acquire the semaphore.
uk: Відпустіть семафор, збільшивши внутрішній лічильник на одиницю. Може розбудити завдання, яке очікує отримання семафора.

source: Unlike :class:`BoundedSemaphore`, :class:`Semaphore` allows making more ``release()`` calls than ``acquire()`` calls.
uk: На відміну від :class:`BoundedSemaphore`, :class:`Semaphore` дозволяє робити більше викликів ``release()``, ніж викликів ``acquire()``.

source: BoundedSemaphore
uk: Обмежений семафор

source: A bounded semaphore object. Not thread-safe.
uk: Обмежений семафорний об’єкт. Небезпечно для потоків.

source: Bounded Semaphore is a version of :class:`Semaphore` that raises a :exc:`ValueError` in :meth:`~Semaphore.release` if it increases the internal counter above the initial *value*.
uk: Обмежений семафор — це версія :class:`Semaphore`, яка викликає :exc:`ValueError` у :meth:`~Semaphore.release`, якщо він збільшує внутрішній лічильник вище початкового *значення*.

source: A boolean that is ``True`` if the barrier is in the broken state.
uk: Логічне значення, яке має значення ``True``, якщо бар’єр знаходиться в зламаному стані.

source: This exception, a subclass of :exc:`RuntimeError`, is raised when the :class:`Barrier` object is reset or broken.
uk: Цей виняток, підклас :exc:`RuntimeError`, виникає, коли об’єкт :class:`Barrier` скидається або зламано.

source: Acquiring a lock using ``await lock`` or ``yield from lock`` and/or :keyword:`with` statement (``with await lock``, ``with (yield from lock)``) was removed. Use ``async with lock`` instead.
uk: Отримання блокування за допомогою оператора ``await lock`` або ``yield from lock`` та/або :keyword:`with` (``with await lock``, ``with (yield from lock)``) було видалено . Натомість використовуйте ``async with lock``.
