Repository: python/python-docs-uk
Catalog: library/asyncio.po
Languages: uk

source: High-level APIs
uk: API високого рівня

source: Low-level APIs
uk: Низькорівневі API

source: Guides and Tutorials
uk: Посібники та підручники

source: asyncio is a library to write **concurrent** code using the **async/await** syntax.
uk: asyncio — це бібліотека для написання **паралельного** коду за допомогою синтаксису **async/await**.

source: asyncio is used as a foundation for multiple Python asynchronous frameworks that provide high-performance network and web-servers, database connection libraries, distributed task queues, etc.
uk: asyncio використовується як основа для багатьох асинхронних фреймворків Python, які забезпечують високопродуктивні мережеві та веб-сервери, бібліотеки підключення до бази даних, розподілені черги завдань тощо.

source: asyncio is often a perfect fit for IO-bound and high-level **structured** network code.
uk: asyncio часто ідеально підходить для високорівневого **структурованого** мережевого коду.

source: asyncio provides a set of **high-level** APIs to:
uk: asyncio пропонує набір **високорівневого** API для:

source: :ref:`run Python coroutines <coroutine>` concurrently and have full control over their execution;
uk: :ref:`запускати співпрограми Python <coroutine>` одночасно та мати повний контроль над їх виконанням;

source: perform :ref:`network IO and IPC <asyncio-streams>`;
uk: виконувати :ref:`мережевий IO та IPC <asyncio-streams>`;

source: control :ref:`subprocesses <asyncio-subprocess>`;
uk: керування :ref:`підпроцесами <asyncio-subprocess>`;

source: distribute tasks via :ref:`queues <asyncio-queues>`;
uk: розподіляти завдання через :ref:`черги <asyncio-queues>`;

source: :ref:`synchronize <asyncio-sync>` concurrent code;
uk: :ref:`синхронізувати <asyncio-sync>` конкурентний код;

source: Additionally, there are **low-level** APIs for *library and framework developers* to:
uk: Також існують **низькорівневі** API для *розробників бібліотек і фреймворків*, щоб:

source: implement efficient protocols using :ref:`transports <asyncio-transports-protocols>`;
uk: реалізувати ефективні протоколи за допомогою :ref:`transports <asyncio-transports-protocols>`;

source: :ref:`bridge <asyncio-futures>` callback-based libraries and code with async/await syntax.
uk: :ref:`bridge <asyncio-futures>` бібліотеки зворотного виклику та код із синтаксисом async/await.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_stdin`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_stdin`` без аргументів.

source: Reference
uk: Посилання

source: The source code for asyncio can be found in :source:`Lib/asyncio/`.
uk: Вихідний код для asyncio можна знайти в :source:`Lib/asyncio/`.
