Repository: python/python-docs-uk
Catalog: library/asyncio-future.po
Languages: uk

source: Futures
uk: Ф'ючерси

source: **Source code:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`
uk: **Вихідний код:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`

source: *Future* objects are used to bridge **low-level callback-based code** with high-level async/await code.
uk: Об’єкти *Future* використовуються для з’єднання **низькорівневого коду на основі зворотного виклику** з високорівневим асинхронним кодом/кодом очікування.

source: Future Functions
uk: Майбутні функції

source: Return ``True`` if *obj* is either of:
uk: Повертає ``True``, якщо *obj* є одним із:

source: an instance of :class:`asyncio.Future`,
uk: екземпляр :class:`asyncio.Future`,

source: an instance of :class:`asyncio.Task`,
uk: екземпляр :class:`asyncio.Task`,

source: a Future-like object with a ``_asyncio_future_blocking`` attribute.
uk: Future-подібний об’єкт з атрибутом ``_asyncio_future_blocking``.

source: Return:
uk: Повернення:

source: *obj* argument as is, if *obj* is a :class:`Future`, a :class:`Task`, or a Future-like object (:func:`isfuture` is used for the test.)
uk: Аргумент *obj* як є, якщо *obj* є :class:`Future`, :class:`Task` або Future-подібним об’єктом (:func:`isfuture` використовується для перевірки.)

source: a :class:`Task` object wrapping *obj*, if *obj* is a coroutine (:func:`iscoroutine` is used for the test); in this case the coroutine will be scheduled by ``ensure_future()``.
uk: об’єкт :class:`Task`, що обгортає *obj*, якщо *obj* є співпрограмою (для тесту використовується :func:`iscoroutine`); у цьому випадку співпрограма буде запланована ``ensure_future()``.

source: a :class:`Task` object that would await on *obj*, if *obj* is an awaitable (:func:`inspect.isawaitable` is used for the test.)
uk: об’єкт :class:`Task`, який очікуватиме на *obj*, якщо *obj* є очікуваним (:func:`inspect.isawaitable` використовується для тесту.)

source: If *obj* is neither of the above a :exc:`TypeError` is raised.
uk: Якщо *obj* не є жодним із наведених вище, виникає :exc:`TypeError`.

source: See also the :func:`create_task` function which is the preferred way for creating new Tasks.
uk: Дивіться також функцію :func:`create_task`, яка є кращим способом створення нових завдань.

source: Save a reference to the result of this function, to avoid a task disappearing mid execution.
uk: Збережіть посилання на результат цієї функції, щоб уникнути зникнення завдання під час виконання.

source: The function accepts any :term:`awaitable` object.
uk: Функція приймає будь-який об’єкт :term:`awaitable`.

source: Deprecation warning is emitted if *obj* is not a Future-like object and *loop* is not specified and there is no running event loop.
uk: Якщо *obj* не є Future-подібним об’єктом і *loop* не вказано, і цикл подій не виконується, видається попередження про застаріле.

source: Wrap a :class:`concurrent.futures.Future` object in a :class:`asyncio.Future` object.
uk: Загорніть об’єкт :class:`concurrent.futures.Future` в об’єкт :class:`asyncio.Future`.

source: Deprecation warning is emitted if *future* is not a Future-like object and *loop* is not specified and there is no running event loop.
uk: Якщо *future* не є об’єктом, схожим на Future, і *loop* не вказано, і немає запущеного циклу подій, видається попередження про застаріння.

source: Future Object
uk: Майбутній об'єкт

source: A Future represents an eventual result of an asynchronous operation. Not thread-safe.
uk: Future представляє кінцевий результат асинхронної операції. Небезпечно для потоків.

source: Future is an :term:`awaitable` object. Coroutines can await on Future objects until they either have a result or an exception set, or until they are cancelled.
uk: Future — це об'єкт :term:`awaitable`. Співпрограми можуть очікувати на об’єктах Future, доки для них не буде отримано результат або встановлено виняток, або поки їх не буде скасовано.

source: Typically Futures are used to enable low-level callback-based code (e.g. in protocols implemented using asyncio :ref:`transports <asyncio-transports-protocols>`) to interoperate with high-level async/await code.
uk: Зазвичай ф’ючерси використовуються, щоб увімкнути низькорівневий код на основі зворотного виклику (наприклад, у протоколах, реалізованих за допомогою asyncio :ref:`transports <asyncio-transports-protocols>`) для взаємодії з високорівневим асинхронним кодом/кодом очікування.

source: The rule of thumb is to never expose Future objects in user-facing APIs, and the recommended way to create a Future object is to call :meth:`loop.create_future`. This way alternative event loop implementations can inject their own optimized implementations of a Future object.
uk: Емпіричне правило полягає в тому, щоб ніколи не показувати об’єкти Future в призначених для користувача API, а рекомендований спосіб створити об’єкт Future – це викликати :meth:`loop.create_future`. Таким чином альтернативні реалізації циклу подій можуть вводити власні оптимізовані реалізації об’єкта Future.

source: Added support for the :mod:`contextvars` module.
uk: Додано підтримку модуля :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
uk: Якщо *loop* не вказано і немає запущеного циклу подій, видається попередження про застаріле.

source: Return the result of the Future.
uk: Повернути результат Future.

source: If the Future is *done* and has a result set by the :meth:`set_result` method, the result value is returned.
uk: Якщо Future *done* і має результат, встановлений методом :meth:`set_result`, повертається значення результату.

source: If the Future is *done* and has an exception set by the :meth:`set_exception` method, this method raises the exception.
uk: Якщо Future *done* і має виняток, встановлений методом :meth:`set_exception`, цей метод викликає виняток.

source: If the Future has been *cancelled*, this method raises a :exc:`CancelledError` exception.
uk: Якщо Future було *скасовано*, цей метод викликає виняток :exc:`CancelledError`.

source: If the Future's result isn't yet available, this method raises a :exc:`InvalidStateError` exception.
uk: Якщо результат Future ще недоступний, цей метод викликає виняток :exc:`InvalidStateError`.

source: Mark the Future as *done* and set its result.
uk: Позначте майбутнє як *виконане* та встановіть його результат.

source: Raises a :exc:`InvalidStateError` error if the Future is already *done*.
uk: Викликає помилку :exc:`InvalidStateError`, якщо Future вже *виконано*.

source: Mark the Future as *done* and set an exception.
uk: Позначте майбутнє як *готове* та встановіть виняток.

source: Return ``True`` if the Future is *done*.
uk: Повертає ``True``, якщо Future *done*.

source: A Future is *done* if it was *cancelled* or if it has a result or an exception set with :meth:`set_result` or :meth:`set_exception` calls.
uk: Майбутнє вважається *виконаним*, якщо його було *скасовано* або якщо він має результат чи виняток, встановлений за допомогою викликів :meth:`set_result` або :meth:`set_exception`.

source: Return ``True`` if the Future was *cancelled*.
uk: Повертає ``True``, якщо Future було *скасовано*.

source: The method is usually used to check if a Future is not *cancelled* before setting a result or an exception for it::
uk: Метод зазвичай використовується, щоб перевірити, чи Future не *скасовано* перед встановленням результату або винятку для нього::

source: Add a callback to be run when the Future is *done*.
uk: Додайте зворотний виклик, який буде запущено, коли Майбутнє *зроблено*.

source: The *callback* is called with the Future object as its only argument.
uk: *Зворотний виклик* викликається з об’єктом Future як єдиним аргументом.

source: If the Future is already *done* when this method is called, the callback is scheduled with :meth:`loop.call_soon`.
uk: Якщо Future вже *done* під час виклику цього методу, зворотний виклик планується за допомогою :meth:`loop.call_soon`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
uk: Необов’язковий аргумент *context*, що містить лише ключове слово, дозволяє вказати спеціальний :class:`contextvars.Context` для виконання *зворотного виклику*. Поточний контекст використовується, якщо *контексту* не надано.

source: :func:`functools.partial` can be used to pass parameters to the callback, e.g.::
uk: :func:`functools.partial` можна використовувати для передачі параметрів зворотному виклику, наприклад::

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
uk: Додано параметр *context* тільки для ключового слова. Дивіться :pep:`567` для більш детальної інформації.

source: Remove *callback* from the callbacks list.
uk: Видалити *callback* зі списку зворотних викликів.

source: Returns the number of callbacks removed, which is typically 1, unless a callback was added more than once.
uk: Повертає кількість видалених зворотних викликів, яка зазвичай дорівнює 1, якщо зворотний виклик не було додано кілька разів.

source: Cancel the Future and schedule callbacks.
uk: Скасувати майбутнє та запланувати зворотні виклики.

source: If the Future is already *done* or *cancelled*, return ``False``. Otherwise, change the Future's state to *cancelled*, schedule the callbacks, and return ``True``.
uk: Якщо Future вже *виконано* або *скасовано*, поверніть ``False``. В іншому випадку змініть стан Future на *cancelled*, заплануйте зворотні виклики та поверніть ``True``.

source: Added the *msg* parameter.
uk: Додано параметр *msg*.

source: Return the exception that was set on this Future.
uk: Повертає виняток, встановлений для цього Future.

source: The exception (or ``None`` if no exception was set) is returned only if the Future is *done*.
uk: Виняток (або ``None``, якщо виключення не було встановлено) повертається, лише якщо Future *done*.

source: If the Future isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
uk: Якщо Future ще не *зроблено*, цей метод викликає виняток :exc:`InvalidStateError`.

source: Return the event loop the Future object is bound to.
uk: Повертає цикл подій, до якого прив’язаний об’єкт Future.

source: This example creates a Future object, creates and schedules an asynchronous Task to set result for the Future, and waits until the Future has a result::
uk: У цьому прикладі створюється об’єкт Future, створюється та планується асинхронне завдання для встановлення результату для Future та очікується, доки Future не отримає результат::

source: The Future object was designed to mimic :class:`concurrent.futures.Future`. Key differences include:
uk: Об’єкт Future був розроблений для імітації :class:`concurrent.futures.Future`. Основні відмінності:

source: unlike asyncio Futures, :class:`concurrent.futures.Future` instances cannot be awaited.
uk: на відміну від asyncio Futures, екземпляри :class:`concurrent.futures.Future` не можна чекати.

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` do not accept the *timeout* argument.
uk: :meth:`asyncio.Future.result` і :meth:`asyncio.Future.exception` не приймають аргумент *timeout*.

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` raise an :exc:`InvalidStateError` exception when the Future is not *done*.
uk: :meth:`asyncio.Future.result` і :meth:`asyncio.Future.exception` викликають виняток :exc:`InvalidStateError`, коли Future не *виконано*.

source: Callbacks registered with :meth:`asyncio.Future.add_done_callback` are not called immediately. They are scheduled with :meth:`loop.call_soon` instead.
uk: Зворотні виклики, зареєстровані за допомогою :meth:`asyncio.Future.add_done_callback`, не викликаються негайно. Натомість вони плануються за допомогою :meth:`loop.call_soon`.

source: asyncio Future is not compatible with the :func:`concurrent.futures.wait` and :func:`concurrent.futures.as_completed` functions.
uk: asyncio Future несумісний із функціями :func:`concurrent.futures.wait` і :func:`concurrent.futures.as_completed`.

source: :meth:`asyncio.Future.cancel` accepts an optional ``msg`` argument, but :func:`concurrent.futures.cancel` does not.
uk: :meth:`asyncio.Future.cancel` приймає необов’язковий аргумент ``msg``, але :func:`concurrent.futures.cancel` не приймає.
