Repository: python/python-docs-uk
Catalog: library/asyncio-protocol.po
Languages: uk

source: **Source code:** :source:`Lib/asyncio/protocols.py`
uk: **Вихідний код:** :source:`Lib/asyncio/protocols.py`

source: asyncio provides a set of abstract base classes that should be used to implement network protocols. Those classes are meant to be used together with :ref:`transports <asyncio-transport>`.
uk: asyncio надає набір абстрактних базових класів, які слід використовувати для реалізації мережевих протоколів. Ці класи призначені для використання разом із :ref:`transports <asyncio-transport>`.

source: Subclasses of abstract base protocol classes may implement some or all methods. All these methods are callbacks: they are called by transports on certain events, for example when some data is received. A base protocol method should be called by the corresponding transport.
uk: Підкласи абстрактних базових класів протоколу можуть реалізовувати деякі або всі методи. Усі ці методи є зворотними викликами: вони викликаються транспортами під час певних подій, наприклад, коли надходять якісь дані. Метод базового протоколу має викликатися відповідним транспортом.

source: Base Protocols
uk: Базові протоколи

source: Base protocol with methods that all protocols share.
uk: Базовий протокол із методами, які використовують усі протоколи.

source: The base class for implementing streaming protocols (TCP, Unix sockets, etc).
uk: Базовий клас для реалізації потокових протоколів (TCP, Unix-сокети тощо).

source: A base class for implementing streaming protocols with manual control of the receive buffer.
uk: Базовий клас для реалізації потокових протоколів із ручним керуванням приймальним буфером.

source: The base class for implementing datagram (UDP) protocols.
uk: Базовий клас для реалізації протоколів дейтаграм (UDP).

source: The base class for implementing protocols communicating with child processes (unidirectional pipes).
uk: Базовий клас для реалізації протоколів, що спілкуються з дочірніми процесами (односпрямовані канали).

source: Base Protocol
uk: Базовий протокол

source: All asyncio protocols can implement Base Protocol callbacks.
uk: Усі асинхронні протоколи можуть реалізовувати зворотні виклики базового протоколу.

source: Connection Callbacks
uk: Зворотні виклики підключення

source: Connection callbacks are called on all protocols, exactly once per a successful connection. All other protocol callbacks can only be called between those two methods.
uk: Зворотні виклики підключення викликаються для всіх протоколів рівно один раз за успішне підключення. Усі інші зворотні виклики протоколу можна викликати лише між цими двома методами.

source: Called when a connection is made.
uk: Викликається, коли встановлено з'єднання.

source: The *transport* argument is the transport representing the connection. The protocol is responsible for storing the reference to its transport.
uk: Аргумент *transport* — це транспорт, що представляє з’єднання. Протокол відповідає за збереження посилання на свій транспорт.

source: Called when the connection is lost or closed.
uk: Викликається, коли з'єднання втрачено або закрито.

source: The argument is either an exception object or :const:`None`. The latter means a regular EOF is received, or the connection was aborted or closed by this side of the connection.
uk: Аргументом є або об’єкт винятку, або :const:`None`. Останнє означає, що отримано звичайний EOF, або з’єднання було перервано чи закрито цією стороною з’єднання.

source: Flow Control Callbacks
uk: Зворотні виклики керування потоком

source: Flow control callbacks can be called by transports to pause or resume writing performed by the protocol.
uk: Зворотні виклики керування потоком можуть бути викликані транспортами, щоб призупинити або відновити запис, який виконується протоколом.

source: See the documentation of the :meth:`~WriteTransport.set_write_buffer_limits` method for more details.
uk: Додаткову інформацію дивіться в документації методу :meth:`~WriteTransport.set_write_buffer_limits`.

source: Called when the transport's buffer goes over the high watermark.
uk: Викликається, коли транспортний буфер переходить верхній водяний знак.

source: Called when the transport's buffer drains below the low watermark.
uk: Викликається, коли транспортний буфер закінчується нижче низького водяного знака.

source: If the buffer size equals the high watermark, :meth:`~BaseProtocol.pause_writing` is not called: the buffer size must go strictly over.
uk: Якщо розмір буфера дорівнює верхньому водяному знаку, :meth:`~BaseProtocol.pause_writing` не викликається: розмір буфера має суворо перевищувати.

source: Conversely, :meth:`~BaseProtocol.resume_writing` is called when the buffer size is equal or lower than the low watermark. These end conditions are important to ensure that things go as expected when either mark is zero.
uk: І навпаки, :meth:`~BaseProtocol.resume_writing` викликається, коли розмір буфера дорівнює або менше ніж нижній водяний знак. Ці кінцеві умови важливі для забезпечення того, щоб усе відбувалося так, як очікувалося, коли будь-яка позначка дорівнює нулю.

source: Streaming Protocols
uk: Протоколи потокової передачі

source: Event methods, such as :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe`, and :meth:`loop.connect_write_pipe` accept factories that return streaming protocols.
uk: Методи подій, такі як :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe` і :meth:`loop.connect_write_pipe` приймають фабрики, які повертають потокові протоколи.

source: Called when some data is received. *data* is a non-empty bytes object containing the incoming data.
uk: Викликається при отриманні деяких даних. *data* — це об’єкт із непорожніми байтами, що містить вхідні дані.

source: Whether the data is buffered, chunked or reassembled depends on the transport. In general, you shouldn't rely on specific semantics and instead make your parsing generic and flexible. However, data is always received in the correct order.
uk: Від транспортування залежить, чи будуть дані буферизовані, фрагментовані чи повторно зібрані. Загалом, вам не слід покладатися на конкретну семантику, а натомість робити аналіз загальним і гнучким. Однак дані завжди надходять у правильному порядку.

source: The method can be called an arbitrary number of times while a connection is open.
uk: Метод можна викликати довільну кількість разів, поки з’єднання відкрито.

source: However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once. Once `eof_received()` is called, ``data_received()`` is not called anymore.
uk: Однак :meth:`protocol.eof_received() <Protocol.eof_received>` викликається щонайбільше один раз. Після виклику `eof_received()` ``data_received()`` більше не викликається.

source: Called when the other end signals it won't send any more data (for example by calling :meth:`transport.write_eof() <WriteTransport.write_eof>`, if the other end also uses asyncio).
uk: Викликається, коли інший кінець сигналізує, що більше не надсилатиме даних (наприклад, викликом :meth:`transport.write_eof() <WriteTransport.write_eof>`, якщо інший кінець також використовує asyncio).

source: This method may return a false value (including ``None``), in which case the transport will close itself. Conversely, if this method returns a true value, the protocol used determines whether to close the transport. Since the default implementation returns ``None``, it implicitly closes the connection.
uk: Цей метод може повернути хибне значення (включаючи ``None``), у цьому випадку транспорт закриється сам. І навпаки, якщо цей метод повертає істинне значення, протокол, який використовується, визначає, чи закривати транспорт. Оскільки реалізація за замовчуванням повертає ``None``, вона неявно закриває з’єднання.

source: Some transports, including SSL, don't support half-closed connections, in which case returning true from this method will result in the connection being closed.
uk: Деякі транспортні засоби, включно з SSL, не підтримують напівзакриті з’єднання, і в цьому випадку повернення true з цього методу призведе до закриття з’єднання.

source: State machine:
uk: Державна машина:

source: Buffered Streaming Protocols
uk: Буферизовані потокові протоколи

source: Buffered Protocols can be used with any event loop method that supports `Streaming Protocols`_.
uk: Буферизовані протоколи можна використовувати з будь-яким методом циклу подій, який підтримує `Streaming Protocols`_.

source: ``BufferedProtocol`` implementations allow explicit manual allocation and control of the receive buffer. Event loops can then use the buffer provided by the protocol to avoid unnecessary data copies. This can result in noticeable performance improvement for protocols that receive big amounts of data. Sophisticated protocol implementations can significantly reduce the number of buffer allocations.
uk: Реалізації ``BufferedProtocol`` дозволяють явно вручну розподіляти та контролювати буфер отримання. Потім цикли подій можуть використовувати буфер, наданий протоколом, щоб уникнути непотрібних копій даних. Це може призвести до помітного підвищення продуктивності для протоколів, які отримують великі обсяги даних. Складні реалізації протоколів можуть значно зменшити кількість розподілів буферів.

source: The following callbacks are called on :class:`BufferedProtocol` instances:
uk: Наступні зворотні виклики викликаються в екземплярах :class:`BufferedProtocol`:

source: Called to allocate a new receive buffer.
uk: Викликається для виділення нового буфера отримання.

source: *sizehint* is the recommended minimum size for the returned buffer. It is acceptable to return smaller or larger buffers than what *sizehint* suggests. When set to -1, the buffer size can be arbitrary. It is an error to return a buffer with a zero size.
uk: *sizehint* — рекомендований мінімальний розмір для поверненого буфера. Дозволено повертати менші або більші буфери, ніж пропонує *sizehint*. Якщо встановлено значення -1, розмір буфера може бути довільним. Помилкою є повернення буфера з нульовим розміром.

source: ``get_buffer()`` must return an object implementing the :ref:`buffer protocol <bufferobjects>`.
uk: ``get_buffer()`` має повертати об’єкт, що реалізує :ref:`протокол буфера <bufferobjects>`.

source: Called when the buffer was updated with the received data.
uk: Викликається, коли буфер оновлюється отриманими даними.

source: *nbytes* is the total number of bytes that were written to the buffer.
uk: *nbytes* — це загальна кількість байтів, які були записані в буфер.

source: See the documentation of the :meth:`protocol.eof_received() <Protocol.eof_received>` method.
uk: Перегляньте документацію методу :meth:`protocol.eof_received() <Protocol.eof_received>`.

source: :meth:`~BufferedProtocol.get_buffer` can be called an arbitrary number of times during a connection. However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once and, if called, :meth:`~BufferedProtocol.get_buffer` and :meth:`~BufferedProtocol.buffer_updated` won't be called after it.
uk: :meth:`~BufferedProtocol.get_buffer` можна викликати довільну кількість разів під час з’єднання. Однак :meth:`protocol.eof_received() <Protocol.eof_received>` викликається щонайбільше один раз, і, якщо буде викликано, :meth:`~BufferedProtocol.get_buffer` і :meth:`~BufferedProtocol.buffer_updated` не будуть викликатися після нього.

source: Datagram Protocols
uk: Протоколи дейтаграм

source: Datagram Protocol instances should be constructed by protocol factories passed to the :meth:`loop.create_datagram_endpoint` method.
uk: Екземпляри протоколу дейтаграм мають бути створені фабриками протоколів, переданими в метод :meth:`loop.create_datagram_endpoint`.

source: Called when a datagram is received. *data* is a bytes object containing the incoming data. *addr* is the address of the peer sending the data; the exact format depends on the transport.
uk: Викликається, коли отримано дейтаграму. *data* — це об’єкт bytes, що містить вхідні дані. *addr* — це адреса вузла, який надсилає дані; точний формат залежить від транспорту.

source: Called when a previous send or receive operation raises an :class:`OSError`. *exc* is the :class:`OSError` instance.
uk: Викликається, коли попередня операція надсилання чи отримання викликає :class:`OSError`. *exc* — це екземпляр :class:`OSError`.

source: This method is called in rare conditions, when the transport (e.g. UDP) detects that a datagram could not be delivered to its recipient. In many conditions though, undeliverable datagrams will be silently dropped.
uk: Цей метод викликається в рідкісних випадках, коли транспорт (наприклад, UDP) виявляє, що дейтаграму не вдалося доставити одержувачу. Однак у багатьох випадках дейтаграми, які неможливо доставити, будуть мовчки видалені.

source: On BSD systems (macOS, FreeBSD, etc.) flow control is not supported for datagram protocols, because there is no reliable way to detect send failures caused by writing too many packets.
uk: У системах BSD (macOS, FreeBSD тощо) керування потоком не підтримується для протоколів дейтаграм, оскільки немає надійного способу виявити помилки надсилання, спричинені записом занадто великої кількості пакетів.

source: The socket always appears 'ready' and excess packets are dropped. An :class:`OSError` with ``errno`` set to :const:`errno.ENOBUFS` may or may not be raised; if it is raised, it will be reported to :meth:`DatagramProtocol.error_received` but otherwise ignored.
uk: Сокет завжди виглядає "готовим", а зайві пакети відкидаються. Помилка :class:`OSEror` з ``errno`` встановленим на :const:`errno.ENOBUFS` може виникати або не виникати; якщо воно піднято, про це буде повідомлено :meth:`DatagramProtocol.error_received`, але в інших випадках воно буде проігноровано.

source: Subprocess Protocols
uk: Протоколи підпроцесів

source: Subprocess Protocol instances should be constructed by protocol factories passed to the :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
uk: Екземпляри протоколу підпроцесу мають бути створені фабриками протоколів, переданими методам :meth:`loop.subprocess_exec` і :meth:`loop.subprocess_shell`.

source: Called when the child process writes data into its stdout or stderr pipe.
uk: Викликається, коли дочірній процес записує дані в канал stdout або stderr.

source: *fd* is the integer file descriptor of the pipe.
uk: *fd* — цілочисельний файловий дескриптор каналу.

source: *data* is a non-empty bytes object containing the received data.
uk: *data* — об’єкт із непорожніми байтами, що містить отримані дані.

source: Called when one of the pipes communicating with the child process is closed.
uk: Викликається, коли одна з труб, що спілкуються з дочірнім процесом, закрита.

source: *fd* is the integer file descriptor that was closed.
uk: *fd* — цілочисельний файловий дескриптор, який було закрито.

source: Called when the child process has exited.
uk: Викликається, коли дочірній процес завершився.

source: Examples
uk: Приклади

source: Create a TCP echo server using the :meth:`loop.create_server` method, send back received data, and close the connection::
uk: Створіть TCP-сервер ехо за допомогою методу :meth:`loop.create_server`, надішліть назад отримані дані та закрийте з’єднання::

source: The :ref:`TCP echo server using streams <asyncio-tcp-echo-server-streams>` example uses the high-level :func:`asyncio.start_server` function.
uk: У прикладі :ref:`TCP echo server using streams <asyncio-tcp-echo-server-streams>` використовується функція :func:`asyncio.start_server` високого рівня.

source: A TCP echo client using the :meth:`loop.create_connection` method, sends data, and waits until the connection is closed::
uk: TCP-клієнт відлуння, використовуючи метод :meth:`loop.create_connection`, надсилає дані та чекає, доки з’єднання не буде закрито::

source: The :ref:`TCP echo client using streams <asyncio-tcp-echo-client-streams>` example uses the high-level :func:`asyncio.open_connection` function.
uk: У прикладі :ref:`TCP echo client using streams <asyncio-tcp-echo-client-streams>` використовується функція :func:`asyncio.open_connection` високого рівня.

source: UDP Echo Server
uk: Сервер UDP Echo

source: A UDP echo server, using the :meth:`loop.create_datagram_endpoint` method, sends back received data::
uk: Ехо-сервер UDP за допомогою методу :meth:`loop.create_datagram_endpoint` повертає отримані дані:

source: A UDP echo client, using the :meth:`loop.create_datagram_endpoint` method, sends data and closes the transport when it receives the answer::
uk: Ехо-клієнт UDP, використовуючи метод :meth:`loop.create_datagram_endpoint`, надсилає дані та закриває транспорт, коли отримує відповідь:

source: Connecting Existing Sockets
uk: Підключення наявних розеток

source: Wait until a socket receives data using the :meth:`loop.create_connection` method with a protocol::
uk: Зачекайте, поки сокет отримає дані за допомогою методу :meth:`loop.create_connection` з протоколом::

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to register an FD.
uk: У прикладі :ref:`спостерігати за файловим дескриптором для подій читання <asyncio_example_watch_fd>` використовується метод низького рівня :meth:`loop.add_reader` для реєстрації FD.

source: The :ref:`register an open socket to wait for data using streams <asyncio_example_create_connection-streams>` example uses high-level streams created by the :func:`open_connection` function in a coroutine.
uk: У прикладі :ref:`register an open socket to wait for data using streams <asyncio_example_create_connection-streams>` використовуються потоки високого рівня, створені функцією :func:`open_connection` у співпрограмі.

source: loop.subprocess_exec() and SubprocessProtocol
uk: loop.subprocess_exec() і SubprocessProtocol

source: An example of a subprocess protocol used to get the output of a subprocess and to wait for the subprocess exit.
uk: Приклад протоколу підпроцесу, який використовується для отримання результатів підпроцесу та очікування виходу підпроцесу.

source: The subprocess is created by the :meth:`loop.subprocess_exec` method::
uk: Підпроцес створюється методом :meth:`loop.subprocess_exec`::

source: See also the :ref:`same example <asyncio_example_create_subprocess_exec>` written using high-level APIs.
uk: Дивіться також :ref:`той самий приклад <asyncio_example_create_subprocess_exec>`, написаний з використанням API високого рівня.
