Repository: python/python-docs-uk
Catalog: library/atexit.po
Languages: uk

source: The :mod:`atexit` module defines functions to register and unregister cleanup functions. Functions thus registered are automatically executed upon normal interpreter termination. :mod:`atexit` runs these functions in the *reverse* order in which they were registered; if you register ``A``, ``B``, and ``C``, at interpreter termination time they will be run in the order ``C``, ``B``, ``A``.
uk: Модуль :mod:`atexit` визначає функції для реєстрації та скасування реєстрації функцій очищення. Зареєстровані таким чином функції автоматично виконуються після звичайного завершення роботи інтерпретатора. :mod:`atexit` запускає ці функції у *зворотному* порядку, у якому вони були зареєстровані; якщо ви зареєструєте ``A``, ``B`` і ``C``, під час завершення роботи інтерпретатора вони виконуватимуться в порядку ``C``, ``B``, ``A`` .

source: **Note:** The functions registered via this module are not called when the program is killed by a signal not handled by Python, when a Python fatal internal error is detected, or when :func:`os._exit` is called.
uk: **Примітка:** Функції, зареєстровані за допомогою цього модуля, не викликаються, коли програма припиняється через сигнал, який не оброблюється Python, коли виявлено критичну внутрішню помилку Python або коли викликається :func:`os._exit`.

source: When used with C-API subinterpreters, registered functions are local to the interpreter they were registered in.
uk: При використанні з субінтерпретаторами C-API зареєстровані функції є локальними для інтерпретатора, у якому вони були зареєстровані.

source: Register *func* as a function to be executed at termination. Any optional arguments that are to be passed to *func* must be passed as arguments to :func:`register`. It is possible to register the same function and arguments more than once.
uk: Зареєструйте *func* як функцію, яка буде виконуватися після завершення. Будь-які необов’язкові аргументи, які мають бути передані в *func*, повинні бути передані як аргументи в :func:`register`. Є можливість зареєструвати ту саму функцію та аргументи кілька разів.

source: At normal program termination (for instance, if :func:`sys.exit` is called or the main module's execution completes), all functions registered are called in last in, first out order. The assumption is that lower level modules will normally be imported before higher level modules and thus must be cleaned up later.
uk: Під час звичайного завершення програми (наприклад, якщо викликається :func:`sys.exit` або завершується виконання основного модуля), усі зареєстровані функції викликаються в порядку останнього входу, першого виходу. Припускається, що модулі нижчого рівня зазвичай імпортуються перед модулями вищого рівня, тому їх потрібно очистити пізніше.

source: If an exception is raised during execution of the exit handlers, a traceback is printed (unless :exc:`SystemExit` is raised) and the exception information is saved. After all exit handlers have had a chance to run, the last exception to be raised is re-raised.
uk: Якщо під час виконання обробників виходу виникає виняток, друкується зворотне трасування (якщо не викликається :exc:`SystemExit`), а інформація про виключення зберігається. Після того, як усі обробники виходу мали можливість запуститися, останній виняток, який було викликано, викликається повторно.

source: This function returns *func*, which makes it possible to use it as a decorator.
uk: Ця функція повертає *func*, що дає змогу використовувати її як декоратор.

source: Remove *func* from the list of functions to be run at interpreter shutdown. :func:`unregister` silently does nothing if *func* was not previously registered. If *func* has been registered more than once, every occurrence of that function in the :mod:`atexit` call stack will be removed. Equality comparisons (``==``) are used internally during unregistration, so function references do not need to have matching identities.
uk: Видаліть *func* зі списку функцій, які будуть запускатися після завершення роботи інтерпретатора. :func:`unregister` мовчки нічого не робить, якщо *func* не було раніше зареєстровано. Якщо *func* було зареєстровано кілька разів, кожне входження цієї функції в стек викликів :mod:`atexit` буде видалено. Порівняння рівності (``==``) використовуються внутрішньо під час скасування реєстрації, тому посилання на функції не повинні мати відповідні ідентифікатори.

source: Module :mod:`readline`
uk: Модуль :mod:`readline`

source: Useful example of :mod:`atexit` to read and write :mod:`readline` history files.
uk: Корисний приклад :mod:`atexit` для читання та запису файлів історії :mod:`readline`.

source: :mod:`atexit` Example
uk: :mod:`atexit` Приклад

source: The following simple example demonstrates how a module can initialize a counter from a file when it is imported and save the counter's updated value automatically when the program terminates without relying on the application making an explicit call into this module at termination. ::
uk: Наступний простий приклад демонструє, як модуль може ініціалізувати лічильник із файлу під час його імпорту та автоматично зберігати оновлене значення лічильника, коли програма завершує роботу, не покладаючись на те, що програма здійснює явний виклик цього модуля під час завершення. ::

source: Positional and keyword arguments may also be passed to :func:`register` to be passed along to the registered function when it is called::
uk: Позиційні та ключові аргументи також можуть бути передані :func:`register` для передачі зареєстрованій функції під час її виклику::

source: Usage as a :term:`decorator`::
uk: Використання як :term:`decorator`::

source: This only works with functions that can be called without arguments.
uk: Це працює лише з функціями, які можна викликати без аргументів.
