Repository: python/python-docs-uk
Catalog: library/bisect.po
Languages: uk

source: :mod:`bisect` --- Array bisection algorithm
uk: :mod:`bisect` --- Алгоритм поділу масиву навпіл

source: **Source code:** :source:`Lib/bisect.py`
uk: **Вихідний код:** :source:`Lib/bisect.py`

source: This module provides support for maintaining a list in sorted order without having to sort the list after each insertion. For long lists of items with expensive comparison operations, this can be an improvement over the more common approach. The module is called :mod:`bisect` because it uses a basic bisection algorithm to do its work. The source code may be most useful as a working example of the algorithm (the boundary conditions are already right!).
uk: Цей модуль забезпечує підтримку підтримки списку в порядку сортування без необхідності сортувати список після кожного вставлення. Для довгих списків елементів із дорогими операціями порівняння це може бути покращенням порівняно з більш поширеним підходом. Модуль називається :mod:`bisect`, оскільки для виконання своєї роботи він використовує базовий алгоритм поділу навпіл. Вихідний код може бути найбільш корисним як робочий приклад алгоритму (граничні умови вже правильні!).

source: The following functions are provided:
uk: Передбачені такі функції:

source: Locate the insertion point for *x* in *a* to maintain sorted order. The parameters *lo* and *hi* may be used to specify a subset of the list which should be considered; by default the entire list is used. If *x* is already present in *a*, the insertion point will be before (to the left of) any existing entries. The return value is suitable for use as the first parameter to ``list.insert()`` assuming that *a* is already sorted.
uk: Знайдіть точку вставки для *x* у *a*, щоб зберегти відсортований порядок. Параметри *lo* і *hi* можуть використовуватися для визначення підмножини списку, яку слід враховувати; за замовчуванням використовується весь список. Якщо *x* уже присутній у *a*, точка вставки буде перед будь-якими існуючими записами (зліва від них). Повернене значення придатне для використання як перший параметр для ``list.insert()`` за умови, що *a* вже відсортовано.

source: The returned insertion point *i* partitions the array *a* into two halves so that ``all(val < x for val in a[lo : i])`` for the left side and ``all(val >= x for val in a[i : hi])`` for the right side.
uk: Повернена точка вставки *i* ділить масив *a* на дві половини так, що ``all(val < x for val in a[lo : i])`` for the left side and ``all(val > = x for val in a[i : hi])`` для правої сторони.

source: *key* specifies a :term:`key function` of one argument that is used to extract a comparison key from each element in the array. To support searching complex records, the key function is not applied to the *x* value.
uk: *key* визначає :term:`key function` одного аргументу, який використовується для отримання ключа порівняння з кожного елемента в масиві. Для підтримки пошуку складних записів функція ключа не застосовується до значення *x*.

source: If *key* is ``None``, the elements are compared directly with no intervening function call.
uk: Якщо *key* має значення ``None``, елементи порівнюються безпосередньо без виклику функції.

source: Added the *key* parameter.
uk: Додано параметр *key*.

source: Similar to :func:`bisect_left`, but returns an insertion point which comes after (to the right of) any existing entries of *x* in *a*.
uk: Подібно до :func:`bisect_left`, але повертає точку вставки, яка стоїть після (праворуч) усіх існуючих записів *x* у *a*.

source: The returned insertion point *i* partitions the array *a* into two halves so that ``all(val <= x for val in a[lo : i])`` for the left side and ``all(val > x for val in a[i : hi])`` for the right side.
uk: Повернена точка вставки *i* ділить масив *a* на дві половини так, що ``all(val <= x for val in a[lo : i])`` for the left side and ``all(val > x for val in a[i : hi])`` для правої сторони.

source: Insert *x* in *a* in sorted order.
uk: Вставте *x* у *a* в порядку сортування.

source: This function first runs :func:`bisect_left` to locate an insertion point. Next, it runs the :meth:`insert` method on *a* to insert *x* at the appropriate position to maintain sort order.
uk: Ця функція спочатку запускає :func:`bisect_left`, щоб знайти точку вставки. Далі він запускає метод :meth:`insert` на *a*, щоб вставити *x* у відповідну позицію для збереження порядку сортування.

source: To support inserting records in a table, the *key* function (if any) is applied to *x* for the search step but not for the insertion step.
uk: Щоб підтримувати вставлення записів у таблицю, функція *key* (якщо є) застосовується до *x* для кроку пошуку, але не для кроку вставки.

source: Keep in mind that the ``O(log n)`` search is dominated by the slow O(n) insertion step.
uk: Майте на увазі, що в пошуку ``O(log n)`` домінує повільний крок вставки O(n).

source: Similar to :func:`insort_left`, but inserting *x* in *a* after any existing entries of *x*.
uk: Подібно до :func:`insort_left`, але *x* вставляється в *a* після будь-яких існуючих записів *x*.

source: This function first runs :func:`bisect_right` to locate an insertion point. Next, it runs the :meth:`insert` method on *a* to insert *x* at the appropriate position to maintain sort order.
uk: Ця функція спочатку запускає :func:`bisect_right`, щоб знайти точку вставки. Далі він запускає метод :meth:`insert` на *a*, щоб вставити *x* у відповідну позицію для збереження порядку сортування.

source: Performance Notes
uk: Примітки щодо продуктивності

source: When writing time sensitive code using *bisect()* and *insort()*, keep these thoughts in mind:
uk: Під час написання чутливого до часу коду за допомогою *bisect()* і *insort()* пам’ятайте про такі думки:

source: Bisection is effective for searching ranges of values. For locating specific values, dictionaries are more performant.
uk: Ділення навпіл ефективне для пошуку діапазонів значень. Для пошуку конкретних значень словники більш ефективні.

source: The *insort()* functions are ``O(n)`` because the logarithmic search step is dominated by the linear time insertion step.
uk: Функції *insort()* мають значення ``O(n)``, оскільки крок логарифмічного пошуку домінує крок лінійного вставлення часу.

source: The search functions are stateless and discard key function results after they are used. Consequently, if the search functions are used in a loop, the key function may be called again and again on the same array elements. If the key function isn't fast, consider wrapping it with :func:`functools.cache` to avoid duplicate computations. Alternatively, consider searching an array of precomputed keys to locate the insertion point (as shown in the examples section below).
uk: Функції пошуку не мають стану та скидають результати ключових функцій після їх використання. Отже, якщо функції пошуку використовуються в циклі, ключова функція може бути викликана знову і знову для тих самих елементів масиву. Якщо ключова функція нешвидка, оберніть її за допомогою :func:`functools.cache`, щоб уникнути дублювання обчислень. Крім того, розгляньте можливість пошуку в масиві попередньо обчислених ключів, щоб знайти точку вставки (як показано в розділі прикладів нижче).

source: `Sorted Collections <http://www.grantjenks.com/docs/sortedcollections/>`_ is a high performance module that uses *bisect* to managed sorted collections of data.
uk: `Sorted Collections <http://www.grantjenks.com/docs/sortedcollections/>`_ — це високопродуктивний модуль, який використовує *bisect* для керування відсортованими колекціями даних.

source: The `SortedCollection recipe <https://code.activestate.com/recipes/577197-sortedcollection/>`_ uses bisect to build a full-featured collection class with straight-forward search methods and support for a key-function. The keys are precomputed to save unnecessary calls to the key function during searches.
uk: `Рецепт SortedCollection <https://code.activestate.com/recipes/577197-sortedcollection/>`_ використовує bisect для створення повнофункціонального класу колекції з прямими методами пошуку та підтримкою функції ключа. Ключі попередньо обчислені, щоб уникнути непотрібних викликів функції клавіш під час пошуку.

source: Searching Sorted Lists
uk: Пошук у відсортованих списках

source: The above :func:`bisect` functions are useful for finding insertion points but can be tricky or awkward to use for common searching tasks. The following five functions show how to transform them into the standard lookups for sorted lists::
uk: Наведені вище функції :func:`bisect` корисні для пошуку точок вставки, але можуть бути складними або незручними у використанні для звичайних завдань пошуку. Наступні п’ять функцій показують, як перетворити їх на стандартні пошуки для відсортованих списків:

source: Examples
uk: Приклади

source: The :func:`bisect` function can be useful for numeric table lookups. This example uses :func:`bisect` to look up a letter grade for an exam score (say) based on a set of ordered numeric breakpoints: 90 and up is an 'A', 80 to 89 is a 'B', and so on::
uk: Функція :func:`bisect` може бути корисною для пошуку числових таблиць. У цьому прикладі використовується :func:`bisect` для пошуку літерної оцінки для оцінки іспиту (скажімо) на основі набору впорядкованих числових контрольних точок: 90 і вище — це "A", від 80 до 89 — це "B", а так далі::

source: The :func:`bisect` and :func:`insort` functions also work with lists of tuples. The *key* argument can serve to extract the field used for ordering records in a table::
uk: Функції :func:`bisect` і :func:`insort` також працюють зі списками кортежів. Аргумент *key* може служити для вилучення поля, яке використовується для впорядкування записів у таблиці::

source: If the key function is expensive, it is possible to avoid repeated function calls by searching a list of precomputed keys to find the index of a record::
uk: Якщо функція ключа є дорогою, можна уникнути повторних викликів функції шляхом пошуку списку попередньо обчислених ключів, щоб знайти індекс запису::
