Repository: python/python-docs-uk
Catalog: library/bz2.po
Languages: uk

source: **Source code:** :source:`Lib/bz2.py`
uk: **Вихідний код:** :source:`Lib/bz2.py`

source: This module provides a comprehensive interface for compressing and decompressing data using the bzip2 compression algorithm.
uk: Цей модуль забезпечує комплексний інтерфейс для стиснення та розпакування даних за допомогою алгоритму стиснення bzip2.

source: The :mod:`bz2` module contains:
uk: Модуль :mod:`bz2` містить:

source: The :func:`.open` function and :class:`BZ2File` class for reading and writing compressed files.
uk: Функція :func:`.open` і клас :class:`BZ2File` для читання та запису стиснених файлів.

source: The :class:`BZ2Compressor` and :class:`BZ2Decompressor` classes for incremental (de)compression.
uk: Класи :class:`BZ2Compressor` і :class:`BZ2Decompressor` для поступового (де)стиснення.

source: The :func:`compress` and :func:`decompress` functions for one-shot (de)compression.
uk: Функції :func:`compress` і :func:`decompress` для одноразового (де)стиснення.

source: (De)compression of files
uk: (Де)компресія файлів

source: Open a bzip2-compressed file in binary or text mode, returning a :term:`file object`.
uk: Відкрийте файл, стиснутий за допомогою bzip2, у двійковому або текстовому режимі, повертаючи :term:`file object`.

source: As with the constructor for :class:`BZ2File`, the *filename* argument can be an actual filename (a :class:`str` or :class:`bytes` object), or an existing file object to read from or write to.
uk: Як і у випадку з конструктором для :class:`BZ2File`, аргумент *filename* може бути фактичним ім’ям файлу (об’єкт :class:`str` або :class:`bytes`) або наявним файловим об’єктом для читання чи запису до.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'w'``, ``'wb'``, ``'x'``, ``'xb'``, ``'a'`` or ``'ab'`` for binary mode, or ``'rt'``, ``'wt'``, ``'xt'``, or ``'at'`` for text mode. The default is ``'rb'``.
uk: Аргумент *mode* може бути будь-яким із ``'r'``, ``'rb'``, ``'w'``, ``'wb'``, ``'x'``, ``'xb'``, ``'a'`` або ``'ab'`` для бінарного режиму або ``'rt'``, ``'wt'``, ``'xt'`` або ``'at'`` для текстового режиму. Типовим є ``'rb'``.

source: The *compresslevel* argument is an integer from 1 to 9, as for the :class:`BZ2File` constructor.
uk: Аргумент *compresslevel* є цілим числом від 1 до 9, як і для конструктора :class:`BZ2File`.

source: For binary mode, this function is equivalent to the :class:`BZ2File` constructor: ``BZ2File(filename, mode, compresslevel=compresslevel)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
uk: Для двійкового режиму ця функція еквівалентна конструктору :class:`BZ2File`: ``BZ2File(filename, mode, compresslevel=compresslevel)``. У цьому випадку аргументи *encoding*, *errors* і *newline* не повинні надаватися.

source: For text mode, a :class:`BZ2File` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
uk: Для текстового режиму створюється об’єкт :class:`BZ2File`, який загортається в екземпляр :class:`io.TextIOWrapper` із вказаним кодуванням, поведінкою обробки помилок і закінченнями рядків.

source: The ``'x'`` (exclusive creation) mode was added.
uk: Додано режим ``'x`` (ексклюзивне створення).

source: Accepts a :term:`path-like object`.
uk: Приймає :term:`path-like object`.

source: Open a bzip2-compressed file in binary mode.
uk: Відкрийте файл, стиснутий за допомогою bzip2, у двійковому режимі.

source: If *filename* is a :class:`str` or :class:`bytes` object, open the named file directly. Otherwise, *filename* should be a :term:`file object`, which will be used to read or write the compressed data.
uk: Якщо *filename* є об’єктом :class:`str` або :class:`bytes`, відкрийте названий файл безпосередньо. В іншому випадку *filename* має бути :term:`file object`, який використовуватиметься для читання або запису стиснутих даних.

source: The *mode* argument can be either ``'r'`` for reading (default), ``'w'`` for overwriting, ``'x'`` for exclusive creation, or ``'a'`` for appending. These can equivalently be given as ``'rb'``, ``'wb'``, ``'xb'`` and ``'ab'`` respectively.
uk: Аргументом *mode* може бути ``'r'`` для читання (за замовчуванням), ``'w'`` для перезапису, ``'x'`` для ексклюзивного створення або ``'a'`` для додавання. Їх можна еквівалентно вказати як ``'rb'``, ``'wb'``, ``'xb'`` і ``'ab'`` відповідно.

source: If *filename* is a file object (rather than an actual file name), a mode of ``'w'`` does not truncate the file, and is instead equivalent to ``'a'``.
uk: Якщо *filename* є об’єктом файлу (а не справжнім ім’ям файлу), режим ``'w'`` не скорочує файл, а замість цього еквівалентний ``'a'``.

source: If *mode* is ``'w'`` or ``'a'``, *compresslevel* can be an integer between ``1`` and ``9`` specifying the level of compression: ``1`` produces the least compression, and ``9`` (default) produces the most compression.
uk: Якщо *mode* має значення ``'w'`` або ``'a'``, *compresslevel* може бути цілим числом від ``1`` до ``9``, що визначає рівень стиснення: ``1`` створює найменше стиснення, а ``9`` (за замовчуванням) створює найбільше стиснення.

source: If *mode* is ``'r'``, the input file may be the concatenation of multiple compressed streams.
uk: Якщо *mode* має значення ``'r'``, вхідний файл може бути конкатенацією кількох стиснутих потоків.

source: Return buffered data without advancing the file position. At least one byte of data will be returned (unless at EOF). The exact number of bytes returned is unspecified.
uk: Повернути буферизовані дані без просування позиції файлу. Буде повернено принаймні один байт даних (якщо не EOF). Точна кількість повернутих байтів не вказана.

source: While calling :meth:`peek` does not change the file position of the :class:`BZ2File`, it may change the position of the underlying file object (e.g. if the :class:`BZ2File` was constructed by passing a file object for *filename*).
uk: Хоча виклик :meth:`peek` не змінює позицію файлу :class:`BZ2File`, він може змінити позицію основного файлового об’єкта (наприклад, якщо :class:`BZ2File` було створено шляхом передачі файлового об’єкта для *ім'я файлу*).

source: Support for the :keyword:`with` statement was added.
uk: Додано підтримку оператора :keyword:`with`.

source: Support was added for *filename* being a :term:`file object` instead of an actual filename.
uk: Було додано підтримку для *filename* як :term:`file object` замість фактичної назви файлу.

source: The ``'a'`` (append) mode was added, along with support for reading multi-stream files.
uk: Було додано режим ``'a'`` (додавання) разом із підтримкою читання багатопотокових файлів.

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
uk: Метод :meth:`~io.BufferedIOBase.read` тепер приймає аргумент ``None``.

source: The *buffering* parameter has been removed. It was ignored and deprecated since Python 3.0. Pass an open file object to control how the file is opened.
uk: Параметр *buffering* видалено. Він був проігнорований і застарілим, починаючи з Python 3.0. Передайте відкритий файловий об’єкт, щоб контролювати, як відкривається файл.

source: The *compresslevel* parameter became keyword-only.
uk: Параметр *compresslevel* став лише ключовим словом.

source: This class is thread unsafe in the face of multiple simultaneous readers or writers, just like its equivalent classes in :mod:`gzip` and :mod:`lzma` have always been.
uk: Цей клас є потоково небезпечним перед обличчям кількох одночасних читачів або записувачів, як завжди були його еквівалентні класи в :mod:`gzip` і :mod:`lzma`.

source: Incremental (de)compression
uk: Поступове (роз)стиснення

source: Create a new compressor object. This object may be used to compress data incrementally. For one-shot compression, use the :func:`compress` function instead.
uk: Створіть новий об’єкт компресора. Цей об’єкт можна використовувати для поступового стиснення даних. Для одноразового стиснення замість цього використовуйте функцію :func:`compress`.

source: *compresslevel*, if given, must be an integer between ``1`` and ``9``. The default is ``9``.
uk: *compresslevel*, якщо задано, має бути цілим числом від ``1`` до ``9``. Типовим значенням є ``9``.

source: Provide data to the compressor object. Returns a chunk of compressed data if possible, or an empty byte string otherwise.
uk: Надайте дані об’єкту компресора. Повертає фрагмент стиснутих даних, якщо це можливо, або порожній рядок байтів в іншому випадку.

source: When you have finished providing data to the compressor, call the :meth:`flush` method to finish the compression process.
uk: Коли ви закінчите надсилати дані компресору, викличте метод :meth:`flush`, щоб завершити процес стиснення.

source: Finish the compression process. Returns the compressed data left in internal buffers.
uk: Завершіть процес стиснення. Повертає стислі дані, що залишилися у внутрішніх буферах.

source: The compressor object may not be used after this method has been called.
uk: Об’єкт компресора не можна використовувати після виклику цього методу.

source: Create a new decompressor object. This object may be used to decompress data incrementally. For one-shot compression, use the :func:`decompress` function instead.
uk: Створіть новий об’єкт декомпресора. Цей об’єкт можна використовувати для поступового розпакування даних. Для одноразового стиснення замість цього використовуйте функцію :func:`decompress`.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`BZ2File`. If you need to decompress a multi-stream input with :class:`BZ2Decompressor`, you must use a new decompressor for each stream.
uk: Цей клас не обробляє прозоро вхідні дані, що містять кілька стиснутих потоків, на відміну від :func:`decompress` і :class:`BZ2File`. Якщо вам потрібно розпакувати багатопотоковий вхід за допомогою :class:`BZ2Decompressor`, ви повинні використовувати новий розпаковувач для кожного потоку.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
uk: Розпакуйте *дані* (:term:`bytes-like object`), повертаючи нестиснуті дані у вигляді байтів. Деякі з *даних* можуть бути збережені у внутрішньому буфері для використання в подальших викликах :meth:`decompress`. Повернуті дані мають бути об’єднані з результатами будь-яких попередніх викликів :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
uk: Якщо *max_length* є невід’ємним, повертає щонайбільше *max_length* байтів розпакованих даних. Якщо цей ліміт буде досягнуто, і буде створено подальший вихід, атрибут :attr:`~.needs_input` буде встановлено на ``False``. У цьому випадку наступний виклик :meth:`~.decompress` може надати *data* як ``b''``, щоб отримати більше вихідних даних.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
uk: Якщо всі вхідні дані було розпаковано та повернуто (або через те, що вони були меншими за *max_length* байтів, або через те, що *max_length* було від’ємним), для атрибута :attr:`~.needs_input` буде встановлено значення ``True`` .

source: Added the *max_length* parameter.
uk: Додано параметр *max_length*.

source: ``True`` if the end-of-stream marker has been reached.
uk: ``True``, якщо досягнуто маркера кінця потоку.

source: Data found after the end of the compressed stream.
uk: Дані знайдено після закінчення стисненого потоку.

source: If this attribute is accessed before the end of the stream has been reached, its value will be ``b''``.
uk: Якщо цей атрибут доступний до досягнення кінця потоку, його значення буде ``b''``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
uk: ``False``, якщо метод :meth:`.decompress` може надати більше розпакованих даних перед запитом нового нестисненого введення.

source: One-shot (de)compression
uk: Одноразова (де)компресія

source: Compress *data*, a :term:`bytes-like object <bytes-like object>`.
uk: Стиснути *data*, :term:`байт-подібний об’єкт <bytes-like object>`.

source: For incremental compression, use a :class:`BZ2Compressor` instead.
uk: Для інкрементного стиснення замість цього використовуйте :class:`BZ2Compressor`.

source: Decompress *data*, a :term:`bytes-like object <bytes-like object>`.
uk: Розархівуйте *data*, :term:`байт-подібний об’єкт <bytes-like object>`.

source: If *data* is the concatenation of multiple compressed streams, decompress all of the streams.
uk: Якщо *data* є конкатенацією кількох стиснутих потоків, розпакуйте всі потоки.

source: For incremental decompression, use a :class:`BZ2Decompressor` instead.
uk: Для інкрементної декомпресії замість цього використовуйте :class:`BZ2Decompressor`.

source: Support for multi-stream inputs was added.
uk: Додано підтримку багатопотокових входів.

source: Examples of usage
uk: Приклади вживання

source: Below are some examples of typical usage of the :mod:`bz2` module.
uk: Нижче наведено декілька прикладів типового використання модуля :mod:`bz2`.

source: Using :func:`compress` and :func:`decompress` to demonstrate round-trip compression:
uk: Використання :func:`compress` і :func:`decompress` для демонстрації двостороннього стиснення:

source: Using :class:`BZ2Compressor` for incremental compression:
uk: Використання :class:`BZ2Compressor` для поступового стиснення:

source: Writing and reading a bzip2-compressed file in binary mode:
uk: Запис і читання файлу, стисненого bzip2, у двійковому режимі:
