Repository: python/python-docs-uk
Catalog: library/calendar.po
Languages: uk

source: :mod:`calendar` --- General calendar-related functions
uk: :mod:`calendar` --- Загальні функції, пов'язані з календарем

source: **Source code:** :source:`Lib/calendar.py`
uk: **Вихідний код:** :source:`Lib/calendar.py`

source: This module allows you to output calendars like the Unix :program:`cal` program, and provides additional useful functions related to the calendar. By default, these calendars have Monday as the first day of the week, and Sunday as the last (the European convention). Use :func:`setfirstweekday` to set the first day of the week to Sunday (6) or to any other weekday. Parameters that specify dates are given as integers. For related functionality, see also the :mod:`datetime` and :mod:`time` modules.
uk: Цей модуль дозволяє виводити календарі, як програма Unix :program:`cal`, і надає додаткові корисні функції, пов’язані з календарем. За замовчуванням у цих календарях першим днем тижня є понеділок, а останнім — неділя (європейська конвенція). Використовуйте :func:`setfirstweekday`, щоб установити першим днем тижня неділю (6) або будь-який інший день тижня. Параметри, що визначають дати, задаються як цілі числа. Для пов’язаних функцій перегляньте також модулі :mod:`datetime` і :mod:`time`.

source: The functions and classes defined in this module use an idealized calendar, the current Gregorian calendar extended indefinitely in both directions. This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book "Calendrical Calculations", where it's the base calendar for all computations. Zero and negative years are interpreted as prescribed by the ISO 8601 standard. Year 0 is 1 BC, year -1 is 2 BC, and so on.
uk: Функції та класи, визначені в цьому модулі, використовують ідеалізований календар, поточний григоріанський календар, розширений на невизначений термін в обох напрямках. Це відповідає визначенню "пролептичного григоріанського" календаря в книзі Дершовіца та Рейнгольда "Календарні обчислення", де це базовий календар для всіх обчислень. Нульові та негативні роки інтерпретуються відповідно до стандарту ISO 8601. Рік 0 — це 1 рік до нашої ери, рік -1 — це 2 рік до нашої ери і так далі.

source: Creates a :class:`Calendar` object. *firstweekday* is an integer specifying the first day of the week. :const:`MONDAY` is ``0`` (the default), :const:`SUNDAY` is ``6``.
uk: Створює об’єкт :class:`Calendar`. *firstweekday* — це ціле число, що визначає перший день тижня. :const:`MONDAY` — це ``0`` (за замовчуванням), :const:`SUNDAY` — ``6``.

source: A :class:`Calendar` object provides several methods that can be used for preparing the calendar data for formatting. This class doesn't do any formatting itself. This is the job of subclasses.
uk: Об’єкт :class:`Calendar` надає кілька методів, які можна використовувати для підготовки даних календаря до форматування. Цей клас сам не виконує форматування. Це робота підкласів.

source: :class:`Calendar` instances have the following methods:
uk: Екземпляри :class:`Calendar` мають такі методи:

source: Return an iterator for the week day numbers that will be used for one week. The first value from the iterator will be the same as the value of the :attr:`firstweekday` property.
uk: Повертає ітератор для номерів днів тижня, які використовуватимуться протягом одного тижня. Перше значення ітератора буде таким самим, як значення властивості :attr:`firstweekday`.

source: Return an iterator for the month *month* (1--12) in the year *year*. This iterator will return all days (as :class:`datetime.date` objects) for the month and all days before the start of the month or after the end of the month that are required to get a complete week.
uk: Повертає ітератор для місяця *month* (1--12) у році *year*. Цей ітератор поверне всі дні (як об’єкти :class:`datetime.date`) за місяць і всі дні до початку або після кінця місяця, необхідні для отримання повного тижня.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will simply be day of the month numbers. For the days outside of the specified month, the day number is ``0``.
uk: Повертає ітератор для місяця *місяць* у році *рік*, подібний до :meth:`itermonthdates`, але не обмежений діапазоном :class:`datetime.date`. Повернені дні будуть просто номерами днів місяця. Для днів поза вказаним місяцем номер дня дорівнює ``0``.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a day of the month number and a week day number.
uk: Повертає ітератор для місяця *місяць* у році *рік*, подібний до :meth:`itermonthdates`, але не обмежений діапазоном :class:`datetime.date`. Повернуті дні будуть кортежами, що складаються з номера дня місяця та номера дня тижня.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month and a day of the month numbers.
uk: Повертає ітератор для місяця *місяць* у році *рік*, подібний до :meth:`itermonthdates`, але не обмежений діапазоном :class:`datetime.date`. Повернуті дні будуть кортежами, що складаються з номерів року, місяця та дня місяця.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month, a day of the month, and a day of the week numbers.
uk: Повертає ітератор для місяця *місяць* у році *рік*, подібний до :meth:`itermonthdates`, але не обмежений діапазоном :class:`datetime.date`. Повернуті дні будуть кортежами, що складаються з номерів року, місяця, дня місяця та дня тижня.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven :class:`datetime.date` objects.
uk: Повертає список тижнів у місяці *місяць* *року* як повні тижні. Тижні — це списки із семи об’єктів :class:`datetime.date`.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven tuples of day numbers and weekday numbers.
uk: Повертає список тижнів у місяці *місяць* *року* як повні тижні. Тижні — це списки із семи кортежів номерів днів і днів тижня.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven day numbers.
uk: Повертає список тижнів у місяці *місяць* *року* як повні тижні. Тижні — це списки із семи днів.

source: Return the data for the specified year ready for formatting. The return value is a list of month rows. Each month row contains up to *width* months (defaulting to 3). Each month contains between 4 and 6 weeks and each week contains 1--7 days. Days are :class:`datetime.date` objects.
uk: Повернути готові до форматування дані за вказаний рік. Поверненим значенням є список рядків місяця. Кожен рядок місяця містить до *width* місяців (за замовчуванням до 3). Кожен місяць містить від 4 до 6 тижнів, а кожен тиждень містить 1--7 днів. Дні є об’єктами :class:`datetime.date`.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are tuples of day numbers and weekday numbers. Day numbers outside this month are zero.
uk: Повертає дані за вказаний рік, готові до форматування (подібно до :meth:`yeardatescalendar`). Записи в тижневих списках є кортежами номерів днів і днів тижня. Номери днів поза цим місяцем дорівнюють нулю.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are day numbers. Day numbers outside this month are zero.
uk: Повертає дані за вказаний рік, готові до форматування (подібно до :meth:`yeardatescalendar`). Записи в тижневих списках є номерами днів. Номери днів поза цим місяцем дорівнюють нулю.

source: This class can be used to generate plain text calendars.
uk: Цей клас можна використовувати для створення простих текстових календарів.

source: :class:`TextCalendar` instances have the following methods:
uk: Екземпляри :class:`TextCalendar` мають такі методи:

source: Return a month's calendar in a multi-line string. If *w* is provided, it specifies the width of the date columns, which are centered. If *l* is given, it specifies the number of lines that each week will use. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method.
uk: Повертає місячний календар у багаторядковому рядку. Якщо вказано *w*, воно визначає ширину стовпців дати, які розташовані по центру. Якщо задано *l*, це визначає кількість рядків, які використовуватимуться кожного тижня. Залежить від першого дня тижня, як зазначено в конструкторі або встановлено методом :meth:`setfirstweekday`.

source: Print a month's calendar as returned by :meth:`formatmonth`.
uk: Надрукувати місячний календар, який повертає :meth:`formatmonth`.

source: Return a *m*-column calendar for an entire year as a multi-line string. Optional parameters *w*, *l*, and *c* are for date column width, lines per week, and number of spaces between month columns, respectively. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method. The earliest year for which a calendar can be generated is platform-dependent.
uk: Повертає календар зі стовпцями *m* для цілого року як багаторядковий рядок. Додаткові параметри *w*, *l* і *c* призначені для ширини стовпця дати, рядків на тиждень і кількості пробілів між стовпцями місяця відповідно. Залежить від першого дня тижня, як зазначено в конструкторі або встановлено методом :meth:`setfirstweekday`. Найперший рік, для якого можна створити календар, залежить від платформи.

source: Print the calendar for an entire year as returned by :meth:`formatyear`.
uk: Роздрукувати календар на цілий рік, який повертає :meth:`formatyear`.

source: This class can be used to generate HTML calendars.
uk: Цей клас можна використовувати для створення HTML-календарів.

source: :class:`!HTMLCalendar` instances have the following methods:
uk: Екземпляри :class:`!HTMLCalendar` мають такі методи:

source: Return a month's calendar as an HTML table. If *withyear* is true the year will be included in the header, otherwise just the month name will be used.
uk: Повертає місячний календар як таблицю HTML. Якщо *withyear* має значення true, рік буде включено в заголовок, інакше використовуватиметься лише назва місяця.

source: Return a year's calendar as an HTML table. *width* (defaulting to 3) specifies the number of months per row.
uk: Повертає річний календар як таблицю HTML. *width* (за замовчуванням 3) визначає кількість місяців у рядку.

source: Return a year's calendar as a complete HTML page. *width* (defaulting to 3) specifies the number of months per row. *css* is the name for the cascading style sheet to be used. :const:`None` can be passed if no style sheet should be used. *encoding* specifies the encoding to be used for the output (defaulting to the system default encoding).
uk: Повертає річний календар як повну сторінку HTML. *width* (за замовчуванням 3) визначає кількість місяців у рядку. *css* — назва каскадної таблиці стилів, яка буде використовуватися. :const:`None` можна передати, якщо не потрібно використовувати таблицю стилів. *encoding* вказує кодування, яке буде використовуватися для виведення (за замовчуванням використовується стандартне кодування системи).

source: :class:`!HTMLCalendar` has the following attributes you can override to customize the CSS classes used by the calendar:
uk: :class:`!HTMLCalendar` має такі атрибути, які ви можете замінити, щоб налаштувати класи CSS, які використовує календар:

source: A list of CSS classes used for each weekday. The default class list is::
uk: Список класів CSS, які використовуються для кожного дня тижня. Типовий список класів:

source: more styles can be added for each day::
uk: на кожен день можна додати більше стилів::

source: Note that the length of this list must be seven items.
uk: Зауважте, що довжина цього списку має складатися із семи пунктів.

source: The CSS class for a weekday occurring in the previous or coming month.
uk: Клас CSS для дня тижня в попередньому або наступному місяці.

source: A list of CSS classes used for weekday names in the header row. The default is the same as :attr:`cssclasses`.
uk: Список класів CSS, які використовуються для назв днів тижня в рядку заголовка. За замовчуванням таке саме, як :attr:`cssclasses`.

source: The month's head CSS class (used by :meth:`formatmonthname`). The default value is ``"month"``.
uk: Головний клас CSS місяця (використовується :meth:`formatmonthname`). Значенням за замовчуванням є ``"місяць"``.

source: The CSS class for the whole month's table (used by :meth:`formatmonth`). The default value is ``"month"``.
uk: Клас CSS для таблиці всього місяця (використовується :meth:`formatmonth`). Значенням за замовчуванням є ``"місяць"``.

source: The CSS class for the whole year's table of tables (used by :meth:`formatyear`). The default value is ``"year"``.
uk: Клас CSS для таблиці таблиць за цілий рік (використовується :meth:`formatyear`). Значення за замовчуванням – ``"рік"``.

source: The CSS class for the table head for the whole year (used by :meth:`formatyear`). The default value is ``"year"``.
uk: Клас CSS для заголовка таблиці за цілий рік (використовується :meth:`formatyear`). Значення за замовчуванням – ``"рік"``.

source: Note that although the naming for the above described class attributes is singular (e.g. ``cssclass_month`` ``cssclass_noday``), one can replace the single CSS class with a space separated list of CSS classes, for example::
uk: Зауважте, що хоча імена для описаних вище атрибутів класу є одниною (наприклад, ``cssclass_month`` ``cssclass_noday``), можна замінити один клас CSS списком класів CSS, розділених пробілами, наприклад::

source: Here is an example how :class:`!HTMLCalendar` can be customized::
uk: Ось приклад того, як :class:`!HTMLCalendar` можна налаштувати::

source: For simple text calendars this module provides the following functions.
uk: Для простих текстових календарів цей модуль надає такі функції.

source: Sets the weekday (``0`` is Monday, ``6`` is Sunday) to start each week. The values :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, and :const:`SUNDAY` are provided for convenience. For example, to set the first weekday to Sunday::
uk: Встановлює день тижня (``0`` - понеділок, ``6`` - неділя), щоб почати кожен тиждень. Значення :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY` і :const:`SUNDAY` надаються для зручності. Наприклад, щоб встановити першим днем тижня неділю:

source: Returns the current setting for the weekday to start each week.
uk: Повертає поточне налаштування дня тижня для початку кожного тижня.

source: Returns :const:`True` if *year* is a leap year, otherwise :const:`False`.
uk: Повертає :const:`True`, якщо *year* є високосним роком, інакше :const:`False`.

source: Returns the number of leap years in the range from *y1* to *y2* (exclusive), where *y1* and *y2* are years.
uk: Повертає кількість високосних років у діапазоні від *y1* до *y2* (за винятком), де *y1* і *y2* — роки.

source: This function works for ranges spanning a century change.
uk: Ця функція працює для діапазонів, що охоплюють зміну століття.

source: Returns the day of the week (``0`` is Monday) for *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).
uk: Повертає день тижня ("0" — понеділок) для *року* (``1970``--...), *місяця* (``1``--``12``), *день* (``1``-``31``).

source: Return a header containing abbreviated weekday names. *n* specifies the width in characters for one weekday.
uk: Повертає заголовок, що містить скорочені назви днів тижня. *n* визначає ширину в символах для одного дня тижня.

source: Returns weekday of first day of the month and number of days in month, for the specified *year* and *month*.
uk: Повертає день тижня першого дня місяця та кількість днів у місяці для вказаного *року* та *місяця*.

source: Returns a matrix representing a month's calendar. Each row represents a week; days outside of the month are represented by zeros. Each week begins with Monday unless set by :func:`setfirstweekday`.
uk: Повертає матрицю, що представляє місячний календар. Кожен рядок означає тиждень; дні поза місяцем позначаються нулями. Кожен тиждень починається з понеділка, якщо не встановлено :func:`setfirstweekday`.

source: Prints a month's calendar as returned by :func:`month`.
uk: Друкує місячний календар, який повертає :func:`month`.

source: Returns a month's calendar in a multi-line string using the :meth:`formatmonth` of the :class:`TextCalendar` class.
uk: Повертає місячний календар у багаторядковому рядку з використанням :meth:`formatmonth` класу :class:`TextCalendar`.

source: Prints the calendar for an entire year as returned by :func:`calendar`.
uk: Друкує календар на цілий рік, який повертає :func:`calendar`.

source: Returns a 3-column calendar for an entire year as a multi-line string using the :meth:`formatyear` of the :class:`TextCalendar` class.
uk: Повертає 3-колонковий календар на цілий рік як багаторядковий рядок, використовуючи :meth:`formatyear` класу :class:`TextCalendar`.

source: An unrelated but handy function that takes a time tuple such as returned by the :func:`~time.gmtime` function in the :mod:`time` module, and returns the corresponding Unix timestamp value, assuming an epoch of 1970, and the POSIX encoding. In fact, :func:`time.gmtime` and :func:`timegm` are each others' inverse.
uk: Непов’язана, але зручна функція, яка приймає кортеж часу, такий як повернутий функцією :func:`~time.gmtime` в модулі :mod:`time`, і повертає відповідне значення мітки часу Unix, припускаючи епоху 1970 року, і кодування POSIX. Насправді :func:`time.gmtime` і :func:`timegm` є зворотними один одному.

source: The :mod:`calendar` module exports the following data attributes:
uk: Модуль :mod:`calendar` експортує такі атрибути даних:

source: An array that represents the days of the week in the current locale.
uk: Масив, що представляє дні тижня в поточній локалі.

source: An array that represents the abbreviated days of the week in the current locale.
uk: Масив, який представляє скорочені дні тижня в поточній локалі.

source: An array that represents the months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_name[0]`` is the empty string.
uk: Масив, що представляє місяці року в поточній локалі. Це відповідає звичайній угоді про те, що січень є місяцем номер 1, тому він має довжину 13, а ``month_name[0]`` є порожнім рядком.

source: An array that represents the abbreviated months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_abbr[0]`` is the empty string.
uk: Масив, який представляє скорочені місяці року в поточній локалі. Це відповідає звичайній угоді про те, що січень є місяцем номер 1, тому він має довжину 13, а ``month_abbr[0]`` є порожнім рядком.

source: Aliases for day numbers, where ``MONDAY`` is ``0`` and ``SUNDAY`` is ``6``.
uk: Псевдоніми для номерів днів, де "ПОНЕДІЛОК" — це "0", а "НЕДІЛЯ" — "6".

source: Module :mod:`datetime`
uk: Модуль :mod:`datetime`

source: Object-oriented interface to dates and times with similar functionality to the :mod:`time` module.
uk: Об’єктно-орієнтований інтерфейс для дат і часу з аналогічною функціональністю модуля :mod:`time`.

source: Module :mod:`time`
uk: Модуль :mod:`time`

source: Low-level time related functions.
uk: Низькорівневі функції, пов'язані з часом.
