Repository: python/python-docs-uk
Catalog: library/cmath.po
Languages: uk

source: :mod:`cmath` --- Mathematical functions for complex numbers
uk: :mod:`cmath` --- Математичні функції для комплексних чисел

source: This module provides access to mathematical functions for complex numbers. The functions in this module accept integers, floating-point numbers or complex numbers as arguments. They will also accept any Python object that has either a :meth:`__complex__` or a :meth:`__float__` method: these methods are used to convert the object to a complex or floating-point number, respectively, and the function is then applied to the result of the conversion.
uk: Цей модуль надає доступ до математичних функцій для комплексних чисел. Функції в цьому модулі приймають цілі числа, числа з плаваючою комою або комплексні числа як аргументи. Вони також прийматимуть будь-який об’єкт Python, який має метод :meth:`__complex__` або :meth:`__float__`: ці методи використовуються для перетворення об’єкта на комплексне число чи число з плаваючою комою відповідно, а функція є потім застосовується до результату перетворення.

source: On platforms with hardware and system-level support for signed zeros, functions involving branch cuts are continuous on *both* sides of the branch cut: the sign of the zero distinguishes one side of the branch cut from the other. On platforms that do not support signed zeros the continuity is as specified below.
uk: На платформах із апаратною та системною підтримкою нулів зі знаком функції, що включають розрізи гілок, безперервні з *обох* сторін розрізу гілки: знак нуля відрізняє одну сторону розрізу гілки від іншої. На платформах, які не підтримують нулі зі знаком, безперервність указана нижче.

source: Conversions to and from polar coordinates
uk: Перетворення в і з полярних координат

source: A Python complex number ``z`` is stored internally using *rectangular* or *Cartesian* coordinates. It is completely determined by its *real part* ``z.real`` and its *imaginary part* ``z.imag``. In other words::
uk: Комплексне число Python ``z`` зберігається всередині за допомогою *прямокутних* або *декартових* координат. Він повністю визначається його *реальною частиною* ``z.real`` та його *уявною частиною* ``z.imag``. Іншими словами::

source: *Polar coordinates* give an alternative way to represent a complex number. In polar coordinates, a complex number *z* is defined by the modulus *r* and the phase angle *phi*. The modulus *r* is the distance from *z* to the origin, while the phase *phi* is the counterclockwise angle, measured in radians, from the positive x-axis to the line segment that joins the origin to *z*.
uk: *Полярні координати* дають альтернативний спосіб представлення комплексного числа. У полярних координатах комплексне число *z* визначається модулем *r* і фазовим кутом *phi*. Модуль *r* — це відстань від *z* до початку координат, тоді як фаза *phi* — це кут проти годинникової стрілки, виміряний у радіанах, від додатної осі x до відрізка лінії, який з’єднує початок координат із *z*.

source: The following functions can be used to convert from the native rectangular coordinates to polar coordinates and back.
uk: Наступні функції можна використовувати для перетворення вихідних прямокутних координат у полярні координати та назад.

source: Return the phase of *x* (also known as the *argument* of *x*), as a float. ``phase(x)`` is equivalent to ``math.atan2(x.imag, x.real)``. The result lies in the range [-\ *π*, *π*], and the branch cut for this operation lies along the negative real axis, continuous from above. On systems with support for signed zeros (which includes most systems in current use), this means that the sign of the result is the same as the sign of ``x.imag``, even when ``x.imag`` is zero::
uk: Повертає фазу *x* (також відомий як *аргумент* *x*) як число з плаваючою точкою. ``phase(x)`` еквівалентний ``math.atan2(x.imag, x.real)``. Результат знаходиться в діапазоні [-\ *π*, *π*], а розріз гілки для цієї операції лежить уздовж від’ємної дійсної осі, неперервної зверху. У системах із підтримкою нулів зі знаком (до яких відноситься більшість систем, які зараз використовуються), це означає, що знак результату такий самий, як знак ``x.imag``, навіть якщо ``x.imag`` є нуль::

source: The modulus (absolute value) of a complex number *x* can be computed using the built-in :func:`abs` function. There is no separate :mod:`cmath` module function for this operation.
uk: Модуль (абсолютне значення) комплексного числа *x* можна обчислити за допомогою вбудованої функції :func:`abs`. Для цієї операції немає окремої функції модуля :mod:`cmath`.

source: Return the representation of *x* in polar coordinates. Returns a pair ``(r, phi)`` where *r* is the modulus of *x* and phi is the phase of *x*. ``polar(x)`` is equivalent to ``(abs(x), phase(x))``.
uk: Повертає представлення *x* у полярних координатах. Повертає пару "(r, phi)", де *r* — модуль *x*, а phi — фаза *x*. ``polar(x)`` еквівалентно ``(abs(x),phase(x))``.

source: Return the complex number *x* with polar coordinates *r* and *phi*. Equivalent to ``r * (math.cos(phi) + math.sin(phi)*1j)``.
uk: Повертає комплексне число *x* з полярними координатами *r* і *phi*. Еквівалент ``r * (math.cos(phi) + math.sin(phi)*1j)``.

source: Power and logarithmic functions
uk: Степеневі та логарифмічні функції

source: Return *e* raised to the power *x*, where *e* is the base of natural logarithms.
uk: Поверніть *e* у степені *x*, де *e* — основа натуральних логарифмів.

source: Returns the logarithm of *x* to the given *base*. If the *base* is not specified, returns the natural logarithm of *x*. There is one branch cut, from 0 along the negative real axis to -∞, continuous from above.
uk: Повертає логарифм від *x* до заданої *основи*. Якщо *основу* не вказано, повертає натуральний логарифм *x*. Існує один розріз гілки, від 0 уздовж від’ємної дійсної осі до -∞, безперервний зверху.

source: Return the base-10 logarithm of *x*. This has the same branch cut as :func:`log`.
uk: Повертає логарифм *x* за основою 10. Це такий же розріз гілки, як і :func:`log`.

source: Return the square root of *x*. This has the same branch cut as :func:`log`.
uk: Повертає квадратний корінь з *x*. Це такий же розріз гілки, як і :func:`log`.

source: Trigonometric functions
uk: Тригонометричні функції

source: Return the arc cosine of *x*. There are two branch cuts: One extends right from 1 along the real axis to ∞, continuous from below. The other extends left from -1 along the real axis to -∞, continuous from above.
uk: Повертає арккосинус *x*. Є два розрізи гілки: один тягнеться праворуч від 1 уздовж дійсної осі до ∞, безперервний знизу. Інший тягнеться ліворуч від -1 уздовж дійсної осі до -∞, безперервно зверху.

source: Return the arc sine of *x*. This has the same branch cuts as :func:`acos`.
uk: Повернути арксинус *x*. Це має такі самі скорочення гілок, як :func:`acos`.

source: Return the arc tangent of *x*. There are two branch cuts: One extends from ``1j`` along the imaginary axis to ``∞j``, continuous from the right. The other extends from ``-1j`` along the imaginary axis to ``-∞j``, continuous from the left.
uk: Поверніть арктангенс *x*. Є два розрізи гілки: один тягнеться від ``1j`` уздовж уявної осі до ``∞j``, безперервно справа. Інший простягається від ``-1j`` уздовж уявної осі ``-∞j``, безперервно зліва.

source: Return the cosine of *x*.
uk: Повертає косинус *x*.

source: Return the sine of *x*.
uk: Повернути синус *x*.

source: Return the tangent of *x*.
uk: Поверніть тангенс *x*.

source: Hyperbolic functions
uk: Гіперболічні функції

source: Return the inverse hyperbolic cosine of *x*. There is one branch cut, extending left from 1 along the real axis to -∞, continuous from above.
uk: Повертає арккосинус *x*. Є один зріз гілки, що тягнеться зліва від 1 уздовж дійсної осі до -∞, безперервний зверху.

source: Return the inverse hyperbolic sine of *x*. There are two branch cuts: One extends from ``1j`` along the imaginary axis to ``∞j``, continuous from the right. The other extends from ``-1j`` along the imaginary axis to ``-∞j``, continuous from the left.
uk: Повертає гіперболічний арксинус *x*. Є два розрізи гілки: один тягнеться від ``1j`` уздовж уявної осі до ``∞j``, безперервно справа. Інший простягається від ``-1j`` уздовж уявної осі ``-∞j``, безперервно зліва.

source: Return the inverse hyperbolic tangent of *x*. There are two branch cuts: One extends from ``1`` along the real axis to ``∞``, continuous from below. The other extends from ``-1`` along the real axis to ``-∞``, continuous from above.
uk: Повертає гіперболічний обернений тангенс *x*. Є два розрізи гілки: один тягнеться від ``1`` уздовж дійсної осі до ``∞``, безперервний знизу. Інший простягається від ``-1`` уздовж дійсної осі ``-∞``, безперервно зверху.

source: Return the hyperbolic cosine of *x*.
uk: Повертає гіперболічний косинус *x*.

source: Return the hyperbolic sine of *x*.
uk: Повернути гіперболічний синус *x*.

source: Return the hyperbolic tangent of *x*.
uk: Поверніть гіперболічний тангенс *x*.

source: Classification functions
uk: Функції класифікації

source: Return ``True`` if both the real and imaginary parts of *x* are finite, and ``False`` otherwise.
uk: Повертає ``True``, якщо і дійсна, і уявна частини *x* скінченні, і ``False`` в іншому випадку.

source: Return ``True`` if either the real or the imaginary part of *x* is an infinity, and ``False`` otherwise.
uk: Повертає ``True``, якщо дійсна чи уявна частина *x* є нескінченністю, і ``False`` в іншому випадку.

source: Return ``True`` if either the real or the imaginary part of *x* is a NaN, and ``False`` otherwise.
uk: Повертає ``True``, якщо дійсна чи уявна частина *x* є NaN, і ``False`` в іншому випадку.

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
uk: Повертає ``True``, якщо значення *a* і *b* близькі одне до одного, і ``False`` в іншому випадку.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances.
uk: Чи вважаються два значення близькими чи ні, визначається відповідно до заданих абсолютних і відносних допусків.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be greater than zero.
uk: *rel_tol* — це відносний допуск — це максимально допустима різниця між *a* і *b* відносно більшого абсолютного значення *a* або *b*. Наприклад, щоб встановити допуск 5%, передайте ``rel_tol=0,05``. Допуск за замовчуванням — ``1e-09``, який гарантує, що два значення збігаються в межах приблизно 9 десяткових цифр. *rel_tol* має бути більше нуля.

source: *abs_tol* is the minimum absolute tolerance -- useful for comparisons near zero. *abs_tol* must be at least zero.
uk: *abs_tol* — це мінімальний абсолютний допуск — корисний для порівнянь біля нуля. *abs_tol* має бути не менше нуля.

source: If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
uk: Якщо помилок не буде, результатом буде: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
uk: Спеціальні значення IEEE 754 ``NaN``, ``inf`` і ``-inf`` оброблятимуться відповідно до правил IEEE. Зокрема, ``NaN`` не вважається близьким до будь-якого іншого значення, включаючи ``NaN``. ``inf`` і ``-inf`` вважаються лише близькими до самих себе.

source: :pep:`485` -- A function for testing approximate equality
uk: :pep:`485` -- Функція для перевірки приблизної рівності

source: Constants
uk: Константи

source: The mathematical constant *π*, as a float.
uk: Математична константа *π* у вигляді числа з плаваючою точкою.

source: The mathematical constant *e*, as a float.
uk: Математична константа *e* як число з плаваючою точкою.

source: The mathematical constant *τ*, as a float.
uk: Математична константа *τ* як число з плаваючою точкою.

source: Floating-point positive infinity. Equivalent to ``float('inf')``.
uk: Додатна нескінченність із плаваючою комою. Еквівалент ``float('inf')``.

source: Complex number with zero real part and positive infinity imaginary part. Equivalent to ``complex(0.0, float('inf'))``.
uk: Комплексне число з нульовою дійсною частиною та додатною нескінченною уявною частиною. Еквівалент ``complex(0.0, float('inf'))``.

source: A floating-point "not a number" (NaN) value. Equivalent to ``float('nan')``.
uk: Значення з плаваючою комою "не число" (NaN). Еквівалент ``float('nan')``.

source: Complex number with zero real part and NaN imaginary part. Equivalent to ``complex(0.0, float('nan'))``.
uk: Комплексне число з нульовою дійсною частиною та NaN уявною частиною. Еквівалент ``complex(0.0, float('nan'))``.

source: Note that the selection of functions is similar, but not identical, to that in module :mod:`math`. The reason for having two modules is that some users aren't interested in complex numbers, and perhaps don't even know what they are. They would rather have ``math.sqrt(-1)`` raise an exception than return a complex number. Also note that the functions defined in :mod:`cmath` always return a complex number, even if the answer can be expressed as a real number (in which case the complex number has an imaginary part of zero).
uk: Зауважте, що вибір функцій подібний, але не ідентичний до вибору в модулі :mod:`math`. Причина наявності двох модулів полягає в тому, що деякі користувачі не цікавляться комплексними числами і, можливо, навіть не знають, що це таке. Вони радше, щоб ``math.sqrt(-1)`` викликав виняток, ніж повертав комплексне число. Також зауважте, що функції, визначені в :mod:`cmath`, завжди повертають комплексне число, навіть якщо відповідь може бути виражена як дійсне число (у цьому випадку комплексне число має уявну частину нуля).

source: A note on branch cuts: They are curves along which the given function fails to be continuous. They are a necessary feature of many complex functions. It is assumed that if you need to compute with complex functions, you will understand about branch cuts. Consult almost any (not too elementary) book on complex variables for enlightenment. For information of the proper choice of branch cuts for numerical purposes, a good reference should be the following:
uk: Примітка щодо розрізів гілок: це криві, уздовж яких дана функція не є неперервною. Вони є необхідною ознакою багатьох складних функцій. Передбачається, що якщо вам потрібно обчислювати зі складними функціями, ви зрозумієте про скорочення гілок. Зверніться до майже будь-якої (не надто елементарної) книги про комплексні змінні для просвітлення. Щоб отримати інформацію щодо правильного вибору обрізків гілок для чисельних цілей, гарною довідкою має бути наступне:

source: Kahan, W: Branch cuts for complex elementary functions; or, Much ado about nothing's sign bit. In Iserles, A., and Powell, M. (eds.), The state of the art in numerical analysis. Clarendon Press (1987) pp165--211.
uk: Kahan, W: Розрізи гілок для складних елементарних функцій; або "Багато шуму з нічого". У Ізерлес, А. та Пауелл, М. (ред.), Сучасний стан числового аналізу. Clarendon Press (1987) pp165--211.
