Repository: python/python-docs-uk
Catalog: library/cmd.po
Languages: uk

source: **Source code:** :source:`Lib/cmd.py`
uk: **Вихідний код:** :source:`Lib/cmd.py`

source: The :class:`Cmd` class provides a simple framework for writing line-oriented command interpreters. These are often useful for test harnesses, administrative tools, and prototypes that will later be wrapped in a more sophisticated interface.
uk: Клас :class:`Cmd` забезпечує просту структуру для написання рядково-орієнтованих інтерпретаторів команд. Вони часто корисні для тестових систем, інструментів адміністрування та прототипів, які пізніше будуть загорнуті в більш складний інтерфейс.

source: A :class:`Cmd` instance or subclass instance is a line-oriented interpreter framework. There is no good reason to instantiate :class:`Cmd` itself; rather, it's useful as a superclass of an interpreter class you define yourself in order to inherit :class:`Cmd`'s methods and encapsulate action methods.
uk: Екземпляр :class:`Cmd` або екземпляр підкласу — це рядково-орієнтована структура інтерпретатора. Немає вагомих причин створювати сам :class:`Cmd`; скоріше, це корисно як суперклас класу інтерпретатора, який ви визначаєте самостійно, щоб успадкувати методи :class:`Cmd` та інкапсулювати методи дії.

source: The optional argument *completekey* is the :mod:`readline` name of a completion key; it defaults to :kbd:`Tab`. If *completekey* is not :const:`None` and :mod:`readline` is available, command completion is done automatically.
uk: Необов’язковий аргумент *completekey* є назвою :mod:`readline` ключа завершення; типово :kbd:`Tab`. Якщо *completekey* не :const:`None` і :mod:`readline` доступний, завершення команди виконується автоматично.

source: The optional arguments *stdin* and *stdout* specify the input and output file objects that the Cmd instance or subclass instance will use for input and output. If not specified, they will default to :data:`sys.stdin` and :data:`sys.stdout`.
uk: Необов’язкові аргументи *stdin* і *stdout* визначають вхідні та вихідні файлові об’єкти, які екземпляр Cmd або екземпляр підкласу використовуватиме для введення та виведення. Якщо не вказати, за замовчуванням вони будуть :data:`sys.stdin` і :data:`sys.stdout`.

source: If you want a given *stdin* to be used, make sure to set the instance's :attr:`use_rawinput` attribute to ``False``, otherwise *stdin* will be ignored.
uk: Якщо ви хочете, щоб використовувався заданий *stdin*, обов’язково встановіть для атрибута екземпляра :attr:`use_rawinput` значення ``False``, інакше *stdin* буде проігноровано.

source: Cmd Objects
uk: Cmd об’єкти

source: A :class:`Cmd` instance has the following methods:
uk: Екземпляр :class:`Cmd` має такі методи:

source: Repeatedly issue a prompt, accept input, parse an initial prefix off the received input, and dispatch to action methods, passing them the remainder of the line as argument.
uk: Повторно видавати підказку, приймати введення, аналізувати початковий префікс отриманого введення та відправляти до методів дії, передаючи їм решту рядка як аргумент.

source: The optional argument is a banner or intro string to be issued before the first prompt (this overrides the :attr:`intro` class attribute).
uk: Необов’язковим аргументом є банер або вступний рядок, який буде виданий перед першою підказкою (це замінює атрибут класу :attr:`intro`).

source: If the :mod:`readline` module is loaded, input will automatically inherit :program:`bash`\ -like history-list editing (e.g. :kbd:`Control-P` scrolls back to the last command, :kbd:`Control-N` forward to the next one, :kbd:`Control-F` moves the cursor to the right non-destructively, :kbd:`Control-B` moves the cursor to the left non-destructively, etc.).
uk: Якщо завантажено модуль :mod:`readline`, введення автоматично успадковує :program:`bash`\ -подібне до редагування списку історії (наприклад, :kbd:`Control-P` прокручує назад до останньої команди, :kbd:`Control-N` переходить до наступного, :kbd:`Control-F` переміщує курсор праворуч недеструктивно, :kbd:`Control-B` переміщує курсор ліворуч недеструктивно тощо).

source: An end-of-file on input is passed back as the string ``'EOF'``.
uk: Кінець файлу при введенні передається назад як рядок ``'EOF'``.

source: Method called when an empty line is entered in response to the prompt. If this method is not overridden, it repeats the last nonempty command entered.
uk: Метод викликається, коли у відповідь на підказку вводиться порожній рядок. Якщо цей метод не перевизначено, він повторює останню введену непорожню команду.

source: Method called on an input line when the command prefix is not recognized. If this method is not overridden, it prints an error message and returns.
uk: Метод, який викликається у рядку введення, коли префікс команди не розпізнається. Якщо цей метод не перевизначено, він друкує повідомлення про помилку та повертається.

source: Hook method executed just before the command line *line* is interpreted, but after the input prompt is generated and issued. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses. The return value is used as the command which will be executed by the :meth:`onecmd` method; the :meth:`precmd` implementation may re-write the command or simply return *line* unchanged.
uk: Метод підхоплення виконується безпосередньо перед інтерпретацією *рядка* командного рядка, але після створення та видачі підказки введення. Цей метод є заглушкою в :class:`Cmd`; він існує, щоб бути заміненим підкласами. Повернене значення використовується як команда, яка буде виконана методом :meth:`onecmd`; реалізація :meth:`precmd` може переписати команду або просто повернути *рядок* без змін.

source: Hook method executed just after a command dispatch is finished. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses. *line* is the command line which was executed, and *stop* is a flag which indicates whether execution will be terminated after the call to :meth:`postcmd`; this will be the return value of the :meth:`onecmd` method. The return value of this method will be used as the new value for the internal flag which corresponds to *stop*; returning false will cause interpretation to continue.
uk: Метод підхоплення виконується відразу після завершення відправки команди. Цей метод є заглушкою в :class:`Cmd`; він існує, щоб бути заміненим підкласами. *рядок* — це командний рядок, який було виконано, а *стоп* — це позначка, яка вказує, чи буде виконання припинено після виклику :meth:`postcmd`; це буде значення, яке повертає метод :meth:`onecmd`. Повернене значення цього методу буде використано як нове значення для внутрішнього прапора, який відповідає *stop*; повернення false призведе до продовження інтерпретації.

source: Hook method executed once when :meth:`cmdloop` is called. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses.
uk: Метод підхоплення виконується один раз під час виклику :meth:`cmdloop`. Цей метод є заглушкою в :class:`Cmd`; він існує, щоб бути заміненим підкласами.

source: Hook method executed once when :meth:`cmdloop` is about to return. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses.
uk: Метод підключення виконується один раз, коли :meth:`cmdloop` збирається повернутися. Цей метод є заглушкою в :class:`Cmd`; він існує, щоб бути заміненим підкласами.

source: Instances of :class:`Cmd` subclasses have some public instance variables:
uk: Екземпляри підкласів :class:`Cmd` мають деякі публічні змінні екземпляра:

source: The prompt issued to solicit input.
uk: Підказка, видана для запиту введення.

source: The string of characters accepted for the command prefix.
uk: Рядок символів, прийнятний для префікса команди.

source: The last nonempty command prefix seen.
uk: Останній непорожній префікс команди.

source: A list of queued input lines. The cmdqueue list is checked in :meth:`cmdloop` when new input is needed; if it is nonempty, its elements will be processed in order, as if entered at the prompt.
uk: Список рядків введення в черзі. Список cmdqueue перевіряється в :meth:`cmdloop`, коли потрібен новий вхід; якщо він непорожній, його елементи будуть оброблені в порядку, ніби введені під час підказки.

source: A string to issue as an intro or banner. May be overridden by giving the :meth:`cmdloop` method an argument.
uk: Рядок для випуску як вступ або банер. Може бути перевизначено, надавши методу :meth:`cmdloop` аргумент.

source: The header to issue if the help output has a section for documented commands.
uk: Заголовок, який потрібно видавати, якщо вихід довідки містить розділ для задокументованих команд.

source: The character used to draw separator lines under the help-message headers. If empty, no ruler line is drawn. It defaults to ``'='``.
uk: Символ, який використовується для малювання роздільних ліній під заголовками довідкових повідомлень. Якщо поле пусте, лінія лінійки не малюється. За замовчуванням ``'='``.

source: Cmd Example
uk: Приклад команди

source: The :mod:`cmd` module is mainly useful for building custom shells that let a user work with a program interactively.
uk: Модуль :mod:`cmd` в основному корисний для створення спеціальних оболонок, які дозволяють користувачеві працювати з програмою в інтерактивному режимі.

source: This section presents a simple example of how to build a shell around a few of the commands in the :mod:`turtle` module.
uk: У цьому розділі представлено простий приклад того, як створити оболонку навколо кількох команд у модулі :mod:`turtle`.

source: Here is a sample session with the turtle shell showing the help functions, using blank lines to repeat commands, and the simple record and playback facility:
uk: Ось зразок сеансу з панциром черепахи, який показує довідкові функції, використовує порожні рядки для повторення команд, а також простий засіб запису та відтворення:

source: ? (question mark)
uk: ? (знак питання)

source: ! (exclamation)
uk: ! (знак оклику)
