Repository: python/python-docs-uk
Catalog: library/codecs.po
Languages: uk

source: Hebrew
uk: іврит

source: Western Europe
uk: Західна Європа

source: Arabic
uk: арабська

source: Greek
uk: грецька

source: Baltic languages
uk: Балтійські мови

source: Central and Eastern Europe
uk: Центральна та Східна Європа

source: Bulgarian, Byelorussian, Macedonian, Russian, Serbian
uk: болгарська, білоруська, македонська, російська, сербська

source: Turkish
uk: турецька

source: Portuguese
uk: португальська

source: Icelandic
uk: ісландська

source: Canadian
uk: канадський

source: Danish, Norwegian
uk: датська, норвезька

source: Russian
uk: російський

source: Thai
uk: тайська

source: Japanese
uk: Японський

source: Korean
uk: корейська

source: 950, ms950
uk: 950, мс950

source: Urdu
uk: урду

source: 1125, ibm1125, cp866u, ruscii
uk: 1125, ibm1125, cp866u, рос

source: Ukrainian
uk: українська

source: windows-1250
uk: вікна-1250

source: windows-1251
uk: вікна-1251

source: windows-1252
uk: вікна-1252

source: windows-1253
uk: вікна-1253

source: windows-1255
uk: вікна-1255

source: windows-1256
uk: вікна-1256

source: windows-1257
uk: вікна-1257

source: windows-1258
uk: вікна-1258

source: Vietnamese
uk: в'єтнамська

source: euckr, korean, ksc5601, ks_c-5601, ks_c-5601-1987, ksx1001, ks_x-1001
uk: euckr, корейська, ksc5601, ks_c-5601, ks_c-5601-1987, ksx1001, ks_x-1001

source: chinese, csiso58gb231280, euc-cn, euccn, eucgb2312-cn, gb2312-1980, gb2312-80, iso-ir-58
uk: китайська, csiso58gb231280, euc-cn, euccn, eucgb2312-cn, gb2312-1980, gb2312-80, iso-ir-58

source: Simplified Chinese
uk: Спрощена Китайська

source: Unified Chinese
uk: Єдина китайська

source: hz
uk: Гц

source: Japanese, Korean, Simplified Chinese, Western Europe, Greek
uk: Японська, корейська, спрощена китайська, західноєвропейська, грецька

source: Esperanto, Maltese
uk: Есперанто, мальтійська

source: iso-8859-5, cyrillic
uk: iso-8859-5, кирил

source: iso-8859-6, arabic
uk: iso-8859-6, араб

source: iso-8859-7, greek, greek8
uk: iso-8859-7, грецький, грецький8

source: iso-8859-8, hebrew
uk: iso-8859-8, іврит

source: Nordic languages
uk: Скандинавські мови

source: iso-8859-11, thai
uk: iso-8859-11, тай

source: Thai languages
uk: тайські мови

source: Celtic languages
uk: кельтські мови

source: South-Eastern Europe
uk: Південно-Східна Європа

source: johab
uk: Йохаб

source: Tajik
uk: таджицька

source: Kazakh
uk: казахська

source: maccyrillic
uk: макирилицею

source: macgreek
uk: макгрік

source: macroman, macintosh
uk: макромен, макінтош

source: csptcp154, pt154, cp154, cyrillic-asian
uk: csptcp154, pt154, cp154, кирилиця-азійська

source: all languages
uk: всі мови

source: The utf-16\* and utf-32\* encoders no longer allow surrogate code points (``U+D800``--``U+DFFF``) to be encoded. The utf-32\* decoders no longer decode byte sequences that correspond to surrogate code points.
uk: Кодери utf-16\* і utf-32\* більше не дозволяють кодувати сурогатні кодові точки (``U+D800``--``U+DFFF``). Декодери utf-32\* більше не декодують послідовності байтів, які відповідають сурогатним кодовим точкам.

source: ``cp65001`` is now an alias to ``utf_8``.
uk: ``cp65001`` тепер є псевдонімом ``utf_8``.

source: Python Specific Encodings
uk: Спеціальні кодування Python

source: A number of predefined codecs are specific to Python, so their codec names have no meaning outside Python. These are listed in the tables below based on the expected input and output types (note that while text encodings are the most common use case for codecs, the underlying codec infrastructure supports arbitrary data transforms rather than just text encodings). For asymmetric codecs, the stated meaning describes the encoding direction.
uk: Деякі попередньо визначені кодеки є специфічними для Python, тому їхні назви кодеків не мають значення поза Python. Вони перераховані в таблицях нижче на основі очікуваних типів введення та виведення (зауважте, що хоча кодування тексту є найпоширенішим випадком використання кодеків, базова інфраструктура кодеків підтримує довільні перетворення даних, а не лише кодування тексту). Для асиметричних кодеків вказане значення описує напрямок кодування.

source: Text Encodings
uk: Кодування тексту

source: The following codecs provide :class:`str` to :class:`bytes` encoding and :term:`bytes-like object` to :class:`str` decoding, similar to the Unicode text encodings.
uk: Наступні кодеки забезпечують кодування :class:`str` до :class:`bytes` і декодування :term:`bytes-like object` до :class:`str`, подібне до кодування тексту Unicode.

source: Implement :rfc:`3490`, see also :mod:`encodings.idna`. Only ``errors='strict'`` is supported.
uk: Реалізація :rfc:`3490`, див. також :mod:`encodings.idna`. Підтримується лише ``errors='strict'``.

source: Windows only: Encode the operand according to the ANSI codepage (CP_ACP).
uk: Лише для Windows: кодуйте операнд відповідно до кодової сторінки ANSI (CP_ACP).

source: Windows only: Encode the operand according to the OEM codepage (CP_OEMCP).
uk: Лише для Windows: кодуйте операнд відповідно до кодової сторінки OEM (CP_OEMCP).

source: Encoding of PalmOS 3.5.
uk: Кодування PalmOS 3.5.

source: Implement :rfc:`3492`. Stateful codecs are not supported.
uk: Впровадити :rfc:`3492`. Кодеки з підтримкою стану не підтримуються.

source: Latin-1 encoding with ``\uXXXX`` and ``\UXXXXXXXX`` for other code points. Existing backslashes are not escaped in any way. It is used in the Python pickle protocol.
uk: Кодування Latin-1 з ``\uXXXX`` і ``\UXXXXXXXX`` для інших кодових точок. Існуючі зворотні косі риски жодним чином не захищені. Він використовується в протоколі pickle Python.

source: undefined
uk: невизначений

source: Raise an exception for all conversions, even empty strings. The error handler is ignored.
uk: Викликати виняток для всіх перетворень, навіть для порожніх рядків. Обробник помилок ігнорується.

source: Encoding suitable as the contents of a Unicode literal in ASCII-encoded Python source code, except that quotes are not escaped. Decode from Latin-1 source code. Beware that Python source code actually uses UTF-8 by default.
uk: Кодування, придатне як вміст літералу Юнікод у вихідному коді Python із кодуванням ASCII, за винятком того, що лапки не екрануються. Декодувати з вихідного коду Latin-1. Майте на увазі, що вихідний код Python насправді використовує UTF-8 за замовчуванням.

source: "unicode_internal" codec is removed.
uk: Кодек "unicode_internal" видалено.

source: Binary Transforms
uk: Двійкові перетворення

source: The following codecs provide binary transforms: :term:`bytes-like object` to :class:`bytes` mappings. They are not supported by :meth:`bytes.decode` (which only produces :class:`str` output).
uk: Наступні кодеки забезпечують двійкові перетворення: :term:`bytes-like object` у :class:`bytes` зіставлення. Вони не підтримуються :meth:`bytes.decode` (який виводить лише :class:`str`).

source: Encoder / decoder
uk: Кодер / декодер

source: Convert the operand to multiline MIME base64 (the result always includes a trailing ``'\n'``).
uk: Перетворіть операнд на багаторядковий MIME base64 (результат завжди включає ``'\n'``).

source: accepts any :term:`bytes-like object` as input for encoding and decoding
uk: приймає будь-який :term:`bytes-like object` як вхідні дані для кодування та декодування

source: Compress the operand using bz2.
uk: Стисніть операнд за допомогою bz2.

source: hex
uk: шістнадцятковий

source: Convert the operand to hexadecimal representation, with two digits per byte.
uk: Перетворіть операнд у шістнадцяткове подання з двома цифрами на байт.

source: Convert the operand to MIME quoted printable.
uk: Перетворіть операнд на MIME-цитований для друку.

source: :meth:`quopri.encode` with ``quotetabs=True`` / :meth:`quopri.decode`
uk: :meth:`quopri.encode` з ``quotetabs=True`` / :meth:`quopri.decode`

source: Convert the operand using uuencode.
uk: Перетворіть операнд за допомогою uuencode.

source: Compress the operand using gzip.
uk: Стисніть операнд за допомогою gzip.

source: In addition to :term:`bytes-like objects <bytes-like object>`, ``'base64_codec'`` also accepts ASCII-only instances of :class:`str` for decoding
uk: На додаток до :term:`байт-подібних об’єктів <bytes-like object>`, ``'base64_codec''`` також приймає лише ASCII-примірники :class:`str` для декодування

source: Restoration of the binary transforms.
uk: Відновлення двійкових перетворень.

source: Restoration of the aliases for the binary transforms.
uk: Відновлення псевдонімів для бінарних перетворень.

source: Text Transforms
uk: Перетворення тексту

source: The following codec provides a text transform: a :class:`str` to :class:`str` mapping. It is not supported by :meth:`str.encode` (which only produces :class:`bytes` output).
uk: Наступний кодек забезпечує перетворення тексту: відображення :class:`str` у :class:`str`. Він не підтримується :meth:`str.encode` (який виводить лише :class:`bytes`).

source: rot13
uk: гниль13

source: Return the Caesar-cypher encryption of the operand.
uk: Повернути шифрування операнда за допомогою шифру Цезаря.

source: Restoration of the ``rot_13`` text transform.
uk: Відновлення текстового перетворення ``rot_13``.

source: Restoration of the ``rot13`` alias.
uk: Відновлення псевдоніма ``rot13``.

source: :mod:`encodings.idna` --- Internationalized Domain Names in Applications
uk: :mod:`encodings.idna` --- Інтернаціоналізовані доменні імена в програмах

source: This module implements :rfc:`3490` (Internationalized Domain Names in Applications) and :rfc:`3492` (Nameprep: A Stringprep Profile for Internationalized Domain Names (IDN)). It builds upon the ``punycode`` encoding and :mod:`stringprep`.
uk: Цей модуль реалізує :rfc:`3490` (інтернаціоналізовані доменні імена в програмах) і :rfc:`3492` (nameprep: профіль Stringprep для інтернаціоналізованих доменних імен (IDN)). Він побудований на основі кодування ``punycode`` і :mod:`stringprep`.

source: If you need the IDNA 2008 standard from :rfc:`5891` and :rfc:`5895`, use the third-party `idna module <https://pypi.org/project/idna/>`_.
uk: Якщо вам потрібен стандарт IDNA 2008 від :rfc:`5891` і :rfc:`5895`, використовуйте сторонній `idna module <https://pypi.org/project/idna/>`_.

source: These RFCs together define a protocol to support non-ASCII characters in domain names. A domain name containing non-ASCII characters (such as ``www.Alliancefrançaise.nu``) is converted into an ASCII-compatible encoding (ACE, such as ``www.xn--alliancefranaise-npb.nu``). The ACE form of the domain name is then used in all places where arbitrary characters are not allowed by the protocol, such as DNS queries, HTTP :mailheader:`Host` fields, and so on. This conversion is carried out in the application; if possible invisible to the user: The application should transparently convert Unicode domain labels to IDNA on the wire, and convert back ACE labels to Unicode before presenting them to the user.
uk: Ці RFC разом визначають протокол для підтримки символів, відмінних від ASCII, у доменних іменах. Доменне ім’я, що містить символи, відмінні від ASCII (наприклад, ``www.Alliancefrançaise.nu``), перетворюється на ASCII-сумісне кодування (ACE, наприклад ``www.xn--alliancefranaise-npb.nu``). Форма ACE імені домену потім використовується в усіх місцях, де довільні символи не дозволені протоколом, наприклад у запитах DNS, HTTP :mailheader:`Host` тощо. Це перетворення здійснюється в додатку; якщо можливо, невидимі для користувача: програма повинна прозоро перетворювати мітки домену Unicode на IDNA на дроті та перетворювати мітки ACE назад у Unicode перед тим, як представляти їх користувачеві.

source: Python supports this conversion in several ways: the ``idna`` codec performs conversion between Unicode and ACE, separating an input string into labels based on the separator characters defined in :rfc:`section 3.1 of RFC 3490 <3490#section-3.1>` and converting each label to ACE as required, and conversely separating an input byte string into labels based on the ``.`` separator and converting any ACE labels found into unicode. Furthermore, the :mod:`socket` module transparently converts Unicode host names to ACE, so that applications need not be concerned about converting host names themselves when they pass them to the socket module. On top of that, modules that have host names as function parameters, such as :mod:`http.client` and :mod:`ftplib`, accept Unicode host names (:mod:`http.client` then also transparently sends an IDNA hostname in the :mailheader:`Host` field if it sends that field at all).
uk: Python підтримує це перетворення декількома способами: кодек ``idna`` виконує перетворення між Юнікодом і ACE, розділяючи вхідний рядок на мітки на основі символів-роздільників, визначених у :rfc:`розділі 3.1 RFC 3490 <3490#section-3.1>`, і перетворюючи кожну мітку до ACE за потреби, і навпаки, розділяючи вхідний байтовий рядок на мітки на основі роздільника ``.`` і перетворюючи будь-які знайдені мітки ACE в Юнікод. Крім того, модуль :mod:`socket` прозоро перетворює імена хостів Unicode на ACE, тому програмам не потрібно турбуватися про перетворення самих імен хостів, коли вони передають їх модулю сокетів. Крім того, модулі, які мають імена хостів як параметри функцій, наприклад :mod:`http.client` і :mod:`ftplib`, приймають імена хостів Unicode (:mod:`http.client` потім також прозоро надсилає IDNA ім’я хоста в полі :mailheader:`Host`, якщо воно взагалі надсилає це поле).

source: When receiving host names from the wire (such as in reverse name lookup), no automatic conversion to Unicode is performed: applications wishing to present such host names to the user should decode them to Unicode.
uk: Під час отримання імен хостів із проводу (наприклад, під час зворотного пошуку імен) автоматичне перетворення в Unicode не виконується: програми, які бажають надати такі імена хостів користувачеві, повинні декодувати їх у Unicode.

source: The module :mod:`encodings.idna` also implements the nameprep procedure, which performs certain normalizations on host names, to achieve case-insensitivity of international domain names, and to unify similar characters. The nameprep functions can be used directly if desired.
uk: Модуль :mod:`encodings.idna` також реалізує процедуру nameprep, яка виконує певні нормалізації імен хостів, щоб досягти нечутливості до регістру міжнародних доменних імен і уніфікувати схожі символи. За бажанням можна безпосередньо використовувати функції nameprep.

source: Return the nameprepped version of *label*. The implementation currently assumes query strings, so ``AllowUnassigned`` is true.
uk: Повертає запрограмовану версію *мітки*. Реалізація наразі передбачає рядки запиту, тому ``AllowUnassigned`` є істинним.

source: Convert a label to ASCII, as specified in :rfc:`3490`. ``UseSTD3ASCIIRules`` is assumed to be false.
uk: Перетворіть мітку на ASCII, як зазначено в :rfc:`3490`. ``UseSTD3ASCIIRules`` вважається false.

source: Convert a label to Unicode, as specified in :rfc:`3490`.
uk: Перетворіть мітку в Unicode, як зазначено в :rfc:`3490`.

source: :mod:`encodings.mbcs` --- Windows ANSI codepage
uk: :mod:`encodings.mbcs` --- кодова сторінка Windows ANSI

source: This module implements the ANSI codepage (CP_ACP).
uk: Цей модуль реалізує кодову сторінку ANSI (CP_ACP).

source: :ref:`Availability <availability>`: Windows only.
uk: :ref:`Доступність <availability>`: лише для Windows.

source: Support any error handler.
uk: Підтримка будь-якого засобу обробки помилок.

source: Before 3.2, the *errors* argument was ignored; ``'replace'`` was always used to encode, and ``'ignore'`` to decode.
uk: До версії 3.2 аргумент *errors* ігнорувався; ``'replace'`` завжди використовувався для кодування, а ``'ignore''`` для декодування.

source: :mod:`encodings.utf_8_sig` --- UTF-8 codec with BOM signature
uk: :mod:`encodings.utf_8_sig` --- кодек UTF-8 із підписом BOM

source: This module implements a variant of the UTF-8 codec. On encoding, a UTF-8 encoded BOM will be prepended to the UTF-8 encoded bytes. For the stateful encoder this is only done once (on the first write to the byte stream). On decoding, an optional UTF-8 encoded BOM at the start of the data will be skipped.
uk: Цей модуль реалізує варіант кодека UTF-8. Під час кодування BOM у кодуванні UTF-8 буде додано до байтів у кодуванні UTF-8. Для кодувальника зі збереженням стану це робиться лише один раз (під час першого запису в потік байтів). Під час декодування додаткова специфікація даних у кодуванні UTF-8 на початку даних буде пропущена.
