Repository: python/python-docs-uk
Catalog: library/codeop.po
Languages: uk

source: :mod:`codeop` --- Compile Python code
uk: :mod:`codeop` --- Скомпілюйте код Python

source: **Source code:** :source:`Lib/codeop.py`
uk: **Вихідний код:** :source:`Lib/codeop.py`

source: The :mod:`codeop` module provides utilities upon which the Python read-eval-print loop can be emulated, as is done in the :mod:`code` module. As a result, you probably don't want to use the module directly; if you want to include such a loop in your program you probably want to use the :mod:`code` module instead.
uk: Модуль :mod:`codeop` надає утиліти, за допомогою яких можна емулювати цикл читання-оцінки-друку Python, як це робиться в модулі :mod:`code`. У результаті ви, ймовірно, не захочете використовувати модуль безпосередньо; якщо ви хочете включити такий цикл у свою програму, ви, ймовірно, захочете використовувати замість нього модуль :mod:`code`.

source: There are two parts to this job:
uk: У цій роботі є дві частини:

source: Being able to tell if a line of input completes a Python statement: in short, telling whether to print '``>>>``' or '``...``' next.
uk: Можливість визначити, чи рядок введення завершує інструкцію Python: коротше кажучи, вказувати, чи друкувати далі "``>>>``" або "``...``".

source: Remembering which future statements the user has entered, so subsequent input can be compiled with these in effect.
uk: Запам'ятовування, які майбутні оператори ввів користувач, щоб подальші введення можна було скомпільувати з ними.

source: The :mod:`codeop` module provides a way of doing each of these things, and a way of doing them both.
uk: Модуль :mod:`codeop` забезпечує спосіб виконання кожної з цих речей, а також спосіб виконання обох.

source: To do just the former:
uk: Щоб зробити лише перше:

source: Tries to compile *source*, which should be a string of Python code and return a code object if *source* is valid Python code. In that case, the filename attribute of the code object will be *filename*, which defaults to ``'<input>'``. Returns ``None`` if *source* is *not* valid Python code, but is a prefix of valid Python code.
uk: Намагається скомпілювати *джерело*, яке має бути рядком коду Python, і повертає об’єкт коду, якщо *джерело* є дійсним кодом Python. У цьому випадку атрибутом імені файлу об’єкта коду буде *ім’я файлу*, яке за замовчуванням має значення ``'<input>'``. Повертає ``None``, якщо *джерело* є *не* дійсним кодом Python, але є префіксом дійсного коду Python.

source: If there is a problem with *source*, an exception will be raised. :exc:`SyntaxError` is raised if there is invalid Python syntax, and :exc:`OverflowError` or :exc:`ValueError` if there is an invalid literal.
uk: Якщо є проблема з *source*, буде створено виняток. :exc:`SyntaxError` виникає, якщо є недійсний синтаксис Python, і :exc:`OverflowError` або :exc:`ValueError`, якщо є недійсний літерал.

source: The *symbol* argument determines whether *source* is compiled as a statement (``'single'``, the default), as a sequence of statements (``'exec'``) or as an :term:`expression` (``'eval'``). Any other value will cause :exc:`ValueError` to be raised.
uk: Аргумент *symbol* визначає, чи буде *source* скомпільовано як оператор (``'single'``, за замовчуванням), як послідовність операторів (``'exec'``) чи як :term:`expression` (``'eval'``). Будь-яке інше значення призведе до появи :exc:`ValueError`.

source: It is possible (but not likely) that the parser stops parsing with a successful outcome before reaching the end of the source; in this case, trailing symbols may be ignored instead of causing an error. For example, a backslash followed by two newlines may be followed by arbitrary garbage. This will be fixed once the API for the parser is better.
uk: Можливо (але малоймовірно), що синтаксичний аналізатор припиняє синтаксичний аналіз із успішним результатом до того, як досягне кінця джерела; у цьому випадку кінцеві символи можуть ігноруватися замість того, щоб викликати помилку. Наприклад, після зворотної скісної риски, за якою слідують два символи нового рядка, може стояти довільне сміття. Це буде виправлено, коли API для аналізатора стане кращим.

source: Instances of this class have :meth:`__call__` methods identical in signature to the built-in function :func:`compile`, but with the difference that if the instance compiles program text containing a :mod:`__future__` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
uk: Екземпляри цього класу мають методи :meth:`__call__`, ідентичні за сигнатурою до вбудованої функції :func:`compile`, але з тією різницею, що якщо екземпляр компілює текст програми, що містить оператор :mod:`__future__`, екземпляр "запам'ятовує" та компілює всі наступні тексти програми з чинним оператором.

source: Instances of this class have :meth:`__call__` methods identical in signature to :func:`compile_command`; the difference is that if the instance compiles program text containing a ``__future__`` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
uk: Екземпляри цього класу мають методи :meth:`__call__`, ідентичні за підписом до :func:`compile_command`; різниця полягає в тому, що якщо екземпляр компілює текст програми, що містить оператор ``__future__``, екземпляр "запам’ятовує" та компілює всі наступні тексти програми з чинним оператором.
