Repository: python/python-docs-uk
Catalog: library/codecs.po
Languages: uk

source: For encoding, *error_handler* will be called with a :exc:`UnicodeEncodeError` instance, which contains information about the location of the error. The error handler must either raise this or a different exception, or return a tuple with a replacement for the unencodable part of the input and a position where encoding should continue. The replacement may be either :class:`str` or :class:`bytes`. If the replacement is bytes, the encoder will simply copy them into the output buffer. If the replacement is a string, the encoder will encode the replacement. Encoding continues on original input at the specified position. Negative position values will be treated as being relative to the end of the input string. If the resulting position is out of bound an :exc:`IndexError` will be raised.
uk: Для кодування *error_handler* буде викликано з екземпляром :exc:`UnicodeEncodeError`, який містить інформацію про розташування помилки. Обробник помилок повинен або викликати це чи інше виключення, або повернути кортеж із заміною некодованої частини вхідних даних і позиції, де кодування повинно продовжуватися. Заміна може бути :class:`str` або :class:`bytes`. Якщо заміною є байти, кодер просто скопіює їх у вихідний буфер. Якщо заміна є рядком, кодер закодує заміну. Кодування продовжується на початковому введенні у вказаній позиції. Від’ємні значення позиції розглядатимуться як такі, що відносяться до кінця вхідного рядка. Якщо результуюча позиція виходить за межі, буде викликано :exc:`IndexError`.

source: Decoding and translating works similarly, except :exc:`UnicodeDecodeError` or :exc:`UnicodeTranslateError` will be passed to the handler and that the replacement from the error handler will be put into the output directly.
uk: Декодування та переклад працює аналогічно, за винятком того, що :exc:`UnicodeDecodeError` або :exc:`UnicodeTranslateError` буде передано обробнику, а заміна з обробника помилок буде введена безпосередньо у вивід.

source: Previously registered error handlers (including the standard error handlers) can be looked up by name:
uk: Раніше зареєстровані обробники помилок (включаючи стандартні обробники помилок) можна шукати за назвою:

source: Return the error handler previously registered under the name *name*.
uk: Повернути обробник помилок, попередньо зареєстрований під іменем *name*.

source: Raises a :exc:`LookupError` in case the handler cannot be found.
uk: Викликає :exc:`LookupError`, якщо обробник не знайдено.

source: The following standard error handlers are also made available as module level functions:
uk: Наступні стандартні обробники помилок також доступні як функції рівня модуля:

source: Implements the ``'strict'`` error handling.
uk: Реалізує ``'сувору'`` обробку помилок.

source: Each encoding or decoding error raises a :exc:`UnicodeError`.
uk: Кожна помилка кодування або декодування викликає :exc:`UnicodeError`.

source: Implements the ``'ignore'`` error handling.
uk: Реалізує обробку помилок ``'ignore''``.

source: Malformed data is ignored; encoding or decoding is continued without further notice.
uk: Некоректні дані ігноруються; кодування або декодування продовжується без додаткового повідомлення.

source: Implements the ``'replace'`` error handling.
uk: Реалізує обробку помилок ``'replace''``.

source: Substitutes ``?`` (ASCII character) for encoding errors or ``�`` (U+FFFD, the official REPLACEMENT CHARACTER) for decoding errors.
uk: Замінює ``?`` (символ ASCII) для помилок кодування або ``�`` (U+FFFD, офіційний СИМВОЛ ЗАМІНИ) для помилок декодування.

source: Implements the ``'backslashreplace'`` error handling.
uk: Реалізує обробку помилок ``'backslashreplace'``.

source: Malformed data is replaced by a backslashed escape sequence. On encoding, use the hexadecimal form of Unicode code point with formats ``\xhh`` ``\uxxxx`` ``\Uxxxxxxxx``. On decoding, use the hexadecimal form of byte value with format ``\xhh``.
uk: Неправильно сформовані дані замінюються керуючою послідовністю зі зворотною скісною рискою. Під час кодування використовуйте шістнадцяткову форму коду Unicode із форматами ``\xhh`` ``\uxxxx`` ``\Uxxxxxxxx``. Під час декодування використовуйте шістнадцяткову форму значення байта у форматі ``\xhh``.

source: Works with decoding and translating.
uk: Працює з декодуванням і перекладом.

source: Implements the ``'xmlcharrefreplace'`` error handling (for encoding within :term:`text encoding` only).
uk: Реалізує обробку помилок ``'xmlcharrefreplace'`` (лише для кодування в межах :term:`text encoding`).

source: The unencodable character is replaced by an appropriate XML/HTML numeric character reference, which is a decimal form of Unicode code point with format ``&#num;`` .
uk: Некодований символ замінюється відповідним цифровим посиланням на символ XML/HTML, яке є десятковою формою кодової точки Unicode у форматі ``&#num;``.

source: Implements the ``'namereplace'`` error handling (for encoding within :term:`text encoding` only).
uk: Реалізує обробку помилок ``'namereplace'`` (лише для кодування в межах :term:`text encoding`).

source: The unencodable character is replaced by a ``\N{...}`` escape sequence. The set of characters that appear in the braces is the Name property from Unicode Character Database. For example, the German lowercase letter ``'ß'`` will be converted to byte sequence ``\N{LATIN SMALL LETTER SHARP S}`` .
uk: Некодований символ замінюється керуючою послідовністю ``\N{...}``. Набір символів, що з’являються в фігурних дужках, є властивістю Name з бази даних символів Unicode. Наприклад, німецьку малу літеру ``'ß'`` буде перетворено на послідовність байтів ``\N{LATIN SMALL LETTER SHARP S}`` .

source: Stateless Encoding and Decoding
uk: Кодування та декодування без збереження стану

source: The base :class:`Codec` class defines these methods which also define the function interfaces of the stateless encoder and decoder:
uk: Базовий клас :class:`Codec` визначає ці методи, які також визначають функціональні інтерфейси кодера та декодера без збереження стану:

source: Encodes the object *input* and returns a tuple (output object, length consumed). For instance, :term:`text encoding` converts a string object to a bytes object using a particular character set encoding (e.g., ``cp1252`` or ``iso-8859-1``).
uk: Кодує об’єкт *input* і повертає кортеж (вихідний об’єкт, споживана довжина). Наприклад, :term:`text encoding` перетворює рядковий об’єкт на об’єкт bytes, використовуючи певне кодування набору символів (наприклад, ``cp1252`` або ``iso-8859-1``).

source: The *errors* argument defines the error handling to apply. It defaults to ``'strict'`` handling.
uk: Аргумент *errors* визначає застосовувану обробку помилок. За замовчуванням ``'сувора''`` обробка.

source: The method may not store state in the :class:`Codec` instance. Use :class:`StreamWriter` for codecs which have to keep state in order to make encoding efficient.
uk: Метод може не зберігати стан в екземплярі :class:`Codec`. Використовуйте :class:`StreamWriter` для кодеків, які мають зберігати стан, щоб зробити кодування ефективним.

source: The encoder must be able to handle zero length input and return an empty object of the output object type in this situation.
uk: У цій ситуації кодер повинен мати можливість обробляти вхідні дані нульової довжини та повертати порожній об’єкт типу вихідного об’єкта.

source: Decodes the object *input* and returns a tuple (output object, length consumed). For instance, for a :term:`text encoding`, decoding converts a bytes object encoded using a particular character set encoding to a string object.
uk: Декодує об’єкт *input* і повертає кортеж (вихідний об’єкт, споживана довжина). Наприклад, для :term:`text encoding` декодування перетворює об’єкт bytes, закодований за допомогою кодування певного набору символів, на рядковий об’єкт.

source: For text encodings and bytes-to-bytes codecs, *input* must be a bytes object or one which provides the read-only buffer interface -- for example, buffer objects and memory mapped files.
uk: Для текстових кодувань і кодеків від байтів до байтів *input* має бути об’єктом bytes або таким, який забезпечує інтерфейс буфера лише для читання – наприклад, об’єкти буфера та файли, відображені в пам’яті.

source: The method may not store state in the :class:`Codec` instance. Use :class:`StreamReader` for codecs which have to keep state in order to make decoding efficient.
uk: Метод може не зберігати стан в екземплярі :class:`Codec`. Використовуйте :class:`StreamReader` для кодеків, які мають зберігати стан, щоб зробити декодування ефективним.

source: The decoder must be able to handle zero length input and return an empty object of the output object type in this situation.
uk: У цій ситуації декодер повинен мати можливість обробляти вхідні дані нульової довжини та повертати порожній об’єкт типу вихідного об’єкта.

source: Incremental Encoding and Decoding
uk: Інкрементне кодування та декодування

source: The :class:`IncrementalEncoder` and :class:`IncrementalDecoder` classes provide the basic interface for incremental encoding and decoding. Encoding/decoding the input isn't done with one call to the stateless encoder/decoder function, but with multiple calls to the :meth:`~IncrementalEncoder.encode`/:meth:`~IncrementalDecoder.decode` method of the incremental encoder/decoder. The incremental encoder/decoder keeps track of the encoding/decoding process during method calls.
uk: Класи :class:`IncrementalEncoder` і :class:`IncrementalDecoder` забезпечують базовий інтерфейс для інкрементного кодування та декодування. Кодування/декодування вхідних даних виконується не одним викликом функції кодувальника/декодера без збереження стану, а кількома викликами методу :meth:`~IncrementalEncoder.encode`/:meth:`~IncrementalDecoder.decode` інкрементального кодувальника /декодер. Інкрементний кодер/декодер відстежує процес кодування/декодування під час викликів методів.

source: The joined output of calls to the :meth:`~IncrementalEncoder.encode`/:meth:`~IncrementalDecoder.decode` method is the same as if all the single inputs were joined into one, and this input was encoded/decoded with the stateless encoder/decoder.
uk: Об’єднаний вихід викликів методу :meth:`~IncrementalEncoder.encode`/:meth:`~IncrementalDecoder.decode` такий самий, як якби всі окремі входи були об’єднані в один, і цей вхід було закодовано/декодовано за допомогою кодер/декодер без стану.

source: IncrementalEncoder Objects
uk: Об’єкти IncrementalEncoder

source: The :class:`IncrementalEncoder` class is used for encoding an input in multiple steps. It defines the following methods which every incremental encoder must define in order to be compatible with the Python codec registry.
uk: Клас :class:`IncrementalEncoder` використовується для кодування вхідних даних у кілька кроків. Він визначає наступні методи, які повинен визначити кожен інкрементальний кодер, щоб бути сумісним із реєстром кодеків Python.

source: Constructor for an :class:`IncrementalEncoder` instance.
uk: Конструктор для екземпляра :class:`IncrementalEncoder`.

source: All incremental encoders must provide this constructor interface. They are free to add additional keyword arguments, but only the ones defined here are used by the Python codec registry.
uk: Усі інкрементні кодери повинні забезпечувати цей інтерфейс конструктора. Вони можуть вільно додавати додаткові аргументи ключових слів, але лише ті, що визначені тут, використовуються реєстром кодеків Python.

source: The :class:`IncrementalEncoder` may implement different error handling schemes by providing the *errors* keyword argument. See :ref:`error-handlers` for possible values.
uk: :class:`IncrementalEncoder` може реалізовувати різні схеми обробки помилок, надаючи аргумент ключового слова *errors*. Перегляньте :ref:`error-handlers` можливі значення.

source: The *errors* argument will be assigned to an attribute of the same name. Assigning to this attribute makes it possible to switch between different error handling strategies during the lifetime of the :class:`IncrementalEncoder` object.
uk: Аргумент *errors* буде призначено однойменному атрибуту. Призначення цьому атрибуту дає змогу перемикатися між різними стратегіями обробки помилок протягом життя об’єкта :class:`IncrementalEncoder`.

source: Encodes *object* (taking the current state of the encoder into account) and returns the resulting encoded object. If this is the last call to :meth:`encode` *final* must be true (the default is false).
uk: Кодує *об’єкт* (з урахуванням поточного стану кодувальника) і повертає отриманий закодований об’єкт. Якщо це останній виклик :meth:`encode`, *final* має бути true (за умовчанням — false).

source: Reset the encoder to the initial state. The output is discarded: call ``.encode(object, final=True)``, passing an empty byte or text string if necessary, to reset the encoder and to get the output.
uk: Скиньте кодер до початкового стану. Вихідні дані відхиляються: викличте ``.encode(object, final=True)``, передаючи порожній байт або текстовий рядок, якщо необхідно, щоб скинути кодер і отримати вихідні дані.

source: Return the current state of the encoder which must be an integer. The implementation should make sure that ``0`` is the most common state. (States that are more complicated than integers can be converted into an integer by marshaling/pickling the state and encoding the bytes of the resulting string into an integer.)
uk: Повертає поточний стан кодувальника, який має бути цілим числом. Реалізація має гарантувати, що ``0`` є найпоширенішим станом. (Стани, які є складнішими, ніж цілі числа, можна перетворити на ціле число шляхом маршалінгу/вибору стану та кодування байтів результуючого рядка в ціле число.)

source: Set the state of the encoder to *state*. *state* must be an encoder state returned by :meth:`getstate`.
uk: Встановіть стан кодера на *state*. *state* має бути станом кодувальника, який повертає :meth:`getstate`.

source: IncrementalDecoder Objects
uk: Об’єкти IncrementalDecoder

source: The :class:`IncrementalDecoder` class is used for decoding an input in multiple steps. It defines the following methods which every incremental decoder must define in order to be compatible with the Python codec registry.
uk: Клас :class:`IncrementalDecoder` використовується для декодування вхідних даних у кілька кроків. Він визначає наступні методи, які повинен визначити кожен інкрементний декодер, щоб бути сумісним із реєстром кодеків Python.

source: Constructor for an :class:`IncrementalDecoder` instance.
uk: Конструктор для екземпляра :class:`IncrementalDecoder`.

source: All incremental decoders must provide this constructor interface. They are free to add additional keyword arguments, but only the ones defined here are used by the Python codec registry.
uk: Усі інкрементні декодери повинні забезпечувати цей інтерфейс конструктора. Вони можуть вільно додавати додаткові аргументи ключових слів, але лише ті, що визначені тут, використовуються реєстром кодеків Python.

source: The :class:`IncrementalDecoder` may implement different error handling schemes by providing the *errors* keyword argument. See :ref:`error-handlers` for possible values.
uk: :class:`IncrementalDecoder` може реалізовувати різні схеми обробки помилок, надаючи аргумент ключового слова *errors*. Перегляньте :ref:`error-handlers` можливі значення.

source: The *errors* argument will be assigned to an attribute of the same name. Assigning to this attribute makes it possible to switch between different error handling strategies during the lifetime of the :class:`IncrementalDecoder` object.
uk: Аргумент *errors* буде призначено однойменному атрибуту. Призначення цьому атрибуту дає змогу перемикатися між різними стратегіями обробки помилок протягом життя об’єкта :class:`IncrementalDecoder`.

source: Decodes *object* (taking the current state of the decoder into account) and returns the resulting decoded object. If this is the last call to :meth:`decode` *final* must be true (the default is false). If *final* is true the decoder must decode the input completely and must flush all buffers. If this isn't possible (e.g. because of incomplete byte sequences at the end of the input) it must initiate error handling just like in the stateless case (which might raise an exception).
uk: Декодує *об’єкт* (з урахуванням поточного стану декодера) і повертає отриманий декодований об’єкт. Якщо це останній виклик :meth:`decode`, *final* має бути true (за умовчанням — false). Якщо *final* має значення true, декодер повинен повністю декодувати вхідні дані та скинути всі буфери. Якщо це неможливо (наприклад, через неповну послідовність байтів у кінці введення), він повинен ініціювати обробку помилок, як у випадку без стану (що може спричинити виняток).

source: Reset the decoder to the initial state.
uk: Скиньте декодер до початкового стану.

source: Return the current state of the decoder. This must be a tuple with two items, the first must be the buffer containing the still undecoded input. The second must be an integer and can be additional state info. (The implementation should make sure that ``0`` is the most common additional state info.) If this additional state info is ``0`` it must be possible to set the decoder to the state which has no input buffered and ``0`` as the additional state info, so that feeding the previously buffered input to the decoder returns it to the previous state without producing any output. (Additional state info that is more complicated than integers can be converted into an integer by marshaling/pickling the info and encoding the bytes of the resulting string into an integer.)
uk: Повернути поточний стан декодера. Це має бути кортеж із двома елементами, перший має бути буфером, що містить ще недекодований вхід. Друге має бути цілим числом і може бути додатковою інформацією про стан. (Реалізація має переконатися, що ``0`` є найпоширенішою додатковою інформацією про стан.) Якщо ця додаткова інформація про стан ``0``, має бути можливим встановити декодер у стан, який не має буферизації вхідних даних і ``0`` як додаткову інформацію про стан, так що подача попередньо буферизованого вхідного сигналу в декодер повертає його до попереднього стану без виведення. (Додаткову інформацію про стан, яка є складнішою, ніж цілі числа, можна перетворити на ціле число шляхом маршалінгу/вибору інформації та кодування байтів отриманого рядка в ціле число.)

source: Set the state of the decoder to *state*. *state* must be a decoder state returned by :meth:`getstate`.
uk: Встановіть стан декодера на *state*. *state* має бути станом декодера, який повертає :meth:`getstate`.

source: Stream Encoding and Decoding
uk: Кодування та декодування потоку

source: The :class:`StreamWriter` and :class:`StreamReader` classes provide generic working interfaces which can be used to implement new encoding submodules very easily. See :mod:`encodings.utf_8` for an example of how this is done.
uk: Класи :class:`StreamWriter` і :class:`StreamReader` забезпечують загальні робочі інтерфейси, які можна використовувати для дуже легкої реалізації нових субмодулів кодування. Перегляньте :mod:`encodings.utf_8` для прикладу того, як це робиться.

source: StreamWriter Objects
uk: Об’єкти StreamWriter

source: The :class:`StreamWriter` class is a subclass of :class:`Codec` and defines the following methods which every stream writer must define in order to be compatible with the Python codec registry.
uk: Клас :class:`StreamWriter` є підкласом :class:`Codec` і визначає наступні методи, які повинен визначити кожен записувач потоків, щоб бути сумісним із реєстром кодеків Python.

source: Constructor for a :class:`StreamWriter` instance.
uk: Конструктор для екземпляра :class:`StreamWriter`.

source: All stream writers must provide this constructor interface. They are free to add additional keyword arguments, but only the ones defined here are used by the Python codec registry.
uk: Цей інтерфейс конструктора мають надавати всі автори потоків. Вони можуть вільно додавати додаткові аргументи ключових слів, але лише ті, що визначені тут, використовуються реєстром кодеків Python.

source: The *stream* argument must be a file-like object open for writing text or binary data, as appropriate for the specific codec.
uk: Аргумент *потік* має бути файлоподібним об’єктом, відкритим для запису тексту або двійкових даних, відповідно до конкретного кодека.

source: The :class:`StreamWriter` may implement different error handling schemes by providing the *errors* keyword argument. See :ref:`error-handlers` for the standard error handlers the underlying stream codec may support.
uk: :class:`StreamWriter` може реалізовувати різні схеми обробки помилок, надаючи аргумент ключового слова *errors*. Перегляньте :ref:`error-handlers` для стандартних обробників помилок, які може підтримувати основний потоковий кодек.

source: The *errors* argument will be assigned to an attribute of the same name. Assigning to this attribute makes it possible to switch between different error handling strategies during the lifetime of the :class:`StreamWriter` object.
uk: Аргумент *errors* буде призначено однойменному атрибуту. Призначення цьому атрибуту дає змогу перемикатися між різними стратегіями обробки помилок протягом життя об’єкта :class:`StreamWriter`.

source: Writes the object's contents encoded to the stream.
uk: Записує закодований вміст об’єкта в потік.

source: Writes the concatenated iterable of strings to the stream (possibly by reusing the :meth:`write` method). Infinite or very large iterables are not supported. The standard bytes-to-bytes codecs do not support this method.
uk: Записує конкатенований ітерований рядок у потік (можливо, повторно використовуючи метод :meth:`write`). Нескінченні або дуже великі ітерації не підтримуються. Стандартні кодеки від байтів до байтів не підтримують цей метод.

source: Resets the codec buffers used for keeping internal state.
uk: Скидає буфери кодеків, які використовуються для збереження внутрішнього стану.

source: Calling this method should ensure that the data on the output is put into a clean state that allows appending of new fresh data without having to rescan the whole stream to recover state.
uk: Виклик цього методу повинен гарантувати, що дані на виході переведені в чистий стан, який дозволяє додавати нові свіжі дані без необхідності повторного сканування всього потоку для відновлення стану.

source: In addition to the above methods, the :class:`StreamWriter` must also inherit all other methods and attributes from the underlying stream.
uk: Окрім вищезазначених методів, :class:`StreamWriter` також має успадкувати всі інші методи та атрибути базового потоку.

source: StreamReader Objects
uk: Об’єкти StreamReader

source: The :class:`StreamReader` class is a subclass of :class:`Codec` and defines the following methods which every stream reader must define in order to be compatible with the Python codec registry.
uk: Клас :class:`StreamReader` є підкласом :class:`Codec` і визначає наступні методи, які повинен визначити кожен зчитувач потоку, щоб бути сумісним із реєстром кодеків Python.

source: Constructor for a :class:`StreamReader` instance.
uk: Конструктор для екземпляра :class:`StreamReader`.

source: All stream readers must provide this constructor interface. They are free to add additional keyword arguments, but only the ones defined here are used by the Python codec registry.
uk: Усі зчитувачі потоків повинні надавати цей інтерфейс конструктора. Вони можуть вільно додавати додаткові аргументи ключових слів, але лише ті, що визначені тут, використовуються реєстром кодеків Python.

source: The *stream* argument must be a file-like object open for reading text or binary data, as appropriate for the specific codec.
uk: Аргумент *потік* має бути файлоподібним об’єктом, відкритим для читання тексту або двійкових даних, відповідно до конкретного кодека.
