Repository: python/python-docs-uk
Catalog: library/codecs.po
Languages: uk

source: The :class:`StreamReader` may implement different error handling schemes by providing the *errors* keyword argument. See :ref:`error-handlers` for the standard error handlers the underlying stream codec may support.
uk: :class:`StreamReader` може реалізовувати різні схеми обробки помилок, надаючи аргумент ключового слова *errors*. Перегляньте :ref:`error-handlers` для стандартних обробників помилок, які може підтримувати основний потоковий кодек.

source: The *errors* argument will be assigned to an attribute of the same name. Assigning to this attribute makes it possible to switch between different error handling strategies during the lifetime of the :class:`StreamReader` object.
uk: Аргумент *errors* буде призначено однойменному атрибуту. Призначення цьому атрибуту дає змогу перемикатися між різними стратегіями обробки помилок протягом життя об’єкта :class:`StreamReader`.

source: The set of allowed values for the *errors* argument can be extended with :func:`register_error`.
uk: Набір дозволених значень для аргументу *errors* можна розширити за допомогою :func:`register_error`.

source: Decodes data from the stream and returns the resulting object.
uk: Декодує дані з потоку та повертає отриманий об’єкт.

source: The *chars* argument indicates the number of decoded code points or bytes to return. The :func:`read` method will never return more data than requested, but it might return less, if there is not enough available.
uk: Аргумент *chars* вказує кількість декодованих кодових точок або байтів, які потрібно повернути. Метод :func:`read` ніколи не поверне більше даних, ніж вимагається, але може повернути менше, якщо їх буде недостатньо.

source: The *size* argument indicates the approximate maximum number of encoded bytes or code points to read for decoding. The decoder can modify this setting as appropriate. The default value -1 indicates to read and decode as much as possible. This parameter is intended to prevent having to decode huge files in one step.
uk: Аргумент *size* вказує на приблизну максимальну кількість закодованих байтів або кодових точок для читання для декодування. Декодер може змінювати цей параметр за потреби. Значення за замовчуванням -1 вказує на читання та декодування якомога більшої кількості. Цей параметр призначений для запобігання необхідності декодувати великі файли за один крок.

source: The *firstline* flag indicates that it would be sufficient to only return the first line, if there are decoding errors on later lines.
uk: Прапорець *firstline* вказує на те, що було б достатньо повернути лише перший рядок, якщо в наступних рядках є помилки декодування.

source: The method should use a greedy read strategy meaning that it should read as much data as is allowed within the definition of the encoding and the given size, e.g. if optional encoding endings or state markers are available on the stream, these should be read too.
uk: Метод повинен використовувати стратегію жадібного читання, тобто він повинен зчитувати стільки даних, скільки дозволено у визначенні кодування та заданого розміру, наприклад. якщо в потоці доступні додаткові закінчення кодування або маркери стану, їх також слід прочитати.

source: Read one line from the input stream and return the decoded data.
uk: Прочитати один рядок із вхідного потоку та повернути декодовані дані.

source: *size*, if given, is passed as size argument to the stream's :meth:`read` method.
uk: *size*, якщо задано, передається як аргумент розміру в метод :meth:`read` потоку.

source: If *keepends* is false line-endings will be stripped from the lines returned.
uk: Якщо *keepends* має значення false, закінчення рядків буде видалено з повернутих рядків.

source: Read all lines available on the input stream and return them as a list of lines.
uk: Прочитати всі рядки, доступні у вхідному потоці, і повернути їх як список рядків.

source: Line-endings are implemented using the codec's :meth:`decode` method and are included in the list entries if *keepends* is true.
uk: Закінчення рядків реалізуються за допомогою методу кодека :meth:`decode` і включаються до записів списку, якщо *keepends* має значення true.

source: *sizehint*, if given, is passed as the *size* argument to the stream's :meth:`read` method.
uk: *sizehint*, якщо його задано, передається як аргумент *size* у метод потоку :meth:`read`.

source: Note that no stream repositioning should take place. This method is primarily intended to be able to recover from decoding errors.
uk: Зауважте, що переміщення потоку не повинно відбуватися. Цей метод насамперед призначений для відновлення після помилок декодування.

source: In addition to the above methods, the :class:`StreamReader` must also inherit all other methods and attributes from the underlying stream.
uk: Окрім вищезазначених методів, :class:`StreamReader` також має успадкувати всі інші методи та атрибути базового потоку.

source: StreamReaderWriter Objects
uk: Об’єкти StreamReaderWriter

source: The :class:`StreamReaderWriter` is a convenience class that allows wrapping streams which work in both read and write modes.
uk: :class:`StreamReaderWriter` — це зручний клас, який дозволяє обгортати потоки, які працюють як у режимі читання, так і в режимі запису.

source: The design is such that one can use the factory functions returned by the :func:`lookup` function to construct the instance.
uk: Конструкція така, що можна використовувати фабричні функції, які повертає функція :func:`lookup` для створення екземпляра.

source: Creates a :class:`StreamReaderWriter` instance. *stream* must be a file-like object. *Reader* and *Writer* must be factory functions or classes providing the :class:`StreamReader` and :class:`StreamWriter` interface resp. Error handling is done in the same way as defined for the stream readers and writers.
uk: Створює екземпляр :class:`StreamReaderWriter`. *потік* має бути файлоподібним об’єктом. *Reader* і *Writer* повинні бути фабричними функціями або класами, що забезпечують інтерфейс :class:`StreamReader` і :class:`StreamWriter` відповідно. Обробка помилок виконується так само, як визначено для читачів і записів потоку.

source: :class:`StreamReaderWriter` instances define the combined interfaces of :class:`StreamReader` and :class:`StreamWriter` classes. They inherit all other methods and attributes from the underlying stream.
uk: Екземпляри :class:`StreamReaderWriter` визначають комбіновані інтерфейси класів :class:`StreamReader` і :class:`StreamWriter`. Вони успадковують усі інші методи та атрибути від основного потоку.

source: StreamRecoder Objects
uk: Об’єкти StreamRecoder

source: The :class:`StreamRecoder` translates data from one encoding to another, which is sometimes useful when dealing with different encoding environments.
uk: :class:`StreamRecoder` переводить дані з одного кодування в інше, що іноді корисно, коли ви маєте справу з різними середовищами кодування.

source: Creates a :class:`StreamRecoder` instance which implements a two-way conversion: *encode* and *decode* work on the frontend — the data visible to code calling :meth:`read` and :meth:`write`, while *Reader* and *Writer* work on the backend — the data in *stream*.
uk: Створює екземпляр :class:`StreamRecoder`, який реалізує двостороннє перетворення: *encode* і *decode* працюють на інтерфейсі — дані, видимі для коду, що викликає :meth:`read` і :meth:`write`, а *Reader* і *Writer* працюють на сервері — дані в *потоці*.

source: You can use these objects to do transparent transcodings, e.g., from Latin-1 to UTF-8 and back.
uk: Ви можете використовувати ці об’єкти для прозорого перекодування, наприклад, з Latin-1 на UTF-8 і назад.

source: The *stream* argument must be a file-like object.
uk: Аргумент *потік* має бути файлоподібним об’єктом.

source: The *encode* and *decode* arguments must adhere to the :class:`Codec` interface. *Reader* and *Writer* must be factory functions or classes providing objects of the :class:`StreamReader` and :class:`StreamWriter` interface respectively.
uk: Аргументи *encode* і *decode* мають відповідати інтерфейсу :class:`Codec`. *Reader* і *Writer* повинні бути фабричними функціями або класами, що забезпечують об’єкти інтерфейсу :class:`StreamReader` і :class:`StreamWriter` відповідно.

source: Error handling is done in the same way as defined for the stream readers and writers.
uk: Обробка помилок виконується так само, як визначено для читачів і записів потоку.

source: :class:`StreamRecoder` instances define the combined interfaces of :class:`StreamReader` and :class:`StreamWriter` classes. They inherit all other methods and attributes from the underlying stream.
uk: Екземпляри :class:`StreamRecoder` визначають комбіновані інтерфейси класів :class:`StreamReader` і :class:`StreamWriter`. Вони успадковують усі інші методи та атрибути основного потоку.

source: Encodings and Unicode
uk: Кодування та Unicode

source: Strings are stored internally as sequences of code points in range ``U+0000``--``U+10FFFF``. (See :pep:`393` for more details about the implementation.) Once a string object is used outside of CPU and memory, endianness and how these arrays are stored as bytes become an issue. As with other codecs, serialising a string into a sequence of bytes is known as *encoding*, and recreating the string from the sequence of bytes is known as *decoding*. There are a variety of different text serialisation codecs, which are collectivity referred to as :term:`text encodings <text encoding>`.
uk: Рядки зберігаються внутрішньо як послідовності кодових точок у діапазоні ``U+0000``--``U+10FFFF``. (Див. :pep:`393` для отримання додаткової інформації про реалізацію.) Коли рядковий об’єкт використовується поза центральним процесором і пам’яттю, стає проблемою порядок байтів і те, як ці масиви зберігаються як байти. Як і в інших кодеках, серіалізація рядка в послідовність байтів відома як *кодування*, а відтворення рядка з послідовності байтів відоме як *декодування*. Існує безліч різних кодеків серіалізації тексту, які в сукупності називаються :term:`текстовими кодуваннями <text encoding>`.

source: The simplest text encoding (called ``'latin-1'`` or ``'iso-8859-1'``) maps the code points 0--255 to the bytes ``0x0``--``0xff``, which means that a string object that contains code points above ``U+00FF`` can't be encoded with this codec. Doing so will raise a :exc:`UnicodeEncodeError` that looks like the following (although the details of the error message may differ): ``UnicodeEncodeError: 'latin-1' codec can't encode character '\u1234' in position 3: ordinal not in range(256)``.
uk: Найпростіше кодування тексту (називається ``'latin-1'`` або ``'iso-8859-1'``) відображає кодові точки 0--255 на байти ``0x0``--``0xff``, що означає, що рядковий об’єкт, який містить кодові точки вище ``U+00FF``, не може бути закодований цим кодеком. Це призведе до появи :exc:`UnicodeEncodeError`, яка виглядає так (хоча деталі повідомлення про помилку можуть відрізнятися): ``UnicodeEncodeError: кодек 'latin-1' не може закодувати символ '\u1234' у позиції 3 : порядковий номер не в діапазоні (256)``.

source: There's another group of encodings (the so called charmap encodings) that choose a different subset of all Unicode code points and how these code points are mapped to the bytes ``0x0``--``0xff``. To see how this is done simply open e.g. :file:`encodings/cp1252.py` (which is an encoding that is used primarily on Windows). There's a string constant with 256 characters that shows you which character is mapped to which byte value.
uk: Існує ще одна група кодувань (так звані кодування charmap), які вибирають іншу підмножину всіх кодових точок Unicode і те, як ці кодові точки відображаються на байти ``0x0``--``0xff``. Щоб побачити, як це робиться, просто відкрийте, наприклад. :file:`encodings/cp1252.py` (це кодування, яке використовується в основному в Windows). Існує рядкова константа з 256 символами, яка показує, який символ зіставляється з яким значенням байта.

source: All of these encodings can only encode 256 of the 1114112 code points defined in Unicode. A simple and straightforward way that can store each Unicode code point, is to store each code point as four consecutive bytes. There are two possibilities: store the bytes in big endian or in little endian order. These two encodings are called ``UTF-32-BE`` and ``UTF-32-LE`` respectively. Their disadvantage is that if e.g. you use ``UTF-32-BE`` on a little endian machine you will always have to swap bytes on encoding and decoding. ``UTF-32`` avoids this problem: bytes will always be in natural endianness. When these bytes are read by a CPU with a different endianness, then bytes have to be swapped though. To be able to detect the endianness of a ``UTF-16`` or ``UTF-32`` byte sequence, there's the so called BOM ("Byte Order Mark"). This is the Unicode character ``U+FEFF``. This character can be prepended to every ``UTF-16`` or ``UTF-32`` byte sequence. The byte swapped version of this character (``0xFFFE``) is an illegal character that may not appear in a Unicode text. So when the first character in a ``UTF-16`` or ``UTF-32`` byte sequence appears to be a ``U+FFFE`` the bytes have to be swapped on decoding. Unfortunately the character ``U+FEFF`` had a second purpose as a ``ZERO WIDTH NO-BREAK SPACE``: a character that has no width and doesn't allow a word to be split. It can e.g. be used to give hints to a ligature algorithm. With Unicode 4.0 using ``U+FEFF`` as a ``ZERO WIDTH NO-BREAK SPACE`` has been deprecated (with ``U+2060`` (``WORD JOINER``) assuming this role). Nevertheless Unicode software still must be able to handle ``U+FEFF`` in both roles: as a BOM it's a device to determine the storage layout of the encoded bytes, and vanishes once the byte sequence has been decoded into a string; as a ``ZERO WIDTH NO-BREAK SPACE`` it's a normal character that will be decoded like any other.
uk: Усі ці кодування можуть кодувати лише 256 із 1114112 кодових точок, визначених у Unicode. Простий і зрозумілий спосіб збереження кожної кодової точки Unicode полягає в тому, щоб зберегти кожну кодову точку у вигляді чотирьох послідовних байтів. Є дві можливості: зберігати байти в порядку старшого або малого порядку. Ці два кодування називаються ``UTF-32-BE`` і ``UTF-32-LE`` відповідно. Їх недолік полягає в тому, що якщо напр. якщо ви використовуєте ``UTF-32-BE`` на машині з порядковим порядком байтів, вам завжди доведеться міняти місцями байти під час кодування та декодування. ``UTF-32`` уникає цієї проблеми: байти завжди будуть у природному порядку байтів. Коли ці байти зчитуються процесором з іншим порядком байтів, тоді байти потрібно поміняти місцями. Щоб мати можливість виявити порядок байтів послідовності байтів ``UTF-16`` або ``UTF-32``, існує так звана BOM ("Позначка порядку байтів"). Це символ Unicode ``U+FEFF``. Цей символ можна додавати до кожної послідовності байтів ``UTF-16`` або ``UTF-32``. Версія цього символу з заміною байтів (``0xFFFE``) є неприпустимим символом, який може не з’являтися в тексті Unicode. Отже, коли перший символ у послідовності байтів ``UTF-16`` або ``UTF-32`` виглядає як ``U+FFFE``, байти потрібно поміняти місцями під час декодування. На жаль, символ ``U+FEFF`` мав другу мету як ``НУЛЬОВА ШИРИНА БЕЗ РОЗБИВУ``: символ, який не має ширини і не дозволяє розділити слово. Це може напр. використовувати для надання підказок алгоритму лігатури. З Юнікодом 4.0 використання ``U+FEFF`` як ``НУЛЬОВА ШИРИНА НЕРОЗБИВНОГО ПРОБІЛУ`` застаріло (з ``U+2060`` (``WORD JOINER``) виконує цю роль). Незважаючи на це, програмне забезпечення Unicode все ще має бути в змозі обробляти ``U+FEFF`` в обох ролях: як BOM, це пристрій для визначення макета зберігання закодованих байтів і зникає, коли послідовність байтів була декодована в рядок; як ``НУЛЬОВА ШИРИНА БЕЗ РОЗБИВУ`` це звичайний символ, який буде декодовано, як і будь-який інший.

source: There's another encoding that is able to encode the full range of Unicode characters: UTF-8. UTF-8 is an 8-bit encoding, which means there are no issues with byte order in UTF-8. Each byte in a UTF-8 byte sequence consists of two parts: marker bits (the most significant bits) and payload bits. The marker bits are a sequence of zero to four ``1`` bits followed by a ``0`` bit. Unicode characters are encoded like this (with x being payload bits, which when concatenated give the Unicode character):
uk: Є інше кодування, яке може кодувати повний діапазон символів Unicode: UTF-8. UTF-8 — це 8-бітне кодування, що означає, що в UTF-8 немає проблем із порядком байтів. Кожен байт у послідовності байтів UTF-8 складається з двох частин: бітів маркера (старших бітів) і бітів корисного навантаження. Біти маркера являють собою послідовність із нуля до чотирьох бітів ``1``, за якими йде ``0`` біт. Символи Unicode кодуються таким чином (де x є бітами корисного навантаження, які при з’єднанні дають символ Unicode):

source: Range
uk: Діапазон

source: Encoding
uk: Кодування

source: The least significant bit of the Unicode character is the rightmost x bit.
uk: Наймолодшим бітом символу Юнікод є крайній правий біт x.

source: As UTF-8 is an 8-bit encoding no BOM is required and any ``U+FEFF`` character in the decoded string (even if it's the first character) is treated as a ``ZERO WIDTH NO-BREAK SPACE``.
uk: Оскільки UTF-8 є 8-бітним кодуванням, специфікація матеріалів не потрібна, і будь-який символ ``U+FEFF`` у декодованому рядку (навіть якщо це перший символ) розглядається як ``НУЛЬОВА ШИРИНА БЕЗ РОЗБИВУ`` .

source: Without external information it's impossible to reliably determine which encoding was used for encoding a string. Each charmap encoding can decode any random byte sequence. However that's not possible with UTF-8, as UTF-8 byte sequences have a structure that doesn't allow arbitrary byte sequences. To increase the reliability with which a UTF-8 encoding can be detected, Microsoft invented a variant of UTF-8 (that Python calls ``"utf-8-sig"``) for its Notepad program: Before any of the Unicode characters is written to the file, a UTF-8 encoded BOM (which looks like this as a byte sequence: ``0xef``, ``0xbb``, ``0xbf``) is written. As it's rather improbable that any charmap encoded file starts with these byte values (which would e.g. map to
uk: Без зовнішньої інформації неможливо достовірно визначити, яке кодування було використано для кодування рядка. Кожне кодування charmap може декодувати будь-яку випадкову послідовність байтів. Однак це неможливо з UTF-8, оскільки послідовності байтів UTF-8 мають структуру, яка не допускає довільних послідовностей байтів. Щоб підвищити надійність виявлення кодування UTF-8, Microsoft винайшла варіант UTF-8 (який Python називає ``"utf-8-sig"``) для своєї програми Notepad: перед будь-яким із символів Unicode записується у файл, записується BOM у кодуванні UTF-8 (який виглядає так як послідовність байтів: ``0xef``, ``0xbb``, ``0xbf``). Оскільки малоймовірно, щоб будь-який файл, закодований charmap, починався з цих значень байтів (що, наприклад, відображатиметься на

source: LATIN SMALL LETTER I WITH DIAERESIS
uk: МАЛА ЛАТИНСЬКА БУКВА I З ДІАРЕЗИСОМ

source: RIGHT-POINTING DOUBLE ANGLE QUOTATION MARK
uk: ПОДВІЙНІ КУТНІ ЛАПКИ, Спрямовані вправо

source: INVERTED QUESTION MARK
uk: ПЕРЕВЕРНУТИЙ ЗНАК ПИТАННЯ

source: in iso-8859-1), this increases the probability that a ``utf-8-sig`` encoding can be correctly guessed from the byte sequence. So here the BOM is not used to be able to determine the byte order used for generating the byte sequence, but as a signature that helps in guessing the encoding. On encoding the utf-8-sig codec will write ``0xef``, ``0xbb``, ``0xbf`` as the first three bytes to the file. On decoding ``utf-8-sig`` will skip those three bytes if they appear as the first three bytes in the file. In UTF-8, the use of the BOM is discouraged and should generally be avoided.
uk: в iso-8859-1), це збільшує ймовірність того, що кодування ``utf-8-sig`` можна правильно вгадати з послідовності байтів. Отже, тут BOM використовується не для визначення порядку байтів, який використовується для створення послідовності байтів, а як підпис, який допомагає вгадати кодування. Під час кодування кодек utf-8-sig записуватиме ``0xef``, ``0xbb``, ``0xbf`` як перші три байти до файлу. Під час декодування ``utf-8-sig`` пропустить ці три байти, якщо вони відображаються як перші три байти у файлі. В UTF-8 використання BOM не рекомендується, і його слід уникати.

source: Standard Encodings
uk: Стандартні кодування

source: Python comes with a number of codecs built-in, either implemented as C functions or with dictionaries as mapping tables. The following table lists the codecs by name, together with a few common aliases, and the languages for which the encoding is likely used. Neither the list of aliases nor the list of languages is meant to be exhaustive. Notice that spelling alternatives that only differ in case or use a hyphen instead of an underscore are also valid aliases; therefore, e.g. ``'utf-8'`` is a valid alias for the ``'utf_8'`` codec.
uk: Python поставляється з низкою вбудованих кодеків, реалізованих як функції C або зі словниками як таблиці відображення. У наведеній нижче таблиці наведено кодеки за назвами разом із кількома поширеними псевдонімами та мовами, для яких, ймовірно, використовується кодування. Ні список псевдонімів, ні список мов не є вичерпними. Зауважте, що варіанти написання, які відрізняються лише регістром або використовують дефіс замість підкреслення, також є дійсними псевдонімами; отже, напр. ``'utf-8''`` є дійсним псевдонімом для ``'utf_8''`` кодека.

source: Some common encodings can bypass the codecs lookup machinery to improve performance. These optimization opportunities are only recognized by CPython for a limited set of (case insensitive) aliases: utf-8, utf8, latin-1, latin1, iso-8859-1, iso8859-1, mbcs (Windows only), ascii, us-ascii, utf-16, utf16, utf-32, utf32, and the same using underscores instead of dashes. Using alternative aliases for these encodings may result in slower execution.
uk: Деякі поширені кодування можуть обійти механізм пошуку кодеків для підвищення продуктивності. Ці можливості оптимізації розпізнаються CPython лише для обмеженого набору (незалежних від регістру) псевдонімів: utf-8, utf8, latin-1, latin1, iso-8859-1, iso8859-1, mbcs (лише Windows), ascii, us -ascii, utf-16, utf16, utf-32, utf32 і те саме, використовуючи підкреслення замість тире. Використання альтернативних псевдонімів для цих кодувань може призвести до сповільнення виконання.

source: Optimization opportunity recognized for us-ascii.
uk: Можливість оптимізації визнана для us-ascii.

source: Many of the character sets support the same languages. They vary in individual characters (e.g. whether the EURO SIGN is supported or not), and in the assignment of characters to code positions. For the European languages in particular, the following variants typically exist:
uk: Багато наборів символів підтримують однакові мови. Вони відрізняються за окремими символами (наприклад, чи підтримується ЗНАК ЄВРО чи ні), а також за призначенням символів позиціям коду. Зокрема, для європейських мов зазвичай існують такі варіанти:

source: an ISO 8859 codeset
uk: кодовий набір ISO 8859

source: a Microsoft Windows code page, which is typically derived from an 8859 codeset, but replaces control characters with additional graphic characters
uk: кодова сторінка Microsoft Windows, яка зазвичай походить від коду 8859, але замінює контрольні символи додатковими графічними символами

source: an IBM EBCDIC code page
uk: кодову сторінку IBM EBCDIC

source: an IBM PC code page, which is ASCII compatible
uk: кодова сторінка IBM PC, сумісна з ASCII

source: Codec
uk: Кодек

source: Aliases
uk: Псевдоніми

source: Languages
uk: Мови

source: English
uk: англійська

source: big5
uk: великий5

source: Traditional Chinese
uk: Традиційний китайський

source: German
uk: Німецький
