Repository: python/python-docs-uk
Catalog: library/codecs.po
Languages: uk

source: :mod:`codecs` --- Codec registry and base classes
uk: :mod:`codecs` --- Реєстр кодеків і базові класи

source: **Source code:** :source:`Lib/codecs.py`
uk: **Вихідний код:** :source:`Lib/codecs.py`

source: This module defines base classes for standard Python codecs (encoders and decoders) and provides access to the internal Python codec registry, which manages the codec and error handling lookup process. Most standard codecs are :term:`text encodings <text encoding>`, which encode text to bytes (and decode bytes to text), but there are also codecs provided that encode text to text, and bytes to bytes. Custom codecs may encode and decode between arbitrary types, but some module features are restricted to be used specifically with :term:`text encodings <text encoding>` or with codecs that encode to :class:`bytes`.
uk: Цей модуль визначає базові класи для стандартних кодеків Python (кодери та декодери) і надає доступ до внутрішнього реєстру кодеків Python, який керує процесом пошуку кодека та обробки помилок. Більшість стандартних кодеків — це :term:`кодування тексту <text encoding>`, які кодують текст у байти (і декодують байти в текст), але є також кодеки, які кодують текст у текст і байти в байти. Спеціальні кодеки можуть кодувати та декодувати між довільними типами, але деякі функції модулів обмежено для використання спеціально з :term:`текстовими кодуваннями <text encoding>` або з кодеками, які кодують у :class:`bytes`.

source: The module defines the following functions for encoding and decoding with any codec:
uk: Модуль визначає такі функції для кодування та декодування будь-яким кодеком:

source: Encodes *obj* using the codec registered for *encoding*.
uk: Кодує *obj* за допомогою кодека, зареєстрованого для *кодування*.

source: *Errors* may be given to set the desired error handling scheme. The default error handler is ``'strict'`` meaning that encoding errors raise :exc:`ValueError` (or a more codec specific subclass, such as :exc:`UnicodeEncodeError`). Refer to :ref:`codec-base-classes` for more information on codec error handling.
uk: *Помилки* можуть бути надані для встановлення потрібної схеми обробки помилок. Обробником помилок за замовчуванням є ``'strict'``, що означає, що помилки кодування викликають :exc:`ValueError` (або більш специфічний підклас кодека, наприклад :exc:`UnicodeEncodeError`). Зверніться до :ref:`codec-base-classes` для отримання додаткової інформації щодо обробки помилок кодека.

source: Decodes *obj* using the codec registered for *encoding*.
uk: Декодує *obj* за допомогою кодека, зареєстрованого для *кодування*.

source: *Errors* may be given to set the desired error handling scheme. The default error handler is ``'strict'`` meaning that decoding errors raise :exc:`ValueError` (or a more codec specific subclass, such as :exc:`UnicodeDecodeError`). Refer to :ref:`codec-base-classes` for more information on codec error handling.
uk: *Помилки* можуть бути надані для встановлення потрібної схеми обробки помилок. Обробником помилок за замовчуванням є ``'strict'``, що означає, що помилки декодування викликають :exc:`ValueError` (або більш специфічний підклас кодека, такий як :exc:`UnicodeDecodeError`). Зверніться до :ref:`codec-base-classes` для отримання додаткової інформації про обробку помилок кодека.

source: The full details for each codec can also be looked up directly:
uk: Повну інформацію про кожен кодек також можна переглянути безпосередньо:

source: Looks up the codec info in the Python codec registry and returns a :class:`CodecInfo` object as defined below.
uk: Шукає інформацію про кодек у реєстрі кодеків Python і повертає об’єкт :class:`CodecInfo`, як визначено нижче.

source: Encodings are first looked up in the registry's cache. If not found, the list of registered search functions is scanned. If no :class:`CodecInfo` object is found, a :exc:`LookupError` is raised. Otherwise, the :class:`CodecInfo` object is stored in the cache and returned to the caller.
uk: Кодування спочатку шукаються в кеші реєстру. Якщо не знайдено, сканується список зареєстрованих функцій пошуку. Якщо об’єкт :class:`CodecInfo` не знайдено, виникає :exc:`LookupError`. В іншому випадку об’єкт :class:`CodecInfo` зберігається в кеші та повертається абоненту.

source: Codec details when looking up the codec registry. The constructor arguments are stored in attributes of the same name:
uk: Відомості про кодек під час пошуку реєстру кодеків. Аргументи конструктора зберігаються в однойменних атрибутах:

source: The name of the encoding.
uk: Назва кодування.

source: The stateless encoding and decoding functions. These must be functions or methods which have the same interface as the :meth:`~Codec.encode` and :meth:`~Codec.decode` methods of Codec instances (see :ref:`Codec Interface <codec-objects>`). The functions or methods are expected to work in a stateless mode.
uk: Функції кодування та декодування без збереження стану. Це мають бути функції чи методи, які мають той самий інтерфейс, що й методи :meth:`~Codec.encode` і :meth:`~Codec.decode` екземплярів кодека (див. :ref:`Інтерфейс кодека <codec-objects>`). Очікується, що функції або методи працюватимуть у режимі без збереження стану.

source: Incremental encoder and decoder classes or factory functions. These have to provide the interface defined by the base classes :class:`IncrementalEncoder` and :class:`IncrementalDecoder`, respectively. Incremental codecs can maintain state.
uk: Класи інкрементального кодера та декодера або заводські функції. Вони мають забезпечувати інтерфейс, визначений базовими класами :class:`IncrementalEncoder` та :class:`IncrementalDecoder` відповідно. Інкрементні кодеки можуть підтримувати стан.

source: Stream writer and reader classes or factory functions. These have to provide the interface defined by the base classes :class:`StreamWriter` and :class:`StreamReader`, respectively. Stream codecs can maintain state.
uk: Класи потокового запису та читання або фабричні функції. Вони мають забезпечувати інтерфейс, визначений базовими класами :class:`StreamWriter` і :class:`StreamReader` відповідно. Потокові кодеки можуть підтримувати стан.

source: To simplify access to the various codec components, the module provides these additional functions which use :func:`lookup` for the codec lookup:
uk: Щоб спростити доступ до різних компонентів кодека, модуль надає такі додаткові функції, які використовують :func:`lookup` для пошуку кодека:

source: Look up the codec for the given encoding and return its encoder function.
uk: Знайдіть кодек для даного кодування та поверніть його функцію кодувальника.

source: Raises a :exc:`LookupError` in case the encoding cannot be found.
uk: Викликає :exc:`LookupError`, якщо кодування не знайдено.

source: Look up the codec for the given encoding and return its decoder function.
uk: Знайдіть кодек для даного кодування та поверніть його функцію декодера.

source: Look up the codec for the given encoding and return its incremental encoder class or factory function.
uk: Знайдіть кодек для даного кодування та поверніть його інкрементний клас кодера або заводську функцію.

source: Raises a :exc:`LookupError` in case the encoding cannot be found or the codec doesn't support an incremental encoder.
uk: Викликає :exc:`LookupError`, якщо кодування не знайдено або кодек не підтримує інкрементний кодер.

source: Look up the codec for the given encoding and return its incremental decoder class or factory function.
uk: Знайдіть кодек для даного кодування та поверніть його інкрементний клас декодера або заводську функцію.

source: Raises a :exc:`LookupError` in case the encoding cannot be found or the codec doesn't support an incremental decoder.
uk: Викликає :exc:`LookupError`, якщо кодування не знайдено або кодек не підтримує інкрементний декодер.

source: Look up the codec for the given encoding and return its :class:`StreamReader` class or factory function.
uk: Знайдіть кодек для вказаного кодування та поверніть його клас :class:`StreamReader` або фабричну функцію.

source: Look up the codec for the given encoding and return its :class:`StreamWriter` class or factory function.
uk: Знайдіть кодек для вказаного кодування та поверніть його клас :class:`StreamWriter` або фабричну функцію.

source: Custom codecs are made available by registering a suitable codec search function:
uk: Спеціальні кодеки стають доступними, якщо зареєструвати відповідну функцію пошуку кодеків:

source: Register a codec search function. Search functions are expected to take one argument, being the encoding name in all lower case letters with hyphens and spaces converted to underscores, and return a :class:`CodecInfo` object. In case a search function cannot find a given encoding, it should return ``None``.
uk: Зареєструйте функцію пошуку кодеків. Очікується, що функції пошуку прийматимуть один аргумент, тобто ім’я кодування, яке складається з малих літер із дефісами та пробілами, перетворене на підкреслення, і повертатиме об’єкт :class:`CodecInfo`. Якщо функція пошуку не може знайти задане кодування, вона має повернути ``None``.

source: Hyphens and spaces are converted to underscore.
uk: Дефіси та пробіли перетворюються на підкреслення.

source: Unregister a codec search function and clear the registry's cache. If the search function is not registered, do nothing.
uk: Скасуйте реєстрацію функції пошуку кодеків і очистіть кеш реєстру. Якщо функція пошуку не зареєстрована, нічого не робіть.

source: While the builtin :func:`open` and the associated :mod:`io` module are the recommended approach for working with encoded text files, this module provides additional utility functions and classes that allow the use of a wider range of codecs when working with binary files:
uk: Хоча вбудований :func:`open` і пов’язаний модуль :mod:`io` є рекомендованим підходом для роботи з кодованими текстовими файлами, цей модуль надає додаткові службові функції та класи, які дозволяють використовувати ширший діапазон кодеків під час роботи з бінарними файлами:

source: Open an encoded file using the given *mode* and return an instance of :class:`StreamReaderWriter`, providing transparent encoding/decoding. The default file mode is ``'r'``, meaning to open the file in read mode.
uk: Відкрийте закодований файл у заданому *режимі* та поверніть екземпляр :class:`StreamReaderWriter`, забезпечуючи прозоре кодування/декодування. Типовим режимом файлу є ``'r''``, що означає відкриття файлу в режимі читання.

source: Underlying encoded files are always opened in binary mode. No automatic conversion of ``'\n'`` is done on reading and writing. The *mode* argument may be any binary mode acceptable to the built-in :func:`open` function; the ``'b'`` is automatically added.
uk: Базові закодовані файли завжди відкриваються в двійковому режимі. Під час читання та запису автоматичне перетворення ``'\n'`` не виконується. Аргументом *mode* може бути будь-який двійковий режим, прийнятний для вбудованої функції :func:`open`; ``'b''`` додається автоматично.

source: *encoding* specifies the encoding which is to be used for the file. Any encoding that encodes to and decodes from bytes is allowed, and the data types supported by the file methods depend on the codec used.
uk: *encoding* визначає кодування, яке буде використано для файлу. Дозволяється будь-яке кодування, яке кодує та декодує з байтів, а типи даних, які підтримуються методами файлів, залежать від використовуваного кодека.

source: *errors* may be given to define the error handling. It defaults to ``'strict'`` which causes a :exc:`ValueError` to be raised in case an encoding error occurs.
uk: *errors* можуть бути надані для визначення обробки помилок. За замовчуванням встановлено значення ``'strict''``, що спричиняє виникнення :exc:`ValueError` у разі виникнення помилки кодування.

source: *buffering* has the same meaning as for the built-in :func:`open` function. It defaults to -1 which means that the default buffer size will be used.
uk: *buffering* має те саме значення, що й вбудована функція :func:`open`. За замовчуванням він дорівнює -1, що означає, що буде використано стандартний розмір буфера.

source: Return a :class:`StreamRecoder` instance, a wrapped version of *file* which provides transparent transcoding. The original file is closed when the wrapped version is closed.
uk: Повертає екземпляр :class:`StreamRecoder`, загорнуту версію *файлу*, яка забезпечує прозоре перекодування. Вихідний файл закривається, коли закривається упакована версія.

source: Data written to the wrapped file is decoded according to the given *data_encoding* and then written to the original file as bytes using *file_encoding*. Bytes read from the original file are decoded according to *file_encoding*, and the result is encoded using *data_encoding*.
uk: Дані, записані в обгорнутий файл, декодуються відповідно до заданого *data_encoding*, а потім записуються в вихідний файл у вигляді байтів за допомогою *file_encoding*. Байти, зчитані з вихідного файлу, декодуються відповідно до *file_encoding*, а результат кодується за допомогою *data_encoding*.

source: If *file_encoding* is not given, it defaults to *data_encoding*.
uk: Якщо *file_encoding* не вказано, за умовчанням буде *data_encoding*.

source: *errors* may be given to define the error handling. It defaults to ``'strict'``, which causes :exc:`ValueError` to be raised in case an encoding error occurs.
uk: *errors* можуть бути надані для визначення обробки помилок. За замовчуванням встановлено ``'strict'``, що спричиняє :exc:`ValueError`, що виникає у випадку помилки кодування.

source: Uses an incremental encoder to iteratively encode the input provided by *iterator*. This function is a :term:`generator`. The *errors* argument (as well as any other keyword argument) is passed through to the incremental encoder.
uk: Використовує інкрементальний кодувальник для ітеративного кодування вхідних даних, наданих *iterator*. Ця функція є :term:`generator`. Аргумент *errors* (як і будь-який інший аргумент ключового слова) передається до інкрементального кодувальника.

source: This function requires that the codec accept text :class:`str` objects to encode. Therefore it does not support bytes-to-bytes encoders such as ``base64_codec``.
uk: Ця функція вимагає, щоб кодек приймав текстові об’єкти :class:`str` для кодування. Тому він не підтримує кодувальники байт-у-байт, такі як ``base64_codec``.

source: Uses an incremental decoder to iteratively decode the input provided by *iterator*. This function is a :term:`generator`. The *errors* argument (as well as any other keyword argument) is passed through to the incremental decoder.
uk: Використовує інкрементальний декодер для ітеративного декодування вхідних даних, наданих *iterator*. Ця функція є :term:`generator`. Аргумент *errors* (як і будь-який інший аргумент ключового слова) передається до інкрементального декодера.

source: This function requires that the codec accept :class:`bytes` objects to decode. Therefore it does not support text-to-text encoders such as ``rot_13``, although ``rot_13`` may be used equivalently with :func:`iterencode`.
uk: Ця функція вимагає, щоб кодек приймав об’єкти :class:`bytes` для декодування. Тому він не підтримує кодувальники тексту в текст, такі як ``rot_13``, хоча ``rot_13`` можна використовувати еквівалентно з :func:`iterencode`.

source: The module also provides the following constants which are useful for reading and writing to platform dependent files:
uk: Модуль також надає наступні константи, які корисні для читання та запису в залежні від платформи файли:

source: These constants define various byte sequences, being Unicode byte order marks (BOMs) for several encodings. They are used in UTF-16 and UTF-32 data streams to indicate the byte order used, and in UTF-8 as a Unicode signature. :const:`BOM_UTF16` is either :const:`BOM_UTF16_BE` or :const:`BOM_UTF16_LE` depending on the platform's native byte order, :const:`BOM` is an alias for :const:`BOM_UTF16`, :const:`BOM_LE` for :const:`BOM_UTF16_LE` and :const:`BOM_BE` for :const:`BOM_UTF16_BE`. The others represent the BOM in UTF-8 and UTF-32 encodings.
uk: Ці константи визначають різні послідовності байтів, будучи мітками порядку байтів Unicode (BOM) для кількох кодувань. Вони використовуються в потоках даних UTF-16 і UTF-32 для позначення використовуваного порядку байтів, а в UTF-8 як підпис Юнікод. :const:`BOM_UTF16` є або :const:`BOM_UTF16_BE`, або :const:`BOM_UTF16_LE` залежно від рідного порядку байтів платформи, :const:`BOM` є псевдонімом для :const:`BOM_UTF16`, :const:`BOM_LE` для :const:`BOM_UTF16_LE` і :const:`BOM_BE` для :const:`BOM_UTF16_BE`. Інші представляють специфікацію в кодуваннях UTF-8 і UTF-32.

source: Codec Base Classes
uk: Базові класи кодеків

source: The :mod:`codecs` module defines a set of base classes which define the interfaces for working with codec objects, and can also be used as the basis for custom codec implementations.
uk: Модуль :mod:`codecs` визначає набір базових класів, які визначають інтерфейси для роботи з об’єктами кодеків, а також може бути використаний як основа для користувацьких реалізацій кодеків.

source: Each codec has to define four interfaces to make it usable as codec in Python: stateless encoder, stateless decoder, stream reader and stream writer. The stream reader and writers typically reuse the stateless encoder/decoder to implement the file protocols. Codec authors also need to define how the codec will handle encoding and decoding errors.
uk: Кожен кодек має визначати чотири інтерфейси, щоб зробити його придатним для використання як кодек у Python: кодер без стану, декодер без стану, читач потоку та запис потоку. Зчитувач і записувач потоків зазвичай повторно використовують кодер/декодер без збереження стану для реалізації протоколів файлів. Автори кодеків також повинні визначити, як кодек оброблятиме помилки кодування та декодування.

source: Error Handlers
uk: Обробники помилок

source: To simplify and standardize error handling, codecs may implement different error handling schemes by accepting the *errors* string argument:
uk: Щоб спростити та стандартизувати обробку помилок, кодеки можуть реалізовувати різні схеми обробки помилок, приймаючи рядковий аргумент *errors*:

source: The following error handlers can be used with all Python :ref:`standard-encodings` codecs:
uk: Наступні обробники помилок можна використовувати з усіма кодеками Python :ref:`standard-encodings`:

source: Value
uk: Значення

source: Meaning
uk: Значення

source: ``'strict'``
uk: ``'строгий''``

source: Raise :exc:`UnicodeError` (or a subclass), this is the default. Implemented in :func:`strict_errors`.
uk: Викликати :exc:`UnicodeError` (або підклас), це типово. Реалізовано в :func:`strict_errors`.

source: ``'ignore'``
uk: ``'ігнорувати''``

source: Ignore the malformed data and continue without further notice. Implemented in :func:`ignore_errors`.
uk: Ігноруйте неправильні дані та продовжуйте без додаткового повідомлення. Реалізовано в :func:`ignore_errors`.

source: ``'replace'``
uk: ``'замінити'``

source: Replace with a replacement marker. On encoding, use ``?`` (ASCII character). On decoding, use ``�`` (U+FFFD, the official REPLACEMENT CHARACTER). Implemented in :func:`replace_errors`.
uk: Замініть маркером заміни. У кодуванні використовуйте ``?`` (символ ASCII). Під час декодування використовуйте ``�`` (U+FFFD, офіційний СИМВОЛ ЗАМІНИ). Реалізовано в :func:`replace_errors`.

source: ``'backslashreplace'``
uk: ``'заміна зворотної косої риски''``

source: Replace with backslashed escape sequences. On encoding, use hexadecimal form of Unicode code point with formats ``\xhh`` ``\uxxxx`` ``\Uxxxxxxxx``. On decoding, use hexadecimal form of byte value with format ``\xhh``. Implemented in :func:`backslashreplace_errors`.
uk: Замінити керуючими послідовностями зі зворотною скісною рискою. Під час кодування використовуйте шістнадцяткову форму коду Unicode із форматами ``\xhh`` ``\uxxxx`` ``\Uxxxxxxxx``. Під час декодування використовуйте шістнадцяткову форму значення байта у форматі ``\xhh``. Реалізовано в :func:`backslashreplace_errors`.

source: ``'surrogateescape'``
uk: ``'сурогатна втеча'``

source: On decoding, replace byte with individual surrogate code ranging from ``U+DC80`` to ``U+DCFF``. This code will then be turned back into the same byte when the ``'surrogateescape'`` error handler is used when encoding the data. (See :pep:`383` for more.)
uk: Під час декодування замініть байт окремим сурогатним кодом у діапазоні від ``U+DC80`` до ``U+DCFF``. Потім цей код буде перетворено назад у той самий байт, коли під час кодування даних використовується обробник помилок ``'surrogateescape'``. (Докладніше див. :pep:`383`.)

source: The following error handlers are only applicable to encoding (within :term:`text encodings <text encoding>`):
uk: Наступні обробники помилок застосовуються лише до кодування (в межах :term:`кодування тексту <text encoding>`):

source: Replace with XML/HTML numeric character reference, which is a decimal form of Unicode code point with format ``&#num;`` Implemented in :func:`xmlcharrefreplace_errors`.
uk: Замініть посиланням на числові символи XML/HTML, які є десятковою формою кодової точки Unicode із форматом ``&#num;``, реалізованим у :func:`xmlcharrefreplace_errors`.

source: Replace with ``\N{...}`` escape sequences, what appears in the braces is the Name property from Unicode Character Database. Implemented in :func:`namereplace_errors`.
uk: Замініть керуючу послідовність ``\N{...}``, що відображається в фігурних дужках — це властивість Name із бази даних символів Unicode. Реалізовано в :func:`namereplace_errors`.

source: In addition, the following error handler is specific to the given codecs:
uk: Крім того, наступний обробник помилок є специфічним для даних кодеків:

source: Codecs
uk: Кодеки

source: ``'surrogatepass'``
uk: ``'сурогатний пропуск''``

source: Allow encoding and decoding surrogate code point (``U+D800`` - ``U+DFFF``) as normal code point. Otherwise these codecs treat the presence of surrogate code point in :class:`str` as an error.
uk: Дозволити кодування та декодування сурогатної кодової точки (``U+D800`` - ``U+DFFF``) як звичайну кодову точку. Інакше ці кодеки розглядають наявність сурогатної кодової точки в :class:`str` як помилку.

source: The ``'surrogateescape'`` and ``'surrogatepass'`` error handlers.
uk: Обробники помилок ``'surrogateescape'`` і ``'surrogatepass'``.

source: The ``'surrogatepass'`` error handler now works with utf-16\* and utf-32\* codecs.
uk: Обробник помилок ``'surrogatepass'`` тепер працює з кодеками utf-16\* і utf-32\*.

source: The ``'namereplace'`` error handler.
uk: Обробник помилок ``'namereplace``.

source: The ``'backslashreplace'`` error handler now works with decoding and translating.
uk: Обробник помилок ``'backslashreplace'`` тепер працює з декодуванням і перекладом.

source: The set of allowed values can be extended by registering a new named error handler:
uk: Набір дозволених значень можна розширити, зареєструвавши новий іменований обробник помилок:

source: Register the error handling function *error_handler* under the name *name*. The *error_handler* argument will be called during encoding and decoding in case of an error, when *name* is specified as the errors parameter.
uk: Зареєструйте функцію обробки помилок *error_handler* під назвою *name*. Аргумент *error_handler* буде викликаний під час кодування та декодування у разі помилки, якщо *name* вказано як параметр errors.
