Repository: python/python-docs-uk
Catalog: library/collections.po
Languages: uk

source: Return the position of *x* in the deque (at or after index *start* and before index *stop*). Returns the first match or raises :exc:`ValueError` if not found.
uk: Повертає позицію *x* у черзі (за індексом *start* і перед індексом *stop*). Повертає перший збіг або викликає :exc:`ValueError`, якщо не знайдено.

source: Insert *x* into the deque at position *i*.
uk: Вставте *x* у рядок у позицію *i*.

source: If the insertion would cause a bounded deque to grow beyond *maxlen*, an :exc:`IndexError` is raised.
uk: Якщо вставка призведе до того, що обмежена двочерга виросте за межі *maxlen*, виникає :exc:`IndexError`.

source: Remove and return an element from the right side of the deque. If no elements are present, raises an :exc:`IndexError`.
uk: Видаліть і поверніть елемент з правого боку двоканальної таблиці. Якщо немає елементів, викликає :exc:`IndexError`.

source: Remove and return an element from the left side of the deque. If no elements are present, raises an :exc:`IndexError`.
uk: Видаліть і поверніть елемент з лівої сторони двосторонньої версії. Якщо немає елементів, викликає :exc:`IndexError`.

source: Remove the first occurrence of *value*. If not found, raises a :exc:`ValueError`.
uk: Видаліть перше входження *значення*. Якщо не знайдено, викликає :exc:`ValueError`.

source: Reverse the elements of the deque in-place and then return ``None``.
uk: Перевернути елементи дек-версії на місці, а потім повернути ``None``.

source: Rotate the deque *n* steps to the right. If *n* is negative, rotate to the left.
uk: Поверніть двічі *n* кроків праворуч. Якщо *n* від’ємне, поверніть ліворуч.

source: When the deque is not empty, rotating one step to the right is equivalent to ``d.appendleft(d.pop())``, and rotating one step to the left is equivalent to ``d.append(d.popleft())``.
uk: Якщо двочерга не порожня, поворот на один крок праворуч еквівалентний d.appendleft(d.pop()) , а поворот на один крок ліворуч еквівалентний d.append(d.popleft ())``.

source: Deque objects also provide one read-only attribute:
uk: Об’єкти Deque також надають один атрибут лише для читання:

source: Maximum size of a deque or ``None`` if unbounded.
uk: Максимальний розмір двочергового рядка або ``None``, якщо необмежений.

source: Starting in version 3.5, deques support ``__add__()``, ``__mul__()``, and ``__imul__()``.
uk: Починаючи з версії 3.5, deques підтримують ``__add__()``, ``__mul__()`` і ``__imul__()``.

source: Example:
uk: приклад:

source: :class:`deque` Recipes
uk: :class:`deque` Рецепти

source: This section shows various approaches to working with deques.
uk: У цьому розділі показано різні підходи до роботи з deque.

source: Bounded length deques provide functionality similar to the ``tail`` filter in Unix::
uk: Обмежена довжина двостороннього ряду забезпечує функціональність, подібну до фільтра ``tail`` в Unix::

source: Another approach to using deques is to maintain a sequence of recently added elements by appending to the right and popping to the left::
uk: Інший підхід до використання двох блоків полягає в підтримці послідовності нещодавно доданих елементів шляхом додавання праворуч і висування ліворуч:

source: A `round-robin scheduler <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ can be implemented with input iterators stored in a :class:`deque`. Values are yielded from the active iterator in position zero. If that iterator is exhausted, it can be removed with :meth:`~deque.popleft`; otherwise, it can be cycled back to the end with the :meth:`~deque.rotate` method::
uk: `Циклічний планувальник <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ може бути реалізований за допомогою ітераторів введення, що зберігаються в :class:`deque`. Значення виводяться з активного ітератора в нульовій позиції. Якщо цей ітератор вичерпано, його можна видалити за допомогою :meth:`~deque.popleft`; інакше його можна повернути до кінця за допомогою методу :meth:`~deque.rotate`::

source: The :meth:`~deque.rotate` method provides a way to implement :class:`deque` slicing and deletion. For example, a pure Python implementation of ``del d[n]`` relies on the ``rotate()`` method to position elements to be popped::
uk: Метод :meth:`~deque.rotate` забезпечує спосіб реалізації :class:`deque` нарізки та видалення. Наприклад, чиста реалізація ``del d[n]`` на Python покладається на метод ``rotate()`` для позиціонування елементів, які потрібно відкрити:

source: To implement :class:`deque` slicing, use a similar approach applying :meth:`~deque.rotate` to bring a target element to the left side of the deque. Remove old entries with :meth:`~deque.popleft`, add new entries with :meth:`~deque.extend`, and then reverse the rotation. With minor variations on that approach, it is easy to implement Forth style stack manipulations such as ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot``, and ``roll``.
uk: Щоб реалізувати нарізку :class:`deque`, скористайтеся подібним підходом, застосовуючи :meth:`~deque.rotate`, щоб перемістити цільовий елемент у ліву сторону від deque. Видаліть старі записи за допомогою :meth:`~deque.popleft`, додайте нові за допомогою :meth:`~deque.extend`, а потім змініть чергування. З незначними варіаціями цього підходу легко реалізувати маніпуляції стеком у стилі Forth, такі як ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot`` і ``roll``.

source: :class:`defaultdict` objects
uk: :class:`defaultdict` об’єкти

source: Return a new dictionary-like object. :class:`defaultdict` is a subclass of the built-in :class:`dict` class. It overrides one method and adds one writable instance variable. The remaining functionality is the same as for the :class:`dict` class and is not documented here.
uk: Повернути новий об’єкт, схожий на словник. :class:`defaultdict` є підкласом вбудованого класу :class:`dict`. Він замінює один метод і додає одну змінну екземпляра, доступну для запису. Інші функції такі ж, як і для класу :class:`dict`, і тут не описані.

source: The first argument provides the initial value for the :attr:`default_factory` attribute; it defaults to ``None``. All remaining arguments are treated the same as if they were passed to the :class:`dict` constructor, including keyword arguments.
uk: Перший аргумент надає початкове значення для атрибута :attr:`default_factory`; за замовчуванням ``None``. Усі решта аргументів обробляються так само, як якщо б вони були передані конструктору :class:`dict`, включаючи аргументи ключових слів.

source: :class:`defaultdict` objects support the following method in addition to the standard :class:`dict` operations:
uk: Об’єкти :class:`defaultdict` підтримують наступний метод на додаток до стандартних операцій :class:`dict`:

source: If the :attr:`default_factory` attribute is ``None``, this raises a :exc:`KeyError` exception with the *key* as argument.
uk: Якщо атрибут :attr:`default_factory` має значення ``None``, це викликає виключення :exc:`KeyError` з *key* як аргументом.

source: If :attr:`default_factory` is not ``None``, it is called without arguments to provide a default value for the given *key*, this value is inserted in the dictionary for the *key*, and returned.
uk: Якщо :attr:`default_factory` не є ``None``, він викликається без аргументів, щоб надати значення за замовчуванням для даного *ключа*, це значення вставляється в словник для *ключа* та повертається.

source: If calling :attr:`default_factory` raises an exception this exception is propagated unchanged.
uk: Якщо виклик :attr:`default_factory` викликає виняток, цей виняток поширюється без змін.

source: :class:`defaultdict` objects support the following instance variable:
uk: Об’єкти :class:`defaultdict` підтримують таку змінну екземпляра:

source: This attribute is used by the :meth:`__missing__` method; it is initialized from the first argument to the constructor, if present, or to ``None``, if absent.
uk: Цей атрибут використовується методом :meth:`__missing__`; він ініціалізується від першого аргументу до конструктора, якщо він присутній, або до ``None``, якщо його немає.

source: Added merge (``|``) and update (``|=``) operators, specified in :pep:`584`.
uk: Додано оператори злиття (``|``) і оновлення (``|=``), указані в :pep:`584`.

source: :class:`defaultdict` Examples
uk: :class:`defaultdict` Приклади

source: Using :class:`list` as the :attr:`~defaultdict.default_factory`, it is easy to group a sequence of key-value pairs into a dictionary of lists:
uk: Використовуючи :class:`list` як :attr:`~defaultdict.default_factory`, можна легко згрупувати послідовність пар ключ-значення в словник списків:

source: When each key is encountered for the first time, it is not already in the mapping; so an entry is automatically created using the :attr:`~defaultdict.default_factory` function which returns an empty :class:`list`. The :meth:`list.append` operation then attaches the value to the new list. When keys are encountered again, the look-up proceeds normally (returning the list for that key) and the :meth:`list.append` operation adds another value to the list. This technique is simpler and faster than an equivalent technique using :meth:`dict.setdefault`:
uk: Коли кожен ключ зустрічається вперше, його ще немає у відображенні; тому запис створюється автоматично за допомогою функції :attr:`~defaultdict.default_factory`, яка повертає порожній :class:`list`. Потім операція :meth:`list.append` додає значення до нового списку. Коли ключі зустрічаються знову, пошук триває нормально (повертається список для цього ключа), а операція :meth:`list.append` додає інше значення до списку. Ця техніка простіша та швидша, ніж еквівалентна техніка з використанням :meth:`dict.setdefault`:

source: Setting the :attr:`~defaultdict.default_factory` to :class:`int` makes the :class:`defaultdict` useful for counting (like a bag or multiset in other languages):
uk: Встановлення :attr:`~defaultdict.default_factory` на :class:`int` робить :class:`defaultdict` корисним для підрахунку (як сумка або мультинабір в інших мовах):

source: When a letter is first encountered, it is missing from the mapping, so the :attr:`~defaultdict.default_factory` function calls :func:`int` to supply a default count of zero. The increment operation then builds up the count for each letter.
uk: Коли буква зустрічається вперше, вона відсутня у відображенні, тому функція :attr:`~defaultdict.default_factory` викликає :func:`int`, щоб надати нульову кількість за умовчанням. Потім операція збільшення створює кількість для кожної літери.

source: The function :func:`int` which always returns zero is just a special case of constant functions. A faster and more flexible way to create constant functions is to use a lambda function which can supply any constant value (not just zero):
uk: Функція :func:`int`, яка завжди повертає нуль, є лише окремим випадком постійних функцій. Швидший і більш гнучкий спосіб створення постійних функцій полягає у використанні лямбда-функції, яка може надати будь-яке постійне значення (не лише нуль):

source: Setting the :attr:`~defaultdict.default_factory` to :class:`set` makes the :class:`defaultdict` useful for building a dictionary of sets:
uk: Встановлення :attr:`~defaultdict.default_factory` на :class:`set` робить :class:`defaultdict` корисним для створення словника наборів:

source: :func:`namedtuple` Factory Function for Tuples with Named Fields
uk: :func:`namedtuple` Фабрична функція для кортежів з іменованими полями

source: Named tuples assign meaning to each position in a tuple and allow for more readable, self-documenting code. They can be used wherever regular tuples are used, and they add the ability to access fields by name instead of position index.
uk: Іменовані кортежі призначають значення кожній позиції в кортежі та забезпечують більш читабельний самодокументований код. Їх можна використовувати скрізь, де використовуються звичайні кортежі, і вони додають можливість доступу до полів за назвою замість індексу позиції.

source: Returns a new tuple subclass named *typename*. The new subclass is used to create tuple-like objects that have fields accessible by attribute lookup as well as being indexable and iterable. Instances of the subclass also have a helpful docstring (with typename and field_names) and a helpful :meth:`__repr__` method which lists the tuple contents in a ``name=value`` format.
uk: Повертає новий підклас кортежу з назвою *typename*. Новий підклас використовується для створення кортежних об’єктів, які мають поля, доступні за допомогою пошуку атрибутів, а також які можна індексувати та повторювати. Екземпляри підкласу також мають корисний рядок документації (з назвою типу та іменами полів) і корисний метод :meth:`__repr__`, який перераховує вміст кортежу у форматі ``ім'я=значення``.

source: The *field_names* are a sequence of strings such as ``['x', 'y']``. Alternatively, *field_names* can be a single string with each fieldname separated by whitespace and/or commas, for example ``'x y'`` or ``'x, y'``.
uk: *Імена_полів* — це послідовність рядків, наприклад ``['x', 'y']``. Крім того, *назви_полів* можуть бути одним рядком із назвою кожного поля, розділеного пробілами та/або комами, наприклад ``'x y'`` або ``'x, y'``.

source: Any valid Python identifier may be used for a fieldname except for names starting with an underscore. Valid identifiers consist of letters, digits, and underscores but do not start with a digit or underscore and cannot be a :mod:`keyword` such as *class*, *for*, *return*, *global*, *pass*, or *raise*.
uk: Для імені поля можна використовувати будь-який дійсний ідентифікатор Python, за винятком імен, що починаються з підкреслення. Дійсні ідентифікатори складаються з літер, цифр і підкреслення, але не починаються з цифри або підкреслення і не можуть бути :mod:`keyword`, таким як *клас*, *для*, *повернення*, *глобальний*, *перехід* , або *підняти*.

source: If *rename* is true, invalid fieldnames are automatically replaced with positional names. For example, ``['abc', 'def', 'ghi', 'abc']`` is converted to ``['abc', '_1', 'ghi', '_3']``, eliminating the keyword ``def`` and the duplicate fieldname ``abc``.
uk: Якщо *rename* має значення true, недійсні назви полів автоматично замінюються позиційними іменами. Наприклад, ``['abc', 'def', 'ghi', 'abc']`` перетворюється на ``['abc', '_1', 'ghi', '_3']``, усуваючи ключове слово ``def`` і повторюване ім’я поля ``abc``.

source: *defaults* can be ``None`` or an :term:`iterable` of default values. Since fields with a default value must come after any fields without a default, the *defaults* are applied to the rightmost parameters. For example, if the fieldnames are ``['x', 'y', 'z']`` and the defaults are ``(1, 2)``, then ``x`` will be a required argument, ``y`` will default to ``1``, and ``z`` will default to ``2``.
uk: *defaults* може бути ``None`` або :term:`iterable` значень за замовчуванням. Оскільки поля зі значенням за замовчуванням мають бути після будь-яких полів без значення за замовчуванням, *за замовчуванням* застосовуються до крайніх правих параметрів. Наприклад, якщо імена полів ``['x', 'y', 'z']``, а значення за умовчанням ``(1, 2)``, тоді ``x`` буде обов'язковим аргументом, ``y`` за замовчуванням буде ``1``, а ``z`` буде ``2``.

source: Named tuple instances do not have per-instance dictionaries, so they are lightweight and require no more memory than regular tuples.
uk: Іменовані екземпляри кортежу не мають словників для кожного екземпляра, тому вони легкі та не вимагають більше пам’яті, ніж звичайні кортежі.

source: To support pickling, the named tuple class should be assigned to a variable that matches *typename*.
uk: Щоб підтримувати маринування, іменований клас кортежу має бути призначений змінній, яка відповідає *typename*.

source: Added support for *rename*.
uk: Додано підтримку *перейменування*.

source: The *verbose* and *rename* parameters became :ref:`keyword-only arguments <keyword-only_parameter>`.
uk: Параметри *verbose* і *rename* стали :ref:`аргументами лише для ключових слів <keyword-only_parameter>`.

source: Added the *module* parameter.
uk: Додано параметр *module*.

source: Removed the *verbose* parameter and the :attr:`_source` attribute.
uk: Видалено параметр *verbose* і атрибут :attr:`_source`.

source: Added the *defaults* parameter and the :attr:`_field_defaults` attribute.
uk: Додано параметр *defaults* і атрибут :attr:`_field_defaults`.

source: Named tuples are especially useful for assigning field names to result tuples returned by the :mod:`csv` or :mod:`sqlite3` modules::
uk: Іменовані кортежі особливо корисні для призначення імен полів кортежам результатів, які повертаються модулями :mod:`csv` або :mod:`sqlite3`::

source: In addition to the methods inherited from tuples, named tuples support three additional methods and two attributes. To prevent conflicts with field names, the method and attribute names start with an underscore.
uk: На додаток до методів, успадкованих від кортежів, іменовані кортежі підтримують три додаткові методи та два атрибути. Щоб запобігти конфліктам імен полів, імена методів і атрибутів починаються зі знака підкреслення.

source: Class method that makes a new instance from an existing sequence or iterable.
uk: Метод класу, який створює новий екземпляр із існуючої послідовності або повторюється.

source: Return a new :class:`dict` which maps field names to their corresponding values:
uk: Повертає новий :class:`dict`, який зіставляє назви полів з відповідними значеннями:

source: Returns an :class:`OrderedDict` instead of a regular :class:`dict`.
uk: Повертає :class:`OrderedDict` замість звичайного :class:`dict`.

source: Returns a regular :class:`dict` instead of an :class:`OrderedDict`. As of Python 3.7, regular dicts are guaranteed to be ordered. If the extra features of :class:`OrderedDict` are required, the suggested remediation is to cast the result to the desired type: ``OrderedDict(nt._asdict())``.
uk: Повертає звичайний :class:`dict` замість :class:`OrderedDict`. Починаючи з Python 3.7, звичайні dicts гарантовано будуть упорядковані. Якщо потрібні додаткові функції :class:`OrderedDict`, запропонованим виправленням є приведення результату до потрібного типу: ``OrderedDict(nt._asdict())``.

source: Return a new instance of the named tuple replacing specified fields with new values::
uk: Повертає новий екземпляр іменованого кортежу, замінюючи вказані поля новими значеннями::

source: Tuple of strings listing the field names. Useful for introspection and for creating new named tuple types from existing named tuples.
uk: Кортеж рядків із переліком імен полів. Корисно для самоаналізу та для створення нових іменованих типів кортежів із існуючих іменованих кортежів.

source: Dictionary mapping field names to default values.
uk: Словник зіставляє назви полів зі значеннями за замовчуванням.

source: To retrieve a field whose name is stored in a string, use the :func:`getattr` function:
uk: Щоб отримати поле, ім’я якого зберігається в рядку, використовуйте функцію :func:`getattr`:

source: To convert a dictionary to a named tuple, use the double-star-operator (as described in :ref:`tut-unpacking-arguments`):
uk: Щоб перетворити словник на іменований кортеж, використовуйте оператор подвійної зірочки (як описано в :ref:`tut-unpacking-arguments`):

source: Since a named tuple is a regular Python class, it is easy to add or change functionality with a subclass. Here is how to add a calculated field and a fixed-width print format:
uk: Оскільки іменований кортеж є звичайним класом Python, його легко додати або змінити функціональність за допомогою підкласу. Ось як додати обчислюване поле та формат друку з фіксованою шириною:

source: The subclass shown above sets ``__slots__`` to an empty tuple. This helps keep memory requirements low by preventing the creation of instance dictionaries.
uk: Показаний вище підклас встановлює ``__slots__`` на порожній кортеж. Це допомагає підтримувати низькі вимоги до пам’яті, запобігаючи створенню словників примірників.

source: Subclassing is not useful for adding new, stored fields. Instead, simply create a new named tuple type from the :attr:`~somenamedtuple._fields` attribute:
uk: Підкласи не корисні для додавання нових збережених полів. Замість цього просто створіть новий іменований тип кортежу з атрибута :attr:`~somenamedtuple._fields`:

source: Docstrings can be customized by making direct assignments to the ``__doc__`` fields:
uk: Рядки документів можна налаштувати шляхом прямого призначення полів ``__doc__``:

source: Property docstrings became writeable.
uk: Документаційні рядки властивостей стали доступними для запису.

source: See :class:`typing.NamedTuple` for a way to add type hints for named tuples. It also provides an elegant notation using the :keyword:`class` keyword::
uk: Дивіться :class:`typing.NamedTuple`, щоб дізнатися, як додати підказки типу для іменованих кортежів. Він також забезпечує елегантну нотацію за допомогою ключового слова :keyword:`class`::

source: See :meth:`types.SimpleNamespace` for a mutable namespace based on an underlying dictionary instead of a tuple.
uk: Перегляньте :meth:`types.SimpleNamespace` для змінного простору імен, заснованого на базовому словнику замість кортежу.

source: The :mod:`dataclasses` module provides a decorator and functions for automatically adding generated special methods to user-defined classes.
uk: Модуль :mod:`dataclasses` надає декоратор і функції для автоматичного додавання згенерованих спеціальних методів до визначених користувачем класів.

source: :class:`OrderedDict` objects
uk: :class:`OrderedDict` об’єкти

source: Ordered dictionaries are just like regular dictionaries but have some extra capabilities relating to ordering operations. They have become less important now that the built-in :class:`dict` class gained the ability to remember insertion order (this new behavior became guaranteed in Python 3.7).
uk: Упорядковані словники схожі на звичайні словники, але мають деякі додаткові можливості, пов’язані з операціями впорядкування. Тепер вони стали менш важливими, оскільки вбудований клас :class:`dict` отримав можливість запам’ятовувати порядок вставки (ця нова поведінка стала гарантованою в Python 3.7).

source: Some differences from :class:`dict` still remain:
uk: Деякі відмінності від :class:`dict` все ще залишаються:

source: The regular :class:`dict` was designed to be very good at mapping operations. Tracking insertion order was secondary.
uk: Звичайний :class:`dict` був розроблений, щоб дуже добре виконувати операції відображення. Відстеження порядку вставки було другорядним.

source: The :class:`OrderedDict` was designed to be good at reordering operations. Space efficiency, iteration speed, and the performance of update operations were secondary.
uk: :class:`OrderedDict` був розроблений, щоб добре справлятися з операціями зміни порядку. Ефективність простору, швидкість ітерації та продуктивність операцій оновлення були другорядними.

source: The :class:`OrderedDict` algorithm can handle frequent reordering operations better than :class:`dict`. As shown in the recipes below, this makes it suitable for implementing various kinds of LRU caches.
uk: Алгоритм :class:`OrderedDict` може виконувати часті операції зміни порядку краще, ніж :class:`dict`. Як показано в наведених нижче рецептах, це робить його придатним для реалізації різних видів кешів LRU.

source: The equality operation for :class:`OrderedDict` checks for matching order.
uk: Операція рівності для :class:`OrderedDict` перевіряє відповідність порядку.

source: A regular :class:`dict` can emulate the order sensitive equality test with ``p == q and all(k1 == k2 for k1, k2 in zip(p, q))``.
uk: Звичайний :class:`dict` може емулювати чутливий до порядку тест рівності з ``p == q і all(k1 == k2 для k1, k2 в zip(p, q))``.
