Repository: python/python-docs-uk
Catalog: library/collections.po
Languages: uk

source: The :meth:`popitem` method of :class:`OrderedDict` has a different signature. It accepts an optional argument to specify which item is popped.
uk: Метод :meth:`popitem` :class:`OrderedDict` має інший підпис. Він приймає необов'язковий аргумент, щоб вказати, який елемент витягується.

source: A regular :class:`dict` can emulate OrderedDict's ``od.popitem(last=True)`` with ``d.popitem()`` which is guaranteed to pop the rightmost (last) item.
uk: Звичайний :class:`dict` може емулювати OrderedDict ``od.popitem(last=True)`` за допомогою ``d.popitem()``, який гарантовано відкриває крайній правий (останній) елемент.

source: A regular :class:`dict` can emulate OrderedDict's ``od.popitem(last=False)`` with ``(k := next(iter(d)), d.pop(k))`` which will return and remove the leftmost (first) item if it exists.
uk: Звичайний :class:`dict` може емулювати OrderedDict ``od.popitem(last=False)`` з ``(k := next(iter(d)), d.pop(k))``, який повертатиме і видаліть крайній лівий (перший) елемент, якщо він існує.

source: :class:`OrderedDict` has a :meth:`move_to_end` method to efficiently reposition an element to an endpoint.
uk: :class:`OrderedDict` має метод :meth:`move_to_end` для ефективного переміщення елемента в кінцеву точку.

source: A regular :class:`dict` can emulate OrderedDict's ``od.move_to_end(k, last=True)`` with ``d[k] = d.pop(k)`` which will move the key and its associated value to the rightmost (last) position.
uk: Звичайний :class:`dict` може емулювати OrderedDict ``od.move_to_end(k, last=True)`` з ``d[k] = d.pop(k)``, який переміщуватиме ключ і його пов’язане значення до крайньої правої (останньої) позиції.

source: A regular :class:`dict` does not have an efficient equivalent for OrderedDict's ``od.move_to_end(k, last=False)`` which moves the key and its associated value to the leftmost (first) position.
uk: Звичайний :class:`dict` не має ефективного еквівалента для OrderedDict ``od.move_to_end(k, last=False)``, який переміщує ключ і пов’язане з ним значення в крайню ліву (першу) позицію.

source: Until Python 3.8, :class:`dict` lacked a :meth:`__reversed__` method.
uk: До Python 3.8 :class:`dict` не мав методу :meth:`__reversed__`.

source: Return an instance of a :class:`dict` subclass that has methods specialized for rearranging dictionary order.
uk: Повертає екземпляр підкласу :class:`dict`, який має спеціалізовані методи для зміни порядку словника.

source: The :meth:`popitem` method for ordered dictionaries returns and removes a (key, value) pair. The pairs are returned in :abbr:`LIFO (last-in, first-out)` order if *last* is true or :abbr:`FIFO (first-in, first-out)` order if false.
uk: Метод :meth:`popitem` для впорядкованих словників повертає та видаляє пару (ключ, значення). Пари повертаються в порядку :abbr:`LIFO (останній прийшов, перший вийшов)`, якщо *останній* має значення true, або :abbr:`FIFO (перший прийшов, перший вийшов)`, якщо значення false.

source: Move an existing *key* to either end of an ordered dictionary. The item is moved to the right end if *last* is true (the default) or to the beginning if *last* is false. Raises :exc:`KeyError` if the *key* does not exist:
uk: Перемістіть наявний *ключ* у будь-який кінець упорядкованого словника. Елемент переміщується в правий кінець, якщо *last* має значення true (за замовчуванням), або на початок, якщо *last* має значення false. Викликає :exc:`KeyError`, якщо *ключ* не існує:

source: In addition to the usual mapping methods, ordered dictionaries also support reverse iteration using :func:`reversed`.
uk: На додаток до звичайних методів відображення, упорядковані словники також підтримують зворотну ітерацію за допомогою :func:`reversed`.

source: The items, keys, and values :term:`views <dictionary view>` of :class:`OrderedDict` now support reverse iteration using :func:`reversed`.
uk: Елементи, ключі та значення :term:`views <dictionary view>` :class:`OrderedDict` тепер підтримують зворотну ітерацію за допомогою :func:`reversed`.

source: With the acceptance of :pep:`468`, order is retained for keyword arguments passed to the :class:`OrderedDict` constructor and its :meth:`update` method.
uk: З прийняттям :pep:`468` зберігається порядок для аргументів ключових слів, які передаються конструктору :class:`OrderedDict` і його методу :meth:`update`.

source: :class:`OrderedDict` Examples and Recipes
uk: :class:`OrderedDict` Приклади та рецепти

source: It is straightforward to create an ordered dictionary variant that remembers the order the keys were *last* inserted. If a new entry overwrites an existing entry, the original insertion position is changed and moved to the end::
uk: Легко створити впорядкований варіант словника, який запам’ятовує порядок *останнього* введення ключів. Якщо новий запис перезаписує існуючий запис, початкова позиція вставки змінюється та переміщується в кінець::

source: An :class:`OrderedDict` would also be useful for implementing variants of :func:`functools.lru_cache`:
uk: :class:`OrderedDict` також буде корисним для реалізації варіантів :func:`functools.lru_cache`:

source: :class:`UserDict` objects
uk: :class:`UserDict` об'єкти

source: The class, :class:`UserDict` acts as a wrapper around dictionary objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`dict`; however, this class can be easier to work with because the underlying dictionary is accessible as an attribute.
uk: Клас :class:`UserDict` діє як оболонка навколо об’єктів словника. Потреба в цьому класі була частково витіснена можливістю створювати підклас безпосередньо з :class:`dict`; однак з цим класом може бути легше працювати, оскільки базовий словник доступний як атрибут.

source: Class that simulates a dictionary. The instance's contents are kept in a regular dictionary, which is accessible via the :attr:`data` attribute of :class:`UserDict` instances. If *initialdata* is provided, :attr:`data` is initialized with its contents; note that a reference to *initialdata* will not be kept, allowing it to be used for other purposes.
uk: Клас, який імітує словник. Вміст екземпляра зберігається у звичайному словнику, який доступний через атрибут :attr:`data` екземплярів :class:`UserDict`. Якщо надано *initialdata*, :attr:`data` ініціалізується його вмістом; зауважте, що посилання на *ініціальні дані* не буде збережено, що дозволить використовувати його для інших цілей.

source: In addition to supporting the methods and operations of mappings, :class:`UserDict` instances provide the following attribute:
uk: На додаток до підтримки методів і операцій зіставлення, екземпляри :class:`UserDict` забезпечують такий атрибут:

source: A real dictionary used to store the contents of the :class:`UserDict` class.
uk: Справжній словник, який використовується для зберігання вмісту класу :class:`UserDict`.

source: :class:`UserList` objects
uk: :class:`UserList` об’єкти

source: This class acts as a wrapper around list objects. It is a useful base class for your own list-like classes which can inherit from them and override existing methods or add new ones. In this way, one can add new behaviors to lists.
uk: Цей клас діє як оболонка навколо об’єктів списку. Це корисний базовий клас для ваших власних спископодібних класів, які можуть успадковувати їх і перевизначати існуючі методи або додавати нові. Таким чином можна додавати нові моделі поведінки до списків.

source: The need for this class has been partially supplanted by the ability to subclass directly from :class:`list`; however, this class can be easier to work with because the underlying list is accessible as an attribute.
uk: Потреба в цьому класі була частково витіснена можливістю створювати підкласи безпосередньо з :class:`list`; однак з цим класом може бути легше працювати, оскільки базовий список доступний як атрибут.

source: Class that simulates a list. The instance's contents are kept in a regular list, which is accessible via the :attr:`data` attribute of :class:`UserList` instances. The instance's contents are initially set to a copy of *list*, defaulting to the empty list ``[]``. *list* can be any iterable, for example a real Python list or a :class:`UserList` object.
uk: Клас, що імітує список. Вміст екземпляра зберігається у звичайному списку, який доступний через атрибут :attr:`data` екземплярів :class:`UserList`. Вміст екземпляра спочатку встановлено як копія *списку*, за замовчуванням — порожній список ``[]``. *list* може бути будь-яким ітерованим, наприклад справжнім списком Python або об’єктом :class:`UserList`.

source: In addition to supporting the methods and operations of mutable sequences, :class:`UserList` instances provide the following attribute:
uk: На додаток до підтримки методів і операцій змінних послідовностей, екземпляри :class:`UserList` забезпечують такий атрибут:

source: A real :class:`list` object used to store the contents of the :class:`UserList` class.
uk: Справжній об’єкт :class:`list`, який використовується для зберігання вмісту класу :class:`UserList`.

source: **Subclassing requirements:** Subclasses of :class:`UserList` are expected to offer a constructor which can be called with either no arguments or one argument. List operations which return a new sequence attempt to create an instance of the actual implementation class. To do so, it assumes that the constructor can be called with a single parameter, which is a sequence object used as a data source.
uk: **Вимоги до підкласів:** Очікується, що підкласи :class:`UserList` пропонуватимуть конструктор, який можна викликати без аргументів або з одним аргументом. Список операцій, які повертають нову послідовність, намагається створити екземпляр фактичного класу реалізації. Для цього передбачається, що конструктор можна викликати за допомогою одного параметра, який є об’єктом послідовності, що використовується як джерело даних.

source: If a derived class does not wish to comply with this requirement, all of the special methods supported by this class will need to be overridden; please consult the sources for information about the methods which need to be provided in that case.
uk: Якщо похідний клас не бажає відповідати цій вимозі, всі спеціальні методи, підтримувані цим класом, повинні бути перевизначені; будь ласка, зверніться до джерел для отримання інформації про методи, які необхідно надати в такому випадку.

source: :class:`UserString` objects
uk: :class:`UserString` об’єкти

source: The class, :class:`UserString` acts as a wrapper around string objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`str`; however, this class can be easier to work with because the underlying string is accessible as an attribute.
uk: Клас :class:`UserString` діє як оболонка навколо рядкових об’єктів. Потреба в цьому класі була частково витіснена можливістю створювати підклас безпосередньо з :class:`str`; однак з цим класом може бути легше працювати, оскільки базовий рядок доступний як атрибут.

source: Class that simulates a string object. The instance's content is kept in a regular string object, which is accessible via the :attr:`data` attribute of :class:`UserString` instances. The instance's contents are initially set to a copy of *seq*. The *seq* argument can be any object which can be converted into a string using the built-in :func:`str` function.
uk: Клас, який імітує рядковий об'єкт. Вміст екземпляра зберігається у звичайному рядковому об’єкті, який доступний через атрибут :attr:`data` екземплярів :class:`UserString`. Для вмісту екземпляра спочатку встановлено копію *seq*. Аргументом *seq* може бути будь-який об’єкт, який можна перетворити на рядок за допомогою вбудованої функції :func:`str`.

source: In addition to supporting the methods and operations of strings, :class:`UserString` instances provide the following attribute:
uk: На додаток до підтримки методів і операцій із рядками, екземпляри :class:`UserString` надають такий атрибут:

source: A real :class:`str` object used to store the contents of the :class:`UserString` class.
uk: Справжній об’єкт :class:`str`, який використовується для зберігання вмісту класу :class:`UserString`.

source: New methods ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable``, and ``maketrans``.
uk: Нові методи ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable`` і ``maketrans``.
