Repository: python/python-docs-uk
Catalog: library/collections.po
Languages: uk

source: **Source code:** :source:`Lib/collections/__init__.py`
uk: **Вихідний код:** :source:`Lib/collections/__init__.py`

source: This module implements specialized container datatypes providing alternatives to Python's general purpose built-in containers, :class:`dict`, :class:`list`, :class:`set`, and :class:`tuple`.
uk: Цей модуль реалізує спеціалізовані типи даних контейнерів, що є альтернативою вбудованим контейнерам загального призначення Python, :class:`dict`, :class:`list`, :class:`set` і :class:`tuple`.

source: factory function for creating tuple subclasses with named fields
uk: функція фабрики для створення підкласів кортежів з іменованими полями

source: list-like container with fast appends and pops on either end
uk: контейнер, схожий на список, із швидким додаванням і вискакуванням на обох кінцях

source: dict-like class for creating a single view of multiple mappings
uk: dict-подібний клас для створення єдиного перегляду кількох відображень

source: dict subclass that remembers the order entries were added
uk: підклас dict, який запам’ятовує додані записи порядку

source: dict subclass that calls a factory function to supply missing values
uk: підклас dict, який викликає фабричну функцію для надання відсутніх значень

source: wrapper around dictionary objects for easier dict subclassing
uk: обгортка навколо об’єктів словника для легшого створення підкласів dict

source: wrapper around list objects for easier list subclassing
uk: обгортка навколо об'єктів списку для легшого створення підкласів списку

source: wrapper around string objects for easier string subclassing
uk: обгортка навколо рядкових об'єктів для легшого створення підкласів рядків

source: :class:`ChainMap` objects
uk: :class:`ChainMap` об'єкти

source: A :class:`ChainMap` class is provided for quickly linking a number of mappings so they can be treated as a single unit. It is often much faster than creating a new dictionary and running multiple :meth:`~dict.update` calls.
uk: Клас :class:`ChainMap` надається для швидкого зв’язування кількох відображень, щоб їх можна було розглядати як єдине ціле. Часто це набагато швидше, ніж створення нового словника та виконання кількох викликів :meth:`~dict.update`.

source: The class can be used to simulate nested scopes and is useful in templating.
uk: Клас можна використовувати для імітації вкладених областей і корисний у створенні шаблонів.

source: A :class:`ChainMap` groups multiple dicts or other mappings together to create a single, updateable view. If no *maps* are specified, a single empty dictionary is provided so that a new chain always has at least one mapping.
uk: :class:`ChainMap` групує кілька dicts або інших відображень разом, щоб створити єдине оновлюване подання. Якщо *maps* не вказано, надається єдиний порожній словник, щоб новий ланцюжок завжди мав принаймні одне відображення.

source: The underlying mappings are stored in a list. That list is public and can be accessed or updated using the *maps* attribute. There is no other state.
uk: Базові відображення зберігаються в списку. Цей список є загальнодоступним, і до нього можна отримати доступ або оновити за допомогою атрибута *maps*. Іншої держави немає.

source: Lookups search the underlying mappings successively until a key is found. In contrast, writes, updates, and deletions only operate on the first mapping.
uk: Пошуки послідовно шукають базові відображення, доки не буде знайдено ключ. Навпаки, записи, оновлення та видалення діють лише на першому відображенні.

source: A :class:`ChainMap` incorporates the underlying mappings by reference. So, if one of the underlying mappings gets updated, those changes will be reflected in :class:`ChainMap`.
uk: :class:`ChainMap` включає базові відображення за посиланням. Отже, якщо одне з базових відображень буде оновлено, ці зміни буде відображено в :class:`ChainMap`.

source: All of the usual dictionary methods are supported. In addition, there is a *maps* attribute, a method for creating new subcontexts, and a property for accessing all but the first mapping:
uk: Підтримуються всі звичайні словникові методи. Крім того, існує атрибут *maps*, метод для створення нових підконтекстів і властивість для доступу до всіх відображень, крім першого:

source: A user updateable list of mappings. The list is ordered from first-searched to last-searched. It is the only stored state and can be modified to change which mappings are searched. The list should always contain at least one mapping.
uk: Список відображень, який можна оновлювати користувачем. Список упорядковано від першого до останнього. Це єдиний стан, який зберігається, і його можна змінити, щоб змінити зіставлення, які шукаються. Список завжди повинен містити принаймні одне зіставлення.

source: Returns a new :class:`ChainMap` containing a new map followed by all of the maps in the current instance. If ``m`` is specified, it becomes the new map at the front of the list of mappings; if not specified, an empty dict is used, so that a call to ``d.new_child()`` is equivalent to: ``ChainMap({}, *d.maps)``. If any keyword arguments are specified, they update passed map or new empty dict. This method is used for creating subcontexts that can be updated without altering values in any of the parent mappings.
uk: Повертає новий :class:`ChainMap`, який містить нову карту, за якою слідують усі карти в поточному екземплярі. Якщо вказано ``m``, воно стає новою картою на початку списку зіставлень; якщо не вказано, використовується порожній dict, так що виклик ``d.new_child()`` еквівалентний: ``ChainMap({}, *d.maps)``. Якщо вказано будь-які аргументи ключового слова, вони оновлюють передану карту або новий порожній dict. Цей метод використовується для створення підконтекстів, які можна оновлювати без зміни значень у будь-якому з батьківських відображень.

source: The optional ``m`` parameter was added.
uk: Додано необов’язковий параметр ``m``.

source: Keyword arguments support was added.
uk: Додано підтримку аргументів ключових слів.

source: Property returning a new :class:`ChainMap` containing all of the maps in the current instance except the first one. This is useful for skipping the first map in the search. Use cases are similar to those for the :keyword:`nonlocal` keyword used in :term:`nested scopes <nested scope>`. The use cases also parallel those for the built-in :func:`super` function. A reference to ``d.parents`` is equivalent to: ``ChainMap(*d.maps[1:])``.
uk: Властивість, що повертає новий :class:`ChainMap`, що містить усі карти в поточному екземплярі, крім першої. Це корисно для пропуску першої карти в пошуку. Випадки використання схожі на випадки використання ключового слова :keyword:`nonlocal`, що використовується у :term:`вкладених областях <nested scope>`. Випадки використання також аналогічні використанню вбудованої функції :func:`super`. Посилання на ``d.parents`` еквівалентне: ``ChainMap(*d.maps[1:])``.

source: This gives the same ordering as a series of :meth:`dict.update` calls starting with the last mapping::
uk: Це дає такий самий порядок, як і серія викликів :meth:`dict.update`, починаючи з останнього відображення::

source: Added support for ``|`` and ``|=`` operators, specified in :pep:`584`.
uk: Додано підтримку операторів ``|`` і ``|=``, указаних у :pep:`584`.

source: The `MultiContext class <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ in the Enthought `CodeTools package <https://github.com/enthought/codetools>`_ has options to support writing to any mapping in the chain.
uk: `MultiContext class <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ у пакеті Enthought `CodeTools <https://github.com/enthought/codetools>`_ має опції для підтримки запису в будь-яке відображення в ланцюжку.

source: Django's `Context class <https://github.com/django/django/blob/main/django/template/context.py>`_ for templating is a read-only chain of mappings. It also features pushing and popping of contexts similar to the :meth:`~collections.ChainMap.new_child` method and the :attr:`~collections.ChainMap.parents` property.
uk: `Клас контексту Django <https://github.com/django/django/blob/main/django/template/context.py>`_ для створення шаблонів — це ланцюжок відображень лише для читання. Він також має функцію надсилання та витягування контекстів, подібних до методу :meth:`~collections.ChainMap.new_child` і властивості :attr:`~collections.ChainMap.parents`.

source: A `greatly simplified read-only version of Chainmap <https://code.activestate.com/recipes/305268/>`_.
uk: `Значно спрощена версія Chainmap тільки для читання <https://code.activestate.com/recipes/305268/>`_.

source: :class:`ChainMap` Examples and Recipes
uk: :class:`ChainMap` Приклади та рецепти

source: This section shows various approaches to working with chained maps.
uk: У цьому розділі показано різні підходи до роботи з ланцюжковими картами.

source: Example of simulating Python's internal lookup chain::
uk: Приклад симуляції внутрішнього ланцюжка пошуку Python::

source: Example of letting user specified command-line arguments take precedence over environment variables which in turn take precedence over default values::
uk: Приклад надання переваги заданим користувачем аргументам командного рядка над змінними середовища, які, у свою чергу, мають пріоритет над значеннями за замовчуванням::

source: Example patterns for using the :class:`ChainMap` class to simulate nested contexts::
uk: Приклади шаблонів використання класу :class:`ChainMap` для імітації вкладених контекстів::

source: The :class:`ChainMap` class only makes updates (writes and deletions) to the first mapping in the chain while lookups will search the full chain. However, if deep writes and deletions are desired, it is easy to make a subclass that updates keys found deeper in the chain::
uk: Клас :class:`ChainMap` лише оновлює (записує та видаляє) перше відображення в ланцюжку, тоді як пошук шукатиме повний ланцюжок. Однак, якщо потрібні глибокі записи та видалення, легко створити підклас, який оновлює ключі, знайдені глибше в ланцюжку:

source: :class:`Counter` objects
uk: :class:`Counter` об'єкти

source: A counter tool is provided to support convenient and rapid tallies. For example::
uk: Надається інструмент лічильника для зручного та швидкого підрахунку. Наприклад::

source: Elements are counted from an *iterable* or initialized from another *mapping* (or counter):
uk: Елементи підраховуються з *iterable* або ініціалізуються з іншого *mapping* (або лічильника):

source: Counter objects have a dictionary interface except that they return a zero count for missing items instead of raising a :exc:`KeyError`:
uk: Об’єкти лічильників мають інтерфейс словника, за винятком того, що вони повертають нульову кількість для відсутніх елементів замість того, щоб викликати :exc:`KeyError`:

source: Setting a count to zero does not remove an element from a counter. Use ``del`` to remove it entirely:
uk: Встановлення лічильника на нуль не видаляє елемент із лічильника. Використовуйте ``del``, щоб видалити його повністю:

source: As a :class:`dict` subclass, :class:`Counter` inherited the capability to remember insertion order. Math operations on *Counter* objects also preserve order. Results are ordered according to when an element is first encountered in the left operand and then by the order encountered in the right operand.
uk: Як підклас :class:`dict`, :class:`Counter` успадкував можливість запам’ятовувати порядок вставки. Математичні операції над об’єктами *Counter* також зберігають порядок. Результати впорядковуються відповідно до того, коли елемент вперше зустрічається в лівому операнді, а потім у порядку зустрічі в правому операнді.

source: Counter objects support additional methods beyond those available for all dictionaries:
uk: Об’єкти лічильників підтримують додаткові методи, окрім тих, що доступні для всіх словників:

source: Return an iterator over elements repeating each as many times as its count. Elements are returned in the order first encountered. If an element's count is less than one, :meth:`elements` will ignore it.
uk: Повертає ітератор над елементами, повторюючи кожен стільки разів, скільки його кількість. Елементи повертаються в тому порядку, в якому вони зустрічаються першими. Якщо кількість елемента менше одиниці, :meth:`elements` проігнорує його.

source: Return a list of the *n* most common elements and their counts from the most common to the least. If *n* is omitted or ``None``, :meth:`most_common` returns *all* elements in the counter. Elements with equal counts are ordered in the order first encountered:
uk: Повертає список з *n* найпоширеніших елементів і їх підрахунок від найбільш поширених до найменших. Якщо *n* пропущено або ``None``, :meth:`most_common` повертає *всі* елементи в лічильнику. Елементи з рівною кількістю впорядковуються в порядку, коли вони зустрічаються першими:

source: Elements are subtracted from an *iterable* or from another *mapping* (or counter). Like :meth:`dict.update` but subtracts counts instead of replacing them. Both inputs and outputs may be zero or negative.
uk: Елементи віднімаються з *iterable* або з іншого *mapping* (або лічильника). Подібно до :meth:`dict.update`, але кількість віднімає, а не замінює. І входи, і виходи можуть бути нульовими або негативними.

source: Compute the sum of the counts.
uk: Обчисліть суму підрахунків.

source: The usual dictionary methods are available for :class:`Counter` objects except for two which work differently for counters.
uk: Звичайні методи словника доступні для об’єктів :class:`Counter`, за винятком двох, які працюють по-різному для лічильників.

source: This class method is not implemented for :class:`Counter` objects.
uk: Цей метод класу не реалізований для об’єктів :class:`Counter`.

source: Elements are counted from an *iterable* or added-in from another *mapping* (or counter). Like :meth:`dict.update` but adds counts instead of replacing them. Also, the *iterable* is expected to be a sequence of elements, not a sequence of ``(key, value)`` pairs.
uk: Елементи підраховуються від *iterable* або add-in від іншого *mapping* (або лічильника). Як :meth:`dict.update`, але додає лічильники замість їх заміни. Крім того, очікується, що *iterable* буде послідовністю елементів, а не послідовністю пар ``(ключ, значення)``.

source: Counters support rich comparison operators for equality, subset, and superset relationships: ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``. All of those tests treat missing elements as having zero counts so that ``Counter(a=1) == Counter(a=1, b=0)`` returns true.
uk: Лічильники підтримують розширені оператори порівняння для зв’язків рівності, підмножини та надмножини: ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``. Усі ці тести розглядають відсутні елементи як такі, що мають нульову кількість, тому ``Counter(a=1) == Counter(a=1, b=0)`` повертає true.

source: Rich comparison operations were added.
uk: Додано розширені операції порівняння.

source: In equality tests, missing elements are treated as having zero counts. Formerly, ``Counter(a=3)`` and ``Counter(a=3, b=0)`` were considered distinct.
uk: У тестах на рівність відсутні елементи розглядаються як такі, що мають нульову кількість. Раніше ``Counter(a=3)`` і ``Counter(a=3, b=0)`` вважалися різними.

source: Common patterns for working with :class:`Counter` objects::
uk: Загальні шаблони для роботи з об'єктами :class:`Counter`::

source: Several mathematical operations are provided for combining :class:`Counter` objects to produce multisets (counters that have counts greater than zero). Addition and subtraction combine counters by adding or subtracting the counts of corresponding elements. Intersection and union return the minimum and maximum of corresponding counts. Equality and inclusion compare corresponding counts. Each operation can accept inputs with signed counts, but the output will exclude results with counts of zero or less.
uk: Передбачено кілька математичних операцій для об’єднання об’єктів :class:`Counter` для створення мультимножин (лічильників, які мають кількість, більшу за нуль). Додавання та віднімання поєднують лічильники шляхом додавання або віднімання підрахунків відповідних елементів. Перетин і об’єднання повертають мінімальне та максимальне значення відповідних підрахунків. Рівність і включення порівнюють відповідні підрахунки. Кожна операція може приймати вхідні дані зі знаком підрахунків, але вихід виключатиме результати з нульовими чи меншими значеннями.

source: Unary addition and subtraction are shortcuts for adding an empty counter or subtracting from an empty counter.
uk: Унарне додавання та віднімання — це ярлики для додавання порожнього лічильника або віднімання з порожнього лічильника.

source: Added support for unary plus, unary minus, and in-place multiset operations.
uk: Додано підтримку унарних операцій плюс, унарний мінус і мультимножинних операцій на місці.

source: Counters were primarily designed to work with positive integers to represent running counts; however, care was taken to not unnecessarily preclude use cases needing other types or negative values. To help with those use cases, this section documents the minimum range and type restrictions.
uk: Лічильники були в основному розроблені для роботи з позитивними цілими числами для представлення поточних підрахунків; однак було вжито заходів для того, щоб без потреби не виключити випадки використання, які потребують інших типів або від’ємних значень. Щоб допомогти з цими випадками використання, у цьому розділі описані мінімальні обмеження діапазону та типу.

source: The :class:`Counter` class itself is a dictionary subclass with no restrictions on its keys and values. The values are intended to be numbers representing counts, but you *could* store anything in the value field.
uk: Сам клас :class:`Counter` є підкласом словника без обмежень щодо його ключів і значень. Значення мають бути числами, що представляють кількість, але ви *можете* зберігати будь-що в полі значення.

source: The :meth:`~Counter.most_common` method requires only that the values be orderable.
uk: Метод :meth:`~Counter.most_common` вимагає лише того, щоб значення можна було впорядкувати.

source: For in-place operations such as ``c[key] += 1``, the value type need only support addition and subtraction. So fractions, floats, and decimals would work and negative values are supported. The same is also true for :meth:`~Counter.update` and :meth:`~Counter.subtract` which allow negative and zero values for both inputs and outputs.
uk: Для операцій на місці, таких як ``c[key] += 1``, тип значення потребує лише підтримки додавання та віднімання. Отже, дроби, числа з плаваючою точкою та десяткові дроби працюватимуть, а від’ємні значення підтримуються. Те ж саме вірно для :meth:`~Counter.update` і :meth:`~Counter.subtract`, які дозволяють від’ємні та нульові значення як для входів, так і для виходів.

source: The multiset methods are designed only for use cases with positive values. The inputs may be negative or zero, but only outputs with positive values are created. There are no type restrictions, but the value type needs to support addition, subtraction, and comparison.
uk: Мультимножинні методи призначені лише для випадків використання з позитивними значеннями. Вхідні дані можуть бути від’ємними або нульовими, але створюються лише виходи з позитивними значеннями. Немає обмежень щодо типів, але тип значення має підтримувати додавання, віднімання та порівняння.

source: The :meth:`~Counter.elements` method requires integer counts. It ignores zero and negative counts.
uk: Метод :meth:`~Counter.elements` вимагає підрахунку цілих чисел. Він ігнорує нульові та негативні значення.

source: `Bag class <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ in Smalltalk.
uk: `Клас сумки <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ у Smalltalk.

source: Wikipedia entry for `Multisets <https://en.wikipedia.org/wiki/Multiset>`_.
uk: Запис у Вікіпедії для `Мультимножини <https://en.wikipedia.org/wiki/Multiset>`_.

source: `C++ multisets <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ tutorial with examples.
uk: `C++ multisets <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ посібник із прикладами.

source: For mathematical operations on multisets and their use cases, see *Knuth, Donald. The Art of Computer Programming Volume II, Section 4.6.3, Exercise 19*.
uk: Про математичні операції над мультимножинами та випадки їх використання див. *Knuth, Donald. Мистецтво комп’ютерного програмування, том II, розділ 4.6.3, вправа 19*.

source: To enumerate all distinct multisets of a given size over a given set of elements, see :func:`itertools.combinations_with_replacement`::
uk: Щоб перерахувати всі різні мультимножини заданого розміру над заданим набором елементів, перегляньте :func:`itertools.combinations_with_replacement`::

source: :class:`deque` objects
uk: :class:`deque` об'єкти

source: Returns a new deque object initialized left-to-right (using :meth:`append`) with data from *iterable*. If *iterable* is not specified, the new deque is empty.
uk: Повертає новий об’єкт deque, ініціалізований зліва направо (за допомогою :meth:`append`) з даними з *iterable*. Якщо *iterable* не вказано, нова двочерга порожня.

source: If *maxlen* is not specified or is ``None``, deques may grow to an arbitrary length. Otherwise, the deque is bounded to the specified maximum length. Once a bounded length deque is full, when new items are added, a corresponding number of items are discarded from the opposite end. Bounded length deques provide functionality similar to the ``tail`` filter in Unix. They are also useful for tracking transactions and other pools of data where only the most recent activity is of interest.
uk: Якщо *maxlen* не вказано або має значення ``None``, дві версії можуть зростати до довільної довжини. В іншому випадку двочерга обмежена до вказаної максимальної довжини. Коли двочерга обмеженої довжини заповнюється, коли додаються нові елементи, відповідна кількість елементів відкидається з протилежного кінця. Обмежена довжина двох рядків забезпечує функціональність, подібну до фільтра ``tail`` в Unix. Вони також корисні для відстеження транзакцій та інших наборів даних, де цікаві лише останні дії.

source: Deque objects support the following methods:
uk: Об’єкти Deque підтримують такі методи:

source: Add *x* to the right side of the deque.
uk: Додайте *x* до правої сторони дека.

source: Add *x* to the left side of the deque.
uk: Додайте *x* до лівої сторони дека.

source: Remove all elements from the deque leaving it with length 0.
uk: Видаліть усі елементи з двоканального ряду, залишивши його довжиною 0.

source: Create a shallow copy of the deque.
uk: Створіть поверхневу копію deque.

source: Count the number of deque elements equal to *x*.
uk: Підрахуйте кількість елементів deque, що дорівнює *x*.

source: Extend the right side of the deque by appending elements from the iterable argument.
uk: Розширте праву частину двоканального ряду, додавши елементи з ітерованого аргументу.

source: Extend the left side of the deque by appending elements from *iterable*. Note, the series of left appends results in reversing the order of elements in the iterable argument.
uk: Розширте ліву сторону двостороннього коду, додавши елементи з *iterable*. Зауважте, що серія лівих додань призводить до зміни порядку елементів у повторюваному аргументі.
