Repository: python/python-docs-uk
Catalog: library/colorsys.po
Languages: uk

source: :mod:`colorsys` --- Conversions between color systems
uk: :mod:`colorsys` --- Перетворення між системами кольорів

source: **Source code:** :source:`Lib/colorsys.py`
uk: **Вихідний код:** :source:`Lib/colorsys.py`

source: The :mod:`colorsys` module defines bidirectional conversions of color values between colors expressed in the RGB (Red Green Blue) color space used in computer monitors and three other coordinate systems: YIQ, HLS (Hue Lightness Saturation) and HSV (Hue Saturation Value). Coordinates in all of these color spaces are floating point values. In the YIQ space, the Y coordinate is between 0 and 1, but the I and Q coordinates can be positive or negative. In all other spaces, the coordinates are all between 0 and 1.
uk: Модуль :mod:`colorsys` визначає двонаправлене перетворення значень кольорів між кольорами, вираженими в колірному просторі RGB (Red Green Blue), який використовується в комп’ютерних моніторах, і трьох інших системах координат: YIQ, HLS (Hue Lightness Saturation) і HSV (Hue Saturation). Значення). Координати в усіх цих просторах кольорів є значеннями з плаваючою комою. У просторі YIQ координата Y знаходиться між 0 і 1, але координати I і Q можуть бути позитивними або негативними. У всіх інших просторах координати знаходяться між 0 і 1.

source: More information about color spaces can be found at https://poynton.ca/ColorFAQ.html and https://www.cambridgeincolour.com/tutorials/color-spaces.htm.
uk: Більше інформації про колірні простори можна знайти на https://poynton.ca/ColorFAQ.html і https://www.cambridgeincolour.com/tutorials/color-spaces.htm.

source: The :mod:`colorsys` module defines the following functions:
uk: Модуль :mod:`colorsys` визначає такі функції:

source: Convert the color from RGB coordinates to YIQ coordinates.
uk: Перетворення кольору з координат RGB на координати YIQ.

source: Convert the color from YIQ coordinates to RGB coordinates.
uk: Перетворення кольору з координат YIQ на координати RGB.

source: Convert the color from RGB coordinates to HLS coordinates.
uk: Перетворення кольору з координат RGB на координати HLS.

source: Convert the color from HLS coordinates to RGB coordinates.
uk: Перетворення кольору з координат HLS на координати RGB.

source: Convert the color from RGB coordinates to HSV coordinates.
uk: Перетворення кольору з координат RGB на координати HSV.

source: Convert the color from HSV coordinates to RGB coordinates.
uk: Перетворення кольору з координат HSV на координати RGB.

source: Example::
uk: Приклад::
