Repository: python/python-docs-uk
Catalog: library/compileall.po
Languages: uk

source: **Source code:** :source:`Lib/compileall.py`
uk: **Вихідний код:** :source:`Lib/compileall.py`

source: This module provides some utility functions to support installing Python libraries. These functions compile Python source files in a directory tree. This module can be used to create the cached byte-code files at library installation time, which makes them available for use even by users who don't have write permission to the library directories.
uk: Цей модуль надає деякі службові функції для підтримки встановлення бібліотек Python. Ці функції компілюють вихідні файли Python у дереві каталогів. Цей модуль можна використовувати для створення кешованих файлів байт-коду під час встановлення бібліотеки, що робить їх доступними для використання навіть користувачами, які не мають дозволу на запис до каталогів бібліотеки.

source: Command-line use
uk: Використання командного рядка

source: This module can work as a script (using :program:`python -m compileall`) to compile Python sources.
uk: Цей модуль може працювати як сценарій (за допомогою :program:`python -m compileall`) для компіляції вихідних кодів Python.

source: Do not recurse into subdirectories, only compile source code files directly contained in the named or implied directories.
uk: Не повертайтеся до підкаталогів, лише компілюйте файли вихідного коду, які безпосередньо містяться в названих або неявних каталогах.

source: Force rebuild even if timestamps are up-to-date.
uk: Примусове відновлення, навіть якщо мітки часу актуальні.

source: Do not print the list of files compiled. If passed once, error messages will still be printed. If passed twice (``-qq``), all output is suppressed.
uk: Не друкуйте список зібраних файлів. Якщо передати один раз, повідомлення про помилку все одно друкуватимуться. Якщо передати двічі (``-qq``), весь вивід пригнічується.

source: Directory prepended to the path to each file being compiled. This will appear in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
uk: Каталог додається до шляху до кожного файлу, що компілюється. Це відображатиметься у відстеженнях під час компіляції, а також буде скомпільовано у файл байт-коду, де воно використовуватиметься у відстеженнях та інших повідомленнях у випадках, коли вихідний файл не існує під час виконання файлу байт-коду.

source: Remove (``-s``) or append (``-p``) the given prefix of paths recorded in the ``.pyc`` files. Cannot be combined with ``-d``.
uk: Видаліть (``-s``) або додайте (``-p``) заданий префікс шляхів, записаних у файлах ``.pyc``. Не можна поєднувати з ``-d``.

source: regex is used to search the full path to each file considered for compilation, and if the regex produces a match, the file is skipped.
uk: регулярний вираз використовується для пошуку повного шляху до кожного файлу, який розглядається для компіляції, і якщо регулярний вираз видає збіг, файл пропускається.

source: Read the file ``list`` and add each line that it contains to the list of files and directories to compile. If ``list`` is ``-``, read lines from ``stdin``.
uk: Прочитайте файл ``список`` і додайте кожен рядок, який він містить, до списку файлів і каталогів для компіляції. Якщо ``список`` ``-``, читати рядки з ``stdin``.

source: Write the byte-code files to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
uk: Запишіть файли байт-коду в їхні застарілі розташування та імена, які можуть перезаписати файли байт-коду, створені іншою версією Python. За замовчуванням файли записуються в їхні розташування та імена :pep:`3147`, що дозволяє співіснувати файлам байт-коду з кількох версій Python.

source: Control the maximum recursion level for subdirectories. If this is given, then ``-l`` option will not be taken into account. :program:`python -m compileall <directory> -r 0` is equivalent to :program:`python -m compileall <directory> -l`.
uk: Контролюйте максимальний рівень рекурсії для підкаталогів. Якщо це задано, то параметр ``-l`` не буде взято до уваги. :program:`python -m compileall <directory> -r 0` еквівалентно :program:`python -m compileall <directory> -l`.

source: Control how the generated byte-code files are invalidated at runtime. The ``timestamp`` value, means that ``.pyc`` files with the source timestamp and size embedded will be generated. The ``checked-hash`` and ``unchecked-hash`` values cause hash-based pycs to be generated. Hash-based pycs embed a hash of the source file contents rather than a timestamp. See :ref:`pyc-invalidation` for more information on how Python validates bytecode cache files at runtime. The default is ``timestamp`` if the :envvar:`SOURCE_DATE_EPOCH` environment variable is not set, and ``checked-hash`` if the ``SOURCE_DATE_EPOCH`` environment variable is set.
uk: Керуйте тим, як згенеровані файли байт-коду стають недійсними під час виконання. Значення ``timestamp`` означає, що будуть створені файли ``.pyc`` із вбудованою міткою часу джерела та розміром. Значення ``checked-hash`` і ``unchecked-hash`` призводять до генерації pyc на основі хешу. pyc на основі хешу вбудовує хеш вмісту вихідного файлу, а не мітку часу. Перегляньте :ref:`pyc-invalidation` для отримання додаткової інформації про те, як Python перевіряє файли кешу байт-коду під час виконання. Типовим значенням є ``timestamp``, якщо змінна середовища :envvar:`SOURCE_DATE_EPOCH` не встановлено, і ``checked-hash``, якщо встановлена змінна середовища ``SOURCE_DATE_EPOCH``.

source: Compile with the given optimization level. May be used multiple times to compile for multiple levels at a time (for example, ``compileall -o 1 -o 2``).
uk: Зібрати з заданим рівнем оптимізації. Може використовуватися кілька разів для компіляції для кількох рівнів одночасно (наприклад, ``compileall -o 1 -o 2``).

source: Ignore symlinks pointing outside the given directory.
uk: Ігноруйте символічні посилання, що вказують за межі даного каталогу.

source: If two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
uk: Якщо два файли ``.pyc`` з різним рівнем оптимізації мають однаковий вміст, використовуйте жорсткі посилання для об’єднання дублікатів файлів.

source: Added the ``-i``, ``-b`` and ``-h`` options.
uk: Додано параметри ``-i``, ``-b`` і ``-h``.

source: Added the ``-j``, ``-r``, and ``-qq`` options. ``-q`` option was changed to a multilevel value. ``-b`` will always produce a byte-code file ending in ``.pyc``, never ``.pyo``.
uk: Додано параметри ``-j``, ``-r`` і ``-qq``. Опцію ``-q`` було змінено на багаторівневе значення. ``-b`` завжди створюватиме файл байт-коду із закінченням ``.pyc``, ніколи ``.pyo``.

source: Added the ``--invalidation-mode`` option.
uk: Додано параметр ``--invalidation-mode``.

source: Added the ``-s``, ``-p``, ``-e`` and ``--hardlink-dupes`` options. Raised the default recursion limit from 10 to :py:func:`sys.getrecursionlimit()`. Added the possibility to specify the ``-o`` option multiple times.
uk: Додано параметри ``-s``, ``-p``, ``-e`` і ``--hardlink-dupes``. Ліміт рекурсії за умовчанням збільшено з 10 до :py:func:`sys.getrecursionlimit()`. Додано можливість вказувати опцію ``-o`` кілька разів.

source: There is no command-line option to control the optimization level used by the :func:`compile` function, because the Python interpreter itself already provides the option: :program:`python -O -m compileall`.
uk: Немає параметра командного рядка для керування рівнем оптимізації, який використовується функцією :func:`compile`, оскільки сам інтерпретатор Python уже надає параметр: :program:`python -O -m compileall`.

source: Public functions
uk: Громадські функції

source: Recursively descend the directory tree named by *dir*, compiling all :file:`.py` files along the way. Return a true value if all the files compiled successfully, and a false value otherwise.
uk: Рекурсивно спустіться за деревом каталогів, названим *dir*, компілюючи всі файли :file:`.py`. Повертає значення true, якщо всі файли скомпільовано успішно, і значення false в іншому випадку.

source: The *maxlevels* parameter is used to limit the depth of the recursion; it defaults to ``sys.getrecursionlimit()``.
uk: Параметр *maxlevels* використовується для обмеження глибини рекурсії; за умовчанням встановлено ``sys.getrecursionlimit()``.

source: If *ddir* is given, it is prepended to the path to each file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
uk: Якщо вказано *ddir*, він додається до шляху до кожного файлу, що компілюється для використання в трасуванні часу компіляції, а також компілюється у файл байт-коду, де він використовуватиметься в трасуванні та інших повідомленнях у випадках, коли вихідний файл не існує на момент виконання файлу байт-коду.

source: If *force* is true, modules are re-compiled even if the timestamps are up to date.
uk: Якщо *force* має значення true, модулі компілюються повторно, навіть якщо мітки часу актуальні.

source: If *rx* is given, its ``search`` method is called on the complete path to each file considered for compilation, and if it returns a true value, the file is skipped. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
uk: Якщо вказано *rx*, його метод ``search`` викликається на повному шляху до кожного файлу, який розглядається для компіляції, і якщо він повертає справжнє значення, файл пропускається. Це можна використовувати для виключення файлів, які відповідають регулярному виразу, заданому як об’єкт :ref:`re.Pattern <re-objects>`.

source: If *quiet* is ``False`` or ``0`` (the default), the filenames and other information are printed to standard out. Set to ``1``, only errors are printed. Set to ``2``, all output is suppressed.
uk: Якщо *quiet* має значення ``False`` або ``0`` (за замовчуванням), назви файлів та інша інформація друкуються стандартно. Установлено на ``1``, друкуються лише помилки. Установлено на ``2``, усі виведення пригнічуються.

source: If *legacy* is true, byte-code files are written to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
uk: Якщо значення *legacy* має значення true, файли з байт-кодом записуються до своїх застарілих розташувань і імен, які можуть перезаписати файли з байт-кодом, створені іншою версією Python. За замовчуванням файли записуються до їхніх :pep:`3147` розташувань та імен, що дозволяє файлам байт-коду з кількох версій Python співіснувати.

source: *optimize* specifies the optimization level for the compiler. It is passed to the built-in :func:`compile` function. Accepts also a sequence of optimization levels which lead to multiple compilations of one :file:`.py` file in one call.
uk: *optimize* вказує рівень оптимізації для компілятора. Він передається до вбудованої функції :func:`compile`. Приймає також послідовність рівнів оптимізації, які призводять до кількох компіляцій одного файлу :file:`.py` за один виклик.

source: The argument *workers* specifies how many workers are used to compile files in parallel. The default is to not use multiple workers. If the platform can't use multiple workers and *workers* argument is given, then sequential compilation will be used as a fallback. If *workers* is 0, the number of cores in the system is used. If *workers* is lower than ``0``, a :exc:`ValueError` will be raised.
uk: Аргумент *workers* визначає, скільки робітників використовується для паралельної компіляції файлів. За замовчуванням не використовується кілька робітників. Якщо платформа не може використовувати кілька робітників і надано аргумент *workers*, то послідовна компіляція буде використана як запасний варіант. Якщо *workers* дорівнює 0, використовується кількість ядер у системі. Якщо *workers* нижчий за ``0``, буде викликано :exc:`ValueError`.

source: *invalidation_mode* should be a member of the :class:`py_compile.PycInvalidationMode` enum and controls how the generated pycs are invalidated at runtime.
uk: *invalidation_mode* має бути членом переліку :class:`py_compile.PycInvalidationMode` і керувати тим, як згенеровані pyc стають недійсними під час виконання.

source: If *hardlink_dupes* is true and two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
uk: Якщо *hardlink_dupes* має значення true і два файли ``.pyc`` з різним рівнем оптимізації мають однаковий вміст, використовуйте жорсткі посилання для об’єднання дублікатів файлів.

source: Added the *legacy* and *optimize* parameter.
uk: Додано параметр *legacy* і *optimize*.

source: Added the *workers* parameter.
uk: Додано параметр *workers*.

source: *quiet* parameter was changed to a multilevel value.
uk: Параметр *quiet* змінено на багаторівневе значення.

source: The *legacy* parameter only writes out ``.pyc`` files, not ``.pyo`` files no matter what the value of *optimize* is.
uk: Параметр *legacy* записує лише файли ``.pyc``, а не файли ``.pyo`` незалежно від значення *optimize*.

source: Accepts a :term:`path-like object`.
uk: Приймає :term:`path-like object`.

source: The *invalidation_mode* parameter was added.
uk: Додано параметр *invalidation_mode*.

source: Setting *workers* to 0 now chooses the optimal number of cores.
uk: Встановлення *workers* на 0 тепер вибирає оптимальну кількість ядер.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments. Default value of *maxlevels* was changed from ``10`` to ``sys.getrecursionlimit()``
uk: Додано аргументи *stripdir*, *prependdir*, *limit_sl_dest* і *hardlink_dupes*. Значення за замовчуванням *maxlevels* змінено з ``10`` на ``sys.getrecursionlimit()``

source: Compile the file with path *fullname*. Return a true value if the file compiled successfully, and a false value otherwise.
uk: Скомпілюйте файл із шляхом *fullname*. Повертає значення true, якщо файл скомпільовано успішно, і значення false в іншому випадку.

source: If *ddir* is given, it is prepended to the path to the file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
uk: Якщо вказано *ddir*, він додається до шляху до файлу, що компілюється для використання в відстеженнях часу компіляції, а також компілюється у файл байт-коду, де він використовуватиметься в відстеженнях та інших повідомленнях у випадках, коли вихідний файл не існує на момент виконання файлу байт-коду.

source: If *rx* is given, its ``search`` method is passed the full path name to the file being compiled, and if it returns a true value, the file is not compiled and ``True`` is returned. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
uk: Якщо задано *rx*, його методу ``search`` передається повне ім’я шляху до файлу, що компілюється, і якщо він повертає значення true, файл не скомпільується і повертається ``True``. Це можна використовувати для виключення файлів, які відповідають регулярному виразу, заданому як об’єкт :ref:`re.Pattern <re-objects>`.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments.
uk: Додано аргументи *stripdir*, *prependdir*, *limit_sl_dest* і *hardlink_dupes*.

source: Byte-compile all the :file:`.py` files found along ``sys.path``. Return a true value if all the files compiled successfully, and a false value otherwise.
uk: Байтова компіляція всіх файлів :file:`.py`, знайдених уздовж ``sys.path``. Повертає значення true, якщо всі файли скомпільовано успішно, і значення false в іншому випадку.

source: If *skip_curdir* is true (the default), the current directory is not included in the search. All other parameters are passed to the :func:`compile_dir` function. Note that unlike the other compile functions, ``maxlevels`` defaults to ``0``.
uk: Якщо *skip_curdir* має значення true (за замовчуванням), поточний каталог не включається в пошук. Усі інші параметри передаються до функції :func:`compile_dir`. Зауважте, що на відміну від інших функцій компіляції, ``maxlevels`` за умовчанням має ``0``.

source: To force a recompile of all the :file:`.py` files in the :file:`Lib/` subdirectory and all its subdirectories::
uk: Щоб примусово перекомпілювати всі файли :file:`.py` у підкаталозі :file:`Lib/` та всіх його підкаталогах:

source: Module :mod:`py_compile`
uk: Модуль :mod:`py_compile`

source: Byte-compile a single source file.
uk: Байтова компіляція єдиного вихідного файлу.
