Repository: python/python-docs-uk
Catalog: library/configparser.po
Languages: uk

source: **Source code:** :source:`Lib/configparser.py`
uk: **Вихідний код:** :source:`Lib/configparser.py`

source: This module provides the :class:`ConfigParser` class which implements a basic configuration language which provides a structure similar to what's found in Microsoft Windows INI files. You can use this to write Python programs which can be customized by end users easily.
uk: Цей модуль надає клас :class:`ConfigParser`, який реалізує базову мову конфігурації, яка забезпечує структуру, подібну до тієї, що міститься у файлах Microsoft Windows INI. Ви можете використовувати це для написання програм на Python, які можуть бути легко налаштовані кінцевими користувачами.

source: This library does *not* interpret or write the value-type prefixes used in the Windows Registry extended version of INI syntax.
uk: Ця бібліотека *не* інтерпретує та не записує префікси типу значень, які використовуються в розширеній версії синтаксису INI реєстру Windows.

source: Module :mod:`shlex`
uk: Модуль :mod:`shlex`

source: Module :mod:`json`
uk: Модуль :mod:`json`

source: Quick Start
uk: Швидкий початок

source: Let's take a very basic configuration file that looks like this:
uk: Давайте візьмемо простий файл конфігурації, який виглядає так:

source: The structure of INI files is described `in the following section <#supported-ini-file-structure>`_. Essentially, the file consists of sections, each of which contains keys with values. :mod:`configparser` classes can read and write such files. Let's start by creating the above configuration file programmatically.
uk: Структура файлів INI описана `в наступному розділі <#supported-ini-file-structure>`_. По суті, файл складається з розділів, кожен з яких містить ключі зі значеннями. :mod:`configparser` класи можуть читати та записувати такі файли. Почнемо зі створення наведеного вище файлу конфігурації програмним шляхом.

source: As you can see, we can treat a config parser much like a dictionary. There are differences, `outlined later <#mapping-protocol-access>`_, but the behavior is very close to what you would expect from a dictionary.
uk: Як бачите, ми можемо розглядати аналізатор конфігурації так само, як словник. Є відмінності, `викладені пізніше <#mapping-protocol-access>`_, але поведінка дуже близька до того, що ви очікуєте від словника.

source: Now that we have created and saved a configuration file, let's read it back and explore the data it holds.
uk: Тепер, коли ми створили та зберегли файл конфігурації, давайте перечитаємо його та дослідимо дані, які він містить.

source: As we can see above, the API is pretty straightforward. The only bit of magic involves the ``DEFAULT`` section which provides default values for all other sections [1]_. Note also that keys in sections are case-insensitive and stored in lowercase [1]_.
uk: Як ми бачимо вище, API досить простий. Єдина магія стосується розділу ``DEFAULT``, який надає значення за умовчанням для всіх інших розділів [1]_. Зауважте також, що ключі в розділах нечутливі до регістру та зберігаються в нижньому регістрі [1]_.

source: This behaviour is equivalent to a :meth:`ConfigParser.read` call with several files passed to the *filenames* parameter.
uk: Така поведінка еквівалентна виклику :meth:`ConfigParser.read` з кількома файлами, переданими в параметр *filenames*.

source: Supported Datatypes
uk: Підтримувані типи даних

source: Config parsers do not guess datatypes of values in configuration files, always storing them internally as strings. This means that if you need other datatypes, you should convert on your own:
uk: Синтаксичні аналізатори конфігурації не вгадують типи даних значень у файлах конфігурації, завжди зберігаючи їх усередині як рядки. Це означає, що якщо вам потрібні інші типи даних, ви повинні конвертувати самостійно:

source: Since this task is so common, config parsers provide a range of handy getter methods to handle integers, floats and booleans. The last one is the most interesting because simply passing the value to ``bool()`` would do no good since ``bool('False')`` is still ``True``. This is why config parsers also provide :meth:`~ConfigParser.getboolean`. This method is case-insensitive and recognizes Boolean values from ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` and ``'1'``/``'0'`` [1]_. For example:
uk: Оскільки це завдання дуже поширене, аналізатори конфігурації надають ряд зручних методів отримання для обробки цілих чисел, чисел з плаваючою точкою та логічних значень. Останнє є найцікавішим, тому що проста передача значення в ``bool()`` не принесе користі, оскільки ``bool('False')`` все ще ``True``. Ось чому аналізатори конфігурації також надають :meth:`~ConfigParser.getboolean`. Цей метод не враховує регістр і розпізнає логічні значення з ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'`` /``'false'`` і ``'1'``/``'0'`` [1]_. Наприклад:

source: Apart from :meth:`~ConfigParser.getboolean`, config parsers also provide equivalent :meth:`~ConfigParser.getint` and :meth:`~ConfigParser.getfloat` methods. You can register your own converters and customize the provided ones. [1]_
uk: Крім :meth:`~ConfigParser.getboolean`, аналізатори конфігурації також надають еквівалентні методи :meth:`~ConfigParser.getint` і :meth:`~ConfigParser.getfloat`. Ви можете зареєструвати власні конвертери та налаштувати надані. [1]_

source: Fallback Values
uk: Запасні значення

source: The same ``fallback`` argument can be used with the :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` and :meth:`~ConfigParser.getboolean` methods, for example:
uk: Той самий резервний аргумент можна використовувати з методами :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` і :meth:`~ConfigParser.getboolean`, наприклад:

source: Supported INI File Structure
uk: Підтримувана структура файлу INI

source: A configuration file consists of sections, each led by a ``[section]`` header, followed by key/value entries separated by a specific string (``=`` or ``:`` by default [1]_). By default, section names are case sensitive but keys are not [1]_. Leading and trailing whitespace is removed from keys and values. Values can be omitted if the parser is configured to allow it [1]_, in which case the key/value delimiter may also be left out. Values can also span multiple lines, as long as they are indented deeper than the first line of the value. Depending on the parser's mode, blank lines may be treated as parts of multiline values or ignored.
uk: Файл конфігурації складається з розділів, кожен із яких очолюється заголовком ``[section]``, за яким ідуть записи ключ/значення, розділені певним рядком (``=`` або ``:`` за умовчанням [1]_) . За замовчуванням назви розділів чутливі до регістру, але ключі не [1]_. Пробіли на початку та в кінці видаляються з ключів і значень. Значення можна опустити, якщо синтаксичний аналізатор налаштовано на це дозволено [1]_, у цьому випадку роздільник ключ/значення також може бути пропущений. Значення також можуть охоплювати кілька рядків, якщо вони мають відступ глибший, ніж перший рядок значення. Залежно від режиму аналізатора, порожні рядки можуть розглядатися як частини багаторядкових значень або ігноруватися.

source: Configuration files may include comments, prefixed by specific characters (``#`` and ``;`` by default [1]_). Comments may appear on their own on an otherwise empty line, possibly indented. [1]_
uk: Файли конфігурації можуть містити коментарі, перед якими стоять певні символи (``#`` і ``;`` за замовчуванням [1]_). Коментарі можуть з’явитися самостійно в порожньому рядку, можливо, з відступом. [1]_

source: For example:
uk: Наприклад:

source: Interpolation of values
uk: Інтерполяція значень

source: On top of the core functionality, :class:`ConfigParser` supports interpolation. This means values can be preprocessed before returning them from ``get()`` calls.
uk: Окрім основних функцій, :class:`ConfigParser` підтримує інтерполяцію. Це означає, що значення можна попередньо обробити перед поверненням із викликів ``get()``.

source: The default implementation used by :class:`ConfigParser`. It enables values to contain format strings which refer to other values in the same section, or values in the special default section [1]_. Additional default values can be provided on initialization.
uk: Стандартна реалізація, яку використовує :class:`ConfigParser`. Це дозволяє значенням містити рядки формату, які посилаються на інші значення в тому самому розділі, або значення в спеціальному розділі за замовчуванням [1]_. Під час ініціалізації можна надати додаткові значення за замовчуванням.

source: In the example above, :class:`ConfigParser` with *interpolation* set to ``BasicInterpolation()`` would resolve ``%(home_dir)s`` to the value of ``home_dir`` (``/Users`` in this case). ``%(my_dir)s`` in effect would resolve to ``/Users/lumberjack``. All interpolations are done on demand so keys used in the chain of references do not have to be specified in any specific order in the configuration file.
uk: У наведеному вище прикладі :class:`ConfigParser` з *інтерполяцією*, встановленою на ``BasicInterpolation()``, перетворює ``%(home_dir)s`` на значення ``home_dir`` (``/Users`` у цьому випадку ). ``%(my_dir)s`` фактично перетворювався б на ``/Users/lumberjack``. Усі інтерполяції виконуються на вимогу, тому ключі, які використовуються в ланцюжку посилань, не потрібно вказувати в певному порядку у файлі конфігурації.

source: With ``interpolation`` set to ``None``, the parser would simply return ``%(my_dir)s/Pictures`` as the value of ``my_pictures`` and ``%(home_dir)s/lumberjack`` as the value of ``my_dir``.
uk: Якщо ``interpolation`` встановлено на ``None``, аналізатор просто повертатиме ``%(my_dir)s`` як значення ``my_pictures`` і ``%(home_dir)s/lumberjack`` як значення ``my_dir``.

source: An alternative handler for interpolation which implements a more advanced syntax, used for instance in ``zc.buildout``. Extended interpolation is using ``${section:option}`` to denote a value from a foreign section. Interpolation can span multiple levels. For convenience, if the ``section:`` part is omitted, interpolation defaults to the current section (and possibly the default values from the special section).
uk: Альтернативний обробник для інтерполяції, який реалізує розширеніший синтаксис, який використовується, наприклад, у ``zc.buildout``. Розширена інтерполяція використовує ``${section:option}`` для позначення значення з іноземного розділу. Інтерполяція може охоплювати кілька рівнів. Для зручності, якщо частина ``section:`` опущена, інтерполяція за замовчуванням використовується для поточного розділу (і, можливо, до значень за замовчуванням зі спеціального розділу).

source: For example, the configuration specified above with basic interpolation, would look like this with extended interpolation:
uk: Наприклад, зазначена вище конфігурація з базовою інтерполяцією виглядатиме так з розширеною інтерполяцією:

source: Values from other sections can be fetched as well:
uk: Також можна отримати значення з інших розділів:

source: Mapping Protocol Access
uk: Доступ до протоколу відображення

source: Mapping protocol access is a generic name for functionality that enables using custom objects as if they were dictionaries. In case of :mod:`configparser`, the mapping interface implementation is using the ``parser['section']['option']`` notation.
uk: Доступ до протоколу зіставлення — це загальна назва функціональних можливостей, які дають змогу використовувати спеціальні об’єкти як словники. У випадку :mod:`configparser` реалізація інтерфейсу зіставлення використовує нотацію ``parser['section']['option']``.

source: ``parser['section']`` in particular returns a proxy for the section's data in the parser. This means that the values are not copied but they are taken from the original parser on demand. What's even more important is that when values are changed on a section proxy, they are actually mutated in the original parser.
uk: ``parser['section']`` зокрема повертає проксі для даних розділу в аналізаторі. Це означає, що значення не копіюються, а беруться з оригінального аналізатора на вимогу. Ще важливішим є те, що коли значення змінюються на проксі-сервері розділу, вони фактично змінюються в оригінальному парсері.

source: :mod:`configparser` objects behave as close to actual dictionaries as possible. The mapping interface is complete and adheres to the :class:`~collections.abc.MutableMapping` ABC. However, there are a few differences that should be taken into account:
uk: :mod:`configparser` об’єкти поводяться якомога ближче до справжніх словників. Інтерфейс зіставлення завершений і відповідає :class:`~collections.abc.MutableMapping` ABC. Однак є кілька відмінностей, які слід взяти до уваги:

source: By default, all keys in sections are accessible in a case-insensitive manner [1]_. E.g. ``for option in parser["section"]`` yields only ``optionxform``'ed option key names. This means lowercased keys by default. At the same time, for a section that holds the key ``'a'``, both expressions return ``True``::
uk: За замовчуванням усі ключі в розділах доступні без урахування регістру [1]_. наприклад ``for option in parser["section"]`` дає лише ``optionxform`` імена ключів опцій. Це означає, що ключі в нижньому регістрі за замовчуванням. Водночас для розділу, який містить ключ ``'a``, обидва вирази повертають ``True``::

source: All sections include ``DEFAULTSECT`` values as well which means that ``.clear()`` on a section may not leave the section visibly empty. This is because default values cannot be deleted from the section (because technically they are not there). If they are overridden in the section, deleting causes the default value to be visible again. Trying to delete a default value causes a :exc:`KeyError`.
uk: Усі розділи також містять значення ``DEFAULTSECT``, що означає, що ``.clear()`` у розділі не може залишати розділ видимо порожнім. Це тому, що значення за замовчуванням не можна видалити з розділу (оскільки технічно їх там немає). Якщо їх перевизначено в розділі, видалення призведе до того, що значення за замовчуванням знову стане видимим. Спроба видалити значення за замовчуванням викликає :exc:`KeyError`.

source: ``DEFAULTSECT`` cannot be removed from the parser:
uk: ``DEFAULTSECT`` не можна видалити з аналізатора:

source: trying to delete it raises :exc:`ValueError`,
uk: спроба його видалити викликає :exc:`ValueError`,

source: ``parser.clear()`` leaves it intact,
uk: ``parser.clear()`` залишає його недоторканим,

source: ``parser.popitem()`` never returns it.
uk: ``parser.popitem()`` ніколи не повертає його.

source: ``parser.get(section, option, **kwargs)`` - the second argument is **not** a fallback value. Note however that the section-level ``get()`` methods are compatible both with the mapping protocol and the classic configparser API.
uk: ``parser.get(section, option, **kwargs)`` - другий аргумент **не** є резервним значенням. Однак зауважте, що методи ``get()`` на рівні розділу сумісні як з протоколом відображення, так і з класичним API конфігуратора.

source: ``parser.items()`` is compatible with the mapping protocol (returns a list of *section_name*, *section_proxy* pairs including the DEFAULTSECT). However, this method can also be invoked with arguments: ``parser.items(section, raw, vars)``. The latter call returns a list of *option*, *value* pairs for a specified ``section``, with all interpolations expanded (unless ``raw=True`` is provided).
uk: ``parser.items()`` сумісний із протоколом відображення (повертає список пар *section_name*, *section_proxy*, включаючи DEFAULTSECT). Однак цей метод також можна викликати за допомогою аргументів: ``parser.items(section, raw, vars)``. Останній виклик повертає список пар *option*, *value* для вказаного ``розділу`` з усіма розширеними інтерполяціями (якщо не надано ``raw=True``).

source: The mapping protocol is implemented on top of the existing legacy API so that subclasses overriding the original interface still should have mappings working as expected.
uk: Протокол відображення реалізовано поверх існуючого застарілого API, так що підкласи, які замінюють вихідний інтерфейс, все ще повинні мати відображення, що працюють належним чином.

source: Customizing Parser Behaviour
uk: Налаштування поведінки аналізатора

source: There are nearly as many INI format variants as there are applications using it. :mod:`configparser` goes a long way to provide support for the largest sensible set of INI styles available. The default functionality is mainly dictated by historical background and it's very likely that you will want to customize some of the features.
uk: Існує майже стільки ж варіантів формату INI, скільки програм, які його використовують. :mod:`configparser` робить довгий шлях, щоб забезпечити підтримку найбільшого розумного набору доступних стилів INI. Функціональність за замовчуванням здебільшого продиктована історичним минулим, і дуже ймовірно, що ви захочете налаштувати деякі функції.

source: *defaults*, default value: ``None``
uk: *за замовчуванням*, значення за замовчуванням: ``None``

source: This option accepts a dictionary of key-value pairs which will be initially put in the ``DEFAULT`` section. This makes for an elegant way to support concise configuration files that don't specify values which are the same as the documented default.
uk: Цей параметр приймає словник пар ключ-значення, який спочатку буде розміщено в розділі ``DEFAULT``. Це створює елегантний спосіб підтримки стислих конфігураційних файлів, які не вказують значення, які збігаються з документованими за замовчуванням.

source: *dict_type*, default value: :class:`dict`
uk: *dict_type*, значення за умовчанням: :class:`dict`

source: This option has a major impact on how the mapping protocol will behave and how the written configuration files look. With the standard dictionary, every section is stored in the order they were added to the parser. Same goes for options within sections.
uk: Цей параметр значно впливає на роботу протоколу відображення та вигляд записаних конфігураційних файлів. У стандартному словнику кожен розділ зберігається в порядку їх додавання до синтаксичного аналізатора. Те саме стосується параметрів у розділах.

source: An alternative dictionary type can be used for example to sort sections and options on write-back.
uk: Альтернативний тип словника можна використовувати, наприклад, для сортування розділів і параметрів під час зворотного запису.

source: Please note: there are ways to add a set of key-value pairs in a single operation. When you use a regular dictionary in those operations, the order of the keys will be ordered. For example:
uk: Зверніть увагу: є способи додати набір пар ключ-значення за одну операцію. Якщо ви використовуєте звичайний словник у цих операціях, порядок ключів буде впорядкованим. Наприклад:

source: *allow_no_value*, default value: ``False``
uk: *allow_no_value*, значення за умовчанням: ``False``

source: Some configuration files are known to include settings without values, but which otherwise conform to the syntax supported by :mod:`configparser`. The *allow_no_value* parameter to the constructor can be used to indicate that such values should be accepted:
uk: Відомо, що деякі конфігураційні файли містять налаштування без значень, але в іншому випадку вони відповідають синтаксису, який підтримує :mod:`configparser`. Параметр *allow_no_value* для конструктора можна використовувати, щоб вказати, що такі значення повинні бути прийняті:

source: *delimiters*, default value: ``('=', ':')``
uk: *роздільники*, значення за умовчанням: ``('=', ':')``

source: Delimiters are substrings that delimit keys from values within a section. The first occurrence of a delimiting substring on a line is considered a delimiter. This means values (but not keys) can contain the delimiters.
uk: Роздільники — це підрядки, які відокремлюють ключі від значень у розділі. Перше входження розділювального підрядка в рядок вважається роздільником. Це означає, що значення (але не ключі) можуть містити розділювачі.

source: See also the *space_around_delimiters* argument to :meth:`ConfigParser.write`.
uk: Дивіться також аргумент *space_around_delimiters* для :meth:`ConfigParser.write`.

source: *comment_prefixes*, default value: ``('#', ';')``
uk: *comment_prefixes*, значення за умовчанням: ``('#', ';')``

source: *inline_comment_prefixes*, default value: ``None``
uk: *inline_comment_prefixes*, значення за умовчанням: ``None``

source: Comment prefixes are strings that indicate the start of a valid comment within a config file. *comment_prefixes* are used only on otherwise empty lines (optionally indented) whereas *inline_comment_prefixes* can be used after every valid value (e.g. section names, options and empty lines as well). By default inline comments are disabled and ``'#'`` and ``';'`` are used as prefixes for whole line comments.
uk: Префікси коментарів — це рядки, які вказують на початок дійсного коментаря у конфігураційному файлі. *comment_prefixes* використовуються лише в порожніх рядках (необов’язково з відступом), тоді як *inline_comment_prefixes* можна використовувати після кожного дійсного значення (наприклад, назв розділів, параметрів і порожніх рядків). За замовчуванням вбудовані коментарі вимкнено, а ``'#'`` і ``';''`` використовуються як префікси для цілих рядкових коментарів.

source: In previous versions of :mod:`configparser` behaviour matched ``comment_prefixes=('#',';')`` and ``inline_comment_prefixes=(';',)``.
uk: У попередніх версіях :mod:`configparser` поведінка відповідала ``comment_prefixes=('#',';')`` та ``inline_comment_prefixes=(';',)``.

source: Please note that config parsers don't support escaping of comment prefixes so using *inline_comment_prefixes* may prevent users from specifying option values with characters used as comment prefixes. When in doubt, avoid setting *inline_comment_prefixes*. In any circumstances, the only way of storing comment prefix characters at the beginning of a line in multiline values is to interpolate the prefix, for example::
uk: Зауважте, що аналізатори конфігурації не підтримують екранування префіксів коментарів, тому використання *inline_comment_prefixes* може перешкодити користувачам вказувати значення параметрів із символами, які використовуються як префікси коментарів. Якщо сумніваєтеся, уникайте встановлення *inline_comment_prefixes*. За будь-яких обставин єдиний спосіб зберегти символи префікса коментаря на початку рядка в багаторядкових значеннях — це інтерполювати префікс, наприклад::

source: *strict*, default value: ``True``
uk: *строгий*, значення за умовчанням: ``True``

source: In previous versions of :mod:`configparser` behaviour matched ``strict=False``.
uk: У попередніх версіях :mod:`configparser` поведінка відповідала ``strict=False``.

source: *empty_lines_in_values*, default value: ``True``
uk: *empty_lines_in_values*, значення за умовчанням: ``True``

source: In config parsers, values can span multiple lines as long as they are indented more than the key that holds them. By default parsers also let empty lines to be parts of values. At the same time, keys can be arbitrarily indented themselves to improve readability. In consequence, when configuration files get big and complex, it is easy for the user to lose track of the file structure. Take for instance:
uk: У синтаксичних аналізаторах конфігурації значення можуть охоплювати кілька рядків, якщо вони мають відступ більше, ніж ключ, який їх містить. За замовчуванням аналізатори також дозволяють порожнім рядкам бути частинами значень. У той же час самі клавіші можуть мати довільний відступ для покращення читабельності. Як наслідок, коли файли конфігурації стають великими та складними, користувачеві легко втратити структуру файлу. Візьмемо, наприклад:
