Repository: python/python-docs-uk
Catalog: library/configparser.po
Languages: uk

source: Write a representation of the configuration to the specified :term:`file object`, which must be opened in text mode (accepting strings). This representation can be parsed by a future :meth:`read` call. If *space_around_delimiters* is true, delimiters between keys and values are surrounded by spaces.
uk: Запишіть представлення конфігурації у вказаний :term:`file object`, який потрібно відкрити в текстовому режимі (приймаючи рядки). Це представлення може бути проаналізовано майбутнім викликом :meth:`read`. Якщо *space_around_delimiters* має значення true, роздільники між ключами та значеннями оточуються пробілами.

source: Comments in the original configuration file are not preserved when writing the configuration back. What is considered a comment, depends on the given values for *comment_prefix* and *inline_comment_prefix*.
uk: Коментарі у вихідному файлі конфігурації не зберігаються під час повторного запису конфігурації. Те, що вважається коментарем, залежить від заданих значень для *comment_prefix* і *inline_comment_prefix*.

source: Remove the specified *option* from the specified *section*. If the section does not exist, raise :exc:`NoSectionError`. If the option existed to be removed, return :const:`True`; otherwise return :const:`False`.
uk: Видалити вказаний *параметр* із зазначеного *розділу*. Якщо розділ не існує, підніміть :exc:`NoSectionError`. Якщо існувала опція для видалення, поверніть :const:`True`; інакше повертає :const:`False`.

source: Remove the specified *section* from the configuration. If the section in fact existed, return ``True``. Otherwise return ``False``.
uk: Видалити вказаний *розділ* із конфігурації. Якщо розділ дійсно існував, поверніть ``True``. Інакше поверніть ``False``.

source: Transforms the option name *option* as found in an input file or as passed in by client code to the form that should be used in the internal structures. The default implementation returns a lower-case version of *option*; subclasses may override this or client code can set an attribute of this name on instances to affect this behavior.
uk: Перетворює назву параметра *option*, знайдену у вхідному файлі або передану кодом клієнта, у форму, яка має використовуватися у внутрішніх структурах. Реалізація за замовчуванням повертає версію *option* у нижньому регістрі; підкласи можуть замінити це, або код клієнта може встановити атрибут цього імені в екземплярах, щоб вплинути на цю поведінку.

source: You don't need to subclass the parser to use this method, you can also set it on an instance, to a function that takes a string argument and returns a string. Setting it to ``str``, for example, would make option names case sensitive::
uk: Вам не потрібно створювати підкласи синтаксичного аналізатора, щоб використовувати цей метод, ви також можете встановити його на екземпляр, на функцію, яка приймає рядковий аргумент і повертає рядок. Наприклад, якщо встановити значення ``str``, назви опцій будуть чутливими до регістру:

source: Note that when reading configuration files, whitespace around the option names is stripped before :meth:`optionxform` is called.
uk: Зауважте, що під час читання конфігураційних файлів пробіли навколо назв параметрів видаляються перед викликом :meth:`optionxform`.

source: RawConfigParser Objects
uk: Об’єкти RawConfigParser

source: Legacy variant of the :class:`ConfigParser`. It has interpolation disabled by default and allows for non-string section names, option names, and values via its unsafe ``add_section`` and ``set`` methods, as well as the legacy ``defaults=`` keyword argument handling.
uk: Застарілий варіант :class:`ConfigParser`. Він має інтерполяцію вимкнено за замовчуванням і дозволяє використовувати нерядкові назви розділів, назви параметрів і значення за допомогою небезпечних методів ``add_section`` і ``set``, а також застарілої обробки аргументів ключового слова ``defaults=``. .

source: Consider using :class:`ConfigParser` instead which checks types of the values to be stored internally. If you don't want interpolation, you can use ``ConfigParser(interpolation=None)``.
uk: Розгляньте можливість використання :class:`ConfigParser` натомість, який перевіряє типи значень, які зберігатимуться всередині. Якщо вам не потрібна інтерполяція, ви можете використати ``ConfigParser(interpolation=None)``.

source: Add a section named *section* to the instance. If a section by the given name already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised.
uk: Додайте до екземпляра розділ із назвою *section*. Якщо розділ із вказаною назвою вже існує, виникає :exc:`DuplicateSectionError`. Якщо передано назву *розділу за замовчуванням*, виникає помилка :exc:`ValueError`.

source: Type of *section* is not checked which lets users create non-string named sections. This behaviour is unsupported and may cause internal errors.
uk: Тип *розділу* не позначено, що дозволяє користувачам створювати розділи без рядкових імен. Така поведінка не підтримується та може викликати внутрішні помилки.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. While it is possible to use :class:`RawConfigParser` (or :class:`ConfigParser` with *raw* parameters set to true) for *internal* storage of non-string values, full functionality (including interpolation and output to files) can only be achieved using string values.
uk: Якщо даний розділ існує, установіть для даного параметра вказане значення; інакше підняти :exc:`NoSectionError`. Хоча можна використовувати :class:`RawConfigParser` (або :class:`ConfigParser` з *raw* параметрами, встановленими на true) для *внутрішнього* зберігання нерядкових значень, повна функціональність (включно з інтерполяцією та виведенням у файли) можна досягти лише за допомогою рядкових значень.

source: This method lets users assign non-string values to keys internally. This behaviour is unsupported and will cause errors when attempting to write to a file or get it in non-raw mode. **Use the mapping protocol API** which does not allow such assignments to take place.
uk: Цей метод дозволяє користувачам внутрішньо призначати нерядкові значення ключам. Така поведінка не підтримується та спричинить помилки під час спроби запису у файл або отримання його в режимі без обробки. **Використовуйте API протоколу зіставлення**, який не дозволяє виконувати такі призначення.

source: Exceptions
uk: Винятки

source: Base class for all other :mod:`configparser` exceptions.
uk: Базовий клас для всіх інших винятків :mod:`configparser`.

source: Exception raised when a specified section is not found.
uk: Виняток виникає, коли вказаний розділ не знайдено.

source: Exception raised by strict parsers if a single option appears twice during reading from a single file, string or dictionary. This catches misspellings and case sensitivity-related errors, e.g. a dictionary may have two keys representing the same case-insensitive configuration key.
uk: Виняток, створений строгими парсерами, якщо одна опція з’являється двічі під час читання з одного файлу, рядка або словника. Це виявляє орфографічні помилки та помилки, пов’язані з регістром, напр. словник може мати два ключі, що представляють один і той же ключ конфігурації без урахування регістру.

source: Exception raised when a specified option is not found in the specified section.
uk: Виняток виникає, коли вказаний параметр не знайдено у вказаному розділі.

source: Base class for exceptions raised when problems occur performing string interpolation.
uk: Базовий клас для винятків, які виникають, коли виникають проблеми з виконанням інтерполяції рядків.

source: Exception raised when string interpolation cannot be completed because the number of iterations exceeds :const:`MAX_INTERPOLATION_DEPTH`. Subclass of :exc:`InterpolationError`.
uk: Виняток виникає, коли інтерполяцію рядка неможливо завершити, оскільки кількість ітерацій перевищує :const:`MAX_INTERPOLATION_DEPTH`. Підклас :exc:`InterpolationError`.

source: Exception raised when an option referenced from a value does not exist. Subclass of :exc:`InterpolationError`.
uk: Виняток виникає, коли параметр, на який посилається значення, не існує. Підклас :exc:`InterpolationError`.

source: Exception raised when the source text into which substitutions are made does not conform to the required syntax. Subclass of :exc:`InterpolationError`.
uk: Виняток виникає, коли вихідний текст, у якому зроблено заміни, не відповідає необхідному синтаксису. Підклас :exc:`InterpolationError`.

source: Exception raised when attempting to parse a file which has no section headers.
uk: Під час спроби проаналізувати файл, який не має заголовків розділів, виникає виняток.

source: Exception raised when errors occur attempting to parse a file.
uk: Виняток виникає, коли виникають помилки під час спроби аналізу файлу.

source: Footnotes
uk: Виноски

source: Config parsers allow for heavy customization. If you are interested in changing the behaviour outlined by the footnote reference, consult the `Customizing Parser Behaviour`_ section.
uk: Синтаксичні аналізатори конфігурації дозволяють здійснювати серйозні налаштування. Якщо ви зацікавлені в зміні поведінки, окресленої посиланням на виноску, зверніться до розділу "Налаштування поведінки аналізатора" (`Customizing Parser Behaviour`_).
