Repository: python/python-docs-uk
Catalog: library/configparser.po
Languages: uk

source: This can be especially problematic for the user to see if she's using a proportional font to edit the file. That is why when your application does not need values with empty lines, you should consider disallowing them. This will make empty lines split keys every time. In the example above, it would produce two keys, ``key`` and ``this``.
uk: Це може бути особливо проблематично для користувача, щоб побачити, чи він використовує пропорційний шрифт для редагування файлу. Ось чому, якщо вашій програмі не потрібні значення з порожніми рядками, вам слід подумати про їх заборону. Це змусить порожні рядки кожного разу розділяти ключі. У наведеному вище прикладі буде створено два ключі, ``key`` і ``this``.

source: *default_section*, default value: ``configparser.DEFAULTSECT`` (that is: ``"DEFAULT"``)
uk: *default_section*, значення за замовчуванням: ``configparser.DEFAULTSECT`` (тобто: ``"DEFAULT"``)

source: The convention of allowing a special section of default values for other sections or interpolation purposes is a powerful concept of this library, letting users create complex declarative configurations. This section is normally called ``"DEFAULT"`` but this can be customized to point to any other valid section name. Some typical values include: ``"general"`` or ``"common"``. The name provided is used for recognizing default sections when reading from any source and is used when writing configuration back to a file. Its current value can be retrieved using the ``parser_instance.default_section`` attribute and may be modified at runtime (i.e. to convert files from one format to another).
uk: Угода про дозвіл спеціального розділу значень за замовчуванням для інших розділів або для цілей інтерполяції є потужною концепцією цієї бібліотеки, що дозволяє користувачам створювати складні декларативні конфігурації. Цей розділ зазвичай називається ``"ЗА УМОВЧУВАННЯМ"``, але його можна налаштувати так, щоб вказувати на будь-яку іншу дійсну назву розділу. Деякі типові значення включають: ``"загальний"`` або ``"загальний"``. Надана назва використовується для розпізнавання розділів за замовчуванням під час читання з будь-якого джерела та під час запису конфігурації назад у файл. Його поточне значення можна отримати за допомогою атрибута ``parser_instance.default_section`` і можна змінити під час виконання (тобто для перетворення файлів з одного формату в інший).

source: *interpolation*, default value: ``configparser.BasicInterpolation``
uk: *інтерполяція*, значення за умовчанням: ``configparser.BasicInterpolation``

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_. :class:`RawConfigParser` has a default value of ``None``.
uk: Поведінку інтерполяції можна налаштувати, надавши спеціальний обробник через аргумент *interpolation*. ``None`` можна використовувати, щоб повністю вимкнути інтерполяцію, ``ExtendedInterpolation()`` надає більш просунутий варіант, натхненний ``zc.buildout``. Більше про цю тему див. у розділі `спеціальної документації <#interpolation-of-values>`_. :class:`RawConfigParser` має значення за замовчуванням ``None``.

source: *converters*, default value: not set
uk: *конвертери*, значення за замовчуванням: не встановлено

source: If the converter needs to access the state of the parser, it can be implemented as a method on a config parser subclass. If the name of this method starts with ``get``, it will be available on all section proxies, in the dict-compatible form (see the ``getdecimal()`` example above).
uk: Якщо конвертеру потрібно отримати доступ до стану аналізатора, його можна реалізувати як метод у підкласі аналізатора конфігурації. Якщо назва цього методу починається з ``get``, він буде доступний на всіх проксі-серверах розділів у формі, сумісній з dict (див. приклад ``getdecimal()`` вище).

source: More advanced customization may be achieved by overriding default values of these parser attributes. The defaults are defined on the classes, so they may be overridden by subclasses or by attribute assignment.
uk: Більш просунуте налаштування можна досягти шляхом заміни значень за замовчуванням цих атрибутів аналізатора. Значення за замовчуванням визначені в класах, тому вони можуть бути замінені підкласами або призначенням атрибутів.

source: By default when using :meth:`~ConfigParser.getboolean`, config parsers consider the following values ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` and the following values ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. You can override this by specifying a custom dictionary of strings and their Boolean outcomes. For example:
uk: За замовчуванням під час використання :meth:`~ConfigParser.getboolean` аналізатори конфігурації враховують такі значення ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` і такі значення ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. Ви можете перевизначити це, вказавши спеціальний словник рядків та їхніх логічних результатів. Наприклад:

source: Other typical Boolean pairs include ``accept``/``reject`` or ``enabled``/``disabled``.
uk: Інші типові логічні пари включають ``accept``/``reject`` або ``enabled``/``disabled``.

source: This method transforms option names on every read, get, or set operation. The default converts the name to lowercase. This also means that when a configuration file gets written, all keys will be lowercase. Override this method if that's unsuitable. For example:
uk: Цей метод перетворює назви параметрів під час кожної операції читання, отримання або встановлення. За замовчуванням ім'я перетворюється на малі літери. Це також означає, що під час запису файлу конфігурації всі ключі будуть малими літерами. Перевизначте цей метод, якщо він не підходить. Наприклад:

source: The optionxform function transforms option names to a canonical form. This should be an idempotent function: if the name is already in canonical form, it should be returned unchanged.
uk: Функція optionxform перетворює назви опцій у канонічну форму. Це має бути ідемпотентна функція: якщо ім’я вже є в канонічній формі, його слід повернути без змін.

source: A compiled regular expression used to parse section headers. The default matches ``[section]`` to the name ``"section"``. Whitespace is considered part of the section name, thus ``[ larch ]`` will be read as a section of name ``" larch "``. Override this attribute if that's unsuitable. For example:
uk: Зкомпільований регулярний вираз, який використовується для аналізу заголовків розділів. За умовчанням ``[розділ]`` відповідає назві ``"розділ"``. Пробіли вважаються частиною назви розділу, тому ``[ arch ]`` читатиметься як розділ назви ``" arch "``. Перевизначте цей атрибут, якщо він не підходить. Наприклад:

source: While ConfigParser objects also use an ``OPTCRE`` attribute for recognizing option lines, it's not recommended to override it because that would interfere with constructor options *allow_no_value* and *delimiters*.
uk: Хоча об’єкти ConfigParser також використовують атрибут ``OPTCRE`` для розпізнавання рядків параметрів, не рекомендується перевизначати його, оскільки це заважало б параметрам конструктора *allow_no_value* і *роздільники*.

source: Legacy API Examples
uk: Приклади застарілих API

source: Mainly because of backwards compatibility concerns, :mod:`configparser` provides also a legacy API with explicit ``get``/``set`` methods. While there are valid use cases for the methods outlined below, mapping protocol access is preferred for new projects. The legacy API is at times more advanced, low-level and downright counterintuitive.
uk: В основному через проблеми зворотної сумісності :mod:`configparser` також надає застарілий API з явними методами ``get``/``set``. Хоча існують дійсні випадки використання описаних нижче методів, для нових проектів перевагу надають доступу до протоколу відображення. Застарілий API часом є досконалішим, низькорівневим і відверто неінтуїтивним.

source: An example of writing to a configuration file::
uk: Приклад запису в конфігураційний файл::

source: An example of reading the configuration file again::
uk: Приклад повторного читання конфігураційного файлу::

source: To get interpolation, use :class:`ConfigParser`::
uk: Щоб отримати інтерполяцію, використовуйте :class:`ConfigParser`::

source: Default values are available in both types of ConfigParsers. They are used in interpolation if an option used is not defined elsewhere. ::
uk: Значення за замовчуванням доступні в обох типах ConfigParsers. Вони використовуються в інтерполяції, якщо використовувана опція не визначена в іншому місці. ::

source: ConfigParser Objects
uk: Об’єкти ConfigParser

source: The main configuration parser. When *defaults* is given, it is initialized into the dictionary of intrinsic defaults. When *dict_type* is given, it will be used to create the dictionary objects for the list of sections, for the options within a section, and for the default values.
uk: Основний аналізатор конфігурації. Коли задано *defaults*, воно ініціалізується у словнику внутрішніх типових значень. Якщо вказано *dict_type*, він використовуватиметься для створення об’єктів словника для списку розділів, параметрів у розділі та значень за замовчуванням.

source: When *delimiters* is given, it is used as the set of substrings that divide keys from values. When *comment_prefixes* is given, it will be used as the set of substrings that prefix comments in otherwise empty lines. Comments can be indented. When *inline_comment_prefixes* is given, it will be used as the set of substrings that prefix comments in non-empty lines.
uk: Якщо вказано *роздільники*, вони використовуються як набір підрядків, які відділяють ключі від значень. Якщо вказано *comment_prefixes*, він використовуватиметься як набір підрядків, які додають коментарі до порожніх рядків. Коментарі можна робити з відступом. Якщо задано *inline_comment_prefixes*, воно використовуватиметься як набір підрядків, які додають коментарі до непорожніх рядків.

source: When *strict* is ``True`` (the default), the parser won't allow for any section or option duplicates while reading from a single source (file, string or dictionary), raising :exc:`DuplicateSectionError` or :exc:`DuplicateOptionError`. When *empty_lines_in_values* is ``False`` (default: ``True``), each empty line marks the end of an option. Otherwise, internal empty lines of a multiline option are kept as part of the value. When *allow_no_value* is ``True`` (default: ``False``), options without values are accepted; the value held for these is ``None`` and they are serialized without the trailing delimiter.
uk: Якщо *strict* має значення ``True`` (за замовчуванням), синтаксичний аналізатор не допускатиме жодних дублікатів розділів або параметрів під час читання з одного джерела (файлу, рядка або словника), викликаючи :exc:`DuplicateSectionError` або :exc:`DuplicateOptionError`. Коли *empty_lines_in_values* має значення ``False`` (за замовчуванням: ``True``), кожен порожній рядок позначає кінець параметра. В іншому випадку внутрішні порожні рядки багаторядкового параметра зберігаються як частина значення. Якщо *allow_no_value* має значення ``True`` (за замовчуванням: ``False``), параметри без значень приймаються; значенням, яке зберігається для них, є ``None``, і вони серіалізуються без кінцевого розділювача.

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_.
uk: Поведінку інтерполяції можна налаштувати, надавши спеціальний обробник через аргумент *interpolation*. ``None`` можна використовувати, щоб повністю вимкнути інтерполяцію, ``ExtendedInterpolation()`` надає більш просунутий варіант, натхненний ``zc.buildout``. Більше про цю тему див. у розділі `спеціальної документації <#interpolation-of-values>`_.

source: All option names used in interpolation will be passed through the :meth:`optionxform` method just like any other option name reference. For example, using the default implementation of :meth:`optionxform` (which converts option names to lower case), the values ``foo %(bar)s`` and ``foo %(BAR)s`` are equivalent.
uk: Усі назви опцій, що використовуються в інтерполяції, будуть передані через метод :meth:`optionxform` так само, як і будь-яке інше посилання на назву опції. Наприклад, використовуючи стандартну реалізацію :meth:`optionxform` (яка перетворює назви опцій у нижній регістр), значення ``foo %(bar)s`` і ``foo %(BAR)s`` є еквівалентними.

source: The default *dict_type* is :class:`collections.OrderedDict`.
uk: Типом *dict_type* є :class:`collections.OrderedDict`.

source: *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* and *interpolation* were added.
uk: Додано *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* та *interpolation*.

source: The *converters* argument was added.
uk: Додано аргумент *конвертери*.

source: The default *dict_type* is :class:`dict`, since it now preserves insertion order.
uk: Типом *dict_type* є :class:`dict`, оскільки тепер зберігається порядок вставки.

source: Return a dictionary containing the instance-wide defaults.
uk: Повертає словник, що містить значення за замовчуванням для всього екземпляра.

source: Return a list of the sections available; the *default section* is not included in the list.
uk: Повернути список доступних розділів; *розділ за замовчуванням* не включено до списку.

source: Add a section named *section* to the instance. If a section by the given name already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised. The name of the section must be a string; if not, :exc:`TypeError` is raised.
uk: Додайте до екземпляра розділ із назвою *section*. Якщо розділ із вказаною назвою вже існує, виникає :exc:`DuplicateSectionError`. Якщо передано назву *розділу за замовчуванням*, виникає помилка :exc:`ValueError`. Назва розділу має бути рядком; якщо ні, виникає :exc:`TypeError`.

source: Non-string section names raise :exc:`TypeError`.
uk: Нерядкові назви розділів викликають :exc:`TypeError`.

source: Indicates whether the named *section* is present in the configuration. The *default section* is not acknowledged.
uk: Вказує, чи присутній названий *розділ* у конфігурації. Розділ *за замовчуванням* не підтверджується.

source: Return a list of options available in the specified *section*.
uk: Повернути список опцій, доступних у вказаному *розділі*.

source: If the given *section* exists, and contains the given *option*, return :const:`True`; otherwise return :const:`False`. If the specified *section* is :const:`None` or an empty string, DEFAULT is assumed.
uk: Якщо заданий *розділ* існує та містить вказаний *опціон*, поверніть :const:`True`; інакше повертає :const:`False`. Якщо вказаний *розділ* має значення :const:`None` або порожній рядок, передбачається DEFAULT.

source: Attempt to read and parse an iterable of filenames, returning a list of filenames which were successfully parsed.
uk: Спроба прочитати та розібрати ітерацію імен файлів, повертаючи список імен файлів, які були успішно розібрані.

source: If *filenames* is a string, a :class:`bytes` object or a :term:`path-like object`, it is treated as a single filename. If a file named in *filenames* cannot be opened, that file will be ignored. This is designed so that you can specify an iterable of potential configuration file locations (for example, the current directory, the user's home directory, and some system-wide directory), and all existing configuration files in the iterable will be read.
uk: Якщо *filenames* є рядком, об’єктом :class:`bytes` або :term:`path-like object`, воно розглядається як одне ім’я файлу. Якщо файл із назвою *filenaname* неможливо відкрити, цей файл буде проігноровано. Це призначено для того, щоб ви могли вказати ітерацію потенційних розташувань файлів конфігурації (наприклад, поточний каталог, домашній каталог користувача та деякий загальносистемний каталог), і всі існуючі файли конфігурації в ітерації будуть прочитані.

source: If none of the named files exist, the :class:`ConfigParser` instance will contain an empty dataset. An application which requires initial values to be loaded from a file should load the required file or files using :meth:`read_file` before calling :meth:`read` for any optional files::
uk: Якщо жоден із названих файлів не існує, екземпляр :class:`ConfigParser` міститиме порожній набір даних. Програма, яка потребує завантаження початкових значень із файлу, має завантажити необхідний файл або файли за допомогою :meth:`read_file` перед викликом :meth:`read` для будь-яких додаткових файлів::

source: The *filenames* parameter accepts a :term:`path-like object`.
uk: Параметр *filenames* приймає :term:`path-like object`.

source: The *filenames* parameter accepts a :class:`bytes` object.
uk: Параметр *filenames* приймає об’єкт :class:`bytes`.

source: Read and parse configuration data from *f* which must be an iterable yielding Unicode strings (for example files opened in text mode).
uk: Читати та аналізувати конфігураційні дані з *f*, які мають бути повторюваними рядками Unicode (наприклад, файли, відкриті в текстовому режимі).

source: Parse configuration data from a string.
uk: Аналіз даних конфігурації з рядка.

source: Optional argument *source* specifies a context-specific name of the string passed. If not given, ``'<string>'`` is used. This should commonly be a filesystem path or a URL.
uk: Необов'язковий аргумент *джерело* вказує контекстно-залежну назву переданого рядка. Якщо не вказано, використовується ``' <string>'``. Зазвичай це має бути шлях до файлової системи або URL-адреса.

source: Load configuration from any object that provides a dict-like ``items()`` method. Keys are section names, values are dictionaries with keys and values that should be present in the section. If the used dictionary type preserves order, sections and their keys will be added in order. Values are automatically converted to strings.
uk: Завантажте конфігурацію з будь-якого об’єкта, який надає dict-подібний метод ``items()``. Ключі - це назви розділів, значення - це словники з ключами та значеннями, які повинні бути присутніми в розділі. Якщо використовуваний тип словника зберігає порядок, розділи та їхні ключі будуть додані в порядку. Значення автоматично перетворюються на рядки.

source: Optional argument *source* specifies a context-specific name of the dictionary passed. If not given, ``<dict>`` is used.
uk: Необов'язковий аргумент *джерело* вказує контекстно-залежну назву переданого словника. Якщо не вказано, використовується ``<dict>``.

source: This method can be used to copy state between parsers.
uk: Цей метод можна використовувати для копіювання стану між парсерами.

source: Get an *option* value for the named *section*. If *vars* is provided, it must be a dictionary. The *option* is looked up in *vars* (if provided), *section*, and in *DEFAULTSECT* in that order. If the key is not found and *fallback* is provided, it is used as a fallback value. ``None`` can be provided as a *fallback* value.
uk: Отримайте значення *option* для названого *розділу*. Якщо вказано *vars*, це має бути словник. *Опція* шукається в *vars* (якщо передбачено), *section* і в *DEFAULTSECT* у такому порядку. Якщо ключ не знайдено і надано *резервний*, він використовується як резервне значення. ``None`` можна надати як *резервне* значення.

source: All the ``'%'`` interpolations are expanded in the return values, unless the *raw* argument is true. Values for interpolation keys are looked up in the same manner as the option.
uk: Усі інтерполяції ``'%'`` розгортаються у значеннях, що повертаються, якщо аргумент *raw* не має значення true. Значення для ключів інтерполяції шукаються так само, як і параметр.

source: Arguments *raw*, *vars* and *fallback* are keyword only to protect users from trying to use the third argument as the *fallback* fallback (especially when using the mapping protocol).
uk: Аргументи *raw*, *vars* і *fallback* є лише ключовими словами, щоб захистити користувачів від спроб використовувати третій аргумент як *резервний* резерв (особливо під час використання протоколу відображення).

source: A convenience method which coerces the *option* in the specified *section* to an integer. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
uk: Зручний метод, який приводить *опцію* у вказаному *розділі* до цілого числа. Перегляньте :meth:`get` для пояснення *raw*, *vars* і *fallback*.

source: A convenience method which coerces the *option* in the specified *section* to a Boolean value. Note that the accepted values for the option are ``'1'``, ``'yes'``, ``'true'``, and ``'on'``, which cause this method to return ``True``, and ``'0'``, ``'no'``, ``'false'``, and ``'off'``, which cause it to return ``False``. These string values are checked in a case-insensitive manner. Any other value will cause it to raise :exc:`ValueError`. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
uk: Зручний метод, який приводить *параметр* у вказаному *розділі* до логічного значення. Зауважте, що допустимими значеннями параметра є ``'1'``, ``'yes'``, ``'true'`` і ``'on'``, через що цей метод повертає ``True`` і ``'0'``, ``'no'``, ``'false'`` і ``'off'``, які повертають ``False``. Ці рядкові значення перевіряються без урахування регістру. Будь-яке інше значення призведе до виникнення :exc:`ValueError`. Перегляньте :meth:`get` для пояснення *raw*, *vars* і *fallback*.

source: When *section* is not given, return a list of *section_name*, *section_proxy* pairs, including DEFAULTSECT.
uk: Якщо *section* не вказано, повертає список пар *section_name*, *section_proxy*, включаючи DEFAULTSECT.

source: Otherwise, return a list of *name*, *value* pairs for the options in the given *section*. Optional arguments have the same meaning as for the :meth:`get` method.
uk: В іншому випадку поверніть список пар *ім’я*, *значення* для опцій у вказаному *розділі*. Необов’язкові аргументи мають те саме значення, що й для методу :meth:`get`.

source: Items present in *vars* no longer appear in the result. The previous behaviour mixed actual parser options with variables provided for interpolation.
uk: Елементи, присутні в *vars*, більше не відображаються в результатах. Попередня поведінка змішувала фактичні параметри аналізатора зі змінними, наданими для інтерполяції.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. *option* and *value* must be strings; if not, :exc:`TypeError` is raised.
uk: Якщо даний розділ існує, установіть для даного параметра вказане значення; інакше підняти :exc:`NoSectionError`. *option* і *value* мають бути рядками; якщо ні, виникає :exc:`TypeError`.
