Repository: python/python-docs-uk
Catalog: library/constants.po
Languages: uk

source: Built-in Constants
uk: Вбудовані константи

source: A small number of constants live in the built-in namespace. They are:
uk: Невелика кількість констант живе у вбудованому просторі імен. Вони є:

source: The false value of the :class:`bool` type. Assignments to ``False`` are illegal and raise a :exc:`SyntaxError`.
uk: Помилкове значення типу :class:`bool`. Присвоєння ``False`` є незаконним і викликає :exc:`SyntaxError`.

source: The true value of the :class:`bool` type. Assignments to ``True`` are illegal and raise a :exc:`SyntaxError`.
uk: Справжнє значення типу :class:`bool`. Присвоєння ``True`` є незаконним і викликає :exc:`SyntaxError`.

source: An object frequently used to represent the absence of a value, as when default arguments are not passed to a function. Assignments to ``None`` are illegal and raise a :exc:`SyntaxError`. ``None`` is the sole instance of the :data:`NoneType` type.
uk: Об’єкт, який часто використовується для представлення відсутності значення, наприклад, коли аргументи за замовчуванням не передаються до функції. Присвоєння ``None`` є незаконним і викликає :exc:`SyntaxError`. ``None`` є єдиним екземпляром типу :data:`NoneType`.

source: A special value which should be returned by the binary special methods (e.g. :meth:`__eq__`, :meth:`__lt__`, :meth:`__add__`, :meth:`__rsub__`, etc.) to indicate that the operation is not implemented with respect to the other type; may be returned by the in-place binary special methods (e.g. :meth:`__imul__`, :meth:`__iand__`, etc.) for the same purpose. It should not be evaluated in a boolean context. ``NotImplemented`` is the sole instance of the :data:`types.NotImplementedType` type.
uk: Спеціальне значення, яке мають повертати двійкові спеціальні методи (наприклад, :meth:`__eq__`, :meth:`__lt__`, :meth:`__add__`, :meth:`__rsub__` тощо), щоб вказати, що операція не реалізовано щодо іншого типу; може бути повернуто спеціальними двійковими методами на місці (наприклад, :meth:`__imul__`, :meth:`__iand__` тощо) з тією ж метою. Його не слід оцінювати в логічному контексті. ``NotImplemented`` є єдиним екземпляром типу :data:`types.NotImplementedType`.

source: When a binary (or in-place) method returns ``NotImplemented`` the interpreter will try the reflected operation on the other type (or some other fallback, depending on the operator). If all attempts return ``NotImplemented``, the interpreter will raise an appropriate exception. Incorrectly returning ``NotImplemented`` will result in a misleading error message or the ``NotImplemented`` value being returned to Python code.
uk: Коли бінарний (або на місці) метод повертає ``NotImplemented``, інтерпретатор спробує відображену операцію над іншим типом (або іншим резервним варіантом, залежно від оператора). Якщо всі спроби повертають ``NotImplemented``, інтерпретатор викличе відповідний виняток. Неправильне повернення ``NotImplemented`` призведе до оманливого повідомлення про помилку або значення ``NotImplemented``, яке буде повернено до коду Python.

source: See :ref:`implementing-the-arithmetic-operations` for examples.
uk: Перегляньте приклади :ref:`implementing-the-arithmetic-operations`.

source: ``NotImplementedError`` and ``NotImplemented`` are not interchangeable, even though they have similar names and purposes. See :exc:`NotImplementedError` for details on when to use it.
uk: ``NotImplementedError`` і ``NotImplemented`` не є взаємозамінними, навіть якщо вони мають подібні назви та цілі. Перегляньте :exc:`NotImplementedError`, щоб дізнатися, коли її використовувати.

source: Evaluating ``NotImplemented`` in a boolean context is deprecated. While it currently evaluates as true, it will emit a :exc:`DeprecationWarning`. It will raise a :exc:`TypeError` in a future version of Python.
uk: Оцінка ``NotImplemented`` у логічному контексті застаріла. Хоча наразі він оцінюється як істинний, він видасть :exc:`DeprecationWarning`. Це викличе :exc:`TypeError` у наступній версії Python.

source: The same as the ellipsis literal "``...``". Special value used mostly in conjunction with extended slicing syntax for user-defined container data types. ``Ellipsis`` is the sole instance of the :data:`types.EllipsisType` type.
uk: Те саме, що літерал з крапками "``...``". Спеціальне значення, яке використовується переважно разом із розширеним синтаксисом нарізки для визначених користувачем типів даних контейнера. ``Ellipsis`` є єдиним екземпляром типу :data:`types.EllipsisType`.

source: This constant is true if Python was not started with an :option:`-O` option. See also the :keyword:`assert` statement.
uk: Ця константа є істинною, якщо Python не було запущено з параметром :option:`-O`. Дивіться також оператор :keyword:`assert`.

source: The names :data:`None`, :data:`False`, :data:`True` and :data:`__debug__` cannot be reassigned (assignments to them, even as an attribute name, raise :exc:`SyntaxError`), so they can be considered "true" constants.
uk: Імена :data:`None`, :data:`False`, :data:`True` і :data:`__debug__` не можна перепризначити (присвоєння їм, навіть як імені атрибута, викликає :exc:`SyntaxError` ), тому їх можна вважати "справжніми" константами.

source: Constants added by the :mod:`site` module
uk: Константи, додані модулем :mod:`site`

source: The :mod:`site` module (which is imported automatically during startup, except if the :option:`-S` command-line option is given) adds several constants to the built-in namespace. They are useful for the interactive interpreter shell and should not be used in programs.
uk: Модуль :mod:`site` (який імпортується автоматично під час запуску, за винятком випадків, коли задано параметр командного рядка :option:`-S`) додає кілька констант до вбудованого простору імен. Вони корисні для інтерактивної оболонки інтерпретатора і не повинні використовуватися в програмах.

source: Objects that when printed, print a message like "Use quit() or Ctrl-D (i.e. EOF) to exit", and when called, raise :exc:`SystemExit` with the specified exit code.
uk: Об’єкти, які під час друку друкують повідомлення на зразок "Використовуйте quit() або Ctrl-D (тобто EOF) для виходу", а під час виклику викликають :exc:`SystemExit` із зазначеним кодом виходу.

source: Objects that when printed or called, print the text of copyright or credits, respectively.
uk: Об'єкти, які під час друку або виклику друкують текст авторських прав або кредитів відповідно.

source: Object that when printed, prints the message "Type license() to see the full license text", and when called, displays the full license text in a pager-like fashion (one screen at a time).
uk: Об’єкт, який під час друку друкує повідомлення "Введіть licence(), щоб побачити повний текст ліцензії", а під час виклику відображає повний текст ліцензії у вигляді пейджера (по одному екрану).
