Repository: python/python-docs-uk
Catalog: library/ctypes.po
Languages: uk

source: Here is a RECT structure which contains two POINTs named *upperleft* and *lowerright*::
uk: Ось структура RECT, яка містить дві ТОЧКИ з іменами *upperleft* і *lowerright*::

source: Nested structures can also be initialized in the constructor in several ways::
uk: Вкладені структури також можна ініціалізувати в конструкторі кількома способами:

source: Field :term:`descriptor`\s can be retrieved from the *class*, they are useful for debugging because they can provide useful information::
uk: Поля :term:`descriptor`\s можна отримати з *класу*, вони корисні для налагодження, оскільки можуть надати корисну інформацію::

source: :mod:`ctypes` does not support passing unions or structures with bit-fields to functions by value. While this may work on 32-bit x86, it's not guaranteed by the library to work in the general case. Unions and structures with bit-fields should always be passed to functions by pointer.
uk: :mod:`ctypes` не підтримує передачу об’єднань або структур із бітовими полями функціям за значенням. Хоча це може працювати на 32-розрядних x86, бібліотека не гарантує роботу в загальному випадку. Об’єднання та структури з бітовими полями слід завжди передавати функціям за вказівником.

source: Structure/union alignment and byte order
uk: Вирівнювання структури/об'єднання та порядок байтів

source: By default, Structure and Union fields are aligned in the same way the C compiler does it. It is possible to override this behavior by specifying a :attr:`_pack_` class attribute in the subclass definition. This must be set to a positive integer and specifies the maximum alignment for the fields. This is what ``#pragma pack(n)`` also does in MSVC.
uk: За замовчуванням поля Structure і Union вирівнюються так само, як це робить компілятор C. Цю поведінку можна перевизначити, вказавши атрибут класу :attr:`_pack_` у визначенні підкласу. Для цього має бути встановлено додатне ціле число та вказано максимальне вирівнювання для полів. Це те, що ``#pragma pack(n)`` також робить у MSVC.

source: :mod:`ctypes` uses the native byte order for Structures and Unions. To build structures with non-native byte order, you can use one of the :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion`, and :class:`LittleEndianUnion` base classes. These classes cannot contain pointer fields.
uk: :mod:`ctypes` використовує власний порядок байтів для структур і об’єднань. Щоб створити структури з невласним порядком байтів, ви можете використовувати один із базових класів :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion` і :class:`LittleEndianUnion`. Ці класи не можуть містити поля вказівників.

source: Bit fields in structures and unions
uk: Бітові поля в структурах і об'єднаннях

source: It is possible to create structures and unions containing bit fields. Bit fields are only possible for integer fields, the bit width is specified as the third item in the :attr:`_fields_` tuples::
uk: Можна створювати структури та об'єднання, що містять бітові поля. Бітові поля можливі лише для цілочисельних полів, бітова ширина вказується як третій елемент у кортежах :attr:`_fields_`::

source: Arrays
uk: Масиви

source: Arrays are sequences, containing a fixed number of instances of the same type.
uk: Масиви - це послідовності, що містять фіксовану кількість екземплярів одного типу.

source: The recommended way to create array types is by multiplying a data type with a positive integer::
uk: Рекомендований спосіб створення типів масивів – це множення типу даних на додатне ціле:

source: Here is an example of a somewhat artificial data type, a structure containing 4 POINTs among other stuff::
uk: Ось приклад дещо штучного типу даних, структура, яка містить 4 ТОЧКИ серед іншого:

source: Instances are created in the usual way, by calling the class::
uk: Екземпляри створюються звичайним способом за допомогою виклику класу::

source: The above code print a series of ``0 0`` lines, because the array contents is initialized to zeros.
uk: Наведений вище код друкує серію рядків ``0 0``, оскільки вміст масиву ініціалізовано нулями.

source: Initializers of the correct type can also be specified::
uk: Також можна вказати ініціалізатори правильного типу:

source: Pointers
uk: Покажчики

source: Pointer instances are created by calling the :func:`pointer` function on a :mod:`ctypes` type::
uk: Екземпляри вказівника створюються шляхом виклику функції :func:`pointer` для типу :mod:`ctypes`::

source: Pointer instances have a :attr:`~_Pointer.contents` attribute which returns the object to which the pointer points, the ``i`` object above::
uk: Екземпляри вказівника мають атрибут :attr:`~_Pointer.contents`, який повертає об’єкт, на який вказує вказівник, об’єкт ``i`` вище::

source: Note that :mod:`ctypes` does not have OOR (original object return), it constructs a new, equivalent object each time you retrieve an attribute::
uk: Зауважте, що :mod:`ctypes` не має OOR (повернення вихідного об’єкта), він створює новий, еквівалентний об’єкт кожного разу, коли ви отримуєте атрибут::

source: Assigning another :class:`c_int` instance to the pointer's contents attribute would cause the pointer to point to the memory location where this is stored::
uk: Призначення іншого екземпляра :class:`c_int` атрибуту contents вказівника призведе до того, що вказівник вказуватиме на місце пам’яті, де це зберігається::

source: Pointer instances can also be indexed with integers::
uk: Екземпляри вказівників також можна індексувати цілими числами::

source: Assigning to an integer index changes the pointed to value::
uk: Присвоєння цілочисельному індексу змінює вказане значення::

source: It is also possible to use indexes different from 0, but you must know what you're doing, just as in C: You can access or change arbitrary memory locations. Generally you only use this feature if you receive a pointer from a C function, and you *know* that the pointer actually points to an array instead of a single item.
uk: Також можна використовувати індекси, відмінні від 0, але ви повинні знати, що ви робите, так само як у C: ви можете отримати доступ або змінити довільні місця пам'яті. Зазвичай ви використовуєте цю функцію, лише якщо отримуєте вказівник від функції C і *знаєте*, що вказівник насправді вказує на масив, а не на один елемент.

source: Behind the scenes, the :func:`pointer` function does more than simply create pointer instances, it has to create pointer *types* first. This is done with the :func:`POINTER` function, which accepts any :mod:`ctypes` type, and returns a new type::
uk: За лаштунками функція :func:`pointer` робить більше, ніж просто створює екземпляри вказівників, вона повинна спочатку створити *типи* вказівників. Це робиться за допомогою функції :func:`POINTER`, яка приймає будь-який тип :mod:`ctypes` і повертає новий тип::

source: Calling the pointer type without an argument creates a ``NULL`` pointer. ``NULL`` pointers have a ``False`` boolean value::
uk: Виклик типу покажчика без аргументу створює покажчик ``NULL``. Покажчики ``NULL`` мають логічне значення ``False``::

source: :mod:`ctypes` checks for ``NULL`` when dereferencing pointers (but dereferencing invalid non-\ ``NULL`` pointers would crash Python)::
uk: :mod:`ctypes` перевіряє ``NULL`` під час розіменування вказівників (але розіменування недійсних не\ ``NULL`` вказівників призведе до збою Python)::

source: Type conversions
uk: Перетворення типів

source: Usually, ctypes does strict type checking. This means, if you have ``POINTER(c_int)`` in the :attr:`argtypes` list of a function or as the type of a member field in a structure definition, only instances of exactly the same type are accepted. There are some exceptions to this rule, where ctypes accepts other objects. For example, you can pass compatible array instances instead of pointer types. So, for ``POINTER(c_int)``, ctypes accepts an array of c_int::
uk: Зазвичай ctypes виконує сувору перевірку типів. Це означає, що якщо у вас є ``POINTER(c_int)`` у списку :attr:`argtypes` функції або як тип поля-члена у визначенні структури, приймаються лише екземпляри точно такого ж типу. З цього правила є деякі винятки, коли ctypes приймає інші об’єкти. Наприклад, ви можете передати сумісні екземпляри масиву замість типів покажчиків. Отже, для ``POINTER(c_int)`` ctypes приймає масив c_int::

source: In addition, if a function argument is explicitly declared to be a pointer type (such as ``POINTER(c_int)``) in :attr:`argtypes`, an object of the pointed type (``c_int`` in this case) can be passed to the function. ctypes will apply the required :func:`byref` conversion in this case automatically.
uk: Крім того, якщо аргумент функції явно оголошено як тип вказівника (наприклад, ``POINTER(c_int)``) у :attr:`argtypes`, об’єкт вказівного типу (``c_int`` у цьому випадку ) можна передати у функцію. У цьому випадку ctypes автоматично застосує необхідне перетворення :func:`byref`.

source: To set a POINTER type field to ``NULL``, you can assign ``None``::
uk: Щоб встановити для поля типу POINTER значення ``NULL``, ви можете призначити ``None``::

source: Sometimes you have instances of incompatible types. In C, you can cast one type into another type. :mod:`ctypes` provides a :func:`cast` function which can be used in the same way. The ``Bar`` structure defined above accepts ``POINTER(c_int)`` pointers or :class:`c_int` arrays for its ``values`` field, but not instances of other types::
uk: Іноді у вас є екземпляри несумісних типів. У C ви можете привести один тип до іншого. :mod:`ctypes` надає функцію :func:`cast`, яку можна використовувати таким же чином. Структура ``Bar``, визначена вище, приймає покажчики ``POINTER(c_int)`` або :class:`c_int` масиви для свого поля ``values``, але не примірники інших типів::

source: For these cases, the :func:`cast` function is handy.
uk: Для цих випадків зручна функція :func:`cast`.

source: The :func:`cast` function can be used to cast a ctypes instance into a pointer to a different ctypes data type. :func:`cast` takes two parameters, a ctypes object that is or can be converted to a pointer of some kind, and a ctypes pointer type. It returns an instance of the second argument, which references the same memory block as the first argument::
uk: Функцію :func:`cast` можна використати для приведення екземпляра ctypes до покажчика на інший тип даних ctypes. :func:`cast` приймає два параметри: об’єкт ctypes, який є чи може бути перетворений на певний вказівник, і тип вказівника ctypes. Він повертає екземпляр другого аргументу, який посилається на той самий блок пам’яті, що й перший аргумент::

source: So, :func:`cast` can be used to assign to the ``values`` field of ``Bar`` the structure::
uk: Отже, :func:`cast` можна використовувати для призначення полю ``values`` ``Bar`` структури::

source: Incomplete Types
uk: Неповні типи

source: *Incomplete Types* are structures, unions or arrays whose members are not yet specified. In C, they are specified by forward declarations, which are defined later::
uk: *Неповні типи* — це структури, об’єднання або масиви, члени яких ще не визначено. У C вони визначені прямими оголошеннями, які визначені пізніше:

source: The straightforward translation into ctypes code would be this, but it does not work::
uk: Прямий переклад у код ctypes буде таким, але він не працює:

source: because the new ``class cell`` is not available in the class statement itself. In :mod:`ctypes`, we can define the ``cell`` class and set the :attr:`_fields_` attribute later, after the class statement::
uk: оскільки нова ``комірка класу`` недоступна в самому операторі класу. У :mod:`ctypes` ми можемо визначити клас ``cell`` і встановити атрибут :attr:`_fields_` пізніше, після оператора class::

source: Let's try it. We create two instances of ``cell``, and let them point to each other, and finally follow the pointer chain a few times::
uk: Давайте спробуємо. Ми створюємо два екземпляри ``cell`` і дозволяємо їм вказувати один на одного, і, нарешті, слідуємо за ланцюжком вказівників кілька разів::

source: Callback functions
uk: Функції зворотного виклику

source: :mod:`ctypes` allows creating C callable function pointers from Python callables. These are sometimes called *callback functions*.
uk: :mod:`ctypes` дозволяє створювати вказівники на функції C із викликів Python. Іноді їх називають *функціями зворотного виклику*.

source: First, you must create a class for the callback function. The class knows the calling convention, the return type, and the number and types of arguments this function will receive.
uk: По-перше, ви повинні створити клас для функції зворотного виклику. Клас знає угоду про виклики, тип повернення, а також кількість і типи аргументів, які ця функція отримає.

source: The :func:`CFUNCTYPE` factory function creates types for callback functions using the ``cdecl`` calling convention. On Windows, the :func:`WINFUNCTYPE` factory function creates types for callback functions using the ``stdcall`` calling convention.
uk: Фабрична функція :func:`CFUNCTYPE` створює типи для функцій зворотного виклику за допомогою угоди про виклики ``cdecl``. У Windows фабрична функція :func:`WINFUNCTYPE` створює типи для функцій зворотного виклику за допомогою угоди про виклики ``stdcall``.

source: Both of these factory functions are called with the result type as first argument, and the callback functions expected argument types as the remaining arguments.
uk: Обидві ці фабричні функції викликаються з типом результату як першим аргументом, а функції зворотного виклику – очікуваними типами аргументів як рештою аргументів.

source: I will present an example here which uses the standard C library's :c:func:`qsort` function, that is used to sort items with the help of a callback function. :c:func:`qsort` will be used to sort an array of integers::
uk: Я наведу тут приклад, який використовує функцію :c:func:`qsort` стандартної бібліотеки C, яка використовується для сортування елементів за допомогою функції зворотного виклику. :c:func:`qsort` використовуватиметься для сортування масиву цілих чисел::

source: :func:`qsort` must be called with a pointer to the data to sort, the number of items in the data array, the size of one item, and a pointer to the comparison function, the callback. The callback will then be called with two pointers to items, and it must return a negative integer if the first item is smaller than the second, a zero if they are equal, and a positive integer otherwise.
uk: :func:`qsort` потрібно викликати з вказівником на дані для сортування, кількістю елементів у масиві даних, розміром одного елемента та вказівником на функцію порівняння, зворотний виклик. Зворотний виклик буде викликано з двома покажчиками на елементи, і він повинен повернути від’ємне ціле число, якщо перший елемент менший за другий, нуль, якщо вони рівні, і додатне ціле число в іншому випадку.

source: So our callback function receives pointers to integers, and must return an integer. First we create the ``type`` for the callback function::
uk: Таким чином, наша функція зворотного виклику отримує покажчики на цілі числа та повинна повертати ціле число. Спочатку ми створюємо ``type`` для функції зворотного виклику::

source: To get started, here is a simple callback that shows the values it gets passed::
uk: Щоб почати, ось простий зворотний виклик, який показує значення, які він отримує:

source: The result::
uk: Результат::

source: Now we can actually compare the two items and return a useful result::
uk: Тепер ми фактично можемо порівняти два елементи та повернути корисний результат:

source: As we can easily check, our array is sorted now::
uk: Як ми можемо легко перевірити, наш масив зараз відсортовано::

source: The function factories can be used as decorator factories, so we may as well write::
uk: Фабрики функцій можна використовувати як фабрики декораторів, тому ми також можемо написати::

source: Make sure you keep references to :func:`CFUNCTYPE` objects as long as they are used from C code. :mod:`ctypes` doesn't, and if you don't, they may be garbage collected, crashing your program when a callback is made.
uk: Переконайтеся, що ви зберігаєте посилання на об’єкти :func:`CFUNCTYPE`, доки вони використовуються з коду C. :mod:`ctypes` не працює, і якщо ви цього не зробите, вони можуть збиратися як сміття, що призведе до збою вашої програми під час зворотного виклику.

source: Also, note that if the callback function is called in a thread created outside of Python's control (e.g. by the foreign code that calls the callback), ctypes creates a new dummy Python thread on every invocation. This behavior is correct for most purposes, but it means that values stored with :class:`threading.local` will *not* survive across different callbacks, even when those calls are made from the same C thread.
uk: Також зауважте, що якщо функція зворотнього виклику викликається в потоці, створеному поза контролем Python (наприклад, зовнішнім кодом, який викликає зворотній виклик), ctypes створює новий фіктивний потік Python під час кожного виклику. Така поведінка є правильною для більшості цілей, але це означає, що значення, збережені в :class:`threading.local` *не* збережуться в різних зворотних викликах, навіть якщо ці виклики здійснюються з того самого потоку C.

source: Accessing values exported from dlls
uk: Доступ до значень, експортованих із dll

source: Some shared libraries not only export functions, they also export variables. An example in the Python library itself is the :c:data:`Py_OptimizeFlag`, an integer set to 0, 1, or 2, depending on the :option:`-O` or :option:`-OO` flag given on startup.
uk: Деякі спільні бібліотеки експортують не лише функції, але й змінні. Прикладом у самій бібліотеці Python є :c:data:`Py_OptimizeFlag`, ціле число зі значенням 0, 1 або 2, залежно від прапора :option:`-O` або :option:`-OO`, заданого на стартап.

source: :mod:`ctypes` can access values like this with the :meth:`in_dll` class methods of the type. *pythonapi* is a predefined symbol giving access to the Python C api::
uk: :mod:`ctypes` може отримати доступ до таких значень за допомогою методів класу :meth:`in_dll` типу. *pythonapi* — це попередньо визначений символ, який надає доступ до Python C api::

source: If the interpreter would have been started with :option:`-O`, the sample would have printed ``c_long(1)``, or ``c_long(2)`` if :option:`-OO` would have been specified.
uk: Якби інтерпретатор був запущений з :option:`-O`, зразок надрукував би ``c_long(1)`` або ``c_long(2)``, якщо :option:`-OO` було б зазначено.

source: An extended example which also demonstrates the use of pointers accesses the :c:data:`PyImport_FrozenModules` pointer exported by Python.
uk: Розширений приклад, який також демонструє використання покажчиків, звертається до покажчика :c:data:`PyImport_FrozenModules`, експортованого Python.

source: Quoting the docs for that value:
uk: Цитування документів для цього значення:

source: This pointer is initialized to point to an array of :c:type:`struct _frozen` records, terminated by one whose members are all ``NULL`` or zero. When a frozen module is imported, it is searched in this table. Third-party code could play tricks with this to provide a dynamically created collection of frozen modules.
uk: Цей вказівник ініціалізується, щоб вказувати на масив записів :c:type:`struct _frozen`, завершуючи один, члени якого мають значення ``NULL`` або нуль. Коли імпортується заморожений модуль, його шукають у цій таблиці. Сторонній код міг би обдурити це, щоб забезпечити динамічно створювану колекцію заморожених модулів.

source: So manipulating this pointer could even prove useful. To restrict the example size, we show only how this table can be read with :mod:`ctypes`::
uk: Тож маніпулювання цим покажчиком може навіть виявитися корисним. Щоб обмежити розмір прикладу, ми показуємо лише те, як цю таблицю можна прочитати за допомогою :mod:`ctypes`::

source: We have defined the :c:type:`struct _frozen` data type, so we can get the pointer to the table::
uk: Ми визначили тип даних :c:type:`struct _frozen`, тому ми можемо отримати вказівник на таблицю::

source: Since ``table`` is a ``pointer`` to the array of ``struct_frozen`` records, we can iterate over it, but we just have to make sure that our loop terminates, because pointers have no size. Sooner or later it would probably crash with an access violation or whatever, so it's better to break out of the loop when we hit the ``NULL`` entry::
uk: Оскільки ``table`` є ``покажчиком`` на масив ``struct_frozen`` записів, ми можемо перебирати його, але нам просто потрібно переконатися, що наш цикл завершується, оскільки покажчики не мають розміру. Рано чи пізно він, ймовірно, вийде з ладу через порушення прав доступу чи щось інше, тому краще вийти з циклу, коли ми натиснемо запис ``NULL``::

source: The fact that standard Python has a frozen module and a frozen package (indicated by the negative ``size`` member) is not well known, it is only used for testing. Try it out with ``import __hello__`` for example.
uk: Той факт, що стандартний Python має заморожений модуль і заморожений пакет (позначений від’ємним елементом ``size``), невідомий, він використовується лише для тестування. Спробуйте, наприклад, ``import __hello__``.

source: Surprises
uk: Сюрпризи

source: There are some edges in :mod:`ctypes` where you might expect something other than what actually happens.
uk: У :mod:`ctypes` є деякі переваги, де ви можете очікувати щось інше, ніж те, що відбувається насправді.

source: Consider the following example::
uk: Розглянемо такий приклад:

source: Hm. We certainly expected the last statement to print ``3 4 1 2``. What happened? Here are the steps of the ``rc.a, rc.b = rc.b, rc.a`` line above::
uk: Хм Ми, безумовно, очікували, що останній оператор виведе ``3 4 1 2``. Що трапилось? Ось кроки рядка ``rc.a, rc.b = rc.b, rc.a``:

source: Note that ``temp0`` and ``temp1`` are objects still using the internal buffer of the ``rc`` object above. So executing ``rc.a = temp0`` copies the buffer contents of ``temp0`` into ``rc`` 's buffer. This, in turn, changes the contents of ``temp1``. So, the last assignment ``rc.b = temp1``, doesn't have the expected effect.
uk: Зауважте, що ``temp0`` і ``temp1`` є об’єктами, які все ще використовують внутрішній буфер об’єкта ``rc`` вище. Отже, виконання ``rc.a = temp0`` копіює вміст буфера ``temp0`` у буфер ``rc``. Це, у свою чергу, змінює вміст ``temp1``. Отже, останнє призначення ``rc.b = temp1`` не має очікуваного ефекту.

source: Keep in mind that retrieving sub-objects from Structure, Unions, and Arrays doesn't *copy* the sub-object, instead it retrieves a wrapper object accessing the root-object's underlying buffer.
uk: Майте на увазі, що отримання підоб’єктів зі структур, об’єднань і масивів не *копіює* підоб’єкт, натомість отримує обгортку об’єкта, який отримує доступ до основного буфера кореневого об’єкта.

source: Another example that may behave differently from what one would expect is this::
uk: Інший приклад, який може поводитися інакше, ніж очікувалося, це:

source: Objects instantiated from :class:`c_char_p` can only have their value set to bytes or integers.
uk: Об’єкти, створені з :class:`c_char_p`, можуть мати значення лише байтів або цілих чисел.
