Repository: python/python-docs-uk
Catalog: library/ctypes.po
Languages: uk

source: It is possible to assign a callable Python object that is not a ctypes type, in this case the function is assumed to return a C :c:type:`int`, and the callable will be called with this integer, allowing further processing or error checking. Using this is deprecated, for more flexible post processing or error checking use a ctypes data type as :attr:`restype` and assign a callable to the :attr:`errcheck` attribute.
uk: Можна призначити викликаний об’єкт Python, який не є типом ctypes, у цьому випадку припускається, що функція повертає C :c:type:`int`, і виклик буде викликаний із цим цілим числом, дозволяючи подальшу обробку або перевірка помилок. Використання цього є застарілим, для більш гнучкої постобробки або перевірки помилок використовуйте тип даних ctypes як :attr:`restype` і призначте виклик атрибуту :attr:`errcheck`.

source: Assign a tuple of ctypes types to specify the argument types that the function accepts. Functions using the ``stdcall`` calling convention can only be called with the same number of arguments as the length of this tuple; functions using the C calling convention accept additional, unspecified arguments as well.
uk: Призначте кортеж типів ctypes, щоб указати типи аргументів, які приймає функція. Функції, які використовують угоду про виклики ``stdcall``, можуть бути викликані лише з тією ж кількістю аргументів, що й довжина цього кортежу; функції, що використовують угоду про виклики C, також приймають додаткові, невизначені аргументи.

source: When a foreign function is called, each actual argument is passed to the :meth:`from_param` class method of the items in the :attr:`argtypes` tuple, this method allows adapting the actual argument to an object that the foreign function accepts. For example, a :class:`c_char_p` item in the :attr:`argtypes` tuple will convert a string passed as argument into a bytes object using ctypes conversion rules.
uk: Коли викликається стороння функція, кожен фактичний аргумент передається в метод класу :meth:`from_param` елементів у кортежі :attr:`argtypes`, цей метод дозволяє адаптувати фактичний аргумент до об’єкта, який приймає зовнішня функція . Наприклад, елемент :class:`c_char_p` у кортежі :attr:`argtypes` перетворить рядок, переданий як аргумент, на об’єкт bytes за допомогою правил перетворення ctypes.

source: New: It is now possible to put items in argtypes which are not ctypes types, but each item must have a :meth:`from_param` method which returns a value usable as argument (integer, string, ctypes instance). This allows defining adapters that can adapt custom objects as function parameters.
uk: Нове: тепер можна розміщувати елементи в argtypes, які не є типами ctypes, але кожен елемент повинен мати метод :meth:`from_param`, який повертає значення, яке можна використовувати як аргумент (ціле число, рядок, екземпляр ctypes). Це дозволяє визначати адаптери, які можуть адаптувати власні об’єкти як параметри функції.

source: Assign a Python function or another callable to this attribute. The callable will be called with three or more arguments:
uk: Призначте цьому атрибуту функцію Python або інший виклик. Викликається з трьома або більше аргументами:

source: *result* is what the foreign function returns, as specified by the :attr:`restype` attribute.
uk: *result* – це те, що повертає стороння функція, як зазначено в атрибуті :attr:`restype`.

source: *func* is the foreign function object itself, this allows reusing the same callable object to check or post process the results of several functions.
uk: *func* — це сам зовнішній об’єкт функції, це дозволяє повторно використовувати той самий об’єкт, що викликається, для перевірки або постобробки результатів кількох функцій.

source: *arguments* is a tuple containing the parameters originally passed to the function call, this allows specializing the behavior on the arguments used.
uk: *Аргументи* — це кортеж, що містить параметри, спочатку передані до виклику функції, що дозволяє спеціалізувати поведінку на використовуваних аргументах.

source: The object that this function returns will be returned from the foreign function call, but it can also check the result value and raise an exception if the foreign function call failed.
uk: Об’єкт, який повертає ця функція, буде повернено з виклику зовнішньої функції, але він також може перевірити значення результату та викликати виняток, якщо виклик зовнішньої функції не вдався.

source: This exception is raised when a foreign function call cannot convert one of the passed arguments.
uk: Цей виняток виникає, коли зовнішній виклик функції не може перетворити один із переданих аргументів.

source: On Windows, when a foreign function call raises a system exception (for example, due to an access violation), it will be captured and replaced with a suitable Python exception. Further, an auditing event ``ctypes.seh_exception`` with argument ``code`` will be raised, allowing an audit hook to replace the exception with its own.
uk: У Windows, коли зовнішній виклик функції викликає системний виняток (наприклад, через порушення доступу), він буде перехоплений і замінений відповідним винятком Python. Крім того, буде викликана подія аудиту ``ctypes.seh_exception`` з аргументом ``code``, що дозволить перевіряючому хуку замінити виняток власним.

source: Some ways to invoke foreign function calls may raise an auditing event ``ctypes.call_function`` with arguments ``function pointer`` and ``arguments``.
uk: Деякі способи виклику зовнішніх викликів функцій можуть викликати подію аудиту ``ctypes.call_function`` з аргументами ``вказівник функції`` і ``аргументи``.

source: Function prototypes
uk: Прототипи функцій

source: Foreign functions can also be created by instantiating function prototypes. Function prototypes are similar to function prototypes in C; they describe a function (return type, argument types, calling convention) without defining an implementation. The factory functions must be called with the desired result type and the argument types of the function, and can be used as decorator factories, and as such, be applied to functions through the ``@wrapper`` syntax. See :ref:`ctypes-callback-functions` for examples.
uk: Сторонні функції також можуть бути створені шляхом інстанціювання прототипів функцій. Прототипи функцій подібні до прототипів функцій у C; вони описують функцію (тип повернення, типи аргументів, угоду про виклики) без визначення реалізації. Фабричні функції мають викликатися з потрібним типом результату та типами аргументів функції, і їх можна використовувати як фабрики декораторів, і як такі застосовувати до функцій за допомогою синтаксису ``@wrapper``. Перегляньте :ref:`ctypes-callback-functions` для прикладів.

source: The returned function prototype creates functions that use the standard C calling convention. The function will release the GIL during the call. If *use_errno* is set to true, the ctypes private copy of the system :data:`errno` variable is exchanged with the real :data:`errno` value before and after the call; *use_last_error* does the same for the Windows error code.
uk: Повернений прототип функції створює функції, які використовують стандартну угоду про виклик C. Функція звільнить GIL під час виклику. Якщо *use_errno* має значення true, приватна копія ctypes системної змінної :data:`errno` обмінюється справжнім значенням :data:`errno` до і після виклику; *use_last_error* робить те саме для коду помилки Windows.

source: Windows only: The returned function prototype creates functions that use the ``stdcall`` calling convention. The function will release the GIL during the call. *use_errno* and *use_last_error* have the same meaning as above.
uk: Лише для Windows: повернутий прототип функції створює функції, які використовують угоду про виклики ``stdcall``. Функція звільнить GIL під час виклику. *use_errno* і *use_last_error* мають те саме значення, що й вище.

source: The returned function prototype creates functions that use the Python calling convention. The function will *not* release the GIL during the call.
uk: Повернений прототип функції створює функції, які використовують угоду про виклики Python. Функція *не* звільняє GIL під час виклику.

source: Function prototypes created by these factory functions can be instantiated in different ways, depending on the type and number of the parameters in the call:
uk: Прототипи функцій, створені цими фабричними функціями, можуть бути створені різними способами, залежно від типу та кількості параметрів у виклику:

source: Returns a foreign function at the specified address which must be an integer.
uk: Повертає зовнішню функцію за вказаною адресою, яка має бути цілим числом.

source: Create a C callable function (a callback function) from a Python *callable*.
uk: Створіть функцію виклику C (функцію зворотного виклику) з Python *callable*.

source: Returns a foreign function exported by a shared library. *func_spec* must be a 2-tuple ``(name_or_ordinal, library)``. The first item is the name of the exported function as string, or the ordinal of the exported function as small integer. The second item is the shared library instance.
uk: Повертає зовнішню функцію, експортовану спільною бібліотекою. *func_spec* має бути 2-кортежем ``(name_or_ordinal, library)``. Перший елемент — це ім’я експортованої функції у вигляді рядка або порядковий номер експортованої функції у вигляді малого цілого числа. Другий елемент — екземпляр спільної бібліотеки.

source: Returns a foreign function that will call a COM method. *vtbl_index* is the index into the virtual function table, a small non-negative integer. *name* is name of the COM method. *iid* is an optional pointer to the interface identifier which is used in extended error reporting.
uk: Повертає зовнішню функцію, яка викликає метод COM. *vtbl_index* — це індекс у таблиці віртуальних функцій, мале невід’ємне ціле число. *ім’я* — це ім’я методу COM. *iid* — це додатковий покажчик на ідентифікатор інтерфейсу, який використовується в розширеному звіті про помилки.

source: COM methods use a special calling convention: They require a pointer to the COM interface as first argument, in addition to those parameters that are specified in the :attr:`argtypes` tuple.
uk: Методи COM використовують спеціальну угоду про виклики: їм потрібен покажчик на інтерфейс COM як перший аргумент, на додаток до тих параметрів, які вказані в кортежі :attr:`argtypes`.

source: The optional *paramflags* parameter creates foreign function wrappers with much more functionality than the features described above.
uk: Необов’язковий параметр *paramflags* створює зовнішні обгортки функцій із набагато більшою функціональністю, ніж функції, описані вище.

source: *paramflags* must be a tuple of the same length as :attr:`argtypes`.
uk: *paramflags* має бути кортежем такої ж довжини, що й :attr:`argtypes`.

source: Each item in this tuple contains further information about a parameter, it must be a tuple containing one, two, or three items.
uk: Кожен елемент у цьому кортежі містить додаткову інформацію про параметр, це має бути кортеж, що містить один, два або три елементи.

source: The first item is an integer containing a combination of direction flags for the parameter:
uk: Перший елемент є цілим числом, що містить комбінацію прапорів напрямку для параметра:

source: Specifies an input parameter to the function.
uk: Визначає вхідний параметр для функції.

source: Output parameter. The foreign function fills in a value.
uk: Вихідний параметр. Стороння функція заповнює значення.

source: Input parameter which defaults to the integer zero.
uk: Вхідний параметр, який за умовчанням дорівнює нулю.

source: The optional second item is the parameter name as string. If this is specified, the foreign function can be called with named parameters.
uk: Другим необов’язковим елементом є назва параметра у вигляді рядка. Якщо це вказано, зовнішня функція може бути викликана з іменованими параметрами.

source: The optional third item is the default value for this parameter.
uk: Додатковий третій елемент є значенням за замовчуванням для цього параметра.

source: This example demonstrates how to wrap the Windows ``MessageBoxW`` function so that it supports default parameters and named arguments. The C declaration from the windows header file is this::
uk: У цьому прикладі показано, як обернути функцію Windows ``MessageBoxW``, щоб вона підтримувала параметри за замовчуванням та іменовані аргументи. Оголошення C із файлу заголовка Windows таке::

source: Here is the wrapping with :mod:`ctypes`::
uk: Ось обгортка за допомогою :mod:`ctypes`::

source: The ``MessageBox`` foreign function can now be called in these ways::
uk: Сторонню функцію ``MessageBox`` тепер можна викликати такими способами:

source: A second example demonstrates output parameters. The win32 ``GetWindowRect`` function retrieves the dimensions of a specified window by copying them into ``RECT`` structure that the caller has to supply. Here is the C declaration::
uk: Другий приклад демонструє вихідні параметри. Функція ``GetWindowRect`` win32 отримує розміри вказаного вікна шляхом копіювання їх у структуру ``RECT``, яку має надати абонент. Ось оголошення C::

source: Functions with output parameters will automatically return the output parameter value if there is a single one, or a tuple containing the output parameter values when there are more than one, so the GetWindowRect function now returns a RECT instance, when called.
uk: Функції з вихідними параметрами автоматично повертатимуть значення вихідного параметра, якщо є одне, або кортеж, що містить значення вихідних параметрів, якщо їх декілька, тому функція GetWindowRect тепер повертає екземпляр RECT під час виклику.

source: Output parameters can be combined with the :attr:`errcheck` protocol to do further output processing and error checking. The win32 ``GetWindowRect`` api function returns a ``BOOL`` to signal success or failure, so this function could do the error checking, and raises an exception when the api call failed::
uk: Параметри виводу можна поєднати з протоколом :attr:`errcheck` для подальшої обробки виводу та перевірки помилок. API-функція ``GetWindowRect`` win32 повертає ``BOOL``, щоб сигналізувати про успіх або невдачу, тому ця функція може виконувати перевірку помилок і створює виняток, коли виклик API не вдається:

source: If the :attr:`errcheck` function returns the argument tuple it receives unchanged, :mod:`ctypes` continues the normal processing it does on the output parameters. If you want to return a tuple of window coordinates instead of a ``RECT`` instance, you can retrieve the fields in the function and return them instead, the normal processing will no longer take place::
uk: Якщо функція :attr:`errcheck` повертає отриманий кортеж аргументів без змін, :mod:`ctypes` продовжує звичайну обробку вихідних параметрів. Якщо ви хочете повернути кортеж координат вікна замість екземпляра ``RECT``, ви можете отримати поля у функції та повернути їх натомість, звичайна обробка більше не відбуватиметься::

source: Utility functions
uk: Функції корисності

source: Returns the address of the memory buffer as integer. *obj* must be an instance of a ctypes type.
uk: Повертає адресу буфера пам'яті як ціле число. *obj* має бути екземпляром типу ctypes.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.addressof`` with argument ``obj``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.addressof`` з аргументом ``obj``.

source: Returns the alignment requirements of a ctypes type. *obj_or_type* must be a ctypes type or instance.
uk: Повертає вимоги до вирівнювання типу ctypes. *obj_or_type* має бути типом або екземпляром ctypes.

source: Returns a light-weight pointer to *obj*, which must be an instance of a ctypes type. *offset* defaults to zero, and must be an integer that will be added to the internal pointer value.
uk: Повертає легкий вказівник на *obj*, який має бути екземпляром типу ctypes. *offset* за замовчуванням дорівнює нулю і має бути цілим числом, яке буде додано до значення внутрішнього покажчика.

source: ``byref(obj, offset)`` corresponds to this C code::
uk: ``byref(obj, offset)`` відповідає цьому коду C::

source: The returned object can only be used as a foreign function call parameter. It behaves similar to ``pointer(obj)``, but the construction is a lot faster.
uk: Повернений об’єкт можна використовувати лише як параметр виклику зовнішньої функції. Він поводиться подібно до ``pointer(obj)``, але будівництво відбувається набагато швидше.

source: This function is similar to the cast operator in C. It returns a new instance of *type* which points to the same memory block as *obj*. *type* must be a pointer type, and *obj* must be an object that can be interpreted as a pointer.
uk: Ця функція схожа на оператор приведення в C. Вона повертає новий екземпляр *type*, який вказує на той самий блок пам’яті, що й *obj*. *type* має бути типом покажчика, а *obj* має бути об’єктом, який можна інтерпретувати як покажчик.

source: This function creates a mutable character buffer. The returned object is a ctypes array of :class:`c_char`.
uk: Ця функція створює змінний символьний буфер. Повернений об’єкт є масивом ctypes :class:`c_char`.

source: *init_or_size* must be an integer which specifies the size of the array, or a bytes object which will be used to initialize the array items.
uk: *init_or_size* має бути цілим числом, яке визначає розмір масиву, або об’єктом bytes, який використовуватиметься для ініціалізації елементів масиву.

source: If a bytes object is specified as first argument, the buffer is made one item larger than its length so that the last element in the array is a NUL termination character. An integer can be passed as second argument which allows specifying the size of the array if the length of the bytes should not be used.
uk: Якщо в якості першого аргументу вказано об’єкт bytes, буфер стає на один елемент більшим, ніж його довжина, так що останній елемент у масиві є завершальним символом NUL. Ціле число може бути передане як другий аргумент, що дозволяє вказати розмір масиву, якщо довжина байтів не повинна використовуватися.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.create_string_buffer`` with arguments ``init``, ``size``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.create_string_buffer`` з аргументами ``init``, ``size``.

source: This function creates a mutable unicode character buffer. The returned object is a ctypes array of :class:`c_wchar`.
uk: Ця функція створює змінний буфер символів Unicode. Повернений об’єкт є масивом ctypes :class:`c_wchar`.

source: *init_or_size* must be an integer which specifies the size of the array, or a string which will be used to initialize the array items.
uk: *init_or_size* має бути цілим числом, що вказує розмір масиву, або рядком, який використовуватиметься для ініціалізації елементів масиву.

source: If a string is specified as first argument, the buffer is made one item larger than the length of the string so that the last element in the array is a NUL termination character. An integer can be passed as second argument which allows specifying the size of the array if the length of the string should not be used.
uk: Якщо рядок вказано як перший аргумент, буфер робиться на один елемент більшим, ніж довжина рядка, так що останній елемент у масиві є завершальним символом NUL. Ціле число може бути передане як другий аргумент, що дозволяє вказати розмір масиву, якщо довжина рядка не повинна використовуватися.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.create_unicode_buffer`` with arguments ``init``, ``size``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.create_unicode_buffer`` з аргументами ``init``, ``size``.

source: Windows only: This function is a hook which allows implementing in-process COM servers with ctypes. It is called from the DllCanUnloadNow function that the _ctypes extension dll exports.
uk: Лише для Windows: ця функція є хуком, який дозволяє реалізувати COM-сервери в процесі за допомогою ctypes. Він викликається з функції DllCanUnloadNow, яку експортує dll розширення _ctypes.

source: Windows only: This function is a hook which allows implementing in-process COM servers with ctypes. It is called from the DllGetClassObject function that the ``_ctypes`` extension dll exports.
uk: Лише для Windows: ця функція є хуком, який дозволяє реалізувати COM-сервери в процесі за допомогою ctypes. Він викликається з функції DllGetClassObject, яку експортує dll розширення ``_ctypes``.

source: Try to find a library and return a pathname. *name* is the library name without any prefix like ``lib``, suffix like ``.so``, ``.dylib`` or version number (this is the form used for the posix linker option :option:`!-l`). If no library can be found, returns ``None``.
uk: Спробуйте знайти бібліотеку та повернути шлях. *ім’я* — це ім’я бібліотеки без будь-яких префіксів, як-от ``lib``, суфіксів, як-от ``.so``, ``.dylib`` або номера версії (це форма, яка використовується для параметра компонувальника posix :option:`!-l`). Якщо бібліотеки не знайдено, повертає ``None``.

source: Windows only: return the filename of the VC runtime library used by Python, and by the extension modules. If the name of the library cannot be determined, ``None`` is returned.
uk: Лише для Windows: повертає назву файлу бібліотеки середовища виконання VC, яка використовується Python, і модулями розширення. Якщо назва бібліотеки не може бути визначена, повертається ``None``.

source: If you need to free memory, for example, allocated by an extension module with a call to the ``free(void *)``, it is important that you use the function in the same library that allocated the memory.
uk: Якщо вам потрібно звільнити пам’ять, наприклад, виділену модулем розширення за допомогою виклику ``free(void *)``, важливо, щоб ви використовували функцію в тій самій бібліотеці, яка виділила пам’ять.

source: Windows only: Returns a textual description of the error code *code*. If no error code is specified, the last error code is used by calling the Windows api function GetLastError.
uk: Лише для Windows: повертає текстовий опис коду помилки *code*. Якщо код помилки не вказано, останній код помилки використовується під час виклику функції Windows API GetLastError.

source: Windows only: Returns the last error code set by Windows in the calling thread. This function calls the Windows `GetLastError()` function directly, it does not return the ctypes-private copy of the error code.
uk: Лише для Windows: повертає останній код помилки, встановлений Windows у потоці виклику. Ця функція безпосередньо викликає функцію GetLastError() Windows, вона не повертає приватну копію ctypes коду помилки.

source: Returns the current value of the ctypes-private copy of the system :data:`errno` variable in the calling thread.
uk: Повертає поточне значення ctypes-private копії системної змінної :data:`errno` у потоці виклику.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.get_errno`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.get_errno`` без аргументів.

source: Windows only: returns the current value of the ctypes-private copy of the system :data:`LastError` variable in the calling thread.
uk: Лише для Windows: повертає поточне значення ctypes-private копії системної змінної :data:`LastError` у потоці виклику.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.get_last_error`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.get_last_error`` без аргументів.
