Repository: python/python-docs-uk
Catalog: library/ctypes.po
Languages: uk

source: The :mod:`ctypes.wintypes` module provides quite some other Windows specific data types, for example :c:type:`HWND`, :c:type:`WPARAM`, or :c:type:`DWORD`. Some useful structures like :c:type:`MSG` or :c:type:`RECT` are also defined.
uk: Модуль :mod:`ctypes.wintypes` надає деякі інші специфічні типи даних Windows, наприклад :c:type:`HWND`, :c:type:`WPARAM` або :c:type:`DWORD`. Деякі корисні структури, такі як :c:type:`MSG` або :c:type:`RECT`, також визначені.

source: Structured data types
uk: Структуровані типи даних

source: Abstract base class for unions in native byte order.
uk: Абстрактний базовий клас для об’єднань у рідному порядку байтів.

source: Abstract base class for structures in *big endian* byte order.
uk: Абстрактний базовий клас для структур у *великому порядку байтів*.

source: Abstract base class for structures in *little endian* byte order.
uk: Абстрактний базовий клас для структур у порядку байтів *little endian*.

source: Abstract base class for structures in *native* byte order.
uk: Абстрактний базовий клас для структур у *власному* порядку байтів.

source: Concrete structure and union types must be created by subclassing one of these types, and at least define a :attr:`_fields_` class variable. :mod:`ctypes` will create :term:`descriptor`\s which allow reading and writing the fields by direct attribute accesses. These are the
uk: Конкретні типи структури та об’єднання мають бути створені шляхом створення підкласу одного з цих типів і принаймні визначення змінної класу :attr:`_fields_`. :mod:`ctypes` створить :term:`descriptor`\s, які дозволяють читати та записувати поля за допомогою прямого доступу до атрибутів. Це

source: A sequence defining the structure fields. The items must be 2-tuples or 3-tuples. The first item is the name of the field, the second item specifies the type of the field; it can be any ctypes data type.
uk: Послідовність, що визначає поля структури. Елементи мають бути 2-кортежними або 3-кортежними. Перший пункт – ім’я поля, другий – тип поля; це може бути будь-який тип даних ctypes.

source: For integer type fields like :class:`c_int`, a third optional item can be given. It must be a small positive integer defining the bit width of the field.
uk: Для полів цілого типу, таких як :class:`c_int`, можна вказати третій необов’язковий елемент. Це має бути маленьке позитивне ціле число, що визначає розрядність поля.

source: Field names must be unique within one structure or union. This is not checked, only one field can be accessed when names are repeated.
uk: Імена полів мають бути унікальними в межах однієї структури чи об’єднання. Це не позначено, лише одне поле доступне, якщо імена повторюються.

source: It is possible to define the :attr:`_fields_` class variable *after* the class statement that defines the Structure subclass, this allows creating data types that directly or indirectly reference themselves::
uk: Можна визначити змінну класу :attr:`_fields_` *після* оператора класу, який визначає підклас Structure, це дозволяє створювати типи даних, які прямо чи опосередковано посилаються на себе::

source: The :attr:`_fields_` class variable must, however, be defined before the type is first used (an instance is created, :func:`sizeof` is called on it, and so on). Later assignments to the :attr:`_fields_` class variable will raise an AttributeError.
uk: Однак змінну класу :attr:`_fields_` потрібно визначити перед першим використанням типу (створюється екземпляр, для нього викликається :func:`sizeof` і так далі). Пізніше призначення змінній класу :attr:`_fields_` призведе до помилки AttributeError.

source: It is possible to define sub-subclasses of structure types, they inherit the fields of the base class plus the :attr:`_fields_` defined in the sub-subclass, if any.
uk: Можна визначити під-підкласи структурних типів, вони успадковують поля базового класу плюс :attr:`_fields_`, визначені в під-підкласі, якщо такі є.

source: An optional small integer that allows overriding the alignment of structure fields in the instance. :attr:`_pack_` must already be defined when :attr:`_fields_` is assigned, otherwise it will have no effect.
uk: Необов’язкове мале ціле число, яке дозволяє змінити вирівнювання полів структури в екземплярі. :attr:`_pack_` має бути вже визначено, коли :attr:`_fields_` призначено, інакше це не матиме ефекту.

source: An optional sequence that lists the names of unnamed (anonymous) fields. :attr:`_anonymous_` must be already defined when :attr:`_fields_` is assigned, otherwise it will have no effect.
uk: Необов’язкова послідовність, яка містить імена безіменних (анонімних) полів. :attr:`_anonymous_` має бути вже визначено під час призначення :attr:`_fields_`, інакше це не матиме ефекту.

source: The fields listed in this variable must be structure or union type fields. :mod:`ctypes` will create descriptors in the structure type that allows accessing the nested fields directly, without the need to create the structure or union field.
uk: Поля, перелічені в цій змінній, мають бути структурними або об’єднаними. :mod:`ctypes` створить дескриптори у структурному типі, що дозволяє отримати доступ до вкладених полів безпосередньо, без необхідності створювати структуру чи поле об’єднання.

source: Here is an example type (Windows)::
uk: Ось приклад типу (Windows):

source: The ``TYPEDESC`` structure describes a COM data type, the ``vt`` field specifies which one of the union fields is valid. Since the ``u`` field is defined as anonymous field, it is now possible to access the members directly off the TYPEDESC instance. ``td.lptdesc`` and ``td.u.lptdesc`` are equivalent, but the former is faster since it does not need to create a temporary union instance::
uk: Структура ``TYPEDESC`` описує тип даних COM, поле ``vt`` визначає, яке з полів об’єднання є дійсним. Оскільки поле ``u`` визначено як анонімне поле, тепер можна отримати доступ до членів безпосередньо з примірника TYPEDESC. ``td.lptdesc`` і ``td.u.lptdesc`` еквівалентні, але перший швидший, оскільки йому не потрібно створювати тимчасовий екземпляр об’єднання::

source: It is possible to define sub-subclasses of structures, they inherit the fields of the base class. If the subclass definition has a separate :attr:`_fields_` variable, the fields specified in this are appended to the fields of the base class.
uk: Є можливість визначення суб-підкласів структур, вони успадковують поля базового класу. Якщо визначення підкласу має окрему змінну :attr:`_fields_`, поля, зазначені в ній, додаються до полів базового класу.

source: Structure and union constructors accept both positional and keyword arguments. Positional arguments are used to initialize member fields in the same order as they are appear in :attr:`_fields_`. Keyword arguments in the constructor are interpreted as attribute assignments, so they will initialize :attr:`_fields_` with the same name, or create new attributes for names not present in :attr:`_fields_`.
uk: Конструктори структури та об’єднання приймають як позиційні, так і ключові аргументи. Позиційні аргументи використовуються для ініціалізації полів-членів у такому самому порядку, як вони з’являються в :attr:`_fields_`. Аргументи ключових слів у конструкторі інтерпретуються як призначення атрибутів, тому вони ініціалізують :attr:`_fields_` з тим же іменем або створять нові атрибути для імен, яких немає в :attr:`_fields_`.

source: Arrays and pointers
uk: Масиви та покажчики

source: Abstract base class for arrays.
uk: Абстрактний базовий клас для масивів.

source: The recommended way to create concrete array types is by multiplying any :mod:`ctypes` data type with a non-negative integer. Alternatively, you can subclass this type and define :attr:`_length_` and :attr:`_type_` class variables. Array elements can be read and written using standard subscript and slice accesses; for slice reads, the resulting object is *not* itself an :class:`Array`.
uk: Рекомендований спосіб створення конкретних типів масивів — це множення будь-якого типу даних :mod:`ctypes` на невід’ємне ціле число. Крім того, ви можете створити підклас цього типу та визначити змінні класу :attr:`_length_` і :attr:`_type_`. Елементи масиву можна читати та записувати за допомогою стандартного підрядкового і зрізного доступу; для зчитування фрагментів результуючий об’єкт *не* сам є :class:`Array`.

source: A positive integer specifying the number of elements in the array. Out-of-range subscripts result in an :exc:`IndexError`. Will be returned by :func:`len`.
uk: Додатне ціле число, що визначає кількість елементів у масиві. Індекси поза діапазоном призводять до :exc:`IndexError`. Буде повернено :func:`len`.

source: Specifies the type of each element in the array.
uk: Визначає тип кожного елемента в масиві.

source: Array subclass constructors accept positional arguments, used to initialize the elements in order.
uk: Конструктори підкласу масиву приймають позиційні аргументи, які використовуються для ініціалізації елементів у порядку.

source: Private, abstract base class for pointers.
uk: Приватний, абстрактний базовий клас для вказівників.

source: Concrete pointer types are created by calling :func:`POINTER` with the type that will be pointed to; this is done automatically by :func:`pointer`.
uk: Конкретні типи вказівників створюються шляхом виклику :func:`POINTER` із типом, на який буде вказувати; це робиться автоматично за допомогою :func:`pointer`.

source: If a pointer points to an array, its elements can be read and written using standard subscript and slice accesses. Pointer objects have no size, so :func:`len` will raise :exc:`TypeError`. Negative subscripts will read from the memory *before* the pointer (as in C), and out-of-range subscripts will probably crash with an access violation (if you're lucky).
uk: Якщо вказівник вказує на масив, його елементи можна читати та записувати за допомогою стандартного підрядкового і зрізного доступу. Об’єкти-вказівники не мають розміру, тому :func:`len` викличе :exc:`TypeError`. Негативні індекси читатимуться з пам’яті *перед* вказівником (як у C), а індекси поза межами діапазону, ймовірно, впадуть із порушенням доступу (якщо вам пощастить).

source: Specifies the type pointed to.
uk: Визначає тип, на який вказується.

source: Returns the object to which to pointer points. Assigning to this attribute changes the pointer to point to the assigned object.
uk: Повертає об’єкт, на який вказує вказівник. Призначення цьому атрибуту змінює вказівник на призначений об’єкт.
