Repository: python/python-docs-uk
Catalog: library/ctypes.po
Languages: uk

source: Same as the standard C memmove library function: copies *count* bytes from *src* to *dst*. *dst* and *src* must be integers or ctypes instances that can be converted to pointers.
uk: Те саме, що стандартна функція бібліотеки C memmove: копіює *count* байти з *src* до *dst*. *dst* і *src* мають бути цілими числами або екземплярами ctypes, які можна перетворити на покажчики.

source: Same as the standard C memset library function: fills the memory block at address *dst* with *count* bytes of value *c*. *dst* must be an integer specifying an address, or a ctypes instance.
uk: Те саме, що стандартна функція бібліотеки memset C: заповнює блок пам’яті за адресою *dst* *count* байтами зі значенням *c*. *dst* має бути цілим числом, що визначає адресу, або екземпляр ctypes.

source: This factory function creates and returns a new ctypes pointer type. Pointer types are cached and reused internally, so calling this function repeatedly is cheap. *type* must be a ctypes type.
uk: Ця фабрична функція створює та повертає новий тип покажчика ctypes. Типи вказівників кешуються та повторно використовуються внутрішньо, тому повторний виклик цієї функції є дешевим. *type* має бути типом ctypes.

source: This function creates a new pointer instance, pointing to *obj*. The returned object is of the type ``POINTER(type(obj))``.
uk: Ця функція створює новий екземпляр покажчика, що вказує на *obj*. Повернений об’єкт має тип ``POINTER(type(obj))``.

source: Note: If you just want to pass a pointer to an object to a foreign function call, you should use ``byref(obj)`` which is much faster.
uk: Примітка. Якщо ви просто хочете передати вказівник на об’єкт у зовнішній виклик функції, вам слід використовувати ``byref(obj)``, що набагато швидше.

source: This function resizes the internal memory buffer of *obj*, which must be an instance of a ctypes type. It is not possible to make the buffer smaller than the native size of the objects type, as given by ``sizeof(type(obj))``, but it is possible to enlarge the buffer.
uk: Ця функція змінює розмір буфера внутрішньої пам’яті *obj*, який має бути екземпляром типу ctypes. Неможливо зробити буфер меншим, ніж власний розмір типу об’єктів, як задано ``sizeof(type(obj))``, але можна збільшити буфер.

source: Set the current value of the ctypes-private copy of the system :data:`errno` variable in the calling thread to *value* and return the previous value.
uk: Установіть поточне значення ctypes-private копії системної змінної :data:`errno` у викликаючому потоці на *value* і поверніть попереднє значення.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.set_errno`` with argument ``errno``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.set_errno`` з аргументом ``errno``.

source: Windows only: set the current value of the ctypes-private copy of the system :data:`LastError` variable in the calling thread to *value* and return the previous value.
uk: Лише для Windows: установіть поточне значення ctypes-private копії системної змінної :data:`LastError` у викликаючому потоці на *value* і поверніть попереднє значення.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.set_last_error`` with argument ``error``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.set_last_error`` з аргументом ``помилка``.

source: Returns the size in bytes of a ctypes type or instance memory buffer. Does the same as the C ``sizeof`` operator.
uk: Повертає розмір у байтах типу ctypes або буфера пам’яті примірника. Діє так само, як і оператор C ``sizeof``.

source: This function returns the C string starting at memory address *address* as a bytes object. If size is specified, it is used as size, otherwise the string is assumed to be zero-terminated.
uk: Ця функція повертає рядок C, починаючи з адреси пам’яті *address*, як об’єкт bytes. Якщо вказано розмір, він використовується як розмір, інакше рядок вважається закінченим нулем.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.string_at`` with arguments ``address``, ``size``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.string_at`` з аргументами ``address``, ``size``.

source: Windows only: this function is probably the worst-named thing in ctypes. It creates an instance of OSError. If *code* is not specified, ``GetLastError`` is called to determine the error code. If *descr* is not specified, :func:`FormatError` is called to get a textual description of the error.
uk: Лише для Windows: ця функція є, мабуть, найгіршою назвою в ctypes. Він створює екземпляр OSError. Якщо *код* не вказано, для визначення коду помилки викликається GetLastError. Якщо *descr* не вказано, :func:`FormatError` викликається для отримання текстового опису помилки.

source: An instance of :exc:`WindowsError` used to be created.
uk: Раніше створювався екземпляр :exc:`WindowsError`.

source: This function returns the wide character string starting at memory address *address* as a string. If *size* is specified, it is used as the number of characters of the string, otherwise the string is assumed to be zero-terminated.
uk: Ця функція повертає широкий рядок символів, починаючи з адреси пам’яті *address*, як рядок. Якщо вказано *size*, він використовується як кількість символів у рядку, інакше рядок вважається закінченим нулем.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.wstring_at`` with arguments ``address``, ``size``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.wstring_at`` з аргументами ``адреса``, ``розмір``.

source: Data types
uk: Типи даних

source: This non-public class is the common base class of all ctypes data types. Among other things, all ctypes type instances contain a memory block that hold C compatible data; the address of the memory block is returned by the :func:`addressof` helper function. Another instance variable is exposed as :attr:`_objects`; this contains other Python objects that need to be kept alive in case the memory block contains pointers.
uk: Цей непублічний клас є загальним базовим класом для всіх типів даних ctypes. Серед іншого, усі екземпляри типу ctypes містять блок пам’яті, який містить C-сумісні дані; адреса блоку пам'яті повертається допоміжною функцією :func:`addressof`. Інша змінна екземпляра представлена як :attr:`_objects`; це містить інші об’єкти Python, які потрібно підтримувати в активному стані, якщо блок пам’яті містить покажчики.

source: Common methods of ctypes data types, these are all class methods (to be exact, they are methods of the :term:`metaclass`):
uk: Загальні методи типів даних ctypes, це всі методи класу (точніше, це методи :term:`metaclass`):

source: This method returns a ctypes instance that shares the buffer of the *source* object. The *source* object must support the writeable buffer interface. The optional *offset* parameter specifies an offset into the source buffer in bytes; the default is zero. If the source buffer is not large enough a :exc:`ValueError` is raised.
uk: Цей метод повертає екземпляр ctypes, який спільно використовує буфер об’єкта *source*. Об'єкт *джерело* має підтримувати інтерфейс буфера з можливістю запису. Необов'язковий параметр *offset* визначає зсув у вихідному буфері в байтах; за замовчуванням дорівнює нулю. Якщо вихідний буфер недостатньо великий, виникає :exc:`ValueError`.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.cdata/buffer`` with arguments ``pointer``, ``size``, ``offset``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.cdata/buffer`` з аргументами ``pointer``, ``size``, ``offset``.

source: This method creates a ctypes instance, copying the buffer from the *source* object buffer which must be readable. The optional *offset* parameter specifies an offset into the source buffer in bytes; the default is zero. If the source buffer is not large enough a :exc:`ValueError` is raised.
uk: Цей метод створює екземпляр ctypes, копіюючи буфер із буфера *джерельного* об’єкта, який має бути читабельним. Необов'язковий параметр *offset* визначає зсув у вихідному буфері в байтах; за замовчуванням дорівнює нулю. Якщо вихідний буфер недостатньо великий, виникає :exc:`ValueError`.

source: This method returns a ctypes type instance using the memory specified by *address* which must be an integer.
uk: Цей метод повертає екземпляр типу ctypes, використовуючи пам’ять, визначену *адресою*, яка має бути цілим числом.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.cdata`` with argument ``address``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.cdata`` з аргументом ``адреса``.

source: This method, and others that indirectly call this method, raises an :ref:`auditing event <auditing>` ``ctypes.cdata`` with argument ``address``.
uk: Цей метод та інші, які опосередковано викликають цей метод, викликають :ref:`подію аудиту <auditing>` ``ctypes.cdata`` з аргументом ``адреса``.

source: This method adapts *obj* to a ctypes type. It is called with the actual object used in a foreign function call when the type is present in the foreign function's :attr:`argtypes` tuple; it must return an object that can be used as a function call parameter.
uk: Цей метод адаптує *obj* до типу ctypes. Він викликається з фактичним об’єктом, який використовується у виклику зовнішньої функції, коли тип присутній у кортежі :attr:`argtypes` зовнішньої функції; він повинен повертати об'єкт, який можна використовувати як параметр виклику функції.

source: All ctypes data types have a default implementation of this classmethod that normally returns *obj* if that is an instance of the type. Some types accept other objects as well.
uk: Усі типи даних ctypes мають стандартну реалізацію цього методу класу, який зазвичай повертає *obj*, якщо це екземпляр типу. Деякі типи також приймають інші об’єкти.

source: This method returns a ctypes type instance exported by a shared library. *name* is the name of the symbol that exports the data, *library* is the loaded shared library.
uk: Цей метод повертає екземпляр типу ctypes, експортований спільною бібліотекою. *name* — це ім’я символу, який експортує дані, *library* — це завантажена спільна бібліотека.

source: Common instance variables of ctypes data types:
uk: Загальні змінні екземплярів типів даних ctypes:

source: Sometimes ctypes data instances do not own the memory block they contain, instead they share part of the memory block of a base object. The :attr:`_b_base_` read-only member is the root ctypes object that owns the memory block.
uk: Іноді екземпляри даних ctypes не володіють блоком пам’яті, який вони містять, натомість вони спільно використовують частину блоку пам’яті базового об’єкта. Член :attr:`_b_base_` лише для читання є кореневим об’єктом ctypes, якому належить блок пам’яті.

source: This read-only variable is true when the ctypes data instance has allocated the memory block itself, false otherwise.
uk: Ця змінна лише для читання є істиною, коли екземпляр даних ctypes сам виділив блок пам’яті, інакше – false.

source: This member is either ``None`` or a dictionary containing Python objects that need to be kept alive so that the memory block contents is kept valid. This object is only exposed for debugging; never modify the contents of this dictionary.
uk: Цей член або ``None``, або словник, що містить об’єкти Python, які потрібно підтримувати в активному стані, щоб вміст блоку пам’яті залишався дійсним. Цей об’єкт доступний лише для налагодження; ніколи не змінюйте вміст цього словника.

source: This non-public class is the base class of all fundamental ctypes data types. It is mentioned here because it contains the common attributes of the fundamental ctypes data types. :class:`_SimpleCData` is a subclass of :class:`_CData`, so it inherits their methods and attributes. ctypes data types that are not and do not contain pointers can now be pickled.
uk: Цей закритий клас є базовим класом усіх основних типів даних ctypes. Він згадується тут, оскільки він містить загальні атрибути основних типів даних ctypes. :class:`_SimpleCData` є підкласом :class:`_CData`, тому він успадковує їхні методи та атрибути. Типи даних ctypes, які не є та не містять покажчиків, тепер можна маринувати.

source: Instances have a single attribute:
uk: Екземпляри мають один атрибут:

source: This attribute contains the actual value of the instance. For integer and pointer types, it is an integer, for character types, it is a single character bytes object or string, for character pointer types it is a Python bytes object or string.
uk: Цей атрибут містить фактичне значення екземпляра. Для цілочисельних типів і типів покажчиків це ціле число, для типів символів – об’єкт або рядок із одним символом у байтах, для типів покажчиків на символи – це об’єкт або рядок Python bytes.

source: When the ``value`` attribute is retrieved from a ctypes instance, usually a new object is returned each time. :mod:`ctypes` does *not* implement original object return, always a new object is constructed. The same is true for all other ctypes object instances.
uk: Коли атрибут ``value`` отримується з екземпляра ctypes, зазвичай щоразу повертається новий об’єкт. :mod:`ctypes` *не* реалізує повернення оригінального об’єкта, завжди створюється новий об’єкт. Те саме стосується всіх інших екземплярів об’єктів ctypes.

source: Fundamental data types, when returned as foreign function call results, or, for example, by retrieving structure field members or array items, are transparently converted to native Python types. In other words, if a foreign function has a :attr:`restype` of :class:`c_char_p`, you will always receive a Python bytes object, *not* a :class:`c_char_p` instance.
uk: Фундаментальні типи даних, коли повертаються як результати виклику зовнішньої функції або, наприклад, шляхом отримання членів полів структури чи елементів масиву, прозоро перетворюються на рідні типи Python. Іншими словами, якщо стороння функція має :attr:`restype` :class:`c_char_p`, ви завжди отримуватимете об’єкт Python bytes, *а не* екземпляр :class:`c_char_p`.

source: Subclasses of fundamental data types do *not* inherit this behavior. So, if a foreign functions :attr:`restype` is a subclass of :class:`c_void_p`, you will receive an instance of this subclass from the function call. Of course, you can get the value of the pointer by accessing the ``value`` attribute.
uk: Підкласи фундаментальних типів даних *не* успадковують цю поведінку. Отже, якщо зовнішня функція :attr:`restype` є підкласом :class:`c_void_p`, ви отримаєте екземпляр цього підкласу під час виклику функції. Звичайно, ви можете отримати значення вказівника, звернувшись до атрибута ``value``.

source: These are the fundamental ctypes data types:
uk: Ось основні типи даних ctypes:

source: Represents the C :c:type:`signed char` datatype, and interprets the value as small integer. The constructor accepts an optional integer initializer; no overflow checking is done.
uk: Представляє тип даних C :c:type:`signed char` і інтерпретує значення як мале ціле число. Конструктор приймає необов'язковий ініціалізатор цілого числа; перевірка переповнення не виконується.

source: Represents the C :c:type:`char` datatype, and interprets the value as a single character. The constructor accepts an optional string initializer, the length of the string must be exactly one character.
uk: Представляє тип даних C :c:type:`char` і інтерпретує значення як один символ. Конструктор приймає необов’язковий ініціалізатор рядка, довжина рядка має бути рівно одному символу.

source: Represents the C :c:type:`char *` datatype when it points to a zero-terminated string. For a general character pointer that may also point to binary data, ``POINTER(c_char)`` must be used. The constructor accepts an integer address, or a bytes object.
uk: Представляє тип даних C :c:type:`char *`, коли він вказує на рядок із нульовим завершенням. Для загального символьного покажчика, який також може вказувати на двійкові дані, слід використовувати ``POINTER(c_char)``. Конструктор приймає цілу адресу або об'єкт bytes.

source: Represents the C :c:type:`double` datatype. The constructor accepts an optional float initializer.
uk: Представляє тип даних C :c:type:`double`. Конструктор приймає додатковий ініціалізатор float.

source: Represents the C :c:type:`long double` datatype. The constructor accepts an optional float initializer. On platforms where ``sizeof(long double) == sizeof(double)`` it is an alias to :class:`c_double`.
uk: Представляє тип даних C :c:type:`long double`. Конструктор приймає додатковий ініціалізатор float. На платформах, де ``sizeof(long double) == sizeof(double)`` це псевдонім :class:`c_double`.

source: Represents the C :c:type:`float` datatype. The constructor accepts an optional float initializer.
uk: Представляє тип даних C :c:type:`float`. Конструктор приймає додатковий ініціалізатор float.

source: Represents the C :c:type:`signed int` datatype. The constructor accepts an optional integer initializer; no overflow checking is done. On platforms where ``sizeof(int) == sizeof(long)`` it is an alias to :class:`c_long`.
uk: Представляє тип даних C :c:type:`signed int`. Конструктор приймає необов'язковий ініціалізатор цілого числа; перевірка переповнення не виконується. На платформах, де ``sizeof(int) == sizeof(long)``, це псевдонім :class:`c_long`.

source: Represents the C 8-bit :c:type:`signed int` datatype. Usually an alias for :class:`c_byte`.
uk: Представляє 8-розрядний тип даних C:c:type:`signed int`. Зазвичай це псевдонім для :class:`c_byte`.

source: Represents the C 16-bit :c:type:`signed int` datatype. Usually an alias for :class:`c_short`.
uk: Представляє 16-розрядний тип даних C:c:type:`signed int`. Зазвичай це псевдонім для :class:`c_short`.

source: Represents the C 32-bit :c:type:`signed int` datatype. Usually an alias for :class:`c_int`.
uk: Представляє 32-розрядний тип даних C:c:type:`signed int`. Зазвичай це псевдонім для :class:`c_int`.

source: Represents the C 64-bit :c:type:`signed int` datatype. Usually an alias for :class:`c_longlong`.
uk: Представляє 64-розрядний тип даних C:c:type:`signed int`. Зазвичай це псевдонім для :class:`c_longlong`.

source: Represents the C :c:type:`signed long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
uk: Представляє тип даних C :c:type:`signed long`. Конструктор приймає необов'язковий ініціалізатор цілого числа; перевірка переповнення не виконується.

source: Represents the C :c:type:`signed long long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
uk: Представляє тип даних C :c:type:`signed long long`. Конструктор приймає додатковий ініціалізатор цілого числа; перевірка переповнення не виконується.

source: Represents the C :c:type:`signed short` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
uk: Представляє тип даних C :c:type:`signed short`. Конструктор приймає необов'язковий ініціалізатор цілого числа; перевірка переповнення не виконується.

source: Represents the C :c:type:`size_t` datatype.
uk: Представляє тип даних C :c:type:`size_t`.

source: Represents the C :c:type:`ssize_t` datatype.
uk: Представляє тип даних C :c:type:`ssize_t`.

source: Represents the C :c:type:`unsigned char` datatype, it interprets the value as small integer. The constructor accepts an optional integer initializer; no overflow checking is done.
uk: Представляє тип даних C :c:type:`unsigned char`, він інтерпретує значення як мале ціле число. Конструктор приймає додатковий ініціалізатор цілого числа; перевірка переповнення не виконується.

source: Represents the C :c:type:`unsigned int` datatype. The constructor accepts an optional integer initializer; no overflow checking is done. On platforms where ``sizeof(int) == sizeof(long)`` it is an alias for :class:`c_ulong`.
uk: Представляє тип даних C :c:type:`unsigned int`. Конструктор приймає необов'язковий ініціалізатор цілого числа; перевірка переповнення не виконується. На платформах, де ``sizeof(int) == sizeof(long)`` це псевдонім для :class:`c_ulong`.

source: Represents the C 8-bit :c:type:`unsigned int` datatype. Usually an alias for :class:`c_ubyte`.
uk: Представляє 8-розрядний тип даних C:c:type:`unsigned int`. Зазвичай це псевдонім для :class:`c_ubyte`.

source: Represents the C 16-bit :c:type:`unsigned int` datatype. Usually an alias for :class:`c_ushort`.
uk: Представляє 16-розрядний тип даних C:c:type:`unsigned int`. Зазвичай це псевдонім для :class:`c_ushort`.

source: Represents the C 32-bit :c:type:`unsigned int` datatype. Usually an alias for :class:`c_uint`.
uk: Представляє 32-розрядний тип даних C:c:type:`unsigned int`. Зазвичай це псевдонім для :class:`c_uint`.

source: Represents the C 64-bit :c:type:`unsigned int` datatype. Usually an alias for :class:`c_ulonglong`.
uk: Представляє 64-розрядний тип даних C:c:type:`unsigned int`. Зазвичай це псевдонім для :class:`c_ulonglong`.

source: Represents the C :c:type:`unsigned long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
uk: Представляє тип даних C :c:type:`unsigned long`. Конструктор приймає додатковий ініціалізатор цілого числа; перевірка переповнення не виконується.

source: Represents the C :c:type:`unsigned long long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
uk: Представляє тип даних C :c:type:`unsigned long long`. Конструктор приймає необов'язковий ініціалізатор цілого числа; перевірка переповнення не виконується.

source: Represents the C :c:type:`unsigned short` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
uk: Представляє тип даних C :c:type:`unsigned short`. Конструктор приймає необов'язковий ініціалізатор цілого числа; перевірка переповнення не виконується.

source: Represents the C :c:type:`void *` type. The value is represented as integer. The constructor accepts an optional integer initializer.
uk: Представляє тип C :c:type:`void *`. Значення представлено як ціле число. Конструктор приймає додатковий ініціалізатор цілого числа.

source: Represents the C :c:type:`wchar_t` datatype, and interprets the value as a single character unicode string. The constructor accepts an optional string initializer, the length of the string must be exactly one character.
uk: Представляє тип даних C :c:type:`wchar_t` і інтерпретує значення як односимвольний рядок Unicode. Конструктор приймає необов’язковий ініціалізатор рядка, довжина рядка має бути рівно одному символу.

source: Represents the C :c:type:`wchar_t *` datatype, which must be a pointer to a zero-terminated wide character string. The constructor accepts an integer address, or a string.
uk: Представляє тип даних C :c:type:`wchar_t *`, який має бути вказівником на широкий символьний рядок із завершенням нулем. Конструктор приймає цілу адресу або рядок.

source: Represent the C :c:type:`bool` datatype (more accurately, :c:type:`_Bool` from C99). Its value can be ``True`` or ``False``, and the constructor accepts any object that has a truth value.
uk: Представляє тип даних C :c:type:`bool` (точніше, :c:type:`_Bool` з C99). Його значення може бути ``True`` або ``False``, і конструктор приймає будь-який об’єкт, який має значення істинності.

source: Windows only: Represents a :c:type:`HRESULT` value, which contains success or error information for a function or method call.
uk: Лише для Windows: представляє значення :c:type:`HRESULT`, яке містить інформацію про успіх або помилку для виклику функції чи методу.

source: Represents the C :c:type:`PyObject *` datatype. Calling this without an argument creates a ``NULL`` :c:type:`PyObject *` pointer.
uk: Представляє тип даних C :c:type:`PyObject *`. Виклик цього без аргументу створює покажчик ``NULL`` :c:type:`PyObject *`.
