Repository: python/python-docs-uk
Catalog: library/ctypes.po
Languages: uk

source: Why is it printing ``False``? ctypes instances are objects containing a memory block plus some :term:`descriptor`\s accessing the contents of the memory. Storing a Python object in the memory block does not store the object itself, instead the ``contents`` of the object is stored. Accessing the contents again constructs a new Python object each time!
uk: Чому він друкує ``False``? Екземпляри ctypes — це об’єкти, що містять блок пам’яті плюс деякі :term:`descriptor`\, що мають доступ до вмісту пам’яті. Зберігання об’єкта Python у блоці пам’яті не зберігає сам об’єкт, натомість зберігається ``вміст`` об’єкта. Повторний доступ до вмісту щоразу створює новий об’єкт Python!

source: Variable-sized data types
uk: Типи даних змінного розміру

source: :mod:`ctypes` provides some support for variable-sized arrays and structures.
uk: :mod:`ctypes` забезпечує деяку підтримку для масивів і структур змінного розміру.

source: The :func:`resize` function can be used to resize the memory buffer of an existing ctypes object. The function takes the object as first argument, and the requested size in bytes as the second argument. The memory block cannot be made smaller than the natural memory block specified by the objects type, a :exc:`ValueError` is raised if this is tried::
uk: Функцію :func:`resize` можна використовувати для зміни розміру буфера пам’яті існуючого об’єкта ctypes. Функція приймає об’єкт як перший аргумент, а запитуваний розмір у байтах як другий аргумент. Блок пам’яті не може бути меншим, ніж природний блок пам’яті, визначений типом об’єкта, :exc:`ValueError` виникає, якщо це спробувати::

source: This is nice and fine, but how would one access the additional elements contained in this array? Since the type still only knows about 4 elements, we get errors accessing other elements::
uk: Це гарно і добре, але як отримати доступ до додаткових елементів, що містяться в цьому масиві? Оскільки тип все ще знає лише про 4 елементи, ми отримуємо помилки під час доступу до інших елементів::

source: Another way to use variable-sized data types with :mod:`ctypes` is to use the dynamic nature of Python, and (re-)define the data type after the required size is already known, on a case by case basis.
uk: Інший спосіб використання типів даних змінного розміру з :mod:`ctypes` — це використання динамічної природи Python і (повторне) визначення типу даних після того, як потрібний розмір уже відомий, у кожному конкретному випадку.

source: ctypes reference
uk: посилання на ctypes

source: Finding shared libraries
uk: Пошук спільних бібліотек

source: When programming in a compiled language, shared libraries are accessed when compiling/linking a program, and when the program is run.
uk: Під час програмування скомпільованою мовою доступ до спільних бібліотек здійснюється під час компіляції/зв’язування програми та під час виконання програми.

source: The purpose of the :func:`find_library` function is to locate a library in a way similar to what the compiler or runtime loader does (on platforms with several versions of a shared library the most recent should be loaded), while the ctypes library loaders act like when a program is run, and call the runtime loader directly.
uk: Метою функції :func:`find_library` є пошук бібліотеки у спосіб, подібний до того, що робить компілятор або завантажувач середовища виконання (на платформах із кількома версіями спільної бібліотеки має бути завантажена остання), тоді як бібліотека ctypes завантажувачі діють так само, як коли виконується програма, і безпосередньо викликають завантажувач часу виконання.

source: The :mod:`ctypes.util` module provides a function which can help to determine the library to load.
uk: Модуль :mod:`ctypes.util` надає функцію, яка може допомогти визначити бібліотеку для завантаження.

source: Try to find a library and return a pathname. *name* is the library name without any prefix like *lib*, suffix like ``.so``, ``.dylib`` or version number (this is the form used for the posix linker option :option:`!-l`). If no library can be found, returns ``None``.
uk: Спробуйте знайти бібліотеку та повернути шлях. *name* — це назва бібліотеки без будь-якого префікса, як-от *lib*, суфікса, як-от ``.so``, ``.dylib`` або номера версії (це форма, яка використовується для параметра компонування posix :option:`!- l`). Якщо бібліотеки не знайдено, повертає ``None``.

source: The exact functionality is system dependent.
uk: Точна функція залежить від системи.

source: On Linux, :func:`find_library` tries to run external programs (``/sbin/ldconfig``, ``gcc``, ``objdump`` and ``ld``) to find the library file. It returns the filename of the library file.
uk: У Linux :func:`find_library` намагається запустити зовнішні програми (``/sbin/ldconfig``, ``gcc``, ``objdump`` і ``ld``), щоб знайти файл бібліотеки. Він повертає ім’я файлу бібліотеки.

source: On Linux, the value of the environment variable ``LD_LIBRARY_PATH`` is used when searching for libraries, if a library cannot be found by any other means.
uk: У Linux значення змінної середовища ``LD_LIBRARY_PATH`` використовується під час пошуку бібліотек, якщо бібліотеку неможливо знайти будь-яким іншим способом.

source: Here are some examples::
uk: Ось кілька прикладів:

source: On macOS, :func:`find_library` tries several predefined naming schemes and paths to locate the library, and returns a full pathname if successful::
uk: У macOS :func:`find_library` намагається знайти бібліотеку за допомогою кількох попередньо визначених схем іменування та шляхів, і в разі успіху повертає повний шлях::

source: On Windows, :func:`find_library` searches along the system search path, and returns the full pathname, but since there is no predefined naming scheme a call like ``find_library("c")`` will fail and return ``None``.
uk: У Windows :func:`find_library` шукає вздовж шляху системного пошуку та повертає повний шлях, але оскільки попередньо визначеної схеми іменування немає, виклик на кшталт ``find_library("c")`` завершиться помилкою та поверне ``None``.

source: If wrapping a shared library with :mod:`ctypes`, it *may* be better to determine the shared library name at development time, and hardcode that into the wrapper module instead of using :func:`find_library` to locate the library at runtime.
uk: Якщо огортати спільну бібліотеку за допомогою :mod:`ctypes`, *може* краще визначити назву спільної бібліотеки під час розробки та жорстко закодувати її в модуль оболонки замість використання :func:`find_library` для пошуку бібліотеки за адресою час виконання.

source: Loading shared libraries
uk: Завантаження спільних бібліотек

source: There are several ways to load shared libraries into the Python process. One way is to instantiate one of the following classes:
uk: Є кілька способів завантажити спільні бібліотеки в процес Python. Одним із способів є створення екземпляра одного з наступних класів:

source: Instances of this class represent loaded shared libraries. Functions in these libraries use the standard C calling convention, and are assumed to return :c:type:`int`.
uk: Екземпляри цього класу представляють завантажені спільні бібліотеки. Функції в цих бібліотеках використовують стандартну угоду про виклики C і мають повертати :c:type:`int`.

source: On Windows creating a :class:`CDLL` instance may fail even if the DLL name exists. When a dependent DLL of the loaded DLL is not found, a :exc:`OSError` error is raised with the message *"[WinError 126] The specified module could not be found".* This error message does not contain the name of the missing DLL because the Windows API does not return this information making this error hard to diagnose. To resolve this error and determine which DLL is not found, you need to find the list of dependent DLLs and determine which one is not found using Windows debugging and tracing tools.
uk: У Windows створення екземпляра :class:`CDLL` може завершитися помилкою, навіть якщо ім’я DLL існує. Якщо залежну DLL від завантаженої DLL не знайдено, виникає помилка :exc:`OSError` із повідомленням *"[WinError 126] Не вдалося знайти вказаний модуль".* Це повідомлення про помилку не містить назви відсутня DLL, оскільки Windows API не повертає цю інформацію, що ускладнює діагностику цієї помилки. Щоб усунути цю помилку та визначити, яку DLL не знайдено, потрібно знайти список залежних DLL і визначити, яка з них не знайдена, за допомогою засобів налагодження та трасування Windows.

source: `Microsoft DUMPBIN tool <https://docs.microsoft.com/cpp/build/reference/dependents>`_ -- A tool to find DLL dependents.
uk: `Інструмент Microsoft DUMPBIN <https://docs.microsoft.com/cpp/build/reference/dependents>`_ -- Інструмент для пошуку залежних DLL.

source: Windows only: Instances of this class represent loaded shared libraries, functions in these libraries use the ``stdcall`` calling convention, and are assumed to return the windows specific :class:`HRESULT` code. :class:`HRESULT` values contain information specifying whether the function call failed or succeeded, together with additional error code. If the return value signals a failure, an :class:`OSError` is automatically raised.
uk: Лише для Windows: екземпляри цього класу представляють завантажені спільні бібліотеки, функції в цих бібліотеках використовують угоду про виклики ``stdcall`` і припускається, що вони повертають специфічний для Windows код :class:`HRESULT`. Значення :class:`HRESULT` містять інформацію про те, чи виклик функції завершився невдало чи успішно, а також додатковий код помилки. Якщо повернуте значення сигналізує про помилку, автоматично виникає :class:`OSError`.

source: :exc:`WindowsError` used to be raised.
uk: :exc:`WindowsError` раніше виникало.

source: Windows only: Instances of this class represent loaded shared libraries, functions in these libraries use the ``stdcall`` calling convention, and are assumed to return :c:type:`int` by default.
uk: Лише для Windows: екземпляри цього класу представляють завантажені спільні бібліотеки, функції в цих бібліотеках використовують угоду про виклики ``stdcall`` і за умовчанням повертають :c:type:`int`.

source: The Python :term:`global interpreter lock` is released before calling any function exported by these libraries, and reacquired afterwards.
uk: :term:`global interpreter lock` Python знімається перед викликом будь-якої функції, експортованої цими бібліотеками, і знову отримується після цього.

source: Instances of this class behave like :class:`CDLL` instances, except that the Python GIL is *not* released during the function call, and after the function execution the Python error flag is checked. If the error flag is set, a Python exception is raised.
uk: Екземпляри цього класу поводяться як екземпляри :class:`CDLL`, за винятком того, що GIL Python *не* звільняється під час виклику функції, а після виконання функції перевіряється позначка помилки Python. Якщо встановлено позначку помилки, виникає виняток Python.

source: Thus, this is only useful to call Python C api functions directly.
uk: Таким чином, це корисно лише для прямого виклику API-функцій Python C.

source: All these classes can be instantiated by calling them with at least one argument, the pathname of the shared library. If you have an existing handle to an already loaded shared library, it can be passed as the ``handle`` named parameter, otherwise the underlying platforms ``dlopen`` or ``LoadLibrary`` function is used to load the library into the process, and to get a handle to it.
uk: Усі ці класи можна створити, викликавши їх принаймні з одним аргументом, шляхом до спільної бібліотеки. Якщо у вас є існуючий дескриптор уже завантаженої спільної бібліотеки, його можна передати як іменований параметр ``handle``, інакше для завантаження бібліотеки в використовується функція ``dlopen`` або ``LoadLibrary`` базової платформи процес і впоратися з ним.

source: The *mode* parameter can be used to specify how the library is loaded. For details, consult the :manpage:`dlopen(3)` manpage. On Windows, *mode* is ignored. On posix systems, RTLD_NOW is always added, and is not configurable.
uk: Параметр *mode* можна використовувати для визначення способу завантаження бібліотеки. Додаткову інформацію див. на сторінці довідки :manpage:`dlopen(3)`. У Windows *режим* ігнорується. У системах posix RTLD_NOW завжди додається та не налаштовується.

source: The *use_errno* parameter, when set to true, enables a ctypes mechanism that allows accessing the system :data:`errno` error number in a safe way. :mod:`ctypes` maintains a thread-local copy of the systems :data:`errno` variable; if you call foreign functions created with ``use_errno=True`` then the :data:`errno` value before the function call is swapped with the ctypes private copy, the same happens immediately after the function call.
uk: Параметр *use_errno*, якщо встановлено значення true, увімкне механізм ctypes, який дозволяє безпечно отримати доступ до системного номера помилки :data:`errno`. :mod:`ctypes` підтримує локальну копію системної змінної :data:`errno`; якщо ви викликаєте сторонні функції, створені за допомогою ``use_errno=True``, тоді значення :data:`errno` перед викликом функції замінюється приватною копією ctypes, те саме відбувається відразу після виклику функції.

source: The function :func:`ctypes.get_errno` returns the value of the ctypes private copy, and the function :func:`ctypes.set_errno` changes the ctypes private copy to a new value and returns the former value.
uk: Функція :func:`ctypes.get_errno` повертає значення приватної копії ctypes, а функція :func:`ctypes.set_errno` змінює приватну копію ctypes на нове значення та повертає попереднє значення.

source: The *use_last_error* parameter, when set to true, enables the same mechanism for the Windows error code which is managed by the :func:`GetLastError` and :func:`SetLastError` Windows API functions; :func:`ctypes.get_last_error` and :func:`ctypes.set_last_error` are used to request and change the ctypes private copy of the windows error code.
uk: Параметр *use_last_error*, якщо встановлено значення true, увімкне той самий механізм для коду помилки Windows, яким керують функції Windows API :func:`GetLastError` і :func:`SetLastError`; :func:`ctypes.get_last_error` і :func:`ctypes.set_last_error` використовуються для запиту та зміни приватної копії ctypes коду помилки Windows.

source: The *winmode* parameter is used on Windows to specify how the library is loaded (since *mode* is ignored). It takes any value that is valid for the Win32 API ``LoadLibraryEx`` flags parameter. When omitted, the default is to use the flags that result in the most secure DLL load to avoiding issues such as DLL hijacking. Passing the full path to the DLL is the safest way to ensure the correct library and dependencies are loaded.
uk: Параметр *winmode* використовується в Windows, щоб указати спосіб завантаження бібліотеки (оскільки *mode* ігнорується). Він приймає будь-яке значення, дійсне для параметра прапорців API Win32 ``LoadLibraryEx``. Якщо опущено, за замовчуванням використовуються позначки, які забезпечують найбільш безпечне завантаження DLL, щоб уникнути таких проблем, як викрадення DLL. Передача повного шляху до DLL є найбезпечнішим способом переконатися, що завантажено правильну бібліотеку та залежності.

source: Added *winmode* parameter.
uk: Додано параметр *winmode*.

source: Flag to use as *mode* parameter. On platforms where this flag is not available, it is defined as the integer zero.
uk: Прапор для використання як параметр *mode*. На платформах, де цей прапорець недоступний, він визначається як цілий нуль.

source: Flag to use as *mode* parameter. On platforms where this is not available, it is the same as *RTLD_GLOBAL*.
uk: Прапор для використання як параметр *mode*. На платформах, де це недоступно, це те саме, що *RTLD_GLOBAL*.

source: The default mode which is used to load shared libraries. On OSX 10.3, this is *RTLD_GLOBAL*, otherwise it is the same as *RTLD_LOCAL*.
uk: Типовий режим, який використовується для завантаження спільних бібліотек. В OSX 10.3 це *RTLD_GLOBAL*, інакше це те саме, що *RTLD_LOCAL*.

source: Instances of these classes have no public methods. Functions exported by the shared library can be accessed as attributes or by index. Please note that accessing the function through an attribute caches the result and therefore accessing it repeatedly returns the same object each time. On the other hand, accessing it through an index returns a new object each time::
uk: Екземпляри цих класів не мають відкритих методів. Доступ до функцій, експортованих спільною бібліотекою, можна отримати як за атрибутами або за індексом. Будь ласка, зверніть увагу, що доступ до функції через атрибут кешує результат, тому повторний доступ повертає той самий об’єкт щоразу. З іншого боку, доступ до нього через індекс кожного разу повертає новий об’єкт::

source: The following public attributes are available, their name starts with an underscore to not clash with exported function names:
uk: Доступні такі загальнодоступні атрибути, їх імена починаються з підкреслення, щоб не суперечити ім’ям експортованих функцій:

source: The system handle used to access the library.
uk: Системний дескриптор, який використовується для доступу до бібліотеки.

source: The name of the library passed in the constructor.
uk: Ім'я бібліотеки, передане в конструктор.

source: Shared libraries can also be loaded by using one of the prefabricated objects, which are instances of the :class:`LibraryLoader` class, either by calling the :meth:`LoadLibrary` method, or by retrieving the library as attribute of the loader instance.
uk: Спільні бібліотеки також можна завантажити за допомогою одного зі готових об’єктів, які є екземплярами класу :class:`LibraryLoader`, викликавши метод :meth:`LoadLibrary` або отримавши бібліотеку як атрибут екземпляра завантажувача .

source: Class which loads shared libraries. *dlltype* should be one of the :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL`, or :class:`OleDLL` types.
uk: Клас, який завантажує спільні бібліотеки. *dlltype* має бути одним із типів :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL` або :class:`OleDLL`.

source: :meth:`__getattr__` has special behavior: It allows loading a shared library by accessing it as attribute of a library loader instance. The result is cached, so repeated attribute accesses return the same library each time.
uk: :meth:`__getattr__` має особливу поведінку: він дозволяє завантажувати спільну бібліотеку, звертаючись до неї як до атрибута екземпляра завантажувача бібліотеки. Результат кешується, тому повторні звернення до атрибутів щоразу повертають ту саму бібліотеку.

source: Load a shared library into the process and return it. This method always returns a new instance of the library.
uk: Завантажте спільну бібліотеку в процес і поверніть її. Цей метод завжди повертає новий екземпляр бібліотеки.

source: These prefabricated library loaders are available:
uk: Ці збірні бібліотечні завантажувачі доступні:

source: Creates :class:`CDLL` instances.
uk: Створює екземпляри :class:`CDLL`.

source: Windows only: Creates :class:`WinDLL` instances.
uk: Лише для Windows: створює екземпляри :class:`WinDLL`.

source: Windows only: Creates :class:`OleDLL` instances.
uk: Лише для Windows: створює екземпляри :class:`OleDLL`.

source: Creates :class:`PyDLL` instances.
uk: Створює екземпляри :class:`PyDLL`.

source: For accessing the C Python api directly, a ready-to-use Python shared library object is available:
uk: Для прямого доступу до API C Python доступний готовий до використання об’єкт спільної бібліотеки Python:

source: An instance of :class:`PyDLL` that exposes Python C API functions as attributes. Note that all these functions are assumed to return C :c:type:`int`, which is of course not always the truth, so you have to assign the correct :attr:`restype` attribute to use these functions.
uk: Екземпляр :class:`PyDLL`, який надає функції Python C API як атрибути. Зауважте, що передбачається, що всі ці функції повертають C :c:type:`int`, що, звісно, не завжди відповідає дійсності, тому вам потрібно призначити правильний атрибут :attr:`restype`, щоб використовувати ці функції.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.dlopen`` with argument ``name``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ctypes.dlopen`` з аргументом ``name``.

source: Loading a library through any of these objects raises an :ref:`auditing event <auditing>` ``ctypes.dlopen`` with string argument ``name``, the name used to load the library.
uk: Завантаження бібліотеки через будь-який із цих об’єктів викликає :ref:`подію аудиту <auditing>` ``ctypes.dlopen`` з рядковим аргументом ``name``, іменем, яке використовується для завантаження бібліотеки.

source: Accessing a function on a loaded library raises an auditing event ``ctypes.dlsym`` with arguments ``library`` (the library object) and ``name`` (the symbol's name as a string or integer).
uk: Доступ до функції у завантаженій бібліотеці викликає подію аудиту ``ctypes.dlsym`` з аргументами ``library`` (об’єкт бібліотеки) і ``name`` (ім’я символу у вигляді рядка або цілого числа).

source: In cases when only the library handle is available rather than the object, accessing a function raises an auditing event ``ctypes.dlsym/handle`` with arguments ``handle`` (the raw library handle) and ``name``.
uk: У випадках, коли доступний лише дескриптор бібліотеки, а не об’єкт, доступ до функції викликає подію аудиту ``ctypes.dlsym/handle`` з аргументами ``handle`` (необроблений дескриптор бібліотеки) і ``name``.

source: Foreign functions
uk: Іноземні функції

source: As explained in the previous section, foreign functions can be accessed as attributes of loaded shared libraries. The function objects created in this way by default accept any number of arguments, accept any ctypes data instances as arguments, and return the default result type specified by the library loader. They are instances of a private class:
uk: Як пояснювалося в попередньому розділі, сторонні функції можна отримати як атрибути завантажених спільних бібліотек. Функціональні об’єкти, створені таким чином, за замовчуванням приймають будь-яку кількість аргументів, приймають будь-які екземпляри даних ctypes як аргументи та повертають тип результату за замовчуванням, указаний завантажувачем бібліотеки. Вони є екземплярами приватного класу:

source: Base class for C callable foreign functions.
uk: Базовий клас для зовнішніх функцій C, що викликаються.

source: Instances of foreign functions are also C compatible data types; they represent C function pointers.
uk: Примірники сторонніх функцій також є C-сумісними типами даних; вони представляють покажчики функцій C.

source: This behavior can be customized by assigning to special attributes of the foreign function object.
uk: Цю поведінку можна налаштувати шляхом призначення спеціальних атрибутів стороннього функціонального об’єкта.

source: Assign a ctypes type to specify the result type of the foreign function. Use ``None`` for :c:type:`void`, a function not returning anything.
uk: Призначте тип ctypes, щоб указати тип результату сторонньої функції. Використовуйте ``None`` для :c:type:`void`, функції, яка нічого не повертає.
