Repository: python/python-docs-uk
Catalog: library/ctypes.po
Languages: uk

source: :mod:`ctypes` --- A foreign function library for Python
uk: :mod:`ctypes` --- Інша бібліотека функцій для Python

source: :mod:`ctypes` is a foreign function library for Python. It provides C compatible data types, and allows calling functions in DLLs or shared libraries. It can be used to wrap these libraries in pure Python.
uk: :mod:`ctypes` — це бібліотека зовнішніх функцій для Python. Він надає C-сумісні типи даних і дозволяє викликати функції в DLL або спільних бібліотеках. Його можна використовувати, щоб обернути ці бібліотеки в чистий Python.

source: ctypes tutorial
uk: підручник ctypes

source: Note: The code samples in this tutorial use :mod:`doctest` to make sure that they actually work. Since some code samples behave differently under Linux, Windows, or macOS, they contain doctest directives in comments.
uk: Примітка: зразки коду в цьому підручнику використовують :mod:`doctest`, щоб переконатися, що вони справді працюють. Оскільки деякі зразки коду поводяться по-різному в Linux, Windows або macOS, вони містять директиви doctest у коментарях.

source: Note: Some code samples reference the ctypes :class:`c_int` type. On platforms where ``sizeof(long) == sizeof(int)`` it is an alias to :class:`c_long`. So, you should not be confused if :class:`c_long` is printed if you would expect :class:`c_int` --- they are actually the same type.
uk: Примітка. Деякі зразки коду посилаються на тип ctypes :class:`c_int`. На платформах, де ``sizeof(long) == sizeof(int)``, це псевдонім :class:`c_long`. Отже, вас не повинно бентежити, якщо надруковано :class:`c_long`, якщо ви очікуєте :class:`c_int` --- вони насправді одного типу.

source: Loading dynamic link libraries
uk: Завантаження бібліотек динамічних посилань

source: :mod:`ctypes` exports the *cdll*, and on Windows *windll* and *oledll* objects, for loading dynamic link libraries.
uk: :mod:`ctypes` експортує *cdll*, а в Windows об’єкти *windll* і *oledll* для завантаження бібліотек динамічних посилань.

source: You load libraries by accessing them as attributes of these objects. *cdll* loads libraries which export functions using the standard ``cdecl`` calling convention, while *windll* libraries call functions using the ``stdcall`` calling convention. *oledll* also uses the ``stdcall`` calling convention, and assumes the functions return a Windows :c:type:`HRESULT` error code. The error code is used to automatically raise an :class:`OSError` exception when the function call fails.
uk: Ви завантажуєте бібліотеки, звертаючись до них як до атрибутів цих об’єктів. *cdll* завантажує бібліотеки, які експортують функції за допомогою стандартної угоди про виклики ``cdecl``, тоді як бібліотеки *windll* викликають функції за допомогою угоди про виклики ``stdcall``. *oledll* також використовує угоду про виклики ``stdcall`` і передбачає, що функції повертають код помилки Windows :c:type:`HRESULT`. Код помилки використовується для автоматичного виклику винятку :class:`OSError`, коли виклик функції не вдається.

source: Windows errors used to raise :exc:`WindowsError`, which is now an alias of :exc:`OSError`.
uk: Помилки Windows викликали :exc:`WindowsError`, який тепер є псевдонімом :exc:`OSError`.

source: Here are some examples for Windows. Note that ``msvcrt`` is the MS standard C library containing most standard C functions, and uses the cdecl calling convention::
uk: Ось кілька прикладів для Windows. Зауважте, що msvcrt — це стандартна бібліотека C MS, яка містить більшість стандартних функцій C і використовує угоду про виклик cdecl:

source: Windows appends the usual ``.dll`` file suffix automatically.
uk: Windows автоматично додає звичайний суфікс файлу ``.dll``.

source: Accessing the standard C library through ``cdll.msvcrt`` will use an outdated version of the library that may be incompatible with the one being used by Python. Where possible, use native Python functionality, or else import and use the ``msvcrt`` module.
uk: Доступ до стандартної бібліотеки C через ``cdll.msvcrt`` використовуватиме застарілу версію бібліотеки, яка може бути несумісною з тією, що використовується Python. Якщо можливо, використовуйте власні функції Python або імпортуйте та використовуйте модуль ``msvcrt``.

source: On Linux, it is required to specify the filename *including* the extension to load a library, so attribute access can not be used to load libraries. Either the :meth:`LoadLibrary` method of the dll loaders should be used, or you should load the library by creating an instance of CDLL by calling the constructor::
uk: У Linux для завантаження бібліотеки потрібно вказати назву файлу *включаючи* розширення, тому доступ до атрибутів не можна використовувати для завантаження бібліотек. Слід використовувати або метод :meth:`LoadLibrary` завантажувачів dll, або ви повинні завантажити бібліотеку, створивши екземпляр CDLL, викликавши конструктор::

source: Accessing functions from loaded dlls
uk: Доступ до функцій із завантажених dll

source: Functions are accessed as attributes of dll objects::
uk: Доступ до функцій здійснюється як атрибути об’єктів dll::

source: Note that win32 system dlls like ``kernel32`` and ``user32`` often export ANSI as well as UNICODE versions of a function. The UNICODE version is exported with an ``W`` appended to the name, while the ANSI version is exported with an ``A`` appended to the name. The win32 ``GetModuleHandle`` function, which returns a *module handle* for a given module name, has the following C prototype, and a macro is used to expose one of them as ``GetModuleHandle`` depending on whether UNICODE is defined or not::
uk: Зауважте, що системні бібліотеки win32, такі як ``kernel32`` і ``user32``, часто експортують версії функції ANSI, а також UNICODE. Версія UNICODE експортується з буквою ``W``, доданою до назви, тоді як версія ANSI експортується з ``A``, доданою до назви. Функція ``GetModuleHandle`` win32, яка повертає *дескриптор модуля* для даного імені модуля, має наступний прототип C, і макрос використовується для надання одного з них як ``GetModuleHandle`` залежно від того, чи визначено UNICODE чи ні::

source: *windll* does not try to select one of them by magic, you must access the version you need by specifying ``GetModuleHandleA`` or ``GetModuleHandleW`` explicitly, and then call it with bytes or string objects respectively.
uk: *windll* не намагається вибрати одну з них магією, ви повинні отримати доступ до потрібної вам версії, явно вказавши ``GetModuleHandleA`` або ``GetModuleHandleW``, а потім викликати його за допомогою байтів або рядкових об’єктів відповідно.

source: Sometimes, dlls export functions with names which aren't valid Python identifiers, like ``"??2@YAPAXI@Z"``. In this case you have to use :func:`getattr` to retrieve the function::
uk: Іноді бібліотеки dll експортують функції з іменами, які не є дійсними ідентифікаторами Python, наприклад ``"??2@YAPAXI@Z"``. У цьому випадку ви повинні використовувати :func:`getattr`, щоб отримати функцію::

source: On Windows, some dlls export functions not by name but by ordinal. These functions can be accessed by indexing the dll object with the ordinal number::
uk: У Windows деякі бібліотеки DLL експортують функції не за назвою, а за порядковим номером. Доступ до цих функцій можна отримати, проіндексувавши об’єкт dll з порядковим номером::

source: Calling functions
uk: Функції виклику

source: You can call these functions like any other Python callable. This example uses the ``time()`` function, which returns system time in seconds since the Unix epoch, and the ``GetModuleHandleA()`` function, which returns a win32 module handle.
uk: Ви можете викликати ці функції, як і будь-які інші виклики Python. У цьому прикладі використовується функція ``time()``, яка повертає системний час у секундах з епохи Unix, і ``GetModuleHandleA()`` функція, яка повертає дескриптор модуля win32.

source: This example calls both functions with a ``NULL`` pointer (``None`` should be used as the ``NULL`` pointer)::
uk: У цьому прикладі обидві функції викликаються за допомогою вказівника ``NULL`` (``None`` слід використовувати як вказівник ``NULL``):

source: :exc:`ValueError` is raised when you call an ``stdcall`` function with the ``cdecl`` calling convention, or vice versa::
uk: :exc:`ValueError` виникає, коли ви викликаєте функцію ``stdcall`` за угодою про виклик ``cdecl``, або навпаки::

source: To find out the correct calling convention you have to look into the C header file or the documentation for the function you want to call.
uk: Щоб дізнатися правильну умову виклику, вам потрібно переглянути файл заголовка C або документацію для функції, яку ви хочете викликати.

source: On Windows, :mod:`ctypes` uses win32 structured exception handling to prevent crashes from general protection faults when functions are called with invalid argument values::
uk: У Windows :mod:`ctypes` використовує структуровану обробку винятків win32, щоб запобігти збоям через загальні помилки захисту, коли функції викликаються з недійсними значеннями аргументів:

source: There are, however, enough ways to crash Python with :mod:`ctypes`, so you should be careful anyway. The :mod:`faulthandler` module can be helpful in debugging crashes (e.g. from segmentation faults produced by erroneous C library calls).
uk: Однак існує достатньо способів аварійно завершити роботу Python за допомогою :mod:`ctypes`, тому будьте обережні. Модуль :mod:`faulthandler` може бути корисним для усунення збоїв (наприклад, через помилки сегментації, спричинені помилковими викликами бібліотеки C).

source: ``None``, integers, bytes objects and (unicode) strings are the only native Python objects that can directly be used as parameters in these function calls. ``None`` is passed as a C ``NULL`` pointer, bytes objects and strings are passed as pointer to the memory block that contains their data (:c:type:`char *` or :c:type:`wchar_t *`). Python integers are passed as the platforms default C :c:type:`int` type, their value is masked to fit into the C type.
uk: ``None``, цілі числа, об’єкти байтів і рядки (юнікод) є єдиними рідними об’єктами Python, які можна безпосередньо використовувати як параметри в цих викликах функцій. ``None`` передається як вказівник C ``NULL``, об’єкти байтів і рядки передаються як вказівник на блок пам’яті, який містить їхні дані (:c:type:`char *` або :c:type:`wchar_t *`). Цілі числа Python передаються як тип C :c:type:`int` платформи за замовчуванням, їхнє значення маскується, щоб відповідати типу C.

source: Before we move on calling functions with other parameter types, we have to learn more about :mod:`ctypes` data types.
uk: Перш ніж перейти до виклику функцій з іншими типами параметрів, ми повинні дізнатися більше про типи даних :mod:`ctypes`.

source: Fundamental data types
uk: Основні типи даних

source: :mod:`ctypes` defines a number of primitive C compatible data types:
uk: :mod:`ctypes` визначає ряд примітивних C-сумісних типів даних:

source: ctypes type
uk: тип ctypes

source: C type
uk: тип С

source: Python type
uk: Тип Python

source: 1-character bytes object
uk: 1-символьний об'єкт байтів

source: 1-character string
uk: 1-символьний рядок

source: int
uk: внутр

source: :c:type:`__int64` or :c:type:`long long`
uk: :c:type:`__int64` або :c:type:`long long`

source: :c:type:`unsigned __int64` or :c:type:`unsigned long long`
uk: :c:type:`unsigned __int64` або :c:type:`unsigned long long`

source: :c:type:`ssize_t` or :c:type:`Py_ssize_t`
uk: :c:type:`ssize_t` або :c:type:`Py_ssize_t`

source: float
uk: плавати

source: :c:type:`char *` (NUL terminated)
uk: :c:type:`char *` (NUL завершується)

source: bytes object or ``None``
uk: bytes або ``None``

source: :c:type:`wchar_t *` (NUL terminated)
uk: :c:type:`wchar_t *` (NUL завершується)

source: string or ``None``
uk: рядок або ``None``

source: int or ``None``
uk: int або ``None``

source: The constructor accepts any object with a truth value.
uk: Конструктор приймає будь-який об’єкт зі значенням істинності.

source: All these types can be created by calling them with an optional initializer of the correct type and value::
uk: Усі ці типи можна створити, викликавши їх із необов’язковим ініціалізатором правильного типу та значення::

source: Since these types are mutable, their value can also be changed afterwards::
uk: Оскільки ці типи є змінними, їх значення також можна змінити пізніше:

source: Assigning a new value to instances of the pointer types :class:`c_char_p`, :class:`c_wchar_p`, and :class:`c_void_p` changes the *memory location* they point to, *not the contents* of the memory block (of course not, because Python bytes objects are immutable)::
uk: Присвоєння нового значення екземплярам типів покажчиків :class:`c_char_p`, :class:`c_wchar_p` і :class:`c_void_p` змінює *місце пам’яті*, на яке вони вказують, *не вміст* блоку пам’яті (звичайно, ні, оскільки об’єкти Python bytes незмінні)::

source: You should be careful, however, not to pass them to functions expecting pointers to mutable memory. If you need mutable memory blocks, ctypes has a :func:`create_string_buffer` function which creates these in various ways. The current memory block contents can be accessed (or changed) with the ``raw`` property; if you want to access it as NUL terminated string, use the ``value`` property::
uk: Однак ви повинні бути обережними, щоб не передавати їх функціям, які очікують покажчиків на змінну пам’ять. Якщо вам потрібні змінні блоки пам’яті, ctypes має функцію :func:`create_string_buffer`, яка створює їх різними способами. Доступ до поточного вмісту блоку пам’яті можна отримати (або змінити) за допомогою властивості ``raw``; якщо ви бажаєте отримати до нього доступ як до рядка з закінченням NUL, використовуйте властивість ``value``::

source: Calling functions, continued
uk: Функції виклику, продовження

source: Note that printf prints to the real standard output channel, *not* to :data:`sys.stdout`, so these examples will only work at the console prompt, not from within *IDLE* or *PythonWin*::
uk: Зауважте, що printf друкує на справжній стандартний канал виводу, *а не* на :data:`sys.stdout`, тому ці приклади працюватимуть лише у підказці консолі, а не з *IDLE* або *PythonWin*::

source: As has been mentioned before, all Python types except integers, strings, and bytes objects have to be wrapped in their corresponding :mod:`ctypes` type, so that they can be converted to the required C data type::
uk: Як уже згадувалося раніше, усі типи Python, окрім цілих, рядкових і байтових об’єктів, мають бути загорнуті у відповідний тип :mod:`ctypes`, щоб їх можна було перетворити на необхідний тип даних C::

source: Calling functions with your own custom data types
uk: Виклик функцій із власними типами даних

source: You can also customize :mod:`ctypes` argument conversion to allow instances of your own classes be used as function arguments. :mod:`ctypes` looks for an :attr:`_as_parameter_` attribute and uses this as the function argument. Of course, it must be one of integer, string, or bytes::
uk: Ви також можете налаштувати перетворення аргументів :mod:`ctypes`, щоб екземпляри ваших власних класів могли використовуватися як аргументи функції. :mod:`ctypes` шукає атрибут :attr:`_as_parameter_` і використовує його як аргумент функції. Звичайно, це має бути ціле число, рядок або байти::

source: If you don't want to store the instance's data in the :attr:`_as_parameter_` instance variable, you could define a :class:`property` which makes the attribute available on request.
uk: Якщо ви не хочете зберігати дані екземпляра в змінній екземпляра :attr:`_as_parameter_`, ви можете визначити :class:`property`, що робить атрибут доступним за запитом.

source: Specifying the required argument types (function prototypes)
uk: Вказівка необхідних типів аргументів (прототипів функцій)

source: It is possible to specify the required argument types of functions exported from DLLs by setting the :attr:`argtypes` attribute.
uk: Можна вказати необхідні типи аргументів функцій, експортованих із DLL, установивши атрибут :attr:`argtypes`.

source: :attr:`argtypes` must be a sequence of C data types (the ``printf`` function is probably not a good example here, because it takes a variable number and different types of parameters depending on the format string, on the other hand this is quite handy to experiment with this feature)::
uk: :attr:`argtypes` має бути послідовністю типів даних C (функція ``printf`` тут, ймовірно, не є хорошим прикладом, оскільки вона приймає змінне число та різні типи параметрів залежно від рядка формату, з іншого боку це дуже зручно, щоб експериментувати з цією функцією)::

source: Specifying a format protects against incompatible argument types (just as a prototype for a C function), and tries to convert the arguments to valid types::
uk: Зазначення формату захищає від несумісних типів аргументів (як прототип для функції C) і намагається перетворити аргументи на дійсні типи:

source: If you have defined your own classes which you pass to function calls, you have to implement a :meth:`from_param` class method for them to be able to use them in the :attr:`argtypes` sequence. The :meth:`from_param` class method receives the Python object passed to the function call, it should do a typecheck or whatever is needed to make sure this object is acceptable, and then return the object itself, its :attr:`_as_parameter_` attribute, or whatever you want to pass as the C function argument in this case. Again, the result should be an integer, string, bytes, a :mod:`ctypes` instance, or an object with an :attr:`_as_parameter_` attribute.
uk: Якщо ви визначили власні класи, які передаєте до викликів функцій, вам потрібно реалізувати метод класу :meth:`from_param`, щоб вони могли використовувати їх у послідовності :attr:`argtypes`. Метод класу :meth:`from_param` отримує об’єкт Python, переданий у виклик функції, він повинен виконати перевірку типу або щось інше, щоб переконатися, що цей об’єкт прийнятний, а потім повернути сам об’єкт, його :attr:`_as_parameter_` атрибут або те, що ви хочете передати як аргумент функції C у цьому випадку. Знову ж таки, результатом має бути ціле число, рядок, байти, екземпляр :mod:`ctypes` або об’єкт з атрибутом :attr:`_as_parameter_`.

source: Return types
uk: Типи повернення

source: By default functions are assumed to return the C :c:type:`int` type. Other return types can be specified by setting the :attr:`restype` attribute of the function object.
uk: За умовчанням передбачається, що функції повертають тип C :c:type:`int`. Інші типи повернення можна вказати, встановивши атрибут :attr:`restype` об’єкта функції.

source: Here is a more advanced example, it uses the ``strchr`` function, which expects a string pointer and a char, and returns a pointer to a string::
uk: Ось більш складний приклад, він використовує функцію ``strchr``, яка очікує вказівник на рядок і char і повертає вказівник на рядок::

source: If you want to avoid the ``ord("x")`` calls above, you can set the :attr:`argtypes` attribute, and the second argument will be converted from a single character Python bytes object into a C char::
uk: Якщо ви хочете уникнути викликів ``ord("x")`` вище, ви можете встановити атрибут :attr:`argtypes`, і другий аргумент буде перетворено з односимвольного об’єкта Python bytes у C char: :

source: You can also use a callable Python object (a function or a class for example) as the :attr:`restype` attribute, if the foreign function returns an integer. The callable will be called with the *integer* the C function returns, and the result of this call will be used as the result of your function call. This is useful to check for error return values and automatically raise an exception::
uk: Ви також можете використовувати об’єкт Python, який можна викликати (наприклад, функцію або клас) як атрибут :attr:`restype`, якщо зовнішня функція повертає ціле число. Об’єкт, який викликається, буде викликано за допомогою *цілого*, яке повертає функція C, і результат цього виклику буде використано як результат виклику вашої функції. Це корисно для перевірки значень, які повертаються помилки, і автоматичного виклику винятку::

source: ``WinError`` is a function which will call Windows ``FormatMessage()`` api to get the string representation of an error code, and *returns* an exception. ``WinError`` takes an optional error code parameter, if no one is used, it calls :func:`GetLastError` to retrieve it.
uk: ``WinError`` — це функція, яка викликає Windows ``FormatMessage()`` API, щоб отримати рядкове представлення коду помилки, і *повертає* виняткову ситуацію. ``WinError`` приймає додатковий параметр коду помилки, якщо ніхто не використовується, він викликає :func:`GetLastError`, щоб отримати його.

source: Please note that a much more powerful error checking mechanism is available through the :attr:`errcheck` attribute; see the reference manual for details.
uk: Зауважте, що набагато потужніший механізм перевірки помилок доступний через атрибут :attr:`errcheck`; подробиці див. у довідковому посібнику.

source: Passing pointers (or: passing parameters by reference)
uk: Передача покажчиків (або: передача параметрів за посиланням)

source: Sometimes a C api function expects a *pointer* to a data type as parameter, probably to write into the corresponding location, or if the data is too large to be passed by value. This is also known as *passing parameters by reference*.
uk: Іноді функція C API очікує *вказівника* на тип даних як параметр, ймовірно, для запису у відповідне розташування або якщо дані завеликі для передачі за значенням. Це також відомо як *передача параметрів за посиланням*.

source: :mod:`ctypes` exports the :func:`byref` function which is used to pass parameters by reference. The same effect can be achieved with the :func:`pointer` function, although :func:`pointer` does a lot more work since it constructs a real pointer object, so it is faster to use :func:`byref` if you don't need the pointer object in Python itself::
uk: :mod:`ctypes` експортує функцію :func:`byref`, яка використовується для передачі параметрів за посиланням. Такого ж ефекту можна досягти за допомогою функції :func:`pointer`, хоча :func:`pointer` виконує набагато більше роботи, оскільки створює справжній об’єкт-вказівник, тому використовувати :func:`byref` швидше не потрібен об’єкт покажчика в самому Python::

source: Structures and unions
uk: Структури та спілки

source: Structures and unions must derive from the :class:`Structure` and :class:`Union` base classes which are defined in the :mod:`ctypes` module. Each subclass must define a :attr:`_fields_` attribute. :attr:`_fields_` must be a list of *2-tuples*, containing a *field name* and a *field type*.
uk: Структури та об’єднання мають походити від базових класів :class:`Structure` і :class:`Union`, які визначені в модулі :mod:`ctypes`. Кожен підклас повинен визначати атрибут :attr:`_fields_`. :attr:`_fields_` має бути списком *2-кортежів*, що містить *ім’я поля* та *тип поля*.

source: The field type must be a :mod:`ctypes` type like :class:`c_int`, or any other derived :mod:`ctypes` type: structure, union, array, pointer.
uk: Тип поля має бути типу :mod:`ctypes`, наприклад :class:`c_int`, або будь-якого іншого похідного типу :mod:`ctypes`: структура, об’єднання, масив, покажчик.

source: Here is a simple example of a POINT structure, which contains two integers named *x* and *y*, and also shows how to initialize a structure in the constructor::
uk: Ось простий приклад структури POINT, яка містить два цілі числа з іменами *x* і *y*, а також показує, як ініціалізувати структуру в конструкторі::

source: You can, however, build much more complicated structures. A structure can itself contain other structures by using a structure as a field type.
uk: Однак можна будувати набагато складніші конструкції. Структура може сама містити інші структури, використовуючи структуру як тип поля.
