Repository: python/python-docs-uk
Catalog: library/curses.po
Languages: uk

source: Leave echo mode. Echoing of input characters is turned off.
uk: Вийти з режиму відлуння. Ехо введених символів вимкнено.

source: Leave newline mode. Disable translation of return into newline on input, and disable low-level translation of newline into newline/return on output (but this does not change the behavior of ``addch('\n')``, which always does the equivalent of return and line feed on the virtual screen). With translation off, curses can sometimes speed up vertical motion a little; also, it will be able to detect the return key on input.
uk: Вийти з режиму нового рядка. Вимкнути переклад повернення на новий рядок під час введення та вимкнути низькорівневий переклад нового рядка на новий рядок/повернення на виході (але це не змінює поведінку ``addch('\n')``, який завжди виконує еквівалент повернення та переклад рядка на віртуальному екрані). Якщо переклад вимкнено, прокляття іноді можуть трохи пришвидшити вертикальний рух; також він зможе виявити ключ повернення під час введення.

source: When the :func:`!noqiflush` routine is used, normal flush of input and output queues associated with the ``INTR``, ``QUIT`` and ``SUSP`` characters will not be done. You may want to call :func:`!noqiflush` in a signal handler if you want output to continue as though the interrupt had not occurred, after the handler exits.
uk: Коли використовується процедура :func:`!noqiflush`, звичайне очищення черг введення та виведення, пов’язаних із символами ``INTR``, ``QUIT`` і ``SUSP``, не виконуватиметься. Ви можете викликати :func:`!noqiflush` в обробнику сигналу, якщо ви бажаєте, щоб виведення продовжувалося так, ніби переривання не було, після завершення роботи обробника.

source: Leave raw mode. Return to normal "cooked" mode with line buffering.
uk: Вийти з режиму raw. Повернутися до звичайного режиму "приготування" з буферизацією рядків.

source: Return a tuple ``(fg, bg)`` containing the colors for the requested color pair. The value of *pair_number* must be between ``0`` and ``COLOR_PAIRS - 1``.
uk: Повертає кортеж ``(fg, bg)``, що містить кольори для запитаної пари кольорів. Значення *pair_number* має бути між ``0`` і ``COLOR_PAIRS - 1``.

source: Return the number of the color-pair set by the attribute value *attr*. :func:`color_pair` is the counterpart to this function.
uk: Повертає номер пари кольорів, заданий значенням атрибута *attr*. :func:`color_pair` є аналогом цієї функції.

source: Equivalent to ``tputs(str, 1, putchar)``; emit the value of a specified terminfo capability for the current terminal. Note that the output of :func:`putp` always goes to standard output.
uk: Еквівалент ``tputs(str, 1, putchar)``; видавати значення вказаної можливості terminfo для поточного терміналу. Зауважте, що вивід :func:`putp` завжди переходить у стандартний вивід.

source: If *flag* is ``False``, the effect is the same as calling :func:`noqiflush`. If *flag* is ``True``, or no argument is provided, the queues will be flushed when these control characters are read.
uk: Якщо *flag* має значення ``False``, ефект такий самий, як виклик :func:`noqiflush`. Якщо *flag* має значення ``True`` або аргумент не надано, черги будуть скинуті під час читання цих керуючих символів.

source: Enter raw mode. In raw mode, normal line buffering and processing of interrupt, quit, suspend, and flow control keys are turned off; characters are presented to curses input functions one by one.
uk: Увійдіть у режим raw. У необробленому режимі звичайна буферизація лінії та обробка клавіш переривання, виходу, призупинення та керування потоком вимкнено; символи представлені функціям введення curses один за одним.

source: Restore the terminal to "program" mode, as previously saved by :func:`def_prog_mode`.
uk: Відновіть термінал у "програмний" режим, який раніше зберіг :func:`def_prog_mode`.

source: Restore the terminal to "shell" mode, as previously saved by :func:`def_shell_mode`.
uk: Відновіть термінал у режим "оболонки", який раніше зберіг :func:`def_shell_mode`.

source: Restore the state of the terminal modes to what it was at the last call to :func:`savetty`.
uk: Відновити стан режимів терміналу до того, яким він був під час останнього виклику :func:`savetty`.

source: Backend function used by :func:`resizeterm`, performing most of the work; when resizing the windows, :func:`resize_term` blank-fills the areas that are extended. The calling application should fill in these areas with appropriate data. The :func:`!resize_term` function attempts to resize all windows. However, due to the calling convention of pads, it is not possible to resize these without additional interaction with the application.
uk: Функція серверної частини, яку використовує :func:`resizeterm`, виконує більшу частину роботи; під час зміни розміру вікна :func:`resize_term` заповнює порожніми області, які розширені. Додаток, що викликає, має заповнити ці області відповідними даними. Функція :func:`!resize_term` намагається змінити розмір усіх вікон. Однак через правила виклику планшетів неможливо змінити їх розмір без додаткової взаємодії з програмою.

source: Resize the standard and current windows to the specified dimensions, and adjusts other bookkeeping data used by the curses library that record the window dimensions (in particular the SIGWINCH handler).
uk: Змінює розміри стандартних і поточних вікон до вказаних розмірів і налаштовує інші облікові дані, які використовуються бібліотекою curses, яка записує розміри вікон (зокрема, обробник SIGWINCH).

source: Save the current state of the terminal modes in a buffer, usable by :func:`resetty`.
uk: Збережіть поточний стан режимів терміналу в буфері, який можна використовувати :func:`resetty`.

source: Retrieves the value set by :func:`set_escdelay`.
uk: Отримує значення, встановлене :func:`set_escdelay`.

source: Sets the number of milliseconds to wait after reading an escape character, to distinguish between an individual escape character entered on the keyboard from escape sequences sent by cursor and function keys.
uk: Встановлює кількість мілісекунд очікування після читання керуючого символу, щоб відрізнити окремий керуючий символ, введений на клавіатурі, від керуючих послідовностей, надісланих курсором і функціональними клавішами.

source: Retrieves the value set by :func:`set_tabsize`.
uk: Отримує значення, встановлене :func:`set_tabsize`.

source: Sets the number of columns used by the curses library when converting a tab character to spaces as it adds the tab to a window.
uk: Встановлює кількість стовпців, які використовуються бібліотекою curses під час перетворення символу табуляції на пробіли, коли вона додає табуляцію до вікна.

source: Set the virtual screen cursor to *y*, *x*. If *y* and *x* are both ``-1``, then :meth:`leaveok <window.leaveok>` is set ``True``.
uk: Встановіть віртуальний екранний курсор на *y*, *x*. Якщо *y* і *x* мають значення ``-1``, тоді :meth:`leaveok <window.leaveok>` встановлюється ``True``.

source: Initialize the terminal. *term* is a string giving the terminal name, or ``None``; if omitted or ``None``, the value of the :envvar:`TERM` environment variable will be used. *fd* is the file descriptor to which any initialization sequences will be sent; if not supplied or ``-1``, the file descriptor for ``sys.stdout`` will be used.
uk: Ініціалізуйте термінал. *термін* - це рядок, що дає назву терміналу, або ``None``; якщо опущено або ``None``, буде використано значення змінної середовища :envvar:`TERM`. *fd* — це дескриптор файлу, до якого будуть надіслані будь-які послідовності ініціалізації; якщо не вказано або ``-1``, буде використано файловий дескриптор для ``sys.stdout``.

source: Must be called if the programmer wants to use colors, and before any other color manipulation routine is called. It is good practice to call this routine right after :func:`initscr`.
uk: Необхідно викликати, якщо програміст хоче використовувати кольори, і перед викликом будь-якої іншої процедури маніпулювання кольором. Рекомендується викликати цю процедуру одразу після :func:`initscr`.

source: :func:`start_color` initializes eight basic colors (black, red, green, yellow, blue, magenta, cyan, and white), and two global variables in the :mod:`curses` module, :const:`COLORS` and :const:`COLOR_PAIRS`, containing the maximum number of colors and color-pairs the terminal can support. It also restores the colors on the terminal to the values they had when the terminal was just turned on.
uk: :func:`start_color` ініціалізує вісім основних кольорів (чорний, червоний, зелений, жовтий, синій, пурпуровий, блакитний і білий) і дві глобальні змінні в модулі :mod:`curses`, :const:`COLORS` і :const:`COLOR_PAIRS`, що містить максимальну кількість кольорів і пар кольорів, які може підтримувати термінал. Він також відновлює кольори на терміналі до значень, які вони мали під час увімкнення терміналу.

source: Return a logical OR of all video attributes supported by the terminal. This information is useful when a curses program needs complete control over the appearance of the screen.
uk: Повертає логічне АБО всіх атрибутів відео, які підтримує термінал. Ця інформація корисна, коли програма curses потребує повного контролю над виглядом екрана.

source: Return the value of the environment variable :envvar:`TERM`, as a bytes object, truncated to 14 characters.
uk: Повертає значення змінної середовища :envvar:`TERM` як об’єкт bytes, скорочений до 14 символів.

source: Return the value of the Boolean capability corresponding to the terminfo capability name *capname* as an integer. Return the value ``-1`` if *capname* is not a Boolean capability, or ``0`` if it is canceled or absent from the terminal description.
uk: Повертає значення логічної можливості, що відповідає назві можливості terminfo *capname* як ціле число. Повертає значення ``-1``, якщо *capname* не є логічною можливістю, або ``0``, якщо вона скасована або відсутня в описі терміналу.

source: Return the value of the numeric capability corresponding to the terminfo capability name *capname* as an integer. Return the value ``-2`` if *capname* is not a numeric capability, or ``-1`` if it is canceled or absent from the terminal description.
uk: Повертає значення числової можливості, що відповідає назві можливості terminfo *capname* як ціле число. Повертає значення ``-2``, якщо *capname* не є числовою можливістю, або ``-1``, якщо вона скасована або відсутня в описі терміналу.

source: Return the value of the string capability corresponding to the terminfo capability name *capname* as a bytes object. Return ``None`` if *capname* is not a terminfo "string capability", or is canceled or absent from the terminal description.
uk: Повертає значення можливості рядка, що відповідає назві можливості terminfo *capname* як об’єкт bytes. Повертає ``None``, якщо *capname* не є "можливістю рядка terminfo", або його скасовано чи немає в описі терміналу.

source: Instantiate the bytes object *str* with the supplied parameters, where *str* should be a parameterized string obtained from the terminfo database. E.g. ``tparm(tigetstr("cup"), 5, 3)`` could result in ``b'\033[6;4H'``, the exact result depending on terminal type.
uk: Створіть екземпляр об’єкта bytes *str* із наданими параметрами, де *str* має бути параметризованим рядком, отриманим із бази даних terminfo. наприклад ``tparm(tigetstr("cup"), 5, 3)`` може привести до ``b'\033[6;4H''``, точний результат залежить від типу терміналу.

source: Specify that the file descriptor *fd* be used for typeahead checking. If *fd* is ``-1``, then no typeahead checking is done.
uk: Вкажіть, що дескриптор файлу *fd* використовується для перевірки наперед. Якщо *fd* дорівнює ``-1``, то попередня перевірка не виконується.

source: The curses library does "line-breakout optimization" by looking for typeahead periodically while updating the screen. If input is found, and it is coming from a tty, the current update is postponed until refresh or doupdate is called again, allowing faster response to commands typed in advance. This function allows specifying a different file descriptor for typeahead checking.
uk: Бібліотека curses виконує "оптимізацію розриву рядків", періодично шукаючи попереднє введення під час оновлення екрана. Якщо вхідні дані знайдено, і вони надходять із tty, поточне оновлення відкладається до повторного виклику refresh або doupdate, що дозволяє швидше відповідати на команди, введені заздалегідь. Ця функція дозволяє вказати інший дескриптор файлу для попередньої перевірки.

source: Return a bytes object which is a printable representation of the character *ch*. Control characters are represented as a caret followed by the character, for example as ``b'^C'``. Printing characters are left as they are.
uk: Повертає об’єкт bytes, який є представленням символу *ch* для друку. Керуючі символи представлені у вигляді каретки, за якою йде символ, наприклад ``b'^C'``. Друковані символи залишаються без змін.

source: Push *ch* so the next :meth:`~window.getch` will return it.
uk: Натисніть *ch*, щоб наступний :meth:`~window.getch` повернув його.

source: Only one *ch* can be pushed before :meth:`!getch` is called.
uk: Лише один *ch* можна ввести перед викликом :meth:`!getch`.

source: Push *ch* so the next :meth:`~window.get_wch` will return it.
uk: Натисніть *ch*, щоб наступний :meth:`~window.get_wch` повернув його.

source: Only one *ch* can be pushed before :meth:`!get_wch` is called.
uk: Лише один *ch* можна надіслати перед викликом :meth:`!get_wch`.

source: Push a :const:`KEY_MOUSE` event onto the input queue, associating the given state data with it.
uk: Надішліть подію :const:`KEY_MOUSE` до черги введення, пов’язавши з нею дані стану.

source: If used, this function should be called before :func:`initscr` or newterm are called. When *flag* is ``False``, the values of lines and columns specified in the terminfo database will be used, even if environment variables :envvar:`LINES` and :envvar:`COLUMNS` (used by default) are set, or if curses is running in a window (in which case default behavior would be to use the window size if :envvar:`LINES` and :envvar:`COLUMNS` are not set).
uk: Якщо використовується, цю функцію слід викликати перед викликом :func:`initscr` або newterm. Якщо *flag* має значення ``False``, використовуватимуться значення рядків і стовпців, указані в базі даних terminfo, навіть якщо встановлено змінні середовища :envvar:`LINES` і :envvar:`COLUMNS` (використовуються за умовчанням). , або якщо curses запущено у вікні (у цьому випадку типовою поведінкою буде використання розміру вікна, якщо :envvar:`LINES` і :envvar:`COLUMNS` не встановлено).

source: Allow use of default values for colors on terminals supporting this feature. Use this to support transparency in your application. The default color is assigned to the color number ``-1``. After calling this function, ``init_pair(x, curses.COLOR_RED, -1)`` initializes, for instance, color pair *x* to a red foreground color on the default background.
uk: Дозволити використовувати значення за замовчуванням для кольорів на терміналах, які підтримують цю функцію. Використовуйте це для підтримки прозорості у своїй програмі. Кольору за замовчуванням призначається номер кольору ``-1``. Після виклику цієї функції ``init_pair(x, curses.COLOR_RED, -1)`` ініціалізує, наприклад, пару кольорів *x* червоним кольором переднього плану на фоні за замовчуванням.

source: Initialize curses and call another callable object, *func*, which should be the rest of your curses-using application. If the application raises an exception, this function will restore the terminal to a sane state before re-raising the exception and generating a traceback. The callable object *func* is then passed the main window 'stdscr' as its first argument, followed by any other arguments passed to :func:`!wrapper`. Before calling *func*, :func:`!wrapper` turns on cbreak mode, turns off echo, enables the terminal keypad, and initializes colors if the terminal has color support. On exit (whether normally or by exception) it restores cooked mode, turns on echo, and disables the terminal keypad.
uk: Ініціалізуйте curses і викличте інший об’єкт, який можна викликати, *func*, який має бути рештою вашої програми, що використовує curses. Якщо програма викликає виняток, ця функція відновить термінал до працездатного стану перед тим, як повторно викликати виняток і створити зворотне відстеження. Викликаний об’єкт *func* потім передається головному вікну "stdscr" як перший аргумент, а потім будь-які інші аргументи, передані :func:`!wrapper`. Перед викликом *func* :func:`!wrapper` вмикає режим cbreak, вимикає відлуння, вмикає клавіатуру терміналу та ініціалізує кольори, якщо термінал підтримує кольори. Після виходу (звичайно чи за винятком) він відновлює режим приготування, вмикає відлуння та вимикає клавіатуру терміналу.

source: Window Objects
uk: Об'єкти вікна

source: Window objects, as returned by :func:`initscr` and :func:`newwin` above, have the following methods and attributes:
uk: Об’єкти Window, які повертаються :func:`initscr` і :func:`newwin` вище, мають такі методи та атрибути:

source: Paint character *ch* at ``(y, x)`` with attributes *attr*, overwriting any character previously painted at that location. By default, the character position and attributes are the current settings for the window object.
uk: Зафарбувати символ *ch* у ``(y, x)`` за допомогою атрибутів *attr*, перезаписавши будь-який символ, попередньо намальований у цьому місці. За замовчуванням позиція символу та атрибути є поточними налаштуваннями об’єкта вікна.

source: Writing outside the window, subwindow, or pad raises a :exc:`curses.error`. Attempting to write to the lower right corner of a window, subwindow, or pad will cause an exception to be raised after the character is printed.
uk: Написання поза вікном, підвікном або блокнотом викликає :exc:`curses.error`. Спроба написати в нижньому правому куті вікна, підвікна або панелі призведе до виникнення виняткової ситуації після друку символу.

source: Paint at most *n* characters of the character string *str* at ``(y, x)`` with attributes *attr*, overwriting anything previously on the display.
uk: Зафарбуйте щонайбільше *n* символів рядка символів *str* у ``(y, x)`` з атрибутами *attr*, перезаписуючи все, що було раніше на дисплеї.

source: Paint the character string *str* at ``(y, x)`` with attributes *attr*, overwriting anything previously on the display.
uk: Зафарбуйте рядок символів *str* у ``(y, x)`` атрибутами *attr*, перезаписуючи все, що було раніше на дисплеї.

source: Writing outside the window, subwindow, or pad raises :exc:`curses.error`. Attempting to write to the lower right corner of a window, subwindow, or pad will cause an exception to be raised after the string is printed.
uk: Написання поза вікном, підвікном або блокнотом викликає :exc:`curses.error`. Спроба написати в нижньому правому куті вікна, підвікна або панелі призведе до виникнення виняткової ситуації після друку рядка.

source: A `bug in ncurses <https://bugs.python.org/issue35924>`_, the backend for this Python module, can cause SegFaults when resizing windows. This is fixed in ncurses-6.1-20190511. If you are stuck with an earlier ncurses, you can avoid triggering this if you do not call :func:`addstr` with a *str* that has embedded newlines. Instead, call :func:`addstr` separately for each line.
uk: `Помилка в ncurses <https://bugs.python.org/issue35924>`_, серверній частині цього модуля Python, може викликати SegFaults під час зміни розміру вікон. Це виправлено в ncurses-6.1-20190511. Якщо ви застрягли на попередній ncurses, ви можете уникнути цього, якщо не викличете :func:`addstr` з *str*, який має вбудовані символи нового рядка. Натомість викликайте :func:`addstr` окремо для кожного рядка.

source: Remove attribute *attr* from the "background" set applied to all writes to the current window.
uk: Видалити атрибут *attr* із набору "фон", застосованого до всіх записів у поточному вікні.

source: Add attribute *attr* from the "background" set applied to all writes to the current window.
uk: Додайте атрибут *attr* із набору "фон", застосованого до всіх записів у поточному вікні.

source: Set the "background" set of attributes to *attr*. This set is initially ``0`` (no attributes).
uk: Встановіть для набору атрибутів "фон" значення *attr*. Цей набір початково ``0`` (без атрибутів).

source: Set the background property of the window to the character *ch*, with attributes *attr*. The change is then applied to every character position in that window:
uk: Встановіть для властивості фону вікна символ *ch* з атрибутами *attr*. Потім зміни застосовуються до кожної позиції символу у цьому вікні:

source: The attribute of every character in the window is changed to the new background attribute.
uk: Атрибут кожного символу у вікні змінено на новий атрибут фону.

source: Wherever the former background character appears, it is changed to the new background character.
uk: Усюди, де з’являється попередній фоновий символ, він змінюється на новий фоновий символ.

source: Set the window's background. A window's background consists of a character and any combination of attributes. The attribute part of the background is combined (OR'ed) with all non-blank characters that are written into the window. Both the character and attribute parts of the background are combined with the blank characters. The background becomes a property of the character and moves with the character through any scrolling and insert/delete line/character operations.
uk: Встановити фон вікна. Фон вікна складається з символу та будь-якої комбінації атрибутів. Атрибутна частина фону поєднується (оперується АБО) з усіма непробілами, які записуються у вікно. Частини фону символів і атрибутів поєднуються з порожніми символами. Фон стає властивістю символу та переміщується разом із символом під час будь-яких операцій прокручування та вставлення/видалення рядків/символів.

source: Draw a border around the edges of the window. Each parameter specifies the character to use for a specific part of the border; see the table below for more details.
uk: Намалюйте рамку по краях вікна. Кожен параметр визначає символ для використання для певної частини рамки; дивіться таблицю нижче для більш детальної інформації.

source: A ``0`` value for any parameter will cause the default character to be used for that parameter. Keyword parameters can *not* be used. The defaults are listed in this table:
uk: Значення ``0`` для будь-якого параметра призведе до використання символу за замовчуванням для цього параметра. Параметри ключових слів *не* можна використовувати. Значення за замовчуванням наведено в цій таблиці:

source: Parameter
uk: Параметр

source: Description
uk: опис

source: Default value
uk: Значення за замовчуванням

source: Left side
uk: Ліва сторона

source: Right side
uk: Права сторона

source: Top
uk: Топ

source: Bottom
uk: Дно

source: Upper-left corner
uk: Лівий верхній кут

source: Upper-right corner
uk: Правий верхній кут

source: Bottom-left corner
uk: Нижній лівий кут

source: Bottom-right corner
uk: Правий нижній кут

source: Similar to :meth:`border`, but both *ls* and *rs* are *vertch* and both *ts* and *bs* are *horch*. The default corner characters are always used by this function.
uk: Подібно до :meth:`border`, але *ls* і *rs* є *vertch*, а *ts* і *bs* є *horch*. Ця функція завжди використовує стандартні кутові символи.
