Repository: python/python-docs-uk
Catalog: library/curses.po
Languages: uk

source: Mark all lines in the window as unchanged since the last call to :meth:`refresh`.
uk: Позначте всі рядки у вікні як незмінні з часу останнього виклику :meth:`refresh`.

source: Constants
uk: Константи

source: The :mod:`curses` module defines the following data members:
uk: Модуль :mod:`curses` визначає такі елементи даних:

source: Some curses routines that return an integer, such as :meth:`~window.getch`, return :const:`ERR` upon failure.
uk: Деякі процедури curses, які повертають ціле число, наприклад :meth:`~window.getch`, повертають :const:`ERR` у разі помилки.

source: Some curses routines that return an integer, such as :func:`napms`, return :const:`OK` upon success.
uk: Деякі процедури curses, які повертають ціле число, наприклад :func:`napms`, повертають :const:`OK` після успіху.

source: A named tuple containing the three components of the ncurses library version: *major*, *minor*, and *patch*. All values are integers. The components can also be accessed by name, so ``curses.ncurses_version[0]`` is equivalent to ``curses.ncurses_version.major`` and so on.
uk: Іменований кортеж, що містить три компоненти версії бібліотеки ncurses: *major*, *minor* і *patch*. Усі значення є цілими. До компонентів також можна отримати доступ за іменем, тому ``curses.ncurses_version[0]`` еквівалентно ``curses.ncurses_version.major`` і так далі.

source: Availability: if the ncurses library is used.
uk: Доступність: якщо використовується бібліотека ncurses.

source: Some constants are available to specify character cell attributes. The exact constants available are system dependent.
uk: Деякі константи доступні для визначення атрибутів клітинок символів. Доступні точні константи залежать від системи.

source: Attribute
uk: Атрибут

source: Meaning
uk: Значення

source: Alternate character set mode
uk: Режим альтернативного набору символів

source: Blink mode
uk: Режим моргання

source: Bold mode
uk: Жирний режим

source: Dim mode
uk: Режим затемнення

source: Invisible or blank mode
uk: Невидимий або порожній режим

source: Italic mode
uk: Курсив

source: Normal attribute
uk: Нормальний атрибут

source: Protected mode
uk: Захищений режим

source: Reverse background and foreground colors
uk: Зворотні кольори фону та переднього плану

source: Standout mode
uk: Режим видатного

source: Underline mode
uk: Режим підкреслення

source: Horizontal highlight
uk: Горизонтальне виділення

source: Left highlight
uk: Виділення зліва

source: Low highlight
uk: Низьке виділення

source: Right highlight
uk: Виділіть праворуч

source: Top highlight
uk: Верхня підсвітка

source: Vertical highlight
uk: Вертикальне виділення

source: ``A_ITALIC`` was added.
uk: Додано ``A_ITALIC``.

source: Several constants are available to extract corresponding attributes returned by some methods.
uk: Для отримання відповідних атрибутів, які повертаються деякими методами, доступно кілька констант.

source: Bit-mask
uk: Біт-маска

source: Bit-mask to extract attributes
uk: Бітова маска для вилучення атрибутів

source: Bit-mask to extract a character
uk: Бітова маска для вилучення символу

source: Bit-mask to extract color-pair field information
uk: Бітова маска для отримання інформації про поле пари кольорів

source: Keys are referred to by integer constants with names starting with ``KEY_``. The exact keycaps available are system dependent.
uk: На ключі посилаються цілі константи з іменами, що починаються з ``KEY_``. Точні доступні клавіші залежать від системи.

source: Key constant
uk: Ключова константа

source: Key
uk: ключ

source: Minimum key value
uk: Мінімальне значення ключа

source: Break key (unreliable)
uk: Розривний ключ (ненадійний)

source: Down-arrow
uk: Стрілка вниз

source: Up-arrow
uk: Стрілка вгору

source: Left-arrow
uk: Стрілка вліво

source: Right-arrow
uk: Стрілка вправо

source: Home key (upward+left arrow)
uk: Клавіша "Додому" (стрілка вгору+ліворуч)

source: Backspace (unreliable)
uk: Backspace (ненадійно)

source: Function keys. Up to 64 function keys are supported.
uk: Функціональні клавіші. Підтримується до 64 функціональних клавіш.

source: Value of function key *n*
uk: Значення функціональної клавіші *n*

source: Delete line
uk: Видалити рядок

source: Insert line
uk: Вставити рядок

source: Delete character
uk: Видалити символ

source: Insert char or enter insert mode
uk: Вставити символ або перейти в режим вставки

source: Exit insert char mode
uk: Вийти з режиму вставки символів

source: Clear screen
uk: Очистити екран

source: Clear to end of screen
uk: Очистити до кінця екрана

source: Clear to end of line
uk: Очистити до кінця рядка

source: Scroll 1 line forward
uk: Прокрутити на 1 рядок вперед

source: Scroll 1 line backward (reverse)
uk: Прокрутити на 1 рядок назад (назад)

source: Next page
uk: Наступна сторінка

source: Previous page
uk: Попередня сторінка

source: Set tab
uk: Встановити вкладку

source: Clear tab
uk: Очистити вкладку

source: Clear all tabs
uk: Очистити всі вкладки

source: Enter or send (unreliable)
uk: Введіть або надішліть (ненадійно)

source: Soft (partial) reset (unreliable)
uk: М'яке (часткове) скидання (ненадійне)

source: Reset or hard reset (unreliable)
uk: Скидання або апаратне скидання (ненадійно)

source: Print
uk: Роздрукувати

source: Home down or bottom (lower left)
uk: Головна внизу або внизу (внизу ліворуч)

source: Upper left of keypad
uk: Верхній лівий кут клавіатури

source: Upper right of keypad
uk: Правий верхній кут клавіатури

source: Center of keypad
uk: Центр клавіатури

source: Lower left of keypad
uk: Ліворуч внизу від клавіатури

source: Lower right of keypad
uk: Правий нижній кут клавіатури

source: Back tab
uk: Задня вкладка

source: Beg (beginning)
uk: Бег (початок)

source: Cancel
uk: Скасувати

source: Close
uk: Закрити

source: Cmd (command)
uk: Cmd (команда)

source: Copy
uk: Копія

source: Create
uk: Створити

source: End
uk: Кінець

source: Exit
uk: Вихід

source: Find
uk: знайти

source: Help
uk: Довідка

source: Mark
uk: Марк

source: Message
uk: повідомлення

source: Move
uk: рухатися

source: Next
uk: Далі

source: Open
uk: ВІДЧИНЕНО

source: Options
uk: Опції

source: Prev (previous)
uk: Prev (попередній)

source: Redo
uk: Повторити

source: Ref (reference)
uk: Ref (посилання)

source: Refresh
uk: Оновити

source: Replace
uk: Замінити

source: Restart
uk: Перезапустіть

source: Resume
uk: Резюме

source: Save
uk: зберегти

source: Shifted Beg (beginning)
uk: Зміщений початок (початок)

source: Shifted Cancel
uk: Скасування зі зсувом

source: Shifted Command
uk: Зміщена команда

source: Shifted Copy
uk: Зміщена копія

source: Shifted Create
uk: Зсув Створити

source: Shifted Delete char
uk: Зміщений Видалити символ

source: Shifted Delete line
uk: Зміщений рядок "Видалити".

source: Select
uk: Виберіть

source: Shifted End
uk: Зміщений кінець

source: Shifted Clear line
uk: Зміщена чиста лінія

source: Shifted Exit
uk: Зміщений вихід

source: Shifted Find
uk: Зміщений пошук

source: Shifted Help
uk: Зміщена довідка

source: Shifted Home
uk: Перенесено додому

source: Shifted Input
uk: Зміщений вхід

source: Shifted Left arrow
uk: Зміщена стрілка вліво

source: Shifted Message
uk: Зміщене повідомлення

source: Shifted Move
uk: Зміщений хід

source: Shifted Next
uk: Зсув Далі

source: Shifted Options
uk: Зміщені параметри

source: Shifted Prev
uk: Зміщено Поперед

source: Shifted Print
uk: Зміщений друк

source: Shifted Redo
uk: Зміщений повтор

source: Shifted Replace
uk: Зміщена заміна

source: Shifted Right arrow
uk: Зміщена стрілка вправо

source: Shifted Resume
uk: Зміщене резюме

source: Shifted Save
uk: Зміщене збереження

source: Shifted Suspend
uk: Зміщене призупинення

source: Shifted Undo
uk: Зміщене скасування

source: Suspend
uk: Призупинити

source: Undo
uk: Скасувати

source: Mouse event has occurred
uk: Сталася подія миші

source: Terminal resize event
uk: Подія зміни розміру терміналу

source: Maximum key value
uk: Максимальне значення ключа

source: Keycap
uk: Клавіатура

source: Constant
uk: Постійний

source: The following table lists characters from the alternate character set. These are inherited from the VT100 terminal, and will generally be available on software emulations such as X terminals. When there is no graphic available, curses falls back on a crude printable ASCII approximation.
uk: У наведеній нижче таблиці наведено символи з альтернативного набору символів. Вони успадковані від терміналу VT100 і, як правило, будуть доступні на програмних емуляціях, таких як термінали X. Якщо немає доступної графіки, curses повертається до грубого наближення для друку ASCII.

source: These are available only after :func:`initscr` has been called.
uk: Вони доступні лише після виклику :func:`initscr`.

source: ACS code
uk: код ACS

source: alternate name for upper right corner
uk: альтернативна назва для верхнього правого кута

source: solid square block
uk: суцільний квадратний блок

source: board of squares
uk: дошка з квадратів

source: alternate name for horizontal line
uk: альтернативна назва горизонтальної лінії

source: alternate name for upper left corner
uk: альтернативна назва для верхнього лівого кута

source: alternate name for top tee
uk: альтернативна назва верхнього трійника

source: bottom tee
uk: нижній трійник

source: bullet
uk: куля

source: checker board (stipple)
uk: шашка (пунктир)

source: arrow pointing down
uk: стрілка вниз

source: degree symbol
uk: символ ступеня

source: diamond
uk: діамант

source: greater-than-or-equal-to
uk: більший або рівний

source: horizontal line
uk: горизонтальна лінія

source: lantern symbol
uk: символ ліхтаря

source: left arrow
uk: стрілка вліво

source: less-than-or-equal-to
uk: менше або дорівнює

source: lower left-hand corner
uk: нижній лівий кут

source: lower right-hand corner
uk: нижній правий кут

source: left tee
uk: лівий трійник

source: not-equal sign
uk: знак нерівності

source: letter pi
uk: літера пі

source: plus-or-minus sign
uk: знак плюс або мінус

source: big plus sign
uk: великий плюс

source: right arrow
uk: стрілка вправо

source: right tee
uk: правий трійник

source: scan line 1
uk: сканувати рядок 1

source: scan line 3
uk: рядок сканування 3

source: scan line 7
uk: сканувати рядок 7

source: scan line 9
uk: сканувати рядок 9

source: alternate name for lower right corner
uk: альтернативна назва для нижнього правого кута

source: alternate name for vertical line
uk: альтернативна назва для вертикальної лінії

source: alternate name for right tee
uk: альтернативна назва правого трійника

source: alternate name for lower left corner
uk: альтернативна назва для нижнього лівого кута

source: alternate name for bottom tee
uk: альтернативна назва нижнього трійника

source: alternate name for left tee
uk: альтернативна назва лівого трійника

source: alternate name for crossover or big plus
uk: альтернативна назва для кросовера або великий плюс

source: pound sterling
uk: фунт стерлінгів

source: top tee
uk: верхній трійник

source: up arrow
uk: стрілка вгору

source: upper left corner
uk: верхній лівий кут

source: upper right corner
uk: верхній правий кут

source: vertical line
uk: вертикальна лінія

source: The following table lists the predefined colors:
uk: У наведеній нижче таблиці перераховано попередньо визначені кольори:

source: Color
uk: колір

source: Black
uk: чорний

source: Blue
uk: Синій

source: Cyan (light greenish blue)
uk: Блакитний (світло-зеленувато-блакитний)

source: Green
uk: Зелений

source: Magenta (purplish red)
uk: Маджента (багряно-червоний)

source: Red
uk: Червоний

source: White
uk: Білий

source: Yellow
uk: Жовтий

source: :mod:`curses.textpad` --- Text input widget for curses programs
uk: :mod:`curses.textpad` --- Віджет введення тексту для програм curses

source: The :mod:`curses.textpad` module provides a :class:`Textbox` class that handles elementary text editing in a curses window, supporting a set of keybindings resembling those of Emacs (thus, also of Netscape Navigator, BBedit 6.x, FrameMaker, and many other programs). The module also provides a rectangle-drawing function useful for framing text boxes or for other purposes.
uk: Модуль :mod:`curses.textpad` надає клас :class:`Textbox`, який обробляє елементарне редагування тексту у вікні curses, підтримуючи набір прив’язок клавіш, схожих на Emacs (тобто, також у Netscape Navigator, BBedit 6.x). , FrameMaker та багато інших програм). Модуль також надає функцію малювання прямокутника, корисну для обрамлення текстових полів або для інших цілей.

source: The module :mod:`curses.textpad` defines the following function:
uk: Модуль :mod:`curses.textpad` визначає таку функцію:

source: Draw a rectangle. The first argument must be a window object; the remaining arguments are coordinates relative to that window. The second and third arguments are the y and x coordinates of the upper left hand corner of the rectangle to be drawn; the fourth and fifth arguments are the y and x coordinates of the lower right hand corner. The rectangle will be drawn using VT100/IBM PC forms characters on terminals that make this possible (including xterm and most other software terminal emulators). Otherwise it will be drawn with ASCII dashes, vertical bars, and plus signs.
uk: Намалюйте прямокутник. Першим аргументом має бути вікно; решта аргументів є координатами відносно цього вікна. Другим і третім аргументами є координати y і x верхнього лівого кута прямокутника, який буде намальовано; четвертий і п'ятий аргументи - це координати y і x у нижньому правому куті. Прямокутник буде намальовано за допомогою символів форм VT100/IBM PC на терміналах, які це роблять можливим (включаючи xterm та більшість інших програмних емуляторів терміналу). Інакше він буде намальований з дефісами ASCII, вертикальними смужками та знаками плюса.

source: Textbox objects
uk: Об'єкти текстового поля

source: You can instantiate a :class:`Textbox` object as follows:
uk: Ви можете створити об’єкт :class:`Textbox` наступним чином:

source: Return a textbox widget object. The *win* argument should be a curses :ref:`window <curses-window-objects>` object in which the textbox is to be contained. The edit cursor of the textbox is initially located at the upper left hand corner of the containing window, with coordinates ``(0, 0)``. The instance's :attr:`stripspaces` flag is initially on.
uk: Повертає об’єкт віджета текстового поля. Аргумент *win* має бути об’єктом curses :ref:`window <curses-window-objects>`, у якому має міститися текстове поле. Курсор редагування текстового поля спочатку розташований у верхньому лівому куті вікна, що містить, із координатами ``(0, 0)``. Прапор :attr:`stripspaces` екземпляра спочатку ввімкнено.

source: :class:`Textbox` objects have the following methods:
uk: Об’єкти :class:`Textbox` мають такі методи:

source: This is the entry point you will normally use. It accepts editing keystrokes until one of the termination keystrokes is entered. If *validator* is supplied, it must be a function. It will be called for each keystroke entered with the keystroke as a parameter; command dispatch is done on the result. This method returns the window contents as a string; whether blanks in the window are included is affected by the :attr:`stripspaces` attribute.
uk: Це точка входу, яку ви зазвичай використовуєте. Він дозволяє редагувати натискання клавіш, доки не буде введено одне з натискань клавіш завершення. Якщо вказано *валідатор*, це має бути функція. Він буде викликаний для кожного натискання клавіші, введеного з натисканням клавіші як параметром; відправка команди виконується за результатом. Цей метод повертає вміст вікна у вигляді рядка; атрибут :attr:`stripspaces` впливає на те, чи будуть включені порожні місця у вікні.

source: Process a single command keystroke. Here are the supported special keystrokes:
uk: Обробка натискання однієї команди. Ось підтримувані спеціальні натискання клавіш:

source: Keystroke
uk: натискання клавіші

source: Action
uk: Дія

source: Go to left edge of window.
uk: Перейдіть до лівого краю вікна.

source: Cursor left, wrapping to previous line if appropriate.
uk: Курсор ліворуч, перенесення на попередній рядок, якщо потрібно.

source: Delete character under cursor.
uk: Видалити символ під курсором.

source: Go to right edge (stripspaces off) or end of line (stripspaces on).
uk: Перейдіть до правого краю (пробілі вимкнено) або кінець рядка (пробілі увімкнено).

source: Cursor right, wrapping to next line when appropriate.
uk: Курсор праворуч, перенесення на наступний рядок, якщо потрібно.

source: Terminate, returning the window contents.
uk: Завершити, повернувши вміст вікна.

source: Delete character backward.
uk: Видалити символ назад.

source: Terminate if the window is 1 line, otherwise insert newline.
uk: Завершити, якщо вікно складається з 1 рядка, інакше вставити новий рядок.

source: If line is blank, delete it, otherwise clear to end of line.
uk: Якщо рядок порожній, видаліть його, інакше очистіть до кінця рядка.

source: Refresh screen.
uk: Оновити екран.

source: Cursor down; move down one line.
uk: Курсор вниз; переміститися на один рядок вниз.

source: Insert a blank line at cursor location.
uk: Вставте порожній рядок у місці курсора.

source: Cursor up; move up one line.
uk: Курсор вгору; переміститися на один рядок вгору.

source: Move operations do nothing if the cursor is at an edge where the movement is not possible. The following synonyms are supported where possible:
uk: Операції переміщення нічого не роблять, якщо курсор знаходиться на краю, де переміщення неможливе. За можливості підтримуються такі синоніми:

source: All other keystrokes are treated as a command to insert the given character and move right (with line wrapping).
uk: Усі інші натискання клавіш сприймаються як команда вставити вказаний символ і переміститися вправо (з переносом рядка).

source: Return the window contents as a string; whether blanks in the window are included is affected by the :attr:`stripspaces` member.
uk: Повертає вміст вікна у вигляді рядка; член :attr:`stripspaces` впливає на те, чи будуть включені порожні місця у вікні.

source: This attribute is a flag which controls the interpretation of blanks in the window. When it is on, trailing blanks on each line are ignored; any cursor motion that would land the cursor on a trailing blank goes to the end of that line instead, and trailing blanks are stripped when the window contents are gathered.
uk: Цей атрибут є прапорцем, який керує інтерпретацією прогалин у вікні. Коли його ввімкнено, пробіли в кінці кожного рядка ігноруються; будь-який рух курсору, який призведе до переходу курсора на порожнє місце в кінці, натомість переходить у кінець цього рядка, а кінцеві порожні місця видаляються, коли вміст вікна збирається.
