Repository: python/python-docs-uk
Catalog: library/curses.po
Languages: uk

source: Set the attributes of *num* characters at the current cursor position, or at position ``(y, x)`` if supplied. If *num* is not given or is ``-1``, the attribute will be set on all the characters to the end of the line. This function moves cursor to position ``(y, x)`` if supplied. The changed line will be touched using the :meth:`touchline` method so that the contents will be redisplayed by the next window refresh.
uk: Встановіть атрибути *кількість* символів у поточній позиції курсору або в позиції ``(y, x)``, якщо надається. Якщо *num* не вказано або має значення ``-1``, атрибут буде встановлено для всіх символів до кінця рядка. Ця функція переміщує курсор у позицію ``(y, x)``, якщо вона надана. Змінений рядок буде торкнуто за допомогою методу :meth:`touchline`, щоб вміст знову відображався під час наступного оновлення вікна.

source: Like :meth:`erase`, but also cause the whole window to be repainted upon next call to :meth:`refresh`.
uk: Подібно до :meth:`erase`, але також призведе до перефарбування всього вікна під час наступного виклику :meth:`refresh`.

source: If *flag* is ``True``, the next call to :meth:`refresh` will clear the window completely.
uk: Якщо *flag* має значення ``True``, наступний виклик :meth:`refresh` повністю очистить вікно.

source: Erase from cursor to the end of the window: all lines below the cursor are deleted, and then the equivalent of :meth:`clrtoeol` is performed.
uk: Видалити від курсора до кінця вікна: усі рядки під курсором видаляються, а потім виконується еквівалент :meth:`clrtoeol`.

source: Erase from cursor to the end of the line.
uk: Стерти від курсора до кінця рядка.

source: Update the current cursor position of all the ancestors of the window to reflect the current cursor position of the window.
uk: Оновити поточну позицію курсору всіх предків вікна, щоб відобразити поточну позицію курсору вікна.

source: Delete any character at ``(y, x)``.
uk: Видаліть будь-який символ у ``(y, x)``.

source: Delete the line under the cursor. All following lines are moved up by one line.
uk: Видалити рядок під курсором. Усі наступні рядки переносяться на один рядок вгору.

source: An abbreviation for "derive window", :meth:`derwin` is the same as calling :meth:`subwin`, except that *begin_y* and *begin_x* are relative to the origin of the window, rather than relative to the entire screen. Return a window object for the derived window.
uk: Абревіатура від "вихідного вікна", :meth:`derwin` — це те саме, що виклик :meth:`subwin`, за винятком того, що *begin_y* і *begin_x* відносяться до джерела вікна, а не до всього екран. Повертає віконний об’єкт для похідного вікна.

source: Add character *ch* with attribute *attr*, and immediately call :meth:`refresh` on the window.
uk: Додайте символ *ch* з атрибутом *attr* і негайно викличте :meth:`refresh` у вікні.

source: Test whether the given pair of screen-relative character-cell coordinates are enclosed by the given window, returning ``True`` or ``False``. It is useful for determining what subset of the screen windows enclose the location of a mouse event.
uk: Перевірте, чи задана пара координат символів клітинок, що відносяться до екрану, включена даним вікном, повертаючи ``True`` або ``False``. Це корисно для визначення того, яка підмножина вікон екрана містить місце події миші.

source: Previously it returned ``1`` or ``0`` instead of ``True`` or ``False``.
uk: Раніше він повертав ``1`` або ``0`` замість ``True`` або ``False``.

source: Clear the window.
uk: Очистіть вікно.

source: Return the given window's current background character/attribute pair.
uk: Повертає поточну пару символ/атрибут тла даного вікна.

source: Get a character. Note that the integer returned does *not* have to be in ASCII range: function keys, keypad keys and so on are represented by numbers higher than 255. In no-delay mode, return ``-1`` if there is no input, otherwise wait until a key is pressed.
uk: Отримати персонажа. Зауважте, що повернуте ціле число *не* має бути в діапазоні ASCII: функціональні клавіші, клавіші клавіатури тощо позначаються числами, вищими за 255. У режимі без затримки поверніть ``-1``, якщо немає введення. , інакше зачекайте, доки не буде натиснуто клавішу.

source: Get a wide character. Return a character for most keys, or an integer for function keys, keypad keys, and other special keys. In no-delay mode, raise an exception if there is no input.
uk: Отримайте широкий характер. Повертає символ для більшості клавіш або ціле число для функціональних клавіш, клавіш клавіатури та інших спеціальних клавіш. У режимі без затримки викликати виняток, якщо немає введення.

source: Get a character, returning a string instead of an integer, as :meth:`getch` does. Function keys, keypad keys and other special keys return a multibyte string containing the key name. In no-delay mode, raise an exception if there is no input.
uk: Отримати символ, повертаючи рядок замість цілого числа, як це робить :meth:`getch`. Функціональні клавіші, клавіші клавіатури та інші спеціальні клавіші повертають багатобайтовий рядок, що містить назву клавіші. У режимі без затримки викликати виняток, якщо немає введення.

source: Return a tuple ``(y, x)`` of the height and width of the window.
uk: Повертає кортеж ``(y, x)`` висоти та ширини вікна.

source: Return the beginning coordinates of this window relative to its parent window as a tuple ``(y, x)``. Return ``(-1, -1)`` if this window has no parent.
uk: Повертає початкові координати цього вікна відносно його батьківського вікна як кортеж ``(y, x)``. Повертає ``(-1, -1)``, якщо це вікно не має батьківського елемента.

source: Read a bytes object from the user, with primitive line editing capacity.
uk: Читання байтового об’єкта від користувача з примітивною можливістю редагування рядків.

source: Return a tuple ``(y, x)`` of current cursor position relative to the window's upper-left corner.
uk: Повертає кортеж ``(y, x)`` поточної позиції курсору відносно лівого верхнього кута вікна.

source: Display a horizontal line starting at ``(y, x)`` with length *n* consisting of the character *ch*.
uk: Відобразити горизонтальну лінію, починаючи з ``(y, x)`` довжиною *n*, яка складається з символу *ch*.

source: If *flag* is ``False``, curses no longer considers using the hardware insert/delete character feature of the terminal; if *flag* is ``True``, use of character insertion and deletion is enabled. When curses is first initialized, use of character insert/delete is enabled by default.
uk: Якщо *flag* має значення ``False``, curses більше не розглядає використання апаратної функції вставки/видалення символів терміналу; якщо *flag* має значення ``True``, увімкнено використання вставки та видалення символів. Коли curses вперше ініціалізовано, використання вставки/видалення символів увімкнено за замовчуванням.

source: If *flag* is ``True``, :mod:`curses` will try and use hardware line editing facilities. Otherwise, line insertion/deletion are disabled.
uk: Якщо *flag* має значення ``True``, :mod:`curses` спробує використати апаратні засоби редагування рядків. В іншому випадку вставлення/видалення рядків буде вимкнено.

source: If *flag* is ``True``, any change in the window image automatically causes the window to be refreshed; you no longer have to call :meth:`refresh` yourself. However, it may degrade performance considerably, due to repeated calls to wrefresh. This option is disabled by default.
uk: Якщо *flag* має значення ``True``, будь-яка зміна зображення вікна автоматично спричиняє оновлення вікна; вам більше не потрібно викликати :meth:`refresh` самостійно. Однак це може значно погіршити продуктивність через повторні виклики оновлення. Цей параметр вимкнено за замовчуванням.

source: Return the character at the given position in the window. The bottom 8 bits are the character proper, and upper bits are the attributes.
uk: Повернути символ у задану позицію у вікні. Нижні 8 бітів є власне символом, а верхні біти є атрибутами.

source: Paint character *ch* at ``(y, x)`` with attributes *attr*, moving the line from position *x* right by one character.
uk: Зафарбуйте символ *ch* у ``(y, x)`` з атрибутами *attr*, перемістивши лінію з позиції *x* праворуч на один символ.

source: Insert *nlines* lines into the specified window above the current line. The *nlines* bottom lines are lost. For negative *nlines*, delete *nlines* lines starting with the one under the cursor, and move the remaining lines up. The bottom *nlines* lines are cleared. The current cursor position remains the same.
uk: Вставте рядки *nlines* у вказане вікно над поточним рядком. Нижні рядки *nlines* втрачені. Для негативних *nlines* видаліть *nlines* рядки, починаючи з того, що знаходиться під курсором, і перемістіть інші рядки вгору. Нижні рядки *nlines* очищаються. Поточна позиція курсору залишається незмінною.

source: Insert a blank line under the cursor. All following lines are moved down by one line.
uk: Вставте порожній рядок під курсором. Усі наступні рядки пересуваються на один рядок вниз.

source: Insert a character string (as many characters as will fit on the line) before the character under the cursor, up to *n* characters. If *n* is zero or negative, the entire string is inserted. All characters to the right of the cursor are shifted right, with the rightmost characters on the line being lost. The cursor position does not change (after moving to *y*, *x*, if specified).
uk: Вставте рядок символів (стільки символів, скільки поміститься в рядку) перед символом під курсором, до *n* символів. Якщо *n* дорівнює нулю або від’ємне значення, вставляється весь рядок. Усі символи праворуч від курсору зсуваються праворуч, а крайні праві символи в рядку втрачаються. Положення курсору не змінюється (після переходу на *y*, *x*, якщо вказано).

source: Insert a character string (as many characters as will fit on the line) before the character under the cursor. All characters to the right of the cursor are shifted right, with the rightmost characters on the line being lost. The cursor position does not change (after moving to *y*, *x*, if specified).
uk: Вставте рядок символів (стільки символів, скільки поміститься в рядку) перед символом під курсором. Усі символи праворуч від курсору зсуваються праворуч, а крайні праві символи в рядку втрачаються. Положення курсору не змінюється (після переходу на *y*, *x*, якщо вказано).

source: Return a bytes object of characters, extracted from the window starting at the current cursor position, or at *y*, *x* if specified. Attributes are stripped from the characters. If *n* is specified, :meth:`instr` returns a string at most *n* characters long (exclusive of the trailing NUL).
uk: Повертає байтовий об’єкт із символами, отриманими з вікна, починаючи з поточної позиції курсору або з *y*, *x*, якщо вказано. Атрибути позбавлені символів. Якщо вказано *n*, :meth:`instr` повертає рядок довжиною щонайбільше *n* символів (за винятком кінцевого NUL).

source: Return ``True`` if the specified line was modified since the last call to :meth:`refresh`; otherwise return ``False``. Raise a :exc:`curses.error` exception if *line* is not valid for the given window.
uk: Повертає ``True``, якщо вказаний рядок було змінено після останнього виклику :meth:`refresh`; інакше повертає ``False``. Викликати виняток :exc:`curses.error`, якщо *рядок* недійсний для даного вікна.

source: Return ``True`` if the specified window was modified since the last call to :meth:`refresh`; otherwise return ``False``.
uk: Повертає ``True``, якщо вказане вікно було змінено після останнього виклику :meth:`refresh`; інакше повертає ``False``.

source: If *flag* is ``True``, escape sequences generated by some keys (keypad, function keys) will be interpreted by :mod:`curses`. If *flag* is ``False``, escape sequences will be left as is in the input stream.
uk: Якщо *flag* має значення ``True``, escape-послідовності, згенеровані деякими клавішами (клавіатура, функціональні клавіші), будуть інтерпретовані :mod:`curses`. Якщо *flag* має значення ``False``, керуючі послідовності будуть залишені у вхідному потоці.

source: If *flag* is ``True``, cursor is left where it is on update, instead of being at "cursor position." This reduces cursor movement where possible. If possible the cursor will be made invisible.
uk: Якщо *flag* має значення ``True``, курсор залишається там, де він знаходиться під час оновлення, замість того, щоб бути в "положенні курсору". Це зменшує рух курсору, де це можливо. Якщо можливо, курсор буде зроблено невидимим.

source: If *flag* is ``False``, cursor will always be at "cursor position" after an update.
uk: Якщо *flag* має значення ``False``, курсор завжди буде в "положенні курсора" після оновлення.

source: Move cursor to ``(new_y, new_x)``.
uk: Перемістіть курсор до ``(новий_y, новий_x)``.

source: Move the window inside its parent window. The screen-relative parameters of the window are not changed. This routine is used to display different parts of the parent window at the same physical position on the screen.
uk: Перемістити вікно всередину його батьківського вікна. Відносні до екрана параметри вікна не змінюються. Ця процедура використовується для відображення різних частин батьківського вікна в одній фізичній позиції на екрані.

source: Move the window so its upper-left corner is at ``(new_y, new_x)``.
uk: Перемістіть вікно так, щоб його верхній лівий кут знаходився на ``(new_y, new_x)``.

source: If *flag* is ``True``, :meth:`getch` will be non-blocking.
uk: Якщо *flag* має значення ``True``, :meth:`getch` буде неблокуючим.

source: If *flag* is ``True``, escape sequences will not be timed out.
uk: Якщо *flag* має значення ``True``, escape-послідовності не будуть вичерпані.

source: If *flag* is ``False``, after a few milliseconds, an escape sequence will not be interpreted, and will be left in the input stream as is.
uk: Якщо *flag* має значення ``False``, через кілька мілісекунд escape-послідовність не буде інтерпретовано та залишиться у вхідному потоці як є.

source: Mark for refresh but wait. This function updates the data structure representing the desired state of the window, but does not force an update of the physical screen. To accomplish that, call :func:`doupdate`.
uk: Позначте для оновлення, але зачекайте. Ця функція оновлює структуру даних, що представляє потрібний стан вікна, але не примусово оновлює фізичний екран. Для цього викличте :func:`doupdate`.

source: Overlay the window on top of *destwin*. The windows need not be the same size, only the overlapping region is copied. This copy is non-destructive, which means that the current background character does not overwrite the old contents of *destwin*.
uk: Накладіть вікно поверх *destwin*. Вікна не обов’язково мають бути однакового розміру, копіюється лише область, що перекривається. Ця копія є неруйнівною, що означає, що поточний фоновий символ не перезаписує старий вміст *destwin*.

source: To get fine-grained control over the copied region, the second form of :meth:`overlay` can be used. *sminrow* and *smincol* are the upper-left coordinates of the source window, and the other variables mark a rectangle in the destination window.
uk: Щоб отримати детальний контроль над скопійованою областю, можна використовувати другу форму :meth:`overlay`. *sminrow* і *smincol* — верхні ліві координати вікна джерела, а інші змінні позначають прямокутник у вікні призначення.

source: Overwrite the window on top of *destwin*. The windows need not be the same size, in which case only the overlapping region is copied. This copy is destructive, which means that the current background character overwrites the old contents of *destwin*.
uk: Перезаписати вікно поверх *destwin*. Вікна не обов’язково мають бути однакового розміру, у цьому випадку копіюється лише область, що перекривається. Ця копія є деструктивною, що означає, що поточний фоновий символ перезаписує старий вміст *destwin*.

source: To get fine-grained control over the copied region, the second form of :meth:`overwrite` can be used. *sminrow* and *smincol* are the upper-left coordinates of the source window, the other variables mark a rectangle in the destination window.
uk: Щоб отримати детальний контроль над скопійованою областю, можна використати другу форму :meth:`overwrite`. *sminrow* і *smincol* — верхні ліві координати вікна джерела, інші змінні позначають прямокутник у вікні призначення.

source: Write all data associated with the window into the provided file object. This information can be later retrieved using the :func:`getwin` function.
uk: Запишіть усі дані, пов’язані з вікном, у наданий файловий об’єкт. Пізніше цю інформацію можна отримати за допомогою функції :func:`getwin`.

source: Indicate that the *num* screen lines, starting at line *beg*, are corrupted and should be completely redrawn on the next :meth:`refresh` call.
uk: Вказує, що *num* рядків екрана, починаючи з рядка *beg*, пошкоджені та мають бути повністю перемальовані під час наступного виклику :meth:`refresh`.

source: Touch the entire window, causing it to be completely redrawn on the next :meth:`refresh` call.
uk: Торкніться всього вікна, щоб його повністю перемалювати під час наступного виклику :meth:`refresh`.

source: Update the display immediately (sync actual screen with previous drawing/deleting methods).
uk: Негайно оновіть дисплей (синхронізуйте фактичний екран із попередніми методами малювання/видалення).

source: The 6 optional arguments can only be specified when the window is a pad created with :func:`newpad`. The additional parameters are needed to indicate what part of the pad and screen are involved. *pminrow* and *pmincol* specify the upper left-hand corner of the rectangle to be displayed in the pad. *sminrow*, *smincol*, *smaxrow*, and *smaxcol* specify the edges of the rectangle to be displayed on the screen. The lower right-hand corner of the rectangle to be displayed in the pad is calculated from the screen coordinates, since the rectangles must be the same size. Both rectangles must be entirely contained within their respective structures. Negative values of *pminrow*, *pmincol*, *sminrow*, or *smincol* are treated as if they were zero.
uk: 6 необов’язкових аргументів можна вказати лише тоді, коли вікно є панеллю, створеною за допомогою :func:`newpad`. Додаткові параметри потрібні, щоб вказати, яка частина панелі та екрану задіяна. *pminrow* і *pmincol* визначають верхній лівий кут прямокутника, який буде відображатися на панелі. *sminrow*, *smincol*, *smaxrow* і *smaxcol* визначають краї прямокутника, який буде відображатися на екрані. Правий нижній кут прямокутника, який відображатиметься на панелі, обчислюється за координатами на екрані, оскільки прямокутники мають бути однакового розміру. Обидва прямокутники мають повністю міститися у відповідних структурах. Від’ємні значення *pminrow*, *pmincol*, *sminrow* або *smincol* розглядаються як нульові.

source: Reallocate storage for a curses window to adjust its dimensions to the specified values. If either dimension is larger than the current values, the window's data is filled with blanks that have the current background rendition (as set by :meth:`bkgdset`) merged into them.
uk: Перерозподіліть сховище для вікна curses, щоб налаштувати його розміри до вказаних значень. Якщо будь-який з розмірів більший за поточні значення, дані вікна заповнюються пробілами, у яких об’єднано поточне фонове відтворення (як установлено :meth:`bkgdset`).

source: Scroll the screen or scrolling region upward by *lines* lines.
uk: Прокрутіть екран або область прокручування вгору на *лінії* лінії.

source: Control what happens when the cursor of a window is moved off the edge of the window or scrolling region, either as a result of a newline action on the bottom line, or typing the last character of the last line. If *flag* is ``False``, the cursor is left on the bottom line. If *flag* is ``True``, the window is scrolled up one line. Note that in order to get the physical scrolling effect on the terminal, it is also necessary to call :meth:`idlok`.
uk: Керуйте тим, що відбувається, коли курсор вікна переміщується за межі вікна чи області прокручування в результаті дії нового рядка в нижньому рядку або введення останнього символу останнього рядка. Якщо *flag* має значення ``False``, курсор залишається в нижньому рядку. Якщо *flag* має значення ``True``, вікно прокручується на один рядок вгору. Зауважте, що для того, щоб отримати ефект фізичної прокрутки на терміналі, також необхідно викликати :meth:`idlok`.

source: Set the scrolling region from line *top* to line *bottom*. All scrolling actions will take place in this region.
uk: Встановіть область прокручування від рядка *верхнього* до рядка *нижнього*. Усі дії прокручування відбуватимуться в цьому регіоні.

source: Turn off the standout attribute. On some terminals this has the side effect of turning off all attributes.
uk: Вимкніть атрибут standout. На деяких терміналах це має побічним ефектом вимкнення всіх атрибутів.

source: Turn on attribute *A_STANDOUT*.
uk: Увімкніть атрибут *A_STANDOUT*.

source: Return a sub-window, whose upper-left corner is at ``(begin_y, begin_x)``, and whose width/height is *ncols*/*nlines*.
uk: Повертає підвікно, верхній лівий кут якого знаходиться в ``(begin_y, begin_x)``, а ширина/висота *ncols*/*nlines*.

source: By default, the sub-window will extend from the specified position to the lower right corner of the window.
uk: За замовчуванням підвікно розширюватиметься від зазначеної позиції до нижнього правого кута вікна.

source: Touch each location in the window that has been touched in any of its ancestor windows. This routine is called by :meth:`refresh`, so it should almost never be necessary to call it manually.
uk: Торкніться кожного місця у вікні, яке було торкано в будь-якому з попередніх вікон. Ця процедура викликається :meth:`refresh`, тому майже ніколи не потрібно викликати її вручну.

source: If *flag* is ``True``, then :meth:`syncup` is called automatically whenever there is a change in the window.
uk: Якщо *flag* має значення ``True``, тоді :meth:`syncup` викликається автоматично щоразу, коли відбувається зміна у вікні.

source: Touch all locations in ancestors of the window that have been changed in the window.
uk: Торкніться всіх розташувань у предках вікна, які були змінені у вікні.

source: Set blocking or non-blocking read behavior for the window. If *delay* is negative, blocking read is used (which will wait indefinitely for input). If *delay* is zero, then non-blocking read is used, and :meth:`getch` will return ``-1`` if no input is waiting. If *delay* is positive, then :meth:`getch` will block for *delay* milliseconds, and return ``-1`` if there is still no input at the end of that time.
uk: Встановити блокуючу або неблокуючу поведінку читання для вікна. Якщо *затримка* має від’ємне значення, використовується блокування читання (що нескінченно чекатиме введення). Якщо *затримка* дорівнює нулю, то використовується неблокуюче читання, і :meth:`getch` поверне ``-1``, якщо введення не очікується. Якщо *затримка* позитивна, тоді :meth:`getch` блокуватиметься на *затримку* мілісекунд і повертатиме ``-1``, якщо в кінці цього часу все ще немає введення.

source: Pretend *count* lines have been changed, starting with line *start*. If *changed* is supplied, it specifies whether the affected lines are marked as having been changed (*changed*\ ``=True``) or unchanged (*changed*\ ``=False``).
uk: Уявіть, що *кількість* рядків змінено, починаючи з рядка *початок*. Якщо вказано *changed*, це визначає, чи позначаються відповідні рядки як змінені (*changed*\ ``=True``) чи незмінені (*changed*\ ``=False``).

source: Pretend the whole window has been changed, for purposes of drawing optimizations.
uk: Уявіть, що все вікно було змінено з метою оптимізації малюнка.
