Repository: python/python-docs-uk
Catalog: library/curses_ascii.po
Languages: uk

source: The :mod:`curses.ascii` module supplies name constants for ASCII characters and functions to test membership in various ASCII character classes. The constants supplied are names for control characters as follows:
uk: Модуль :mod:`curses.ascii` надає константи імен для символів ASCII і функції для перевірки належності до різних класів символів ASCII. Надані константи є такими іменами керуючих символів:

source: Name
uk: Ім'я

source: Meaning
uk: Значення

source: Start of heading, console interrupt
uk: Початок заголовка, переривання консолі

source: Start of text
uk: Початок тексту

source: End of text
uk: Кінець тексту

source: End of transmission
uk: Кінець передачі

source: Enquiry, goes with :const:`ACK` flow control
uk: Запит, іде з керуванням потоком :const:`ACK`

source: Acknowledgement
uk: Подяка

source: Bell
uk: дзвоник

source: Tab
uk: вкладка

source: Alias for :const:`TAB`: "Horizontal tab"
uk: Псевдонім для :const:`TAB`: "Горизонтальна вкладка"

source: Line feed
uk: Передача рядка

source: Alias for :const:`LF`: "New line"
uk: Псевдонім для :const:`LF`: "Новий рядок"

source: Vertical tab
uk: Вертикальна вкладка

source: Form feed
uk: Подача форми

source: Carriage return
uk: Повернення каретки

source: Shift-out, begin alternate character set
uk: Shift-out, початок альтернативного набору символів

source: Shift-in, resume default character set
uk: Shift-in, відновлення стандартного набору символів

source: Data-link escape
uk: Вихід каналу даних

source: XON, for flow control
uk: XON, для керування потоком

source: Device control 2, block-mode flow control
uk: Управління пристроєм 2, блочне керування потоком

source: XOFF, for flow control
uk: XOFF, для керування потоком

source: Device control 4
uk: Контроль пристрою 4

source: Negative acknowledgement
uk: Негативне визнання

source: Synchronous idle
uk: Синхронний холостий хід

source: End transmission block
uk: Кінцевий блок передачі

source: Cancel
uk: Скасувати

source: End of medium
uk: Кінець середнього

source: Substitute
uk: Замінник

source: Escape
uk: Втеча

source: File separator
uk: Роздільник файлів

source: Group separator
uk: Роздільник груп

source: Record separator, block-mode terminator
uk: Роздільник записів, термінатор блокового режиму

source: Unit separator
uk: Роздільник одиниць

source: Space
uk: космос

source: Delete
uk: Видалити

source: Note that many of these have little practical significance in modern usage. The mnemonics derive from teleprinter conventions that predate digital computers.
uk: Зверніть увагу, що багато з них не мають практичного значення в сучасному використанні. Мнемоніка походить від телепринтерів, які передували цифровим комп’ютерам.

source: The module supplies the following functions, patterned on those in the standard C library:
uk: Модуль надає такі функції, створені за зразком стандартної бібліотеки C:

source: Checks for an ASCII alphanumeric character; it is equivalent to ``isalpha(c) or isdigit(c)``.
uk: Перевіряє наявність буквено-цифрового символу ASCII; це еквівалентно ``isalpha(c) або isdigit(c)``.

source: Checks for an ASCII alphabetic character; it is equivalent to ``isupper(c) or islower(c)``.
uk: Перевіряє наявність літер ASCII; це еквівалентно ``isupper(c) або islower(c)``.

source: Checks for a character value that fits in the 7-bit ASCII set.
uk: Перевіряє значення символу, яке відповідає 7-бітовому набору ASCII.

source: Checks for an ASCII whitespace character; space or horizontal tab.
uk: Перевіряє пробіл ASCII; пробіл або горизонтальну табуляцію.

source: Checks for an ASCII control character (in the range 0x00 to 0x1f or 0x7f).
uk: Перевіряє контрольний символ ASCII (у діапазоні від 0x00 до 0x1f або 0x7f).

source: Checks for an ASCII decimal digit, ``'0'`` through ``'9'``. This is equivalent to ``c in string.digits``.
uk: Перевіряє десяткову цифру ASCII від ``'0'`` до ``'9'``. Це еквівалентно ``c в string.digits``.

source: Checks for ASCII any printable character except space.
uk: Перевіряє ASCII будь-який друкований символ, крім пробілу.

source: Checks for an ASCII lower-case character.
uk: Перевіряє символ ASCII у нижньому регістрі.

source: Checks for any ASCII printable character including space.
uk: Перевіряє будь-який друкований символ ASCII, включаючи пробіл.

source: Checks for any printable ASCII character which is not a space or an alphanumeric character.
uk: Перевіряє будь-який друкований символ ASCII, який не є пробілом або буквено-цифровим символом.

source: Checks for ASCII white-space characters; space, line feed, carriage return, form feed, horizontal tab, vertical tab.
uk: Перевіряє пробіли ASCII; пробіл, переведення рядка, повернення каретки, передача форми, горизонтальна табуляція, вертикальна табуляція.

source: Checks for an ASCII uppercase letter.
uk: Перевіряє наявність великої літери ASCII.

source: Checks for an ASCII hexadecimal digit. This is equivalent to ``c in string.hexdigits``.
uk: Перевіряє шістнадцяткову цифру ASCII. Це еквівалентно ``c в string.hexdigits``.

source: Checks for an ASCII control character (ordinal values 0 to 31).
uk: Перевіряє контрольний символ ASCII (порядкові значення від 0 до 31).

source: Checks for a non-ASCII character (ordinal values 0x80 and above).
uk: Перевіряє символи, відмінні від ASCII (порядкові значення 0x80 і вище).

source: These functions accept either integers or single-character strings; when the argument is a string, it is first converted using the built-in function :func:`ord`.
uk: Ці функції приймають або цілі числа, або односимвольні рядки; коли аргумент є рядком, він спочатку перетворюється за допомогою вбудованої функції :func:`ord`.

source: Note that all these functions check ordinal bit values derived from the character of the string you pass in; they do not actually know anything about the host machine's character encoding.
uk: Зауважте, що всі ці функції перевіряють порядкові значення бітів, отримані від символу рядка, який ви передаєте; вони насправді нічого не знають про кодування символів хост-машини.

source: The following two functions take either a single-character string or integer byte value; they return a value of the same type.
uk: Наступні дві функції приймають односимвольний рядок або ціле байтове значення; вони повертають значення того самого типу.

source: Return the ASCII value corresponding to the low 7 bits of *c*.
uk: Повертає значення ASCII, що відповідає молодшим 7 бітам *c*.

source: Return the control character corresponding to the given character (the character bit value is bitwise-anded with 0x1f).
uk: Повертає керуючий символ, що відповідає заданому символу (значення біта символу порозрядно додається до 0x1f).

source: Return the 8-bit character corresponding to the given ASCII character (the character bit value is bitwise-ored with 0x80).
uk: Повертає 8-бітовий символ, що відповідає даному символу ASCII (значення біта символу порозрядно упорядковується з 0x80).

source: The following function takes either a single-character string or integer value; it returns a string.
uk: Наступна функція приймає односимвольний рядок або ціле число; він повертає рядок.

source: Return a string representation of the ASCII character *c*. If *c* is printable, this string is the character itself. If the character is a control character (0x00--0x1f) the string consists of a caret (``'^'``) followed by the corresponding uppercase letter. If the character is an ASCII delete (0x7f) the string is ``'^?'``. If the character has its meta bit (0x80) set, the meta bit is stripped, the preceding rules applied, and ``'!'`` prepended to the result.
uk: Повертає рядкове представлення символу ASCII *c*. Якщо *c* можна надрукувати, цей рядок є самим символом. Якщо символ є керуючим (0x00--0x1f), рядок складається з каретки (``'^'``), за якою йде відповідна велика літера. Якщо символ видалення ASCII (0x7f), рядок має вигляд ``'^?''``. Якщо для символу встановлено мета-біт (0x80), мета-біт видаляється, застосовуються попередні правила та перед результатом додається ``'!'``.

source: A 33-element string array that contains the ASCII mnemonics for the thirty-two ASCII control characters from 0 (NUL) to 0x1f (US), in order, plus the mnemonic ``SP`` for the space character.
uk: 33-елементний рядковий масив, який містить мнемоніку ASCII для тридцяти двох керуючих символів ASCII від 0 (NUL) до 0x1f (США), по порядку, а також мнемоніку SP для символу пробілу.

source: ! (exclamation)
uk: ! (знак оклику)
