Repository: python/python-docs-uk
Catalog: library/curses_panel.po
Languages: uk

source: Panels are windows with the added feature of depth, so they can be stacked on top of each other, and only the visible portions of each window will be displayed. Panels can be added, moved up or down in the stack, and removed.
uk: Панелі — це вікна з додатковою функцією глибини, тому їх можна накладати одна на одну, і відображатимуться лише видимі частини кожного вікна. Панелі можна додавати, переміщувати вгору або вниз у стеку та видаляти.

source: Functions
uk: Функції

source: The module :mod:`curses.panel` defines the following functions:
uk: Модуль :mod:`curses.panel` визначає такі функції:

source: Returns the bottom panel in the panel stack.
uk: Повертає нижню панель у стеку панелей.

source: Returns a panel object, associating it with the given window *win*. Be aware that you need to keep the returned panel object referenced explicitly. If you don't, the panel object is garbage collected and removed from the panel stack.
uk: Повертає об’єкт панелі, пов’язуючи його з даним вікном *win*. Майте на увазі, що ви повинні зберегти явне посилання на повернутий об’єкт панелі. Якщо ви цього не зробите, об’єкт панелі збирається як сміття та видаляється зі стека панелей.

source: Returns the top panel in the panel stack.
uk: Повертає верхню панель у стеку панелей.

source: Updates the virtual screen after changes in the panel stack. This does not call :func:`curses.doupdate`, so you'll have to do this yourself.
uk: Оновлює віртуальний екран після змін у стеку панелей. Це не викликає :func:`curses.doupdate`, тому вам доведеться зробити це самостійно.

source: Panel Objects
uk: Об'єкти панелі

source: Panel objects, as returned by :func:`new_panel` above, are windows with a stacking order. There's always a window associated with a panel which determines the content, while the panel methods are responsible for the window's depth in the panel stack.
uk: Об’єкти панелі, які повертає :func:`new_panel` вище, є вікнами з порядком укладання. Завжди існує вікно, пов’язане з панеллю, яке визначає вміст, тоді як методи панелі відповідають за глибину вікна в стеку панелей.

source: Panel objects have the following methods:
uk: Панельні об’єкти мають такі методи:

source: Returns the panel above the current panel.
uk: Повертає панель над поточною панеллю.

source: Returns the panel below the current panel.
uk: Повертає панель під поточною панеллю.

source: Push the panel to the bottom of the stack.
uk: Натисніть панель на дно стосу.

source: Returns ``True`` if the panel is hidden (not visible), ``False`` otherwise.
uk: Повертає ``True``, якщо панель прихована (невидима), ``False`` інакше.

source: Hide the panel. This does not delete the object, it just makes the window on screen invisible.
uk: Сховати панель. Це не видаляє об’єкт, а лише робить вікно на екрані невидимим.

source: Move the panel to the screen coordinates ``(y, x)``.
uk: Перемістіть панель до екранних координат ``(y, x)``.

source: Change the window associated with the panel to the window *win*.
uk: Змініть вікно, пов’язане з панеллю, на вікно *win*.

source: Set the panel's user pointer to *obj*. This is used to associate an arbitrary piece of data with the panel, and can be any Python object.
uk: Встановіть покажчик користувача панелі на *obj*. Це використовується для зв’язування довільної частини даних із панеллю та може бути будь-яким об’єктом Python.

source: Display the panel (which might have been hidden).
uk: Відобразити панель (яка могла бути прихованою).

source: Push panel to the top of the stack.
uk: Посуньте панель до верхньої частини стека.

source: Returns the user pointer for the panel. This might be any Python object.
uk: Повертає вказівник користувача для панелі. Це може бути будь-який об’єкт Python.

source: Returns the window object associated with the panel.
uk: Повертає об’єкт вікна, пов’язаний із панеллю.
