Repository: python/python-docs-uk
Catalog: library/datetime.po
Languages: uk

source: Return the current local date.
uk: Повернути поточну місцеву дату.

source: This is equivalent to ``date.fromtimestamp(time.time())``.
uk: Це еквівалентно ``date.fromtimestamp(time.time())``.

source: Return the local date corresponding to the POSIX timestamp, such as is returned by :func:`time.time`.
uk: Повертає місцеву дату, що відповідає мітці часу POSIX, наприклад, яку повертає :func:`time.time`.

source: This may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` function, and :exc:`OSError` on :c:func:`localtime` failure. It's common for this to be restricted to years from 1970 through 2038. Note that on non-POSIX systems that include leap seconds in their notion of a timestamp, leap seconds are ignored by :meth:`fromtimestamp`.
uk: Це може спричинити помилку :exc:`OverflowError`, якщо позначка часу виходить за межі діапазону значень, які підтримує функція C :c:func:`localtime`, і :exc:`OSError` у :c:func:`localtime` невдача. Зазвичай це обмежується роками з 1970 по 2038 рік. Зауважте, що в системах без POSIX, які включають високосні секунди в своє поняття позначки часу, високосні секунди ігноруються :meth:`fromtimestamp`.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` function. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`localtime` failure.
uk: Викликайте :exc:`OverflowError` замість :exc:`ValueError`, якщо позначка часу виходить за межі діапазону значень, які підтримує функція C :c:func:`localtime` платформи. Викликати :exc:`OSError` замість :exc:`ValueError` у разі помилки :c:func:`localtime`.

source: Return the date corresponding to the proleptic Gregorian ordinal, where January 1 of year 1 has ordinal 1.
uk: Повертає дату, що відповідає пролептичному григоріанському порядковому номеру, де 1 січня 1 року має порядковий номер 1.

source: :exc:`ValueError` is raised unless ``1 <= ordinal <= date.max.toordinal()``. For any date *d*, ``date.fromordinal(d.toordinal()) == d``.
uk: :exc:`ValueError` викликається, якщо не ``1 <= ordinal <= date.max.toordinal()``. Для будь-якої дати *d* ``date.fromordinal(d.toordinal()) == d``.

source: Return a :class:`date` corresponding to the ISO calendar date specified by year, week and day. This is the inverse of the function :meth:`date.isocalendar`.
uk: Повертає :class:`date`, що відповідає календарній даті ISO, визначеній роком, тижнем і днем. Це зворотна функція :meth:`date.isocalendar`.

source: The earliest representable date, ``date(MINYEAR, 1, 1)``.
uk: Найраніша дата, яку можна представити, ``date(MINYEAR, 1, 1)``.

source: The latest representable date, ``date(MAXYEAR, 12, 31)``.
uk: Остання представлена дата, ``date(MAXYEAR, 12, 31)``.

source: The smallest possible difference between non-equal date objects, ``timedelta(days=1)``.
uk: Найменша можлива різниця між об’єктами нерівних дат, ``timedelta(days=1)``.

source: Between :const:`MINYEAR` and :const:`MAXYEAR` inclusive.
uk: Між :const:`MINYEAR` і :const:`MAXYEAR` включно.

source: Between 1 and 12 inclusive.
uk: Від 1 до 12 включно.

source: Between 1 and the number of days in the given month of the given year.
uk: Від 1 до числа днів у даному місяці даного року.

source: ``date2 = date1 + timedelta``
uk: ``дата2 = дата1 + дельта часу``

source: *date2* is ``timedelta.days`` days removed from *date1*. (1)
uk: *date2* — це ``timedelta.days`` дні, видалені з *date1*. (1)

source: ``date2 = date1 - timedelta``
uk: ``дата2 = дата1 - дельта часу``

source: Computes *date2* such that ``date2 + timedelta == date1``. (2)
uk: Обчислює *date2* таким чином, що ``date2 + timedelta == date1``. (2)

source: ``timedelta = date1 - date2``
uk: ``timedelta = дата1 - дата2``

source: ``date1 < date2``
uk: ``дата1 < дата2``

source: *date1* is considered less than *date2* when *date1* precedes *date2* in time. (4)
uk: *date1* вважається меншим за *date2*, якщо *date1* передує *date2* за часом. (4)

source: *date2* is moved forward in time if ``timedelta.days > 0``, or backward if ``timedelta.days < 0``. Afterward ``date2 - date1 == timedelta.days``. ``timedelta.seconds`` and ``timedelta.microseconds`` are ignored. :exc:`OverflowError` is raised if ``date2.year`` would be smaller than :const:`MINYEAR` or larger than :const:`MAXYEAR`.
uk: *date2* пересувається вперед у часі, якщо ``timedelta.days > 0``, або назад, ``timedelta.days < 0``. Після цього ``date2 - date1 == timedelta.days``. ``timedelta.seconds`` і ``timedelta.microseconds`` ігноруються. :exc:`OverflowError` виникає, якщо ``date2.year`` буде меншим за :const:`MINYEAR` або більшим за :const:`MAXYEAR`.

source: ``timedelta.seconds`` and ``timedelta.microseconds`` are ignored.
uk: ``timedelta.seconds`` і ``timedelta.microseconds`` ігноруються.

source: This is exact, and cannot overflow. timedelta.seconds and timedelta.microseconds are 0, and date2 + timedelta == date1 after.
uk: Це точно і не може переповнюватися. timedelta.seconds і timedelta.microseconds дорівнюють 0, а date2 + timedelta == date1 після.

source: In other words, ``date1 < date2`` if and only if ``date1.toordinal() < date2.toordinal()``. Date comparison raises :exc:`TypeError` if the other comparand isn't also a :class:`date` object. However, ``NotImplemented`` is returned instead if the other comparand has a :meth:`timetuple` attribute. This hook gives other kinds of date objects a chance at implementing mixed-type comparison. If not, when a :class:`date` object is compared to an object of a different type, :exc:`TypeError` is raised unless the comparison is ``==`` or ``!=``. The latter cases return :const:`False` or :const:`True`, respectively.
uk: Іншими словами, ``date1 < date2`` тоді і тільки тоді, коли ``date1.toordinal() < date2.toordinal()``. Порівняння дат викликає :exc:`TypeError`, якщо інший компаранд не є також об’єктом :class:`date`. Однак натомість повертається ``NotImplemented``, якщо інший компаранд має атрибут :meth:`timetuple`. Цей хук дає іншим видам об’єктів дати можливість реалізувати порівняння змішаного типу. Якщо ні, коли об’єкт :class:`date` порівнюється з об’єктом іншого типу, виникає :exc:`TypeError`, якщо порівняння не ``==`` або ``!=``. Останні випадки повертають :const:`False` або :const:`True` відповідно.

source: In Boolean contexts, all :class:`date` objects are considered to be true.
uk: У логічних контекстах усі об’єкти :class:`date` вважаються істинними.

source: Return a date with the same value, except for those parameters given new values by whichever keyword arguments are specified.
uk: Повертає дату з тим самим значенням, за винятком тих параметрів, яким надано нові значення за будь-якими аргументами ключового слова.

source: Example::
uk: Приклад::

source: Return a :class:`time.struct_time` such as returned by :func:`time.localtime`.
uk: Повертає :class:`time.struct_time`, наприклад, повертає :func:`time.localtime`.

source: The hours, minutes and seconds are 0, and the DST flag is -1.
uk: Години, хвилини та секунди дорівнюють 0, а позначка літнього часу дорівнює -1.

source: ``d.timetuple()`` is equivalent to::
uk: ``d.timetuple()`` еквівалентний:

source: where ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` is the day number within the current year starting with ``1`` for January 1st.
uk: де ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` — це номер дня в поточному році, починаючи з ``1`` для 1 січня.

source: Return the proleptic Gregorian ordinal of the date, where January 1 of year 1 has ordinal 1. For any :class:`date` object *d*, ``date.fromordinal(d.toordinal()) == d``.
uk: Повертає пролептичний григоріанський порядковий номер дати, де 1 січня року 1 має порядковий номер 1. Для будь-якого об’єкта :class:`date` *d*, ``date.fromordinal(d.toordinal()) == d``.

source: Return the day of the week as an integer, where Monday is 0 and Sunday is 6. For example, ``date(2002, 12, 4).weekday() == 2``, a Wednesday. See also :meth:`isoweekday`.
uk: Повертає день тижня як ціле число, де понеділок — 0, а неділя — 6. Наприклад, ``date(2002, 12, 4).weekday() == 2``, середа. Дивіться також :meth:`isoweekday`.

source: Return the day of the week as an integer, where Monday is 1 and Sunday is 7. For example, ``date(2002, 12, 4).isoweekday() == 3``, a Wednesday. See also :meth:`weekday`, :meth:`isocalendar`.
uk: Повертає день тижня як ціле число, де понеділок — 1, а неділя — 7. Наприклад, ``date(2002, 12, 4).isoweekday() == 3``, середа. Дивіться також :meth:`weekday`, :meth:`isocalendar`.

source: Return a :term:`named tuple` object with three components: ``year``, ``week`` and ``weekday``.
uk: Повертає об’єкт :term:`named tuple` із трьома компонентами: ``year``, ``week`` і ``weekday``.

source: The ISO calendar is a widely used variant of the Gregorian calendar. [#]_
uk: Календар ISO є широко використовуваним варіантом григоріанського календаря. [#]_

source: The ISO year consists of 52 or 53 full weeks, and where a week starts on a Monday and ends on a Sunday. The first week of an ISO year is the first (Gregorian) calendar week of a year containing a Thursday. This is called week number 1, and the ISO year of that Thursday is the same as its Gregorian year.
uk: Рік ISO складається з 52 або 53 повних тижнів, де тиждень починається в понеділок і закінчується в неділю. Перший тиждень року ISO — це перший (григоріанський) календарний тиждень року, що містить четвер. Це називається тижнем номер 1, і рік ISO того четверга такий же, як його григоріанський рік.

source: For example, 2004 begins on a Thursday, so the first week of ISO year 2004 begins on Monday, 29 Dec 2003 and ends on Sunday, 4 Jan 2004::
uk: Наприклад, 2004 рік починається в четвер, тому перший тиждень 2004 року ISO починається в понеділок, 29 грудня 2003 року, і закінчується в неділю, 4 січня 2004 року:

source: Result changed from a tuple to a :term:`named tuple`.
uk: Результат змінено з кортежу на :term:`named tuple`.

source: Return a string representing the date in ISO 8601 format, ``YYYY-MM-DD``::
uk: Повертає рядок, що представляє дату у форматі ISO 8601, ``РРРР-ММ-ДД``::

source: For a date *d*, ``str(d)`` is equivalent to ``d.isoformat()``.
uk: Для дати *d* ``str(d)`` еквівалентно ``d.isoformat()``.

source: Return a string representing the date::
uk: Повертає рядок, що представляє дату::

source: ``d.ctime()`` is equivalent to::
uk: ``d.ctime()`` еквівалентний:

source: on platforms where the native C :c:func:`ctime` function (which :func:`time.ctime` invokes, but which :meth:`date.ctime` does not invoke) conforms to the C standard.
uk: на платформах, де рідна функція C :c:func:`ctime` (яку :func:`time.ctime` викликає, але яку :meth:`date.ctime` не викликає) відповідає стандарту C.

source: Return a string representing the date, controlled by an explicit format string. Format codes referring to hours, minutes or seconds will see 0 values. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
uk: Повертає рядок, що представляє дату, керовану рядком явного формату. Коди формату, які стосуються годин, хвилин або секунд, матимуть значення 0. Щоб отримати повний список директив форматування, перегляньте :ref:`strftime-strptime-behavior`.

source: Same as :meth:`.date.strftime`. This makes it possible to specify a format string for a :class:`.date` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
uk: Те саме, що :meth:`.date.strftime`. Це дає змогу вказати рядок формату для об’єкта :class:`.date` у :ref:`форматованих рядкових літералах <f-strings>` і при використанні :meth:`str.format`. Щоб отримати повний список директив форматування, перегляньте :ref:`strftime-strptime-behavior`.

source: Examples of Usage: :class:`date`
uk: Приклади використання: :class:`date`

source: Example of counting days to an event::
uk: Приклад підрахунку днів до події::

source: More examples of working with :class:`date`:
uk: Ще приклади роботи з :class:`date`:

source: :class:`.datetime` Objects
uk: :class:`.datetime` Об'єкти

source: A :class:`.datetime` object is a single object containing all the information from a :class:`date` object and a :class:`.time` object.
uk: Об’єкт :class:`.datetime` — це єдиний об’єкт, який містить всю інформацію з об’єктів :class:`date` і :class:`.time`.

source: Like a :class:`date` object, :class:`.datetime` assumes the current Gregorian calendar extended in both directions; like a :class:`.time` object, :class:`.datetime` assumes there are exactly 3600\*24 seconds in every day.
uk: Як і об’єкт :class:`date`, :class:`.datetime` передбачає поточний григоріанський календар, розширений в обох напрямках; як і об’єкт :class:`.time`, :class:`.datetime` припускає, що кожен день становить рівно 3600\*24 секунди.

source: Constructor:
uk: Конструктор:

source: The *year*, *month* and *day* arguments are required. *tzinfo* may be ``None``, or an instance of a :class:`tzinfo` subclass. The remaining arguments must be integers in the following ranges:
uk: Аргументи *рік*, *місяць* і *день* є обов’язковими. *tzinfo* може бути ``None`` або екземпляром підкласу :class:`tzinfo`. Решта аргументів мають бути цілими числами в таких діапазонах:

source: ``MINYEAR <= year <= MAXYEAR``,
uk: ``MINYEAR <= рік <= MAXYEAR``,

source: ``1 <= month <= 12``,
uk: ``1 <= місяць <= 12``,

source: ``1 <= day <= number of days in the given month and year``,
uk: ``1 <= день <= кількість днів у заданому місяці та році``,

source: ``0 <= hour < 24``,
uk: ``0 <= година < 24``,

source: ``0 <= minute < 60``,
uk: ``0 <= хвилина < 60``,

source: ``0 <= second < 60``,
uk: ``0 <= секунда < 60``,

source: ``0 <= microsecond < 1000000``,
uk: ``0 <= мікросекунда < 1000000``,

source: ``fold in [0, 1]``.
uk: ``згорнути [0, 1]``.

source: Added the ``fold`` argument.
uk: Додано аргумент ``fold``.

source: Return the current local datetime, with :attr:`.tzinfo` ``None``.
uk: Повертає поточну локальну дату та час за допомогою :attr:`.tzinfo` ``None``.

source: Equivalent to::
uk: Дорівнює::

source: See also :meth:`now`, :meth:`fromtimestamp`.
uk: Дивіться також :meth:`now`, :meth:`fromtimestamp`.

source: This method is functionally equivalent to :meth:`now`, but without a ``tz`` parameter.
uk: Цей метод функціонально еквівалентний :meth:`now`, але без параметра ``tz``.

source: Return the current local date and time.
uk: Повернути поточну місцеву дату й час.

source: If optional argument *tz* is ``None`` or not specified, this is like :meth:`today`, but, if possible, supplies more precision than can be gotten from going through a :func:`time.time` timestamp (for example, this may be possible on platforms supplying the C :c:func:`gettimeofday` function).
uk: Якщо необов’язковий аргумент *tz* має значення ``None`` або не вказано, це схоже на :meth:`today`, але, якщо можливо, надає більшу точність, ніж можна отримати, пройшовши через :func:`time.time` мітка часу (наприклад, це можливо на платформах, що забезпечують функцію C :c:func:`gettimeofday`).

source: If *tz* is not ``None``, it must be an instance of a :class:`tzinfo` subclass, and the current date and time are converted to *tz*’s time zone.
uk: Якщо *tz* не є ``None``, він має бути екземпляром підкласу :class:`tzinfo`, а поточні дата й час перетворюються на часовий пояс *tz*.

source: This function is preferred over :meth:`today` and :meth:`utcnow`.
uk: Цій функції надається перевага над :meth:`today` і :meth:`utcnow`.

source: Return the current UTC date and time, with :attr:`.tzinfo` ``None``.
uk: Повертає поточну дату й час за UTC за допомогою :attr:`.tzinfo` ``None``.

source: This is like :meth:`now`, but returns the current UTC date and time, as a naive :class:`.datetime` object. An aware current UTC datetime can be obtained by calling ``datetime.now(timezone.utc)``. See also :meth:`now`.
uk: Це схоже на :meth:`now`, але повертає поточну дату та час у форматі UTC як простий об’єкт :class:`.datetime`. Відомий поточний UTC datetime можна отримати, викликавши ``datetime.now(timezone.utc)``. Дивіться також :meth:`now`.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC. As such, the recommended way to create an object representing the current time in UTC is by calling ``datetime.now(timezone.utc)``.
uk: Оскільки наївні об’єкти ``datetime`` розглядаються багатьма методами ``datetime`` як місцевий час, бажано використовувати відомі дати для представлення часу в UTC. Таким чином, рекомендований спосіб створити об’єкт, що представляє поточний час у UTC, — це викликати ``datetime.now(timezone.utc)``.

source: Return the local date and time corresponding to the POSIX timestamp, such as is returned by :func:`time.time`. If optional argument *tz* is ``None`` or not specified, the timestamp is converted to the platform's local date and time, and the returned :class:`.datetime` object is naive.
uk: Повертає локальну дату й час, що відповідають мітці часу POSIX, наприклад, повертає :func:`time.time`. Якщо необов’язковий аргумент *tz* має значення ``None`` або не вказано, позначка часу перетворюється на локальну дату й час платформи, а повернутий об’єкт :class:`.datetime` є простим.

source: If *tz* is not ``None``, it must be an instance of a :class:`tzinfo` subclass, and the timestamp is converted to *tz*’s time zone.
uk: Якщо *tz* не є ``None``, він має бути екземпляром підкласу :class:`tzinfo`, а мітка часу перетворюється на часовий пояс *tz*.

source: :meth:`fromtimestamp` may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions, and :exc:`OSError` on :c:func:`localtime` or :c:func:`gmtime` failure. It's common for this to be restricted to years in 1970 through 2038. Note that on non-POSIX systems that include leap seconds in their notion of a timestamp, leap seconds are ignored by :meth:`fromtimestamp`, and then it's possible to have two timestamps differing by a second that yield identical :class:`.datetime` objects. This method is preferred over :meth:`utcfromtimestamp`.
uk: :meth:`fromtimestamp` може викликати :exc:`OverflowError`, якщо мітка часу виходить за межі діапазону значень, які підтримуються функціями платформи C :c:func:`localtime` або :c:func:`gmtime`, і :exc:`OSError` під час помилки :c:func:`localtime` або :c:func:`gmtime`. Зазвичай це обмежується роками з 1970 по 2038 рік. Зауважте, що в системах без POSIX, які включають високосні секунди в своє поняття позначки часу, високосні секунди ігноруються :meth:`fromtimestamp`, і тоді можна мати дві мітки часу, що відрізняються на секунду, що дає ідентичні об’єкти :class:`.datetime`. Цей метод є кращим перед :meth:`utcfromtimestamp`.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`localtime` or :c:func:`gmtime` failure.
uk: Викликайте :exc:`OverflowError` замість :exc:`ValueError`, якщо позначка часу виходить за межі діапазону значень, які підтримують функції C :c:func:`localtime` або :c:func:`gmtime` платформи. Викликати :exc:`OSError` замість :exc:`ValueError` у разі помилки :c:func:`localtime` або :c:func:`gmtime`.

source: :meth:`fromtimestamp` may return instances with :attr:`.fold` set to 1.
uk: :meth:`fromtimestamp` може повертати екземпляри з :attr:`.fold`, встановленим на 1.

source: Return the UTC :class:`.datetime` corresponding to the POSIX timestamp, with :attr:`.tzinfo` ``None``. (The resulting object is naive.)
uk: Повертає UTC :class:`.datetime`, що відповідає мітці часу POSIX, з :attr:`.tzinfo` ``None``. (Отриманий об’єкт наївний.)

source: This may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`gmtime` function, and :exc:`OSError` on :c:func:`gmtime` failure. It's common for this to be restricted to years in 1970 through 2038.
uk: Це може спричинити помилку :exc:`OverflowError`, якщо позначка часу виходить за межі значень, які підтримує функція платформи C :c:func:`gmtime`, і :exc:`OSError` на :c:func:`gmtime` невдача. Зазвичай це обмежується роками з 1970 по 2038 рік.

source: To get an aware :class:`.datetime` object, call :meth:`fromtimestamp`::
uk: Щоб отримати відомий об’єкт :class:`.datetime`, викличте :meth:`fromtimestamp`::

source: On the POSIX compliant platforms, it is equivalent to the following expression::
uk: На POSIX-сумісних платформах це еквівалентно такому виразу::

source: except the latter formula always supports the full years range: between :const:`MINYEAR` and :const:`MAXYEAR` inclusive.
uk: за винятком останньої формули, яка завжди підтримує повний діапазон років: від :const:`MINYEAR` до :const:`MAXYEAR` включно.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC. As such, the recommended way to create an object representing a specific timestamp in UTC is by calling ``datetime.fromtimestamp(timestamp, tz=timezone.utc)``.
uk: Оскільки наївні об’єкти ``datetime`` розглядаються багатьма методами ``datetime`` як місцевий час, бажано використовувати відомі дати для представлення часу в UTC. Таким чином, рекомендований спосіб створити об’єкт, що представляє конкретну позначку часу в UTC, — це викликати ``datetime.fromtimestamp(timestamp, tz=timezone.utc)``.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`gmtime` function. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`gmtime` failure.
uk: Викликайте :exc:`OverflowError` замість :exc:`ValueError`, якщо позначка часу виходить за межі діапазону значень, які підтримує функція C :c:func:`gmtime` платформи. Викликати :exc:`OSError` замість :exc:`ValueError` у разі помилки :c:func:`gmtime`.

source: Return the :class:`.datetime` corresponding to the proleptic Gregorian ordinal, where January 1 of year 1 has ordinal 1. :exc:`ValueError` is raised unless ``1 <= ordinal <= datetime.max.toordinal()``. The hour, minute, second and microsecond of the result are all 0, and :attr:`.tzinfo` is ``None``.
uk: Повертає :class:`.datetime`, що відповідає пролептичному григоріанському порядковому номеру, де 1 січня року 1 має порядковий номер 1. :exc:`ValueError` виникає, якщо не ``1 <= порядковий <= datetime.max.toordinal()``. Година, хвилина, секунда та мікросекунда результату дорівнюють 0, а :attr:`.tzinfo` — ``None``.

source: Return a new :class:`.datetime` object whose date components are equal to the given :class:`date` object's, and whose time components are equal to the given :class:`.time` object's. If the *tzinfo* argument is provided, its value is used to set the :attr:`.tzinfo` attribute of the result, otherwise the :attr:`~.time.tzinfo` attribute of the *time* argument is used.
uk: Повертає новий об’єкт :class:`.datetime`, компоненти дати якого дорівнюють заданому об’єкту :class:`date`, а компоненти часу дорівнюють заданому об’єкту :class:`.time`. Якщо надано аргумент *tzinfo*, його значення використовується для встановлення атрибута :attr:`.tzinfo` результату, інакше використовується атрибут :attr:`~.time.tzinfo` аргументу *time*.
