Repository: python/python-docs-uk
Catalog: library/datetime.po
Languages: uk

source: When ``None`` is passed, it's up to the class designer to decide the best response. For example, returning ``None`` is appropriate if the class wishes to say that time objects don't participate in the :class:`tzinfo` protocols. It may be more useful for ``utcoffset(None)`` to return the standard UTC offset, as there is no other convention for discovering the standard offset.
uk: Коли передається ``None``, розробник класу вирішує найкращу відповідь. Наприклад, повернення ``None`` є доцільним, якщо клас хоче сказати, що об’єкти часу не беруть участі в протоколах :class:`tzinfo`. Може бути кориснішим для ``utcoffset(None)`` повертати стандартне зміщення UTC, оскільки немає іншої угоди для виявлення стандартного зсуву.

source: When a :class:`.datetime` object is passed in response to a :class:`.datetime` method, ``dt.tzinfo`` is the same object as *self*. :class:`tzinfo` methods can rely on this, unless user code calls :class:`tzinfo` methods directly. The intent is that the :class:`tzinfo` methods interpret *dt* as being in local time, and not need worry about objects in other timezones.
uk: Коли об’єкт :class:`.datetime` передається у відповідь на метод :class:`.datetime`, ``dt.tzinfo`` є тим самим об’єктом, що і *self*. Методи :class:`tzinfo` можуть покладатися на це, якщо код користувача не викликає безпосередньо методи :class:`tzinfo`. Метою є те, що методи :class:`tzinfo` інтерпретують *dt* як місцевий час, і не потрібно турбуватися про об’єкти в інших часових поясах.

source: There is one more :class:`tzinfo` method that a subclass may wish to override:
uk: Є ще один метод :class:`tzinfo`, який підклас може захотіти перевизначити:

source: This is called from the default :class:`datetime.astimezone()` implementation. When called from that, ``dt.tzinfo`` is *self*, and *dt*'s date and time data are to be viewed as expressing a UTC time. The purpose of :meth:`fromutc` is to adjust the date and time data, returning an equivalent datetime in *self*'s local time.
uk: Це викликається із стандартної реалізації :class:`datetime.astimezone()`. При виклику з нього ``dt.tzinfo`` є *власним*, а дані дати і часу *dt* повинні розглядатися як такі, що виражають час UTC. Метою :meth:`fromutc` є коригування даних дати й часу, повертаючи еквівалентну дату й час у місцевому часі *self*.

source: Most :class:`tzinfo` subclasses should be able to inherit the default :meth:`fromutc` implementation without problems. It's strong enough to handle fixed-offset time zones, and time zones accounting for both standard and daylight time, and the latter even if the DST transition times differ in different years. An example of a time zone the default :meth:`fromutc` implementation may not handle correctly in all cases is one where the standard offset (from UTC) depends on the specific date and time passed, which can happen for political reasons. The default implementations of :meth:`astimezone` and :meth:`fromutc` may not produce the result you want if the result is one of the hours straddling the moment the standard offset changes.
uk: Більшість підкласів :class:`tzinfo` повинні мати можливість без проблем успадковувати реалізацію :meth:`fromutc` за умовчанням. Він достатньо потужний, щоб обробляти часові пояси з фіксованим зміщенням, а також часові пояси, що враховують як стандартний, так і денний час, причому останній, навіть якщо час переходу на літній час відрізняється в різні роки. Прикладом часового поясу, який стандартна реалізація :meth:`fromutc` може не обробляти належним чином у всіх випадках, є той, де стандартне зміщення (від UTC) залежить від конкретної дати та часу, що минули, що може статися з політичних причин. Реалізації за замовчуванням :meth:`astimezone` і :meth:`fromutc` можуть не дати бажаного результату, якщо результатом є одна з годин, що перетинає момент зміни стандартного зсуву.

source: Skipping code for error cases, the default :meth:`fromutc` implementation acts like::
uk: Пропускаючи код для випадків помилки, реалізація за замовчуванням :meth:`fromutc` діє як:

source: In the following :download:`tzinfo_examples.py <../includes/tzinfo_examples.py>` file there are some examples of :class:`tzinfo` classes:
uk: У наступному файлі :download:`tzinfo_examples.py <../includes/tzinfo_examples.py>` є кілька прикладів класів :class:`tzinfo`:

source: Note that there are unavoidable subtleties twice per year in a :class:`tzinfo` subclass accounting for both standard and daylight time, at the DST transition points. For concreteness, consider US Eastern (UTC -0500), where EDT begins the minute after 1:59 (EST) on the second Sunday in March, and ends the minute after 1:59 (EDT) on the first Sunday in November::
uk: Зауважте, що є неминучі тонкощі двічі на рік у підкласі :class:`tzinfo`, що враховує як стандартний, так і денний час, у точках переходу на літній час. Для конкретності розглянемо Східну США (UTC -0500), де EDT починається через хвилину після 1:59 (EST) у другу неділю березня та закінчується через хвилину після 1:59 (EST) у першу неділю листопада:

source: When DST starts (the "start" line), the local wall clock leaps from 1:59 to 3:00. A wall time of the form 2:MM doesn't really make sense on that day, so ``astimezone(Eastern)`` won't deliver a result with ``hour == 2`` on the day DST begins. For example, at the Spring forward transition of 2016, we get::
uk: Коли починається літній час (рядок "початок"), місцевий настінний годинник переходить з 1:59 на 3:00. Настінний час у формі 2:MM насправді не має сенсу в цей день, тому ``astimezone(Eastern)`` не надасть результат з ``hour == 2`` у день початку літнього часу. Наприклад, під час весняного переходу вперед 2016 року ми отримуємо:

source: When DST ends (the "end" line), there's a potentially worse problem: there's an hour that can't be spelled unambiguously in local wall time: the last hour of daylight time. In Eastern, that's times of the form 5:MM UTC on the day daylight time ends. The local wall clock leaps from 1:59 (daylight time) back to 1:00 (standard time) again. Local times of the form 1:MM are ambiguous. :meth:`astimezone` mimics the local clock's behavior by mapping two adjacent UTC hours into the same local hour then. In the Eastern example, UTC times of the form 5:MM and 6:MM both map to 1:MM when converted to Eastern, but earlier times have the :attr:`~datetime.fold` attribute set to 0 and the later times have it set to 1. For example, at the Fall back transition of 2016, we get::
uk: Коли літній час закінчується (рядок "кінець"), виникає потенційно гірша проблема: є година, яку неможливо однозначно написати за місцевим настінним часом: остання година денного часу. На Сході це час у формі 5:MM UTC на кінець дня. Місцевий настінний годинник знову повертається з 1:59 (за денним часом) до 1:00 (за стандартним часом). Місцевий час у формі 1:MM неоднозначний. :meth:`astimezone` імітує поведінку місцевого годинника, відображаючи дві суміжні години UTC в ту саму місцеву годину. У східному прикладі час UTC у формі 5:MM і 6:MM відображається на 1:MM, коли перетворюється на східний час, але попередній час має атрибут :attr:`~datetime.fold`, встановлений на 0, а пізніший час встановіть його на 1. Наприклад, під час осіннього переходу 2016 року ми отримуємо:

source: Note that the :class:`.datetime` instances that differ only by the value of the :attr:`~datetime.fold` attribute are considered equal in comparisons.
uk: Зауважте, що екземпляри :class:`.datetime`, які відрізняються лише значенням атрибута :attr:`~datetime.fold`, вважаються рівними в порівнянні.

source: Applications that can't bear wall-time ambiguities should explicitly check the value of the :attr:`~datetime.fold` attribute or avoid using hybrid :class:`tzinfo` subclasses; there are no ambiguities when using :class:`timezone`, or any other fixed-offset :class:`tzinfo` subclass (such as a class representing only EST (fixed offset -5 hours), or only EDT (fixed offset -4 hours)).
uk: Програми, які не можуть витримувати неоднозначність настінного часу, повинні явно перевіряти значення атрибута :attr:`~datetime.fold` або уникати використання гібридних підкласів :class:`tzinfo`; при використанні :class:`timezone` або будь-якого іншого підкласу :class:`tzinfo` із фіксованим зсувом немає жодних двозначностей (наприклад, клас, що представляє лише EST (фіксований зсув -5 годин) або лише EDT (фіксований зсув -4) години)).

source: The :mod:`datetime` module has a basic :class:`timezone` class (for handling arbitrary fixed offsets from UTC) and its :attr:`timezone.utc` attribute (a UTC timezone instance).
uk: Модуль :mod:`datetime` має базовий клас :class:`timezone` (для обробки довільних фіксованих зміщень від UTC) і його атрибут :attr:`timezone.utc` (екземпляр часового поясу UTC).

source: ``zoneinfo`` brings the *IANA timezone database* (also known as the Olson database) to Python, and its usage is recommended.
uk: ``zoneinfo`` переносить *базу даних часових поясів IANA* (також відому як база даних Olson) до Python, і її використання рекомендовано.

source: `IANA timezone database <https://www.iana.org/time-zones>`_
uk: `База даних часових поясів IANA <https://www.iana.org/time-zones>`_

source: The Time Zone Database (often called tz, tzdata or zoneinfo) contains code and data that represent the history of local time for many representative locations around the globe. It is updated periodically to reflect changes made by political bodies to time zone boundaries, UTC offsets, and daylight-saving rules.
uk: База даних часових поясів (часто називається tz, tzdata або zoneinfo) містить код і дані, які представляють історію місцевого часу для багатьох репрезентативних місць у всьому світі. Він періодично оновлюється, щоб відобразити зміни, внесені політичними органами в межі часових поясів, зміщення UTC і правила переходу на літній час.

source: :class:`timezone` Objects
uk: :class:`timezone` Об'єкти

source: The :class:`timezone` class is a subclass of :class:`tzinfo`, each instance of which represents a timezone defined by a fixed offset from UTC.
uk: Клас :class:`timezone` є підкласом :class:`tzinfo`, кожен екземпляр якого представляє часовий пояс, визначений фіксованим зміщенням від UTC.

source: Objects of this class cannot be used to represent timezone information in the locations where different offsets are used in different days of the year or where historical changes have been made to civil time.
uk: Об’єкти цього класу не можна використовувати для представлення інформації про часові пояси в місцях, де використовуються різні зсуви в різні дні року або де історичні зміни були внесені до цивільного часу.

source: The *offset* argument must be specified as a :class:`timedelta` object representing the difference between the local time and UTC. It must be strictly between ``-timedelta(hours=24)`` and ``timedelta(hours=24)``, otherwise :exc:`ValueError` is raised.
uk: Аргумент *offset* має бути вказаний як об’єкт :class:`timedelta`, що представляє різницю між місцевим часом і UTC. Воно має бути між ``-timedelta(hours=24)`` і ``timedelta(hours=24)``, інакше :exc:`ValueError` викликається.

source: The *name* argument is optional. If specified it must be a string that will be used as the value returned by the :meth:`datetime.tzname` method.
uk: Аргумент *name* необов’язковий. Якщо вказано, це має бути рядок, який використовуватиметься як значення, яке повертає метод :meth:`datetime.tzname`.

source: Return the fixed value specified when the :class:`timezone` instance is constructed.
uk: Повертає фіксоване значення, указане під час створення екземпляра :class:`timezone`.

source: The *dt* argument is ignored. The return value is a :class:`timedelta` instance equal to the difference between the local time and UTC.
uk: Аргумент *dt* ігнорується. Повернене значення є екземпляром :class:`timedelta`, що дорівнює різниці між місцевим часом і UTC.

source: If *name* is not provided in the constructor, the name returned by ``tzname(dt)`` is generated from the value of the ``offset`` as follows. If *offset* is ``timedelta(0)``, the name is "UTC", otherwise it is a string in the format ``UTC±HH:MM``, where ± is the sign of ``offset``, HH and MM are two digits of ``offset.hours`` and ``offset.minutes`` respectively.
uk: Якщо *name* не вказано в конструкторі, ім’я, яке повертає ``tzname(dt)``, генерується зі значення ``offset`` наступним чином. Якщо *offset* дорівнює ``timedelta(0)``, ім'я - "UTC", інакше це рядок у форматі ``UTC±HH:MM``, де ± є знаком ``offset`` , HH і MM – це дві цифри ``offset.hours`` і ``offset.minutes`` відповідно.

source: Name generated from ``offset=timedelta(0)`` is now plain `'UTC'`, not ``'UTC+00:00'``.
uk: Ім’я, згенероване з ``offset=timedelta(0)``, тепер є простим `'UTC'`, а не ``'UTC+00:00'``.

source: Always returns ``None``.
uk: Завжди повертає ``None``.

source: Return ``dt + offset``. The *dt* argument must be an aware :class:`.datetime` instance, with ``tzinfo`` set to ``self``.
uk: Повернути ``dt + offset``. Аргумент *dt* має бути відомим екземпляром :class:`.datetime` із значенням ``tzinfo`` значення ``self``.

source: The UTC timezone, ``timezone(timedelta(0))``.
uk: Часовий пояс UTC, ``timezone(timedelta(0))``.

source: :meth:`strftime` and :meth:`strptime` Behavior
uk: Поведінка :meth:`strftime` і :meth:`strptime`

source: :class:`date`, :class:`.datetime`, and :class:`.time` objects all support a ``strftime(format)`` method, to create a string representing the time under the control of an explicit format string.
uk: Об’єкти :class:`date`, :class:`.datetime` і :class:`.time` підтримують метод ``strftime(format)`` для створення рядка, що представляє час під контролем явного рядок форматування.

source: Conversely, the :meth:`datetime.strptime` class method creates a :class:`.datetime` object from a string representing a date and time and a corresponding format string.
uk: І навпаки, метод класу :meth:`datetime.strptime` створює об’єкт :class:`.datetime` із рядка, що представляє дату й час, і відповідного рядка формату.

source: The table below provides a high-level comparison of :meth:`strftime` versus :meth:`strptime`:
uk: У наведеній нижче таблиці представлено високорівневе порівняння :meth:`strftime` проти :meth:`strptime`:

source: Usage
uk: Використання

source: Convert object to a string according to a given format
uk: Перетворити об’єкт на рядок відповідно до заданого формату

source: Parse a string into a :class:`.datetime` object given a corresponding format
uk: Розібрати рядок у об’єкт :class:`.datetime` із відповідним форматом

source: Type of method
uk: Тип методу

source: Instance method
uk: Метод екземпляра

source: Class method
uk: Метод класу

source: Method of
uk: Метод

source: Signature
uk: Підпис

source: :meth:`strftime` and :meth:`strptime` Format Codes
uk: Коди форматів :meth:`strftime` і :meth:`strptime`

source: The following is a list of all the format codes that the 1989 C standard requires, and these work on all platforms with a standard C implementation.
uk: Нижче наведено список усіх кодів форматів, яких вимагає стандарт C 1989 року, і вони працюють на всіх платформах зі стандартною реалізацією C.

source: Directive
uk: Директива

source: Meaning
uk: Значення

source: Example
uk: приклад

source: Notes
uk: Примітки

source: Weekday as locale's abbreviated name.
uk: День тижня як скорочена назва локалі.

source: Sun, Mon, ..., Sat (en_US);
uk: Нд, Пн, ..., Сб (en_US);

source: So, Mo, ..., Sa (de_DE)
uk: Отже, Пн, ..., Сб (de_DE)

source: Weekday as locale's full name.
uk: День тижня як повна назва локалі.

source: Sunday, Monday, ..., Saturday (en_US);
uk: неділя, понеділок, ..., субота (en_US);

source: Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.
uk: День тижня як десяткове число, де 0 – неділя, а 6 – субота.

source: Day of the month as a zero-padded decimal number.
uk: День місяця як десяткове число з доповненням нуля.

source: Month as locale's abbreviated name.
uk: Місяць як скорочена назва локалі.

source: Jan, Feb, ..., Dec (en_US);
uk: січ, лютий, ..., грудень (en_US);

source: Jan, Feb, ..., Dez (de_DE)
uk: січ, лютий, ..., дек (de_DE)

source: Month as locale's full name.
uk: Місяць як повна назва локалі.

source: January, February, ..., December (en_US);
uk: січень, лютий, ..., грудень (en_US);

source: Januar, Februar, ..., Dezember (de_DE)
uk: січень, лютий, ..., грудень (de_DE)

source: Month as a zero-padded decimal number.
uk: Місяць як десяткове число з доповненням нуля.

source: Year without century as a zero-padded decimal number.
uk: Рік без століття як десяткове число з доповненням нуля.

source: Year with century as a decimal number.
uk: Рік із століттям як десяткове число.

source: Hour (24-hour clock) as a zero-padded decimal number.
uk: Година (24-годинний формат) як десяткове число з доповненням нуля.

source: Hour (12-hour clock) as a zero-padded decimal number.
uk: Година (12-годинний годинник) як десяткове число з доповненням нуля.

source: Locale's equivalent of either AM or PM.
uk: Локальний еквівалент AM або PM.

source: Minute as a zero-padded decimal number.
uk: Хвилина як десяткове число з доповненням нуля.

source: Second as a zero-padded decimal number.
uk: Секунда як десяткове число з доповненням нуля.

source: Microsecond as a decimal number, zero-padded to 6 digits.
uk: Мікросекунда як десяткове число, доповнене нулями до 6 цифр.

source: UTC offset in the form ``±HHMM[SS[.ffffff]]`` (empty string if the object is naive).
uk: Зміщення UTC у формі ``±HHMM[SS[.ffffff]]`` (порожній рядок, якщо об’єкт наївний).

source: (empty), +0000, -0400, +1030, +063415, -030712.345216
uk: (порожній), +0000, -0400, +1030, +063415, -030712.345216

source: Time zone name (empty string if the object is naive).
uk: Назва часового поясу (пустий рядок, якщо об’єкт наївний).

source: (empty), UTC, GMT
uk: (пусто), UTC, GMT

source: Day of the year as a zero-padded decimal number.
uk: День року як десяткове число з доповненням нуля.

source: Week number of the year (Sunday as the first day of the week) as a zero-padded decimal number. All days in a new year preceding the first Sunday are considered to be in week 0.
uk: Номер тижня року (неділя як перший день тижня) як десяткове число з доповненням нуля. Усі дні в новому році, що передують першій неділі, вважаються нульовим тижнем.

source: Week number of the year (Monday as the first day of the week) as a zero-padded decimal number. All days in a new year preceding the first Monday are considered to be in week 0.
uk: Номер тижня року (понеділок як перший день тижня) як десяткове число з доповненням нуля. Усі дні в новому році, що передують першому понеділку, вважаються нульовим тижнем.

source: Locale's appropriate date and time representation.
uk: Відповідне представлення дати та часу в локалі.

source: Di 16 Aug 21:30:00 1988 (de_DE)
uk: 16 серпня 21:30:00 1988 (de_DE)

source: Locale's appropriate date representation.
uk: Відповідне представлення дати в локалі.

source: 08/16/88 (None);
uk: 16.08.88 (немає);

source: 08/16/1988 (en_US);
uk: 16.08.1988 (en_US);

source: Locale's appropriate time representation.
uk: Відповідне представлення часу локалі.

source: A literal ``'%'`` character.
uk: Буквальний символ ``'%''``.

source: Several additional directives not required by the C89 standard are included for convenience. These parameters all correspond to ISO 8601 date values.
uk: Для зручності включено кілька додаткових директив, які не вимагаються стандартом C89. Усі ці параметри відповідають значенням дати ISO 8601.

source: ISO 8601 year with century representing the year that contains the greater part of the ISO week (``%V``).
uk: Рік ISO 8601 із століттям, що представляє рік, який містить більшу частину тижня ISO (``%V``).

source: ISO 8601 weekday as a decimal number where 1 is Monday.
uk: День тижня ISO 8601 як десяткове число, де 1 означає понеділок.

source: ISO 8601 week as a decimal number with Monday as the first day of the week. Week 01 is the week containing Jan 4.
uk: ISO 8601 тиждень як десяткове число з понеділком як першим днем тижня. Тиждень 01 – це тиждень, що містить 4 січня.

source: These may not be available on all platforms when used with the :meth:`strftime` method. The ISO 8601 year and ISO 8601 week directives are not interchangeable with the year and week number directives above. Calling :meth:`strptime` with incomplete or ambiguous ISO 8601 directives will raise a :exc:`ValueError`.
uk: Вони можуть бути недоступні на всіх платформах, якщо використовуються з методом :meth:`strftime`. Директиви ISO 8601 рік і ISO 8601 тиждень не є взаємозамінними з директивами року і номера тижня вище. Виклик :meth:`strptime` із неповними або неоднозначними директивами ISO 8601 викличе :exc:`ValueError`.

source: The full set of format codes supported varies across platforms, because Python calls the platform C library's :func:`strftime` function, and platform variations are common. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation. There are also differences between platforms in handling of unsupported format specifiers.
uk: Повний набір підтримуваних кодів формату залежить від платформи, оскільки Python викликає функцію :func:`strftime` бібліотеки платформи C, і варіації платформ є звичайними. Щоб переглянути повний набір кодів форматів, які підтримуються вашою платформою, зверніться до документації :manpage:`strftime(3)`. Існують також відмінності між платформами в обробці непідтримуваних специфікаторів формату.

source: ``%G``, ``%u`` and ``%V`` were added.
uk: Додано ``%G``, ``%u`` і ``%V``.

source: Technical Detail
uk: Технічні деталі

source: Broadly speaking, ``d.strftime(fmt)`` acts like the :mod:`time` module's ``time.strftime(fmt, d.timetuple())`` although not all objects support a :meth:`timetuple` method.
uk: Загалом, ``d.strftime(fmt)`` діє як ``time.strftime(fmt, d.timetuple())`` модуля :mod:`time`, хоча не всі об’єкти підтримують :meth:`timetuple` метод.

source: For the :meth:`datetime.strptime` class method, the default value is ``1900-01-01T00:00:00.000``: any components not specified in the format string will be pulled from the default value. [#]_
uk: Для методу класу :meth:`datetime.strptime` значенням за замовчуванням є ``1900-01-01T00:00:00.000``: будь-які компоненти, не вказані в рядку формату, буде отримано зі значення за замовчуванням. [#]_

source: Using ``datetime.strptime(date_string, format)`` is equivalent to::
uk: Використання ``datetime.strptime(date_string, format)`` еквівалентно:

source: except when the format includes sub-second components or timezone offset information, which are supported in ``datetime.strptime`` but are discarded by ``time.strptime``.
uk: за винятком випадків, коли формат включає субсекундні компоненти або інформацію про зміщення часового поясу, які підтримуються в ``datetime.strptime``, але відкидаються ``time.strptime``.

source: For :class:`.time` objects, the format codes for year, month, and day should not be used, as :class:`time` objects have no such values. If they're used anyway, ``1900`` is substituted for the year, and ``1`` for the month and day.
uk: Для об’єктів :class:`.time` не слід використовувати коди формату для року, місяця та дня, оскільки об’єкти :class:`time` не мають таких значень. Якщо вони все одно використовуються, 1900 замінюється на рік, а 1 — на місяць і день.

source: For :class:`date` objects, the format codes for hours, minutes, seconds, and microseconds should not be used, as :class:`date` objects have no such values. If they're used anyway, ``0`` is substituted for them.
uk: Для об’єктів :class:`date` не слід використовувати коди формату для годин, хвилин, секунд і мікросекунд, оскільки об’єкти :class:`date` не мають таких значень. Якщо вони все одно використовуються, замість них буде замінено ``0``.
