Repository: python/python-docs-uk
Catalog: library/datetime.po
Languages: uk

source: For any :class:`.datetime` object *d*, ``d == datetime.combine(d.date(), d.time(), d.tzinfo)``. If date is a :class:`.datetime` object, its time components and :attr:`.tzinfo` attributes are ignored.
uk: Для будь-якого об’єкта :class:`.datetime` *d*, ``d == datetime.combine(d.date(), d.time(), d.tzinfo)``. Якщо date є об’єктом :class:`.datetime`, його компоненти часу та атрибути :attr:`.tzinfo` ігноруються.

source: Added the *tzinfo* argument.
uk: Додано аргумент *tzinfo*.

source: where ``*`` can match any single character.
uk: де ``*`` може відповідати будь-якому окремому символу.

source: Examples::
uk: Приклади::

source: Return a :class:`.datetime` corresponding to the ISO calendar date specified by year, week and day. The non-date components of the datetime are populated with their normal default values. This is the inverse of the function :meth:`datetime.isocalendar`.
uk: Повертає :class:`.datetime`, що відповідає календарній даті ISO, визначеній роком, тижнем і днем. Компоненти datetime, що не є датою, заповнюються стандартними значеннями за замовчуванням. Це зворотна функція :meth:`datetime.isocalendar`.

source: Return a :class:`.datetime` corresponding to *date_string*, parsed according to *format*.
uk: Повертає :class:`.datetime`, що відповідає *рядку_дати*, розібраному відповідно до *формату*.

source: This is equivalent to::
uk: Це еквівалентно::

source: :exc:`ValueError` is raised if the date_string and format can't be parsed by :func:`time.strptime` or if it returns a value which isn't a time tuple. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
uk: :exc:`ValueError` виникає, якщо date_string і формат не можуть бути проаналізовані :func:`time.strptime` або якщо він повертає значення, яке не є кортежем часу. Щоб отримати повний список директив форматування, перегляньте :ref:`strftime-strptime-behavior`.

source: The earliest representable :class:`.datetime`, ``datetime(MINYEAR, 1, 1, tzinfo=None)``.
uk: Найраніший репрезентований :class:`.datetime`, ``datetime(MINYEAR, 1, 1, tzinfo=None)``.

source: The latest representable :class:`.datetime`, ``datetime(MAXYEAR, 12, 31, 23, 59, 59, 999999, tzinfo=None)``.
uk: Останній представлений :class:`.datetime`, ``datetime(MAXYEAR, 12, 31, 23, 59, 59, 999999, tzinfo=None)``.

source: The smallest possible difference between non-equal :class:`.datetime` objects, ``timedelta(microseconds=1)``.
uk: Найменша можлива різниця між нерівними об’єктами :class:`.datetime`, ``timedelta(microseconds=1)``.

source: In ``range(24)``.
uk: У діапазоні (24).

source: In ``range(60)``.
uk: У ``діапазоні (60)``.

source: In ``range(1000000)``.
uk: У ``діапазоні (1000 000)``.

source: The object passed as the *tzinfo* argument to the :class:`.datetime` constructor, or ``None`` if none was passed.
uk: Об’єкт передається як аргумент *tzinfo* конструктору :class:`.datetime` або ``None``, якщо жодного не було передано.

source: In ``[0, 1]``. Used to disambiguate wall times during a repeated interval. (A repeated interval occurs when clocks are rolled back at the end of daylight saving time or when the UTC offset for the current zone is decreased for political reasons.) The value 0 (1) represents the earlier (later) of the two moments with the same wall time representation.
uk: У ``[0, 1]``. Використовується для усунення неоднозначності часу стіни протягом повторюваного інтервалу. (Повторюваний інтервал виникає, коли годинники повертаються назад наприкінці літнього часу або коли зсув UTC для поточної зони зменшується з політичних причин.) Значення 0 (1) представляє ранній (пізніший) із двох моментів із однакове представлення часу на стіні.

source: ``datetime1 < datetime2``
uk: ``датачас1 < датачас2``

source: Compares :class:`.datetime` to :class:`.datetime`. (4)
uk: Порівнює :class:`.datetime` з :class:`.datetime`. (4)

source: datetime2 is a duration of timedelta removed from datetime1, moving forward in time if ``timedelta.days`` > 0, or backward if ``timedelta.days`` < 0. The result has the same :attr:`~.datetime.tzinfo` attribute as the input datetime, and datetime2 - datetime1 == timedelta after. :exc:`OverflowError` is raised if datetime2.year would be smaller than :const:`MINYEAR` or larger than :const:`MAXYEAR`. Note that no time zone adjustments are done even if the input is an aware object.
uk: datetime2 — це тривалість дельти часу, вилученої з datetime1, переміщення вперед у часі, якщо ``timedelta.days`` > 0, або назад, якщо ``timedelta.days`` < 0. Результат має той самий :attr:`~.datetime .tzinfo` атрибут як вхідна дата і час, а datetime2 - datetime1 == timedelta після. :exc:`OverflowError` виникає, якщо datetime2.year буде меншим за :const:`MINYEAR` або більшим за :const:`MAXYEAR`. Зауважте, що коригування часового поясу не виконується, навіть якщо введенням є відомий об’єкт.

source: Computes the datetime2 such that datetime2 + timedelta == datetime1. As for addition, the result has the same :attr:`~.datetime.tzinfo` attribute as the input datetime, and no time zone adjustments are done even if the input is aware.
uk: Обчислює datetime2 так, що datetime2 + timedelta == datetime1. Що стосується додавання, результат має той самий атрибут :attr:`~.datetime.tzinfo`, що й дата-час введення, і коригування часового поясу не виконується, навіть якщо введення відоме.

source: Subtraction of a :class:`.datetime` from a :class:`.datetime` is defined only if both operands are naive, or if both are aware. If one is aware and the other is naive, :exc:`TypeError` is raised.
uk: Віднімання :class:`.datetime` від :class:`.datetime` визначається, лише якщо обидва операнди наївні, або якщо обидва знають. Якщо один знає, а інший наївний, виникає :exc:`TypeError`.

source: If both are naive, or both are aware and have the same :attr:`~.datetime.tzinfo` attribute, the :attr:`~.datetime.tzinfo` attributes are ignored, and the result is a :class:`timedelta` object *t* such that ``datetime2 + t == datetime1``. No time zone adjustments are done in this case.
uk: Якщо обидва наївні, або обидва знають і мають однаковий атрибут :attr:`~.datetime.tzinfo`, атрибути :attr:`~.datetime.tzinfo` ігноруються, і результатом є :class:`timedelta` об’єкт *t* такий, що ``datetime2 + t == datetime1``. У цьому випадку коригування часового поясу не виконується.

source: If both are aware and have different :attr:`~.datetime.tzinfo` attributes, ``a-b`` acts as if *a* and *b* were first converted to naive UTC datetimes first. The result is ``(a.replace(tzinfo=None) - a.utcoffset()) - (b.replace(tzinfo=None) - b.utcoffset())`` except that the implementation never overflows.
uk: Якщо обидва знають і мають різні атрибути :attr:`~.datetime.tzinfo`, ``a-b`` діє так, ніби *a* і *b* спочатку були перетворені на звичайні UTC дати та часи. Результатом є ``(a.replace(tzinfo=None) - a.utcoffset()) - (b.replace(tzinfo=None) - b.utcoffset())`` за винятком того, що реалізація ніколи не переповнюється.

source: *datetime1* is considered less than *datetime2* when *datetime1* precedes *datetime2* in time.
uk: *datetime1* вважається меншим за *datetime2*, якщо *datetime1* передує *datetime2* за часом.

source: If one comparand is naive and the other is aware, :exc:`TypeError` is raised if an order comparison is attempted. For equality comparisons, naive instances are never equal to aware instances.
uk: Якщо один компаранд наївний, а інший відомий, :exc:`TypeError` викликається під час спроби порівняння порядку. Для порівняння рівності наївні екземпляри ніколи не дорівнюють усвідомленим екземплярам.

source: If both comparands are aware, and have the same :attr:`~.datetime.tzinfo` attribute, the common :attr:`~.datetime.tzinfo` attribute is ignored and the base datetimes are compared. If both comparands are aware and have different :attr:`~.datetime.tzinfo` attributes, the comparands are first adjusted by subtracting their UTC offsets (obtained from ``self.utcoffset()``).
uk: Якщо обидва компаранди знають і мають однаковий атрибут :attr:`~.datetime.tzinfo`, загальний атрибут :attr:`~.datetime.tzinfo` ігнорується, а базові дати-часи порівнюються. Якщо обидва компаранди знають і мають різні атрибути :attr:`~.datetime.tzinfo`, компаранди спочатку коригуються шляхом віднімання їхніх зсувів UTC (отриманих із ``self.utcoffset()``).

source: Equality comparisons between aware and naive :class:`.datetime` instances don't raise :exc:`TypeError`.
uk: Порівняння рівності між обізнаними та наївними екземплярами :class:`.datetime` не викликає :exc:`TypeError`.

source: In order to stop comparison from falling back to the default scheme of comparing object addresses, datetime comparison normally raises :exc:`TypeError` if the other comparand isn't also a :class:`.datetime` object. However, ``NotImplemented`` is returned instead if the other comparand has a :meth:`timetuple` attribute. This hook gives other kinds of date objects a chance at implementing mixed-type comparison. If not, when a :class:`.datetime` object is compared to an object of a different type, :exc:`TypeError` is raised unless the comparison is ``==`` or ``!=``. The latter cases return :const:`False` or :const:`True`, respectively.
uk: Щоб зупинити порівняння від повернення до типової схеми порівняння адрес об’єктів, порівняння дати й часу зазвичай викликає :exc:`TypeError`, якщо інший порівнюваний не є також об’єктом :class:`.datetime`. Однак натомість повертається ``NotImplemented``, якщо інший компаранд має атрибут :meth:`timetuple`. Цей хук дає іншим видам об’єктів дати можливість реалізувати порівняння змішаного типу. Якщо ні, коли об’єкт :class:`.datetime` порівнюється з об’єктом іншого типу, виникає :exc:`TypeError`, якщо порівняння не ``==`` або ``!=``. Останні випадки повертають :const:`False` або :const:`True` відповідно.

source: Return :class:`date` object with same year, month and day.
uk: Повертає об’єкт :class:`date` з тим самим роком, місяцем і днем.

source: Return :class:`.time` object with same hour, minute, second, microsecond and fold. :attr:`.tzinfo` is ``None``. See also method :meth:`timetz`.
uk: Повертає об’єкт :class:`.time` із тією самою годиною, хвилиною, секундою, мікросекундою та згортанням. :attr:`.tzinfo` — це ``None``. Дивіться також метод :meth:`timetz`.

source: The fold value is copied to the returned :class:`.time` object.
uk: Значення згортання копіюється до повернутого об’єкта :class:`.time`.

source: Return :class:`.time` object with same hour, minute, second, microsecond, fold, and tzinfo attributes. See also method :meth:`time`.
uk: Повертає об’єкт :class:`.time` з такими самими атрибутами: година, хвилина, секунда, мікросекунда, згортання та tzinfo. Дивіться також метод :meth:`time`.

source: Return a datetime with the same attributes, except for those attributes given new values by whichever keyword arguments are specified. Note that ``tzinfo=None`` can be specified to create a naive datetime from an aware datetime with no conversion of date and time data.
uk: Повертає дату й час із тими самими атрибутами, за винятком тих атрибутів, яким надано нові значення за будь-якими аргументами ключового слова. Зауважте, що ``tzinfo=None`` можна вказати для створення простої дати-часу з усвідомленої дати-часу без перетворення даних дати й часу.

source: Return a :class:`.datetime` object with new :attr:`.tzinfo` attribute *tz*, adjusting the date and time data so the result is the same UTC time as *self*, but in *tz*'s local time.
uk: Повертає об’єкт :class:`.datetime` з новим атрибутом :attr:`.tzinfo` *tz*, регулюючи дані дати й часу таким чином, щоб результат був таким самим часом UTC, як *self*, але в *tz* місцевий час.

source: If provided, *tz* must be an instance of a :class:`tzinfo` subclass, and its :meth:`utcoffset` and :meth:`dst` methods must not return ``None``. If *self* is naive, it is presumed to represent time in the system timezone.
uk: Якщо вказано, *tz* має бути екземпляром підкласу :class:`tzinfo`, а його методи :meth:`utcoffset` і :meth:`dst` не повинні повертати ``None``. Якщо *self* наївний, вважається, що він представляє час у часовому поясі системи.

source: If called without arguments (or with ``tz=None``) the system local timezone is assumed for the target timezone. The ``.tzinfo`` attribute of the converted datetime instance will be set to an instance of :class:`timezone` with the zone name and offset obtained from the OS.
uk: Якщо викликати без аргументів (або з ``tz=None``), системний локальний часовий пояс передбачається як цільовий часовий пояс. Атрибут ``.tzinfo`` перетвореного екземпляра datetime буде встановлено на екземпляр :class:`timezone` з назвою зони та зміщенням, отриманими від ОС.

source: If ``self.tzinfo`` is *tz*, ``self.astimezone(tz)`` is equal to *self*: no adjustment of date or time data is performed. Else the result is local time in the timezone *tz*, representing the same UTC time as *self*: after ``astz = dt.astimezone(tz)``, ``astz - astz.utcoffset()`` will have the same date and time data as ``dt - dt.utcoffset()``.
uk: Якщо ``self.tzinfo`` дорівнює *tz*, ``self.astimezone(tz)`` дорівнює *self*: коригування даних дати чи часу не виконується. Інакше результатом є місцевий час у часовому поясі *tz*, який представляє той самий час UTC, що й *self*: після ``astz = dt.astimezone(tz)``, ``astz - astz.utcoffset()`` матиме ті самі дані про дату й час, що й у ``dt - dt.utcoffset()``.

source: If you merely want to attach a time zone object *tz* to a datetime *dt* without adjustment of date and time data, use ``dt.replace(tzinfo=tz)``. If you merely want to remove the time zone object from an aware datetime *dt* without conversion of date and time data, use ``dt.replace(tzinfo=None)``.
uk: Якщо ви просто хочете приєднати об’єкт часового поясу *tz* до дати і часу *dt* без коригування даних дати й часу, використовуйте ``dt.replace(tzinfo=tz)``. Якщо ви просто хочете видалити об’єкт часового поясу з відомого datetime *dt* без перетворення даних дати та часу, використовуйте ``dt.replace(tzinfo=None)``.

source: Note that the default :meth:`tzinfo.fromutc` method can be overridden in a :class:`tzinfo` subclass to affect the result returned by :meth:`astimezone`. Ignoring error cases, :meth:`astimezone` acts like::
uk: Зауважте, що стандартний метод :meth:`tzinfo.fromutc` можна замінити в підкласі :class:`tzinfo`, щоб вплинути на результат, який повертає :meth:`astimezone`. Ігноруючи випадки помилок, :meth:`astimezone` діє як:

source: *tz* now can be omitted.
uk: *tz* тепер можна опустити.

source: The :meth:`astimezone` method can now be called on naive instances that are presumed to represent system local time.
uk: Метод :meth:`astimezone` тепер можна викликати в простих екземплярах, які, як припускається, представляють місцевий час системи.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.utcoffset(self)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
uk: Якщо :attr:`.tzinfo` має значення ``None``, повертає ``None``, інакше повертає ``self.tzinfo.utcoffset(self)`` і викликає виняток, якщо останній не повертає ``None`` або об’єкт :class:`timedelta` з величиною менше одного дня.

source: The UTC offset is not restricted to a whole number of minutes.
uk: Зсув UTC не обмежений цілою кількістю хвилин.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.dst(self)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
uk: Якщо :attr:`.tzinfo` має значення ``None``, повертає ``None``, інакше повертає ``self.tzinfo.dst(self)`` і викликає виняток, якщо останній не повертає ``None`` або об’єкт :class:`timedelta` з величиною менше одного дня.

source: The DST offset is not restricted to a whole number of minutes.
uk: Зміщення літнього часу не обмежується цілою кількістю хвилин.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.tzname(self)``, raises an exception if the latter doesn't return ``None`` or a string object,
uk: Якщо :attr:`.tzinfo` має значення ``None``, повертає ``None``, інакше повертає ``self.tzinfo.tzname(self)``, викликає виняток, якщо останній не повертає ``None`` або рядковий об’єкт,

source: where ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` is the day number within the current year starting with ``1`` for January 1st. The :attr:`tm_isdst` flag of the result is set according to the :meth:`dst` method: :attr:`.tzinfo` is ``None`` or :meth:`dst` returns ``None``, :attr:`tm_isdst` is set to ``-1``; else if :meth:`dst` returns a non-zero value, :attr:`tm_isdst` is set to ``1``; else :attr:`tm_isdst` is set to ``0``.
uk: де ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` — це номер дня в поточному році, починаючи з ``1`` для 1 січня. Прапорець :attr:`tm_isdst` результату встановлюється відповідно до методу :meth:`dst` :attr:`.tzinfo` має значення ``None`` або :meth:`dst` повертає ``None`` , :attr:`tm_isdst` має значення ``-1``; інакше, якщо :meth:`dst` повертає ненульове значення, :attr:`tm_isdst` встановлюється на ``1``; інакше :attr:`tm_isdst` встановлено на ``0``.

source: If :class:`.datetime` instance *d* is naive, this is the same as ``d.timetuple()`` except that :attr:`tm_isdst` is forced to 0 regardless of what ``d.dst()`` returns. DST is never in effect for a UTC time.
uk: Якщо :class:`.datetime` екземпляр *d* є простим, це те саме, що ``d.timetuple()``, за винятком того, що :attr:`tm_isdst` має значення 0 незалежно від того, що ``d.dst( )`` повертається. Літній час ніколи не діє протягом UTC.

source: If *d* is aware, *d* is normalized to UTC time, by subtracting ``d.utcoffset()``, and a :class:`time.struct_time` for the normalized time is returned. :attr:`tm_isdst` is forced to 0. Note that an :exc:`OverflowError` may be raised if *d*.year was ``MINYEAR`` or ``MAXYEAR`` and UTC adjustment spills over a year boundary.
uk: Якщо *d* відомо, *d* нормалізується до часу UTC шляхом віднімання ``d.utcoffset()``, і повертається :class:`time.struct_time` для нормалізованого часу. :attr:`tm_isdst` має значення 0. Зауважте, що :exc:`OverflowError` може виникнути, якщо *d*.year був ``MINYEAR`` або ``MAXYEAR``, а коригування UTC виходить за межі року.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC; as a result, using ``utcfromtimetuple`` may give misleading results. If you have a naive ``datetime`` representing UTC, use ``datetime.replace(tzinfo=timezone.utc)`` to make it aware, at which point you can use :meth:`.datetime.timetuple`.
uk: Оскільки наївні об’єкти ``datetime`` обробляються багатьма методами ``datetime`` як місцевий час, бажано використовувати відомі дати для представлення часу в UTC; в результаті використання ``utcfromtimetuple`` може дати оманливі результати. Якщо у вас є простий ``datetime``, який представляє UTC, використовуйте ``datetime.replace(tzinfo=timezone.utc)``, щоб це було відомо, після чого ви можете використовувати :meth:`.datetime.timetuple`.

source: Return the proleptic Gregorian ordinal of the date. The same as ``self.date().toordinal()``.
uk: Повертає пролептичний григоріанський порядковий номер дати. Те саме, що ``self.date().toordinal()``.

source: Return POSIX timestamp corresponding to the :class:`.datetime` instance. The return value is a :class:`float` similar to that returned by :func:`time.time`.
uk: Повертає позначку часу POSIX, що відповідає екземпляру :class:`.datetime`. Значення, що повертається, є :class:`float`, подібне до того, яке повертає :func:`time.time`.

source: Naive :class:`.datetime` instances are assumed to represent local time and this method relies on the platform C :c:func:`mktime` function to perform the conversion. Since :class:`.datetime` supports wider range of values than :c:func:`mktime` on many platforms, this method may raise :exc:`OverflowError` for times far in the past or far in the future.
uk: Передбачається, що наивні екземпляри :class:`.datetime` представляють місцевий час, і цей метод покладається на функцію C :c:func:`mktime` платформи для виконання перетворення. Оскільки :class:`.datetime` підтримує ширший діапазон значень, ніж :c:func:`mktime` на багатьох платформах, цей метод може викликати :exc:`OverflowError` для часів далеко в минулому або далекого майбутнього.

source: For aware :class:`.datetime` instances, the return value is computed as::
uk: Для екземплярів aware :class:`.datetime` значення, що повертається, обчислюється як:

source: The :meth:`timestamp` method uses the :attr:`.fold` attribute to disambiguate the times during a repeated interval.
uk: Метод :meth:`timestamp` використовує атрибут :attr:`.fold`, щоб усунути неоднозначність часу протягом повторюваного інтервалу.

source: There is no method to obtain the POSIX timestamp directly from a naive :class:`.datetime` instance representing UTC time. If your application uses this convention and your system timezone is not set to UTC, you can obtain the POSIX timestamp by supplying ``tzinfo=timezone.utc``::
uk: Немає способу отримати мітку часу POSIX безпосередньо з простого екземпляра :class:`.datetime`, що представляє час UTC. Якщо ваша програма використовує цю угоду, а системний часовий пояс не встановлено на UTC, ви можете отримати мітку часу POSIX, надавши ``tzinfo=timezone.utc``::

source: or by calculating the timestamp directly::
uk: або шляхом безпосереднього обчислення позначки часу:

source: Return the day of the week as an integer, where Monday is 0 and Sunday is 6. The same as ``self.date().weekday()``. See also :meth:`isoweekday`.
uk: Повертає день тижня як ціле число, де понеділок дорівнює 0, а неділя – 6. Те саме, що ``self.date().weekday()``. Дивіться також :meth:`isoweekday`.

source: Return the day of the week as an integer, where Monday is 1 and Sunday is 7. The same as ``self.date().isoweekday()``. See also :meth:`weekday`, :meth:`isocalendar`.
uk: Повертає день тижня як ціле число, де понеділок — 1, а неділя — 7. Те саме, що ``self.date().isoweekday()``. Дивіться також :meth:`weekday`, :meth:`isocalendar`.

source: Return a :term:`named tuple` with three components: ``year``, ``week`` and ``weekday``. The same as ``self.date().isocalendar()``.
uk: Повертає :term:`named tuple` із трьома компонентами: ``рік``, ``тиждень`` і ``день тижня``. Те саме, що ``self.date().isocalendar()``.

source: Return a string representing the date and time in ISO 8601 format:
uk: Повертає рядок, що представляє дату й час у форматі ISO 8601:

source: ``YYYY-MM-DDTHH:MM:SS.ffffff``, if :attr:`microsecond` is not 0
uk: ``РРРР-ММ-ДДТГГ:ММ:СС.ffffff``, якщо :attr:`microsecond` не дорівнює 0

source: ``YYYY-MM-DDTHH:MM:SS``, if :attr:`microsecond` is 0
uk: ``РРРР-ММ-ДДТГГ:ХМ:СС``, якщо :attr:`microsecond` дорівнює 0

source: If :meth:`utcoffset` does not return ``None``, a string is appended, giving the UTC offset:
uk: Якщо :meth:`utcoffset` не повертає ``None``, додається рядок із зміщенням UTC:

source: ``YYYY-MM-DDTHH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is not 0
uk: ``РРРР-ММ-ДДТГГ:ММ:СС.ffffff+ГГ:ММ[:СС[.ffffff]]``, якщо :attr:`microsecond` не дорівнює 0

source: ``YYYY-MM-DDTHH:MM:SS+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is 0
uk: ``РРРР-ММ-ДДТГГ:ММ:СС+ГГ:ХМ[:СС[.ffffff]]``, якщо :attr:`microsecond` дорівнює 0

source: The optional argument *sep* (default ``'T'``) is a one-character separator, placed between the date and time portions of the result. For example::
uk: Необов’язковий аргумент *sep* (за замовчуванням ``'T'``) є односимвольним роздільником, який розміщується між частинами дати та часу результату. Наприклад::
