Repository: python/python-docs-uk
Catalog: library/datetime.po
Languages: uk

source: The optional argument *timespec* specifies the number of additional components of the time to include (the default is ``'auto'``). It can be one of the following:
uk: Необов'язковий аргумент *timespec* визначає кількість додаткових компонентів часу, які потрібно включити (за замовчуванням це ``'auto'``). Це може бути одне з наступного:

source: ``'auto'``: Same as ``'seconds'`` if :attr:`microsecond` is 0, same as ``'microseconds'`` otherwise.
uk: ``'auto'``: те саме, що ``'seconds'``, якщо :attr:`microsecond` дорівнює 0, те ж саме, що ``'microseconds'`` інакше.

source: ``'hours'``: Include the :attr:`hour` in the two-digit ``HH`` format.
uk: ``'hours'``: Додайте :attr:`hour` у двозначному форматі ``HH``.

source: ``'minutes'``: Include :attr:`hour` and :attr:`minute` in ``HH:MM`` format.
uk: ``'хвилини'``: включайте :attr:`hour` і :attr:`minute` у форматі ``ГГ:ХХ``.

source: ``'seconds'``: Include :attr:`hour`, :attr:`minute`, and :attr:`second` in ``HH:MM:SS`` format.
uk: ``'seconds'``: включайте :attr:`hour`, :attr:`minute` і :attr:`second` у форматі ``HH:MM:SS``.

source: ``'milliseconds'``: Include full time, but truncate fractional second part to milliseconds. ``HH:MM:SS.sss`` format.
uk: ``'мілісекунди``: включити повний час, але скоротити дробову другу частину до мілісекунд. Формат ``HH:MM:SS.sss``.

source: ``'microseconds'``: Include full time in ``HH:MM:SS.ffffff`` format.
uk: ``'мікросекунди``: включіть повний час у форматі ``ГГ:ХХ:СС.ffffff``.

source: Excluded time components are truncated, not rounded.
uk: Виключені компоненти часу скорочуються, а не округлюються.

source: :exc:`ValueError` will be raised on an invalid *timespec* argument::
uk: :exc:`ValueError` буде викликано через недійсний аргумент *timespec*::

source: Added the *timespec* argument.
uk: Додано аргумент *timespec*.

source: For a :class:`.datetime` instance *d*, ``str(d)`` is equivalent to ``d.isoformat(' ')``.
uk: Для екземпляра :class:`.datetime` *d*, ``str(d)`` еквівалентно ``d.isoformat(' ')``.

source: Return a string representing the date and time::
uk: Повертає рядок, що представляє дату й час::

source: The output string will *not* include time zone information, regardless of whether the input is aware or naive.
uk: Рядок виводу *не* включатиме інформацію про часовий пояс, незалежно від того, чи є введення відомим чи простим.

source: on platforms where the native C :c:func:`ctime` function (which :func:`time.ctime` invokes, but which :meth:`datetime.ctime` does not invoke) conforms to the C standard.
uk: на платформах, де рідна функція C :c:func:`ctime` (яку :func:`time.ctime` викликає, але яку :meth:`datetime.ctime` не викликає) відповідає стандарту C.

source: Return a string representing the date and time, controlled by an explicit format string. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
uk: Повертає рядок, що представляє дату й час, керований рядком явного формату. Щоб отримати повний список директив форматування, перегляньте :ref:`strftime-strptime-behavior`.

source: Same as :meth:`.datetime.strftime`. This makes it possible to specify a format string for a :class:`.datetime` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
uk: Те саме, що :meth:`.datetime.strftime`. Це дає змогу вказати рядок формату для об’єкта :class:`.datetime` у :ref:`форматованих рядкових літералах <f-strings>` і при використанні :meth:`str.format`. Щоб отримати повний список директив форматування, перегляньте :ref:`strftime-strptime-behavior`.

source: Examples of Usage: :class:`.datetime`
uk: Приклади використання: :class:`.datetime`

source: Examples of working with :class:`~datetime.datetime` objects:
uk: Приклади роботи з об'єктами :class:`~datetime.datetime`:

source: The example below defines a :class:`tzinfo` subclass capturing time zone information for Kabul, Afghanistan, which used +4 UTC until 1945 and then +4:30 UTC thereafter::
uk: У наведеному нижче прикладі визначено підклас :class:`tzinfo`, який збирає інформацію про часовий пояс для Кабула, Афганістан, який використовував +4 UTC до 1945 року, а потім +4:30 UTC після цього::

source: Usage of ``KabulTz`` from above::
uk: Використання ``KabulTz`` зверху::

source: :class:`.time` Objects
uk: :class:`.time` Об'єкти

source: A :class:`time` object represents a (local) time of day, independent of any particular day, and subject to adjustment via a :class:`tzinfo` object.
uk: Об’єкт :class:`time` представляє (локальний) час доби, незалежний від будь-якого конкретного дня, і підлягає налаштуванню через об’єкт :class:`tzinfo`.

source: All arguments are optional. *tzinfo* may be ``None``, or an instance of a :class:`tzinfo` subclass. The remaining arguments must be integers in the following ranges:
uk: Усі аргументи необов’язкові. *tzinfo* може бути ``None`` або екземпляром підкласу :class:`tzinfo`. Решта аргументів мають бути цілими числами в таких діапазонах:

source: If an argument outside those ranges is given, :exc:`ValueError` is raised. All default to ``0`` except *tzinfo*, which defaults to :const:`None`.
uk: Якщо вказано аргумент поза цими діапазонами, виникає :exc:`ValueError`. Усі за замовчуванням мають значення ``0``, крім *tzinfo*, для якого за замовчуванням :const:`None`.

source: The earliest representable :class:`.time`, ``time(0, 0, 0, 0)``.
uk: Найперший представлений :class:`.time`, ``time(0, 0, 0, 0)``.

source: The latest representable :class:`.time`, ``time(23, 59, 59, 999999)``.
uk: Останній представлений :class:`.time`, ``time(23, 59, 59, 999999)``.

source: The smallest possible difference between non-equal :class:`.time` objects, ``timedelta(microseconds=1)``, although note that arithmetic on :class:`.time` objects is not supported.
uk: Найменша можлива різниця між нерівними об’єктами :class:`.time`, ``timedelta(microseconds=1)``, хоча зауважте, що арифметика в об’єктах :class:`.time` не підтримується.

source: The object passed as the tzinfo argument to the :class:`.time` constructor, or ``None`` if none was passed.
uk: Об’єкт, переданий як аргумент tzinfo конструктору :class:`.time`, або ``None``, якщо жодного не було передано.

source: :class:`.time` objects support comparison of :class:`.time` to :class:`.time`, where *a* is considered less than *b* when *a* precedes *b* in time. If one comparand is naive and the other is aware, :exc:`TypeError` is raised if an order comparison is attempted. For equality comparisons, naive instances are never equal to aware instances.
uk: Об’єкти :class:`.time` підтримують порівняння :class:`.time` з :class:`.time`, де *a* вважається меншим за *b*, коли *a* передує *b* за часом. Якщо один компаранд наївний, а інший відомий, :exc:`TypeError` викликається під час спроби порівняння порядку. Для порівняння рівності наївні екземпляри ніколи не дорівнюють усвідомленим екземплярам.

source: If both comparands are aware, and have the same :attr:`~time.tzinfo` attribute, the common :attr:`~time.tzinfo` attribute is ignored and the base times are compared. If both comparands are aware and have different :attr:`~time.tzinfo` attributes, the comparands are first adjusted by subtracting their UTC offsets (obtained from ``self.utcoffset()``). In order to stop mixed-type comparisons from falling back to the default comparison by object address, when a :class:`.time` object is compared to an object of a different type, :exc:`TypeError` is raised unless the comparison is ``==`` or ``!=``. The latter cases return :const:`False` or :const:`True`, respectively.
uk: Якщо обидва компаранди знають і мають однаковий атрибут :attr:`~time.tzinfo`, загальний атрибут :attr:`~time.tzinfo` ігнорується, а базовий час порівнюється. Якщо обидва компаранди знають і мають різні атрибути :attr:`~time.tzinfo`, компаранди спочатку коригуються шляхом віднімання їхніх зсувів UTC (отриманих із ``self.utcoffset()``). Щоб зупинити порівняння змішаного типу від повернення до стандартного порівняння за адресою об’єкта, коли об’єкт :class:`.time` порівнюється з об’єктом іншого типу, виникає :exc:`TypeError`, якщо порівняння не це ``==`` або ``!=``. Останні випадки повертають :const:`False` або :const:`True` відповідно.

source: Equality comparisons between aware and naive :class:`~datetime.time` instances don't raise :exc:`TypeError`.
uk: Порівняння рівності між усвідомленими та наївними екземплярами :class:`~datetime.time` не викликає :exc:`TypeError`.

source: In Boolean contexts, a :class:`.time` object is always considered to be true.
uk: У логічних контекстах об’єкт :class:`.time` завжди вважається істинним.

source: Before Python 3.5, a :class:`.time` object was considered to be false if it represented midnight in UTC. This behavior was considered obscure and error-prone and has been removed in Python 3.5. See :issue:`13936` for full details.
uk: До Python 3.5 об’єкт :class:`.time` вважався хибним, якщо він представляв північ за UTC. Така поведінка вважалася незрозумілою та спроможною до помилок, і її було видалено в Python 3.5. Дивіться :issue:`13936` для отримання повної інформації.

source: Other constructor:
uk: Інший конструктор:

source: Return a :class:`.time` with the same value, except for those attributes given new values by whichever keyword arguments are specified. Note that ``tzinfo=None`` can be specified to create a naive :class:`.time` from an aware :class:`.time`, without conversion of the time data.
uk: Повертає :class:`.time` з тим самим значенням, за винятком тих атрибутів, яким надано нові значення за будь-якими аргументами ключового слова. Зауважте, що ``tzinfo=None`` можна вказати для створення простого :class:`.time` із відомого :class:`.time` без перетворення даних часу.

source: Return a string representing the time in ISO 8601 format, one of:
uk: Повертає рядок, що представляє час у форматі ISO 8601, один із:

source: ``HH:MM:SS.ffffff``, if :attr:`microsecond` is not 0
uk: ``HH:MM:SS.ffffff``, якщо :attr:`microsecond` не дорівнює 0

source: ``HH:MM:SS``, if :attr:`microsecond` is 0
uk: ``ГГ:ХХ:СС``, якщо :attr:`microsecond` дорівнює 0

source: ``HH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, if :meth:`utcoffset` does not return ``None``
uk: ``HH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, якщо :meth:`utcoffset` не повертає ``None``

source: ``HH:MM:SS+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is 0 and :meth:`utcoffset` does not return ``None``
uk: ``ГГ:ХМ:СС+ГГ:ХМ[:СС[.ffffff]]``, якщо :attr:`microsecond` дорівнює 0 і :meth:`utcoffset` не повертає ``None``

source: :exc:`ValueError` will be raised on an invalid *timespec* argument.
uk: :exc:`ValueError` буде викликано через недійсний аргумент *timespec*.

source: For a time *t*, ``str(t)`` is equivalent to ``t.isoformat()``.
uk: Протягом часу *t* ``str(t)`` еквівалентно ``t.isoformat()``.

source: Return a string representing the time, controlled by an explicit format string. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
uk: Повертає рядок, що представляє час, керований рядком явного формату. Щоб отримати повний список директив форматування, перегляньте :ref:`strftime-strptime-behavior`.

source: Same as :meth:`.time.strftime`. This makes it possible to specify a format string for a :class:`.time` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. For a complete list of formatting directives, see :ref:`strftime-strptime-behavior`.
uk: Те саме, що :meth:`.time.strftime`. Це дає змогу вказати рядок формату для об’єкта :class:`.time` у :ref:`форматованих рядкових літералах <f-strings>` і при використанні :meth:`str.format`. Щоб отримати повний список директив форматування, перегляньте :ref:`strftime-strptime-behavior`.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.utcoffset(None)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
uk: Якщо :attr:`.tzinfo` має значення ``None``, повертає ``None``, інакше повертає ``self.tzinfo.utcoffset(None)`` і викликає виняток, якщо останній не повертає ``None`` або об’єкт :class:`timedelta` з величиною менше одного дня.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.dst(None)``, and raises an exception if the latter doesn't return ``None``, or a :class:`timedelta` object with magnitude less than one day.
uk: Якщо :attr:`.tzinfo` має значення ``None``, повертає ``None``, інакше повертає ``self.tzinfo.dst(None)`` і викликає виняток, якщо останній не повертає ``None`` або об’єкт :class:`timedelta` з величиною менше одного дня.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.tzname(None)``, or raises an exception if the latter doesn't return ``None`` or a string object.
uk: Якщо :attr:`.tzinfo` має значення ``None``, повертає ``None``, інакше повертає ``self.tzinfo.tzname(None)`` або викликає виняток, якщо останній не повертає ``None`` або рядковий об’єкт.

source: Examples of Usage: :class:`.time`
uk: Приклади використання: :class:`.time`

source: Examples of working with a :class:`.time` object::
uk: Приклади роботи з об'єктом :class:`.time`::

source: :class:`tzinfo` Objects
uk: :class:`tzinfo` Об'єкти

source: This is an abstract base class, meaning that this class should not be instantiated directly. Define a subclass of :class:`tzinfo` to capture information about a particular time zone.
uk: Це абстрактний базовий клас, що означає, що цей клас не повинен створюватися безпосередньо. Визначте підклас :class:`tzinfo` для отримання інформації про певний часовий пояс.

source: An instance of (a concrete subclass of) :class:`tzinfo` can be passed to the constructors for :class:`.datetime` and :class:`.time` objects. The latter objects view their attributes as being in local time, and the :class:`tzinfo` object supports methods revealing offset of local time from UTC, the name of the time zone, and DST offset, all relative to a date or time object passed to them.
uk: Екземпляр (конкретного підкласу) :class:`tzinfo` можна передати конструкторам для об’єктів :class:`.datetime` і :class:`.time`. Останні об’єкти розглядають свої атрибути як місцевий час, а об’єкт :class:`tzinfo` підтримує методи, які виявляють зміщення місцевого часу від UTC, назви часового поясу та зміщення літнього часу, усе відносно об’єкта дати чи часу передано їм.

source: You need to derive a concrete subclass, and (at least) supply implementations of the standard :class:`tzinfo` methods needed by the :class:`.datetime` methods you use. The :mod:`datetime` module provides :class:`timezone`, a simple concrete subclass of :class:`tzinfo` which can represent timezones with fixed offset from UTC such as UTC itself or North American EST and EDT.
uk: Вам потрібно вивести конкретний підклас і (принаймні) забезпечити реалізації стандартних методів :class:`tzinfo`, необхідних для методів :class:`.datetime`, які ви використовуєте. Модуль :mod:`datetime` надає :class:`timezone`, простий конкретний підклас :class:`tzinfo`, який може представляти часові пояси з фіксованим зсувом відносно UTC, як-от сам UTC або північноамериканський EST і EDT.

source: Special requirement for pickling: A :class:`tzinfo` subclass must have an :meth:`__init__` method that can be called with no arguments, otherwise it can be pickled but possibly not unpickled again. This is a technical requirement that may be relaxed in the future.
uk: Спеціальна вимога до маринування: підклас :class:`tzinfo` повинен мати метод :meth:`__init__`, який можна викликати без аргументів, інакше його можна маринувати, але, можливо, не скасувати знову. Це технічна вимога, яку в майбутньому можуть послабити.

source: A concrete subclass of :class:`tzinfo` may need to implement the following methods. Exactly which methods are needed depends on the uses made of aware :mod:`datetime` objects. If in doubt, simply implement all of them.
uk: Конкретний підклас :class:`tzinfo` може потребувати реалізації наступних методів. Які саме методи потрібні, залежить від використання відомих об’єктів :mod:`datetime`. Якщо сумніваєтеся, просто застосуйте їх усі.

source: Return offset of local time from UTC, as a :class:`timedelta` object that is positive east of UTC. If local time is west of UTC, this should be negative.
uk: Повертає зміщення місцевого часу від UTC, як об’єкт :class:`timedelta`, який є позитивним на схід від UTC. Якщо місцевий час на захід від UTC, це значення має бути від’ємним.

source: This represents the *total* offset from UTC; for example, if a :class:`tzinfo` object represents both time zone and DST adjustments, :meth:`utcoffset` should return their sum. If the UTC offset isn't known, return ``None``. Else the value returned must be a :class:`timedelta` object strictly between ``-timedelta(hours=24)`` and ``timedelta(hours=24)`` (the magnitude of the offset must be less than one day). Most implementations of :meth:`utcoffset` will probably look like one of these two::
uk: Це *загальне* зміщення від UTC; наприклад, якщо об’єкт :class:`tzinfo` представляє коригування часового поясу та літнього часу, :meth:`utcoffset` має повернути їх суму. Якщо зсув UTC невідомий, поверніть ``None``. Інакше повернене значення має бути об’єктом :class:`timedelta` строго між ``-timedelta(hours=24)`` і ``timedelta(hours=24)`` (величина зміщення має бути меншою за один день ). Більшість реалізацій :meth:`utcoffset`, ймовірно, виглядатимуть як одне з цих двох:

source: If :meth:`utcoffset` does not return ``None``, :meth:`dst` should not return ``None`` either.
uk: Якщо :meth:`utcoffset` не повертає ``None``, :meth:`dst` також не має повертати ``None``.

source: The default implementation of :meth:`utcoffset` raises :exc:`NotImplementedError`.
uk: Стандартна реалізація :meth:`utcoffset` викликає :exc:`NotImplementedError`.

source: Return the daylight saving time (DST) adjustment, as a :class:`timedelta` object or ``None`` if DST information isn't known.
uk: Повертає коригування літнього часу (DST) як об’єкт :class:`timedelta` або ``None``, якщо інформація про літній час невідома.

source: Return ``timedelta(0)`` if DST is not in effect. If DST is in effect, return the offset as a :class:`timedelta` object (see :meth:`utcoffset` for details). Note that DST offset, if applicable, has already been added to the UTC offset returned by :meth:`utcoffset`, so there's no need to consult :meth:`dst` unless you're interested in obtaining DST info separately. For example, :meth:`datetime.timetuple` calls its :attr:`~.datetime.tzinfo` attribute's :meth:`dst` method to determine how the :attr:`tm_isdst` flag should be set, and :meth:`tzinfo.fromutc` calls :meth:`dst` to account for DST changes when crossing time zones.
uk: Повертає ``timedelta(0)``, якщо літній час не діє. Якщо діє літній час, поверніть зсув як об’єкт :class:`timedelta` (докладніше див. у :meth:`utcoffset`). Зверніть увагу, що зсув літнього часу, якщо він застосовний, уже додано до зсуву UTC, який повертає :meth:`utcoffset`, тому немає потреби звертатися до :meth:`dst`, якщо ви не зацікавлені в отриманні інформації про літній час окремо. Наприклад, :meth:`datetime.timetuple` викликає метод :meth:`dst` свого атрибута :attr:`~.datetime.tzinfo`, щоб визначити, як слід встановити прапор :attr:`tm_isdst`, і :meth:`tzinfo.fromutc` викликає :meth:`dst` для врахування змін літнього часу під час перетину часових поясів.

source: An instance *tz* of a :class:`tzinfo` subclass that models both standard and daylight times must be consistent in this sense:
uk: Екземпляр *tz* підкласу :class:`tzinfo`, який моделює як стандартний, так і денний час, має бути послідовним у цьому сенсі:

source: must return the same result for every :class:`.datetime` *dt* with ``dt.tzinfo == tz`` For sane :class:`tzinfo` subclasses, this expression yields the time zone's "standard offset", which should not depend on the date or the time, but only on geographic location. The implementation of :meth:`datetime.astimezone` relies on this, but cannot detect violations; it's the programmer's responsibility to ensure it. If a :class:`tzinfo` subclass cannot guarantee this, it may be able to override the default implementation of :meth:`tzinfo.fromutc` to work correctly with :meth:`astimezone` regardless.
uk: повинен повертати той самий результат для кожного :class:`.datetime` *dt* з ``dt.tzinfo == tz`` Для розумних підкласів :class:`tzinfo` цей вираз дає "стандартний зсув" часового поясу, який має залежати не від дати чи часу, а лише від географічного розташування. Реалізація :meth:`datetime.astimezone` покладається на це, але не може виявити порушення; це відповідальність програміста забезпечити це. Якщо підклас :class:`tzinfo` не може гарантувати це, він може замінити реалізацію за замовчуванням :meth:`tzinfo.fromutc` для правильної роботи з :meth:`astimezone` незалежно від цього.

source: Most implementations of :meth:`dst` will probably look like one of these two::
uk: Більшість реалізацій :meth:`dst`, ймовірно, виглядатимуть як одна з цих двох:

source: or::
uk: або::

source: The default implementation of :meth:`dst` raises :exc:`NotImplementedError`.
uk: Стандартна реалізація :meth:`dst` викликає :exc:`NotImplementedError`.

source: Return the time zone name corresponding to the :class:`.datetime` object *dt*, as a string. Nothing about string names is defined by the :mod:`datetime` module, and there's no requirement that it mean anything in particular. For example, "GMT", "UTC", "-500", "-5:00", "EDT", "US/Eastern", "America/New York" are all valid replies. Return ``None`` if a string name isn't known. Note that this is a method rather than a fixed string primarily because some :class:`tzinfo` subclasses will wish to return different names depending on the specific value of *dt* passed, especially if the :class:`tzinfo` class is accounting for daylight time.
uk: Повертає назву часового поясу, що відповідає об’єкту :class:`.datetime` *dt*, у вигляді рядка. Модуль :mod:`datetime` нічого не визначає щодо назв рядків, і немає жодних вимог, щоб вони означали щось конкретне. Наприклад, "GMT", "UTC", "-500", "-5:00", "EDT", "US/Eastern", "America/New York" — усі дійсні відповіді. Повертає ``None``, якщо назва рядка невідома. Зауважте, що це метод, а не фіксований рядок, перш за все тому, що деякі підкласи :class:`tzinfo` бажають повертати різні імена залежно від конкретного переданого значення *dt*, особливо якщо клас :class:`tzinfo` є обліковим для світлового часу.

source: The default implementation of :meth:`tzname` raises :exc:`NotImplementedError`.
uk: Стандартна реалізація :meth:`tzname` викликає :exc:`NotImplementedError`.

source: These methods are called by a :class:`.datetime` or :class:`.time` object, in response to their methods of the same names. A :class:`.datetime` object passes itself as the argument, and a :class:`.time` object passes ``None`` as the argument. A :class:`tzinfo` subclass's methods should therefore be prepared to accept a *dt* argument of ``None``, or of class :class:`.datetime`.
uk: Ці методи викликаються об’єктом :class:`.datetime` або :class:`.time` у відповідь на їх однойменні методи. Об’єкт :class:`.datetime` передає себе як аргумент, а об’єкт :class:`.time` передає ``None`` як аргумент. Таким чином, методи підкласу :class:`tzinfo` повинні бути готові прийняти аргумент *dt* ``None`` або клас :class:`.datetime`.
