Repository: python/python-docs-uk
Catalog: library/datetime.po
Languages: uk

source: :mod:`datetime` --- Basic date and time types
uk: :mod:`datetime` --- Основні типи дати та часу

source: **Source code:** :source:`Lib/datetime.py`
uk: **Вихідний код:** :source:`Lib/datetime.py`

source: The :mod:`datetime` module supplies classes for manipulating dates and times.
uk: Модуль :mod:`datetime` надає класи для роботи з датами та часом.

source: While date and time arithmetic is supported, the focus of the implementation is on efficient attribute extraction for output formatting and manipulation.
uk: Хоча арифметика дати й часу підтримується, основна увага при реалізації зосереджена на ефективному вилученні атрибутів для форматування виводу та обробки.

source: Module :mod:`calendar`
uk: Модуль :mod:`calendar`

source: General calendar related functions.
uk: Загальні функції, пов’язані з календарем.

source: Module :mod:`time`
uk: Модуль :mod:`time`

source: Time access and conversions.
uk: Доступ до часу та перетворення.

source: Module :mod:`zoneinfo`
uk: Модуль :mod:`zoneinfo`

source: Concrete time zones representing the IANA time zone database.
uk: Конкретні часові пояси, що представляють базу даних часових поясів IANA.

source: Package `dateutil <https://dateutil.readthedocs.io/en/stable/>`_
uk: Пакет `dateutil <https://dateutil.readthedocs.io/en/stable/>`_

source: Third-party library with expanded time zone and parsing support.
uk: Бібліотека третьої сторони з розширеним часовим поясом і підтримкою аналізу.

source: Aware and Naive Objects
uk: Обізнані та наївні об’єкти

source: Date and time objects may be categorized as "aware" or "naive" depending on whether or not they include timezone information.
uk: Об’єкти дати та часу можуть бути класифіковані як "відомі" або "наївні" залежно від того, чи містять вони інформацію про часовий пояс.

source: With sufficient knowledge of applicable algorithmic and political time adjustments, such as time zone and daylight saving time information, an **aware** object can locate itself relative to other aware objects. An aware object represents a specific moment in time that is not open to interpretation. [#]_
uk: Завдяки достатнім знанням застосовних алгоритмів і політичних коригувань часу, таких як інформація про часовий пояс і літній час, **свідомий** об’єкт може визначити своє місцезнаходження відносно інших обізнаних об’єктів. Усвідомлюваний об'єкт представляє конкретний момент часу, який не піддається інтерпретації. [#]_

source: A **naive** object does not contain enough information to unambiguously locate itself relative to other date/time objects. Whether a naive object represents Coordinated Universal Time (UTC), local time, or time in some other timezone is purely up to the program, just like it is up to the program whether a particular number represents metres, miles, or mass. Naive objects are easy to understand and to work with, at the cost of ignoring some aspects of reality.
uk: **Наївний** об’єкт не містить достатньо інформації, щоб однозначно визначити його місцезнаходження відносно інших об’єктів дати/часу. Програма вирішує, чи відображатиме простий об’єкт всесвітній координований час (UTC), місцевий час чи час в якомусь іншому часовому поясі, так само як програма вирішує, чи позначає конкретне число метри, милі чи масу. Наївні об’єкти легко зрозуміти і з ними легко працювати, ціною ігнорування деяких аспектів реальності.

source: For applications requiring aware objects, :class:`.datetime` and :class:`.time` objects have an optional time zone information attribute, :attr:`!tzinfo`, that can be set to an instance of a subclass of the abstract :class:`tzinfo` class. These :class:`tzinfo` objects capture information about the offset from UTC time, the time zone name, and whether daylight saving time is in effect.
uk: Для додатків, яким потрібні об’єкти, об’єкти :class:`.datetime` і :class:`.time` мають необов’язковий атрибут інформації про часовий пояс, :attr:`!tzinfo`, який можна встановити як екземпляр підкласу абстрактний :class:`tzinfo` клас. Ці об’єкти :class:`tzinfo` зберігають інформацію про зміщення від часу UTC, назву часового поясу та чи діє літній час.

source: Only one concrete :class:`tzinfo` class, the :class:`timezone` class, is supplied by the :mod:`datetime` module. The :class:`timezone` class can represent simple timezones with fixed offsets from UTC, such as UTC itself or North American EST and EDT timezones. Supporting timezones at deeper levels of detail is up to the application. The rules for time adjustment across the world are more political than rational, change frequently, and there is no standard suitable for every application aside from UTC.
uk: Тільки один конкретний клас :class:`tzinfo`, клас :class:`timezone`, надається модулем :mod:`datetime`. Клас :class:`timezone` може представляти прості часові пояси з фіксованими зсувами відносно UTC, наприклад сам UTC або північноамериканські часові пояси EST і EDT. Підтримка часових поясів на глибшому рівні деталізації залежить від програми. Правила коригування часу в усьому світі є більше політичними, ніж раціональними, часто змінюються, і немає стандарту, який підходить для кожного застосування, крім UTC.

source: Constants
uk: Константи

source: The :mod:`datetime` module exports the following constants:
uk: Модуль :mod:`datetime` експортує такі константи:

source: The smallest year number allowed in a :class:`date` or :class:`.datetime` object. :const:`MINYEAR` is ``1``.
uk: Найменше число року, дозволене в об’єкті :class:`date` або :class:`.datetime`. :const:`MINYEAR` — це ``1``.

source: The largest year number allowed in a :class:`date` or :class:`.datetime` object. :const:`MAXYEAR` is ``9999``.
uk: Найбільший номер року, дозволений в об’єкті :class:`date` або :class:`.datetime`. :const:`MAXYEAR` дорівнює ``9999``.

source: Available Types
uk: Доступні типи

source: An idealized naive date, assuming the current Gregorian calendar always was, and always will be, in effect. Attributes: :attr:`year`, :attr:`month`, and :attr:`day`.
uk: Ідеалізована наївна дата, припускаючи, що поточний григоріанський календар завжди був і завжди буде в силі. Атрибути: :attr:`year`, :attr:`month` і :attr:`day`.

source: An idealized time, independent of any particular day, assuming that every day has exactly 24\*60\*60 seconds. (There is no notion of "leap seconds" here.) Attributes: :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, and :attr:`.tzinfo`.
uk: Ідеалізований час, незалежний від будь-якого конкретного дня, припускаючи, що кожен день має рівно 24\*60\*60 секунд. (Тут немає поняття "високосні секунди".) Атрибути: :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond` і :attr:`.tzinfo`.

source: A combination of a date and a time. Attributes: :attr:`year`, :attr:`month`, :attr:`day`, :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, and :attr:`.tzinfo`.
uk: Поєднання дати й часу. Атрибути: :attr:`year`, :attr:`month`, :attr:`day`, :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond` і :attr:`.tzinfo`.

source: A duration expressing the difference between two :class:`date`, :class:`.time`, or :class:`.datetime` instances to microsecond resolution.
uk: Тривалість, яка виражає різницю між двома екземплярами :class:`date`, :class:`.time` або :class:`.datetime` у мікросекундах.

source: An abstract base class for time zone information objects. These are used by the :class:`.datetime` and :class:`.time` classes to provide a customizable notion of time adjustment (for example, to account for time zone and/or daylight saving time).
uk: Абстрактний базовий клас для інформаційних об’єктів часового поясу. Вони використовуються класами :class:`.datetime` і :class:`.time` для надання настроюваного поняття коригування часу (наприклад, для врахування часового поясу та/або літнього часу).

source: A class that implements the :class:`tzinfo` abstract base class as a fixed offset from the UTC.
uk: Клас, який реалізує :class:`tzinfo` абстрактний базовий клас як фіксоване зміщення від UTC.

source: Objects of these types are immutable.
uk: Об'єкти цих типів незмінні.

source: Subclass relationships::
uk: Відносини підкласів::

source: Common Properties
uk: Загальні властивості

source: The :class:`date`, :class:`.datetime`, :class:`.time`, and :class:`timezone` types share these common features:
uk: Типи :class:`date`, :class:`.datetime`, :class:`.time` і :class:`timezone` мають такі спільні риси:

source: Objects of these types are hashable, meaning that they can be used as dictionary keys.
uk: Об’єкти цих типів можна хешувати, тобто їх можна використовувати як ключі словника.

source: Objects of these types support efficient pickling via the :mod:`pickle` module.
uk: Об’єкти цих типів підтримують ефективне маринування за допомогою модуля :mod:`pickle`.

source: Determining if an Object is Aware or Naive
uk: Визначення того, чи є об’єкт усвідомленим чи наївним

source: Objects of the :class:`date` type are always naive.
uk: Об’єкти типу :class:`date` завжди наївні.

source: An object of type :class:`.time` or :class:`.datetime` may be aware or naive.
uk: Об’єкт типу :class:`.time` або :class:`.datetime` може бути обізнаним або наївним.

source: A :class:`.datetime` object *d* is aware if both of the following hold:
uk: Об’єкт :class:`.datetime` *d* відомий, якщо виконуються обидва наступні умови:

source: ``d.tzinfo`` is not ``None``
uk: ``d.tzinfo`` не є ``None``

source: ``d.tzinfo.utcoffset(d)`` does not return ``None``
uk: ``d.tzinfo.utcoffset(d)`` не повертає ``None``

source: Otherwise, *d* is naive.
uk: Інакше *d* наївно.

source: A :class:`.time` object *t* is aware if both of the following hold:
uk: Об’єкт :class:`.time` *t* усвідомлює, якщо виконуються обидва наступні умови:

source: ``t.tzinfo`` is not ``None``
uk: ``t.tzinfo`` не є ``None``

source: ``t.tzinfo.utcoffset(None)`` does not return ``None``.
uk: ``t.tzinfo.utcoffset(None)`` не повертає ``None``.

source: Otherwise, *t* is naive.
uk: В іншому випадку *t* наївний.

source: The distinction between aware and naive doesn't apply to :class:`timedelta` objects.
uk: Розрізнення між обізнаним і наївним не стосується об’єктів :class:`timedelta`.

source: :class:`timedelta` Objects
uk: :class:`timedelta` Об'єкти

source: A :class:`timedelta` object represents a duration, the difference between two dates or times.
uk: Об’єкт :class:`timedelta` представляє тривалість, різницю між двома датами або часом.

source: All arguments are optional and default to ``0``. Arguments may be integers or floats, and may be positive or negative.
uk: Усі аргументи є необов’язковими та за умовчанням мають значення ``0``. Аргументи можуть бути цілими числами або числами з плаваючою речовиною, а також бути позитивними або негативними.

source: Only *days*, *seconds* and *microseconds* are stored internally. Arguments are converted to those units:
uk: Усередині зберігаються лише *дні*, *секунди* та *мікросекунди*. Аргументи конвертуються в такі одиниці:

source: A millisecond is converted to 1000 microseconds.
uk: Мілісекунда перетворюється на 1000 мікросекунд.

source: A minute is converted to 60 seconds.
uk: Хвилина перетворюється на 60 секунд.

source: An hour is converted to 3600 seconds.
uk: Година перетворюється на 3600 секунд.

source: A week is converted to 7 days.
uk: Тиждень перетворюється на 7 днів.

source: and days, seconds and microseconds are then normalized so that the representation is unique, with
uk: і дні, секунди та мікросекунди потім нормалізуються, щоб представлення було унікальним, з

source: ``0 <= microseconds < 1000000``
uk: ``0 <= мікросекунди < 1000000``

source: ``0 <= seconds < 3600*24`` (the number of seconds in one day)
uk: ``0 <= секунд < 3600*24`` (кількість секунд в одному дні)

source: ``-999999999 <= days <= 999999999``
uk: ``-999999999 <= днів <= 999999999``

source: The following example illustrates how any arguments besides *days*, *seconds* and *microseconds* are "merged" and normalized into those three resulting attributes::
uk: У наступному прикладі показано, як будь-які аргументи, окрім *днів*, *секунд* і *мікросекунд*, "об’єднуються" та нормалізуються в ці три отримані атрибути:

source: If any argument is a float and there are fractional microseconds, the fractional microseconds left over from all arguments are combined and their sum is rounded to the nearest microsecond using round-half-to-even tiebreaker. If no argument is a float, the conversion and normalization processes are exact (no information is lost).
uk: Якщо будь-який аргумент є числом із плаваючою точкою та є дробові мікросекунди, дробові мікросекунди, що залишилися від усіх аргументів, об’єднуються, а їхня сума округлюється до найближчої мікросекунди за допомогою тай-брейку округлення від половини до навіть. Якщо жоден аргумент не є числом з плаваючою речовиною, процеси перетворення та нормалізації є точними (інформація не втрачається).

source: If the normalized value of days lies outside the indicated range, :exc:`OverflowError` is raised.
uk: Якщо нормалізоване значення днів лежить за межами зазначеного діапазону, виникає :exc:`OverflowError`.

source: Note that normalization of negative values may be surprising at first. For example::
uk: Зверніть увагу, що нормалізація від’ємних значень спочатку може викликати подив. Наприклад::

source: Class attributes:
uk: Атрибути класу:

source: The most negative :class:`timedelta` object, ``timedelta(-999999999)``.
uk: Найбільш негативний об’єкт :class:`timedelta`, ``timedelta(-999999999)``.

source: The most positive :class:`timedelta` object, ``timedelta(days=999999999, hours=23, minutes=59, seconds=59, microseconds=999999)``.
uk: Найбільш позитивний об’єкт :class:`timedelta`, ``timedelta(days=999999999, hours=23, minutes=59, seconds=59, microseconds=999999)``.

source: The smallest possible difference between non-equal :class:`timedelta` objects, ``timedelta(microseconds=1)``.
uk: Найменша можлива різниця між нерівними об’єктами :class:`timedelta`, ``timedelta(microseconds=1)``.

source: Note that, because of normalization, ``timedelta.max`` > ``-timedelta.min``. ``-timedelta.max`` is not representable as a :class:`timedelta` object.
uk: Зауважте, що через нормалізацію ``timedelta.max`` > ``-timedelta.min``. ``-timedelta.max`` не можна представити як об’єкт :class:`timedelta`.

source: Instance attributes (read-only):
uk: Атрибути екземпляра (тільки для читання):

source: Attribute
uk: Атрибут

source: Value
uk: Значення

source: ``days``
uk: ``дні``

source: Between -999999999 and 999999999 inclusive
uk: Від -999999999 до 999999999 включно

source: ``seconds``
uk: ``секунди``

source: Between 0 and 86399 inclusive
uk: Від 0 до 86399 включно

source: ``microseconds``
uk: ``мікросекунди``

source: Between 0 and 999999 inclusive
uk: Від 0 до 999999 включно

source: Supported operations:
uk: Підтримувані операції:

source: Operation
uk: Операція

source: Result
uk: Результат

source: Sum of *t2* and *t3*. Afterwards *t1*-*t2* == *t3* and *t1*-*t3* == *t2* are true. (1)
uk: Сума *t2* і *t3*. Після цього *t1*-*t2* == *t3* і *t1*-*t3* == *t2* вірні. (1)

source: Difference of *t2* and *t3*. Afterwards *t1* == *t2* - *t3* and *t2* == *t1* + *t3* are true. (1)(6)
uk: Різниця *t2* і *t3*. Після цього *t1* == *t2* - *t3* і *t2* == *t1* + *t3* вірні. (1)(6)

source: ``t1 = t2 * i or t1 = i * t2``
uk: ``t1 = t2 * i або t1 = i * t2``

source: Delta multiplied by an integer. Afterwards *t1* // i == *t2* is true, provided ``i != 0``.
uk: Дельта, помножена на ціле число. Після цього *t1* // i == *t2* є істинним, якщо ``i != 0``.

source: In general, *t1* \* i == *t1* \* (i-1) + *t1* is true. (1)
uk: Загалом *t1* \* i == *t1* \* (i-1) + *t1* вірно. (1)

source: ``t1 = t2 * f or t1 = f * t2``
uk: ``t1 = t2 * f або t1 = f * t2``

source: Delta multiplied by a float. The result is rounded to the nearest multiple of timedelta.resolution using round-half-to-even.
uk: Дельта, помножена на float. Результат округлюється до найближчого кратного timedelta.resolution за допомогою округлення від половини до навіть.

source: Division (3) of overall duration *t2* by interval unit *t3*. Returns a :class:`float` object.
uk: Поділ (3) загальної тривалості *t2* на одиницю інтервалу *t3*. Повертає об’єкт :class:`float`.

source: ``t1 = t2 / f or t1 = t2 / i``
uk: ``t1 = t2 / f або t1 = t2 / i``

source: Delta divided by a float or an int. The result is rounded to the nearest multiple of timedelta.resolution using round-half-to-even.
uk: Дельта, поділена на float або int. Результат округлюється до найближчого кратного timedelta.resolution за допомогою округлення від половини до навіть.

source: ``t1 = t2 // i`` or ``t1 = t2 // t3``
uk: ``t1 = t2 // i`` або ``t1 = t2 // t3``

source: The floor is computed and the remainder (if any) is thrown away. In the second case, an integer is returned. (3)
uk: Підлога обчислюється, а залишок (якщо є) викидається. У другому випадку повертається ціле число. (3)

source: The remainder is computed as a :class:`timedelta` object. (3)
uk: Залишок обчислюється як об’єкт :class:`timedelta`. (3)

source: Computes the quotient and the remainder: ``q = t1 // t2`` (3) and ``r = t1 % t2``. q is an integer and r is a :class:`timedelta` object.
uk: Обчислює частку та залишок: ``q = t1 // t2`` (3) і ``r = t1 % t2``. q — ціле число, а r — об’єкт :class:`timedelta`.

source: Returns a :class:`timedelta` object with the same value. (2)
uk: Повертає об’єкт :class:`timedelta` з тим самим значенням. (2)

source: equivalent to :class:`timedelta`\ (-*t1.days*, -*t1.seconds*, -*t1.microseconds*), and to *t1*\* -1. (1)(4)
uk: еквівалентно :class:`timedelta`\ (-*t1.days*, -*t1.seconds*, -*t1.microseconds*) і *t1*\* -1. (1)(4)

source: equivalent to +\ *t* when ``t.days >= 0``, and to -*t* when ``t.days < 0``. (2)
uk: еквівалент +\ *t*, коли ``t.days >= 0``, і до -*t*, коли ``t.days < 0``. (2)

source: Returns a string in the form ``[D day[s], ][H]H:MM:SS[.UUUUUU]``, where D is negative for negative ``t``. (5)
uk: Повертає рядок у формі ``[D day[s], ][H]H:MM:SS[.UUUUUU]``, де D є від’ємним для від’ємного ``t``. (5)

source: Returns a string representation of the :class:`timedelta` object as a constructor call with canonical attribute values.
uk: Повертає рядкове представлення об’єкта :class:`timedelta` як виклик конструктора з канонічними значеннями атрибутів.

source: Notes:
uk: Примітки:

source: This is exact but may overflow.
uk: Це точно, але може переповнюватись.

source: This is exact and cannot overflow.
uk: Це точно і не може переповнюватися.

source: Division by 0 raises :exc:`ZeroDivisionError`.
uk: Ділення на 0 викликає :exc:`ZeroDivisionError`.

source: -*timedelta.max* is not representable as a :class:`timedelta` object.
uk: -*timedelta.max* не можна представити як об’єкт :class:`timedelta`.

source: String representations of :class:`timedelta` objects are normalized similarly to their internal representation. This leads to somewhat unusual results for negative timedeltas. For example::
uk: Рядкові представлення об’єктів :class:`timedelta` нормалізуються подібно до їх внутрішнього представлення. Це призводить до дещо незвичайних результатів для негативних часових дельт. Наприклад::

source: The expression ``t2 - t3`` will always be equal to the expression ``t2 + (-t3)`` except when t3 is equal to ``timedelta.max``; in that case the former will produce a result while the latter will overflow.
uk: Вираз ``t2 - t3`` завжди дорівнюватиме виразу ``t2 + (-t3)``, за винятком випадків, коли t3 дорівнює ``timedelta.max``; у цьому випадку перший дасть результат, а другий переповниться.

source: In addition to the operations listed above, :class:`timedelta` objects support certain additions and subtractions with :class:`date` and :class:`.datetime` objects (see below).
uk: Окрім перерахованих вище операцій, об’єкти :class:`timedelta` підтримують певні додавання та віднімання за допомогою об’єктів :class:`date` і :class:`.datetime` (див. нижче).

source: Floor division and true division of a :class:`timedelta` object by another :class:`timedelta` object are now supported, as are remainder operations and the :func:`divmod` function. True division and multiplication of a :class:`timedelta` object by a :class:`float` object are now supported.
uk: Тепер підтримується поділ на поверх і справжній поділ об’єкта :class:`timedelta` на інший об’єкт :class:`timedelta`, а також операції з залишком і функція :func:`divmod`. Тепер підтримується справжнє ділення та множення об’єкта :class:`timedelta` на об’єкт :class:`float`.

source: Comparisons of :class:`timedelta` objects are supported, with some caveats.
uk: Порівняння об’єктів :class:`timedelta` підтримуються з деякими застереженнями.

source: The comparisons ``==`` or ``!=`` *always* return a :class:`bool`, no matter the type of the compared object::
uk: Порівняння ``==`` або ``!=`` *завжди* повертає :class:`bool`, незалежно від типу порівнюваного об’єкта::

source: For all other comparisons (such as ``<`` and ``>``), when a :class:`timedelta` object is compared to an object of a different type, :exc:`TypeError` is raised::
uk: Для всіх інших порівнянь (таких як ``<`` and ``>``), коли об’єкт :class:`timedelta` порівнюється з об’єктом іншого типу, виникає :exc:`TypeError`::

source: In Boolean contexts, a :class:`timedelta` object is considered to be true if and only if it isn't equal to ``timedelta(0)``.
uk: У логічних контекстах об’єкт :class:`timedelta` вважається істинним тоді і тільки тоді, коли він не дорівнює ``timedelta(0)``.

source: Instance methods:
uk: Методи екземплярів:

source: Return the total number of seconds contained in the duration. Equivalent to ``td / timedelta(seconds=1)``. For interval units other than seconds, use the division form directly (e.g. ``td / timedelta(microseconds=1)``).
uk: Повертає загальну кількість секунд, що міститься в тривалості. Еквівалент ``td / timedelta(seconds=1)``. Для одиниць інтервалу, відмінних від секунд, використовуйте напряму форму ділення (наприклад, ``td / timedelta(мікросекунди=1)``).

source: Note that for very large time intervals (greater than 270 years on most platforms) this method will lose microsecond accuracy.
uk: Зауважте, що для дуже великих інтервалів часу (понад 270 років на більшості платформ) цей метод втратить мікросекундну точність.

source: Examples of usage: :class:`timedelta`
uk: Приклади використання: :class:`timedelta`

source: An additional example of normalization::
uk: Додатковий приклад нормалізації::

source: Examples of :class:`timedelta` arithmetic::
uk: Приклади арифметики :class:`timedelta`::

source: :class:`date` Objects
uk: :class:`date` Об'єкти

source: A :class:`date` object represents a date (year, month and day) in an idealized calendar, the current Gregorian calendar indefinitely extended in both directions.
uk: Об’єкт :class:`date` представляє дату (рік, місяць і день) в ідеалізованому календарі, поточний григоріанський календар необмежено розширений в обох напрямках.

source: January 1 of year 1 is called day number 1, January 2 of year 1 is called day number 2, and so on. [#]_
uk: 1 січня року 1 називається днем номер 1, 2 січня року 1 називається днем номер 2 і так далі. [#]_

source: All arguments are required. Arguments must be integers, in the following ranges:
uk: Всі аргументи необхідні. Аргументи мають бути цілими числами в таких діапазонах:

source: ``MINYEAR <= year <= MAXYEAR``
uk: ``MINYEAR <= рік <= MAXYEAR``

source: ``1 <= month <= 12``
uk: ``1 <= місяць <= 12``

source: ``1 <= day <= number of days in the given month and year``
uk: ``1 <= день <= кількість днів у заданому місяці та році``

source: If an argument outside those ranges is given, :exc:`ValueError` is raised.
uk: Якщо вказано аргумент поза цими діапазонами, виникає :exc:`ValueError`.

source: Other constructors, all class methods:
uk: Інші конструктори, усі методи класу:
