Repository: python/python-docs-uk
Catalog: library/datetime.po
Languages: uk

source: For the same reason, handling of format strings containing Unicode code points that can't be represented in the charset of the current locale is also platform-dependent. On some platforms such code points are preserved intact in the output, while on others ``strftime`` may raise :exc:`UnicodeError` or return an empty string instead.
uk: З тієї ж причини обробка рядків формату, що містять кодові точки Юнікоду, які не можуть бути представлені в наборі символів поточної локалі, також залежить від платформи. На деяких платформах такі кодові точки зберігаються недоторканими у виводі, тоді як на інших ``strftime`` може викликати :exc:`UnicodeError` або замість цього повертати порожній рядок.

source: Because the format depends on the current locale, care should be taken when making assumptions about the output value. Field orderings will vary (for example, "month/day/year" versus "day/month/year"), and the output may contain Unicode characters encoded using the locale's default encoding (for example, if the current locale is ``ja_JP``, the default encoding could be any one of ``eucJP``, ``SJIS``, or ``utf-8``; use :meth:`locale.getlocale` to determine the current locale's encoding).
uk: Оскільки формат залежить від поточної мови, слід бути обережним, роблячи припущення щодо вихідного значення. Порядок полів буде різним (наприклад, "місяць/день/рік" проти "день/місяць/рік"), а вихідні дані можуть містити символи Юнікоду, закодовані з використанням стандартного кодування мови (наприклад, якщо поточна мова ``ja_JP``, кодуванням за замовчуванням може бути будь-яке з ``eucJP``, ``SJIS`` або ``utf-8``; використовуйте :meth:`locale.getlocale`, щоб визначити кодування поточної мови).

source: The :meth:`strptime` method can parse years in the full [1, 9999] range, but years < 1000 must be zero-filled to 4-digit width.
uk: Метод :meth:`strptime` може аналізувати роки в повному діапазоні [1, 9999], але роки < 1000 повинні бути заповнені нулями до 4-значної ширини.

source: In previous versions, :meth:`strftime` method was restricted to years >= 1900.
uk: У попередніх версіях метод :meth:`strftime` був обмежений роками >= 1900.

source: In version 3.2, :meth:`strftime` method was restricted to years >= 1000.
uk: У версії 3.2 метод :meth:`strftime` був обмежений роками >= 1000.

source: When used with the :meth:`strptime` method, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
uk: У разі використання з методом :meth:`strptime` директива ``%p`` впливає на поле вихідних годин, лише якщо директива ``%I`` використовується для аналізу години.

source: Unlike the :mod:`time` module, the :mod:`datetime` module does not support leap seconds.
uk: На відміну від модуля :mod:`time`, модуль :mod:`datetime` не підтримує високосні секунди.

source: When used with the :meth:`strptime` method, the ``%f`` directive accepts from one to six digits and zero pads on the right. ``%f`` is an extension to the set of format characters in the C standard (but implemented separately in datetime objects, and therefore always available).
uk: При використанні з методом :meth:`strptime` директива ``%f`` приймає від однієї до шести цифр і нульові поля праворуч. ``%f`` — це розширення набору форматних символів у стандарті C (але реалізоване окремо в об’єктах datetime, і тому завжди доступне).

source: For a naive object, the ``%z`` and ``%Z`` format codes are replaced by empty strings.
uk: Для простого об’єкта коди формату ``%z`` і ``%Z`` замінюються порожніми рядками.

source: For an aware object:
uk: Для обізнаного об’єкта:

source: :meth:`utcoffset` is transformed into a string of the form ``±HHMM[SS[.ffffff]]``, where ``HH`` is a 2-digit string giving the number of UTC offset hours, ``MM`` is a 2-digit string giving the number of UTC offset minutes, ``SS`` is a 2-digit string giving the number of UTC offset seconds and ``ffffff`` is a 6-digit string giving the number of UTC offset microseconds. The ``ffffff`` part is omitted when the offset is a whole number of seconds and both the ``ffffff`` and the ``SS`` part is omitted when the offset is a whole number of minutes. For example, if :meth:`utcoffset` returns ``timedelta(hours=-3, minutes=-30)``, ``%z`` is replaced with the string ``'-0330'``.
uk: :meth:`utcoffset` перетворюється на рядок у формі ``±HHMM[SS[.ffffff]]``, де ``HH`` — двозначний рядок, що вказує кількість годин зміщення UTC, ``MM`` — це 2-значний рядок, що вказує кількість хвилин зміщення UTC, ``SS`` — це 2-значний рядок, що вказує кількість секунд зміщення UTC, і ``ffffff`` — це 6-значний рядок, що дає число мікросекунд зсуву UTC. Частина ``ffffff`` опускається, якщо зміщення становить ціле число секунд, і частини ``ffffff`` і ``SS`` опускаються, коли зсув становить ціле число хвилин. Наприклад, якщо :meth:`utcoffset` повертає ``timedelta(hours=-3, minutes=-30)``, ``%z`` замінюється на рядок ``'-0330'``.

source: When the ``%z`` directive is provided to the :meth:`strptime` method, the UTC offsets can have a colon as a separator between hours, minutes and seconds. For example, ``'+01:00:00'`` will be parsed as an offset of one hour. In addition, providing ``'Z'`` is identical to ``'+00:00'``.
uk: Коли директива ``%z`` надається методу :meth:`strptime`, зміщення UTC можуть мати двокрапку як роздільник між годинами, хвилинами та секундами. Наприклад, "+01:00:00" буде проаналізовано як зсув на одну годину. Крім того, надання ``'Z'`` ідентично ``'+00:00'``.

source: In :meth:`strftime`, ``%Z`` is replaced by an empty string if :meth:`tzname` returns ``None``; otherwise ``%Z`` is replaced by the returned value, which must be a string.
uk: У :meth:`strftime` ``%Z`` замінюється порожнім рядком, якщо :meth:`tzname` повертає ``None``; інакше ``%Z`` замінюється на повернуте значення, яке має бути рядком.

source: :meth:`strptime` only accepts certain values for ``%Z``:
uk: :meth:`strptime` приймає лише певні значення для ``%Z``:

source: any value in ``time.tzname`` for your machine's locale
uk: будь-яке значення в ``time.tzname`` для локалі вашої машини

source: the hard-coded values ``UTC`` and ``GMT``
uk: жорстко закодовані значення ``UTC`` і ``GMT``

source: So someone living in Japan may have ``JST``, ``UTC``, and ``GMT`` as valid values, but probably not ``EST``. It will raise ``ValueError`` for invalid values.
uk: Тому хтось, хто живе в Японії, може мати дійсні значення ``JST``, ``UTC`` і ``GMT``, але, ймовірно, не ``EST``. Це викличе ``ValueError`` для недійсних значень.

source: When the ``%z`` directive is provided to the :meth:`strptime` method, an aware :class:`.datetime` object will be produced. The ``tzinfo`` of the result will be set to a :class:`timezone` instance.
uk: Коли директива ``%z`` надається методу :meth:`strptime`, буде створено відомий об’єкт :class:`.datetime`. ``tzinfo`` результату буде встановлено на екземпляр :class:`timezone`.

source: When used with the :meth:`strptime` method, ``%U`` and ``%W`` are only used in calculations when the day of the week and the calendar year (``%Y``) are specified.
uk: При використанні з методом :meth:`strptime`, ``%U`` і ``%W`` використовуються в обчисленнях лише тоді, коли вказано день тижня та календарний рік (``%Y``). .

source: Similar to ``%U`` and ``%W``, ``%V`` is only used in calculations when the day of the week and the ISO year (``%G``) are specified in a :meth:`strptime` format string. Also note that ``%G`` and ``%Y`` are not interchangeable.
uk: Подібно до ``%U`` і ``%W``, ``%V`` використовується в обчисленнях лише тоді, коли день тижня та рік ISO (``%G``) указано в :meth:`strptime` форматний рядок. Також зауважте, що ``%G`` і ``%Y`` не є взаємозамінними.

source: When used with the :meth:`strptime` method, the leading zero is optional for formats ``%d``, ``%m``, ``%H``, ``%I``, ``%M``, ``%S``, ``%J``, ``%U``, ``%W``, and ``%V``. Format ``%y`` does require a leading zero.
uk: У разі використання з методом :meth:`strptime` початковий нуль необов’язковий для форматів ``%d``, ``%m``, ``%H``, ``%I``, ``%M``, ``%S``, ``%J``, ``%U``, ``%W`` і ``%V``. Формат "%y" вимагає початкового нуля.

source: Footnotes
uk: Виноски

source: If, that is, we ignore the effects of Relativity
uk: Якщо, тобто, ми ігноруємо ефекти відносності

source: This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book *Calendrical Calculations*, where it's the base calendar for all computations. See the book for algorithms for converting between proleptic Gregorian ordinals and many other calendar systems.
uk: Це збігається з визначенням "пролептичного григоріанського" календаря в книзі Дершовіца та Рейнгольда "Календарні розрахунки*", де це базовий календар для всіх обчислень. Перегляньте книгу для алгоритмів перетворення між пролептичними григоріанськими ординалами та багатьма іншими календарними системами.

source: Passing ``datetime.strptime('Feb 29', '%b %d')`` will fail since ``1900`` is not a leap year.
uk: Передача ``datetime.strptime('Feb 29', '%b %d')`` буде невдалою, оскільки ``1900`` не є високосним роком.
