Repository: python/python-docs-uk
Catalog: library/devmode.po
Languages: uk

source: Python Development Mode
uk: Режим розробки Python

source: The Python Development Mode introduces additional runtime checks that are too expensive to be enabled by default. It should not be more verbose than the default if the code is correct; new warnings are only emitted when an issue is detected.
uk: Режим розробки Python вводить додаткові перевірки під час виконання, які занадто дорогі, щоб їх можна було ввімкнути за замовчуванням. Якщо код правильний, він не повинен бути більш детальним, ніж стандартний; нові попередження видаються лише тоді, коли виявляється проблема.

source: It can be enabled using the :option:`-X dev <-X>` command line option or by setting the :envvar:`PYTHONDEVMODE` environment variable to ``1``.
uk: Його можна ввімкнути за допомогою параметра командного рядка :option:`-X dev <-X>` або встановивши для змінної середовища :envvar:`PYTHONDEVMODE` значення ``1``.

source: See also :ref:`Python debug build <debug-build>`.
uk: Дивіться також :ref:`Python debug build <debug-build>`.

source: Effects of the Python Development Mode
uk: Ефекти режиму розробки Python

source: Enabling the Python Development Mode is similar to the following command, but with additional effects described below::
uk: Увімкнення режиму розробки Python подібне до наступної команди, але з додатковими ефектами, описаними нижче:

source: Effects of the Python Development Mode:
uk: Наслідки режиму розробки Python:

source: Add ``default`` :ref:`warning filter <describing-warning-filters>`. The following warnings are shown:
uk: Додайте ``за замовчуванням`` :ref:`фільтр попереджень <describing-warning-filters>`. Відображаються такі попередження:

source: Normally, the above warnings are filtered by the default :ref:`warning filters <describing-warning-filters>`.
uk: Зазвичай наведені вище попередження фільтруються стандартними :ref:`фільтрами попереджень <describing-warning-filters>`.

source: It behaves as if the :option:`-W default <-W>` command line option is used.
uk: Він поводиться так, ніби використовується параметр командного рядка :option:`-W за замовчуванням <-W>`.

source: Use the :option:`-W error <-W>` command line option or set the :envvar:`PYTHONWARNINGS` environment variable to ``error`` to treat warnings as errors.
uk: Використовуйте параметр командного рядка :option:`-W error <-W>` або встановіть для змінної середовища :envvar:`PYTHONWARNINGS` значення ``error``, щоб розглядати попередження як помилки.

source: Install debug hooks on memory allocators to check for:
uk: Встановіть перехоплювачі налагодження на розподілювачі пам’яті, щоб перевірити:

source: Buffer underflow
uk: Недоповнення буфера

source: Buffer overflow
uk: Переповнення буфера

source: Memory allocator API violation
uk: Порушення API розподілювача пам'яті

source: Unsafe usage of the GIL
uk: Небезпечне використання GIL

source: See the :c:func:`PyMem_SetupDebugHooks` C function.
uk: Перегляньте функцію C :c:func:`PyMem_SetupDebugHooks`.

source: It behaves as if the :envvar:`PYTHONMALLOC` environment variable is set to ``debug``.
uk: Він поводиться так, ніби для змінної середовища :envvar:`PYTHONMALLOC` встановлено значення ``debug``.

source: To enable the Python Development Mode without installing debug hooks on memory allocators, set the :envvar:`PYTHONMALLOC` environment variable to ``default``.
uk: Щоб увімкнути режим розробки Python, не встановлюючи налагоджувальні засоби розподілення пам’яті, встановіть для змінної середовища :envvar:`PYTHONMALLOC` значення ``default``.

source: It behaves as if the :option:`-X faulthandler <-X>` command line option is used or if the :envvar:`PYTHONFAULTHANDLER` environment variable is set to ``1``.
uk: Він поводиться так, ніби використовується параметр командного рядка :option:`-X faulthandler <-X>` або якщо змінна середовища :envvar:`PYTHONFAULTHANDLER` має значення ``1``.

source: Enable :ref:`asyncio debug mode <asyncio-debug-mode>`. For example, :mod:`asyncio` checks for coroutines that were not awaited and logs them.
uk: Увімкнути :ref:`асинхронний режим налагодження <asyncio-debug-mode>`. Наприклад, :mod:`asyncio` перевіряє співпрограми, які не були очікувані, і реєструє їх.

source: It behaves as if the :envvar:`PYTHONASYNCIODEBUG` environment variable is set to ``1``.
uk: Він поводиться так, ніби для змінної середовища :envvar:`PYTHONASYNCIODEBUG` встановлено значення ``1``.

source: Check the *encoding* and *errors* arguments for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
uk: Перевірте аргументи *encoding* і *errors* для операцій кодування та декодування рядків. Приклади: :func:`open`, :meth:`str.encode` і :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings.
uk: За замовчуванням для найкращої продуктивності аргумент *errors* перевіряється лише при першій помилці кодування/декодування, а аргумент *encoding* іноді ігнорується для порожніх рядків.

source: The :class:`io.IOBase` destructor logs ``close()`` exceptions.
uk: Деструктор :class:`io.IOBase` реєструє винятки ``close()``.

source: The Python Development Mode does not enable the :mod:`tracemalloc` module by default, because the overhead cost (to performance and memory) would be too large. Enabling the :mod:`tracemalloc` module provides additional information on the origin of some errors. For example, :exc:`ResourceWarning` logs the traceback where the resource was allocated, and a buffer overflow error logs the traceback where the memory block was allocated.
uk: Режим розробки Python не вмикає модуль :mod:`tracemalloc` за замовчуванням, оскільки накладні витрати (для продуктивності та пам’яті) будуть занадто великими. Увімкнення модуля :mod:`tracemalloc` надає додаткову інформацію про походження деяких помилок. Наприклад, :exc:`ResourceWarning` реєструє відстеження, де було виділено ресурс, а помилка переповнення буфера реєструє відстеження, де було виділено блок пам’яті.

source: The Python Development Mode does not prevent the :option:`-O` command line option from removing :keyword:`assert` statements nor from setting :const:`__debug__` to ``False``.
uk: Режим розробки Python не заважає параметру командного рядка :option:`-O` видаляти оператори :keyword:`assert` або встановлювати :const:`__debug__` значення ``False``.

source: The Python Development Mode can only be enabled at the Python startup. Its value can be read from :data:`sys.flags.dev_mode <sys.flags>`.
uk: Режим розробки Python можна ввімкнути лише під час запуску Python. Його значення можна прочитати з :data:`sys.flags.dev_mode <sys.flags>`.

source: The :class:`io.IOBase` destructor now logs ``close()`` exceptions.
uk: Деструктор :class:`io.IOBase` тепер реєструє винятки ``close()``.

source: The *encoding* and *errors* arguments are now checked for string encoding and decoding operations.
uk: Аргументи *encoding* і *errors* тепер перевіряються на наявність операцій кодування та декодування рядків.

source: ResourceWarning Example
uk: Приклад ResourceWarning

source: Example of a script counting the number of lines of the text file specified in the command line::
uk: Приклад сценарію підрахунку кількості рядків текстового файлу, вказаного в командному рядку:

source: The script does not close the file explicitly. By default, Python does not emit any warning. Example using README.txt, which has 269 lines:
uk: Сценарій не закриває файл явно. За замовчуванням Python не видає жодних попереджень. Приклад використання README.txt, який містить 269 рядків:

source: Enabling the Python Development Mode displays a :exc:`ResourceWarning` warning:
uk: Увімкнення режиму розробки Python відображає попередження :exc:`ResourceWarning`:

source: In addition, enabling :mod:`tracemalloc` shows the line where the file was opened:
uk: Крім того, увімкнення :mod:`tracemalloc` показує рядок, де було відкрито файл:

source: The fix is to close explicitly the file. Example using a context manager::
uk: Виправлення полягає в тому, щоб явно закрити файл. Приклад використання контекстного менеджера::

source: Not closing a resource explicitly can leave a resource open for way longer than expected; it can cause severe issues upon exiting Python. It is bad in CPython, but it is even worse in PyPy. Closing resources explicitly makes an application more deterministic and more reliable.
uk: Якщо ресурс не закрити явно, він може залишитися відкритим набагато довше, ніж очікувалося; це може спричинити серйозні проблеми після виходу з Python. Це погано в CPython, але ще гірше в PyPy. Закриття ресурсів явно робить додаток більш детермінованим і надійнішим.

source: Bad file descriptor error example
uk: Приклад помилки неправильного дескриптора файлу

source: Script displaying the first line of itself::
uk: Сценарій, що відображає перший рядок самого себе::

source: By default, Python does not emit any warning:
uk: За замовчуванням Python не видає жодного попередження:

source: The Python Development Mode shows a :exc:`ResourceWarning` and logs a "Bad file descriptor" error when finalizing the file object:
uk: Режим розробки Python показує :exc:`ResourceWarning` і реєструє помилку "Поганий дескриптор файлу" під час завершення об’єкта файлу:

source: ``os.close(fp.fileno())`` closes the file descriptor. When the file object finalizer tries to close the file descriptor again, it fails with the ``Bad file descriptor`` error. A file descriptor must be closed only once. In the worst case scenario, closing it twice can lead to a crash (see :issue:`18748` for an example).
uk: ``os.close(fp.fileno())`` закриває дескриптор файлу. Коли фіналізатор файлового об’єкта знову намагається закрити файловий дескриптор, це не вдається з помилкою ``Поганий файловий дескриптор``. Файловий дескриптор має бути закрито лише один раз. У гіршому випадку подвійне закриття може призвести до збою (див. :issue:`18748` для прикладу).

source: The fix is to remove the ``os.close(fp.fileno())`` line, or open the file with ``closefd=False``.
uk: Виправлення полягає у видаленні рядка ``os.close(fp.fileno())`` або відкритті файлу ``closefd=False``.
