Repository: python/python-docs-uk
Catalog: library/dialog.po
Languages: uk

source: Tkinter Dialogs
uk: Діалоги Tkinter

source: :mod:`tkinter.simpledialog` --- Standard Tkinter input dialogs
uk: :mod:`tkinter.simpledialog` --- Стандартні діалоги введення Tkinter

source: **Source code:** :source:`Lib/tkinter/simpledialog.py`
uk: **Вихідний код:** :source:`Lib/tkinter/simpledialog.py`

source: The :mod:`tkinter.simpledialog` module contains convenience classes and functions for creating simple modal dialogs to get a value from the user.
uk: Модуль :mod:`tkinter.simpledialog` містить зручні класи та функції для створення простих модальних діалогів для отримання значення від користувача.

source: The above three functions provide dialogs that prompt the user to enter a value of the desired type.
uk: Наведені вище три функції пропонують діалогові вікна, які пропонують користувачеві ввести значення потрібного типу.

source: The base class for custom dialogs.
uk: Базовий клас для настроюваних діалогів.

source: Override to construct the dialog's interface and return the widget that should have initial focus.
uk: Перевизначити, щоб створити інтерфейс діалогового вікна та повернути віджет, який має мати початковий фокус.

source: Default behaviour adds OK and Cancel buttons. Override for custom button layouts.
uk: Поведінка за умовчанням додає кнопки OK і Cancel. Перевизначення для власних макетів кнопок.

source: :mod:`tkinter.filedialog` --- File selection dialogs
uk: :mod:`tkinter.filedialog` --- Діалогове вікно вибору файлів

source: **Source code:** :source:`Lib/tkinter/filedialog.py`
uk: **Вихідний код:** :source:`Lib/tkinter/filedialog.py`

source: The :mod:`tkinter.filedialog` module provides classes and factory functions for creating file/directory selection windows.
uk: Модуль :mod:`tkinter.filedialog` надає класи та фабричні функції для створення вікон вибору файлів/каталогів.

source: Native Load/Save Dialogs
uk: Власні діалоги завантаження/збереження

source: The following classes and functions provide file dialog windows that combine a native look-and-feel with configuration options to customize behaviour. The following keyword arguments are applicable to the classes and functions listed below:
uk: Наступні класи та функції забезпечують діалогові вікна файлів, які поєднують зовнішній вигляд і параметри конфігурації для налаштування поведінки. Наступні ключові аргументи застосовні до класів і функцій, перелічених нижче:

source: *parent* - the window to place the dialog on top of
uk: *parent* - вікно, поверх якого буде розміщено діалогове вікно

source: *title* - the title of the window
uk: *title* - заголовок вікна

source: *initialdir* - the directory that the dialog starts in
uk: *initialdir* - каталог, у якому починається діалог

source: *initialfile* - the file selected upon opening of the dialog
uk: *initialfile* - файл, вибраний під час відкриття діалогу

source: *filetypes* - a sequence of (label, pattern) tuples, '*' wildcard is allowed
uk: *filetypes* – послідовність (мітка, шаблон) кортежів, дозволений символ підстановки "*".

source: *defaultextension* - default extension to append to file (save dialogs)
uk: *defaultextension* - типове розширення для додавання до файлу (діалогове вікно збереження)

source: *multiple* - when true, selection of multiple items is allowed
uk: *multiple* - якщо значення true, дозволено вибір кількох елементів

source: **Static factory functions**
uk: **Статичні заводські функції**

source: The below functions when called create a modal, native look-and-feel dialog, wait for the user's selection, then return the selected value(s) or ``None`` to the caller.
uk: Наведені нижче функції під час виклику створюють модальне діалогове вікно, що нагадує зовнішній вигляд, очікують вибору користувача, а потім повертають вибрані значення або ``None`` абоненту.

source: The above two functions create an :class:`Open` dialog and return the opened file object(s) in read-only mode.
uk: Наведені вище дві функції створюють діалогове вікно :class:`Open` і повертають відкритий файловий об’єкт(и) у режимі лише для читання.

source: Create a :class:`SaveAs` dialog and return a file object opened in write-only mode.
uk: Створіть діалогове вікно :class:`SaveAs` і поверніть об’єкт файлу, відкритий у режимі лише для запису.

source: The above two functions create an :class:`Open` dialog and return the selected filename(s) that correspond to existing file(s).
uk: Наведені вище дві функції створюють діалогове вікно :class:`Open` та повертають вибрані назви файлів, які відповідають існуючим файлам.

source: Create a :class:`SaveAs` dialog and return the selected filename.
uk: Створіть діалогове вікно :class:`SaveAs` і поверніть вибране ім’я файлу.

source: Prompt user to select a directory.
uk: Запропонувати користувачеві вибрати каталог.

source: Additional keyword option:
uk: Додатковий параметр ключового слова:

source: *mustexist* - determines if selection must be an existing directory.
uk: *mustexist* - визначає, чи має бути виділений існуючий каталог.

source: The above two classes provide native dialog windows for saving and loading files.
uk: Наведені вище два класи надають власні діалогові вікна для збереження та завантаження файлів.

source: **Convenience classes**
uk: **Зручні класи**

source: The below classes are used for creating file/directory windows from scratch. These do not emulate the native look-and-feel of the platform.
uk: Наведені нижче класи використовуються для створення вікон файлів/каталогів з нуля. Вони не імітують зовнішній вигляд і відчуття платформи.

source: Create a dialog prompting the user to select a directory.
uk: Створіть діалогове вікно з пропозицією користувача вибрати каталог.

source: The *FileDialog* class should be subclassed for custom event handling and behaviour.
uk: Клас *FileDialog* повинен бути підкласом для нестандартної обробки подій і поведінки.

source: Create a basic file selection dialog.
uk: Створіть базове діалогове вікно вибору файлів.

source: Trigger the termination of the dialog window.
uk: Запустити завершення діалогового вікна.

source: Event handler for double-click event on directory.
uk: Обробник подій подвійного клацання в каталозі.

source: Event handler for click event on directory.
uk: Обробник події клацання в каталозі.

source: Event handler for double-click event on file.
uk: Обробник подій подвійного клацання у файлі.

source: Event handler for single-click event on file.
uk: Обробник подій для файлу одним клацанням.

source: Filter the files by directory.
uk: Фільтруйте файли за каталогом.

source: Retrieve the file filter currently in use.
uk: Отримати фільтр файлів, який зараз використовується.

source: Retrieve the currently selected item.
uk: Отримати поточний вибраний елемент.

source: Render dialog and start event loop.
uk: Відобразити діалогове вікно та запустити цикл подій.

source: Exit dialog returning current selection.
uk: Вийти з діалогового вікна, повертаючи поточний вибір.

source: Exit dialog returning filename, if any.
uk: Вийти з діалогового вікна, повертаючи назву файлу, якщо є.

source: Set the file filter.
uk: Встановіть фільтр файлів.

source: Update the current file selection to *file*.
uk: Оновіть поточний вибір файлу на *file*.

source: A subclass of FileDialog that creates a dialog window for selecting an existing file.
uk: Підклас FileDialog, який створює діалогове вікно для вибору існуючого файлу.

source: Test that a file is provided and that the selection indicates an already existing file.
uk: Перевірте, чи надано файл і чи виділення вказує на вже існуючий файл.

source: A subclass of FileDialog that creates a dialog window for selecting a destination file.
uk: Підклас FileDialog, який створює діалогове вікно для вибору файлу призначення.

source: Test whether or not the selection points to a valid file that is not a directory. Confirmation is required if an already existing file is selected.
uk: Перевірте, чи вказує вибір на дійсний файл, який не є каталогом. Якщо вибрано вже існуючий файл, потрібне підтвердження.

source: :mod:`tkinter.commondialog` --- Dialog window templates
uk: :mod:`tkinter.commondialog` --- Шаблони діалогових вікон

source: **Source code:** :source:`Lib/tkinter/commondialog.py`
uk: **Вихідний код:** :source:`Lib/tkinter/commondialog.py`

source: The :mod:`tkinter.commondialog` module provides the :class:`Dialog` class that is the base class for dialogs defined in other supporting modules.
uk: Модуль :mod:`tkinter.commondialog` надає клас :class:`Dialog`, який є базовим класом для діалогів, визначених в інших допоміжних модулях.

source: Render the Dialog window.
uk: Відобразити діалогове вікно.

source: Modules :mod:`tkinter.messagebox`, :ref:`tut-files`
uk: Модулі :mod:`tkinter.messagebox`, :ref:`tut-files`
