Repository: python/python-docs-uk
Catalog: library/distutils.po
Languages: uk

source: :mod:`distutils` --- Building and installing Python modules
uk: :mod:`distutils` --- Створення та встановлення модулів Python

source: :mod:`distutils` is deprecated with removal planned for Python 3.12. See the :ref:`What's New <distutils-deprecated>` entry for more information.
uk: :mod:`distutils` не підтримується, планується видалення для Python 3.12. Перегляньте запис :ref:`Що нового <distutils-deprecated>` для отримання додаткової інформації.

source: The :mod:`distutils` package provides support for building and installing additional modules into a Python installation. The new modules may be either 100%-pure Python, or may be extension modules written in C, or may be collections of Python packages which include modules coded in both Python and C.
uk: Пакет :mod:`distutils` забезпечує підтримку створення та встановлення додаткових модулів у інсталяцію Python. Нові модулі можуть бути або 100%-pure Python, або можуть бути модулями розширення, написаними на C, або можуть бути колекціями пакетів Python, які включають модулі, закодовані як на Python, так і на C.

source: Most Python users will *not* want to use this module directly, but instead use the cross-version tools maintained by the Python Packaging Authority. In particular, `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ is an enhanced alternative to :mod:`distutils` that provides:
uk: Більшість користувачів Python *не* захочуть використовувати цей модуль напряму, натомість скористаються крос-версійними інструментами, які підтримує Python Packaging Authority. Зокрема, `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ є вдосконаленою альтернативою :mod:`distutils`, яка забезпечує:

source: support for declaring project dependencies
uk: підтримка оголошення залежностей проекту

source: additional mechanisms for configuring which files to include in source releases (including plugins for integration with version control systems)
uk: додаткові механізми для конфігурації файлів, які слід включати в вихідні версії (включаючи плагіни для інтеграції з системами контролю версій)

source: the ability to declare project "entry points", which can be used as the basis for application plugin systems
uk: можливість оголошувати "точки входу" проекту, які можна використовувати як основу для систем плагінів додатків

source: the ability to automatically generate Windows command line executables at installation time rather than needing to prebuild them
uk: можливість автоматично генерувати виконувані файли командного рядка Windows під час встановлення замість необхідності їх попереднього збирання

source: consistent behaviour across all supported Python versions
uk: узгоджена поведінка в усіх підтримуваних версіях Python

source: The recommended `pip <https://pip.pypa.io/>`__ installer runs all ``setup.py`` scripts with ``setuptools``, even if the script itself only imports ``distutils``. Refer to the `Python Packaging User Guide <https://packaging.python.org>`_ for more information.
uk: Рекомендований інсталятор `pip <https://pip.pypa.io/>`__ запускає всі сценарії ``setup.py`` з ``setuptools``, навіть якщо сам сценарій імпортує лише ``distutils``. Для отримання додаткової інформації зверніться до `Посібника користувача з пакування Python <https://packaging.python.org>`_.

source: For the benefits of packaging tool authors and users seeking a deeper understanding of the details of the current packaging and distribution system, the legacy :mod:`distutils` based user documentation and API reference remain available:
uk: Для переваг авторів інструментів пакування та користувачів, які прагнуть глибшого розуміння деталей поточної системи пакування та розповсюдження, документація користувача на основі :mod:`distutils` та посилання на API залишаються доступними:
