Repository: python/python-docs-uk
Catalog: library/doctest.po
Languages: uk

source: Optional argument *extraglobs* gives a dict merged into the globals used to execute examples. This works like :meth:`dict.update`: if *globs* and *extraglobs* have a common key, the associated value in *extraglobs* appears in the combined dict. By default, or if ``None``, no extra globals are used. This is an advanced feature that allows parameterization of doctests. For example, a doctest can be written for a base class, using a generic name for the class, then reused to test any number of subclasses by passing an *extraglobs* dict mapping the generic name to the subclass to be tested.
uk: Необов’язковий аргумент *extraglobs* дає dict, об’єднаний із глобальними значеннями, які використовуються для виконання прикладів. Це працює як :meth:`dict.update`: якщо *globs* і *extraglobs* мають спільний ключ, пов’язане значення в *extraglobs* з’являється в комбінованому dict. За замовчуванням або якщо ``None``, додаткові глобальні значення не використовуються. Це розширена функція, яка дозволяє параметризувати doctests. Наприклад, doctest можна написати для базового класу, використовуючи загальну назву для класу, а потім повторно використовувати для тестування будь-якої кількості підкласів, передавши *extraglobs* dict, що відображає загальну назву на підклас, який потрібно перевірити.

source: Optional argument *verbose* prints lots of stuff if true, and prints only failures if false; by default, or if ``None``, it's true if and only if ``'-v'`` is in ``sys.argv``.
uk: Додатковий аргумент *verbose* друкує багато речей, якщо true, і друкує лише помилки, якщо false; за замовчуванням або якщо ``None``, це істина тоді і тільки якщо ``'-v''`` є в ``sys.argv``.

source: Optional argument *report* prints a summary at the end when true, else prints nothing at the end. In verbose mode, the summary is detailed, else the summary is very brief (in fact, empty if all tests passed).
uk: Необов’язковий аргумент *report* друкує підсумок у кінці, якщо значення true, інакше нічого не друкує в кінці. У багатослівному режимі резюме є детальним, інакше резюме є дуже коротким (насправді порожнім, якщо всі тести пройдено).

source: Optional argument *optionflags* (default value 0) takes the :ref:`bitwise OR <bitwise>` of option flags. See section :ref:`doctest-options`.
uk: Необов’язковий аргумент *optionflags* (значення за замовчуванням 0) приймає :ref:`побітове АБО <bitwise>` прапорів параметрів. Дивіться розділ :ref:`doctest-options`.

source: Optional argument *raise_on_error* defaults to false. If true, an exception is raised upon the first failure or unexpected exception in an example. This allows failures to be post-mortem debugged. Default behavior is to continue running examples.
uk: Додатковий аргумент *raise_on_error* за умовчанням має значення false. Якщо істина, виняток виникає після першої помилки або несподіваного винятку в прикладі. Це дозволяє посмертно виправляти помилки. Типовою поведінкою є продовження виконання прикладів.

source: Optional argument *parser* specifies a :class:`DocTestParser` (or subclass) that should be used to extract tests from the files. It defaults to a normal parser (i.e., ``DocTestParser()``).
uk: Необов’язковий аргумент *parser* визначає :class:`DocTestParser` (або підклас), який слід використовувати для отримання тестів із файлів. За замовчуванням використовується звичайний аналізатор (тобто ``DocTestParser()``).

source: Optional argument *encoding* specifies an encoding that should be used to convert the file to unicode.
uk: Необов’язковий аргумент *encoding* визначає кодування, яке слід використовувати для перетворення файлу в Юнікод.

source: All arguments are optional, and all except for *m* should be specified in keyword form.
uk: Усі аргументи є необов’язковими, і всі, крім *m*, мають бути вказані у формі ключового слова.

source: Test examples in docstrings in functions and classes reachable from module *m* (or module :mod:`__main__` if *m* is not supplied or is ``None``), starting with ``m.__doc__``.
uk: Тестові приклади в рядках документів у функціях і класах, доступних із модуля *m* (або модуля :mod:`__main__`, якщо *m* не вказано або має значення ``None``), починаючи з ``m.__doc__``.

source: Also test examples reachable from dict ``m.__test__``, if it exists and is not ``None``. ``m.__test__`` maps names (strings) to functions, classes and strings; function and class docstrings are searched for examples; strings are searched directly, as if they were docstrings.
uk: Також тестові приклади доступні з dict ``m.__test__``, якщо він існує і не є ``None``. ``m.__test__`` відображає імена (рядки) на функції, класи та рядки; виконується пошук прикладів у документах функцій і класів; рядки шукаються безпосередньо, як якщо б це були рядки документації.

source: Only docstrings attached to objects belonging to module *m* are searched.
uk: Пошук здійснюється лише в рядках документів, приєднаних до об’єктів, що належать модулю *m*.

source: Return ``(failure_count, test_count)``.
uk: Повернення ``(failure_count, test_count)``.

source: Optional argument *name* gives the name of the module; by default, or if ``None``, ``m.__name__`` is used.
uk: Необов'язковий аргумент *name* дає назву модуля; за замовчуванням або, якщо ``None``, ``m.__name__`` використовується.

source: Optional argument *exclude_empty* defaults to false. If true, objects for which no doctests are found are excluded from consideration. The default is a backward compatibility hack, so that code still using :meth:`doctest.master.summarize` in conjunction with :func:`testmod` continues to get output for objects with no tests. The *exclude_empty* argument to the newer :class:`DocTestFinder` constructor defaults to true.
uk: Додатковий аргумент *exclude_empty* за умовчанням має значення false. Якщо значення true, об’єкти, для яких не знайдено жодних тестів, виключаються з розгляду. За замовчуванням використовується зворотна сумісність, тому код, який все ще використовує :meth:`doctest.master.summarize` у поєднанні з :func:`testmod`, продовжує отримувати вихідні дані для об’єктів без тестів. Аргумент *exclude_empty* для нового конструктора :class:`DocTestFinder` за умовчанням має значення true.

source: Optional arguments *extraglobs*, *verbose*, *report*, *optionflags*, *raise_on_error*, and *globs* are the same as for function :func:`testfile` above, except that *globs* defaults to ``m.__dict__``.
uk: Необов’язкові аргументи *extraglobs*, *verbose*, *report*, *optionflags*, *raise_on_error* і *globs* такі самі, як і для функції :func:`testfile` вище, за винятком того, що *globs* за умовчанням має значення ``m .__dict__``.

source: Test examples associated with object *f*; for example, *f* may be a string, a module, a function, or a class object.
uk: Тестові приклади, пов'язані з об'єктом *f*; наприклад, *f* може бути рядком, модулем, функцією або об’єктом класу.

source: A shallow copy of dictionary argument *globs* is used for the execution context.
uk: Неглибока копія аргументу словника *globs* використовується для контексту виконання.

source: Optional argument *name* is used in failure messages, and defaults to ``"NoName"``.
uk: Необов’язковий аргумент *ім’я* використовується в повідомленнях про помилку та за умовчанням має значення ``"NoName"``.

source: If optional argument *verbose* is true, output is generated even if there are no failures. By default, output is generated only in case of an example failure.
uk: Якщо додатковий аргумент *verbose* має значення true, вихідні дані генеруються, навіть якщо немає помилок. За замовчуванням вихідні дані генеруються лише у випадку помилки прикладу.

source: Optional argument *compileflags* gives the set of flags that should be used by the Python compiler when running the examples. By default, or if ``None``, flags are deduced corresponding to the set of future features found in *globs*.
uk: Необов’язковий аргумент *compileflags* надає набір прапорів, які має використовувати компілятор Python під час виконання прикладів. За замовчуванням або якщо ``None``, прапори виводяться відповідно до набору майбутніх функцій, знайдених у *globs*.

source: Optional argument *optionflags* works as for function :func:`testfile` above.
uk: Необов’язковий аргумент *optionflags* працює як для функції :func:`testfile` вище.

source: As your collection of doctest'ed modules grows, you'll want a way to run all their doctests systematically. :mod:`doctest` provides two functions that can be used to create :mod:`unittest` test suites from modules and text files containing doctests. To integrate with :mod:`unittest` test discovery, include a :func:`load_tests` function in your test module::
uk: У міру того як ваша колекція модулів doctest зростатиме, вам знадобиться спосіб систематично запускати всі їхні doctests. :mod:`doctest` надає дві функції, які можна використовувати для створення наборів тестів :mod:`unittest` з модулів і текстових файлів, що містять doctests. Для інтеграції з виявленням тестів :mod:`unittest` додайте функцію :func:`load_tests` у свій тестовий модуль::

source: There are two main functions for creating :class:`unittest.TestSuite` instances from text files and modules with doctests:
uk: Є дві основні функції для створення екземплярів :class:`unittest.TestSuite` з текстових файлів і модулів з doctests:

source: Convert doctest tests from one or more text files to a :class:`unittest.TestSuite`.
uk: Перетворіть тести doctest з одного чи кількох текстових файлів у :class:`unittest.TestSuite`.

source: The returned :class:`unittest.TestSuite` is to be run by the unittest framework and runs the interactive examples in each file. If an example in any file fails, then the synthesized unit test fails, and a :exc:`failureException` exception is raised showing the name of the file containing the test and a (sometimes approximate) line number.
uk: Повернений :class:`unittest.TestSuite` повинен запускатися фреймворком unittest і запускати інтерактивні приклади в кожному файлі. Якщо приклад у будь-якому файлі завершується невдачею, синтезований модульний тест завершується невдало, і виникає виняткова ситуація :exc:`failureException`, яка показує назву файлу, що містить тест, і (іноді приблизний) номер рядка.

source: Pass one or more paths (as strings) to text files to be examined.
uk: Передайте один або кілька шляхів (у вигляді рядків) до текстових файлів, які потрібно перевірити.

source: Options may be provided as keyword arguments:
uk: Параметри можуть бути надані як аргументи ключових слів:

source: Optional argument *module_relative* specifies how the filenames in *paths* should be interpreted:
uk: Необов’язковий аргумент *module_relative* визначає, як слід інтерпретувати назви файлів у *paths*:

source: If *module_relative* is ``True`` (the default), then each filename in *paths* specifies an OS-independent module-relative path. By default, this path is relative to the calling module's directory; but if the *package* argument is specified, then it is relative to that package. To ensure OS-independence, each filename should use ``/`` characters to separate path segments, and may not be an absolute path (i.e., it may not begin with ``/``).
uk: Якщо *module_relative* має значення ``True`` (за замовчуванням), тоді кожне ім’я файлу в *paths* визначає незалежний від ОС шлях щодо модуля. За замовчуванням цей шлях є відносно каталогу викликаючого модуля; але якщо вказано аргумент *package*, то він відноситься до цього пакета. Щоб забезпечити незалежність від ОС, кожне ім’я файлу має використовувати символи ``/`` для розділення сегментів шляху та не може бути абсолютним шляхом (тобто воно не може починатися з ``/``).

source: If *module_relative* is ``False``, then each filename in *paths* specifies an OS-specific path. The path may be absolute or relative; relative paths are resolved with respect to the current working directory.
uk: Якщо *module_relative* має значення ``False``, тоді кожне ім’я файлу в *paths* вказує шлях до ОС. Шлях може бути абсолютним або відносним; відносні шляхи вирішуються відносно поточного робочого каталогу.

source: Optional argument *package* is a Python package or the name of a Python package whose directory should be used as the base directory for module-relative filenames in *paths*. If no package is specified, then the calling module's directory is used as the base directory for module-relative filenames. It is an error to specify *package* if *module_relative* is ``False``.
uk: Необов’язковий аргумент *package* — це пакет Python або ім’я пакета Python, чий каталог слід використовувати як базовий каталог для імен файлів, пов’язаних із модулями, у *paths*. Якщо пакет не вказано, то каталог модуля, що викликає, використовується як базовий каталог для імен файлів, що відносяться до модуля. Це помилка вказувати *package*, якщо *module_relative* має значення ``False``.

source: Optional argument *setUp* specifies a set-up function for the test suite. This is called before running the tests in each file. The *setUp* function will be passed a :class:`DocTest` object. The setUp function can access the test globals as the *globs* attribute of the test passed.
uk: Додатковий аргумент *setUp* визначає функцію налаштування для набору тестів. Це викликається перед виконанням тестів у кожному файлі. Функції *setUp* буде передано об’єкт :class:`DocTest`. Функція setUp може отримати доступ до глобальних параметрів тесту як атрибута *globs* пройденого тесту.

source: Optional argument *tearDown* specifies a tear-down function for the test suite. This is called after running the tests in each file. The *tearDown* function will be passed a :class:`DocTest` object. The setUp function can access the test globals as the *globs* attribute of the test passed.
uk: Необов’язковий аргумент *tearDown* визначає функцію розриву для набору тестів. Це викликається після виконання тестів у кожному файлі. Функції *tearDown* буде передано об’єкт :class:`DocTest`. Функція setUp може отримати доступ до глобальних параметрів тесту як атрибута *globs* пройденого тесту.

source: Optional argument *globs* is a dictionary containing the initial global variables for the tests. A new copy of this dictionary is created for each test. By default, *globs* is a new empty dictionary.
uk: Додатковий аргумент *globs* — це словник, що містить початкові глобальні змінні для тестів. Для кожного тесту створюється нова копія цього словника. За замовчуванням *globs* — це новий порожній словник.

source: Optional argument *optionflags* specifies the default doctest options for the tests, created by or-ing together individual option flags. See section :ref:`doctest-options`. See function :func:`set_unittest_reportflags` below for a better way to set reporting options.
uk: Необов’язковий аргумент *optionflags* вказує параметри тесту за замовчуванням для тестів, створені шляхом об’єднання окремих прапорців параметрів. Дивіться розділ :ref:`doctest-options`. Перегляньте функцію :func:`set_unittest_reportflags` нижче, щоб дізнатися про кращий спосіб налаштування параметрів звітування.

source: The global ``__file__`` is added to the globals provided to doctests loaded from a text file using :func:`DocFileSuite`.
uk: Глобальний ``__file__`` додається до глобалів, наданих до doctests, завантажених із текстового файлу за допомогою :func:`DocFileSuite`.

source: Convert doctest tests for a module to a :class:`unittest.TestSuite`.
uk: Перетворіть тести doctest для модуля на :class:`unittest.TestSuite`.

source: The returned :class:`unittest.TestSuite` is to be run by the unittest framework and runs each doctest in the module. If any of the doctests fail, then the synthesized unit test fails, and a :exc:`failureException` exception is raised showing the name of the file containing the test and a (sometimes approximate) line number.
uk: Повернений :class:`unittest.TestSuite` має запускатися фреймворком unittest і запускає кожен doctest у модулі. Якщо будь-який із тестів документів не вдається, синтезований модульний тест завершується невдало, і виникає виняткова ситуація :exc:`failureException`, яка показує назву файлу, що містить тест, і (іноді приблизний) номер рядка.

source: Optional argument *module* provides the module to be tested. It can be a module object or a (possibly dotted) module name. If not specified, the module calling this function is used.
uk: Необов’язковий аргумент *module* надає модуль для тестування. Це може бути об’єкт модуля або ім’я модуля (можливо з крапками). Якщо не вказано, використовується модуль, який викликає цю функцію.

source: Optional argument *extraglobs* specifies an extra set of global variables, which is merged into *globs*. By default, no extra globals are used.
uk: Необов’язковий аргумент *extraglobs* визначає додатковий набір глобальних змінних, який об’єднується в *globs*. За замовчуванням додаткові глобальні значення не використовуються.

source: Optional argument *test_finder* is the :class:`DocTestFinder` object (or a drop-in replacement) that is used to extract doctests from the module.
uk: Необов’язковий аргумент *test_finder* — це об’єкт :class:`DocTestFinder` (або замінник), який використовується для вилучення тестів документів із модуля.

source: Optional arguments *setUp*, *tearDown*, and *optionflags* are the same as for function :func:`DocFileSuite` above.
uk: Необов’язкові аргументи *setUp*, *tearDown* і *optionflags* такі самі, як і для функції :func:`DocFileSuite` вище.

source: This function uses the same search technique as :func:`testmod`.
uk: Ця функція використовує ту саму техніку пошуку, що й :func:`testmod`.

source: :func:`DocTestSuite` returns an empty :class:`unittest.TestSuite` if *module* contains no docstrings instead of raising :exc:`ValueError`.
uk: :func:`DocTestSuite` повертає порожній :class:`unittest.TestSuite`, якщо *module* не містить рядків документів, замість того, щоб викликати :exc:`ValueError`.

source: Under the covers, :func:`DocTestSuite` creates a :class:`unittest.TestSuite` out of :class:`doctest.DocTestCase` instances, and :class:`DocTestCase` is a subclass of :class:`unittest.TestCase`. :class:`DocTestCase` isn't documented here (it's an internal detail), but studying its code can answer questions about the exact details of :mod:`unittest` integration.
uk: Під обкладинками :func:`DocTestSuite` створює :class:`unittest.TestSuite` з екземплярів :class:`doctest.DocTestCase`, а :class:`DocTestCase` є підкласом :class:`unittest.TestCase`. :class:`DocTestCase` тут не задокументовано (це внутрішня деталь), але вивчення його коду може відповісти на запитання щодо точних деталей інтеграції :mod:`unittest`.

source: Similarly, :func:`DocFileSuite` creates a :class:`unittest.TestSuite` out of :class:`doctest.DocFileCase` instances, and :class:`DocFileCase` is a subclass of :class:`DocTestCase`.
uk: Так само :func:`DocFileSuite` створює :class:`unittest.TestSuite` з екземплярів :class:`doctest.DocFileCase`, а :class:`DocFileCase` є підкласом :class:`DocTestCase`.

source: So both ways of creating a :class:`unittest.TestSuite` run instances of :class:`DocTestCase`. This is important for a subtle reason: when you run :mod:`doctest` functions yourself, you can control the :mod:`doctest` options in use directly, by passing option flags to :mod:`doctest` functions. However, if you're writing a :mod:`unittest` framework, :mod:`unittest` ultimately controls when and how tests get run. The framework author typically wants to control :mod:`doctest` reporting options (perhaps, e.g., specified by command line options), but there's no way to pass options through :mod:`unittest` to :mod:`doctest` test runners.
uk: Отже, обидва способи створення :class:`unittest.TestSuite` запускають екземпляри :class:`DocTestCase`. Це важливо з тонкої причини: коли ви самостійно запускаєте функції :mod:`doctest`, ви можете безпосередньо контролювати параметри :mod:`doctest`, які використовуються, передаючи прапорці параметрів функціям :mod:`doctest`. Однак, якщо ви пишете фреймворк :mod:`unittest`, :mod:`unittest` остаточно контролює, коли і як запускати тести. Автор фреймворку зазвичай хоче контролювати параметри звітування :mod:`doctest` (можливо, наприклад, визначені параметрами командного рядка), але немає способу передати параметри через :mod:`unittest` до :mod:`doctest` виконавців тестів .

source: For this reason, :mod:`doctest` also supports a notion of :mod:`doctest` reporting flags specific to :mod:`unittest` support, via this function:
uk: З цієї причини :mod:`doctest` також підтримує поняття прапорів звітності :mod:`doctest`, специфічних для підтримки :mod:`unittest`, через цю функцію:

source: Set the :mod:`doctest` reporting flags to use.
uk: Встановіть прапорці звітів :mod:`doctest` для використання.

source: Argument *flags* takes the :ref:`bitwise OR <bitwise>` of option flags. See section :ref:`doctest-options`. Only "reporting flags" can be used.
uk: Аргумент *flags* приймає :ref:`побітове АБО <bitwise>` прапорів параметрів. Дивіться розділ :ref:`doctest-options`. Можна використовувати лише "прапори звітності".

source: This is a module-global setting, and affects all future doctests run by module :mod:`unittest`: the :meth:`runTest` method of :class:`DocTestCase` looks at the option flags specified for the test case when the :class:`DocTestCase` instance was constructed. If no reporting flags were specified (which is the typical and expected case), :mod:`doctest`'s :mod:`unittest` reporting flags are :ref:`bitwise ORed <bitwise>` into the option flags, and the option flags so augmented are passed to the :class:`DocTestRunner` instance created to run the doctest. If any reporting flags were specified when the :class:`DocTestCase` instance was constructed, :mod:`doctest`'s :mod:`unittest` reporting flags are ignored.
uk: Це глобальне налаштування модуля, яке впливає на всі майбутні doctests, запущені модулем :mod:`unittest`: метод :meth:`runTest` :class:`DocTestCase` переглядає позначки параметрів, указані для тестового випадку, коли Створено екземпляр :class:`DocTestCase`. Якщо не було вказано жодних позначок звітування (це типовий і очікуваний випадок), прапорці звітності :mod:`doctest` :mod:`unittest` :ref:`порозрядно об’єднуються АБО <bitwise>` у прапорці опцій, а прапорці опцій тому доповнені передаються до екземпляра :class:`DocTestRunner`, створеного для запуску doctest. Якщо під час створення екземпляра :class:`DocTestCase` було вказано будь-які позначки звітів, прапорці звітів :mod:`doctest` :mod:`unittest` ігноруються.

source: The value of the :mod:`unittest` reporting flags in effect before the function was called is returned by the function.
uk: Функція повертає значення прапорів звітів :mod:`unittest`, які діяли до виклику функції.

source: Advanced API
uk: Розширений API

source: The basic API is a simple wrapper that's intended to make doctest easy to use. It is fairly flexible, and should meet most users' needs; however, if you require more fine-grained control over testing, or wish to extend doctest's capabilities, then you should use the advanced API.
uk: Основний API — це проста оболонка, призначена для полегшення використання doctest. Він досить гнучкий і повинен відповідати потребам більшості користувачів; однак, якщо вам потрібен більш детальний контроль над тестуванням або ви бажаєте розширити можливості doctest, тоді вам слід скористатися розширеним API.

source: The advanced API revolves around two container classes, which are used to store the interactive examples extracted from doctest cases:
uk: Розширений API обертається навколо двох класів контейнерів, які використовуються для зберігання інтерактивних прикладів, отриманих із випадків doctest:

source: :class:`Example`: A single Python :term:`statement`, paired with its expected output.
uk: :class:`Example`: один :term:`statement` Python у поєднанні з очікуваним результатом.
