Repository: python/python-docs-uk
Catalog: library/doctest.po
Languages: uk

source: Print a summary of all the test cases that have been run by this DocTestRunner, and return a :term:`named tuple` ``TestResults(failed, attempted)``.
uk: Надрукуйте підсумок усіх тестів, які були запущені цим DocTestRunner, і поверніть :term:`named tuple` ``TestResults(failed, attempted)``.

source: The optional *verbose* argument controls how detailed the summary is. If the verbosity is not specified, then the :class:`DocTestRunner`'s verbosity is used.
uk: Необов’язковий аргумент *verbose* контролює, наскільки детальним є резюме. Якщо детальність не вказана, тоді використовується детальність :class:`DocTestRunner`.

source: OutputChecker objects
uk: Об'єкти OutputChecker

source: A class used to check the whether the actual output from a doctest example matches the expected output. :class:`OutputChecker` defines two methods: :meth:`check_output`, which compares a given pair of outputs, and returns ``True`` if they match; and :meth:`output_difference`, which returns a string describing the differences between two outputs.
uk: Клас, який використовується для перевірки того, чи фактичний результат із прикладу doctest відповідає очікуваному результату. :class:`OutputChecker` визначає два методи: :meth:`check_output`, який порівнює задану пару виходів і повертає ``True``, якщо вони збігаються; і :meth:`output_difference`, який повертає рядок, що описує різницю між двома результатами.

source: :class:`OutputChecker` defines the following methods:
uk: :class:`OutputChecker` визначає такі методи:

source: Return ``True`` iff the actual output from an example (*got*) matches the expected output (*want*). These strings are always considered to match if they are identical; but depending on what option flags the test runner is using, several non-exact match types are also possible. See section :ref:`doctest-options` for more information about option flags.
uk: Повертає ``True``, якщо фактичний результат із прикладу (*got*) відповідає очікуваному результату (*want*). Ці рядки завжди вважаються такими, що збігаються, якщо вони ідентичні; але залежно від того, які прапорці параметрів використовує програма виконання тестів, також можливі кілька типів неточної відповідності. Перегляньте розділ :ref:`doctest-options` для отримання додаткової інформації про прапорці параметрів.

source: Return a string describing the differences between the expected output for a given example (*example*) and the actual output (*got*). *optionflags* is the set of option flags used to compare *want* and *got*.
uk: Повертає рядок, що описує відмінності між очікуваним виходом для даного прикладу (*example*) і фактичним виходом (*got*). *optionflags* — це набір позначок параметрів, які використовуються для порівняння *want* і *got*.

source: Debugging
uk: Налагодження

source: Doctest provides several mechanisms for debugging doctest examples:
uk: Doctest надає кілька механізмів для налагодження прикладів doctest:

source: Several functions convert doctests to executable Python programs, which can be run under the Python debugger, :mod:`pdb`.
uk: Декілька функцій перетворюють doctests на виконувані програми Python, які можна запускати в налагоджувачі Python, :mod:`pdb`.

source: The :class:`DebugRunner` class is a subclass of :class:`DocTestRunner` that raises an exception for the first failing example, containing information about that example. This information can be used to perform post-mortem debugging on the example.
uk: Клас :class:`DebugRunner` є підкласом :class:`DocTestRunner`, який створює виняток для першого невдалого прикладу, що містить інформацію про цей приклад. Ця інформація може бути використана для виконання посмертного налагодження на прикладі.

source: The :mod:`unittest` cases generated by :func:`DocTestSuite` support the :meth:`debug` method defined by :class:`unittest.TestCase`.
uk: Випадки :mod:`unittest`, згенеровані :func:`DocTestSuite`, підтримують метод :meth:`debug`, визначений :class:`unittest.TestCase`.

source: You can add a call to :func:`pdb.set_trace` in a doctest example, and you'll drop into the Python debugger when that line is executed. Then you can inspect current values of variables, and so on. For example, suppose :file:`a.py` contains just this module docstring::
uk: Ви можете додати виклик до :func:`pdb.set_trace` у прикладі doctest, і ви перейдете до налагоджувача Python, коли цей рядок буде виконано. Потім ви можете перевірити поточні значення змінних і так далі. Наприклад, припустимо, що :file:`a.py` містить лише цей модуль docstring::

source: Then an interactive Python session may look like this::
uk: Тоді інтерактивний сеанс Python може виглядати так:

source: Functions that convert doctests to Python code, and possibly run the synthesized code under the debugger:
uk: Функції, які перетворюють doctests на код Python і, можливо, запускають синтезований код під налагоджувачем:

source: Convert text with examples to a script.
uk: Перетворення тексту з прикладами на сценарій.

source: Argument *s* is a string containing doctest examples. The string is converted to a Python script, where doctest examples in *s* are converted to regular code, and everything else is converted to Python comments. The generated script is returned as a string. For example, ::
uk: Аргумент *s* — це рядок, що містить приклади doctest. Рядок перетворюється на сценарій Python, де приклади doctest у *s* перетворюються на звичайний код, а все інше перетворюється на коментарі Python. Згенерований сценарій повертається як рядок. Наприклад, ::

source: displays::
uk: дисплеї::

source: This function is used internally by other functions (see below), but can also be useful when you want to transform an interactive Python session into a Python script.
uk: Ця функція використовується внутрішньо іншими функціями (див. нижче), але також може бути корисною, коли ви хочете перетворити інтерактивний сеанс Python на сценарій Python.

source: Convert the doctest for an object to a script.
uk: Перетворення doctest для об’єкта на сценарій.

source: Argument *module* is a module object, or dotted name of a module, containing the object whose doctests are of interest. Argument *name* is the name (within the module) of the object with the doctests of interest. The result is a string, containing the object's docstring converted to a Python script, as described for :func:`script_from_examples` above. For example, if module :file:`a.py` contains a top-level function :func:`f`, then ::
uk: Аргумент *module* — це об’єкт модуля або ім’я модуля з крапками, що містить об’єкт, чиї документи представляють інтерес. Аргумент *ім’я* — це ім’я (в межах модуля) об’єкта з цікавими документами. Результатом є рядок, що містить документацію об’єкта, перетворену на сценарій Python, як описано для :func:`script_from_examples` вище. Наприклад, якщо модуль :file:`a.py` містить функцію верхнього рівня :func:`f`, тоді ::

source: prints a script version of function :func:`f`'s docstring, with doctests converted to code, and the rest placed in comments.
uk: друкує версію сценарію рядка документації функції :func:`f` із тестами документів, перетвореними на код, а решту розміщує в коментарях.

source: Debug the doctests for an object.
uk: Налагодження документів для об’єкта.

source: The *module* and *name* arguments are the same as for function :func:`testsource` above. The synthesized Python script for the named object's docstring is written to a temporary file, and then that file is run under the control of the Python debugger, :mod:`pdb`.
uk: Аргументи *module* і *name* такі самі, як і для функції :func:`testsource` вище. Синтезований сценарій Python для рядка документації названого об’єкта записується у тимчасовий файл, а потім цей файл запускається під керуванням налагоджувача Python, :mod:`pdb`.

source: A shallow copy of ``module.__dict__`` is used for both local and global execution context.
uk: Поверхнева копія ``module.__dict__`` використовується як для локального, так і для глобального контексту виконання.

source: Optional argument *pm* controls whether post-mortem debugging is used. If *pm* has a true value, the script file is run directly, and the debugger gets involved only if the script terminates via raising an unhandled exception. If it does, then post-mortem debugging is invoked, via :func:`pdb.post_mortem`, passing the traceback object from the unhandled exception. If *pm* is not specified, or is false, the script is run under the debugger from the start, via passing an appropriate :func:`exec` call to :func:`pdb.run`.
uk: Додатковий аргумент *pm* визначає, чи використовується посмертне налагодження. Якщо *pm* має значення true, файл сценарію запускається безпосередньо, і налагоджувач бере участь лише в тому випадку, якщо сценарій завершується через виклик необробленого винятку. Якщо це так, то через :func:`pdb.post_mortem` викликається посмертне налагодження, передаючи об’єкт трасування з необробленого винятку. Якщо *pm* не вказано або має значення false, сценарій запускається під налагоджувачем із самого початку, шляхом передачі відповідного виклику :func:`exec` до :func:`pdb.run`.

source: Debug the doctests in a string.
uk: Налагодити doctests у рядку.

source: This is like function :func:`debug` above, except that a string containing doctest examples is specified directly, via the *src* argument.
uk: Це схоже на функцію :func:`debug` вище, за винятком того, що рядок, що містить приклади doctest, вказується безпосередньо через аргумент *src*.

source: Optional argument *pm* has the same meaning as in function :func:`debug` above.
uk: Необов’язковий аргумент *pm* має те саме значення, що й у функції :func:`debug` вище.

source: Optional argument *globs* gives a dictionary to use as both local and global execution context. If not specified, or ``None``, an empty dictionary is used. If specified, a shallow copy of the dictionary is used.
uk: Необов’язковий аргумент *globs* надає словник для використання як локального, так і глобального контексту виконання. Якщо не вказано або ``None``, використовується порожній словник. Якщо вказано, використовується неглибока копія словника.

source: The :class:`DebugRunner` class, and the special exceptions it may raise, are of most interest to testing framework authors, and will only be sketched here. See the source code, and especially :class:`DebugRunner`'s docstring (which is a doctest!) for more details:
uk: Клас :class:`DebugRunner` і спеціальні винятки, які він може спричинити, представляють найбільший інтерес для авторів фреймворку тестування, і тут буде лише схематично описано. Перегляньте вихідний код, а особливо рядок документації :class:`DebugRunner` (який є тестом документів!) для отримання додаткової інформації:

source: A subclass of :class:`DocTestRunner` that raises an exception as soon as a failure is encountered. If an unexpected exception occurs, an :exc:`UnexpectedException` exception is raised, containing the test, the example, and the original exception. If the output doesn't match, then a :exc:`DocTestFailure` exception is raised, containing the test, the example, and the actual output.
uk: Підклас :class:`DocTestRunner`, який викликає виняток, щойно виникає помилка. Якщо виникає неочікуваний виняток, виникає виняток :exc:`UnexpectedException`, який містить тест, приклад і оригінальний виняток. Якщо вихідні дані не збігаються, то виникає виняток :exc:`DocTestFailure`, який містить тест, приклад і фактичний результат.

source: For information about the constructor parameters and methods, see the documentation for :class:`DocTestRunner` in section :ref:`doctest-advanced-api`.
uk: Щоб отримати інформацію про параметри та методи конструктора, перегляньте документацію для :class:`DocTestRunner` у розділі :ref:`doctest-advanced-api`.

source: There are two exceptions that may be raised by :class:`DebugRunner` instances:
uk: Є два винятки, які можуть бути викликані екземплярами :class:`DebugRunner`:

source: An exception raised by :class:`DocTestRunner` to signal that a doctest example's actual output did not match its expected output. The constructor arguments are used to initialize the attributes of the same names.
uk: Виняток, викликаний :class:`DocTestRunner`, щоб повідомити, що фактичний вихід прикладу doctest не збігається з його очікуваним результатом. Аргументи конструктора використовуються для ініціалізації однойменних атрибутів.

source: :exc:`DocTestFailure` defines the following attributes:
uk: :exc:`DocTestFailure` визначає такі атрибути:

source: The :class:`DocTest` object that was being run when the example failed.
uk: Об’єкт :class:`DocTest`, який запускався під час помилки прикладу.

source: The :class:`Example` that failed.
uk: Невдалий :class:`Example`.

source: The example's actual output.
uk: Фактичний результат прикладу.

source: An exception raised by :class:`DocTestRunner` to signal that a doctest example raised an unexpected exception. The constructor arguments are used to initialize the attributes of the same names.
uk: Виняток, викликаний :class:`DocTestRunner`, щоб сигналізувати про те, що приклад doctest викликав неочікуваний виняток. Аргументи конструктора використовуються для ініціалізації однойменних атрибутів.

source: :exc:`UnexpectedException` defines the following attributes:
uk: :exc:`UnexpectedException` визначає такі атрибути:

source: A tuple containing information about the unexpected exception, as returned by :func:`sys.exc_info`.
uk: Кортеж, що містить інформацію про неочікуваний виняток, яку повертає :func:`sys.exc_info`.

source: Soapbox
uk: Мильниця

source: As mentioned in the introduction, :mod:`doctest` has grown to have three primary uses:
uk: Як згадувалося у вступі, :mod:`doctest` зріс до трьох основних застосувань:

source: Checking examples in docstrings.
uk: Перевірка прикладів у рядках документів.

source: Regression testing.
uk: Регресійне тестування.

source: Executable documentation / literate testing.
uk: Виконувана документація / грамотне тестування.

source: These uses have different requirements, and it is important to distinguish them. In particular, filling your docstrings with obscure test cases makes for bad documentation.
uk: Ці види використання мають різні вимоги, і їх важливо розрізняти. Зокрема, заповнення ваших рядків документації незрозумілими тестовими прикладами створює погану документацію.

source: When writing a docstring, choose docstring examples with care. There's an art to this that needs to be learned---it may not be natural at first. Examples should add genuine value to the documentation. A good example can often be worth many words. If done with care, the examples will be invaluable for your users, and will pay back the time it takes to collect them many times over as the years go by and things change. I'm still amazed at how often one of my :mod:`doctest` examples stops working after a "harmless" change.
uk: Під час написання документаційного рядка обережно вибирайте приклади документаційного рядка. У цьому є певне мистецтво, якому потрібно навчитися --- спочатку це може бути неприродним. Приклади повинні додати справжню цінність документації. Хороший приклад часто вартий багатьох слів. Якщо їх робити обережно, приклади будуть безцінні для ваших користувачів і багаторазово окуплять час, потрачений на їх збирання, оскільки роки йдуть і все змінюється. Мене все ще дивує, як часто один із моїх прикладів :mod:`doctest` перестає працювати після "нешкідливої" зміни.

source: Doctest also makes an excellent tool for regression testing, especially if you don't skimp on explanatory text. By interleaving prose and examples, it becomes much easier to keep track of what's actually being tested, and why. When a test fails, good prose can make it much easier to figure out what the problem is, and how it should be fixed. It's true that you could write extensive comments in code-based testing, but few programmers do. Many have found that using doctest approaches instead leads to much clearer tests. Perhaps this is simply because doctest makes writing prose a little easier than writing code, while writing comments in code is a little harder. I think it goes deeper than just that: the natural attitude when writing a doctest-based test is that you want to explain the fine points of your software, and illustrate them with examples. This in turn naturally leads to test files that start with the simplest features, and logically progress to complications and edge cases. A coherent narrative is the result, instead of a collection of isolated functions that test isolated bits of functionality seemingly at random. It's a different attitude, and produces different results, blurring the distinction between testing and explaining.
uk: Doctest також є чудовим інструментом для регресійного тестування, особливо якщо ви не економите на пояснювальному тексті. Перемежовуючи прозу та приклади, стає набагато легше відслідковувати, що насправді перевіряється та чому. Якщо тест провалився, хороша проза може значно полегшити з’ясування проблеми та способи її вирішення. Це правда, що ви можете писати розгорнуті коментарі під час тестування на основі коду, але мало хто з програмістів це робить. Багато хто виявив, що використання підходів doctest натомість призводить до набагато чіткіших тестів. Можливо, це просто тому, що doctest робить написання прози трохи легшим, ніж написання коду, тоді як писати коментарі в коді трохи складніше. Я думаю, що це глибше, ніж просто це: природне ставлення до написання тесту на основі doctest полягає в тому, що ви хочете пояснити тонкощі свого програмного забезпечення та проілюструвати їх прикладами. Це, у свою чергу, природним чином призводить до тестових файлів, які починаються з найпростіших функцій і логічно прогресують до ускладнень і крайніх випадків. Результатом є послідовна розповідь, а не набір ізольованих функцій, які перевіряють окремі фрагменти функціональності, здавалося б, випадковим чином. Це інше ставлення, яке дає інші результати, стираючи різницю між тестуванням і поясненням.

source: Regression testing is best confined to dedicated objects or files. There are several options for organizing tests:
uk: Регресійне тестування найкраще обмежити виділеними об’єктами або файлами. Є кілька варіантів організації тестів:

source: Write text files containing test cases as interactive examples, and test the files using :func:`testfile` or :func:`DocFileSuite`. This is recommended, although is easiest to do for new projects, designed from the start to use doctest.
uk: Напишіть текстові файли, що містять тестові приклади як інтерактивні приклади, і протестуйте файли за допомогою :func:`testfile` або :func:`DocFileSuite`. Це рекомендовано, хоча це найлегше зробити для нових проектів, розроблених із самого початку для використання doctest.

source: Define functions named ``_regrtest_topic`` that consist of single docstrings, containing test cases for the named topics. These functions can be included in the same file as the module, or separated out into a separate test file.
uk: Визначте функції під назвою ``_regrtest_topic``, які складаються з окремих рядків документів, що містять тестові випадки для названих тем. Ці функції можна включити в той самий файл, що й модуль, або відокремити в окремий тестовий файл.

source: Define a ``__test__`` dictionary mapping from regression test topics to docstrings containing test cases.
uk: Визначте зіставлення словника ``__test__`` із тем регресійних тестів на рядки документів, що містять тестові приклади.

source: When you have placed your tests in a module, the module can itself be the test runner. When a test fails, you can arrange for your test runner to re-run only the failing doctest while you debug the problem. Here is a minimal example of such a test runner::
uk: Якщо ви розмістили свої тести в модулі, модуль сам може бути виконавцем тестів. Коли тест виходить невдалим, ви можете організувати повторний запуск лише невдалого документу, поки ви вирішуєте проблему. Ось мінімальний приклад такого тесту:

source: Footnotes
uk: Виноски

source: Examples containing both expected output and an exception are not supported. Trying to guess where one ends and the other begins is too error-prone, and that also makes for a confusing test.
uk: Приклади, що містять як очікуваний результат, так і виняток, не підтримуються. Спроба вгадати, де закінчується один і починається інший, занадто схильна до помилок, і це також створює заплутаний тест.
