Repository: python/python-docs-uk
Catalog: library/email.po
Languages: uk

source: :mod:`email` --- An email and MIME handling package
uk: :mod:`email` --- пакет обробки електронної пошти та MIME

source: **Source code:** :source:`Lib/email/__init__.py`
uk: **Вихідний код:** :source:`Lib/email/__init__.py`

source: The :mod:`email` package is a library for managing email messages. It is specifically *not* designed to do any sending of email messages to SMTP (:rfc:`2821`), NNTP, or other servers; those are functions of modules such as :mod:`smtplib` and :mod:`nntplib`. The :mod:`email` package attempts to be as RFC-compliant as possible, supporting :rfc:`5322` and :rfc:`6532`, as well as such MIME-related RFCs as :rfc:`2045`, :rfc:`2046`, :rfc:`2047`, :rfc:`2183`, and :rfc:`2231`.
uk: Пакет :mod:`email` — це бібліотека для керування повідомленнями електронної пошти. Він спеціально *не* призначений для надсилання повідомлень електронної пошти на SMTP (:rfc:`2821`), NNTP або інші сервери; це функції таких модулів, як :mod:`smtplib` і :mod:`nntplib`. Пакет :mod:`email` намагається бути максимально сумісним із RFC, підтримуючи :rfc:`5322` і :rfc:`6532`, а також такі пов’язані з MIME RFC, як :rfc:`2045`, :rfc:`2046`, :rfc:`2047`, :rfc:`2183` і :rfc:`2231`.

source: The overall structure of the email package can be divided into three major components, plus a fourth component that controls the behavior of the other components.
uk: Загальну структуру пакета електронної пошти можна розділити на три основні компоненти, плюс четвертий компонент, який контролює поведінку інших компонентів.

source: The central component of the package is an "object model" that represents email messages. An application interacts with the package primarily through the object model interface defined in the :mod:`~email.message` sub-module. The application can use this API to ask questions about an existing email, to construct a new email, or to add or remove email subcomponents that themselves use the same object model interface. That is, following the nature of email messages and their MIME subcomponents, the email object model is a tree structure of objects that all provide the :class:`~email.message.EmailMessage` API.
uk: Центральним компонентом пакету є "об’єктна модель", яка представляє повідомлення електронної пошти. Програма взаємодіє з пакетом переважно через інтерфейс об’єктної моделі, визначений у підмодулі :mod:`~email.message`. Програма може використовувати цей API, щоб ставити запитання щодо наявного електронного листа, створювати новий електронний лист або додавати чи видаляти підкомпоненти електронної пошти, які самі використовують той самий інтерфейс об’єктної моделі. Тобто, відповідно до природи повідомлень електронної пошти та їхніх підкомпонентів MIME, об’єктна модель електронної пошти є деревовидною структурою об’єктів, усі з яких забезпечують API :class:`~email.message.EmailMessage`.

source: The other two major components of the package are the :mod:`~email.parser` and the :mod:`~email.generator`. The parser takes the serialized version of an email message (a stream of bytes) and converts it into a tree of :class:`~email.message.EmailMessage` objects. The generator takes an :class:`~email.message.EmailMessage` and turns it back into a serialized byte stream. (The parser and generator also handle streams of text characters, but this usage is discouraged as it is too easy to end up with messages that are not valid in one way or another.)
uk: Двома іншими основними компонентами пакета є :mod:`~email.parser` і :mod:`~email.generator`. Синтаксичний аналізатор бере серіалізовану версію повідомлення електронної пошти (потік байтів) і перетворює його на дерево об’єктів :class:`~email.message.EmailMessage`. Генератор приймає :class:`~email.message.EmailMessage` і перетворює його назад на серіалізований потік байтів. (Антаксичний аналізатор і генератор також обробляють потоки текстових символів, але таке використання не рекомендується, оскільки надто легко отримати повідомлення, які тим чи іншим чином є недійсними.)

source: The control component is the :mod:`~email.policy` module. Every :class:`~email.message.EmailMessage`, every :mod:`~email.generator`, and every :mod:`~email.parser` has an associated :mod:`~email.policy` object that controls its behavior. Usually an application only needs to specify the policy when an :class:`~email.message.EmailMessage` is created, either by directly instantiating an :class:`~email.message.EmailMessage` to create a new email, or by parsing an input stream using a :mod:`~email.parser`. But the policy can be changed when the message is serialized using a :mod:`~email.generator`. This allows, for example, a generic email message to be parsed from disk, but to serialize it using standard SMTP settings when sending it to an email server.
uk: Керуючим компонентом є модуль :mod:`~email.policy`. Кожен :class:`~email.message.EmailMessage`, кожен :mod:`~email.generator` і кожен :mod:`~email.parser` має пов’язаний об’єкт :mod:`~email.policy`, який контролює його поведінку. Зазвичай програмі потрібно лише вказати політику, коли створюється :class:`~email.message.EmailMessage`, шляхом безпосереднього створення екземпляра :class:`~email.message.EmailMessage` для створення нового електронного листа або аналізу вхідний потік за допомогою :mod:`~email.parser`. Але політику можна змінити, якщо повідомлення серіалізовано за допомогою :mod:`~email.generator`. Це дозволяє, наприклад, аналізувати загальне повідомлення електронної пошти з диска, але серіалізувати його за допомогою стандартних параметрів SMTP під час надсилання на сервер електронної пошти.

source: The email package does its best to hide the details of the various governing RFCs from the application. Conceptually the application should be able to treat the email message as a structured tree of unicode text and binary attachments, without having to worry about how these are represented when serialized. In practice, however, it is often necessary to be aware of at least some of the rules governing MIME messages and their structure, specifically the names and nature of the MIME "content types" and how they identify multipart documents. For the most part this knowledge should only be required for more complex applications, and even then it should only be the high level structure in question, and not the details of how those structures are represented. Since MIME content types are used widely in modern internet software (not just email), this will be a familiar concept to many programmers.
uk: Пакет електронної пошти робить усе можливе, щоб приховати деталі різних керівних RFC від програми. Концептуально програма повинна мати можливість розглядати повідомлення електронної пошти як структуроване дерево тексту Юнікод і двійкових вкладень, не турбуючись про те, як вони представлені під час серіалізації. На практиці, однак, часто необхідно знати принаймні деякі правила, що регулюють повідомлення MIME та їхню структуру, зокрема назви та природу "типів вмісту" MIME та те, як вони ідентифікують багатокомпонентні документи. Здебільшого ці знання потрібні лише для більш складних застосувань, і навіть тоді це має бути лише структура високого рівня, а не деталі того, як ці структури представлені. Оскільки типи вмісту MIME широко використовуються в сучасному Інтернет-програмному забезпеченні (не лише в електронній пошті), це буде знайомим поняттям для багатьох програмістів.

source: The following sections describe the functionality of the :mod:`email` package. We start with the :mod:`~email.message` object model, which is the primary interface an application will use, and follow that with the :mod:`~email.parser` and :mod:`~email.generator` components. Then we cover the :mod:`~email.policy` controls, which completes the treatment of the main components of the library.
uk: У наступних розділах описується функціональність пакета :mod:`email`. Ми починаємо з об’єктної моделі :mod:`~email.message`, яка є основним інтерфейсом, який використовуватиме додаток, і продовжуємо це з :mod:`~email.parser` і :mod:`~email.generator` компоненти. Потім ми розглядаємо елементи керування :mod:`~email.policy`, що завершує обробку основних компонентів бібліотеки.

source: The next three sections cover the exceptions the package may raise and the defects (non-compliance with the RFCs) that the :mod:`~email.parser` may detect. Then we cover the :mod:`~email.headerregistry` and the :mod:`~email.contentmanager` sub-components, which provide tools for doing more detailed manipulation of headers and payloads, respectively. Both of these components contain features relevant to consuming and producing non-trivial messages, but also document their extensibility APIs, which will be of interest to advanced applications.
uk: У наступних трьох розділах розглядаються винятки, які може викликати пакунок, і дефекти (невідповідність RFC), які може виявити :mod:`~email.parser`. Далі ми розглядаємо підкомпоненти :mod:`~email.headerregistry` і :mod:`~email.contentmanager`, які надають інструменти для більш детального маніпулювання заголовками та корисними навантаженнями відповідно. Обидва ці компоненти містять функції, пов’язані зі споживанням і створенням нетривіальних повідомлень, але також документують їхні API розширюваності, які будуть цікаві для розширених програм.

source: Following those is a set of examples of using the fundamental parts of the APIs covered in the preceding sections.
uk: Після них наведено набір прикладів використання основних частин API, розглянутих у попередніх розділах.

source: The foregoing represent the modern (unicode friendly) API of the email package. The remaining sections, starting with the :class:`~email.message.Message` class, cover the legacy :data:`~email.policy.compat32` API that deals much more directly with the details of how email messages are represented. The :data:`~email.policy.compat32` API does *not* hide the details of the RFCs from the application, but for applications that need to operate at that level, they can be useful tools. This documentation is also relevant for applications that are still using the :mod:`~email.policy.compat32` API for backward compatibility reasons.
uk: Вищезазначене представляє сучасний (дружній до Unicode) API пакета електронної пошти. Решта розділів, починаючи з класу :class:`~email.message.Message`, охоплюють застарілий API :data:`~email.policy.compat32`, який має набагато більш пряме справу з деталями представлення повідомлень електронної пошти. :data:`~email.policy.compat32` API *не* приховує деталі RFC від програми, але для програм, яким потрібно працювати на цьому рівні, вони можуть бути корисними інструментами. Ця документація також актуальна для програм, які все ще використовують :mod:`~email.policy.compat32` API з причин зворотної сумісності.

source: Docs reorganized and rewritten to promote the new :class:`~email.message.EmailMessage`/:class:`~email.policy.EmailPolicy` API.
uk: Документи реорганізовано та переписано для просування нового :class:`~email.message.EmailMessage`/:class:`~email.policy.EmailPolicy` API.

source: Contents of the :mod:`email` package documentation:
uk: Вміст документації пакета :mod:`email`:

source: Legacy API:
uk: Застарілий API:

source: Module :mod:`smtplib`
uk: Модуль :mod:`smtplib`

source: SMTP (Simple Mail Transport Protocol) client
uk: Клієнт SMTP (Simple Mail Transport Protocol).

source: Module :mod:`poplib`
uk: Модуль :mod:`poplib`

source: POP (Post Office Protocol) client
uk: Клієнт POP (Post Office Protocol).

source: Module :mod:`imaplib`
uk: Модуль :mod:`imaplib`

source: IMAP (Internet Message Access Protocol) client
uk: Клієнт IMAP (Internet Message Access Protocol).

source: Module :mod:`nntplib`
uk: Модуль :mod:`nntplib`

source: NNTP (Net News Transport Protocol) client
uk: Клієнт NNTP (Net News Transport Protocol).

source: Module :mod:`mailbox`
uk: Модуль :mod:`mailbox`

source: Tools for creating, reading, and managing collections of messages on disk using a variety standard formats.
uk: Інструменти для створення, читання та керування колекціями повідомлень на диску з використанням різноманітних стандартних форматів.

source: Module :mod:`smtpd`
uk: Модуль :mod:`smtpd`

source: SMTP server framework (primarily useful for testing)
uk: Структура сервера SMTP (насамперед корисна для тестування)
