Repository: python/python-docs-uk
Catalog: library/email.encoders.po
Languages: uk

source: :mod:`email.encoders`: Encoders
uk: :mod:`email.encoders`: Кодери

source: **Source code:** :source:`Lib/email/encoders.py`
uk: **Вихідний код:** :source:`Lib/email/encoders.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API the functionality is provided by the *cte* parameter of the :meth:`~email.message.EmailMessage.set_content` method.
uk: Цей модуль є частиною застарілого (``Compat32``) API електронної пошти. У новому API функціональні можливості забезпечуються параметром *cte* методу :meth:`~email.message.EmailMessage.set_content`.

source: This module is deprecated in Python 3. The functions provided here should not be called explicitly since the :class:`~email.mime.text.MIMEText` class sets the content type and CTE header using the *_subtype* and *_charset* values passed during the instantiation of that class.
uk: Цей модуль є застарілим у Python 3. Надані тут функції не слід викликати явно, оскільки клас :class:`~email.mime.text.MIMEText` встановлює тип вмісту та заголовок CTE за допомогою значень *_subtype* і *_charset* передана під час створення екземпляра цього класу.

source: The remaining text in this section is the original documentation of the module.
uk: Решта тексту в цьому розділі є оригінальною документацією модуля.

source: When creating :class:`~email.message.Message` objects from scratch, you often need to encode the payloads for transport through compliant mail servers. This is especially true for :mimetype:`image/\*` and :mimetype:`text/\*` type messages containing binary data.
uk: Під час створення об’єктів :class:`~email.message.Message` з нуля вам часто потрібно закодувати корисні дані для транспортування через сумісні поштові сервери. Особливо це стосується повідомлень типу :mimetype:`image/\*` і :mimetype:`text/\*`, що містять двійкові дані.

source: The :mod:`email` package provides some convenient encoders in its :mod:`encoders` module. These encoders are actually used by the :class:`~email.mime.audio.MIMEAudio` and :class:`~email.mime.image.MIMEImage` class constructors to provide default encodings. All encoder functions take exactly one argument, the message object to encode. They usually extract the payload, encode it, and reset the payload to this newly encoded value. They should also set the :mailheader:`Content-Transfer-Encoding` header as appropriate.
uk: Пакет :mod:`email` містить кілька зручних кодувальників у своєму модулі :mod:`encoders`. Ці кодери фактично використовуються конструкторами класів :class:`~email.mime.audio.MIMEAudio` і :class:`~email.mime.image.MIMEImage` для надання стандартних кодувань. Усі функції кодувальника приймають лише один аргумент, об’єкт повідомлення, який потрібно кодувати. Зазвичай вони витягують корисне навантаження, кодують його та скидають корисне навантаження до цього щойно закодованого значення. Вони також повинні встановити відповідний заголовок :mailheader:`Content-Transfer-Encoding`.

source: Note that these functions are not meaningful for a multipart message. They must be applied to individual subparts instead, and will raise a :exc:`TypeError` if passed a message whose type is multipart.
uk: Зауважте, що ці функції не мають значення для багатокомпонентного повідомлення. Натомість вони повинні застосовуватися до окремих підчастин і викличуть :exc:`TypeError`, якщо передано повідомлення, тип якого є багатокомпонентним.

source: Here are the encoding functions provided:
uk: Ось доступні функції кодування:

source: Encodes the payload into quoted-printable form and sets the :mailheader:`Content-Transfer-Encoding` header to ``quoted-printable`` [#]_. This is a good encoding to use when most of your payload is normal printable data, but contains a few unprintable characters.
uk: Кодує корисне навантаження у форму для друку в цитатах і встановлює для заголовка :mailheader:`Content-Transfer-Encoding` значення ``quoted-printable`` [#]_. Це хороше кодування для використання, коли більша частина вашого корисного навантаження є звичайними даними для друку, але містить кілька недрукованих символів.

source: Encodes the payload into base64 form and sets the :mailheader:`Content-Transfer-Encoding` header to ``base64``. This is a good encoding to use when most of your payload is unprintable data since it is a more compact form than quoted-printable. The drawback of base64 encoding is that it renders the text non-human readable.
uk: Кодує корисне навантаження у форму base64 і встановлює для заголовка :mailheader:`Content-Transfer-Encoding` значення ``base64``. Це хороше кодування для використання, коли більша частина вашого корисного навантаження є недрукованими даними, оскільки це більш компактна форма, ніж придатна для друку в цитатах. Недоліком кодування base64 є те, що воно робить текст недоступним для читання людиною.

source: This doesn't actually modify the message's payload, but it does set the :mailheader:`Content-Transfer-Encoding` header to either ``7bit`` or ``8bit`` as appropriate, based on the payload data.
uk: Це фактично не змінює корисне навантаження повідомлення, але встановлює для заголовка :mailheader:`Content-Transfer-Encoding` значення ``7bit`` або ``8bit`` відповідно, на основі даних корисного навантаження.

source: This does nothing; it doesn't even set the :mailheader:`Content-Transfer-Encoding` header.
uk: Це нічого не робить; він навіть не встановлює заголовок :mailheader:`Content-Transfer-Encoding`.

source: Footnotes
uk: Виноски

source: Note that encoding with :meth:`encode_quopri` also encodes all tabs and space characters in the data.
uk: Зауважте, що кодування за допомогою :meth:`encode_quopri` також кодує всі символи табуляції та пробілів у даних.
