Repository: python/python-docs-uk
Catalog: library/email_iterators.po
Languages: uk

source: **Source code:** :source:`Lib/email/iterators.py`
uk: **Вихідний код:** :source:`Lib/email/iterators.py`

source: Iterating over a message object tree is fairly easy with the :meth:`Message.walk <email.message.Message.walk>` method. The :mod:`email.iterators` module provides some useful higher level iterations over message object trees.
uk: Ітерація дерева об’єктів повідомлення досить проста за допомогою методу :meth:`Message.walk <email.message.Message.walk>`. Модуль :mod:`email.iterators` забезпечує деякі корисні ітерації вищого рівня над деревами об’єктів повідомлень.

source: This iterates over all the payloads in all the subparts of *msg*, returning the string payloads line-by-line. It skips over all the subpart headers, and it skips over any subpart with a payload that isn't a Python string. This is somewhat equivalent to reading the flat text representation of the message from a file using :meth:`~io.TextIOBase.readline`, skipping over all the intervening headers.
uk: Це повторює всі корисні навантаження в усіх підчастинах *msg*, повертаючи рядкові корисні навантаження рядок за рядком. Він пропускає всі заголовки підчастини, а також пропускає будь-яку підчастину з корисним навантаженням, яке не є рядком Python. Це дещо еквівалентно читанню простого текстового представлення повідомлення з файлу за допомогою :meth:`~io.TextIOBase.readline`, пропускаючи всі проміжні заголовки.

source: Optional *decode* is passed through to :meth:`Message.get_payload <email.message.Message.get_payload>`.
uk: Додаткове *decode* передається до :meth:`Message.get_payload <email.message.Message.get_payload>`.

source: This iterates over all the subparts of *msg*, returning only those subparts that match the MIME type specified by *maintype* and *subtype*.
uk: Це повторює всі підчастини *msg*, повертаючи лише ті підчастини, які відповідають типу MIME, визначеному *maintype* і *subtype*.

source: Note that *subtype* is optional; if omitted, then subpart MIME type matching is done only with the main type. *maintype* is optional too; it defaults to :mimetype:`text`.
uk: Зауважте, що *підтип* необов’язковий; якщо опущено, то зіставлення типу MIME підрозділу виконується лише з основним типом. *maintype* також необов'язковий; за замовчуванням :mimetype:`text`.

source: Thus, by default :func:`typed_subpart_iterator` returns each subpart that has a MIME type of :mimetype:`text/\*`.
uk: Таким чином, за замовчуванням :func:`typed_subpart_iterator` повертає кожну підчастину, яка має тип MIME :mimetype:`text/\*`.

source: The following function has been added as a useful debugging tool. It should *not* be considered part of the supported public interface for the package.
uk: Наведену нижче функцію було додано як корисний інструмент налагодження. Його *не* слід вважати частиною підтримуваного загальнодоступного інтерфейсу пакета.

source: Prints an indented representation of the content types of the message object structure. For example:
uk: Друкує представлення типів вмісту структури об’єкта повідомлення з відступом. Наприклад:

source: Optional *fp* is a file-like object to print the output to. It must be suitable for Python's :func:`print` function. *level* is used internally. *include_default*, if true, prints the default type as well.
uk: Необов’язковий *fp* — це файлоподібний об’єкт, у який потрібно надрукувати вихідні дані. Він має відповідати функції :func:`print` Python. *level* використовується внутрішньо. *include_default*, якщо true, також друкує тип за замовчуванням.
