Repository: python/python-docs-uk
Catalog: library/email_policy.po
Languages: uk

source: :mod:`email.policy`: Policy Objects
uk: :mod:`email.policy`: Об’єкти політики

source: **Source code:** :source:`Lib/email/policy.py`
uk: **Вихідний код:** :source:`Lib/email/policy.py`

source: The :mod:`email` package's prime focus is the handling of email messages as described by the various email and MIME RFCs. However, the general format of email messages (a block of header fields each consisting of a name followed by a colon followed by a value, the whole block followed by a blank line and an arbitrary 'body'), is a format that has found utility outside of the realm of email. Some of these uses conform fairly closely to the main email RFCs, some do not. Even when working with email, there are times when it is desirable to break strict compliance with the RFCs, such as generating emails that interoperate with email servers that do not themselves follow the standards, or that implement extensions you want to use in ways that violate the standards.
uk: Пакунок :mod:`email` головним чином зосереджується на обробці повідомлень електронної пошти, як описано в різних RFC електронної пошти та MIME. Однак загальний формат повідомлень електронної пошти (блок полів заголовка, кожне з яких складається з назви, за якою йде двокрапка, за якою йде значення, весь блок, після якого йде порожній рядок і довільний "тіло"), — це формат, який знайшов утиліта за межами сфери електронної пошти. Деякі з цих способів використання досить точно відповідають основним RFC електронної пошти, інші – ні. Навіть під час роботи з електронною поштою бувають випадки, коли бажано порушити сувору відповідність RFC, наприклад, створювати електронні листи, які взаємодіють із серверами електронної пошти, які самі по собі не дотримуються стандартів, або які реалізують розширення, які ви хочете використовувати, у спосіб, який порушує стандарти.

source: Policy objects give the email package the flexibility to handle all these disparate use cases.
uk: Об’єкти політики надають пакету електронної пошти гнучкість для обробки всіх цих різнорідних випадків використання.

source: A :class:`Policy` object encapsulates a set of attributes and methods that control the behavior of various components of the email package during use. :class:`Policy` instances can be passed to various classes and methods in the email package to alter the default behavior. The settable values and their defaults are described below.
uk: Об’єкт :class:`Policy` інкапсулює набір атрибутів і методів, які контролюють поведінку різних компонентів пакета електронної пошти під час використання. Екземпляри :class:`Policy` можна передати різним класам і методам у пакеті електронної пошти, щоб змінити типову поведінку. Нижче описано встановлені значення та їх значення за замовчуванням.

source: There is a default policy used by all classes in the email package. For all of the :mod:`~email.parser` classes and the related convenience functions, and for the :class:`~email.message.Message` class, this is the :class:`Compat32` policy, via its corresponding pre-defined instance :const:`compat32`. This policy provides for complete backward compatibility (in some cases, including bug compatibility) with the pre-Python3.3 version of the email package.
uk: Існує політика за замовчуванням, яка використовується всіма класами в пакеті електронної пошти. Для всіх класів :mod:`~email.parser` і відповідних функцій зручності, а також для класу :class:`~email.message.Message`, це політика :class:`Compat32` через відповідну політику попередньо визначений екземпляр :const:`compat32`. Ця політика забезпечує повну зворотну сумісність (у деяких випадках, включаючи сумісність із помилками) із версією пакета електронної пошти до Python3.3.

source: This default value for the *policy* keyword to :class:`~email.message.EmailMessage` is the :class:`EmailPolicy` policy, via its pre-defined instance :data:`~default`.
uk: Це значення за умовчанням для ключового слова *policy* для :class:`~email.message.EmailMessage` є політикою :class:`EmailPolicy` через її попередньо визначений екземпляр :data:`~default`.

source: When a :class:`~email.message.Message` or :class:`~email.message.EmailMessage` object is created, it acquires a policy. If the message is created by a :mod:`~email.parser`, a policy passed to the parser will be the policy used by the message it creates. If the message is created by the program, then the policy can be specified when it is created. When a message is passed to a :mod:`~email.generator`, the generator uses the policy from the message by default, but you can also pass a specific policy to the generator that will override the one stored on the message object.
uk: Коли створюється об’єкт :class:`~email.message.Message` або :class:`~email.message.EmailMessage`, він отримує політику. Якщо повідомлення створено :mod:`~email.parser`, політика, передана аналізатору, буде політикою, яка використовується у створеному ним повідомленні. Якщо повідомлення створюється програмою, то під час його створення можна вказати політику. Коли повідомлення передається до :mod:`~email.generator`, генератор використовує політику з повідомлення за замовчуванням, але ви також можете передати певну політику генератору, яка замінить політику, збережену в об’єкті повідомлення.

source: The default value for the *policy* keyword for the :mod:`email.parser` classes and the parser convenience functions **will be changing** in a future version of Python. Therefore you should **always specify explicitly which policy you want to use** when calling any of the classes and functions described in the :mod:`~email.parser` module.
uk: Значення за замовчуванням для ключового слова *policy* для класів :mod:`email.parser` і зручних функцій синтаксичного аналізатора **буде змінено** в наступній версії Python. Тому ви повинні **завжди чітко вказувати, яку політику ви хочете використовувати** під час виклику будь-якого з класів і функцій, описаних у модулі :mod:`~email.parser`.

source: The first part of this documentation covers the features of :class:`Policy`, an :term:`abstract base class` that defines the features that are common to all policy objects, including :const:`compat32`. This includes certain hook methods that are called internally by the email package, which a custom policy could override to obtain different behavior. The second part describes the concrete classes :class:`EmailPolicy` and :class:`Compat32`, which implement the hooks that provide the standard behavior and the backward compatible behavior and features, respectively.
uk: Перша частина цієї документації охоплює функції :class:`Policy`, :term:`abstract base class`, який визначає функції, спільні для всіх об’єктів політики, включаючи :const:`compat32`. Це включає в себе певні методи підключення, які викликаються внутрішньо пакетом електронної пошти, які спеціальна політика може замінити, щоб отримати іншу поведінку. Друга частина описує конкретні класи :class:`EmailPolicy` і :class:`Compat32`, які реалізують хуки, які забезпечують стандартну поведінку та зворотну сумісність і функції відповідно.

source: :class:`Policy` instances are immutable, but they can be cloned, accepting the same keyword arguments as the class constructor and returning a new :class:`Policy` instance that is a copy of the original but with the specified attributes values changed.
uk: Екземпляри :class:`Policy` незмінні, але їх можна клонувати, приймаючи ті самі аргументи ключового слова, що й конструктор класу, і повертаючи новий екземпляр :class:`Policy`, який є копією оригіналу, але зі зміненими значеннями вказаних атрибутів .

source: As an example, the following code could be used to read an email message from a file on disk and pass it to the system ``sendmail`` program on a Unix system:
uk: Як приклад, наступний код можна використати для читання повідомлення електронної пошти з файлу на диску та передачі його системній програмі ``sendmail`` в системі Unix:

source: Here we are telling :class:`~email.generator.BytesGenerator` to use the RFC correct line separator characters when creating the binary string to feed into ``sendmail's`` ``stdin``, where the default policy would use ``\n`` line separators.
uk: Тут ми повідомляємо :class:`~email.generator.BytesGenerator` використовувати правильні символи роздільників рядків RFC під час створення двійкового рядка для передачі в ``stdin`` ``sendmail``, де політика за замовчуванням використовуватиме ``\n`` роздільники рядків.

source: Some email package methods accept a *policy* keyword argument, allowing the policy to be overridden for that method. For example, the following code uses the :meth:`~email.message.Message.as_bytes` method of the *msg* object from the previous example and writes the message to a file using the native line separators for the platform on which it is running::
uk: Деякі методи пакетів електронної пошти приймають аргумент ключового слова *policy*, що дозволяє перевизначати політику для цього методу. Наприклад, у наступному коді використовується метод :meth:`~email.message.Message.as_bytes` об’єкта *msg* із попереднього прикладу та записує повідомлення у файл, використовуючи рідні розділювачі рядків для платформи, на якій воно біжить::

source: Policy objects can also be combined using the addition operator, producing a policy object whose settings are a combination of the non-default values of the summed objects::
uk: Об’єкти політики також можна комбінувати за допомогою оператора додавання, утворюючи об’єкт політики, параметри якого є комбінацією нестандартних значень сумованих об’єктів::

source: This operation is not commutative; that is, the order in which the objects are added matters. To illustrate::
uk: Ця операція не є комутативною; тобто порядок, у якому додаються об’єкти, має значення. Проілюструвати::

source: This is the :term:`abstract base class` for all policy classes. It provides default implementations for a couple of trivial methods, as well as the implementation of the immutability property, the :meth:`clone` method, and the constructor semantics.
uk: Це :term:`abstract base class` для всіх класів політики. Він забезпечує реалізацію за замовчуванням для кількох тривіальних методів, а також реалізацію властивості незмінності, метод :meth:`clone` і семантику конструктора.

source: The constructor of a policy class can be passed various keyword arguments. The arguments that may be specified are any non-method properties on this class, plus any additional non-method properties on the concrete class. A value specified in the constructor will override the default value for the corresponding attribute.
uk: Конструктору класу політики можна передати різні ключові аргументи. Аргументами, які можна вказати, є будь-які неметодні властивості цього класу, а також будь-які додаткові неметодні властивості конкретного класу. Значення, указане в конструкторі, замінить значення за замовчуванням для відповідного атрибута.

source: This class defines the following properties, and thus values for the following may be passed in the constructor of any policy class:
uk: Цей клас визначає наступні властивості, і, отже, значення для наступного можна передати в конструктор будь-якого класу політики:

source: The maximum length of any line in the serialized output, not counting the end of line character(s). Default is 78, per :rfc:`5322`. A value of ``0`` or :const:`None` indicates that no line wrapping should be done at all.
uk: Максимальна довжина будь-якого рядка в серіалізованому виведенні, не враховуючи символ(и) кінця рядка. За замовчуванням 78 відповідно до :rfc:`5322`. Значення ``0`` або :const:`None` вказує на те, що перенесення рядків не потрібно виконувати взагалі.

source: The string to be used to terminate lines in serialized output. The default is ``\n`` because that's the internal end-of-line discipline used by Python, though ``\r\n`` is required by the RFCs.
uk: Рядок, який буде використовуватися для завершення рядків у серіалізованому виведенні. Типовим є ``\n``, оскільки це внутрішня дисципліна кінця рядка, яка використовується Python, хоча ``\r\n`` вимагається RFC.

source: Controls the type of Content Transfer Encodings that may be or are required to be used. The possible values are:
uk: Керує типом кодувань передачі вмісту, які можуть або повинні використовуватися. Можливі значення:

source: ``7bit``
uk: ``7 біт``

source: all data must be "7 bit clean" (ASCII-only). This means that where necessary data will be encoded using either quoted-printable or base64 encoding.
uk: усі дані мають бути "7-бітними чистими" (лише ASCII). Це означає, що там, де це необхідно, дані будуть закодовані з використанням кодування для друку в цитатах або кодування base64.

source: ``8bit``
uk: ``8 біт``

source: data is not constrained to be 7 bit clean. Data in headers is still required to be ASCII-only and so will be encoded (see :meth:`fold_binary` and :attr:`~EmailPolicy.utf8` below for exceptions), but body parts may use the ``8bit`` CTE.
uk: дані не мають обмежень бути чистими 7 біт. Дані в заголовках, як і раніше, повинні бути лише ASCII, тому вони будуть закодовані (див. :meth:`fold_binary` і :attr:`~EmailPolicy.utf8` нижче для винятків), але частини тіла можуть використовувати ``8bit`` CTE.

source: A ``cte_type`` value of ``8bit`` only works with ``BytesGenerator``, not ``Generator``, because strings cannot contain binary data. If a ``Generator`` is operating under a policy that specifies ``cte_type=8bit``, it will act as if ``cte_type`` is ``7bit``.
uk: Значення ``cte_type`` ``8bit`` працює лише з ``BytesGenerator``, а не ``Generator``, оскільки рядки не можуть містити двійкові дані. Якщо ``генератор`` працює відповідно до політики, яка визначає ``cte_type=8bit``, він діятиме так, ніби ``cte_type`` має значення ``7bit``.

source: If :const:`True`, any defects encountered will be raised as errors. If :const:`False` (the default), defects will be passed to the :meth:`register_defect` method.
uk: Якщо :const:`True`, будь-які виявлені дефекти визначатимуться як помилки. Якщо :const:`False` (за замовчуванням), дефекти будуть передані в метод :meth:`register_defect`.

source: If :const:`True`, lines starting with *"From "* in the body are escaped by putting a ``>`` in front of them. This parameter is used when the message is being serialized by a generator. Default: :const:`False`.
uk: Якщо :const:`True`, рядки, що починаються з *"From "* у тілі, екрануються шляхом розміщення ``>`` перед ними. Цей параметр використовується, коли повідомлення серіалізується генератором. Типове значення: :const:`False`.

source: The *mangle_from_* parameter.
uk: Параметр *mangle_from_*.

source: A factory function for constructing a new empty message object. Used by the parser when building messages. Defaults to ``None``, in which case :class:`~email.message.Message` is used.
uk: Фабрична функція для створення нового порожнього об’єкта повідомлення. Використовується аналізатором під час створення повідомлень. За замовчуванням ``None``, у цьому випадку використовується :class:`~email.message.Message`.

source: The following :class:`Policy` method is intended to be called by code using the email library to create policy instances with custom settings:
uk: Наступний метод :class:`Policy` призначений для виклику за допомогою коду за допомогою бібліотеки електронної пошти для створення екземплярів політики з настроюваними налаштуваннями:

source: Return a new :class:`Policy` instance whose attributes have the same values as the current instance, except where those attributes are given new values by the keyword arguments.
uk: Повертає новий екземпляр :class:`Policy`, атрибути якого мають ті самі значення, що й поточний екземпляр, за винятком тих випадків, коли ці атрибути отримують нові значення аргументами ключового слова.

source: The remaining :class:`Policy` methods are called by the email package code, and are not intended to be called by an application using the email package. A custom policy must implement all of these methods.
uk: Решта методів :class:`Policy` викликається кодом пакета електронної пошти і не призначена для виклику програмою, яка використовує пакет електронної пошти. Спеціальна політика повинна реалізовувати всі ці методи.

source: Handle a *defect* found on *obj*. When the email package calls this method, *defect* will always be a subclass of :class:`~email.errors.Defect`.
uk: Виправити *дефект*, знайдений на *obj*. Коли пакет електронної пошти викликає цей метод, *defect* завжди буде підкласом :class:`~email.errors.Defect`.

source: The default implementation checks the :attr:`raise_on_defect` flag. If it is ``True``, *defect* is raised as an exception. If it is ``False`` (the default), *obj* and *defect* are passed to :meth:`register_defect`.
uk: Стандартна реалізація перевіряє прапорець :attr:`raise_on_defect`. Якщо значення ``True``, *defect* створюється як виняток. Якщо значення ``False`` (за замовчуванням), *obj* і *defect* передаються в :meth:`register_defect`.

source: Register a *defect* on *obj*. In the email package, *defect* will always be a subclass of :class:`~email.errors.Defect`.
uk: Зареєструйте *дефект* на *obj*. У пакеті електронної пошти *defect* завжди буде підкласом :class:`~email.errors.Defect`.

source: The default implementation calls the ``append`` method of the ``defects`` attribute of *obj*. When the email package calls :attr:`handle_defect`, *obj* will normally have a ``defects`` attribute that has an ``append`` method. Custom object types used with the email package (for example, custom ``Message`` objects) should also provide such an attribute, otherwise defects in parsed messages will raise unexpected errors.
uk: Стандартна реалізація викликає метод ``append`` атрибута ``defects`` *obj*. Коли пакет електронної пошти викликає :attr:`handle_defect`, *obj* зазвичай матиме атрибут ``defects``, який має метод ``append``. Спеціальні типи об’єктів, які використовуються з пакетом електронної пошти (наприклад, спеціальні об’єкти ``Message``), також повинні надавати такий атрибут, інакше дефекти в проаналізованих повідомленнях призведуть до неочікуваних помилок.

source: Return the maximum allowed number of headers named *name*.
uk: Повертає максимально дозволену кількість заголовків із назвою *ім’я*.

source: Called when a header is added to an :class:`~email.message.EmailMessage` or :class:`~email.message.Message` object. If the returned value is not ``0`` or ``None``, and there are already a number of headers with the name *name* greater than or equal to the value returned, a :exc:`ValueError` is raised.
uk: Викликається, коли заголовок додається до об’єкта :class:`~email.message.EmailMessage` або :class:`~email.message.Message`. Якщо повернуте значення не є ``0`` або ``None``, і вже існує кількість заголовків з іменем *name*, більшим або рівним поверненому значенню, виникає :exc:`ValueError` .

source: Because the default behavior of ``Message.__setitem__`` is to append the value to the list of headers, it is easy to create duplicate headers without realizing it. This method allows certain headers to be limited in the number of instances of that header that may be added to a ``Message`` programmatically. (The limit is not observed by the parser, which will faithfully produce as many headers as exist in the message being parsed.)
uk: Оскільки за замовчуванням ``Message.__setitem__`` додає значення до списку заголовків, легко створити дублікати заголовків, не усвідомлюючи цього. Цей метод дозволяє обмежити певні заголовки в кількості екземплярів цього заголовка, які можна додати до ``повідомлення`` програмним шляхом. (Обмеження не дотримується синтаксичним аналізатором, який сумлінно створить стільки заголовків, скільки існує в повідомленні, що аналізується.)

source: The default implementation returns ``None`` for all header names.
uk: Реалізація за замовчуванням повертає ``None`` для всіх імен заголовків.

source: The email package calls this method with a list of strings, each string ending with the line separation characters found in the source being parsed. The first line includes the field header name and separator. All whitespace in the source is preserved. The method should return the ``(name, value)`` tuple that is to be stored in the ``Message`` to represent the parsed header.
uk: Пакет електронної пошти викликає цей метод зі списком рядків, кожен рядок закінчується символами розділення рядків, знайденими в джерелі, що аналізується. Перший рядок містить назву заголовка поля та роздільник. Усі пробіли в джерелі збережено. Метод має повертати кортеж ``(name, value)``, який має зберігатися в ``Message`` для представлення аналізованого заголовка.

source: If an implementation wishes to retain compatibility with the existing email package policies, *name* should be the case preserved name (all characters up to the '``:``' separator), while *value* should be the unfolded value (all line separator characters removed, but whitespace kept intact), stripped of leading whitespace.
uk: Якщо реалізація бажає зберегти сумісність із існуючими політиками пакетів електронної пошти, *ім’я* має бути ім’ям із збереженням регістру (усі символи до роздільника "``:``), тоді як *значення* має бути розгорнутим значенням (усі символи-роздільники рядків видалено, але пробіли збережено без змін), видалено пробіли на початку.

source: *sourcelines* may contain surrogateescaped binary data.
uk: *вихідні лінії* можуть містити сурогатні двійкові дані.

source: There is no default implementation
uk: Реалізації за замовчуванням немає

source: The email package calls this method with the name and value provided by the application program when the application program is modifying a ``Message`` programmatically (as opposed to a ``Message`` created by a parser). The method should return the ``(name, value)`` tuple that is to be stored in the ``Message`` to represent the header.
uk: Пакет електронної пошти викликає цей метод із назвою та значенням, наданими прикладною програмою, коли прикладна програма програмно змінює ``повідомлення`` (на відміну від ``повідомлення``, створеного аналізатором). Метод має повертати кортеж ``(name, value)``, який має зберігатися в ``Message`` для представлення заголовка.

source: If an implementation wishes to retain compatibility with the existing email package policies, the *name* and *value* should be strings or string subclasses that do not change the content of the passed in arguments.
uk: Якщо реалізація бажає зберегти сумісність із існуючими політиками пакетів електронної пошти, *ім’я* та *значення* мають бути рядками або підкласами рядків, які не змінюють вміст переданих аргументів.

source: The email package calls this method with the *name* and *value* currently stored in the ``Message`` when that header is requested by the application program, and whatever the method returns is what is passed back to the application as the value of the header being retrieved. Note that there may be more than one header with the same name stored in the ``Message``; the method is passed the specific name and value of the header destined to be returned to the application.
uk: Пакет електронної пошти викликає цей метод із *ім’ям* і *значенням*, які наразі зберігаються в ``Message``, коли прикладна програма запитує цей заголовок, і те, що метод повертає, передається назад до програми як значення заголовка, що витягується. Зауважте, що в ``Повідомленні`` може бути більше одного заголовка з однаковою назвою; методу передається конкретне ім'я та значення заголовка, призначеного для повернення до програми.

source: *value* may contain surrogateescaped binary data. There should be no surrogateescaped binary data in the value returned by the method.
uk: *значення* може містити сурогатні екрановані двійкові дані. У значенні, яке повертає метод, не повинно бути сурогатних двійкових даних.
