Repository: python/python-docs-uk
Catalog: library/email.charset.po
Languages: uk

source: :mod:`email.charset`: Representing character sets
uk: :mod:`email.charset`: представлення наборів символів

source: **Source code:** :source:`Lib/email/charset.py`
uk: **Вихідний код:** :source:`Lib/email/charset.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API only the aliases table is used.
uk: Цей модуль є частиною застарілого (``Compat32``) API електронної пошти. У новому API використовується лише таблиця псевдонімів.

source: The remaining text in this section is the original documentation of the module.
uk: Решта тексту в цьому розділі є оригінальною документацією модуля.

source: This module provides a class :class:`Charset` for representing character sets and character set conversions in email messages, as well as a character set registry and several convenience methods for manipulating this registry. Instances of :class:`Charset` are used in several other modules within the :mod:`email` package.
uk: Цей модуль надає клас :class:`Charset` для представлення наборів символів і перетворення наборів символів у повідомленнях електронної пошти, а також реєстр наборів символів і декілька зручних методів для маніпулювання цим реєстром. Екземпляри :class:`Charset` використовуються в кількох інших модулях у пакеті :mod:`email`.

source: Import this class from the :mod:`email.charset` module.
uk: Імпортуйте цей клас із модуля :mod:`email.charset`.

source: Map character sets to their email properties.
uk: Зіставте набори символів із властивостями електронної пошти.

source: This class provides information about the requirements imposed on email for a specific character set. It also provides convenience routines for converting between character sets, given the availability of the applicable codecs. Given a character set, it will do its best to provide information on how to use that character set in an email message in an RFC-compliant way.
uk: Цей клас надає інформацію про вимоги до електронної пошти для певного набору символів. Він також надає зручні процедури для перетворення між наборами символів, враховуючи наявність застосовних кодеків. Маючи набір символів, він докладе всіх зусиль, щоб надати інформацію про те, як використовувати цей набір символів у повідомленні електронної пошти відповідно до RFC.

source: Certain character sets must be encoded with quoted-printable or base64 when used in email headers or bodies. Certain character sets must be converted outright, and are not allowed in email.
uk: Певні набори символів мають бути закодовані за допомогою citaty-printable або base64, якщо вони використовуються в заголовках або тілах електронних листів. Певні набори символів потрібно відразу конвертувати, і їх заборонено використовувати в електронній пошті.

source: Optional *input_charset* is as described below; it is always coerced to lower case. After being alias normalized it is also used as a lookup into the registry of character sets to find out the header encoding, body encoding, and output conversion codec to be used for the character set. For example, if *input_charset* is ``iso-8859-1``, then headers and bodies will be encoded using quoted-printable and no output conversion codec is necessary. If *input_charset* is ``euc-jp``, then headers will be encoded with base64, bodies will not be encoded, but output text will be converted from the ``euc-jp`` character set to the ``iso-2022-jp`` character set.
uk: Додатковий *input_charset*, як описано нижче; це завжди примусово до малого регістру. Після нормалізації псевдоніма він також використовується як пошук у реєстрі наборів символів, щоб дізнатися кодування заголовка, кодування основного тексту та кодек перетворення виводу, який буде використано для набору символів. Наприклад, якщо *input_charset* дорівнює ``iso-8859-1``, тоді заголовки та тіла кодуватимуться з використанням параметра "quote-printable", і кодек для перетворення виводу не потрібен. Якщо *input_charset* має значення ``euc-jp``, тоді заголовки будуть закодовані за допомогою base64, тіла не будуть закодовані, але вихідний текст буде перетворено з набору символів ``euc-jp`` на ``iso- 2022-jp`` набір символів.

source: :class:`Charset` instances have the following data attributes:
uk: Екземпляри :class:`Charset` мають такі атрибути даних:

source: The initial character set specified. Common aliases are converted to their *official* email names (e.g. ``latin_1`` is converted to ``iso-8859-1``). Defaults to 7-bit ``us-ascii``.
uk: Зазначений початковий набір символів. Загальні псевдоніми перетворюються на *офіційні* імена електронної пошти (наприклад, ``latin_1`` перетворюється на ``iso-8859-1``). За замовчуванням 7-бітний ``us-ascii``.

source: If the character set must be encoded before it can be used in an email header, this attribute will be set to ``Charset.QP`` (for quoted-printable), ``Charset.BASE64`` (for base64 encoding), or ``Charset.SHORTEST`` for the shortest of QP or BASE64 encoding. Otherwise, it will be ``None``.
uk: Якщо набір символів потрібно закодувати, перш ніж його можна буде використовувати в заголовку електронної пошти, цей атрибут буде встановлено на ``Charset.QP`` (для друкованих цитат), ``Charset.BASE64`` (для кодування base64), або ``Charset.SHORTEST`` для найкоротшого кодування QP або BASE64. В іншому випадку буде ``None``.

source: Same as *header_encoding*, but describes the encoding for the mail message's body, which indeed may be different than the header encoding. ``Charset.SHORTEST`` is not allowed for *body_encoding*.
uk: Те саме, що *header_encoding*, але описує кодування для тіла поштового повідомлення, яке справді може відрізнятися від кодування заголовка. ``Charset.SHORTEST`` не дозволений для *body_encoding*.

source: Some character sets must be converted before they can be used in email headers or bodies. If the *input_charset* is one of them, this attribute will contain the name of the character set output will be converted to. Otherwise, it will be ``None``.
uk: Деякі набори символів потрібно перетворити, перш ніж їх можна буде використовувати в заголовках або тексті електронних листів. Якщо *input_charset* є одним із них, цей атрибут міститиме ім’я набору символів, у який буде перетворено вихід. В іншому випадку буде ``None``.

source: The name of the Python codec used to convert the *input_charset* to Unicode. If no conversion codec is necessary, this attribute will be ``None``.
uk: Назва кодека Python, який використовується для перетворення *input_charset* в Unicode. Якщо кодек перетворення не потрібен, цей атрибут матиме значення ``None``.

source: The name of the Python codec used to convert Unicode to the *output_charset*. If no conversion codec is necessary, this attribute will have the same value as the *input_codec*.
uk: Назва кодека Python, який використовується для перетворення Unicode у *output_charset*. Якщо кодек перетворення не потрібен, цей атрибут матиме те саме значення, що й *input_codec*.

source: :class:`Charset` instances also have the following methods:
uk: Екземпляри :class:`Charset` також мають такі методи:

source: Return the content transfer encoding used for body encoding.
uk: Повертає кодування передачі вмісту, яке використовується для кодування тіла.

source: This is either the string ``quoted-printable`` or ``base64`` depending on the encoding used, or it is a function, in which case you should call the function with a single argument, the Message object being encoded. The function should then set the :mailheader:`Content-Transfer-Encoding` header itself to whatever is appropriate.
uk: Це або рядок ``quoted-printable`` або ``base64`` залежно від кодування, що використовується, або це функція, у цьому випадку ви повинні викликати функцію з одним аргументом, об’єкт Message, який кодується. Потім функція має встановити відповідний заголовок :mailheader:`Content-Transfer-Encoding`.

source: Returns the string ``quoted-printable`` if *body_encoding* is ``QP``, returns the string ``base64`` if *body_encoding* is ``BASE64``, and returns the string ``7bit`` otherwise.
uk: Повертає рядок ``quoted-printable``, якщо *body_encoding* має значення ``QP``, повертає рядок ``base64``, якщо *body_encoding* має ``BASE64``, і повертає рядок ``7bit`` в іншому випадку .

source: Return the output character set.
uk: Повернути вихідний набір символів.

source: This is the *output_charset* attribute if that is not ``None``, otherwise it is *input_charset*.
uk: Це атрибут *output_charset*, якщо це не ``None``, інакше це *input_charset*.

source: Header-encode the string *string*.
uk: Заголовок кодує рядок *string*.

source: The type of encoding (base64 or quoted-printable) will be based on the *header_encoding* attribute.
uk: Тип кодування (base64 або друковані цитати) базуватиметься на атрибуті *header_encoding*.

source: Header-encode a *string* by converting it first to bytes.
uk: Заголовок кодує *рядок*, спочатку перетворюючи його на байти.

source: This is similar to :meth:`header_encode` except that the string is fit into maximum line lengths as given by the argument *maxlengths*, which must be an iterator: each element returned from this iterator will provide the next maximum line length.
uk: Це схоже на :meth:`header_encode`, за винятком того, що рядок вписується в максимальну довжину рядка, задану аргументом *maxlengths*, який має бути ітератором: кожен елемент, повернутий цим ітератором, забезпечить наступну максимальну довжину рядка.

source: Body-encode the string *string*.
uk: Основне кодування рядка *string*.

source: The type of encoding (base64 or quoted-printable) will be based on the *body_encoding* attribute.
uk: Тип кодування (base64 або з можливістю друку в цитатах) базуватиметься на атрибуті *body_encoding*.

source: The :class:`Charset` class also provides a number of methods to support standard operations and built-in functions.
uk: Клас :class:`Charset` також надає ряд методів для підтримки стандартних операцій і вбудованих функцій.

source: Returns *input_charset* as a string coerced to lower case. :meth:`__repr__` is an alias for :meth:`__str__`.
uk: Повертає *input_charset* як рядок, переведений у нижній регістр. :meth:`__repr__` є псевдонімом для :meth:`__str__`.

source: This method allows you to compare two :class:`Charset` instances for equality.
uk: Цей метод дозволяє порівнювати два екземпляри :class:`Charset` на рівність.

source: This method allows you to compare two :class:`Charset` instances for inequality.
uk: Цей метод дозволяє порівнювати два екземпляри :class:`Charset` на нерівність.

source: The :mod:`email.charset` module also provides the following functions for adding new entries to the global character set, alias, and codec registries:
uk: Модуль :mod:`email.charset` також надає такі функції для додавання нових записів до глобального набору символів, псевдонімів і реєстрів кодеків:

source: Add character properties to the global registry.
uk: Додайте властивості символів до глобального реєстру.

source: *charset* is the input character set, and must be the canonical name of a character set.
uk: *charset* — це вхідний набір символів і має бути канонічною назвою набору символів.

source: Optional *header_enc* and *body_enc* is either ``Charset.QP`` for quoted-printable, ``Charset.BASE64`` for base64 encoding, ``Charset.SHORTEST`` for the shortest of quoted-printable or base64 encoding, or ``None`` for no encoding. ``SHORTEST`` is only valid for *header_enc*. The default is ``None`` for no encoding.
uk: Необов’язкові *header_enc* і *body_enc* є або ``Charset.QP`` для друкованих цитат, ``Charset.BASE64`` для кодування base64, ``Charset.SHORTEST`` для найкоротшого кодування друкованих цитат або base64 або ``None`` для відсутності кодування. ``SHORTEST`` дійсний лише для *header_enc*. Типовим значенням є ``None`` для відсутності кодування.

source: Optional *output_charset* is the character set that the output should be in. Conversions will proceed from input charset, to Unicode, to the output charset when the method :meth:`Charset.convert` is called. The default is to output in the same character set as the input.
uk: Необов’язковий *output_charset* — це набір символів, у якому мають бути виведені дані. Під час виклику методу :meth:`Charset.convert` перетворення відбуватиметься з вхідного набору символів у Unicode у вихідний набір символів. За замовчуванням виводиться той самий набір символів, що й вхід.

source: Both *input_charset* and *output_charset* must have Unicode codec entries in the module's character set-to-codec mapping; use :func:`add_codec` to add codecs the module does not know about. See the :mod:`codecs` module's documentation for more information.
uk: Як *input_charset*, так і *output_charset* повинні мати записи кодека Юнікод у відображенні набору символів у кодек модуля; використовуйте :func:`add_codec`, щоб додати кодеки, про які модуль не знає. Для отримання додаткової інформації дивіться документацію модуля :mod:`codecs`.

source: The global character set registry is kept in the module global dictionary ``CHARSETS``.
uk: Глобальний реєстр набору символів зберігається в глобальному словнику модуля ``CHARSETS``.

source: Add a character set alias. *alias* is the alias name, e.g. ``latin-1``. *canonical* is the character set's canonical name, e.g. ``iso-8859-1``.
uk: Додайте псевдонім набору символів. *alias* — псевдонім, напр. ``латин-1``. *canonical* — це канонічне ім’я набору символів, напр. ``iso-8859-1``.

source: The global charset alias registry is kept in the module global dictionary ``ALIASES``.
uk: Глобальний реєстр псевдонімів кодування зберігається в глобальному словнику модуля ``ALIASES``.

source: Add a codec that map characters in the given character set to and from Unicode.
uk: Додайте кодек, який відображає символи в заданому наборі символів у та з Unicode.

source: *charset* is the canonical name of a character set. *codecname* is the name of a Python codec, as appropriate for the second argument to the :class:`str`'s :meth:`~str.encode` method.
uk: *charset* — це канонічна назва набору символів. *codecname* — це назва кодека Python, відповідно до другого аргументу методу :class:`str` :meth:`~str.encode`.
