Repository: python/python-docs-uk
Catalog: library/email_utils.po
Languages: uk

source: **Source code:** :source:`Lib/email/utils.py`
uk: **Вихідний код:** :source:`Lib/email/utils.py`

source: There are a couple of useful utilities provided in the :mod:`email.utils` module:
uk: У модулі :mod:`email.utils` є кілька корисних утиліт:

source: Returns a string suitable for an :rfc:`2822`\ -compliant :mailheader:`Message-ID` header. Optional *idstring* if given, is a string used to strengthen the uniqueness of the message id. Optional *domain* if given provides the portion of the msgid after the '@'. The default is the local hostname. It is not normally necessary to override this default, but may be useful certain cases, such as a constructing distributed system that uses a consistent domain name across multiple hosts.
uk: Повертає рядок, який підходить для :rfc:`2822`\ -сумісного заголовка :mailheader:`Message-ID`. Необов’язковий *idstring*, якщо вказано, це рядок, який використовується для посилення унікальності ідентифікатора повідомлення. Необов’язковий *домен*, якщо вказано, надає частину msgid після "@". Типовим є локальне ім’я хоста. Зазвичай немає необхідності змінювати це значення за замовчуванням, але це може бути корисним у певних випадках, наприклад, при побудові розподіленої системи, яка використовує узгоджене доменне ім’я на кількох хостах.

source: Added the *domain* keyword.
uk: Додано ключове слово *domain*.

source: The remaining functions are part of the legacy (``Compat32``) email API. There is no need to directly use these with the new API, since the parsing and formatting they provide is done automatically by the header parsing machinery of the new API.
uk: Решта функцій є частиною застарілого (``Compat32``) API електронної пошти. Немає потреби безпосередньо використовувати їх із новим API, оскільки синтаксичний аналіз і форматування, які вони надають, виконуються автоматично механізмом аналізу заголовків нового API.

source: Return a new string with backslashes in *str* replaced by two backslashes, and double quotes replaced by backslash-double quote.
uk: Повертає новий рядок із зворотними похилими рисками в *str*, заміненими двома зворотними похилими рисками, і подвійними лапками, заміненими зворотними похилими рисками-подвійними лапками.

source: Return a new string which is an *unquoted* version of *str*. If *str* ends and begins with double quotes, they are stripped off. Likewise if *str* ends and begins with angle brackets, they are stripped off.
uk: Повертає новий рядок, який є версією *str* без лапок. Якщо *str* закінчується і починається подвійними лапками, вони видаляються. Так само, якщо *str* закінчується і починається кутовими дужками, вони видаляються.

source: Parse address -- which should be the value of some address-containing field such as :mailheader:`To` or :mailheader:`Cc` -- into its constituent *realname* and *email address* parts. Returns a tuple of that information, unless the parse fails, in which case a 2-tuple of ``('', '')`` is returned.
uk: Проаналізуйте адресу, яка має бути значенням деякого поля, що містить адресу, наприклад :mailheader:`To` або :mailheader:`Cc`, на його складові частини *realname* і *email address*. Повертає кортеж із цією інформацією, якщо синтаксичний аналіз не вдається, у цьому випадку повертається 2-кортеж ``('', '')``.

source: The inverse of :meth:`parseaddr`, this takes a 2-tuple of the form ``(realname, email_address)`` and returns the string value suitable for a :mailheader:`To` or :mailheader:`Cc` header. If the first element of *pair* is false, then the second element is returned unmodified.
uk: Інверсія :meth:`parseaddr`, приймає 2-кортеж у формі ``(справжнє ім’я, електронна_адреса)`` і повертає значення рядка, придатне для заголовка :mailheader:`To` або :mailheader:`Cc` . Якщо перший елемент *pair* є false, то другий елемент повертається без змін.

source: Optional *charset* is the character set that will be used in the :rfc:`2047` encoding of the ``realname`` if the ``realname`` contains non-ASCII characters. Can be an instance of :class:`str` or a :class:`~email.charset.Charset`. Defaults to ``utf-8``.
uk: Необов’язковий *charset* — це набір символів, який використовуватиметься в :rfc:`2047` кодуванні ``realname``, якщо ``realname`` містить символи, відмінні від ASCII. Може бути екземпляром :class:`str` або :class:`~email.charset.Charset`. За замовчуванням ``utf-8``.

source: Added the *charset* option.
uk: Додано опцію *charset*.

source: Attempts to parse a date according to the rules in :rfc:`2822`. however, some mailers don't follow that format as specified, so :func:`parsedate` tries to guess correctly in such cases. *date* is a string containing an :rfc:`2822` date, such as ``"Mon, 20 Nov 1995 19:12:08 -0500"``. If it succeeds in parsing the date, :func:`parsedate` returns a 9-tuple that can be passed directly to :func:`time.mktime`; otherwise ``None`` will be returned. Note that indexes 6, 7, and 8 of the result tuple are not usable.
uk: Намагається проаналізувати дату відповідно до правил у :rfc:`2822`. однак деякі розсилки не дотримуються зазначеного формату, тому :func:`parsedate` намагається правильно вгадати в таких випадках. *date* — це рядок, що містить дату :rfc:`2822`, наприклад ``"Mon, 20 Nov 1995 19:12:08 -0500"``. Якщо вдасться проаналізувати дату, :func:`parsedate` повертає 9-кортеж, який можна передати безпосередньо до :func:`time.mktime`; інакше буде повернено ``None``. Зверніть увагу, що індекси 6, 7 і 8 кортежу результатів не можна використовувати.

source: Performs the same function as :func:`parsedate`, but returns either ``None`` or a 10-tuple; the first 9 elements make up a tuple that can be passed directly to :func:`time.mktime`, and the tenth is the offset of the date's timezone from UTC (which is the official term for Greenwich Mean Time) [#]_. If the input string has no timezone, the last element of the tuple returned is ``0``, which represents UTC. Note that indexes 6, 7, and 8 of the result tuple are not usable.
uk: Виконує ту саму функцію, що й :func:`parsedate`, але повертає або ``None``, або 10-кортеж; перші 9 елементів утворюють кортеж, який можна передати безпосередньо до :func:`time.mktime`, а десятий — це зсув часового поясу дати відносно UTC (офіційний термін для часу за Гринвічем) [#]_ . Якщо вхідний рядок не має часового поясу, останнім елементом кортежу, що повертається, є ``0``, який представляє UTC. Зверніть увагу, що індекси 6, 7 і 8 кортежу результатів не можна використовувати.

source: The inverse of :func:`format_datetime`. Performs the same function as :func:`parsedate`, but on success returns a :mod:`~datetime.datetime`; otherwise ``ValueError`` is raised if *date* contains an invalid value such as an hour greater than 23 or a timezone offset not between -24 and 24 hours. If the input date has a timezone of ``-0000``, the ``datetime`` will be a naive ``datetime``, and if the date is conforming to the RFCs it will represent a time in UTC but with no indication of the actual source timezone of the message the date comes from. If the input date has any other valid timezone offset, the ``datetime`` will be an aware ``datetime`` with the corresponding a :class:`~datetime.timezone` :class:`~datetime.tzinfo`.
uk: Інверсія :func:`format_datetime`. Виконує ту саму функцію, що й :func:`parsedate`, але в разі успіху повертає :mod:`~datetime.datetime`; інакше ``ValueError`` викликається, якщо *date* містить недійсне значення, таке як година більше 23 або зсув часового поясу не між -24 та 24 годинами. Якщо введена дата має часовий пояс ``-0000``, ``datetime`` буде простим ``datetime``, і якщо дата відповідає RFC, вона представлятиме час у UTC, але без вказівка фактичного часового поясу джерела повідомлення, з якого походить дата. Якщо введена дата має будь-яке інше дійсне зміщення часового поясу, ``datetime`` буде відомим ``datetime`` з відповідним :class:`~datetime.timezone` :class:`~datetime.tzinfo`.

source: Turn a 10-tuple as returned by :func:`parsedate_tz` into a UTC timestamp (seconds since the Epoch). If the timezone item in the tuple is ``None``, assume local time.
uk: Перетворіть 10-кортеж, який повертає :func:`parsedate_tz`, на мітку часу UTC (секунди з епохи). Якщо елемент часового поясу в кортежі ``None``, припустіть місцевий час.

source: Returns a date string as per :rfc:`2822`, e.g.::
uk: Повертає рядок дати згідно з :rfc:`2822`, наприклад::

source: Optional *localtime* is a flag that when ``True``, interprets *timeval*, and returns a date relative to the local timezone instead of UTC, properly taking daylight savings time into account. The default is ``False`` meaning UTC is used.
uk: Необов’язковий *місцевий час* — це прапорець, який, якщо значення ``True`` інтерпретує *timeval* і повертає дату відносно місцевого часового поясу замість UTC, правильно враховуючи літній час. Типовим значенням є ``False``, тобто використовується UTC.

source: Optional *usegmt* is a flag that when ``True``, outputs a date string with the timezone as an ascii string ``GMT``, rather than a numeric ``-0000``. This is needed for some protocols (such as HTTP). This only applies when *localtime* is ``False``. The default is ``False``.
uk: Необов’язковий *usegmt* — це прапорець, який, якщо значення "Істина" виводить рядок дати з часовим поясом як рядок ASCII "GMT", а не числове "-0000". Це потрібно для деяких протоколів (наприклад, HTTP). Це стосується лише випадків, коли *localtime* має значення ``False``. Типовим значенням є ``False``.

source: Like ``formatdate``, but the input is a :mod:`datetime` instance. If it is a naive datetime, it is assumed to be "UTC with no information about the source timezone", and the conventional ``-0000`` is used for the timezone. If it is an aware ``datetime``, then the numeric timezone offset is used. If it is an aware timezone with offset zero, then *usegmt* may be set to ``True``, in which case the string ``GMT`` is used instead of the numeric timezone offset. This provides a way to generate standards conformant HTTP date headers.
uk: Подібно до ``formatdate``, але введенням є екземпляр :mod:`datetime`. Якщо це наивна дата-час, передбачається, що це "UTC без інформації про вихідний часовий пояс", а для часового поясу використовується звичайний "-0000". Якщо це відомий ``datetime``, тоді використовується числове зміщення часового поясу. Якщо це відомий часовий пояс із нульовим зміщенням, тоді *usegmt* може бути встановлено на ``True``, у цьому випадку рядок ``GMT`` використовується замість числового зсуву часового поясу. Це надає спосіб генерувати заголовки дати HTTP, що відповідають стандартам.

source: Decode the string *s* according to :rfc:`2231`.
uk: Розшифруйте рядок *s* відповідно до :rfc:`2231`.

source: Encode the string *s* according to :rfc:`2231`. Optional *charset* and *language*, if given is the character set name and language name to use. If neither is given, *s* is returned as-is. If *charset* is given but *language* is not, the string is encoded using the empty string for *language*.
uk: Закодуйте рядок *s* відповідно до :rfc:`2231`. Необов’язкові *charset* і *language*, якщо вказано, це назва набору символів і назва мови для використання. Якщо жодного не вказано, *s* повертається як є. Якщо *charset* задано, але *language* ні, рядок кодується за допомогою порожнього рядка для *language*.

source: When a header parameter is encoded in :rfc:`2231` format, :meth:`Message.get_param <email.message.Message.get_param>` may return a 3-tuple containing the character set, language, and value. :func:`collapse_rfc2231_value` turns this into a unicode string. Optional *errors* is passed to the *errors* argument of :class:`str`'s :func:`~str.encode` method; it defaults to ``'replace'``. Optional *fallback_charset* specifies the character set to use if the one in the :rfc:`2231` header is not known by Python; it defaults to ``'us-ascii'``.
uk: Якщо параметр заголовка закодовано у форматі :rfc:`2231`, :meth:`Message.get_param <email.message.Message.get_param>` може повертати 3-кортеж, що містить набір символів, мову та значення. :func:`collapse_rfc2231_value` перетворює це на рядок Юнікод. Необов’язковий *errors* передається в аргумент *errors* методу :class:`str` :func:`~str.encode`; за замовчуванням ``'replace'``. Необов’язковий *fallback_charset* визначає набір символів для використання, якщо той, що міститься в заголовку :rfc:`2231`, не відомий Python; за замовчуванням ``'us-ascii'``.

source: For convenience, if the *value* passed to :func:`collapse_rfc2231_value` is not a tuple, it should be a string and it is returned unquoted.
uk: Для зручності, якщо *значення*, передане :func:`collapse_rfc2231_value`, не є кортежем, воно має бути рядком і повертається без лапок.

source: Decode parameters list according to :rfc:`2231`. *params* is a sequence of 2-tuples containing elements of the form ``(content-type, string-value)``.
uk: Розшифруйте список параметрів відповідно до :rfc:`2231`. *параметри* — це послідовність 2-кортежів, що містять елементи форми ``(тип вмісту, значення-рядка)``.

source: Footnotes
uk: Виноски

source: Note that the sign of the timezone offset is the opposite of the sign of the ``time.timezone`` variable for the same timezone; the latter variable follows the POSIX standard while this module follows :rfc:`2822`.
uk: Зауважте, що знак зміщення часового поясу протилежний знаку змінної ``time.timezone`` для того самого часового поясу; остання змінна відповідає стандарту POSIX, тоді як цей модуль відповідає :rfc:`2822`.
