Repository: python/python-docs-uk
Catalog: library/email_policy.po
Languages: uk

source: The email package calls this method with the *name* and *value* currently stored in the ``Message`` for a given header. The method should return a string that represents that header "folded" correctly (according to the policy settings) by composing the *name* with the *value* and inserting :attr:`linesep` characters at the appropriate places. See :rfc:`5322` for a discussion of the rules for folding email headers.
uk: Пакет електронної пошти викликає цей метод із *ім’ям* і *значенням*, які наразі зберігаються в ``Повідомленні`` для заданого заголовка. Метод має повернути рядок, який представляє цей заголовок, "згорнутий" правильно (відповідно до налаштувань політики), складаючи *ім’я* з *значенням* і вставляючи символи :attr:`linesep` у відповідних місцях. Перегляньте :rfc:`5322` для обговорення правил згортання заголовків електронних листів.

source: *value* may contain surrogateescaped binary data. There should be no surrogateescaped binary data in the string returned by the method.
uk: *значення* може містити сурогатні екрановані двійкові дані. У рядку, який повертає метод, не повинно бути сурогатних двійкових даних.

source: The same as :meth:`fold`, except that the returned value should be a bytes object rather than a string.
uk: Те саме, що :meth:`fold`, за винятком того, що повернуте значення має бути об’єктом bytes, а не рядком.

source: *value* may contain surrogateescaped binary data. These could be converted back into binary data in the returned bytes object.
uk: *значення* може містити сурогатні екрановані двійкові дані. Вони можуть бути перетворені назад у двійкові дані у повернутому об’єкті bytes.

source: This concrete :class:`Policy` provides behavior that is intended to be fully compliant with the current email RFCs. These include (but are not limited to) :rfc:`5322`, :rfc:`2047`, and the current MIME RFCs.
uk: Ця конкретна :class:`Policy` забезпечує поведінку, яка повністю відповідає поточним RFC електронної пошти. До них належать (але не обмежуються ними) :rfc:`5322`, :rfc:`2047` і поточні RFC MIME.

source: This policy adds new header parsing and folding algorithms. Instead of simple strings, headers are ``str`` subclasses with attributes that depend on the type of the field. The parsing and folding algorithm fully implement :rfc:`2047` and :rfc:`5322`.
uk: Ця політика додає нові алгоритми аналізу та згортання заголовків. Замість простих рядків, заголовки є підкласами ``str`` з атрибутами, які залежать від типу поля. Алгоритм аналізу та згортання повністю реалізує :rfc:`2047` і :rfc:`5322`.

source: The default value for the :attr:`~email.policy.Policy.message_factory` attribute is :class:`~email.message.EmailMessage`.
uk: Значенням за замовчуванням атрибута :attr:`~email.policy.Policy.message_factory` є :class:`~email.message.EmailMessage`.

source: In addition to the settable attributes listed above that apply to all policies, this policy adds the following additional attributes:
uk: На додаток до перерахованих вище настроюваних атрибутів, які застосовуються до всіх політик, ця політика додає такі додаткові атрибути:

source: If ``False``, follow :rfc:`5322`, supporting non-ASCII characters in headers by encoding them as "encoded words". If ``True``, follow :rfc:`6532` and use ``utf-8`` encoding for headers. Messages formatted in this way may be passed to SMTP servers that support the ``SMTPUTF8`` extension (:rfc:`6531`).
uk: Якщо ``False``, дотримуйтесь :rfc:`5322`, підтримуючи символи, відмінні від ASCII, у заголовках, кодуючи їх як "закодовані слова". Якщо ``True``, слідуйте :rfc:`6532` і використовуйте ``utf-8`` кодування для заголовків. Повідомлення, відформатовані таким чином, можуть передаватися на сервери SMTP, які підтримують розширення ``SMTPUTF8`` (:rfc:`6531`).

source: If the value for a header in the ``Message`` object originated from a :mod:`~email.parser` (as opposed to being set by a program), this attribute indicates whether or not a generator should refold that value when transforming the message back into serialized form. The possible values are:
uk: Якщо значення для заголовка в об’єкті ``Message`` походить від :mod:`~email.parser` (на відміну від встановлення програмою), цей атрибут вказує, чи повинен генератор повторно згортати це значення, коли перетворення повідомлення назад у серіалізовану форму. Можливі значення:

source: all source values use original folding
uk: усі вихідні значення використовують оригінальне згортання

source: ``long``
uk: ``довгий``

source: source values that have any line that is longer than ``max_line_length`` will be refolded
uk: вихідні значення, які мають будь-який рядок, довший за ``max_line_length``, будуть повторно згорнуті

source: ``all``
uk: ``все``

source: all values are refolded.
uk: усі значення перескладають.

source: The default is ``long``.
uk: Типовим є ``long``.

source: A callable that takes two arguments, ``name`` and ``value``, where ``name`` is a header field name and ``value`` is an unfolded header field value, and returns a string subclass that represents that header. A default ``header_factory`` (see :mod:`~email.headerregistry`) is provided that supports custom parsing for the various address and date :RFC:`5322` header field types, and the major MIME header field stypes. Support for additional custom parsing will be added in the future.
uk: Викликається, що приймає два аргументи, ``name`` і ``value``, де ``name`` — це ім’я поля заголовка, а ``value`` — це значення розгорнутого поля заголовка, і повертає підклас рядка, який представляє той заголовок. За замовчуванням надається ``header_factory`` (див. :mod:`~email.headerregistry`), який підтримує спеціальний аналіз для різних типів полів заголовків адреси та дати :RFC:`5322`, а також основних типів полів заголовків MIME. У майбутньому буде додано підтримку додаткового спеціального аналізу.

source: An object with at least two methods: get_content and set_content. When the :meth:`~email.message.EmailMessage.get_content` or :meth:`~email.message.EmailMessage.set_content` method of an :class:`~email.message.EmailMessage` object is called, it calls the corresponding method of this object, passing it the message object as its first argument, and any arguments or keywords that were passed to it as additional arguments. By default ``content_manager`` is set to :data:`~email.contentmanager.raw_data_manager`.
uk: Об’єкт із принаймні двома методами: get_content і set_content. Коли викликається метод :meth:`~email.message.EmailMessage.get_content` або :meth:`~email.message.EmailMessage.set_content` об’єкта :class:`~email.message.EmailMessage`, він викликає відповідний метод цього об’єкта, передаючи йому об’єкт повідомлення як його перший аргумент, а також будь-які аргументи або ключові слова, які були передані йому як додаткові аргументи. За умовчанням ``content_manager`` встановлено на :data:`~email.contentmanager.raw_data_manager`.

source: The class provides the following concrete implementations of the abstract methods of :class:`Policy`:
uk: Клас забезпечує такі конкретні реалізації абстрактних методів :class:`Policy`:

source: Returns the value of the :attr:`~email.headerregistry.BaseHeader.max_count` attribute of the specialized class used to represent the header with the given name.
uk: Повертає значення атрибута :attr:`~email.headerregistry.BaseHeader.max_count` спеціалізованого класу, який використовується для представлення заголовка з заданим іменем.

source: The name is parsed as everything up to the '``:``' and returned unmodified. The value is determined by stripping leading whitespace off the remainder of the first line, joining all subsequent lines together, and stripping any trailing carriage return or linefeed characters.
uk: Ім'я аналізується як усе, аж до "``:``", і повертається без змін. Значення визначається видаленням початкових пробілів із решти першого рядка, з’єднанням усіх наступних рядків разом і видаленням будь-яких завершальних символів повернення каретки або переводу рядка.

source: The name is returned unchanged. If the input value has a ``name`` attribute and it matches *name* ignoring case, the value is returned unchanged. Otherwise the *name* and *value* are passed to ``header_factory``, and the resulting header object is returned as the value. In this case a ``ValueError`` is raised if the input value contains CR or LF characters.
uk: Ім'я повертається без змін. Якщо вхідне значення має атрибут ``name`` і воно відповідає *name* без урахування регістру, значення повертається без змін. В іншому випадку *ім’я* та *значення* передаються до ``header_factory``, а отриманий об’єкт заголовка повертається як значення. У цьому випадку виникає ``ValueError``, якщо вхідне значення містить символи CR або LF.

source: If the value has a ``name`` attribute, it is returned to unmodified. Otherwise the *name*, and the *value* with any CR or LF characters removed, are passed to the ``header_factory``, and the resulting header object is returned. Any surrogateescaped bytes get turned into the unicode unknown-character glyph.
uk: Якщо значення має атрибут ``name``, воно повертається до незміненого. В іншому випадку *ім’я* та *значення* з видаленими будь-якими символами CR або LF передаються до ``header_factory``, і повертається отриманий об’єкт заголовка. Будь-які сурогатні екрановані байти перетворюються на гліф невідомих символів Unicode.

source: Header folding is controlled by the :attr:`refold_source` policy setting. A value is considered to be a 'source value' if and only if it does not have a ``name`` attribute (having a ``name`` attribute means it is a header object of some sort). If a source value needs to be refolded according to the policy, it is converted into a header object by passing the *name* and the *value* with any CR and LF characters removed to the ``header_factory``. Folding of a header object is done by calling its ``fold`` method with the current policy.
uk: Згортання заголовка контролюється параметром політики :attr:`refold_source`. Значення вважається "вихідним значенням" тоді і тільки тоді, коли воно не має атрибута ``name`` (наявність атрибута ``name`` означає, що це певний об’єкт заголовка). Якщо вихідне значення потрібно повторно згорнути відповідно до політики, воно перетворюється на об’єкт заголовка шляхом передачі *name* і *value* з будь-якими символами CR і LF, видаленими до ``header_factory``. Згортання об’єкта заголовка виконується викликом його методу ``fold`` із поточною політикою.

source: Source values are split into lines using :meth:`~str.splitlines`. If the value is not to be refolded, the lines are rejoined using the ``linesep`` from the policy and returned. The exception is lines containing non-ascii binary data. In that case the value is refolded regardless of the ``refold_source`` setting, which causes the binary data to be CTE encoded using the ``unknown-8bit`` charset.
uk: Вихідні значення розбиваються на рядки за допомогою :meth:`~str.splitlines`. Якщо значення не потрібно повторно згортати, рядки знову об’єднуються за допомогою ``linesep`` із політики та повертаються. Винятком є рядки, що містять двійкові дані, відмінні від ASCII. У цьому випадку значення повторно згортається незалежно від параметра ``refold_source``, що призводить до того, що двійкові дані кодуються CTE за допомогою набору символів ``unknown-8bit``.

source: The same as :meth:`fold` if :attr:`~Policy.cte_type` is ``7bit``, except that the returned value is bytes.
uk: Те саме, що :meth:`fold`, якщо :attr:`~Policy.cte_type` має значення ``7bit``, за винятком того, що повертається значення байтів.

source: If :attr:`~Policy.cte_type` is ``8bit``, non-ASCII binary data is converted back into bytes. Headers with binary data are not refolded, regardless of the ``refold_header`` setting, since there is no way to know whether the binary data consists of single byte characters or multibyte characters.
uk: Якщо :attr:`~Policy.cte_type` має значення ``8bit``, двійкові дані, відмінні від ASCII, перетворюються назад у байти. Заголовки з двійковими даними не згортаються повторно, незалежно від параметра ``refold_header``, оскільки немає способу дізнатися, чи двійкові дані складаються з однобайтових символів чи багатобайтових символів.

source: The following instances of :class:`EmailPolicy` provide defaults suitable for specific application domains. Note that in the future the behavior of these instances (in particular the ``HTTP`` instance) may be adjusted to conform even more closely to the RFCs relevant to their domains.
uk: Наступні екземпляри :class:`EmailPolicy` забезпечують значення за замовчуванням, придатні для певних доменів програм. Зауважте, що в майбутньому поведінка цих екземплярів (зокрема екземпляра ``HTTP``) може бути налаштована для ще більшої відповідності RFC, що стосуються їхніх доменів.

source: An instance of ``EmailPolicy`` with all defaults unchanged. This policy uses the standard Python ``\n`` line endings rather than the RFC-correct ``\r\n``.
uk: Екземпляр ``EmailPolicy`` з незмінними параметрами за замовчуванням. Ця політика використовує стандартні закінчення рядків Python ``\n`` замість правильного RFC ``\r\n``.

source: Suitable for serializing messages in conformance with the email RFCs. Like ``default``, but with ``linesep`` set to ``\r\n``, which is RFC compliant.
uk: Підходить для серіалізації повідомлень відповідно до RFC електронної пошти. Як ``default``, але ``linesep`` має значення ``\r\n``, що відповідає RFC.

source: The same as ``SMTP`` except that :attr:`~EmailPolicy.utf8` is ``True``. Useful for serializing messages to a message store without using encoded words in the headers. Should only be used for SMTP transmission if the sender or recipient addresses have non-ASCII characters (the :meth:`smtplib.SMTP.send_message` method handles this automatically).
uk: Те саме, що ``SMTP``, за винятком того, що :attr:`~EmailPolicy.utf8` має значення ``True``. Корисно для серіалізації повідомлень до сховища повідомлень без використання закодованих слів у заголовках. Слід використовувати лише для передачі SMTP, якщо адреси відправника чи одержувача містять символи, відмінні від ASCII (метод :meth:`smtplib.SMTP.send_message` обробляє це автоматично).

source: Suitable for serializing headers with for use in HTTP traffic. Like ``SMTP`` except that ``max_line_length`` is set to ``None`` (unlimited).
uk: Підходить для серіалізації заголовків для використання в трафіку HTTP. Подібно до ``SMTP``, за винятком того, що ``max_line_length`` встановлено на ``None`` (необмежено).

source: Convenience instance. The same as ``default`` except that ``raise_on_defect`` is set to ``True``. This allows any policy to be made strict by writing::
uk: Зручний екземпляр. Те саме, що ``default``, за винятком того, що ``raise_on_defect`` має значення ``True``. Це дозволяє зробити будь-яку політику суворою, написавши:

source: With all of these :class:`EmailPolicies <.EmailPolicy>`, the effective API of the email package is changed from the Python 3.2 API in the following ways:
uk: З усіма цими :class:`EmailPolicies <.EmailPolicy>` ефективний API пакета електронної пошти змінюється від API Python 3.2 у такий спосіб:

source: Setting a header on a :class:`~email.message.Message` results in that header being parsed and a header object created.
uk: Встановлення заголовка в :class:`~email.message.Message` призводить до аналізу цього заголовка та створення об’єкта заголовка.

source: Fetching a header value from a :class:`~email.message.Message` results in that header being parsed and a header object created and returned.
uk: Отримання значення заголовка з :class:`~email.message.Message` призводить до аналізу цього заголовка та створення та повернення об’єкта заголовка.

source: Any header object, or any header that is refolded due to the policy settings, is folded using an algorithm that fully implements the RFC folding algorithms, including knowing where encoded words are required and allowed.
uk: Будь-який об’єкт заголовка або будь-який заголовок, який повторно згортається через параметри політики, згортається за допомогою алгоритму, який повністю реалізує алгоритми згортання RFC, включаючи визначення того, де закодовані слова потрібні та дозволені.

source: From the application view, this means that any header obtained through the :class:`~email.message.EmailMessage` is a header object with extra attributes, whose string value is the fully decoded unicode value of the header. Likewise, a header may be assigned a new value, or a new header created, using a unicode string, and the policy will take care of converting the unicode string into the correct RFC encoded form.
uk: З точки зору програми це означає, що будь-який заголовок, отриманий через :class:`~email.message.EmailMessage`, є об’єктом заголовка з додатковими атрибутами, рядкове значення якого є повністю розшифрованим значенням заголовка в Unicode. Так само заголовку може бути призначено нове значення або створений новий заголовок за допомогою рядка Юнікод, і політика подбає про перетворення рядка Юнікод у правильну форму, закодовану RFC.

source: The header objects and their attributes are described in :mod:`~email.headerregistry`.
uk: Об’єкти заголовка та їхні атрибути описані в :mod:`~email.headerregistry`.

source: This concrete :class:`Policy` is the backward compatibility policy. It replicates the behavior of the email package in Python 3.2. The :mod:`~email.policy` module also defines an instance of this class, :const:`compat32`, that is used as the default policy. Thus the default behavior of the email package is to maintain compatibility with Python 3.2.
uk: Ця конкретна :class:`Policy` є політикою зворотної сумісності. Він повторює поведінку пакета електронної пошти в Python 3.2. Модуль :mod:`~email.policy` також визначає екземпляр цього класу, :const:`compat32`, який використовується як політика за замовчуванням. Таким чином, за замовчуванням пакет електронної пошти підтримує сумісність із Python 3.2.

source: The following attributes have values that are different from the :class:`Policy` default:
uk: Наступні атрибути мають значення, які відрізняються від стандартних :class:`Policy`:

source: The default is ``True``.
uk: Типовим значенням є ``True``.

source: The name and value are returned unmodified.
uk: Ім'я та значення повертаються без змін.

source: If the value contains binary data, it is converted into a :class:`~email.header.Header` object using the ``unknown-8bit`` charset. Otherwise it is returned unmodified.
uk: Якщо значення містить двійкові дані, воно перетворюється на об’єкт :class:`~email.header.Header` за допомогою кодування ``unknown-8bit``. В іншому випадку він повертається без змін.

source: Headers are folded using the :class:`~email.header.Header` folding algorithm, which preserves existing line breaks in the value, and wraps each resulting line to the ``max_line_length``. Non-ASCII binary data are CTE encoded using the ``unknown-8bit`` charset.
uk: Заголовки згортаються за допомогою алгоритму згортання :class:`~email.header.Header`, який зберігає наявні розриви рядків у значенні та обертає кожен отриманий рядок до ``max_line_length``. Двійкові дані, відмінні від ASCII, кодуються CTE за допомогою набору символів ``unknown-8bit``.

source: Headers are folded using the :class:`~email.header.Header` folding algorithm, which preserves existing line breaks in the value, and wraps each resulting line to the ``max_line_length``. If ``cte_type`` is ``7bit``, non-ascii binary data is CTE encoded using the ``unknown-8bit`` charset. Otherwise the original source header is used, with its existing line breaks and any (RFC invalid) binary data it may contain.
uk: Заголовки згортаються за допомогою алгоритму згортання :class:`~email.header.Header`, який зберігає наявні розриви рядків у значенні та обертає кожен отриманий рядок до ``max_line_length``. Якщо ``cte_type`` дорівнює ``7bit``, двійкові дані, що не є ascii, кодуються CTE з використанням набору символів ``unknown-8bit``. В іншому випадку використовується вихідний вихідний заголовок із наявними розривами рядків і будь-якими (недійсними RFC) двійковими даними, які він може містити.

source: An instance of :class:`Compat32`, providing backward compatibility with the behavior of the email package in Python 3.2.
uk: Екземпляр :class:`Compat32`, що забезпечує зворотну сумісність із поведінкою пакета електронної пошти в Python 3.2.

source: Footnotes
uk: Виноски

source: Originally added in 3.3 as a :term:`provisional feature <provisional package>`.
uk: Спочатку додано в 3.3 як :term:`попередню функцію <provisional package>`.
