Repository: python/python-docs-uk
Catalog: library/email_mime.po
Languages: uk

source: **Source code:** :source:`Lib/email/mime/`
uk: **Вихідний код:** :source:`Lib/email/mime/`

source: This module is part of the legacy (``Compat32``) email API. Its functionality is partially replaced by the :mod:`~email.contentmanager` in the new API, but in certain applications these classes may still be useful, even in non-legacy code.
uk: Цей модуль є частиною застарілого (``Compat32``) API електронної пошти. Його функціональні можливості частково замінено на :mod:`~email.contentmanager` у новому API, але в деяких програмах ці класи все ще можуть бути корисними, навіть у коді, що не є застарілим.

source: Ordinarily, you get a message object structure by passing a file or some text to a parser, which parses the text and returns the root message object. However you can also build a complete message structure from scratch, or even individual :class:`~email.message.Message` objects by hand. In fact, you can also take an existing structure and add new :class:`~email.message.Message` objects, move them around, etc. This makes a very convenient interface for slicing-and-dicing MIME messages.
uk: Зазвичай ви отримуєте структуру об’єкта повідомлення, передаючи файл або деякий текст синтаксичному аналізатору, який аналізує текст і повертає кореневий об’єкт повідомлення. Однак ви також можете створити повну структуру повідомлення з нуля або навіть окремі об’єкти :class:`~email.message.Message` вручну. Фактично, ви також можете взяти існуючу структуру та додати нові об’єкти :class:`~email.message.Message`, перемістити їх тощо. Це робить дуже зручний інтерфейс для нарізання та нарізання повідомлень MIME.

source: You can create a new object structure by creating :class:`~email.message.Message` instances, adding attachments and all the appropriate headers manually. For MIME messages though, the :mod:`email` package provides some convenient subclasses to make things easier.
uk: Ви можете створити нову структуру об’єктів, створивши екземпляри :class:`~email.message.Message`, додавши вкладення та всі відповідні заголовки вручну. Однак для повідомлень MIME пакет :mod:`email` надає кілька зручних підкласів, щоб полегшити роботу.

source: Here are the classes:
uk: Ось класи:

source: Module: :mod:`email.mime.base`
uk: Модуль: :mod:`email.mime.base`

source: This is the base class for all the MIME-specific subclasses of :class:`~email.message.Message`. Ordinarily you won't create instances specifically of :class:`MIMEBase`, although you could. :class:`MIMEBase` is provided primarily as a convenient base class for more specific MIME-aware subclasses.
uk: Це базовий клас для всіх специфічних для MIME підкласів :class:`~email.message.Message`. Зазвичай ви не будете створювати екземпляри конкретно :class:`MIMEBase`, хоча можете. :class:`MIMEBase` надається в основному як зручний базовий клас для більш конкретних підкласів, що підтримують MIME.

source: *_maintype* is the :mailheader:`Content-Type` major type (e.g. :mimetype:`text` or :mimetype:`image`), and *_subtype* is the :mailheader:`Content-Type` minor type (e.g. :mimetype:`plain` or :mimetype:`gif`). *_params* is a parameter key/value dictionary and is passed directly to :meth:`Message.add_header <email.message.Message.add_header>`.
uk: *_maintype* — це основний тип :mailheader:`Content-Type` (наприклад, :mimetype:`text` або :mimetype:`image`), а *_subtype* — другорядний тип :mailheader:`Content-Type` (напр. :mimetype:`plain` або :mimetype:`gif`). *_params* — це словник ключ/значення параметра, який передається безпосередньо до :meth:`Message.add_header <email.message.Message.add_header>`.

source: If *policy* is specified, (defaults to the :class:`compat32 <email.policy.Compat32>` policy) it will be passed to :class:`~email.message.Message`.
uk: Якщо вказано *політику* (за замовчуванням політика :class:`compat32 <email.policy.Compat32>`), вона буде передана в :class:`~email.message.Message`.

source: The :class:`MIMEBase` class always adds a :mailheader:`Content-Type` header (based on *_maintype*, *_subtype*, and *_params*), and a :mailheader:`MIME-Version` header (always set to ``1.0``).
uk: Клас :class:`MIMEBase` завжди додає заголовок :mailheader:`Content-Type` (на основі *_maintype*, *_subtype* і *_params*) і заголовок :mailheader:`MIME-Version` (завжди встановити значення ``1.0``).

source: Added *policy* keyword-only parameter.
uk: Додано параметр *policy* лише для ключового слова.

source: Module: :mod:`email.mime.nonmultipart`
uk: Модуль: :mod:`email.mime.nonmultipart`

source: A subclass of :class:`~email.mime.base.MIMEBase`, this is an intermediate base class for MIME messages that are not :mimetype:`multipart`. The primary purpose of this class is to prevent the use of the :meth:`~email.message.Message.attach` method, which only makes sense for :mimetype:`multipart` messages. If :meth:`~email.message.Message.attach` is called, a :exc:`~email.errors.MultipartConversionError` exception is raised.
uk: Підклас :class:`~email.mime.base.MIMEBase`, це проміжний базовий клас для повідомлень MIME, які не є :mimetype:`multipart`. Основною метою цього класу є запобігання використанню методу :meth:`~email.message.Message.attach`, який має сенс лише для повідомлень :mimetype:`multipart`. Якщо викликається :meth:`~email.message.Message.attach`, виникає виняток :exc:`~email.errors.MultipartConversionError`.

source: Module: :mod:`email.mime.multipart`
uk: Модуль: :mod:`email.mime.multipart`

source: A subclass of :class:`~email.mime.base.MIMEBase`, this is an intermediate base class for MIME messages that are :mimetype:`multipart`. Optional *_subtype* defaults to :mimetype:`mixed`, but can be used to specify the subtype of the message. A :mailheader:`Content-Type` header of :mimetype:`multipart/_subtype` will be added to the message object. A :mailheader:`MIME-Version` header will also be added.
uk: Підклас :class:`~email.mime.base.MIMEBase`, це проміжний базовий клас для повідомлень MIME, які є :mimetype:`multipart`. Необов’язковий *_subtype* за умовчанням має значення :mimetype:`mixed`, але його можна використовувати для визначення підтипу повідомлення. Заголовок :mailheader:`Content-Type` :mimetype:`multipart/_subtype` буде додано до об’єкта повідомлення. Також буде додано заголовок :mailheader:`MIME-Version`.

source: Optional *boundary* is the multipart boundary string. When ``None`` (the default), the boundary is calculated when needed (for example, when the message is serialized).
uk: Необов’язковий *межа* — це обмежувальний рядок із кількох частин. Якщо ``None`` (за замовчуванням), межа обчислюється за потреби (наприклад, коли повідомлення серіалізовано).

source: *_subparts* is a sequence of initial subparts for the payload. It must be possible to convert this sequence to a list. You can always attach new subparts to the message by using the :meth:`Message.attach <email.message.Message.attach>` method.
uk: *_subparts* — це послідовність початкових підчастин для корисного навантаження. Має бути можливість перетворити цю послідовність на список. Ви завжди можете додати нові частини до повідомлення за допомогою методу :meth:`Message.attach <email.message.Message.attach>`.

source: Optional *policy* argument defaults to :class:`compat32 <email.policy.Compat32>`.
uk: Додатковий аргумент *policy* за умовчанням має значення :class:`compat32 <email.policy.Compat32>`.

source: Additional parameters for the :mailheader:`Content-Type` header are taken from the keyword arguments, or passed into the *_params* argument, which is a keyword dictionary.
uk: Додаткові параметри для заголовка :mailheader:`Content-Type` беруться з аргументів ключових слів або передаються в аргумент *_params*, який є словником ключових слів.

source: Module: :mod:`email.mime.application`
uk: Модуль: :mod:`email.mime.application`

source: Optional *_encoder* is a callable (i.e. function) which will perform the actual encoding of the data for transport. This callable takes one argument, which is the :class:`MIMEApplication` instance. It should use :meth:`~email.message.Message.get_payload` and :meth:`~email.message.Message.set_payload` to change the payload to encoded form. It should also add any :mailheader:`Content-Transfer-Encoding` or other headers to the message object as necessary. The default encoding is base64. See the :mod:`email.encoders` module for a list of the built-in encoders.
uk: Необов’язковий *_encoder* — це виклик (тобто функція), яка виконуватиме фактичне кодування даних для транспортування. Цей виклик приймає один аргумент, який є екземпляром :class:`MIMEApplication`. Він має використовувати :meth:`~email.message.Message.get_payload` і :meth:`~email.message.Message.set_payload`, щоб змінити корисне навантаження на закодовану форму. Він також має додати будь-які :mailheader:`Content-Transfer-Encoding` або інші заголовки до об’єкта повідомлення за потреби. Стандартне кодування — base64. Перегляньте список вбудованих кодувальників у модулі :mod:`email.encoders`.

source: *_params* are passed straight through to the base class constructor.
uk: *_params* передаються прямо до конструктора базового класу.

source: Module: :mod:`email.mime.audio`
uk: Модуль: :mod:`email.mime.audio`

source: Optional *_encoder* is a callable (i.e. function) which will perform the actual encoding of the audio data for transport. This callable takes one argument, which is the :class:`MIMEAudio` instance. It should use :meth:`~email.message.Message.get_payload` and :meth:`~email.message.Message.set_payload` to change the payload to encoded form. It should also add any :mailheader:`Content-Transfer-Encoding` or other headers to the message object as necessary. The default encoding is base64. See the :mod:`email.encoders` module for a list of the built-in encoders.
uk: Необов’язковий *_encoder* — це виклик (тобто функція), яка виконуватиме фактичне кодування аудіоданих для транспортування. Цей виклик приймає один аргумент, який є екземпляром :class:`MIMEAudio`. Він має використовувати :meth:`~email.message.Message.get_payload` і :meth:`~email.message.Message.set_payload`, щоб змінити корисне навантаження на закодовану форму. Він також має додати будь-які :mailheader:`Content-Transfer-Encoding` або інші заголовки до об’єкта повідомлення за потреби. Стандартне кодування — base64. Перегляньте список вбудованих кодувальників у модулі :mod:`email.encoders`.

source: Module: :mod:`email.mime.image`
uk: Модуль: :mod:`email.mime.image`

source: Optional *_encoder* is a callable (i.e. function) which will perform the actual encoding of the image data for transport. This callable takes one argument, which is the :class:`MIMEImage` instance. It should use :meth:`~email.message.Message.get_payload` and :meth:`~email.message.Message.set_payload` to change the payload to encoded form. It should also add any :mailheader:`Content-Transfer-Encoding` or other headers to the message object as necessary. The default encoding is base64. See the :mod:`email.encoders` module for a list of the built-in encoders.
uk: Необов’язковий *_encoder* — це виклик (тобто функція), яка виконуватиме фактичне кодування даних зображення для транспортування. Цей виклик приймає один аргумент, який є екземпляром :class:`MIMEImage`. Він має використовувати :meth:`~email.message.Message.get_payload` і :meth:`~email.message.Message.set_payload`, щоб змінити корисне навантаження на закодовану форму. Він також має додати будь-які :mailheader:`Content-Transfer-Encoding` або інші заголовки до об’єкта повідомлення за потреби. Стандартне кодування — base64. Перегляньте список вбудованих кодувальників у модулі :mod:`email.encoders`.

source: *_params* are passed straight through to the :class:`~email.mime.base.MIMEBase` constructor.
uk: *_параметри* передаються безпосередньо до конструктора :class:`~email.mime.base.MIMEBase`.

source: Module: :mod:`email.mime.message`
uk: Модуль: :mod:`email.mime.message`

source: A subclass of :class:`~email.mime.nonmultipart.MIMENonMultipart`, the :class:`MIMEMessage` class is used to create MIME objects of main type :mimetype:`message`. *_msg* is used as the payload, and must be an instance of class :class:`~email.message.Message` (or a subclass thereof), otherwise a :exc:`TypeError` is raised.
uk: Підклас :class:`~email.mime.nonmultipart.MIMENonMultipart`, клас :class:`MIMEMessage` використовується для створення об’єктів MIME основного типу :mimetype:`message`. *_msg* використовується як корисне навантаження та має бути екземпляром класу :class:`~email.message.Message` (або його підкласу), інакше виникає :exc:`TypeError`.

source: Optional *_subtype* sets the subtype of the message; it defaults to :mimetype:`rfc822`.
uk: Додатково *_subtype* встановлює підтип повідомлення; за замовчуванням :mimetype:`rfc822`.

source: Module: :mod:`email.mime.text`
uk: Модуль: :mod:`email.mime.text`

source: A subclass of :class:`~email.mime.nonmultipart.MIMENonMultipart`, the :class:`MIMEText` class is used to create MIME objects of major type :mimetype:`text`. *_text* is the string for the payload. *_subtype* is the minor type and defaults to :mimetype:`plain`. *_charset* is the character set of the text and is passed as an argument to the :class:`~email.mime.nonmultipart.MIMENonMultipart` constructor; it defaults to ``us-ascii`` if the string contains only ``ascii`` code points, and ``utf-8`` otherwise. The *_charset* parameter accepts either a string or a :class:`~email.charset.Charset` instance.
uk: Підклас :class:`~email.mime.nonmultipart.MIMENonMultipart`, клас :class:`MIMEText` використовується для створення об’єктів MIME основного типу :mimetype:`text`. *_text* — це рядок корисного навантаження. *_subtype* є другорядним типом і за замовчуванням :mimetype:`plain`. *_charset* — це набір символів тексту, який передається як аргумент конструктору :class:`~email.mime.nonmultipart.MIMENonMultipart`; за замовчуванням встановлено ``us-ascii``, якщо рядок містить лише ``ascii`` кодові точки, і ``utf-8`` інакше. Параметр *_charset* приймає або рядок, або екземпляр :class:`~email.charset.Charset`.

source: Unless the *_charset* argument is explicitly set to ``None``, the MIMEText object created will have both a :mailheader:`Content-Type` header with a ``charset`` parameter, and a :mailheader:`Content-Transfer-Encoding` header. This means that a subsequent ``set_payload`` call will not result in an encoded payload, even if a charset is passed in the ``set_payload`` command. You can "reset" this behavior by deleting the ``Content-Transfer-Encoding`` header, after which a ``set_payload`` call will automatically encode the new payload (and add a new :mailheader:`Content-Transfer-Encoding` header).
uk: Якщо для аргументу *_charset* явно не встановлено значення ``None``, створений об’єкт MIMEText матиме як заголовок :mailheader:`Content-Type` з параметром ``charset``, так і Заголовок :mailheader:`Content-Transfer-Encoding`. Це означає, що наступний виклик ``set_payload`` не призведе до закодованого корисного навантаження, навіть якщо кодування передано в команді ``set_payload``. Ви можете "скинути" цю поведінку, видаливши заголовок ``Content-Transfer-Encoding``, після чого виклик ``set_payload`` автоматично закодує нове корисне навантаження (і додасть нове :mailheader:`Content-Transfer-Encoding` заголовок).

source: *_charset* also accepts :class:`~email.charset.Charset` instances.
uk: *_charset* також приймає екземпляри :class:`~email.charset.Charset`.
