Repository: python/python-docs-uk
Catalog: library/ensurepip.po
Languages: uk

source: The :mod:`ensurepip` package provides support for bootstrapping the ``pip`` installer into an existing Python installation or virtual environment. This bootstrapping approach reflects the fact that ``pip`` is an independent project with its own release cycle, and the latest available stable version is bundled with maintenance and feature releases of the CPython reference interpreter.
uk: Пакет :mod:`ensurepip` забезпечує підтримку початкового завантаження інсталятора ``pip`` в існуючу установку Python або віртуальне середовище. Цей підхід до початкового завантаження відображає той факт, що ``pip`` є незалежним проектом із власним циклом випуску, а остання доступна стабільна версія входить до комплекту технічного обслуговування та функціональних випусків довідкового інтерпретатора CPython.

source: In most cases, end users of Python shouldn't need to invoke this module directly (as ``pip`` should be bootstrapped by default), but it may be needed if installing ``pip`` was skipped when installing Python (or when creating a virtual environment) or after explicitly uninstalling ``pip``.
uk: У більшості випадків кінцевим користувачам Python не потрібно викликати цей модуль напряму (оскільки ``pip`` має завантажуватися за замовчуванням), але це може знадобитися, якщо під час встановлення Python було пропущено встановлення ``pip`` (або під час створення віртуального середовища) або після явного видалення ``pip``.

source: This module *does not* access the internet. All of the components needed to bootstrap ``pip`` are included as internal parts of the package.
uk: Цей модуль *не* має доступ до Інтернету. Усі компоненти, необхідні для завантаження ``pip``, включені як внутрішні частини пакунка.

source: :ref:`installing-index`
uk: :ref:`інсталяційний індекс <installing-index>`

source: The end user guide for installing Python packages
uk: Посібник кінцевого користувача для встановлення пакетів Python

source: :pep:`453`: Explicit bootstrapping of pip in Python installations
uk: :pep:`453`: Явне початкове завантаження pip у встановленнях Python

source: The original rationale and specification for this module.
uk: Оригінальне обґрунтування та специфікація цього модуля.

source: Command line interface
uk: Інтерфейс командного рядка

source: The command line interface is invoked using the interpreter's ``-m`` switch.
uk: Інтерфейс командного рядка викликається за допомогою перемикача ``-m`` інтерпретатора.

source: The simplest possible invocation is::
uk: Найпростіший можливий виклик:

source: This invocation will install ``pip`` if it is not already installed, but otherwise does nothing. To ensure the installed version of ``pip`` is at least as recent as the one available in ``ensurepip``, pass the ``--upgrade`` option::
uk: Цей виклик встановить ``pip``, якщо він ще не встановлено, але в інших випадках нічого не робить. Щоб переконатися, що встановлена версія ``pip`` принаймні така ж остання, як та, доступна в ``ensurepip``, передайте опцію ``--upgrade``::

source: By default, ``pip`` is installed into the current virtual environment (if one is active) or into the system site packages (if there is no active virtual environment). The installation location can be controlled through two additional command line options:
uk: За замовчуванням ``pip`` інсталюється в поточне віртуальне середовище (якщо воно активне) або в системні пакети сайту (якщо активного віртуального середовища немає). Розташуванням встановлення можна керувати за допомогою двох додаткових параметрів командного рядка:

source: ``--user``: Installs ``pip`` into the user site packages directory rather than globally for the current Python installation (this option is not permitted inside an active virtual environment).
uk: ``--user``: встановлює ``pip`` у каталог пакетів сайту користувача, а не глобально для поточної інсталяції Python (ця опція не дозволена в активному віртуальному середовищі).

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the version of Python used to invoke ``ensurepip``). The scripts installed can be controlled through two additional command line options:
uk: За замовчуванням буде встановлено сценарії ``pipX`` і ``pipX.Y`` (де X.Y означає версію Python, яка використовується для виклику ``ensurepip``). Установленими сценаріями можна керувати за допомогою двох додаткових параметрів командного рядка:

source: ``--altinstall``: if an alternate installation is requested, the ``pipX`` script will *not* be installed.
uk: ``--altinstall``: якщо запитується альтернативне встановлення, сценарій ``pipX`` *не* буде встановлено.

source: ``--default-pip``: if a "default pip" installation is requested, the ``pip`` script will be installed in addition to the two regular scripts.
uk: ``--default-pip``: якщо запитується встановлення "pip за замовчуванням", сценарій ``pip`` буде встановлено на додаток до двох звичайних сценаріїв.

source: Providing both of the script selection options will trigger an exception.
uk: Надання обох параметрів вибору сценарію призведе до виключення.

source: Module API
uk: Модуль API

source: :mod:`ensurepip` exposes two functions for programmatic use:
uk: :mod:`ensurepip` надає дві функції для програмного використання:

source: Returns a string specifying the available version of pip that will be installed when bootstrapping an environment.
uk: Повертає рядок із зазначенням доступної версії pip, яка буде встановлена під час завантаження середовища.

source: Bootstraps ``pip`` into the current or designated environment.
uk: Bootstraps ``pip`` в поточне або призначене середовище.

source: *root* specifies an alternative root directory to install relative to. If *root* is ``None``, then installation uses the default install location for the current environment.
uk: *root* вказує альтернативний кореневий каталог для встановлення. Якщо *root* має значення ``None``, тоді для встановлення використовується місце встановлення за замовчуванням для поточного середовища.

source: *upgrade* indicates whether or not to upgrade an existing installation of an earlier version of ``pip`` to the available version.
uk: *upgrade* вказує, чи потрібно оновлювати наявну інсталяцію попередньої версії ``pip`` до доступної версії.

source: *user* indicates whether to use the user scheme rather than installing globally.
uk: *user* вказує, чи слід використовувати схему користувача, а не глобальне встановлення.

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the current version of Python).
uk: За замовчуванням буде встановлено сценарії ``pipX`` і ``pipX.Y`` (де X.Y означає поточну версію Python).

source: If *altinstall* is set, then ``pipX`` will *not* be installed.
uk: Якщо встановлено *altinstall*, то ``pipX`` *не* буде встановлено.

source: If *default_pip* is set, then ``pip`` will be installed in addition to the two regular scripts.
uk: Якщо встановлено *default_pip*, то ``pip`` буде встановлено на додаток до двох звичайних сценаріїв.

source: Setting both *altinstall* and *default_pip* will trigger :exc:`ValueError`.
uk: Налаштування як *altinstall*, так і *default_pip* спричинить :exc:`ValueError`.

source: *verbosity* controls the level of output to :data:`sys.stdout` from the bootstrapping operation.
uk: *detality* контролює рівень виведення в :data:`sys.stdout` від операції початкового завантаження.

source: Raises an :ref:`auditing event <auditing>` ``ensurepip.bootstrap`` with argument ``root``.
uk: Викликає :ref:`подію аудиту <auditing>` ``ensurepip.bootstrap`` з аргументом ``root``.

source: The bootstrapping process has side effects on both ``sys.path`` and ``os.environ``. Invoking the command line interface in a subprocess instead allows these side effects to be avoided.
uk: Процес початкового завантаження має побічні ефекти як для ``sys.path``, так і ``os.environ``. Натомість виклик інтерфейсу командного рядка в підпроцесі дозволяє уникнути цих побічних ефектів.

source: The bootstrapping process may install additional modules required by ``pip``, but other software should not assume those dependencies will always be present by default (as the dependencies may be removed in a future version of ``pip``).
uk: Процес завантаження може встановити додаткові модулі, необхідні для ``pip``, але інше програмне забезпечення не повинно припускати, що ці залежності завжди будуть присутні за замовчуванням (оскільки залежності можуть бути видалені в майбутній версії ``pip``).
