Repository: python/python-docs-uk
Catalog: library/faulthandler.po
Languages: uk

source: :mod:`faulthandler` --- Dump the Python traceback
uk: :mod:`faulthandler` --- Дамп зворотного відстеження Python

source: This module contains functions to dump Python tracebacks explicitly, on a fault, after a timeout, or on a user signal. Call :func:`faulthandler.enable` to install fault handlers for the :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS`, and :const:`SIGILL` signals. You can also enable them at startup by setting the :envvar:`PYTHONFAULTHANDLER` environment variable or by using the :option:`-X` ``faulthandler`` command line option.
uk: Цей модуль містить функції для явного створення дампу трасування Python у разі помилки, після тайм-ауту або за сигналом користувача. Викличте :func:`faulthandler.enable`, щоб установити обробники помилок для :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` і :const:`SIGILL` сигнали. Ви також можете ввімкнути їх під час запуску, встановивши змінну середовища :envvar:`PYTHONFAULTHANDLER` або використовуючи параметр командного рядка :option:`-X` ``faulthandler``.

source: The fault handler is compatible with system fault handlers like Apport or the Windows fault handler. The module uses an alternative stack for signal handlers if the :c:func:`sigaltstack` function is available. This allows it to dump the traceback even on a stack overflow.
uk: Обробник помилок сумісний із системними обробниками помилок, такими як Apport або Windows. Модуль використовує альтернативний стек для обробників сигналів, якщо доступна функція :c:func:`sigaltstack`. Це дозволяє створювати зворотне трасування навіть при переповненні стека.

source: The fault handler is called on catastrophic cases and therefore can only use signal-safe functions (e.g. it cannot allocate memory on the heap). Because of this limitation traceback dumping is minimal compared to normal Python tracebacks:
uk: Обробник помилок викликається в катастрофічних випадках і тому може використовувати лише безпечні для сигналу функції (наприклад, він не може виділяти пам’ять у купі). Через це обмеження дамп зворотного відстеження мінімальний порівняно зі звичайним відстеженням Python:

source: Only ASCII is supported. The ``backslashreplace`` error handler is used on encoding.
uk: Підтримується лише ASCII. Під час кодування використовується обробник помилок ``backslashreplace``.

source: Each string is limited to 500 characters.
uk: Довжина кожного рядка обмежена 500 символами.

source: Only the filename, the function name and the line number are displayed. (no source code)
uk: Відображаються лише назва файлу, назва функції та номер рядка. (без вихідного коду)

source: It is limited to 100 frames and 100 threads.
uk: Він обмежений 100 кадрами та 100 потоками.

source: The order is reversed: the most recent call is shown first.
uk: Порядок зворотний: останній виклик відображається першим.

source: By default, the Python traceback is written to :data:`sys.stderr`. To see tracebacks, applications must be run in the terminal. A log file can alternatively be passed to :func:`faulthandler.enable`.
uk: За замовчуванням відстеження Python записується в :data:`sys.stderr`. Щоб побачити відстеження, програми мають бути запущені в терміналі. Файл журналу також можна передати до :func:`faulthandler.enable`.

source: The module is implemented in C, so tracebacks can be dumped on a crash or when Python is deadlocked.
uk: Модуль реалізовано на C, тому трасування можна скинути під час збою або коли Python заблоковано.

source: The :ref:`Python Development Mode <devmode>` calls :func:`faulthandler.enable` at Python startup.
uk: :ref:`Режим розробки Python <devmode>` викликає :func:`faulthandler.enable` під час запуску Python.

source: Dumping the traceback
uk: Викидання трасування

source: Dump the tracebacks of all threads into *file*. If *all_threads* is ``False``, dump only the current thread.
uk: Дамп трасування всіх потоків у *файл*. Якщо *all_threads* має значення ``False``, створювати дамп лише поточного потоку.

source: Added support for passing file descriptor to this function.
uk: Додано підтримку для передачі дескриптора файлу в цю функцію.

source: Fault handler state
uk: Стан обробника помилок

source: Enable the fault handler: install handlers for the :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` and :const:`SIGILL` signals to dump the Python traceback. If *all_threads* is ``True``, produce tracebacks for every running thread. Otherwise, dump only the current thread.
uk: Увімкніть обробник помилок: встановіть обробники для сигналів :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` і :const:`SIGILL`, щоб зробити дамп зворотного відстеження Python. Якщо *all_threads* має значення ``True``, виробляти трасування для кожного запущеного потоку. В іншому випадку створіть дамп лише поточного потоку.

source: The *file* must be kept open until the fault handler is disabled: see :ref:`issue with file descriptors <faulthandler-fd>`.
uk: *Файл* має бути відкритим, доки обробник помилок не буде вимкнено: див. :ref:`проблему з дескрипторами файлів <faulthandler-fd>`.

source: On Windows, a handler for Windows exception is also installed.
uk: У Windows також встановлено обробник винятків Windows.

source: The dump now mentions if a garbage collector collection is running if *all_threads* is true.
uk: Дамп тепер згадує, чи запущено збирач сміття, якщо *all_threads* має значення true.

source: Disable the fault handler: uninstall the signal handlers installed by :func:`enable`.
uk: Вимкніть обробник помилок: видаліть обробники сигналів, встановлені :func:`enable`.

source: Check if the fault handler is enabled.
uk: Перевірте, чи ввімкнено обробник помилок.

source: Dumping the tracebacks after a timeout
uk: Викидання трасування після тайм-ауту

source: Dump the tracebacks of all threads, after a timeout of *timeout* seconds, or every *timeout* seconds if *repeat* is ``True``. If *exit* is ``True``, call :c:func:`_exit` with status=1 after dumping the tracebacks. (Note :c:func:`_exit` exits the process immediately, which means it doesn't do any cleanup like flushing file buffers.) If the function is called twice, the new call replaces previous parameters and resets the timeout. The timer has a sub-second resolution.
uk: Створювати дамп відстеження всіх потоків після тайм-ауту *timeout* секунд або кожні *timeout* секунд, якщо *repeat* має значення ``True``. Якщо *exit* має значення ``True``, викличте :c:func:`_exit` зі статусом=1 після створення дампу трасування. (Примітка: :c:func:`_exit` негайно виходить із процесу, що означає, що він не виконує жодного очищення, наприклад очищення буферів файлів.) Якщо функція викликається двічі, новий виклик замінює попередні параметри та скидає час очікування. Таймер має роздільну здатність до секунди.

source: The *file* must be kept open until the traceback is dumped or :func:`cancel_dump_traceback_later` is called: see :ref:`issue with file descriptors <faulthandler-fd>`.
uk: *Файл* має залишатися відкритим, доки не буде створено дамп трасування або :func:`cancel_dump_traceback_later`: див. :ref:`проблему з дескрипторами файлів <faulthandler-fd>`.

source: This function is implemented using a watchdog thread.
uk: Ця функція реалізована за допомогою сторожового потоку.

source: This function is now always available.
uk: Тепер ця функція доступна завжди.

source: Cancel the last call to :func:`dump_traceback_later`.
uk: Скасувати останній виклик :func:`dump_traceback_later`.

source: Dumping the traceback on a user signal
uk: Скидання зворотного відстеження за сигналом користувача

source: Register a user signal: install a handler for the *signum* signal to dump the traceback of all threads, or of the current thread if *all_threads* is ``False``, into *file*. Call the previous handler if chain is ``True``.
uk: Зареєструйте сигнал користувача: встановіть обробник для сигналу *signum*, щоб скинути зворотне трасування всіх потоків або поточного потоку, якщо *all_threads* має значення ``False``, у *файл*. Викликати попередній обробник, якщо ланцюжок має значення ``True``.

source: The *file* must be kept open until the signal is unregistered by :func:`unregister`: see :ref:`issue with file descriptors <faulthandler-fd>`.
uk: *Файл* має залишатися відкритим, доки сигнал не буде скасовано :func:`unregister`: див. :ref:`проблему з дескрипторами файлів <faulthandler-fd>`.

source: Not available on Windows.
uk: Недоступно в Windows.

source: Unregister a user signal: uninstall the handler of the *signum* signal installed by :func:`register`. Return ``True`` if the signal was registered, ``False`` otherwise.
uk: Скасувати реєстрацію сигналу користувача: видалити обробник сигналу *signum*, встановлений :func:`register`. Повертає ``True``, якщо сигнал був зареєстрований, ``False`` інакше.

source: Issue with file descriptors
uk: Проблема з дескрипторами файлів

source: :func:`enable`, :func:`dump_traceback_later` and :func:`register` keep the file descriptor of their *file* argument. If the file is closed and its file descriptor is reused by a new file, or if :func:`os.dup2` is used to replace the file descriptor, the traceback will be written into a different file. Call these functions again each time that the file is replaced.
uk: :func:`enable`, :func:`dump_traceback_later` і :func:`register` зберігають файловий дескриптор свого аргументу *file*. Якщо файл закрито і його файловий дескриптор повторно використовується в новому файлі, або якщо :func:`os.dup2` використовується для заміни файлового дескриптора, трасування буде записане в інший файл. Викликайте ці функції знову щоразу, коли файл замінюється.

source: Example
uk: приклад

source: Example of a segmentation fault on Linux with and without enabling the fault handler:
uk: Приклад помилки сегментації в Linux із увімкненням і без увімкнення обробника помилок:
