Repository: python/python-docs-uk
Catalog: library/fileinput.po
Languages: uk

source: **Source code:** :source:`Lib/fileinput.py`
uk: **Вихідний код:** :source:`Lib/fileinput.py`

source: This module implements a helper class and functions to quickly write a loop over standard input or a list of files. If you just want to read or write one file see :func:`open`.
uk: Цей модуль реалізує допоміжний клас і функції для швидкого запису циклу через стандартний ввід або список файлів. Якщо ви просто хочете прочитати або записати один файл, перегляньте :func:`open`.

source: The typical use is::
uk: Типове використання:

source: This iterates over the lines of all files listed in ``sys.argv[1:]``, defaulting to ``sys.stdin`` if the list is empty. If a filename is ``'-'``, it is also replaced by ``sys.stdin`` and the optional arguments *mode* and *openhook* are ignored. To specify an alternative list of filenames, pass it as the first argument to :func:`.input`. A single file name is also allowed.
uk: Це повторює рядки всіх файлів, перелічених у ``sys.argv[1:]``, за умовчанням ``sys.stdin``, якщо список порожній. Якщо ім’я файлу ``'-'``, воно також замінюється на ``sys.stdin``, а додаткові аргументи *mode* і *openhook* ігноруються. Щоб вказати альтернативний список імен файлів, передайте його як перший аргумент у :func:`.input`. Допускається також одне ім’я файлу.

source: All files are opened in text mode by default, but you can override this by specifying the *mode* parameter in the call to :func:`.input` or :class:`FileInput`. If an I/O error occurs during opening or reading a file, :exc:`OSError` is raised.
uk: За замовчуванням усі файли відкриваються в текстовому режимі, але ви можете змінити це, вказавши параметр *mode* у виклику :func:`.input` або :class:`FileInput`. Якщо під час відкриття або читання файлу виникає помилка введення-виведення, виникає :exc:`OSError`.

source: :exc:`IOError` used to be raised; it is now an alias of :exc:`OSError`.
uk: :exc:`IOError` використовувався; тепер це псевдонім :exc:`OSError`.

source: If ``sys.stdin`` is used more than once, the second and further use will return no lines, except perhaps for interactive use, or if it has been explicitly reset (e.g. using ``sys.stdin.seek(0)``).
uk: Якщо ``sys.stdin`` використовується більше одного разу, друге і подальше використання не поверне жодних рядків, за винятком, можливо, для інтерактивного використання, або якщо його було явно скинуто (наприклад, за допомогою ``sys.stdin.seek(0))``).

source: Empty files are opened and immediately closed; the only time their presence in the list of filenames is noticeable at all is when the last file opened is empty.
uk: Порожні файли відкриваються і негайно закриваються; єдиний раз, коли їх присутність у списку імен файлів взагалі помітна, це коли останній відкритий файл порожній.

source: Lines are returned with any newlines intact, which means that the last line in a file may not have one.
uk: Рядки повертаються з усіма новими рядками, що означає, що останній рядок у файлі може їх не мати.

source: The following function is the primary interface of this module:
uk: Наступна функція є основним інтерфейсом цього модуля:

source: Create an instance of the :class:`FileInput` class. The instance will be used as global state for the functions of this module, and is also returned to use during iteration. The parameters to this function will be passed along to the constructor of the :class:`FileInput` class.
uk: Створіть екземпляр класу :class:`FileInput`. Примірник використовуватиметься як глобальний стан для функцій цього модуля, а також повертатиметься до використання під час ітерації. Параметри цієї функції будуть передані конструктору класу :class:`FileInput`.

source: The :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
uk: Екземпляр :class:`FileInput` можна використовувати як менеджер контексту в операторі :keyword:`with`. У цьому прикладі *input* закривається після завершення оператора :keyword:`!with`, навіть якщо виникає виняткова ситуація::

source: Can be used as a context manager.
uk: Може використовуватися як контекстний менеджер.

source: The keyword parameters *mode* and *openhook* are now keyword-only.
uk: Параметри ключових слів *mode* і *openhook* тепер є лише ключовими словами.

source: The keyword-only parameter *encoding* and *errors* are added.
uk: Додано лише ключове слово *кодування* та *помилки*.

source: The following functions use the global state created by :func:`fileinput.input`; if there is no active state, :exc:`RuntimeError` is raised.
uk: Наступні функції використовують глобальний стан, створений :func:`fileinput.input`; якщо активного стану немає, виникає :exc:`RuntimeError`.

source: Return the name of the file currently being read. Before the first line has been read, returns ``None``.
uk: Повертає назву файлу, який зараз читається. До того, як буде прочитано перший рядок, повертає ``None``.

source: Return the integer "file descriptor" for the current file. When no file is opened (before the first line and between files), returns ``-1``.
uk: Повертає ціле число "дескриптор файлу" для поточного файлу. Якщо файл не відкрито (перед першим рядком і між файлами), повертає ``-1``.

source: Return the cumulative line number of the line that has just been read. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line.
uk: Повертає кумулятивний номер рядка, який щойно було прочитано. До прочитання першого рядка повертає ``0``. Після прочитання останнього рядка останнього файлу повертає номер цього рядка.

source: Return the line number in the current file. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line within the file.
uk: Повертає номер рядка в поточному файлі. До прочитання першого рядка повертає ``0``. Після прочитання останнього рядка останнього файлу повертає номер рядка цього рядка у файлі.

source: Return ``True`` if the line just read is the first line of its file, otherwise return ``False``.
uk: Повертає ``True``, якщо щойно прочитаний рядок є першим рядком його файлу, інакше повертає ``False``.

source: Return ``True`` if the last line was read from ``sys.stdin``, otherwise return ``False``.
uk: Повертає ``True``, якщо останній рядок було прочитано з ``sys.stdin``, інакше повертає ``False``.

source: Close the current file so that the next iteration will read the first line from the next file (if any); lines not read from the file will not count towards the cumulative line count. The filename is not changed until after the first line of the next file has been read. Before the first line has been read, this function has no effect; it cannot be used to skip the first file. After the last line of the last file has been read, this function has no effect.
uk: Закрийте поточний файл, щоб наступна ітерація прочитала перший рядок із наступного файлу (якщо такий є); рядки, не прочитані з файлу, не враховуватимуться до загальної кількості рядків. Ім'я файлу не змінюється, доки не буде прочитано перший рядок наступного файлу. До прочитання першого рядка ця функція не діє; його не можна використовувати для пропуску першого файлу. Після прочитання останнього рядка останнього файлу ця функція не діє.

source: Close the sequence.
uk: Закрийте послідовність.

source: The class which implements the sequence behavior provided by the module is available for subclassing as well:
uk: Клас, який реалізує поведінку послідовності, надану модулем, також доступний для підкласів:

source: The *openhook*, when given, must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. You cannot use *inplace* and *openhook* together.
uk: *Openhook*, якщо його надано, має бути функцією, яка приймає два аргументи, *filename* і *mode*, і повертає відповідний відкритий файлоподібний об’єкт. Ви не можете використовувати *inplace* і *openhook* разом.

source: You can specify *encoding* and *errors* that is passed to :func:`open` or *openhook*.
uk: Ви можете вказати *кодування* та *помилки*, які передаються в :func:`open` або *openhook*.

source: A :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
uk: Екземпляр :class:`FileInput` можна використовувати як менеджер контексту в операторі :keyword:`with`. У цьому прикладі *input* закривається після завершення оператора :keyword:`!with`, навіть якщо виникає виняткова ситуація::

source: The keyword parameter *mode* and *openhook* are now keyword-only.
uk: Ключові параметри *mode* і *openhook* тепер є лише ключовими словами.

source: **Optional in-place filtering:** if the keyword argument ``inplace=True`` is passed to :func:`fileinput.input` or to the :class:`FileInput` constructor, the file is moved to a backup file and standard output is directed to the input file (if a file of the same name as the backup file already exists, it will be replaced silently). This makes it possible to write a filter that rewrites its input file in place. If the *backup* parameter is given (typically as ``backup='.<some extension>'``), it specifies the extension for the backup file, and the backup file remains around; by default, the extension is ``'.bak'`` and it is deleted when the output file is closed. In-place filtering is disabled when standard input is read.
uk: **Додаткова фільтрація на місці:** якщо ключовий аргумент ``inplace=True`` передається до :func:`fileinput.input` або до конструктора :class:`FileInput`, файл переміщується до резервної копії файл, а стандартний вивід спрямовується до вхідного файлу (якщо файл із такою ж назвою, як і файл резервної копії, уже існує, його буде замінено мовчки). Це дає змогу написати фільтр, який перезаписує свій вхідний файл на місці. Якщо вказано параметр *backup* (зазвичай як ``backup='. <some extension> ''``), він визначає розширення файлу резервної копії, і файл резервної копії залишається; за замовчуванням розширення має ``'.bak'`` і воно видаляється, коли вихідний файл закривається. Фільтрування на місці вимкнено, коли зчитується стандартний ввід.

source: The two following opening hooks are provided by this module:
uk: Цей модуль забезпечує два наступних відкриваючі гачки:

source: Transparently opens files compressed with gzip and bzip2 (recognized by the extensions ``'.gz'`` and ``'.bz2'``) using the :mod:`gzip` and :mod:`bz2` modules. If the filename extension is not ``'.gz'`` or ``'.bz2'``, the file is opened normally (ie, using :func:`open` without any decompression).
uk: Прозоро відкриває файли, стиснуті за допомогою gzip і bzip2 (розпізнаються за розширеннями ``'.gz''`` і ``'.bz2``) за допомогою модулів :mod:`gzip` і :mod:`bz2`. Якщо розширення назви файлу не є ``'.gz''`` або ``'.bz2''``, файл відкривається нормально (тобто за допомогою :func:`open` без будь-якої декомпресії).

source: The *encoding* and *errors* values are passed to :class:`io.TextIOWrapper` for compressed files and open for normal files.
uk: Значення *encoding* і *errors* передаються в :class:`io.TextIOWrapper` для стиснутих файлів і відкриваються для звичайних файлів.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``
uk: Приклад використання: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``

source: Returns a hook which opens each file with :func:`open`, using the given *encoding* and *errors* to read the file.
uk: Повертає хук, який відкриває кожен файл за допомогою :func:`open`, використовуючи задане *кодування* та *помилки* для читання файлу.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``
uk: Приклад використання: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``

source: Added the optional *errors* parameter.
uk: Додано необов’язковий параметр *errors*.

source: This function is deprecated since :func:`fileinput.input` and :class:`FileInput` now have *encoding* and *errors* parameters.
uk: Ця функція застаріла, оскільки :func:`fileinput.input` і :class:`FileInput` тепер мають параметри *encoding* і *errors*.
