Repository: python/python-docs-uk
Catalog: library/filecmp.po
Languages: uk

source: :mod:`filecmp` --- File and Directory Comparisons
uk: :mod:`filecmp` --- Порівняння файлів і каталогів

source: **Source code:** :source:`Lib/filecmp.py`
uk: **Вихідний код:** :source:`Lib/filecmp.py`

source: The :mod:`filecmp` module defines functions to compare files and directories, with various optional time/correctness trade-offs. For comparing files, see also the :mod:`difflib` module.
uk: Модуль :mod:`filecmp` визначає функції для порівняння файлів і каталогів із різними необов’язковими компромісами між часом і правильністю. Для порівняння файлів див. також модуль :mod:`difflib`.

source: The :mod:`filecmp` module defines the following functions:
uk: Модуль :mod:`filecmp` визначає такі функції:

source: Compare the files named *f1* and *f2*, returning ``True`` if they seem equal, ``False`` otherwise.
uk: Порівняйте файли з іменами *f1* і *f2*, повертаючи ``True``, якщо вони здаються однаковими, ``False`` інакше.

source: If *shallow* is true and the :func:`os.stat` signatures (file type, size, and modification time) of both files are identical, the files are taken to be equal.
uk: Якщо *shallow* має значення true і сигнатури :func:`os.stat` (тип файлу, розмір і час модифікації) обох файлів ідентичні, файли вважаються однаковими.

source: Otherwise, the files are treated as different if their sizes or contents differ.
uk: В іншому випадку файли розглядаються як різні, якщо їхні розміри або вміст відрізняються.

source: Note that no external programs are called from this function, giving it portability and efficiency.
uk: Зауважте, що жодні зовнішні програми не викликаються з цієї функції, що забезпечує її переносимість та ефективність.

source: This function uses a cache for past comparisons and the results, with cache entries invalidated if the :func:`os.stat` information for the file changes. The entire cache may be cleared using :func:`clear_cache`.
uk: Ця функція використовує кеш для попередніх порівнянь і результатів, при цьому записи кешу стають недійсними, якщо інформація :func:`os.stat` для файлу змінюється. Весь кеш можна очистити за допомогою :func:`clear_cache`.

source: Compare the files in the two directories *dir1* and *dir2* whose names are given by *common*.
uk: Порівняйте файли у двох каталогах *dir1* і *dir2*, імена яких задані *common*.

source: Returns three lists of file names: *match*, *mismatch*, *errors*. *match* contains the list of files that match, *mismatch* contains the names of those that don't, and *errors* lists the names of files which could not be compared. Files are listed in *errors* if they don't exist in one of the directories, the user lacks permission to read them or if the comparison could not be done for some other reason.
uk: Повертає три списки імен файлів: *збіг*, *невідповідність*, *помилки*. *match* містить список файлів, які збігаються, *mismatch* містить імена тих, які не відповідають, а *errors* містить імена файлів, які не вдалося порівняти. Файли перераховуються в *помилках*, якщо вони не існують в одному з каталогів, у користувача немає дозволу на їх читання або якщо порівняння не вдалося виконати з іншої причини.

source: The *shallow* parameter has the same meaning and default value as for :func:`filecmp.cmp`.
uk: Параметр *shallow* має те саме значення та значення за замовчуванням, що й для :func:`filecmp.cmp`.

source: For example, ``cmpfiles('a', 'b', ['c', 'd/e'])`` will compare ``a/c`` with ``b/c`` and ``a/d/e`` with ``b/d/e``. ``'c'`` and ``'d/e'`` will each be in one of the three returned lists.
uk: Наприклад, ``cmpfiles('a', 'b', ['c', 'd/e'])`` порівнює ``a/c`` з ``b/c`` і ``a /d/e`` з ``b/d/e``. ``'c'`` і ``'d/e'`` будуть кожен в одному з трьох повернутих списків.

source: Clear the filecmp cache. This may be useful if a file is compared so quickly after it is modified that it is within the mtime resolution of the underlying filesystem.
uk: Очистіть кеш filecmp. Це може бути корисним, якщо файл порівнюється настільки швидко після його модифікації, що він знаходиться в межах дозволу mtime основної файлової системи.

source: The :class:`dircmp` class
uk: Клас :class:`dircmp`

source: Construct a new directory comparison object, to compare the directories *a* and *b*. *ignore* is a list of names to ignore, and defaults to :attr:`filecmp.DEFAULT_IGNORES`. *hide* is a list of names to hide, and defaults to ``[os.curdir, os.pardir]``.
uk: Створіть новий об’єкт порівняння каталогів, щоб порівняти каталоги *a* і *b*. *ignore* — це список імен, які потрібно ігнорувати, і за замовчуванням :attr:`filecmp.DEFAULT_IGNORES`. *hide* — це список імен, які потрібно приховати, і за замовчуванням ``[os.curdir, os.pardir]``.

source: The :class:`dircmp` class compares files by doing *shallow* comparisons as described for :func:`filecmp.cmp`.
uk: Клас :class:`dircmp` порівнює файли, виконуючи *неглибоке* порівняння, як описано для :func:`filecmp.cmp`.

source: The :class:`dircmp` class provides the following methods:
uk: Клас :class:`dircmp` надає такі методи:

source: Print (to :data:`sys.stdout`) a comparison between *a* and *b*.
uk: Вивести (у :data:`sys.stdout`) порівняння між *a* і *b*.

source: Print a comparison between *a* and *b* and common immediate subdirectories.
uk: Надрукуйте порівняння між *a* і *b* та загальними безпосередніми підкаталогами.

source: Print a comparison between *a* and *b* and common subdirectories (recursively).
uk: Вивести порівняння між *a* і *b* та загальними підкаталогами (рекурсивно).

source: The :class:`dircmp` class offers a number of interesting attributes that may be used to get various bits of information about the directory trees being compared.
uk: Клас :class:`dircmp` пропонує низку цікавих атрибутів, які можна використовувати для отримання різноманітної інформації про порівнювані дерева каталогів.

source: Note that via :meth:`__getattr__` hooks, all attributes are computed lazily, so there is no speed penalty if only those attributes which are lightweight to compute are used.
uk: Зауважте, що за допомогою хуків :meth:`__getattr__` усі атрибути обчислюються ліниво, тому немає покарання за швидкість, якщо використовуються лише ті атрибути, які є легкими для обчислення.

source: The directory *a*.
uk: Каталог *a*.

source: The directory *b*.
uk: Каталог *b*.

source: Files and subdirectories in *a*, filtered by *hide* and *ignore*.
uk: Файли та підкаталоги в *a*, відфільтровані за допомогою *hide* та *ignore*.

source: Files and subdirectories in *b*, filtered by *hide* and *ignore*.
uk: Файли та підкаталоги в *b*, відфільтровані за допомогою *hide* та *ignore*.

source: Files and subdirectories in both *a* and *b*.
uk: Файли та підкаталоги в *a* і *b*.

source: Files and subdirectories only in *a*.
uk: Файли та підкаталоги лише в *a*.

source: Files and subdirectories only in *b*.
uk: Файли та підкаталоги лише в *b*.

source: Subdirectories in both *a* and *b*.
uk: Підкаталоги в *a* і *b*.

source: Files in both *a* and *b*.
uk: Файли в *a* і *b*.

source: Names in both *a* and *b*, such that the type differs between the directories, or names for which :func:`os.stat` reports an error.
uk: Імена як у *a*, так і в *b*, типи яких відрізняються в різних каталогах, або імена, для яких :func:`os.stat` повідомляє про помилку.

source: Files which are identical in both *a* and *b*, using the class's file comparison operator.
uk: Файли, ідентичні як у *a*, так і в *b*, використовуючи оператор порівняння файлів класу.

source: Files which are in both *a* and *b*, whose contents differ according to the class's file comparison operator.
uk: Файли, які містяться як у *a*, так і в *b*, вміст яких відрізняється відповідно до оператора порівняння файлів класу.

source: Files which are in both *a* and *b*, but could not be compared.
uk: Файли, які знаходяться як у *a*, так і в *b*, але не можна порівняти.

source: A dictionary mapping names in :attr:`common_dirs` to :class:`dircmp` instances (or MyDirCmp instances if this instance is of type MyDirCmp, a subclass of :class:`dircmp`).
uk: Словник, що відображає імена в :attr:`common_dirs` на екземпляри :class:`dircmp` (або екземпляри MyDirCmp, якщо цей екземпляр має тип MyDirCmp, підклас :class:`dircmp`).

source: Previously entries were always :class:`dircmp` instances. Now entries are the same type as *self*, if *self* is a subclass of :class:`dircmp`.
uk: Раніше записи завжди були екземплярами :class:`dircmp`. Тепер записи того самого типу, що й *self*, якщо *self* є підкласом :class:`dircmp`.

source: List of directories ignored by :class:`dircmp` by default.
uk: Список каталогів, які :class:`dircmp` ігнорує за умовчанням.

source: Here is a simplified example of using the ``subdirs`` attribute to search recursively through two directories to show common different files::
uk: Ось спрощений приклад використання атрибута ``subdirs`` для рекурсивного пошуку в двох каталогах, щоб показати спільні різні файли::
