Repository: python/python-docs-uk
Catalog: library/functools.po
Languages: uk

source: Where there is no registered implementation for a specific type, its method resolution order is used to find a more generic implementation. The original function decorated with ``@singledispatch`` is registered for the base :class:`object` type, which means it is used if no better implementation is found.
uk: Якщо немає зареєстрованої реалізації для певного типу, його порядок вирішення методів використовується для пошуку більш загальної реалізації. Оригінальна функція, прикрашена ``@singledispatch``, зареєстрована для базового типу :class:`object`, що означає, що вона використовується, якщо не знайдено кращої реалізації.

source: If an implementation is registered to an :term:`abstract base class`, virtual subclasses of the base class will be dispatched to that implementation::
uk: Якщо реалізацію зареєстровано в :term:`abstract base class`, віртуальні підкласи базового класу будуть відправлені до цієї реалізації::

source: To check which implementation the generic function will choose for a given type, use the ``dispatch()`` attribute::
uk: Щоб перевірити, яку реалізацію вибере загальна функція для заданого типу, використовуйте атрибут ``dispatch()``::

source: To access all registered implementations, use the read-only ``registry`` attribute::
uk: Щоб отримати доступ до всіх зареєстрованих реалізацій, використовуйте атрибут ``registry`` лише для читання::

source: The :func:`register` attribute now supports using type annotations.
uk: Атрибут :func:`register` тепер підтримує використання анотацій типу.

source: Transform a method into a :term:`single-dispatch <single dispatch>` :term:`generic function`.
uk: Перетворення методу на :term:`single-dispatch <single dispatch>` :term:`generic function`.

source: To define a generic method, decorate it with the ``@singledispatchmethod`` decorator. When defining a function using ``@singledispatchmethod``, note that the dispatch happens on the type of the first non-*self* or non-*cls* argument::
uk: Щоб визначити загальний метод, прикрасьте його декоратором ``@singledispatchmethod``. Визначаючи функцію за допомогою ``@singledispatchmethod``, зауважте, що відправлення відбувається за типом першого не*self* або не*cls* аргументу::

source: ``@singledispatchmethod`` supports nesting with other decorators such as :func:`@classmethod<classmethod>`. Note that to allow for ``dispatcher.register``, ``singledispatchmethod`` must be the *outer most* decorator. Here is the ``Negator`` class with the ``neg`` methods bound to the class, rather than an instance of the class::
uk: ``@singledispatchmethod`` підтримує вкладення з іншими декораторами, такими як :func:`@classmethod <classmethod>`. Зауважте, що для того, щоб дозволити ``dispatcher.register``, ``singledispatchmethod`` має бути *зовнішнім* декоратором. Ось клас ``Negator`` з методами ``neg``, прив'язаними до класу, а не екземпляр класу::

source: The same pattern can be used for other similar decorators: :func:`@staticmethod<staticmethod>`, :func:`@abstractmethod<abc.abstractmethod>`, and others.
uk: Той самий шаблон можна використовувати для інших подібних декораторів: :func:`@staticmethod <staticmethod>`, :func:`@abstractmethod <abc.abstractmethod>` та інших.

source: Update a *wrapper* function to look like the *wrapped* function. The optional arguments are tuples to specify which attributes of the original function are assigned directly to the matching attributes on the wrapper function and which attributes of the wrapper function are updated with the corresponding attributes from the original function. The default values for these arguments are the module level constants ``WRAPPER_ASSIGNMENTS`` (which assigns to the wrapper function's ``__module__``, ``__name__``, ``__qualname__``, ``__annotations__`` and ``__doc__``, the documentation string) and ``WRAPPER_UPDATES`` (which updates the wrapper function's ``__dict__``, i.e. the instance dictionary).
uk: Оновіть функцію *wrapper*, щоб виглядати як функція *wrapper*. Необов’язкові аргументи — це кортежі, які вказують, які атрибути вихідної функції призначаються безпосередньо відповідним атрибутам у функції-огортці та які атрибути функції-огортки оновлюються відповідними атрибутами з вихідної функції. Значеннями за замовчуванням для цих аргументів є константи рівня модуля ``WRAPPER_ASSIGNMENTS`` (які призначають функції-оболонки ``__module__``, ``__name__``, ``__qualname__``, ``__annotations__`` і ``__doc__``, рядок документації) і ``WRAPPER_UPDATES`` (який оновлює ``__dict__`` функції-огортки, тобто словник екземпляра).

source: To allow access to the original function for introspection and other purposes (e.g. bypassing a caching decorator such as :func:`lru_cache`), this function automatically adds a ``__wrapped__`` attribute to the wrapper that refers to the function being wrapped.
uk: Щоб дозволити доступ до оригінальної функції для самоаналізу та інших цілей (наприклад, обхід декоратора кешування, такого як :func:`lru_cache`), ця функція автоматично додає атрибут ``__wrapped__`` до оболонки, яка посилається на функцію, яку обгортають.

source: The main intended use for this function is in :term:`decorator` functions which wrap the decorated function and return the wrapper. If the wrapper function is not updated, the metadata of the returned function will reflect the wrapper definition rather than the original function definition, which is typically less than helpful.
uk: Основним призначенням цієї функції є функції :term:`decorator`, які обертають декоровану функцію та повертають оболонку. Якщо функція-оболонка не оновлена, метадані повернутої функції відображатимуть визначення оболонки, а не початкове визначення функції, що зазвичай не дуже корисно.

source: :func:`update_wrapper` may be used with callables other than functions. Any attributes named in *assigned* or *updated* that are missing from the object being wrapped are ignored (i.e. this function will not attempt to set them on the wrapper function). :exc:`AttributeError` is still raised if the wrapper function itself is missing any attributes named in *updated*.
uk: :func:`update_wrapper` можна використовувати з іншими викликами, ніж функції. Будь-які атрибути з іменами *assigned* або *updated*, яких немає в об’єкті, що обгортається, ігноруються (тобто ця функція не намагатиметься встановити їх у функції обгортки). :exc:`AttributeError` все ще виникає, якщо в самій функції-обгортки відсутні будь-які атрибути, названі в *updated*.

source: Automatic addition of the ``__wrapped__`` attribute.
uk: Автоматичне додавання атрибута ``__wrapped__``.

source: Copying of the ``__annotations__`` attribute by default.
uk: Копіювання атрибута ``__annotations__`` за замовчуванням.

source: Missing attributes no longer trigger an :exc:`AttributeError`.
uk: Відсутні атрибути більше не викликають :exc:`AttributeError`.

source: The ``__wrapped__`` attribute now always refers to the wrapped function, even if that function defined a ``__wrapped__`` attribute. (see :issue:`17482`)
uk: Атрибут ``__wrapped__`` тепер завжди посилається на обгорнуту функцію, навіть якщо ця функція визначила атрибут ``__wrapped__``. (див. :issue:`17482`)

source: This is a convenience function for invoking :func:`update_wrapper` as a function decorator when defining a wrapper function. It is equivalent to ``partial(update_wrapper, wrapped=wrapped, assigned=assigned, updated=updated)``. For example::
uk: Це зручна функція для виклику :func:`update_wrapper` як декоратора функції під час визначення функції-огортки. Це еквівалентно ``partial(update_wrapper, wrapped=wrapped, assigned=призначено, updated=updated)``. Наприклад::

source: Without the use of this decorator factory, the name of the example function would have been ``'wrapper'``, and the docstring of the original :func:`example` would have been lost.
uk: Без використання цієї фабрики декораторів назва функції прикладу була б ``'wrapper``, а рядок документації оригінального :func:`example` було б втрачено.

source: :class:`partial` Objects
uk: :class:`partial` Об'єкти

source: :class:`partial` objects are callable objects created by :func:`partial`. They have three read-only attributes:
uk: :class:`partial` об’єкти – це викликані об’єкти, створені :func:`partial`. Вони мають три атрибути лише для читання:

source: A callable object or function. Calls to the :class:`partial` object will be forwarded to :attr:`func` with new arguments and keywords.
uk: Викликаний об’єкт або функція. Виклики об’єкта :class:`partial` будуть перенаправлені до :attr:`func` з новими аргументами та ключовими словами.

source: The leftmost positional arguments that will be prepended to the positional arguments provided to a :class:`partial` object call.
uk: Крайні ліві позиційні аргументи, які будуть додані до позиційних аргументів, наданих до виклику об’єкта :class:`partial`.

source: The keyword arguments that will be supplied when the :class:`partial` object is called.
uk: Ключові аргументи, які будуть надані під час виклику об’єкта :class:`partial`.

source: :class:`partial` objects are like :class:`function` objects in that they are callable, weak referencable, and can have attributes. There are some important differences. For instance, the :attr:`~definition.__name__` and :attr:`__doc__` attributes are not created automatically. Also, :class:`partial` objects defined in classes behave like static methods and do not transform into bound methods during instance attribute look-up.
uk: Об’єкти :class:`partial` схожі на об’єкти :class:`function` тим, що їх можна викликати, на них можна слабко посилатися та вони можуть мати атрибути. Є деякі важливі відмінності. Наприклад, атрибути :attr:`~definition.__name__` і :attr:`__doc__` не створюються автоматично. Крім того, об’єкти :class:`partial`, визначені в класах, поводяться як статичні методи і не перетворюються на зв’язані методи під час пошуку атрибутів екземпляра.
