Repository: python/python-docs-uk
Catalog: library/functools.po
Languages: uk

source: :mod:`functools` --- Higher-order functions and operations on callable objects
uk: :mod:`functools` --- Функції вищого порядку та операції над об'єктами, що викликаються

source: **Source code:** :source:`Lib/functools.py`
uk: **Вихідний код:** :source:`Lib/functools.py`

source: The :mod:`functools` module is for higher-order functions: functions that act on or return other functions. In general, any callable object can be treated as a function for the purposes of this module.
uk: Модуль :mod:`functools` призначений для функцій вищого порядку: функцій, які діють або повертають інші функції. Загалом, будь-який викликуваний об’єкт можна розглядати як функцію для цілей цього модуля.

source: The :mod:`functools` module defines the following functions:
uk: Модуль :mod:`functools` визначає такі функції:

source: Simple lightweight unbounded function cache. Sometimes called `"memoize" <https://en.wikipedia.org/wiki/Memoization>`_.
uk: Простий легкий необмежений кеш функцій. Іноді називається `"memoize" <https://en.wikipedia.org/wiki/Memoization>`_.

source: Returns the same as ``lru_cache(maxsize=None)``, creating a thin wrapper around a dictionary lookup for the function arguments. Because it never needs to evict old values, this is smaller and faster than :func:`lru_cache()` with a size limit.
uk: Повертає те саме, що ``lru_cache(maxsize=None)``, створюючи тонку обгортку навколо пошуку в словнику для аргументів функції. Оскільки йому ніколи не потрібно вилучати старі значення, він менший і швидший, ніж :func:`lru_cache()` з обмеженням розміру.

source: For example::
uk: Наприклад::

source: Transform a method of a class into a property whose value is computed once and then cached as a normal attribute for the life of the instance. Similar to :func:`property`, with the addition of caching. Useful for expensive computed properties of instances that are otherwise effectively immutable.
uk: Перетворення методу класу на властивість, значення якого обчислюється один раз, а потім кешується як звичайний атрибут протягом життя екземпляра. Подібно до :func:`property`, з додаванням кешування. Корисно для дорогих обчислених властивостей екземплярів, які в іншому випадку є фактично незмінними.

source: Example::
uk: Приклад::

source: The mechanics of :func:`cached_property` are somewhat different from :func:`property`. A regular property blocks attribute writes unless a setter is defined. In contrast, a *cached_property* allows writes.
uk: Механіка :func:`cached_property` дещо відрізняється від :func:`property`. Звичайна властивість блокує запис атрибута, якщо не визначено установщик. На відміну від цього, *cached_property* дозволяє запис.

source: The *cached_property* decorator only runs on lookups and only when an attribute of the same name doesn't exist. When it does run, the *cached_property* writes to the attribute with the same name. Subsequent attribute reads and writes take precedence over the *cached_property* method and it works like a normal attribute.
uk: Декоратор *cached_property* працює лише під час пошуку й лише тоді, коли атрибут із такою ж назвою не існує. Коли він виконується, *cached_property* записує в атрибут з таким же ім’ям. Наступні атрибути читання та запису мають пріоритет над методом *cached_property*, і він працює як звичайний атрибут.

source: The cached value can be cleared by deleting the attribute. This allows the *cached_property* method to run again.
uk: Кешоване значення можна очистити, видаливши атрибут. Це дозволяє знову запустити метод *cached_property*.

source: Note, this decorator interferes with the operation of :pep:`412` key-sharing dictionaries. This means that instance dictionaries can take more space than usual.
uk: Зауважте, що цей декоратор заважає роботі словників спільного ключа :pep:`412`. Це означає, що словники примірників можуть займати більше місця, ніж зазвичай.

source: Also, this decorator requires that the ``__dict__`` attribute on each instance be a mutable mapping. This means it will not work with some types, such as metaclasses (since the ``__dict__`` attributes on type instances are read-only proxies for the class namespace), and those that specify ``__slots__`` without including ``__dict__`` as one of the defined slots (as such classes don't provide a ``__dict__`` attribute at all).
uk: Крім того, цей декоратор вимагає, щоб атрибут ``__dict__`` для кожного екземпляра був змінним відображенням. Це означає, що він не працюватиме з деякими типами, такими як метакласи (оскільки атрибути ``__dict__`` в екземплярах типу є проксі-серверами лише для читання для простору імен класу), і ті, які вказують ``__slots__`` без включення ``__dict__`` як один із визначених слотів (оскільки такі класи взагалі не надають атрибут ``__dict__``).

source: If a mutable mapping is not available or if space-efficient key sharing is desired, an effect similar to :func:`cached_property` can be achieved by a stacking :func:`property` on top of :func:`cache`::
uk: Якщо змінне відображення недоступне або якщо потрібен спільний доступ до ключів з ефективним використанням простору, ефект, подібний до :func:`cached_property`, може бути досягнутий стекуванням :func:`property` поверх :func:`cache`::

source: Transform an old-style comparison function to a :term:`key function`. Used with tools that accept key functions (such as :func:`sorted`, :func:`min`, :func:`max`, :func:`heapq.nlargest`, :func:`heapq.nsmallest`, :func:`itertools.groupby`). This function is primarily used as a transition tool for programs being converted from Python 2 which supported the use of comparison functions.
uk: Перетворіть функцію порівняння старого стилю на :term:`key function`. Використовується з інструментами, які приймають ключові функції (такі як :func:`sorted`, :func:`min`, :func:`max`, :func:`heapq.nlargest`, :func:`heapq.nsmallest`, :func:`itertools.groupby`). Ця функція в основному використовується як інструмент переходу для програм, які перетворюються з Python 2, який підтримує використання функцій порівняння.

source: A comparison function is any callable that accept two arguments, compares them, and returns a negative number for less-than, zero for equality, or a positive number for greater-than. A key function is a callable that accepts one argument and returns another value to be used as the sort key.
uk: Функція порівняння — це будь-який виклик, який приймає два аргументи, порівнює їх і повертає від’ємне число для меншого, нуль для рівності або позитивне число для більшого. Ключова функція — це виклик, який приймає один аргумент і повертає інше значення, яке використовується як ключ сортування.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
uk: Приклади сортування та короткий посібник із сортування див. :ref:`sortinghowto`.

source: Decorator to wrap a function with a memoizing callable that saves up to the *maxsize* most recent calls. It can save time when an expensive or I/O bound function is periodically called with the same arguments.
uk: Декоратор для обгортання функції викликом мемоізації, який зберігає до *maxsize* останніх викликів. Це може заощадити час, коли дорога функція або функція, пов’язана з вводом/виводом, періодично викликається з однаковими аргументами.

source: Since a dictionary is used to cache results, the positional and keyword arguments to the function must be hashable.
uk: Оскільки словник використовується для кешування результатів, позиційні та ключові аргументи функції мають хешуватися.

source: Distinct argument patterns may be considered to be distinct calls with separate cache entries. For example, `f(a=1, b=2)` and `f(b=2, a=1)` differ in their keyword argument order and may have two separate cache entries.
uk: Різні шаблони аргументів можна вважати різними викликами з окремими записами кешу. Наприклад, `f(a=1, b=2)` і `f(b=2, a=1)` відрізняються порядком аргументів ключових слів і можуть мати два окремі записи кешу.

source: If *user_function* is specified, it must be a callable. This allows the *lru_cache* decorator to be applied directly to a user function, leaving the *maxsize* at its default value of 128::
uk: Якщо вказано *user_function*, вона має бути викликаною. Це дозволяє застосувати декоратор *lru_cache* безпосередньо до функції користувача, залишаючи значення *maxsize* за замовчуванням 128::

source: If *maxsize* is set to ``None``, the LRU feature is disabled and the cache can grow without bound.
uk: Якщо для параметра *maxsize* встановлено значення ``None``, функція LRU вимкнена, і кеш може збільшуватися без обмежень.

source: If *typed* is set to true, function arguments of different types will be cached separately. If *typed* is false, the implementation will usually regard them as equivalent calls and only cache a single result. (Some types such as *str* and *int* may be cached separately even when *typed* is false.)
uk: Якщо *typed* має значення true, аргументи функції різних типів кешуватимуться окремо. Якщо *typed* має значення false, реалізація зазвичай розглядатиме їх як еквівалентні виклики та кешуватиме лише один результат. (Деякі типи, такі як *str* і *int*, можуть кешуватися окремо, навіть якщо *typed* має значення false.)

source: Note, type specificity applies only to the function's immediate arguments rather than their contents. The scalar arguments, ``Decimal(42)`` and ``Fraction(42)`` are be treated as distinct calls with distinct results. In contrast, the tuple arguments ``('answer', Decimal(42))`` and ``('answer', Fraction(42))`` are treated as equivalent.
uk: Зауважте, що специфічність типу застосовується лише до безпосередніх аргументів функції, а не до їх вмісту. Скалярні аргументи ``Decimal(42)`` і ``Fraction(42)`` розглядаються як окремі виклики з різними результатами. Навпаки, аргументи кортежу ``('answer', Decimal(42))`` і ``('answer', Fraction(42))`` розглядаються як еквівалентні.

source: The wrapped function is instrumented with a :func:`cache_parameters` function that returns a new :class:`dict` showing the values for *maxsize* and *typed*. This is for information purposes only. Mutating the values has no effect.
uk: Обгорнута функція оснащена функцією :func:`cache_parameters`, яка повертає новий :class:`dict` із значеннями для *maxsize* і *typed*. Це лише для інформаційних цілей. Зміна значень не має ефекту.

source: To help measure the effectiveness of the cache and tune the *maxsize* parameter, the wrapped function is instrumented with a :func:`cache_info` function that returns a :term:`named tuple` showing *hits*, *misses*, *maxsize* and *currsize*.
uk: Щоб допомогти виміряти ефективність кешу та налаштувати параметр *maxsize*, обгорнута функція обладнана функцією :func:`cache_info`, яка повертає :term:`named tuple`, що показує *влучення*, *промахи*, *maxsize* і *currsize*.

source: The decorator also provides a :func:`cache_clear` function for clearing or invalidating the cache.
uk: Декоратор також надає функцію :func:`cache_clear` для очищення або анулювання кешу.

source: The original underlying function is accessible through the :attr:`__wrapped__` attribute. This is useful for introspection, for bypassing the cache, or for rewrapping the function with a different cache.
uk: Оригінальна базова функція доступна через атрибут :attr:`__wrapped__`. Це корисно для самоаналізу, для обходу кешу або для перезагортання функції в інший кеш.

source: The cache keeps references to the arguments and return values until they age out of the cache or until the cache is cleared.
uk: Кеш зберігає посилання на аргументи та значення, що повертаються, доки вони не вичерпаються з кешу або поки кеш не буде очищено.

source: An `LRU (least recently used) cache <https://en.wikipedia.org/wiki/Cache_replacement_policies#Least_recently_used_(LRU)>`_ works best when the most recent calls are the best predictors of upcoming calls (for example, the most popular articles on a news server tend to change each day). The cache's size limit assures that the cache does not grow without bound on long-running processes such as web servers.
uk: Кеш `LRU (найменше використовуваний) <https://en.wikipedia.org/wiki/Cache_replacement_policies#Least_recently_used_(LRU)>`_ працює найкраще, коли останні дзвінки є найкращим прогнозом майбутніх дзвінків (наприклад, найпопулярніші статті на сервері новин, як правило, змінюються щодня). Обмеження розміру кешу гарантує, що кеш не буде безмежно зростати довготривалими процесами, такими як веб-сервери.

source: In general, the LRU cache should only be used when you want to reuse previously computed values. Accordingly, it doesn't make sense to cache functions with side-effects, functions that need to create distinct mutable objects on each call, or impure functions such as time() or random().
uk: Загалом кеш LRU слід використовувати лише тоді, коли потрібно повторно використати попередньо обчислені значення. Відповідно, немає сенсу кешувати функції з побічними ефектами, функції, які потребують створення окремих змінних об’єктів під час кожного виклику, або нечисті функції, такі як time() або random().

source: Example of an LRU cache for static web content::
uk: Приклад кешу LRU для статичного веб-контенту::

source: Example of efficiently computing `Fibonacci numbers <https://en.wikipedia.org/wiki/Fibonacci_number>`_ using a cache to implement a `dynamic programming <https://en.wikipedia.org/wiki/Dynamic_programming>`_ technique::
uk: Приклад ефективного обчислення `чисел Фібоначчі <https://en.wikipedia.org/wiki/Fibonacci_number>`_ з використанням кешу для реалізації техніки `динамічного програмування <https://en.wikipedia.org/wiki/Dynamic_programming>`_::

source: Added the *typed* option.
uk: Додано параметр *введений*.

source: Added the *user_function* option.
uk: Додано опцію *user_function*.

source: Added the function :func:`cache_parameters`
uk: Додано функцію :func:`cache_parameters`

source: Given a class defining one or more rich comparison ordering methods, this class decorator supplies the rest. This simplifies the effort involved in specifying all of the possible rich comparison operations:
uk: Враховуючи клас, що визначає один або більше методів розширеного впорядкування порівняння, цей декоратор класу забезпечує решту. Це спрощує завдання, пов’язані з визначенням усіх можливих операцій розширеного порівняння:

source: The class must define one of :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, or :meth:`__ge__`. In addition, the class should supply an :meth:`__eq__` method.
uk: Клас має визначати одне з :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__` або :meth:`__ge__`. Крім того, клас повинен надати метод :meth:`__eq__`.

source: While this decorator makes it easy to create well behaved totally ordered types, it *does* come at the cost of slower execution and more complex stack traces for the derived comparison methods. If performance benchmarking indicates this is a bottleneck for a given application, implementing all six rich comparison methods instead is likely to provide an easy speed boost.
uk: Незважаючи на те, що цей декоратор дозволяє легко створювати повністю впорядковані типи, що добре ведуть себе, це *ціна* відбувається за рахунок повільнішого виконання та більш складних трасувань стека для похідних методів порівняння. Якщо порівняльний аналіз продуктивності вказує на те, що це вузьке місце для даної програми, впровадження всіх шести розширених методів порівняння натомість, ймовірно, забезпечить легке підвищення швидкості.

source: This decorator makes no attempt to override methods that have been declared in the class *or its superclasses*. Meaning that if a superclass defines a comparison operator, *total_ordering* will not implement it again, even if the original method is abstract.
uk: Цей декоратор не намагається перевизначити методи, які були оголошені в класі *або його суперкласах*. Це означає, що якщо суперклас визначає оператор порівняння, *total_ordering* не реалізує його знову, навіть якщо вихідний метод є абстрактним.

source: Returning NotImplemented from the underlying comparison function for unrecognised types is now supported.
uk: Тепер підтримується повернення NotImplemented із основної функції порівняння для нерозпізнаних типів.

source: Return a new :ref:`partial object<partial-objects>` which when called will behave like *func* called with the positional arguments *args* and keyword arguments *keywords*. If more arguments are supplied to the call, they are appended to *args*. If additional keyword arguments are supplied, they extend and override *keywords*. Roughly equivalent to::
uk: Повертає новий :ref:`частковий об’єкт <partial-objects>`, який під час виклику поводитиметься як *func*, що викликається з позиційними аргументами *args* і ключовими аргументами *keywords*. Якщо до виклику надається більше аргументів, вони додаються до *args*. Якщо надаються додаткові ключові аргументи, вони розширюють і замінюють *ключові слова*. Приблизно еквівалентно::

source: The :func:`partial` is used for partial function application which "freezes" some portion of a function's arguments and/or keywords resulting in a new object with a simplified signature. For example, :func:`partial` can be used to create a callable that behaves like the :func:`int` function where the *base* argument defaults to two:
uk: :func:`partial` використовується для застосування часткової функції, яка "заморожує" деяку частину аргументів функції та/або ключових слів, у результаті чого створюється новий об’єкт зі спрощеною сигнатурою. Наприклад, :func:`partial` можна використовувати для створення виклику, який поводиться як функція :func:`int`, де аргумент *base* за замовчуванням дорівнює двом:

source: Return a new :class:`partialmethod` descriptor which behaves like :class:`partial` except that it is designed to be used as a method definition rather than being directly callable.
uk: Повертає новий дескриптор :class:`partialmethod`, який поводиться як :class:`partial`, за винятком того, що він призначений для використання як визначення методу, а не для безпосереднього виклику.

source: *func* must be a :term:`descriptor` or a callable (objects which are both, like normal functions, are handled as descriptors).
uk: *func* має бути :term:`descriptor` або викликаним (об’єкти, які, як і звичайні функції, обробляються як дескриптори).

source: When *func* is a descriptor (such as a normal Python function, :func:`classmethod`, :func:`staticmethod`, :func:`abstractmethod` or another instance of :class:`partialmethod`), calls to ``__get__`` are delegated to the underlying descriptor, and an appropriate :ref:`partial object<partial-objects>` returned as the result.
uk: Коли *func* є дескриптором (наприклад, звичайною функцією Python, :func:`classmethod`, :func:`staticmethod`, :func:`abstractmethod` або іншим екземпляром :class:`partialmethod`), викликається ``__get__`` делегуються базовому дескриптору, а в результаті повертається відповідний :ref:`частковий об’єкт <partial-objects>`.

source: When *func* is a non-descriptor callable, an appropriate bound method is created dynamically. This behaves like a normal Python function when used as a method: the *self* argument will be inserted as the first positional argument, even before the *args* and *keywords* supplied to the :class:`partialmethod` constructor.
uk: Коли *func* є недескрипторним викликом, відповідний пов’язаний метод створюється динамічно. Це поводиться як звичайна функція Python, коли використовується як метод: аргумент *self* буде вставлено як перший позиційний аргумент, навіть перед *args* і *keywords*, наданими конструктору :class:`partialmethod`.

source: Apply *function* of two arguments cumulatively to the items of *iterable*, from left to right, so as to reduce the iterable to a single value. For example, ``reduce(lambda x, y: x+y, [1, 2, 3, 4, 5])`` calculates ``((((1+2)+3)+4)+5)``. The left argument, *x*, is the accumulated value and the right argument, *y*, is the update value from the *iterable*. If the optional *initializer* is present, it is placed before the items of the iterable in the calculation, and serves as a default when the iterable is empty. If *initializer* is not given and *iterable* contains only one item, the first item is returned.
uk: Застосуйте *функцію* двох аргументів сукупно до елементів *iterable*, зліва направо, щоб зменшити iterable до одного значення. Наприклад, ``reduce(lambda x, y: x+y, [1, 2, 3, 4, 5])`` обчислює ``((((1+2)+3)+4)+5)``. Лівий аргумент, *x*, — це накопичене значення, а правий аргумент, *y*, — це значення оновлення з *iterable*. Якщо необов’язковий *ініціалізатор* присутній, він розміщується перед елементами об’єкта ітерації в обчисленні та служить за замовчуванням, коли об’єкт ітерації порожній. Якщо *initializer* не вказано, а *iterable* містить лише один елемент, повертається перший елемент.

source: Roughly equivalent to::
uk: Приблизно еквівалентно::

source: See :func:`itertools.accumulate` for an iterator that yields all intermediate values.
uk: Перегляньте :func:`itertools.accumulate` для ітератора, який видає всі проміжні значення.

source: Transform a function into a :term:`single-dispatch <single dispatch>` :term:`generic function`.
uk: Перетворення функції на :term:`single-dispatch <single dispatch>` :term:`generic function`.

source: To define a generic function, decorate it with the ``@singledispatch`` decorator. When defining a function using ``@singledispatch``, note that the dispatch happens on the type of the first argument::
uk: Щоб визначити загальну функцію, прикрасьте її за допомогою декоратора ``@singledispatch``. Визначаючи функцію за допомогою ``@singledispatch``, зауважте, що відправлення відбувається за типом першого аргументу::

source: To add overloaded implementations to the function, use the :func:`register` attribute of the generic function, which can be used as a decorator. For functions annotated with types, the decorator will infer the type of the first argument automatically::
uk: Щоб додати перевантажені реалізації до функції, використовуйте атрибут :func:`register` загальної функції, який можна використовувати як декоратор. Для функцій, анотованих типами, декоратор автоматично визначить тип першого аргументу:

source: For code which doesn't use type annotations, the appropriate type argument can be passed explicitly to the decorator itself::
uk: Для коду, який не використовує анотації типу, відповідний аргумент типу можна явно передати самому декоратору::

source: To enable registering :term:`lambdas<lambda>` and pre-existing functions, the :func:`register` attribute can also be used in a functional form::
uk: Щоб увімкнути реєстрацію :term:`lambdas <lambda>` і вже існуючих функцій, атрибут :func:`register` також можна використовувати у функціональній формі:

source: The :func:`register` attribute returns the undecorated function. This enables decorator stacking, :mod:`pickling<pickle>`, and the creation of unit tests for each variant independently::
uk: Атрибут :func:`register` повертає недекоровану функцію. Це дозволяє стекувати декоратор, :mod:`піклінг <pickle>` і створювати модульні тести для кожного варіанту незалежно:

source: When called, the generic function dispatches on the type of the first argument::
uk: Під час виклику загальна функція надсилає тип першого аргументу::
