Repository: python/python-docs-uk
Catalog: library/getopt.po
Languages: uk

source: :mod:`getopt` --- C-style parser for command line options
uk: :mod:`getopt` --- Парсер у стилі C для параметрів командного рядка

source: **Source code:** :source:`Lib/getopt.py`
uk: **Вихідний код:** :source:`Lib/getopt.py`

source: The :mod:`getopt` module is a parser for command line options whose API is designed to be familiar to users of the C :c:func:`getopt` function. Users who are unfamiliar with the C :c:func:`getopt` function or who would like to write less code and get better help and error messages should consider using the :mod:`argparse` module instead.
uk: Модуль :mod:`getopt` — це синтаксичний аналізатор параметрів командного рядка, API якого розроблений таким чином, щоб бути знайомим користувачам функції C :c:func:`getopt`. Користувачі, які не знайомі з функцією C :c:func:`getopt` або бажають писати менше коду та отримувати кращу допомогу та повідомлення про помилки, повинні розглянути можливість використання замість цього модуля :mod:`argparse`.

source: This module helps scripts to parse the command line arguments in ``sys.argv``. It supports the same conventions as the Unix :c:func:`getopt` function (including the special meanings of arguments of the form '``-``' and '``--``'). Long options similar to those supported by GNU software may be used as well via an optional third argument.
uk: Цей модуль допомагає сценаріям аналізувати аргументи командного рядка в ``sys.argv``. Він підтримує ті самі конвенції, що й функція Unix :c:func:`getopt` (включно зі спеціальними значеннями аргументів у формі ''``-``' і ''``--``'). Довгі параметри, подібні до тих, що підтримуються програмним забезпеченням GNU, також можна використовувати через необов’язковий третій аргумент.

source: This module provides two functions and an exception:
uk: Цей модуль забезпечує дві функції та виняток:

source: Parses command line options and parameter list. *args* is the argument list to be parsed, without the leading reference to the running program. Typically, this means ``sys.argv[1:]``. *shortopts* is the string of option letters that the script wants to recognize, with options that require an argument followed by a colon (``':'``; i.e., the same format that Unix :c:func:`getopt` uses).
uk: Розбирає параметри командного рядка та список параметрів. *args* — це список аргументів, який потрібно проаналізувати, без початкового посилання на запущену програму. Зазвичай це означає ``sys.argv[1:]``. *shortopts* — це рядок літер параметрів, які сценарій хоче розпізнати, з параметрами, які вимагають аргументу, після якого йде двокрапка (``':'``; тобто той самий формат, що і Unix :c:func:`getopt` використовує).

source: Unlike GNU :c:func:`getopt`, after a non-option argument, all further arguments are considered also non-options. This is similar to the way non-GNU Unix systems work.
uk: На відміну від GNU :c:func:`getopt`, після аргументу, що не є опцією, усі подальші аргументи також вважаються не опціями. Це схоже на те, як працюють не-GNU Unix системи.

source: *longopts*, if specified, must be a list of strings with the names of the long options which should be supported. The leading ``'--'`` characters should not be included in the option name. Long options which require an argument should be followed by an equal sign (``'='``). Optional arguments are not supported. To accept only long options, *shortopts* should be an empty string. Long options on the command line can be recognized so long as they provide a prefix of the option name that matches exactly one of the accepted options. For example, if *longopts* is ``['foo', 'frob']``, the option ``--fo`` will match as ``--foo``, but ``--f`` will not match uniquely, so :exc:`GetoptError` will be raised.
uk: *longopts*, якщо вказано, має бути списком рядків із іменами довгих параметрів, які мають підтримуватися. Початкові символи ``''--'`` не повинні включатися в назву опції. Довгі параметри, які потребують аргументу, повинні супроводжуватися знаком рівності (``'='``). Необов'язкові аргументи не підтримуються. Щоб приймати лише довгі варіанти, *shortopts* має бути порожнім рядком. Довгі параметри в командному рядку можна розпізнати, якщо вони містять префікс назви параметра, який точно відповідає одному з прийнятих параметрів. Наприклад, якщо *longopts* є ``['foo', 'frob']``, опція ``--fo`` відповідатиме ``--foo``, але ``--f`` не збігатиметься однозначно, тому буде викликано :exc:`GetoptError`.

source: The return value consists of two elements: the first is a list of ``(option, value)`` pairs; the second is the list of program arguments left after the option list was stripped (this is a trailing slice of *args*). Each option-and-value pair returned has the option as its first element, prefixed with a hyphen for short options (e.g., ``'-x'``) or two hyphens for long options (e.g., ``'--long-option'``), and the option argument as its second element, or an empty string if the option has no argument. The options occur in the list in the same order in which they were found, thus allowing multiple occurrences. Long and short options may be mixed.
uk: Повернене значення складається з двох елементів: перший – це список пар ``(параметр, значення)``; другий — список аргументів програми, що залишився після видалення списку параметрів (це кінцевий фрагмент *args*). Кожна повернута пара параметрів і значень має параметр як перший елемент із префіксом дефіса для коротких варіантів (наприклад, ``'-x''``) або двох дефісів для довгих варіантів (наприклад, ``'--long-option'``), і аргумент параметра як його другий елемент або порожній рядок, якщо параметр не має аргументу. Параметри з’являються в списку в тому самому порядку, в якому вони були знайдені, таким чином допускаючи багатократне повторення. Довгі та короткі варіанти можуть змішуватися.

source: This function works like :func:`getopt`, except that GNU style scanning mode is used by default. This means that option and non-option arguments may be intermixed. The :func:`getopt` function stops processing options as soon as a non-option argument is encountered.
uk: Ця функція працює як :func:`getopt`, за винятком того, що за замовчуванням використовується режим сканування у стилі GNU. Це означає, що аргументи варіантів і неваріантів можуть змішуватися. Функція :func:`getopt` припиняє обробку опцій, щойно зустрічається аргумент, що не є опцією.

source: If the first character of the option string is ``'+'``, or if the environment variable :envvar:`POSIXLY_CORRECT` is set, then option processing stops as soon as a non-option argument is encountered.
uk: Якщо першим символом рядка параметра є ``'+'`` або якщо встановлено змінну середовища :envvar:`POSIXLY_CORRECT`, тоді обробка параметра припиняється, як тільки буде виявлено аргумент, що не є параметром.

source: This is raised when an unrecognized option is found in the argument list or when an option requiring an argument is given none. The argument to the exception is a string indicating the cause of the error. For long options, an argument given to an option which does not require one will also cause this exception to be raised. The attributes :attr:`msg` and :attr:`opt` give the error message and related option; if there is no specific option to which the exception relates, :attr:`opt` is an empty string.
uk: Це виникає, коли в списку аргументів знайдено нерозпізнаний параметр або якщо параметру, який вимагає аргументу, не вказано жодного. Аргументом винятку є рядок, що вказує на причину помилки. Для довгих опцій аргумент, наданий опції, яка його не вимагає, також призведе до виклику цього винятку. Атрибути :attr:`msg` і :attr:`opt` дають повідомлення про помилку та відповідну опцію; якщо немає конкретної опції, до якої відноситься виняток, :attr:`opt` є порожнім рядком.

source: Alias for :exc:`GetoptError`; for backward compatibility.
uk: Псевдонім для :exc:`GetoptError`; для зворотної сумісності.

source: An example using only Unix style options:
uk: Приклад використання лише параметрів стилю Unix:

source: Using long option names is equally easy:
uk: Використовувати довгі назви параметрів так само легко:

source: In a script, typical usage is something like this::
uk: У сценарії типове використання приблизно таке::

source: Note that an equivalent command line interface could be produced with less code and more informative help and error messages by using the :mod:`argparse` module::
uk: Зауважте, що еквівалентний інтерфейс командного рядка можна створити з меншим кодом і більш інформативною довідкою та повідомленнями про помилки за допомогою модуля :mod:`argparse`::

source: Module :mod:`argparse`
uk: Модуль :mod:`argparse`

source: Alternative command line option and argument parsing library.
uk: Альтернативний параметр командного рядка та бібліотека аналізу аргументів.
