Repository: python/python-docs-uk
Catalog: library/gettext.po
Languages: uk

source: :class:`GNUTranslations` parses optional metadata out of the translation catalog. It is convention with GNU :program:`gettext` to include metadata as the translation for the empty string. This metadata is in :rfc:`822`\ -style ``key: value`` pairs, and should contain the ``Project-Id-Version`` key. If the key ``Content-Type`` is found, then the ``charset`` property is used to initialize the "protected" :attr:`_charset` instance variable, defaulting to ``None`` if not found. If the charset encoding is specified, then all message ids and message strings read from the catalog are converted to Unicode using this encoding, else ASCII is assumed.
uk: :class:`GNUTranslations` аналізує додаткові метадані з каталогу перекладів. З GNU :program:`gettext` прийнято включати метадані як переклад порожнього рядка. Ці метадані містяться в стилі :rfc:`822`\ у парах ``ключ: значення`` і мають містити ключ ``Project-Id-Version``. Якщо ключ ``Content-Type`` знайдено, то властивість ``charset`` використовується для ініціалізації "захищеної" змінної екземпляра :attr:`_charset`, за замовчуванням ``None``, якщо не знайдено. Якщо вказано кодування набору символів, усі ідентифікатори повідомлень і рядки повідомлень, прочитані з каталогу, перетворюються на Unicode за допомогою цього кодування, інакше передбачається ASCII.

source: Since message ids are read as Unicode strings too, all :meth:`*gettext` methods will assume message ids as Unicode strings, not byte strings.
uk: Оскільки ідентифікатори повідомлень також читаються як рядки Unicode, усі методи :meth:`*gettext` припускатимуть ідентифікатори повідомлень як рядки Unicode, а не рядки байтів.

source: The entire set of key/value pairs are placed into a dictionary and set as the "protected" :attr:`_info` instance variable.
uk: Увесь набір пар ключ/значення поміщається в словник і встановлюється як "захищена" змінна екземпляра :attr:`_info`.

source: If the :file:`.mo` file's magic number is invalid, the major version number is unexpected, or if other problems occur while reading the file, instantiating a :class:`GNUTranslations` class can raise :exc:`OSError`.
uk: Якщо магічне число файлу :file:`.mo` недійсне, основний номер версії неочікуваний або якщо під час читання файлу виникають інші проблеми, створення екземпляра класу :class:`GNUTranslations` може викликати :exc:`OSError`.

source: The following methods are overridden from the base class implementation:
uk: Наступні методи перевизначені з реалізації базового класу:

source: Look up the *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id, and a fallback has been set, the look up is forwarded to the fallback's :meth:`~NullTranslations.gettext` method. Otherwise, the *message* id is returned.
uk: Знайдіть ідентифікатор *повідомлення* в каталозі та поверніть відповідний рядок повідомлення як рядок Unicode. Якщо в каталозі немає запису для ідентифікатора *message* і встановлено резервний варіант, пошук пересилається до резервного методу :meth:`~NullTranslations.gettext`. В іншому випадку повертається ідентифікатор *повідомлення*.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use. The returned message string is a Unicode string.
uk: Виконайте пошук у формі множини ідентифікатора повідомлення. *singular* використовується як ідентифікатор повідомлення для цілей пошуку в каталозі, тоді як *n* використовується, щоб визначити, яку форму множини використовувати. Повернений рядок повідомлення є рядком Unicode.

source: If the message id is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`~NullTranslations.ngettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
uk: Якщо ідентифікатор повідомлення не знайдено в каталозі та вказано запасний варіант, запит пересилається до резервного методу :meth:`~NullTranslations.ngettext`. В іншому випадку, коли *n* дорівнює 1, повертається *однина*, а *множина* повертається в усіх інших випадках.

source: Here is an example::
uk: Ось приклад::

source: Look up the *context* and *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id and *context*, and a fallback has been set, the look up is forwarded to the fallback's :meth:`pgettext` method. Otherwise, the *message* id is returned.
uk: Знайдіть *контекст* і ідентифікатор *повідомлення* в каталозі та поверніть відповідний рядок повідомлення як рядок Unicode. Якщо в каталозі немає запису для ідентифікатора *повідомлення* та *контексту*, і було встановлено резервний варіант, пошук пересилається до резервного методу :meth:`pgettext`. В іншому випадку повертається ідентифікатор *повідомлення*.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use.
uk: Виконайте пошук у формі множини ідентифікатора повідомлення. *singular* використовується як ідентифікатор повідомлення для цілей пошуку в каталозі, тоді як *n* використовується, щоб визначити, яку форму множини використовувати.

source: If the message id for *context* is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`npgettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
uk: Якщо ідентифікатор повідомлення для *контексту* не знайдено в каталозі, і вказано резервний варіант, запит пересилається на резервний метод :meth:`npgettext`. В іншому випадку, коли *n* дорівнює 1, повертається *однина*, а *множина* повертається в усіх інших випадках.

source: Equivalent to :meth:`.gettext` and :meth:`.ngettext`, but the translation is returned as a byte string encoded in the preferred system encoding if no encoding was explicitly set with :meth:`~NullTranslations.set_output_charset`.
uk: Еквівалент :meth:`.gettext` і :meth:`.ngettext`, але переклад повертається як рядок байтів, закодований у бажаному системному кодуванні, якщо кодування не було явно встановлено за допомогою :meth:`~NullTranslations.set_output_charset`.

source: Solaris message catalog support
uk: Підтримка каталогу повідомлень Solaris

source: The Solaris operating system defines its own binary :file:`.mo` file format, but since no documentation can be found on this format, it is not supported at this time.
uk: Операційна система Solaris визначає власний двійковий формат файлу :file:`.mo`, але оскільки документацію щодо цього формату немає, він наразі не підтримується.

source: The Catalog constructor
uk: Конструктор каталогу

source: GNOME uses a version of the :mod:`gettext` module by James Henstridge, but this version has a slightly different API. Its documented usage was::
uk: GNOME використовує версію модуля :mod:`gettext` від Джеймса Хенстріджа, але ця версія має дещо інший API. Його задокументоване використання:

source: For compatibility with this older module, the function :func:`Catalog` is an alias for the :func:`translation` function described above.
uk: Для сумісності з цим старішим модулем функція :func:`Catalog` є псевдонімом для функції :func:`translation`, описаної вище.

source: One difference between this module and Henstridge's: his catalog objects supported access through a mapping API, but this appears to be unused and so is not currently supported.
uk: Одна відмінність між цим модулем і модулем Хенстріджа: його об’єкти каталогу підтримували доступ через API відображення, але він, здається, не використовується, тому наразі не підтримується.

source: Internationalizing your programs and modules
uk: Інтернаціоналізація ваших програм і модулів

source: Internationalization (I18N) refers to the operation by which a program is made aware of multiple languages. Localization (L10N) refers to the adaptation of your program, once internationalized, to the local language and cultural habits. In order to provide multilingual messages for your Python programs, you need to take the following steps:
uk: Інтернаціоналізація (I18N) відноситься до операції, за допомогою якої програма дізнається про декілька мов. Локалізація (L10N) означає адаптацію вашої програми після її інтернаціоналізації до місцевої мови та культурних звичок. Щоб надати багатомовні повідомлення для своїх програм на Python, потрібно виконати наступні кроки:

source: prepare your program or module by specially marking translatable strings
uk: підготуйте свою програму або модуль, спеціально позначивши рядки для перекладу

source: run a suite of tools over your marked files to generate raw messages catalogs
uk: запустіть набір інструментів над позначеними файлами, щоб створити каталоги необроблених повідомлень

source: create language-specific translations of the message catalogs
uk: створювати переклади каталогів повідомлень на певну мову

source: use the :mod:`gettext` module so that message strings are properly translated
uk: використовуйте модуль :mod:`gettext`, щоб рядки повідомлень були правильно перекладені

source: In order to prepare your code for I18N, you need to look at all the strings in your files. Any string that needs to be translated should be marked by wrapping it in ``_('...')`` --- that is, a call to the function :func:`_`. For example::
uk: Щоб підготувати свій код для I18N, вам потрібно переглянути всі рядки у ваших файлах. Будь-який рядок, який потрібно перекласти, має бути позначений за допомогою ``_('...')`` --- тобто виклику функції :func:`_`. Наприклад::

source: In this example, the string ``'writing a log message'`` is marked as a candidate for translation, while the strings ``'mylog.txt'`` and ``'w'`` are not.
uk: У цьому прикладі рядок "writing a log message" позначено як кандидат на переклад, тоді як рядки "mylog.txt" і "w" — ні.

source: There are a few tools to extract the strings meant for translation. The original GNU :program:`gettext` only supported C or C++ source code but its extended version :program:`xgettext` scans code written in a number of languages, including Python, to find strings marked as translatable. `Babel <http://babel.pocoo.org/>`__ is a Python internationalization library that includes a :file:`pybabel` script to extract and compile message catalogs. François Pinard's program called :program:`xpot` does a similar job and is available as part of his `po-utils package <https://github.com/pinard/po-utils>`__.
uk: Є кілька інструментів для вилучення рядків, призначених для перекладу. Оригінальний GNU :program:`gettext` підтримував лише вихідний код C або C++, але його розширена версія :program:`xgettext` сканує код, написаний кількома мовами, включно з Python, щоб знайти рядки, позначені як перекладні. `Babel <http://babel.pocoo.org/>`__ — це бібліотека інтернаціоналізації Python, яка включає сценарій :file:`pybabel` для вилучення та компіляції каталогів повідомлень. Програма Франсуа Пінарда під назвою :program:`xpot` виконує подібну роботу і доступна як частина його пакета `po-utils <https://github.com/pinard/po-utils>`__.

source: (Python also includes pure-Python versions of these programs, called :program:`pygettext.py` and :program:`msgfmt.py`; some Python distributions will install them for you. :program:`pygettext.py` is similar to :program:`xgettext`, but only understands Python source code and cannot handle other programming languages such as C or C++. :program:`pygettext.py` supports a command-line interface similar to :program:`xgettext`; for details on its use, run ``pygettext.py --help``. :program:`msgfmt.py` is binary compatible with GNU :program:`msgfmt`. With these two programs, you may not need the GNU :program:`gettext` package to internationalize your Python applications.)
uk: (Python також включає версії цих програм на чистому Python, які називаються :program:`pygettext.py` і :program:`msgfmt.py`; деякі дистрибутиви Python встановлять їх для вас. :program:`pygettext.py` схоже до :program:`xgettext`, але розуміє лише вихідний код Python і не може працювати з іншими мовами програмування, такими як C або C++. :program:`pygettext.py` підтримує інтерфейс командного рядка, подібний до :program:`xgettext`; для детальніше про його використання, запустіть ``pygettext.py --help``. :program:`msgfmt.py` бінарно сумісний із GNU :program:`msgfmt`. З цими двома програмами вам може не знадобитися GNU :program:`gettext` пакет для інтернаціоналізації ваших програм Python.)

source: :program:`xgettext`, :program:`pygettext`, and similar tools generate :file:`.po` files that are message catalogs. They are structured human-readable files that contain every marked string in the source code, along with a placeholder for the translated versions of these strings.
uk: :program:`xgettext`, :program:`pygettext` та подібні інструменти створюють файли :file:`.po`, які є каталогами повідомлень. Це структуровані зрозумілі для людини файли, які містять кожен позначений рядок у вихідному коді разом із заповнювачем для перекладених версій цих рядків.

source: Copies of these :file:`.po` files are then handed over to the individual human translators who write translations for every supported natural language. They send back the completed language-specific versions as a :file:`<language-name>.po` file that's compiled into a machine-readable :file:`.mo` binary catalog file using the :program:`msgfmt` program. The :file:`.mo` files are used by the :mod:`gettext` module for the actual translation processing at run-time.
uk: Потім копії цих файлів :file:`.po` передаються окремим перекладачам, які пишуть переклади для кожної підтримуваної природної мови. Вони надсилають назад завершені версії для певної мови у вигляді файлу :file:`<language-name> .po`, який скомпільовано в машиночитаний файл бінарного каталогу :file:`.mo` за допомогою програми :program:`msgfmt`. Файли :file:`.mo` використовуються модулем :mod:`gettext` для фактичної обробки перекладу під час виконання.

source: How you use the :mod:`gettext` module in your code depends on whether you are internationalizing a single module or your entire application. The next two sections will discuss each case.
uk: Те, як ви використовуєте модуль :mod:`gettext` у своєму коді, залежить від того, чи інтернаціоналізуєте ви один модуль чи всю програму. У наступних двох розділах буде розглянуто кожен випадок.

source: Localizing your module
uk: Локалізація вашого модуля

source: If you are localizing your module, you must take care not to make global changes, e.g. to the built-in namespace. You should not use the GNU :program:`gettext` API but instead the class-based API.
uk: Якщо ви локалізуєте свій модуль, ви повинні подбати про те, щоб не вносити глобальних змін, напр. до вбудованого простору імен. Вам слід використовувати не GNU :program:`gettext` API, а замість нього API на основі класів.

source: Let's say your module is called "spam" and the module's various natural language translation :file:`.mo` files reside in :file:`/usr/share/locale` in GNU :program:`gettext` format. Here's what you would put at the top of your module::
uk: Припустімо, що ваш модуль називається "спамом", і різні файли перекладу природної мови модуля :file:`.mo` містяться в :file:`/usr/share/locale` у форматі GNU :program:`gettext`. Ось що ви б розмістили у верхній частині свого модуля:

source: Localizing your application
uk: Локалізація вашої програми

source: If you are localizing your application, you can install the :func:`_` function globally into the built-in namespace, usually in the main driver file of your application. This will let all your application-specific files just use ``_('...')`` without having to explicitly install it in each file.
uk: Якщо ви локалізуєте свою програму, ви можете встановити функцію :func:`_` глобально у вбудований простір імен, як правило, у головний файл драйвера вашої програми. Це дозволить усім вашим файлам програм просто використовувати ``_('...')`` без необхідності явно встановлювати його в кожному файлі.

source: In the simple case then, you need only add the following bit of code to the main driver file of your application::
uk: У простому випадку вам потрібно лише додати наступний біт коду до основного файлу драйвера вашої програми:

source: If you need to set the locale directory, you can pass it into the :func:`install` function::
uk: Якщо вам потрібно встановити каталог локалі, ви можете передати його у функцію :func:`install`::

source: Changing languages on the fly
uk: Зміна мов на льоту

source: If your program needs to support many languages at the same time, you may want to create multiple translation instances and then switch between them explicitly, like so::
uk: Якщо ваша програма повинна підтримувати багато мов одночасно, ви можете створити кілька екземплярів перекладу, а потім явно перемикатися між ними, наприклад:

source: Deferred translations
uk: Відкладені переклади

source: In most coding situations, strings are translated where they are coded. Occasionally however, you need to mark strings for translation, but defer actual translation until later. A classic example is::
uk: У більшості ситуацій кодування рядки перекладаються там, де вони закодовані. Однак інколи вам потрібно позначити рядки для перекладу, але відкласти фактичний переклад на потім. Класичний приклад::

source: Here, you want to mark the strings in the ``animals`` list as being translatable, but you don't actually want to translate them until they are printed.
uk: Тут ви хочете позначити рядки у списку ``animals`` як такі, що можна перекладати, але насправді ви не хочете їх перекладати, поки вони не будуть надруковані.

source: Here is one way you can handle this situation::
uk: Ось один із способів вирішення цієї ситуації:

source: This works because the dummy definition of :func:`_` simply returns the string unchanged. And this dummy definition will temporarily override any definition of :func:`_` in the built-in namespace (until the :keyword:`del` command). Take care, though if you have a previous definition of :func:`_` in the local namespace.
uk: Це працює, оскільки фіктивне визначення :func:`_` просто повертає рядок без змін. І це фіктивне визначення тимчасово замінить будь-яке визначення :func:`_` у вбудованому просторі імен (до команди :keyword:`del`). Проте будьте обережні, якщо у вас є попереднє визначення :func:`_` у локальному просторі імен.

source: Note that the second use of :func:`_` will not identify "a" as being translatable to the :program:`gettext` program, because the parameter is not a string literal.
uk: Зауважте, що друге використання :func:`_` не ідентифікуватиме "a" як таке, що можна перекласти в програму :program:`gettext`, оскільки параметр не є рядковим літералом.

source: Another way to handle this is with the following example::
uk: Ще один спосіб вирішити це за допомогою наступного прикладу::

source: In this case, you are marking translatable strings with the function :func:`N_`, which won't conflict with any definition of :func:`_`. However, you will need to teach your message extraction program to look for translatable strings marked with :func:`N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract``, and :program:`xpot` all support this through the use of the :option:`!-k` command-line switch. The choice of :func:`N_` here is totally arbitrary; it could have just as easily been :func:`MarkThisStringForTranslation`.
uk: У цьому випадку ви позначаєте рядки, які можна перекладати, за допомогою функції :func:`N_`, яка не конфліктуватиме з жодним визначенням :func:`_`. Однак вам потрібно буде навчити вашу програму вилучення повідомлень шукати рядки, які можна перекладати, позначені :func:`N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract`` і :program:`xpot` підтримують це за допомогою перемикача командного рядка :option:`!-k`. Вибір :func:`N_` тут абсолютно довільний; це так само легко могло бути :func:`MarkThisStringForTranslation`.

source: Acknowledgements
uk: Подяки

source: The following people contributed code, feedback, design suggestions, previous implementations, and valuable experience to the creation of this module:
uk: Наступні люди надали код, відгуки, пропозиції щодо дизайну, попередні реалізації та цінний досвід для створення цього модуля:

source: Peter Funk
uk: Пітер Функ

source: James Henstridge
uk: Джеймс Хенстрідж

source: Juan David Ibáñez Palomar
uk: Хуан Давид Ібаньес Паломар

source: Marc-André Lemburg
uk: Марк-Андре Лембург

source: Martin von Löwis
uk: Мартін фон Льовіс

source: François Pinard
uk: Франсуа Пінар

source: Barry Warsaw
uk: Баррі Варшава

source: Gustavo Niemeyer
uk: Густаво Німейєр

source: Footnotes
uk: Виноски

source: The default locale directory is system dependent; for example, on RedHat Linux it is :file:`/usr/share/locale`, but on Solaris it is :file:`/usr/lib/locale`. The :mod:`gettext` module does not try to support these system dependent defaults; instead its default is :file:`{sys.base_prefix}/share/locale` (see :data:`sys.base_prefix`). For this reason, it is always best to call :func:`bindtextdomain` with an explicit absolute path at the start of your application.
uk: Стандартний каталог локалі залежить від системи; наприклад, у RedHat Linux це :file:`/usr/share/locale`, а в Solaris це :file:`/usr/lib/locale`. Модуль :mod:`gettext` не намагається підтримувати ці залежні від системи параметри за замовчуванням; натомість за замовчуванням :file:`{sys.base_prefix}/share/locale` (див. :data:`sys.base_prefix`). З цієї причини завжди краще викликати :func:`bindtextdomain` з явним абсолютним шляхом на початку вашої програми.

source: See the footnote for :func:`bindtextdomain` above.
uk: Див. виноску для :func:`bindtextdomain` вище.
