Repository: python/python-docs-uk
Catalog: library/gettext.po
Languages: uk

source: :mod:`gettext` --- Multilingual internationalization services
uk: :mod:`gettext` --- Багатомовні послуги інтернаціоналізації

source: **Source code:** :source:`Lib/gettext.py`
uk: **Вихідний код:** :source:`Lib/gettext.py`

source: The :mod:`gettext` module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. It supports both the GNU :program:`gettext` message catalog API and a higher level, class-based API that may be more appropriate for Python files. The interface described below allows you to write your module and application messages in one natural language, and provide a catalog of translated messages for running under different natural languages.
uk: Модуль :mod:`gettext` надає служби інтернаціоналізації (I18N) і локалізації (L10N) для ваших модулів і програм Python. Він підтримує як API каталогу повідомлень GNU :program:`gettext`, так і API вищого рівня на основі класів, який може бути більш відповідним для файлів Python. Інтерфейс, описаний нижче, дозволяє вам писати повідомлення модуля та додатка однією природною мовою та надавати каталог перекладених повідомлень для роботи на різних природних мовах.

source: Some hints on localizing your Python modules and applications are also given.
uk: Також подано деякі підказки щодо локалізації ваших модулів і програм Python.

source: The :mod:`gettext` module defines the following API, which is very similar to the GNU :program:`gettext` API. If you use this API you will affect the translation of your entire application globally. Often this is what you want if your application is monolingual, with the choice of language dependent on the locale of your user. If you are localizing a Python module, or if your application needs to switch languages on the fly, you probably want to use the class-based API instead.
uk: Модуль :mod:`gettext` визначає наступний API, який дуже схожий на GNU :program:`gettext` API. Якщо ви використовуєте цей API, ви вплинете на глобальний переклад усієї вашої програми. Часто це те, що вам потрібно, якщо ваша програма є одномовною, а вибір мови залежить від локалі вашого користувача. Якщо ви локалізуєте модуль Python або якщо вашій програмі потрібно миттєво перемикати мови, ви, ймовірно, захочете замість цього використовувати API на основі класів.

source: Bind the *domain* to the locale directory *localedir*. More concretely, :mod:`gettext` will look for binary :file:`.mo` files for the given domain using the path (on Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, where *language* is searched for in the environment variables :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG` respectively.
uk: Прив’яжіть *домен* до каталогу локалі *localedir*. Точніше, :mod:`gettext` шукатиме двійкові файли :file:`.mo` для вказаного домену за шляхом (в Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain} .mo`, де *мова* шукається в змінних середовища :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` та :envvar:`LANG` відповідно.

source: If *localedir* is omitted or ``None``, then the current binding for *domain* is returned. [#]_
uk: Якщо *localedir* пропущено або ``None``, повертається поточне прив’язування для *domain*. [#]_

source: Bind the *domain* to *codeset*, changing the encoding of byte strings returned by the :func:`lgettext`, :func:`ldgettext`, :func:`lngettext` and :func:`ldngettext` functions. If *codeset* is omitted, then the current binding is returned.
uk: Прив’яжіть *домен* до *codeset*, змінюючи кодування рядків байтів, що повертаються функціями :func:`lgettext`, :func:`ldgettext`, :func:`lngettext` і :func:`ldngettext`. Якщо *codeset* опущено, повертається поточне зв’язування.

source: Change or query the current global domain. If *domain* is ``None``, then the current global domain is returned, otherwise the global domain is set to *domain*, which is returned.
uk: Змініть або запитайте поточний глобальний домен. Якщо *domain* має значення ``None``, тоді повертається поточний глобальний домен, інакше глобальний домен встановлюється на *domain*, який повертається.

source: Return the localized translation of *message*, based on the current global domain, language, and locale directory. This function is usually aliased as :func:`_` in the local namespace (see examples below).
uk: Повертає локалізований переклад *message* на основі поточного глобального домену, мови та каталогу локалі. Ця функція зазвичай має псевдонім :func:`_` у локальному просторі імен (див. приклади нижче).

source: Like :func:`.gettext`, but look the message up in the specified *domain*.
uk: Як :func:`.gettext`, але шукайте повідомлення у вказаному *доміні*.

source: Like :func:`.gettext`, but consider plural forms. If a translation is found, apply the plural formula to *n*, and return the resulting message (some languages have more than two plural forms). If no translation is found, return *singular* if *n* is 1; return *plural* otherwise.
uk: Як :func:`.gettext`, але враховуйте форми множини. Якщо переклад знайдено, застосуйте формулу множини до *n* та поверніть отримане повідомлення (деякі мови мають більше двох форм множини). Якщо переклад не знайдено, поверніть *singular*, якщо *n* дорівнює 1; повернути *множину* інакше.

source: The Plural formula is taken from the catalog header. It is a C or Python expression that has a free variable *n*; the expression evaluates to the index of the plural in the catalog. See `the GNU gettext documentation <https://www.gnu.org/software/gettext/manual/gettext.html>`__ for the precise syntax to be used in :file:`.po` files and the formulas for a variety of languages.
uk: Формула множини взята із заголовка каталогу. Це вираз C або Python, який має вільну змінну *n*; вираз обчислюється відповідно до індексу множини в каталозі. Перегляньте `документацію GNU gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`__ для точного синтаксису, який буде використовуватися у файлах :file:`.po` та формул для різних мов.

source: Like :func:`ngettext`, but look the message up in the specified *domain*.
uk: Як :func:`ngettext`, але шукайте повідомлення у вказаному *доміні*.

source: Similar to the corresponding functions without the ``p`` in the prefix (that is, :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), but the translation is restricted to the given message *context*.
uk: Подібно до відповідних функцій без ``p`` у префіксі (тобто :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), але переклад обмежено даним *контекстом* повідомлення.

source: Equivalent to the corresponding functions without the ``l`` prefix (:func:`.gettext`, :func:`dgettext`, :func:`ngettext` and :func:`dngettext`), but the translation is returned as a byte string encoded in the preferred system encoding if no other encoding was explicitly set with :func:`bind_textdomain_codeset`.
uk: Еквівалент відповідних функцій без префікса ``l`` (:func:`.gettext`, :func:`dgettext`, :func:`ngettext` і :func:`dngettext`), але переклад повертається як рядок байтів, закодований у бажаному системному кодуванні, якщо інше кодування не було явно встановлено за допомогою :func:`bind_textdomain_codeset`.

source: These functions should be avoided in Python 3, because they return encoded bytes. It's much better to use alternatives which return Unicode strings instead, since most Python applications will want to manipulate human readable text as strings instead of bytes. Further, it's possible that you may get unexpected Unicode-related exceptions if there are encoding problems with the translated strings.
uk: У Python 3 слід уникати цих функцій, оскільки вони повертають закодовані байти. Набагато краще використовувати альтернативи, які повертають натомість рядки Unicode, оскільки більшість програм Python захочуть маніпулювати зрозумілим людині текстом як рядки замість байтів. Крім того, ви можете отримати несподівані винятки, пов’язані з Unicode, якщо є проблеми з кодуванням перекладених рядків.

source: Note that GNU :program:`gettext` also defines a :func:`dcgettext` method, but this was deemed not useful and so it is currently unimplemented.
uk: Зауважте, що GNU :program:`gettext` також визначає метод :func:`dcgettext`, але це було визнано некорисним, тому наразі його не реалізовано.

source: Here's an example of typical usage for this API::
uk: Ось приклад типового використання цього API:

source: Class-based API
uk: API на основі класів

source: The class-based API of the :mod:`gettext` module gives you more flexibility and greater convenience than the GNU :program:`gettext` API. It is the recommended way of localizing your Python applications and modules. :mod:`!gettext` defines a :class:`GNUTranslations` class which implements the parsing of GNU :file:`.mo` format files, and has methods for returning strings. Instances of this class can also install themselves in the built-in namespace as the function :func:`_`.
uk: Базований на класі API модуля :mod:`gettext` надає вам більшу гнучкість і більшу зручність, ніж GNU :program:`gettext` API. Це рекомендований спосіб локалізації програм і модулів Python. :mod:`!gettext` визначає клас :class:`GNUTranslations`, який реалізує аналіз файлів формату GNU :file:`.mo` і має методи для повернення рядків. Екземпляри цього класу також можуть встановлюватися у вбудований простір імен як функція :func:`_`.

source: This function implements the standard :file:`.mo` file search algorithm. It takes a *domain*, identical to what :func:`textdomain` takes. Optional *localedir* is as in :func:`bindtextdomain`. Optional *languages* is a list of strings, where each string is a language code.
uk: Ця функція реалізує стандартний алгоритм пошуку файлів :file:`.mo`. Для цього потрібно *домен*, ідентичний тому, що приймає :func:`textdomain`. Необов’язковий *localedir* такий, як у :func:`bindtextdomain`. Необов’язкові *мови* – це список рядків, де кожен рядок є кодом мови.

source: If *localedir* is not given, then the default system locale directory is used. [#]_ If *languages* is not given, then the following environment variables are searched: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG`. The first one returning a non-empty value is used for the *languages* variable. The environment variables should contain a colon separated list of languages, which will be split on the colon to produce the expected list of language code strings.
uk: Якщо *localedir* не вказано, використовується каталог локалі системи за замовчуванням. [#]_ Якщо *мови* не вказано, шукаються такі змінні середовища: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` і :envvar:`LANG`. Перше, що повертає непорожнє значення, використовується для змінної *languages*. Змінні середовища мають містити розділений двокрапкою список мов, який буде розділено на двокрапку для створення очікуваного списку рядків коду мови.

source: :func:`find` then expands and normalizes the languages, and then iterates through them, searching for an existing file built of these components:
uk: :func:`find` потім розширює та нормалізує мови, а потім перебирає їх, шукаючи існуючий файл, створений із цих компонентів:

source: The first such file name that exists is returned by :func:`find`. If no such file is found, then ``None`` is returned. If *all* is given, it returns a list of all file names, in the order in which they appear in the languages list or the environment variables.
uk: Перше таке ім’я файлу, яке існує, повертається :func:`find`. Якщо такий файл не знайдено, повертається ``None``. Якщо задано *all*, повертається список усіх імен файлів у порядку, у якому вони з’являються у списку мов або змінних середовища.

source: Return a :class:`*Translations` instance based on the *domain*, *localedir*, and *languages*, which are first passed to :func:`find` to get a list of the associated :file:`.mo` file paths. Instances with identical :file:`.mo` file names are cached. The actual class instantiated is *class_* if provided, otherwise :class:`GNUTranslations`. The class's constructor must take a single :term:`file object` argument. If provided, *codeset* will change the charset used to encode translated strings in the :meth:`~NullTranslations.lgettext` and :meth:`~NullTranslations.lngettext` methods.
uk: Повертає екземпляр :class:`*Translations` на основі *domain*, *localedir* і *languages*, які спочатку передаються в :func:`find`, щоб отримати список пов’язаних :file:`.mo` шляхи до файлів. Екземпляри з ідентичними іменами файлів :file:`.mo` зберігаються в кеші. Фактичний екземпляр класу є *class_*, якщо він надається, інакше :class:`GNUTranslations`. Конструктор класу повинен приймати один аргумент :term:`file object`. Якщо надано, *codeset* змінить набір символів, який використовується для кодування перекладених рядків у методах :meth:`~NullTranslations.lgettext` і :meth:`~NullTranslations.lngettext`.

source: If multiple files are found, later files are used as fallbacks for earlier ones. To allow setting the fallback, :func:`copy.copy` is used to clone each translation object from the cache; the actual instance data is still shared with the cache.
uk: Якщо знайдено декілька файлів, пізніші файли використовуються як запасні для попередніх. Щоб дозволити встановлення запасного варіанта, :func:`copy.copy` використовується для клонування кожного об’єкта перекладу з кешу; фактичні дані екземпляра все ще використовуються в кеші.

source: If no :file:`.mo` file is found, this function raises :exc:`OSError` if *fallback* is false (which is the default), and returns a :class:`NullTranslations` instance if *fallback* is true.
uk: Якщо файл :file:`.mo` не знайдено, ця функція викликає :exc:`OSError`, якщо *fallback* має значення false (що є типовим), і повертає екземпляр :class:`NullTranslations`, якщо *fallback* є правда.

source: :exc:`IOError` used to be raised instead of :exc:`OSError`.
uk: Раніше викликалося :exc:`IOError` замість :exc:`OSError`.

source: The *codeset* parameter.
uk: Параметр *codeset*.

source: This installs the function :func:`_` in Python's builtins namespace, based on *domain*, *localedir*, and *codeset* which are passed to the function :func:`translation`.
uk: Це встановлює функцію :func:`_` у вбудованому просторі імен Python на основі *domain*, *localedir* і *codeset*, які передаються до функції :func:`translation`.

source: For the *names* parameter, please see the description of the translation object's :meth:`~NullTranslations.install` method.
uk: Для параметра *names* див. опис методу :meth:`~NullTranslations.install` об’єкта перекладу.

source: As seen below, you usually mark the strings in your application that are candidates for translation, by wrapping them in a call to the :func:`_` function, like this::
uk: Як показано нижче, ви зазвичай позначаєте рядки у своїй програмі, які є кандидатами на переклад, загортаючи їх у виклик функції :func:`_`, ось так::

source: For convenience, you want the :func:`_` function to be installed in Python's builtins namespace, so it is easily accessible in all modules of your application.
uk: Для зручності ви хочете, щоб функція :func:`_` була встановлена у вбудованому просторі імен Python, щоб вона була легко доступна в усіх модулях вашої програми.

source: The :class:`NullTranslations` class
uk: Клас :class:`NullTranslations`

source: Translation classes are what actually implement the translation of original source file message strings to translated message strings. The base class used by all translation classes is :class:`NullTranslations`; this provides the basic interface you can use to write your own specialized translation classes. Here are the methods of :class:`!NullTranslations`:
uk: Класи перекладу — це те, що фактично реалізує переклад рядків повідомлень вихідного файлу в перекладені рядки повідомлень. Базовим класом, який використовується всіма класами перекладу, є :class:`NullTranslations`; це забезпечує базовий інтерфейс, який можна використовувати для написання власних спеціалізованих класів перекладу. Ось методи :class:`!NullTranslations`:

source: Takes an optional :term:`file object` *fp*, which is ignored by the base class. Initializes "protected" instance variables *_info* and *_charset* which are set by derived classes, as well as *_fallback*, which is set through :meth:`add_fallback`. It then calls ``self._parse(fp)`` if *fp* is not ``None``.
uk: Приймає необов’язковий :term:`file object` *fp*, який ігнорується базовим класом. Ініціалізує "захищені" змінні екземпляра *_info* та *_charset*, які встановлюються похідними класами, а також *_fallback*, який встановлюється через :meth:`add_fallback`. Потім він викликає ``self._parse(fp)``, якщо *fp* не є ``None``.

source: No-op in the base class, this method takes file object *fp*, and reads the data from the file, initializing its message catalog. If you have an unsupported message catalog file format, you should override this method to parse your format.
uk: No-op у базовому класі, цей метод бере файловий об’єкт *fp* і читає дані з файлу, ініціалізуючи його каталог повідомлень. Якщо у вас є непідтримуваний формат файлу каталогу повідомлень, вам слід замінити цей метод для аналізу вашого формату.

source: Add *fallback* as the fallback object for the current translation object. A translation object should consult the fallback if it cannot provide a translation for a given message.
uk: Додайте *резервний* як резервний об’єкт для поточного об’єкта перекладу. Об’єкт перекладу має звернутися до резервного варіанту, якщо він не може надати переклад для даного повідомлення.

source: If a fallback has been set, forward :meth:`!gettext` to the fallback. Otherwise, return *message*. Overridden in derived classes.
uk: Якщо встановлено запасний варіант, перешліть :meth:`!gettext` на резервний варіант. В іншому випадку поверніть *повідомлення*. Перевизначено в похідних класах.

source: If a fallback has been set, forward :meth:`!ngettext` to the fallback. Otherwise, return *singular* if *n* is 1; return *plural* otherwise. Overridden in derived classes.
uk: Якщо встановлено запасний варіант, перешліть :meth:`!ngettext` до резервного варіанту. В іншому випадку поверніть *singular*, якщо *n* дорівнює 1; повернути *множину* інакше. Перевизначено в похідних класах.

source: If a fallback has been set, forward :meth:`pgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
uk: Якщо встановлено запасний варіант, перешліть :meth:`pgettext` на резервний варіант. В іншому випадку поверніть перекладене повідомлення. Перевизначено в похідних класах.

source: If a fallback has been set, forward :meth:`npgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
uk: Якщо встановлено запасний варіант, перешліть :meth:`npgettext` резервному варіанту. В іншому випадку поверніть перекладене повідомлення. Перевизначено в похідних класах.

source: Equivalent to :meth:`.gettext` and :meth:`.ngettext`, but the translation is returned as a byte string encoded in the preferred system encoding if no encoding was explicitly set with :meth:`set_output_charset`. Overridden in derived classes.
uk: Еквівалент :meth:`.gettext` і :meth:`.ngettext`, але переклад повертається як рядок байтів, закодований у бажаному системному кодуванні, якщо кодування не було явно встановлено за допомогою :meth:`set_output_charset`. Перевизначено в похідних класах.

source: These methods should be avoided in Python 3. See the warning for the :func:`lgettext` function.
uk: Слід уникати цих методів у Python 3. Перегляньте попередження для функції :func:`lgettext`.

source: Return the "protected" :attr:`_info` variable, a dictionary containing the metadata found in the message catalog file.
uk: Повертає "захищену" змінну :attr:`_info`, словник, що містить метадані, знайдені у файлі каталогу повідомлень.

source: Return the encoding of the message catalog file.
uk: Повернути кодування файлу каталогу повідомлень.

source: Return the encoding used to return translated messages in :meth:`.lgettext` and :meth:`.lngettext`.
uk: Повертає кодування, яке використовується для повернення перекладених повідомлень у :meth:`.lgettext` і :meth:`.lngettext`.

source: Change the encoding used to return translated messages.
uk: Змініть кодування, яке використовується для повернення перекладених повідомлень.

source: This method installs :meth:`.gettext` into the built-in namespace, binding it to ``_``.
uk: Цей метод встановлює :meth:`.gettext` у вбудований простір імен, прив’язуючи його до ``_``.

source: If the *names* parameter is given, it must be a sequence containing the names of functions you want to install in the builtins namespace in addition to :func:`_`. Supported names are ``'gettext'``, ``'ngettext'``, ``'pgettext'``, ``'npgettext'``, ``'lgettext'``, and ``'lngettext'``.
uk: Якщо вказано параметр *names*, це має бути послідовність, що містить імена функцій, які ви хочете встановити у вбудованому просторі імен на додаток до :func:`_`. Підтримувані імена: ``'gettext'``, ``'ngettext'``, ``'pgettext'``, ``'npgettext'``, ``'lgettext'`` і ``'lngettext'``.

source: Note that this is only one way, albeit the most convenient way, to make the :func:`_` function available to your application. Because it affects the entire application globally, and specifically the built-in namespace, localized modules should never install :func:`_`. Instead, they should use this code to make :func:`_` available to their module::
uk: Зауважте, що це лише один із способів, хоча й найзручніший, зробити функцію :func:`_` доступною для вашої програми. Оскільки це впливає на всю програму глобально, і зокрема на вбудований простір імен, локалізовані модулі ніколи не слід встановлювати :func:`_`. Натомість вони повинні використовувати цей код, щоб зробити :func:`_` доступним для свого модуля::

source: This puts :func:`_` only in the module's global namespace and so only affects calls within this module.
uk: Це поміщає :func:`_` лише в глобальний простір імен модуля, і тому впливає лише на виклики в цьому модулі.

source: Added ``'pgettext'`` and ``'npgettext'``.
uk: Додано ``'pgettext'`` і ``'npgettext'``.

source: The :class:`GNUTranslations` class
uk: Клас :class:`GNUTranslations`

source: The :mod:`gettext` module provides one additional class derived from :class:`NullTranslations`: :class:`GNUTranslations`. This class overrides :meth:`_parse` to enable reading GNU :program:`gettext` format :file:`.mo` files in both big-endian and little-endian format.
uk: Модуль :mod:`gettext` надає один додатковий клас, похідний від :class:`NullTranslations`: :class:`GNUTranslations`. Цей клас замінює :meth:`_parse`, щоб увімкнути читання файлів у форматі GNU :program:`gettext` :file:`.mo` у форматі big-endian і little-endian.
