Repository: python/python-docs-uk
Catalog: library/gzip.po
Languages: uk

source: **Source code:** :source:`Lib/gzip.py`
uk: **Вихідний код:** :source:`Lib/gzip.py`

source: This module provides a simple interface to compress and decompress files just like the GNU programs :program:`gzip` and :program:`gunzip` would.
uk: Цей модуль надає простий інтерфейс для стиснення та розпакування файлів, як це робили б програми GNU :program:`gzip` і :program:`gunzip`.

source: The data compression is provided by the :mod:`zlib` module.
uk: Стиснення даних забезпечується модулем :mod:`zlib`.

source: The :mod:`gzip` module provides the :class:`GzipFile` class, as well as the :func:`.open`, :func:`compress` and :func:`decompress` convenience functions. The :class:`GzipFile` class reads and writes :program:`gzip`\ -format files, automatically compressing or decompressing the data so that it looks like an ordinary :term:`file object`.
uk: Модуль :mod:`gzip` забезпечує клас :class:`GzipFile`, а також :func:`.open`, :func:`compress` і :func:`decompress` зручні функції. Клас :class:`GzipFile` читає та записує файли у форматі :program:`gzip`\, автоматично стискаючи або розпаковуючи дані, щоб вони виглядали як звичайний :term:`file object`.

source: Note that additional file formats which can be decompressed by the :program:`gzip` and :program:`gunzip` programs, such as those produced by :program:`compress` and :program:`pack`, are not supported by this module.
uk: Зауважте, що додаткові формати файлів, які можна розпакувати програмами :program:`gzip` і :program:`gunzip`, наприклад ті, створені :program:`compress` і :program:`pack`, не підтримуються цим модуль.

source: The module defines the following items:
uk: Модуль визначає такі елементи:

source: Open a gzip-compressed file in binary or text mode, returning a :term:`file object`.
uk: Відкрийте файл, стиснутий gzip, у двійковому або текстовому режимі, повертаючи :term:`file object`.

source: The *filename* argument can be an actual filename (a :class:`str` or :class:`bytes` object), or an existing file object to read from or write to.
uk: Аргументом *filename* може бути фактичне ім’я файлу (об’єкт :class:`str` або :class:`bytes`) або наявний файловий об’єкт для читання або запису.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'`` or ``'xb'`` for binary mode, or ``'rt'``, ``'at'``, ``'wt'``, or ``'xt'`` for text mode. The default is ``'rb'``.
uk: Аргумент *mode* може бути будь-яким із ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'`` або ``'xb'`` для бінарного режиму або ``'rt'``, ``'at'``, ``'wt'`` або ``'xt''`` для текстового режиму. Типовим є ``'rb'``.

source: The *compresslevel* argument is an integer from 0 to 9, as for the :class:`GzipFile` constructor.
uk: Аргумент *compresslevel* є цілим числом від 0 до 9, як і для конструктора :class:`GzipFile`.

source: For binary mode, this function is equivalent to the :class:`GzipFile` constructor: ``GzipFile(filename, mode, compresslevel)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
uk: Для бінарного режиму ця функція еквівалентна конструктору :class:`GzipFile`: ``GzipFile(filename, mode, compresslevel)``. У цьому випадку аргументи *encoding*, *errors* і *newline* не повинні надаватися.

source: For text mode, a :class:`GzipFile` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
uk: Для текстового режиму створюється об’єкт :class:`GzipFile`, який загортається в екземпляр :class:`io.TextIOWrapper` із вказаним кодуванням, поведінкою обробки помилок і закінченнями рядків.

source: Added support for *filename* being a file object, support for text mode, and the *encoding*, *errors* and *newline* arguments.
uk: Додано підтримку того, що *ім’я файлу* є об’єктом файлу, підтримується текстовий режим, а також аргументи *кодування*, *помилки* та *новий рядок*.

source: Added support for the ``'x'``, ``'xb'`` and ``'xt'`` modes.
uk: Додано підтримку режимів ``'x'``, ``'xb'`` і ``'xt'``.

source: Accepts a :term:`path-like object`.
uk: Приймає :term:`path-like object`.

source: The new class instance is based on *fileobj*, which can be a regular file, an :class:`io.BytesIO` object, or any other object which simulates a file. It defaults to ``None``, in which case *filename* is opened to provide a file object.
uk: Новий екземпляр класу базується на *fileobj*, який може бути звичайним файлом, об’єктом :class:`io.BytesIO` або будь-яким іншим об’єктом, який імітує файл. За замовчуванням встановлено ``None``, у цьому випадку *ім’я_файлу* відкривається, щоб надати об’єкт файлу.

source: When *fileobj* is not ``None``, the *filename* argument is only used to be included in the :program:`gzip` file header, which may include the original filename of the uncompressed file. It defaults to the filename of *fileobj*, if discernible; otherwise, it defaults to the empty string, and in this case the original filename is not included in the header.
uk: Якщо *fileobj* не є ``None``, аргумент *filename* використовується лише для включення в заголовок файлу :program:`gzip`, який може містити оригінальну назву нестисненого файлу. За замовчуванням ім’я файлу *fileobj*, якщо воно помітне; інакше за замовчуванням буде порожній рядок, і в цьому випадку оригінальна назва файлу не буде включена в заголовок.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'``, or ``'xb'``, depending on whether the file will be read or written. The default is the mode of *fileobj* if discernible; otherwise, the default is ``'rb'``. In future Python releases the mode of *fileobj* will not be used. It is better to always specify *mode* for writing.
uk: Аргумент *mode* може бути будь-яким із ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'`` або ``'xb'``, залежно від того, чи буде файл читатися чи записуватися. Типовим є режим *fileobj*, якщо він помітний; інакше за замовчуванням буде ``'rb'``. У майбутніх випусках Python режим *fileobj* не використовуватиметься. Краще завжди вказувати *режим* для запису.

source: Note that the file is always opened in binary mode. To open a compressed file in text mode, use :func:`.open` (or wrap your :class:`GzipFile` with an :class:`io.TextIOWrapper`).
uk: Зауважте, що файл завжди відкривається у двійковому режимі. Щоб відкрити стислий файл у текстовому режимі, використовуйте :func:`.open` (або загорніть свій :class:`GzipFile` у :class:`io.TextIOWrapper`).

source: The *compresslevel* argument is an integer from ``0`` to ``9`` controlling the level of compression; ``1`` is fastest and produces the least compression, and ``9`` is slowest and produces the most compression. ``0`` is no compression. The default is ``9``.
uk: Аргумент *compresslevel* є цілим числом від ``0`` до ``9``, що контролює рівень стиснення; ``1`` є найшвидшим і забезпечує найменше стиснення, а ``9`` є найповільнішим і забезпечує найбільше стиснення. ``0`` не стискає. Типовим значенням є ``9``.

source: :class:`GzipFile` also provides the following method and attribute:
uk: :class:`GzipFile` також надає наступний метод і атрибут:

source: While calling :meth:`peek` does not change the file position of the :class:`GzipFile`, it may change the position of the underlying file object (e.g. if the :class:`GzipFile` was constructed with the *fileobj* parameter).
uk: Хоча виклик :meth:`peek` не змінює позицію файлу :class:`GzipFile`, він може змінити позицію основного файлового об’єкта (наприклад, якщо :class:`GzipFile` було створено за допомогою *fileobj* параметр).

source: Support for the :keyword:`with` statement was added, along with the *mtime* constructor argument and :attr:`mtime` attribute.
uk: Додано підтримку оператора :keyword:`with` разом з аргументом конструктора *mtime* і атрибутом :attr:`mtime`.

source: Support for zero-padded and unseekable files was added.
uk: Було додано підтримку файлів із нульовою підкладкою та файлів, які неможливо знайти.

source: The :meth:`io.BufferedIOBase.read1` method is now implemented.
uk: Метод :meth:`io.BufferedIOBase.read1` тепер реалізовано.

source: Added support for the ``'x'`` and ``'xb'`` modes.
uk: Додано підтримку режимів ``'x'`` і ``'xb'``.

source: Added support for writing arbitrary :term:`bytes-like objects <bytes-like object>`. The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
uk: Додано підтримку запису довільних :term:`байт-подібних об’єктів <bytes-like object>`. Метод :meth:`~io.BufferedIOBase.read` тепер приймає аргумент ``None``.

source: Opening :class:`GzipFile` for writing without specifying the *mode* argument is deprecated.
uk: Відкриття :class:`GzipFile` для запису без вказівки аргументу *mode* застаріло.

source: Added the *mtime* parameter for reproducible output.
uk: Додано параметр *mtime* для відтворюваного виведення.

source: Examples of usage
uk: Приклади вживання

source: Example of how to read a compressed file::
uk: Приклад читання стисненого файлу::

source: Example of how to create a compressed GZIP file::
uk: Приклад створення стисненого файлу GZIP::

source: Example of how to GZIP compress an existing file::
uk: Приклад того, як GZIP стиснути існуючий файл::

source: Example of how to GZIP compress a binary string::
uk: Приклад того, як GZIP стиснути двійковий рядок::

source: Module :mod:`zlib`
uk: Модуль :mod:`zlib`

source: The basic data compression module needed to support the :program:`gzip` file format.
uk: Базовий модуль стиснення даних, необхідний для підтримки формату файлу :program:`gzip`.

source: Command Line Interface
uk: Інтерфейс командного рядка

source: The :mod:`gzip` module provides a simple command line interface to compress or decompress files.
uk: Модуль :mod:`gzip` забезпечує простий інтерфейс командного рядка для стиснення або розпакування файлів.

source: Once executed the :mod:`gzip` module keeps the input file(s).
uk: Після виконання модуль :mod:`gzip` зберігає вхідні файли.

source: Add a new command line interface with a usage. By default, when you will execute the CLI, the default compression level is 6.
uk: Додайте новий інтерфейс командного рядка з використанням. За замовчуванням, коли ви будете виконувати CLI, рівень стиснення за замовчуванням становить 6.

source: Command line options
uk: Параметри командного рядка

source: Indicates the fastest compression method (less compression).
uk: Вказує найшвидший метод стиснення (з меншим стисненням).

source: Indicates the slowest compression method (best compression).
uk: Вказує найповільніший метод стиснення (найкраще стиснення).

source: Decompress the given file.
uk: Розпакуйте вказаний файл.

source: Show the help message.
uk: Показати довідкове повідомлення.
