Repository: python/python-docs-uk
Catalog: library/hmac.po
Languages: uk

source: :mod:`hmac` --- Keyed-Hashing for Message Authentication
uk: :mod:`hmac` --- Ключове хешування для автентифікації повідомлень

source: **Source code:** :source:`Lib/hmac.py`
uk: **Вихідний код:** :source:`Lib/hmac.py`

source: This module implements the HMAC algorithm as described by :rfc:`2104`.
uk: Цей модуль реалізує алгоритм HMAC, як описано в :rfc:`2104`.

source: Return a new hmac object. *key* is a bytes or bytearray object giving the secret key. If *msg* is present, the method call ``update(msg)`` is made. *digestmod* is the digest name, digest constructor or module for the HMAC object to use. It may be any name suitable to :func:`hashlib.new`. Despite its argument position, it is required.
uk: Повернути новий об’єкт hmac. *key* — це об’єкт bytes або bytearray, що надає секретний ключ. Якщо присутній *msg*, виконується виклик методу ``update(msg)``. *digestmod* — назва дайджесту, конструктор дайджесту або модуль для використання об’єктом HMAC. Це може бути будь-яке ім’я, яке підходить для :func:`hashlib.new`. Незважаючи на свою аргументовану позицію, вона потрібна.

source: Parameter *key* can be a bytes or bytearray object. Parameter *msg* can be of any type supported by :mod:`hashlib`. Parameter *digestmod* can be the name of a hash algorithm.
uk: Параметр *key* може бути об’єктом bytes або bytearray. Параметр *msg* може бути будь-якого типу, який підтримується :mod:`hashlib`. Параметр *digestmod* може бути назвою хеш-алгоритму.

source: MD5 as implicit default digest for *digestmod* is deprecated. The digestmod parameter is now required. Pass it as a keyword argument to avoid awkwardness when you do not have an initial msg.
uk: MD5 як неявний дайджест за замовчуванням для *digestmod* застарів. Тепер потрібен параметр digestmod. Передайте його як аргумент ключового слова, щоб уникнути незручності, коли у вас немає початкового повідомлення.

source: Return digest of *msg* for given secret *key* and *digest*. The function is equivalent to ``HMAC(key, msg, digest).digest()``, but uses an optimized C or inline implementation, which is faster for messages that fit into memory. The parameters *key*, *msg*, and *digest* have the same meaning as in :func:`~hmac.new`.
uk: Повернути дайджест *повідомлення* для заданого секретного *ключа* та *дайджесту*. Функція еквівалентна ``HMAC(key, msg, digest).digest()``, але використовує оптимізовану C або вбудовану реалізацію, яка є швидшою для повідомлень, які вміщуються в пам’ять. Параметри *key*, *msg* і *digest* мають те саме значення, що й у :func:`~hmac.new`.

source: CPython implementation detail, the optimized C implementation is only used when *digest* is a string and name of a digest algorithm, which is supported by OpenSSL.
uk: Деталі реалізації CPython, оптимізована реалізація C використовується лише тоді, коли *digest* є рядком і назвою алгоритму дайджесту, який підтримується OpenSSL.

source: An HMAC object has the following methods:
uk: Об’єкт HMAC має такі методи:

source: Update the hmac object with *msg*. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a + b)``.
uk: Оновіть об’єкт hmac за допомогою *msg*. Повторні виклики еквівалентні одному виклику з конкатенацією всіх аргументів: ``m.update(a); m.update(b)`` еквівалентно ``m.update(a + b)``.

source: Parameter *msg* can be of any type supported by :mod:`hashlib`.
uk: Параметр *msg* може бути будь-якого типу, який підтримується :mod:`hashlib`.

source: Return the digest of the bytes passed to the :meth:`update` method so far. This bytes object will be the same length as the *digest_size* of the digest given to the constructor. It may contain non-ASCII bytes, including NUL bytes.
uk: Повертає дайджест байтів, переданих до цього моменту методу :meth:`update`. Цей об’єкт bytes матиме таку саму довжину, що й *digest_size* дайджесту, наданого конструктору. Він може містити байти, відмінні від ASCII, включаючи байти NUL.

source: When comparing the output of :meth:`digest` to an externally-supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
uk: Під час порівняння результату :meth:`digest` із зовнішнім дайджестом під час процедури перевірки рекомендується використовувати функцію :func:`compare_digest` замість оператора ``==``, щоб зменшити вразливість до таймінг-атаки.

source: Like :meth:`digest` except the digest is returned as a string twice the length containing only hexadecimal digits. This may be used to exchange the value safely in email or other non-binary environments.
uk: Подібно до :meth:`digest`, за винятком того, що дайджест повертається як рядок подвійної довжини, що містить лише шістнадцяткові цифри. Це можна використовувати для безпечного обміну значенням в електронній пошті чи в інших небінарних середовищах.

source: When comparing the output of :meth:`hexdigest` to an externally-supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
uk: Під час порівняння результату :meth:`hexdigest` із зовнішнім дайджестом під час процедури перевірки рекомендується використовувати функцію :func:`compare_digest` замість оператора ``==``, щоб зменшити вразливість до таймінг-атаки.

source: Return a copy ("clone") of the hmac object. This can be used to efficiently compute the digests of strings that share a common initial substring.
uk: Повертає копію ("клон") об'єкта hmac. Це можна використовувати для ефективного обчислення дайджестів рядків, які мають спільний початковий підрядок.

source: A hash object has the following attributes:
uk: Хеш-об’єкт має такі атрибути:

source: The size of the resulting HMAC digest in bytes.
uk: Розмір отриманого дайджесту HMAC у байтах.

source: The internal block size of the hash algorithm in bytes.
uk: Розмір внутрішнього блоку хеш-алгоритму в байтах.

source: The canonical name of this HMAC, always lowercase, e.g. ``hmac-md5``.
uk: Канонічна назва цього HMAC, завжди в нижньому регістрі, напр. ``hmac-md5``.

source: The undocumented attributes ``HMAC.digest_cons``, ``HMAC.inner``, and ``HMAC.outer`` are internal implementation details and will be removed in Python 3.10.
uk: Недокументовані атрибути ``HMAC.digest_cons``, ``HMAC.inner`` і ``HMAC.outer`` є деталями внутрішньої реалізації, і їх буде видалено в Python 3.10.

source: This module also provides the following helper function:
uk: Цей модуль також надає такі допоміжні функції:

source: Return ``a == b``. This function uses an approach designed to prevent timing analysis by avoiding content-based short circuiting behaviour, making it appropriate for cryptography. *a* and *b* must both be of the same type: either :class:`str` (ASCII only, as e.g. returned by :meth:`HMAC.hexdigest`), or a :term:`bytes-like object`.
uk: Повернути ``a == b``. Ця функція використовує підхід, призначений для запобігання аналізу часу шляхом уникнення короткого замикання на основі вмісту, що робить її придатною для криптографії. *a* і *b* мають бути одного типу: або :class:`str` (тільки ASCII, як, наприклад, повертає :meth:`HMAC.hexdigest`), або :term:`bytes-like object`.

source: If *a* and *b* are of different lengths, or if an error occurs, a timing attack could theoretically reveal information about the types and lengths of *a* and *b*—but not their values.
uk: Якщо *a* і *b* мають різну довжину або якщо сталася помилка, атака на синхронізацію теоретично може відкрити інформацію про типи та довжини *a* і *b*, але не їхні значення.

source: The function uses OpenSSL's ``CRYPTO_memcmp()`` internally when available.
uk: Функція внутрішньо використовує ``CRYPTO_memcmp()`` OpenSSL, якщо доступний.

source: Module :mod:`hashlib`
uk: Модуль :mod:`hashlib`

source: The Python module providing secure hash functions.
uk: Модуль Python, що забезпечує безпечні хеш-функції.
