Repository: python/python-docs-uk
Catalog: library/http_server.po
Languages: uk

source: :mod:`http.server` --- HTTP servers
uk: :mod:`http.server` --- HTTP-сервери

source: **Source code:** :source:`Lib/http/server.py`
uk: **Вихідний код:** :source:`Lib/http/server.py`

source: This module defines classes for implementing HTTP servers.
uk: Цей модуль визначає класи для реалізації HTTP-серверів.

source: :mod:`http.server` is not recommended for production. It only implements basic security checks.
uk: :mod:`http.server` не рекомендується для виробництва. Він виконує лише базові перевірки безпеки.

source: One class, :class:`HTTPServer`, is a :class:`socketserver.TCPServer` subclass. It creates and listens at the HTTP socket, dispatching the requests to a handler. Code to create and run the server looks like this::
uk: Один клас, :class:`HTTPServer`, є підкласом :class:`socketserver.TCPServer`. Він створює та прослуховує HTTP-сокет, надсилаючи запити обробнику. Код для створення та запуску сервера виглядає так:

source: This class builds on the :class:`~socketserver.TCPServer` class by storing the server address as instance variables named :attr:`server_name` and :attr:`server_port`. The server is accessible by the handler, typically through the handler's :attr:`server` instance variable.
uk: Цей клас будується на основі класу :class:`~socketserver.TCPServer`, зберігаючи адресу сервера як змінні екземпляра з іменами :attr:`server_name` і :attr:`server_port`. Сервер доступний обробнику, як правило, через змінну екземпляра обробника :attr:`server`.

source: This class is identical to HTTPServer but uses threads to handle requests by using the :class:`~socketserver.ThreadingMixIn`. This is useful to handle web browsers pre-opening sockets, on which :class:`HTTPServer` would wait indefinitely.
uk: Цей клас ідентичний HTTPServer, але використовує потоки для обробки запитів за допомогою :class:`~socketserver.ThreadingMixIn`. Це корисно для роботи з веб-браузерами, які попередньо відкривають сокети, на яких :class:`HTTPServer` чекатиме нескінченно довго.

source: The :class:`HTTPServer` and :class:`ThreadingHTTPServer` must be given a *RequestHandlerClass* on instantiation, of which this module provides three different variants:
uk: :class:`HTTPServer` і :class:`ThreadingHTTPServer` повинні отримати *RequestHandlerClass* під час створення екземпляра, для якого цей модуль надає три різні варіанти:

source: This class is used to handle the HTTP requests that arrive at the server. By itself, it cannot respond to any actual HTTP requests; it must be subclassed to handle each request method (e.g. GET or POST). :class:`BaseHTTPRequestHandler` provides a number of class and instance variables, and methods for use by subclasses.
uk: Цей клас використовується для обробки HTTP-запитів, які надходять на сервер. Сам по собі він не може відповідати на жодні фактичні запити HTTP; він повинен бути підкласом для обробки кожного методу запиту (наприклад, GET або POST). :class:`BaseHTTPRequestHandler` надає ряд змінних класу та екземпляра, а також методів для використання підкласами.

source: The handler will parse the request and the headers, then call a method specific to the request type. The method name is constructed from the request. For example, for the request method ``SPAM``, the :meth:`do_SPAM` method will be called with no arguments. All of the relevant information is stored in instance variables of the handler. Subclasses should not need to override or extend the :meth:`__init__` method.
uk: Обробник розбере запит і заголовки, а потім викличе метод, специфічний для типу запиту. Ім'я методу складається з запиту. Наприклад, для методу запиту ``SPAM`` буде викликаний метод :meth:`do_SPAM` без аргументів. Уся відповідна інформація зберігається в змінних екземпляра обробника. Підкласам не потрібно перевизначати або розширювати метод :meth:`__init__`.

source: :class:`BaseHTTPRequestHandler` has the following instance variables:
uk: :class:`BaseHTTPRequestHandler` має такі змінні екземпляра:

source: Contains a tuple of the form ``(host, port)`` referring to the client's address.
uk: Містить кортеж у формі ``(хост, порт)``, який посилається на адресу клієнта.

source: Contains the server instance.
uk: Містить екземпляр сервера.

source: Boolean that should be set before :meth:`handle_one_request` returns, indicating if another request may be expected, or if the connection should be shut down.
uk: Логічне значення, яке має бути встановлено перед поверненням :meth:`handle_one_request`, вказуючи, чи можна очікувати ще один запит, чи з’єднання має бути закрито.

source: Contains the string representation of the HTTP request line. The terminating CRLF is stripped. This attribute should be set by :meth:`handle_one_request`. If no valid request line was processed, it should be set to the empty string.
uk: Містить рядкове представлення рядка запиту HTTP. Кінцевий CRLF видаляється. Цей атрибут має бути встановлено :meth:`handle_one_request`. Якщо дійсний рядок запиту не оброблено, його слід встановити на порожній рядок.

source: Contains the command (request type). For example, ``'GET'``.
uk: Містить команду (тип запиту). Наприклад, ``'GET'``.

source: Contains the request path. If query component of the URL is present, then ``path`` includes the query. Using the terminology of :rfc:`3986`, ``path`` here includes ``hier-part`` and the ``query``.
uk: Містить шлях запиту. Якщо компонент запиту URL-адреси присутній, тоді ``path`` включає запит. Використовуючи термінологію :rfc:`3986`, ``path`` тут включає ``hier-part`` і ``query``.

source: Contains the version string from the request. For example, ``'HTTP/1.0'``.
uk: Містить рядок версії із запиту. Наприклад, ``'HTTP/1.0'``.

source: Holds an instance of the class specified by the :attr:`MessageClass` class variable. This instance parses and manages the headers in the HTTP request. The :func:`~http.client.parse_headers` function from :mod:`http.client` is used to parse the headers and it requires that the HTTP request provide a valid :rfc:`2822` style header.
uk: Містить екземпляр класу, визначеного змінною класу :attr:`MessageClass`. Цей екземпляр аналізує та керує заголовками в запиті HTTP. Функція :func:`~http.client.parse_headers` з :mod:`http.client` використовується для аналізу заголовків і вимагає, щоб HTTP-запит надав дійсний заголовок стилю :rfc:`2822`.

source: An :class:`io.BufferedIOBase` input stream, ready to read from the start of the optional input data.
uk: Вхідний потік :class:`io.BufferedIOBase`, готовий для читання з початку додаткових вхідних даних.

source: Contains the output stream for writing a response back to the client. Proper adherence to the HTTP protocol must be used when writing to this stream in order to achieve successful interoperation with HTTP clients.
uk: Містить вихідний потік для запису відповіді клієнту. Щоб досягти успішної взаємодії з HTTP-клієнтами, під час запису в цей потік необхідно належним чином дотримуватися протоколу HTTP.

source: This is an :class:`io.BufferedIOBase` stream.
uk: Це потік :class:`io.BufferedIOBase`.

source: :class:`BaseHTTPRequestHandler` has the following attributes:
uk: :class:`BaseHTTPRequestHandler` має такі атрибути:

source: Specifies the server software version. You may want to override this. The format is multiple whitespace-separated strings, where each string is of the form name[/version]. For example, ``'BaseHTTP/0.2'``.
uk: Визначає версію програмного забезпечення сервера. Ви можете змінити це. Формат — кілька рядків, розділених пробілами, де кожен рядок має назву форми[/version]. Наприклад, "BaseHTTP/0.2".

source: Contains the Python system version, in a form usable by the :attr:`version_string` method and the :attr:`server_version` class variable. For example, ``'Python/1.4'``.
uk: Містить версію системи Python у формі, придатній для використання методом :attr:`version_string` і змінною класу :attr:`server_version`. Наприклад, ``'Python/1.4'``.

source: Specifies a format string that should be used by :meth:`send_error` method for building an error response to the client. The string is filled by default with variables from :attr:`responses` based on the status code that passed to :meth:`send_error`.
uk: Визначає рядок формату, який має використовуватися методом :meth:`send_error` для створення відповіді про помилку клієнту. Рядок за замовчуванням заповнюється змінними з :attr:`responses` на основі коду стану, переданого в :meth:`send_error`.

source: Specifies the Content-Type HTTP header of error responses sent to the client. The default value is ``'text/html'``.
uk: Визначає HTTP-заголовок Content-Type відповідей про помилки, надісланих клієнту. Значення за замовчуванням - ``'text/html'``.

source: Specifies an :class:`email.message.Message`\ -like class to parse HTTP headers. Typically, this is not overridden, and it defaults to :class:`http.client.HTTPMessage`.
uk: Визначає :class:`email.message.Message`\ -подібний клас для аналізу заголовків HTTP. Як правило, це не перевизначається, і за замовчуванням має значення :class:`http.client.HTTPMessage`.

source: This attribute contains a mapping of error code integers to two-element tuples containing a short and long message. For example, ``{code: (shortmessage, longmessage)}``. The *shortmessage* is usually used as the *message* key in an error response, and *longmessage* as the *explain* key. It is used by :meth:`send_response_only` and :meth:`send_error` methods.
uk: Цей атрибут містить відображення цілих чисел коду помилки в двоелементні кортежі, що містять коротке та довге повідомлення. Наприклад, ``{code: (shortmessage, longmessage)}``. *shortmessage* зазвичай використовується як ключ *message* у відповіді про помилку, а *longmessage* як ключ *explain*. Він використовується методами :meth:`send_response_only` і :meth:`send_error`.

source: A :class:`BaseHTTPRequestHandler` instance has the following methods:
uk: Екземпляр :class:`BaseHTTPRequestHandler` має такі методи:

source: Calls :meth:`handle_one_request` once (or, if persistent connections are enabled, multiple times) to handle incoming HTTP requests. You should never need to override it; instead, implement appropriate :meth:`do_\*` methods.
uk: Викликає :meth:`handle_one_request` один раз (або, якщо ввімкнено постійні з’єднання, кілька разів) для обробки вхідних запитів HTTP. Вам ніколи не доведеться перевизначати це; натомість реалізуйте відповідні методи :meth:`do_\*`.

source: This method will parse and dispatch the request to the appropriate :meth:`do_\*` method. You should never need to override it.
uk: Цей метод аналізуватиме та відправлятиме запит у відповідний метод :meth:`do_\*`. Вам ніколи не доведеться його перевизначати.

source: Sends and logs a complete error reply to the client. The numeric *code* specifies the HTTP error code, with *message* as an optional, short, human readable description of the error. The *explain* argument can be used to provide more detailed information about the error; it will be formatted using the :attr:`error_message_format` attribute and emitted, after a complete set of headers, as the response body. The :attr:`responses` attribute holds the default values for *message* and *explain* that will be used if no value is provided; for unknown codes the default value for both is the string ``???``. The body will be empty if the method is HEAD or the response code is one of the following: ``1xx``, ``204 No Content``, ``205 Reset Content``, ``304 Not Modified``.
uk: Надсилає та реєструє клієнту повну відповідь про помилку. Цифровий *код* визначає код помилки HTTP з *повідомленням* як необов’язковим коротким, зрозумілим людині описом помилки. Аргумент *explain* можна використовувати для надання більш детальної інформації про помилку; його буде відформатовано за допомогою атрибута :attr:`error_message_format` і видано після повного набору заголовків як тіло відповіді. Атрибут :attr:`responses` містить значення за замовчуванням для *message* і *explain*, які використовуватимуться, якщо значення не вказано; для невідомих кодів значенням за замовчуванням для обох є рядок ``???``. Тіло буде порожнім, якщо метод HEAD або код відповіді один із таких: ``1xx``, ``204 No Content``, ``205 Reset Content``, ``304 Not Modified``.

source: The error response includes a Content-Length header. Added the *explain* argument.
uk: Відповідь про помилку містить заголовок Content-Length. Додано аргумент *explain*.

source: Adds a response header to the headers buffer and logs the accepted request. The HTTP response line is written to the internal buffer, followed by *Server* and *Date* headers. The values for these two headers are picked up from the :meth:`version_string` and :meth:`date_time_string` methods, respectively. If the server does not intend to send any other headers using the :meth:`send_header` method, then :meth:`send_response` should be followed by an :meth:`end_headers` call.
uk: Додає заголовок відповіді до буфера заголовків і реєструє прийнятий запит. Рядок відповіді HTTP записується у внутрішній буфер, а потім ідуть заголовки *Server* і *Date*. Значення для цих двох заголовків беруться з методів :meth:`version_string` і :meth:`date_time_string` відповідно. Якщо сервер не має наміру надсилати будь-які інші заголовки за допомогою методу :meth:`send_header`, тоді за :meth:`send_response` має слідувати виклик :meth:`end_headers`.

source: Headers are stored to an internal buffer and :meth:`end_headers` needs to be called explicitly.
uk: Заголовки зберігаються у внутрішньому буфері, і :meth:`end_headers` потрібно викликати явно.

source: Adds the HTTP header to an internal buffer which will be written to the output stream when either :meth:`end_headers` or :meth:`flush_headers` is invoked. *keyword* should specify the header keyword, with *value* specifying its value. Note that, after the send_header calls are done, :meth:`end_headers` MUST BE called in order to complete the operation.
uk: Додає HTTP-заголовок до внутрішнього буфера, який буде записаний у вихідний потік під час виклику :meth:`end_headers` або :meth:`flush_headers`. *keyword* має вказувати ключове слово заголовка, а *value* — його значення. Зауважте, що після завершення викликів send_header :meth:`end_headers` ПОТРІБНО викликати, щоб завершити операцію.

source: Headers are stored in an internal buffer.
uk: Заголовки зберігаються у внутрішньому буфері.

source: Sends the response header only, used for the purposes when ``100 Continue`` response is sent by the server to the client. The headers not buffered and sent directly the output stream.If the *message* is not specified, the HTTP message corresponding the response *code* is sent.
uk: Надсилає лише заголовок відповіді, який використовується для цілей, коли відповідь ``100 Continue`` надсилається сервером клієнту. Заголовки не буферизуються та надсилаються безпосередньо в вихідний потік. Якщо *повідомлення* не вказано, надсилається HTTP-повідомлення, що відповідає *коду* відповіді.

source: Adds a blank line (indicating the end of the HTTP headers in the response) to the headers buffer and calls :meth:`flush_headers()`.
uk: Додає порожній рядок (що вказує на кінець заголовків HTTP у відповіді) до буфера заголовків і викликає :meth:`flush_headers()`.

source: The buffered headers are written to the output stream.
uk: Буферизовані заголовки записуються у вихідний потік.

source: Finally send the headers to the output stream and flush the internal headers buffer.
uk: Нарешті надішліть заголовки у вихідний потік і очистіть внутрішній буфер заголовків.

source: Logs an accepted (successful) request. *code* should specify the numeric HTTP code associated with the response. If a size of the response is available, then it should be passed as the *size* parameter.
uk: Реєструє прийнятий (успішний) запит. *code* має вказувати числовий код HTTP, пов’язаний із відповіддю. Якщо доступний розмір відповіді, його слід передати як параметр *size*.

source: Logs an error when a request cannot be fulfilled. By default, it passes the message to :meth:`log_message`, so it takes the same arguments (*format* and additional values).
uk: Записує помилку, коли запит не може бути виконано. За замовчуванням він передає повідомлення в :meth:`log_message`, тому приймає ті самі аргументи (*формат* і додаткові значення).

source: Logs an arbitrary message to ``sys.stderr``. This is typically overridden to create custom error logging mechanisms. The *format* argument is a standard printf-style format string, where the additional arguments to :meth:`log_message` are applied as inputs to the formatting. The client ip address and current date and time are prefixed to every message logged.
uk: Записує довільне повідомлення до ``sys.stderr``. Зазвичай це замінюється, щоб створити спеціальні механізми реєстрації помилок. Аргумент *format* — це стандартний рядок форматування у стилі printf, де додаткові аргументи :meth:`log_message` застосовуються як вхідні дані для форматування. IP-адреса клієнта, поточна дата й час додаються до кожного зареєстрованого повідомлення.

source: Returns the server software's version string. This is a combination of the :attr:`server_version` and :attr:`sys_version` attributes.
uk: Повертає рядок версії програмного забезпечення сервера. Це комбінація атрибутів :attr:`server_version` і :attr:`sys_version`.

source: Returns the date and time given by *timestamp* (which must be ``None`` or in the format returned by :func:`time.time`), formatted for a message header. If *timestamp* is omitted, it uses the current date and time.
uk: Повертає дату й час, задані *timestamp* (які мають бути ``None`` або у форматі, що повертається :func:`time.time`), відформатовані для заголовка повідомлення. Якщо *timestamp* пропущено, використовуються поточні дата й час.

source: The result looks like ``'Sun, 06 Nov 1994 08:49:37 GMT'``.
uk: Результат виглядає так: ``'Sun, 06 Nov 1994 08:49:37 GMT''``.

source: Returns the current date and time, formatted for logging.
uk: Повертає поточну дату й час у форматі для журналювання.

source: Returns the client address.
uk: Повертає адресу клієнта.

source: Previously, a name lookup was performed. To avoid name resolution delays, it now always returns the IP address.
uk: Раніше було виконано пошук імені. Щоб уникнути затримок розпізнавання імен, тепер завжди повертається IP-адреса.

source: This class serves files from the directory *directory* and below, or the current directory if *directory* is not provided, directly mapping the directory structure to HTTP requests.
uk: Цей клас обслуговує файли з каталогу *directory* і нижче, або з поточного каталогу, якщо *directory* не надано, безпосередньо відображаючи структуру каталогу на HTTP-запити.

source: The *directory* parameter.
uk: Параметр *каталог*.

source: The *directory* parameter accepts a :term:`path-like object`.
uk: Параметр *directory* приймає :term:`path-like object`.

source: A lot of the work, such as parsing the request, is done by the base class :class:`BaseHTTPRequestHandler`. This class implements the :func:`do_GET` and :func:`do_HEAD` functions.
uk: Велику частину роботи, наприклад розбір запиту, виконує базовий клас :class:`BaseHTTPRequestHandler`. Цей клас реалізує функції :func:`do_GET` і :func:`do_HEAD`.

source: The following are defined as class-level attributes of :class:`SimpleHTTPRequestHandler`:
uk: Наступне визначено як атрибути рівня класу :class:`SimpleHTTPRequestHandler`:

source: This will be ``"SimpleHTTP/" + __version__``, where ``__version__`` is defined at the module level.
uk: Це буде ``"SimpleHTTP/" + __version__``, де ``__version__`` визначено на рівні модуля.

source: A dictionary mapping suffixes into MIME types, contains custom overrides for the default system mappings. The mapping is used case-insensitively, and so should contain only lower-cased keys.
uk: Суфікси словника, що відображають типи MIME, містять користувацькі заміни для стандартних системних відображень. Відображення використовується без урахування регістру, тому має містити лише ключі в нижньому регістрі.

source: This dictionary is no longer filled with the default system mappings, but only contains overrides.
uk: Цей словник більше не заповнюється типовими системними відображеннями, а містить лише перевизначення.

source: The :class:`SimpleHTTPRequestHandler` class defines the following methods:
uk: Клас :class:`SimpleHTTPRequestHandler` визначає такі методи:

source: This method serves the ``'HEAD'`` request type: it sends the headers it would send for the equivalent ``GET`` request. See the :meth:`do_GET` method for a more complete explanation of the possible headers.
uk: Цей метод обслуговує тип запиту ``'HEAD``: він надсилає заголовки, які б надіслав для еквівалентного запиту ``GET``. Перегляньте метод :meth:`do_GET` для більш повного пояснення можливих заголовків.

source: The request is mapped to a local file by interpreting the request as a path relative to the current working directory.
uk: Запит відображається в локальному файлі шляхом інтерпретації запиту як шляху відносно поточного робочого каталогу.

source: If the request was mapped to a directory, the directory is checked for a file named ``index.html`` or ``index.htm`` (in that order). If found, the file's contents are returned; otherwise a directory listing is generated by calling the :meth:`list_directory` method. This method uses :func:`os.listdir` to scan the directory, and returns a ``404`` error response if the :func:`~os.listdir` fails.
uk: Якщо запит було зіставлено з каталогом, каталог перевіряється на наявність файлу з назвою ``index.html`` або ``index.htm`` (у такому порядку). Якщо знайдено, повертається вміст файлу; інакше список каталогу створюється шляхом виклику методу :meth:`list_directory`. Цей метод використовує :func:`os.listdir` для сканування каталогу та повертає відповідь про помилку ``404``, якщо :func:`~os.listdir` не вдається.

source: If the request was mapped to a file, it is opened. Any :exc:`OSError` exception in opening the requested file is mapped to a ``404``, ``'File not found'`` error. If there was a ``'If-Modified-Since'`` header in the request, and the file was not modified after this time, a ``304``, ``'Not Modified'`` response is sent. Otherwise, the content type is guessed by calling the :meth:`guess_type` method, which in turn uses the *extensions_map* variable, and the file contents are returned.
uk: Якщо запит було зіставлено з файлом, він відкривається. Будь-який виняток :exc:`OSError` під час відкриття запитуваного файлу відображається як помилка ``404``, ``'Файл не знайдено``. Якщо у запиті був заголовок ``'If-Modified-Since`` і файл не було змінено після цього часу, надсилається відповідь ``304``, ``'Not Modified''``. В іншому випадку тип вмісту вгадується шляхом виклику методу :meth:`guess_type`, який, у свою чергу, використовує змінну *extensions_map*, і повертається вміст файлу.

source: A ``'Content-type:'`` header with the guessed content type is output, followed by a ``'Content-Length:'`` header with the file's size and a ``'Last-Modified:'`` header with the file's modification time.
uk: Виводиться заголовок ``'Content-type:''`` з припущеним типом вмісту, а потім заголовок ``'Content-Length:''`` із заголовком ``'Content-Length:''`` із заголовком розміру файлу та ``'Last-Modified:''``. заголовок із часом модифікації файлу.

source: Then follows a blank line signifying the end of the headers, and then the contents of the file are output. If the file's MIME type starts with ``text/`` the file is opened in text mode; otherwise binary mode is used.
uk: Потім слідує порожній рядок, що означає кінець заголовків, а потім виводиться вміст файлу. Якщо тип MIME файлу починається з ``text/``, файл відкривається в текстовому режимі; інакше використовується двійковий режим.
