Repository: python/python-docs-uk
Catalog: library/http_server.po
Languages: uk

source: For example usage, see the implementation of the :func:`test` function invocation in the :mod:`http.server` module.
uk: Для прикладу використання дивіться реалізацію виклику функції :func:`test` у модулі :mod:`http.server`.

source: Support of the ``'If-Modified-Since'`` header.
uk: Підтримка заголовка ``'If-Modified-Since``.

source: The :class:`SimpleHTTPRequestHandler` class can be used in the following manner in order to create a very basic webserver serving files relative to the current directory::
uk: Клас :class:`SimpleHTTPRequestHandler` можна використовувати таким чином, щоб створити простий веб-сервер, який обслуговує файли відносно поточного каталогу:

source: :mod:`http.server` can also be invoked directly using the :option:`-m` switch of the interpreter. Similar to the previous example, this serves files relative to the current directory::
uk: :mod:`http.server` також можна викликати безпосередньо за допомогою перемикача :option:`-m` інтерпретатора. Подібно до попереднього прикладу, це обслуговує файли відносно поточного каталогу::

source: The server listens to port 8000 by default. The default can be overridden by passing the desired port number as an argument::
uk: За замовчуванням сервер слухає порт 8000. Значення за замовчуванням можна змінити, передавши потрібний номер порту як аргумент::

source: By default, the server binds itself to all interfaces. The option ``-b/--bind`` specifies a specific address to which it should bind. Both IPv4 and IPv6 addresses are supported. For example, the following command causes the server to bind to localhost only::
uk: За замовчуванням сервер прив’язується до всіх інтерфейсів. Параметр ``-b/--bind`` вказує конкретну адресу, до якої має бути прив’язаний. Підтримуються адреси IPv4 і IPv6. Наприклад, наступна команда змушує сервер прив’язуватися лише до localhost::

source: ``--bind`` argument was introduced.
uk: Було введено аргумент ``--bind``.

source: ``--bind`` argument enhanced to support IPv6
uk: Аргумент ``--bind`` покращено для підтримки IPv6

source: By default, the server uses the current directory. The option ``-d/--directory`` specifies a directory to which it should serve the files. For example, the following command uses a specific directory::
uk: За замовчуванням сервер використовує поточний каталог. Параметр ``-d/--directory`` вказує каталог, до якого він має розміщувати файли. Наприклад, наступна команда використовує певний каталог::

source: ``--directory`` argument was introduced.
uk: Було введено аргумент ``--directory``.

source: This class is used to serve either files or output of CGI scripts from the current directory and below. Note that mapping HTTP hierarchic structure to local directory structure is exactly as in :class:`SimpleHTTPRequestHandler`.
uk: Цей клас використовується для обслуговування файлів або виведення сценаріїв CGI з поточного каталогу та нижче. Зауважте, що зіставлення ієрархічної структури HTTP зі структурою локального каталогу відбувається точно так само, як у :class:`SimpleHTTPRequestHandler`.

source: CGI scripts run by the :class:`CGIHTTPRequestHandler` class cannot execute redirects (HTTP code 302), because code 200 (script output follows) is sent prior to execution of the CGI script. This pre-empts the status code.
uk: Сценарії CGI, що виконуються класом :class:`CGIHTTPRequestHandler`, не можуть виконувати перенаправлення (код HTTP 302), тому що код 200 (вивід сценарію йде далі) надсилається перед виконанням сценарію CGI. Це випереджає код стану.

source: The class will however, run the CGI script, instead of serving it as a file, if it guesses it to be a CGI script. Only directory-based CGI are used --- the other common server configuration is to treat special extensions as denoting CGI scripts.
uk: Однак клас запустить сценарій CGI замість того, щоб подавати його як файл, якщо він здогадається, що це сценарій CGI. Використовується лише CGI на основі каталогу --- іншою загальною конфігурацією сервера є розгляд спеціальних розширень як позначення сценаріїв CGI.

source: The :func:`do_GET` and :func:`do_HEAD` functions are modified to run CGI scripts and serve the output, instead of serving files, if the request leads to somewhere below the ``cgi_directories`` path.
uk: Функції :func:`do_GET` і :func:`do_HEAD` модифіковано для запуску CGI-скриптів і обслуговування виводу замість обслуговування файлів, якщо запит веде десь нижче шляху ``cgi_directories``.

source: The :class:`CGIHTTPRequestHandler` defines the following data member:
uk: :class:`CGIHTTPRequestHandler` визначає такий елемент даних:

source: This defaults to ``['/cgi-bin', '/htbin']`` and describes directories to treat as containing CGI scripts.
uk: За замовчуванням це ``['/cgi-bin', '/htbin']`` і описує каталоги, які слід вважати такими, що містять сценарії CGI.

source: The :class:`CGIHTTPRequestHandler` defines the following method:
uk: :class:`CGIHTTPRequestHandler` визначає такий метод:

source: This method serves the ``'POST'`` request type, only allowed for CGI scripts. Error 501, "Can only POST to CGI scripts", is output when trying to POST to a non-CGI url.
uk: Цей метод обслуговує тип запиту ``'POST'``, дозволений лише для сценаріїв CGI. Помилка 501 "Можна публікувати лише сценарії CGI" виводиться під час спроби ПУБЛІКАЦІЇ за URL-адресою, яка не є CGI.

source: Note that CGI scripts will be run with UID of user nobody, for security reasons. Problems with the CGI script will be translated to error 403.
uk: Зауважте, що сценарії CGI виконуватимуться з UID користувача nobody з міркувань безпеки. Проблеми зі сценарієм CGI будуть переведені на помилку 403.

source: :class:`CGIHTTPRequestHandler` can be enabled in the command line by passing the ``--cgi`` option::
uk: :class:`CGIHTTPRequestHandler` можна ввімкнути в командному рядку, передавши параметр ``--cgi``::
