Repository: python/python-docs-uk
Catalog: library/http_client.po
Languages: uk

source: :mod:`http.client` --- HTTP protocol client
uk: :mod:`http.client` --- клієнт протоколу HTTP

source: **Source code:** :source:`Lib/http/client.py`
uk: **Вихідний код:** :source:`Lib/http/client.py`

source: This module defines classes which implement the client side of the HTTP and HTTPS protocols. It is normally not used directly --- the module :mod:`urllib.request` uses it to handle URLs that use HTTP and HTTPS.
uk: Цей модуль визначає класи, які реалізують клієнтську сторону протоколів HTTP і HTTPS. Зазвичай він не використовується безпосередньо --- модуль :mod:`urllib.request` використовує його для обробки URL-адрес, які використовують HTTP і HTTPS.

source: The `Requests package <https://requests.readthedocs.io/en/master/>`_ is recommended for a higher-level HTTP client interface.
uk: `Пакет запитів <https://requests.readthedocs.io/en/master/>`_ рекомендовано для клієнтського інтерфейсу HTTP вищого рівня.

source: HTTPS support is only available if Python was compiled with SSL support (through the :mod:`ssl` module).
uk: Підтримка HTTPS доступна, лише якщо Python було скомпільовано з підтримкою SSL (через модуль :mod:`ssl`).

source: The module provides the following classes:
uk: Модуль надає такі класи:

source: An :class:`HTTPConnection` instance represents one transaction with an HTTP server. It should be instantiated passing it a host and optional port number. If no port number is passed, the port is extracted from the host string if it has the form ``host:port``, else the default HTTP port (80) is used. If the optional *timeout* parameter is given, blocking operations (like connection attempts) will timeout after that many seconds (if it is not given, the global default timeout setting is used). The optional *source_address* parameter may be a tuple of a (host, port) to use as the source address the HTTP connection is made from. The optional *blocksize* parameter sets the buffer size in bytes for sending a file-like message body.
uk: Екземпляр :class:`HTTPConnection` представляє одну транзакцію з сервером HTTP. Його слід створити, передавши йому хост і необов’язковий номер порту. Якщо номер порту не передано, порт витягується з рядка хоста, якщо він має форму ``host:port``, інакше використовується стандартний порт HTTP (80). Якщо вказано необов’язковий параметр *timeout*, операції блокування (наприклад, спроби підключення) закінчаться через стільки секунд (якщо його не вказано, використовується глобальне налаштування часу очікування за замовчуванням). Додатковий параметр *source_address* може бути кортежем (хост, порт) для використання як адреси джерела, з якого створюється HTTP-з’єднання. Додатковий параметр *blocksize* встановлює розмір буфера в байтах для надсилання тіла повідомлення, схожого на файл.

source: For example, the following calls all create instances that connect to the server at the same host and port::
uk: Наприклад, усі наведені нижче виклики створюють екземпляри, які підключаються до сервера на одному хості та порту:

source: *source_address* was added.
uk: *вихідна_адреса* була додана.

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are not longer supported.
uk: Параметр *strict* видалено. "Прості відповіді" у стилі HTTP 0.9 більше не підтримуються.

source: *blocksize* parameter was added.
uk: Додано параметр *blocksize*.

source: A subclass of :class:`HTTPConnection` that uses SSL for communication with secure servers. Default port is ``443``. If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options.
uk: Підклас :class:`HTTPConnection`, який використовує SSL для зв’язку із захищеними серверами. Стандартний порт ``443``. Якщо вказано *контекст*, це має бути екземпляр :class:`ssl.SSLContext`, який описує різні параметри SSL.

source: Please read :ref:`ssl-security` for more information on best practices.
uk: Будь ласка, прочитайте :ref:`ssl-security`, щоб дізнатися більше про найкращі практики.

source: *source_address*, *context* and *check_hostname* were added.
uk: Додано *source_address*, *context* і *check_hostname*.

source: This class now supports HTTPS virtual hosts if possible (that is, if :data:`ssl.HAS_SNI` is true).
uk: Цей клас тепер підтримує віртуальні хости HTTPS, якщо це можливо (тобто, якщо :data:`ssl.HAS_SNI` має значення true).

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are no longer supported.
uk: Параметр *strict* видалено. "Прості відповіді" у стилі HTTP 0.9 більше не підтримуються.

source: This class now performs all the necessary certificate and hostname checks by default. To revert to the previous, unverified, behavior :func:`ssl._create_unverified_context` can be passed to the *context* parameter.
uk: Тепер цей клас за замовчуванням виконує всі необхідні перевірки сертифікатів і імен хостів. Щоб повернутися до попередньої, неперевіреної поведінки, :func:`ssl._create_unverified_context` можна передати в параметр *context*.

source: This class now enables TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` for the default *context* or when *cert_file* is passed with a custom *context*.
uk: Цей клас тепер увімкне TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` для *контексту* за замовчуванням або коли *cert_file* передається з настроюваним *контекстом*.

source: This class now sends an ALPN extension with protocol indicator ``http/1.1`` when no *context* is given. Custom *context* should set ALPN protocols with :meth:`~ssl.SSLContext.set_alpn_protocol`.
uk: Цей клас тепер надсилає розширення ALPN з індикатором протоколу ``http/1.1``, якщо не задано *контексту*. Спеціальний *контекст* має встановлювати протоколи ALPN за допомогою :meth:`~ssl.SSSLContext.set_alpn_protocol`.

source: *key_file* and *cert_file* are deprecated in favor of *context*. Please use :meth:`ssl.SSLContext.load_cert_chain` instead, or let :func:`ssl.create_default_context` select the system's trusted CA certificates for you.
uk: *key_file* і *cert_file* застаріли на користь *context*. Натомість використовуйте :meth:`ssl.SSLContext.load_cert_chain` або дозвольте :func:`ssl.create_default_context` вибрати для вас надійні сертифікати ЦС системи.

source: The *check_hostname* parameter is also deprecated; the :attr:`ssl.SSLContext.check_hostname` attribute of *context* should be used instead.
uk: Параметр *check_hostname* також застарів; замість нього слід використовувати атрибут :attr:`ssl.SSLContext.check_hostname` *context*.

source: Class whose instances are returned upon successful connection. Not instantiated directly by user.
uk: Клас, екземпляри якого повертаються після успішного підключення. Не створюється безпосередньо користувачем.

source: The *strict* parameter was removed. HTTP 0.9 style "Simple Responses" are no longer supported.
uk: Параметр *strict* видалено. Стиль HTTP 0.9 "Прості відповіді" більше не підтримується.

source: This module provides the following function:
uk: Цей модуль забезпечує наступні функції:

source: Parse the headers from a file pointer *fp* representing a HTTP request/response. The file has to be a :class:`BufferedIOBase` reader (i.e. not text) and must provide a valid :rfc:`2822` style header.
uk: Проаналізуйте заголовки з покажчика файлу *fp*, що представляє запит/відповідь HTTP. Файл має бути :class:`BufferedIOBase` читачем (тобто не текстовим) і має містити дійсний заголовок стилю :rfc:`2822`.

source: This function returns an instance of :class:`http.client.HTTPMessage` that holds the header fields, but no payload (the same as :attr:`HTTPResponse.msg` and :attr:`http.server.BaseHTTPRequestHandler.headers`). After returning, the file pointer *fp* is ready to read the HTTP body.
uk: Ця функція повертає екземпляр :class:`http.client.HTTPMessage`, який містить поля заголовка, але не містить корисного навантаження (те саме, що :attr:`HTTPResponse.msg` і :attr:`http.server.BaseHTTPRequestHandler.headers` ). Після повернення покажчик файлу *fp* готовий читати тіло HTTP.

source: :meth:`parse_headers` does not parse the start-line of a HTTP message; it only parses the ``Name: value`` lines. The file has to be ready to read these field lines, so the first line should already be consumed before calling the function.
uk: :meth:`parse_headers` не аналізує початковий рядок HTTP-повідомлення; він аналізує лише рядки ``Назва: значення``. Файл має бути готовий до читання цих рядків полів, тому перший рядок уже має бути використано перед викликом функції.

source: The following exceptions are raised as appropriate:
uk: Наступні винятки підняті відповідно до:

source: The base class of the other exceptions in this module. It is a subclass of :exc:`Exception`.
uk: Базовий клас інших винятків у цьому модулі. Це підклас :exc:`Exception`.

source: A subclass of :exc:`HTTPException`.
uk: Підклас :exc:`HTTPException`.

source: A subclass of :exc:`HTTPException`, raised if a port is given and is either non-numeric or empty.
uk: Підклас :exc:`HTTPException`, викликаний, якщо задано порт, який є нечисловим або порожнім.

source: A subclass of :exc:`ImproperConnectionState`.
uk: Підклас :exc:`ImproperConnectionState`.

source: A subclass of :exc:`HTTPException`. Raised if a server responds with a HTTP status code that we don't understand.
uk: Підклас :exc:`HTTPException`. Викликається, якщо сервер відповідає кодом статусу HTTP, який ми не розуміємо.

source: A subclass of :exc:`HTTPException`. Raised if an excessively long line is received in the HTTP protocol from the server.
uk: Підклас :exc:`HTTPException`. Викликається, якщо в протоколі HTTP від сервера отримано надто довгий рядок.

source: A subclass of :exc:`ConnectionResetError` and :exc:`BadStatusLine`. Raised by :meth:`HTTPConnection.getresponse` when the attempt to read the response results in no data read from the connection, indicating that the remote end has closed the connection.
uk: Підклас :exc:`ConnectionResetError` і :exc:`BadStatusLine`. Викликається :meth:`HTTPConnection.getresponse`, коли спроба прочитати відповідь не призводить до зчитування даних із з’єднання, що вказує на те, що віддалена сторона закрила з’єднання.

source: Previously, :exc:`BadStatusLine`\ ``('')`` was raised.
uk: Раніше було піднято :exc:`BadStatusLine`\ ``('')``.

source: The constants defined in this module are:
uk: Константи, визначені в цьому модулі:

source: The default port for the HTTP protocol (always ``80``).
uk: Порт за замовчуванням для протоколу HTTP (завжди ``80``).

source: The default port for the HTTPS protocol (always ``443``).
uk: Порт за замовчуванням для протоколу HTTPS (завжди ``443``).

source: This dictionary maps the HTTP 1.1 status codes to the W3C names.
uk: Цей словник відображає коди статусу HTTP 1.1 на імена W3C.

source: Example: ``http.client.responses[http.client.NOT_FOUND]`` is ``'Not Found'``.
uk: Приклад: ``http.client.responses[http.client.NOT_FOUND]`` означає ``'Не знайдено'``.

source: See :ref:`http-status-codes` for a list of HTTP status codes that are available in this module as constants.
uk: Перегляньте :ref:`http-status-codes` список кодів стану HTTP, які доступні в цьому модулі як константи.

source: HTTPConnection Objects
uk: Об'єкти HTTPConnection

source: :class:`HTTPConnection` instances have the following methods:
uk: Екземпляри :class:`HTTPConnection` мають такі методи:

source: This will send a request to the server using the HTTP request method *method* and the selector *url*.
uk: Це надішле запит на сервер за допомогою методу запиту HTTP *method* і селектора *url*.

source: If *body* is specified, the specified data is sent after the headers are finished. It may be a :class:`str`, a :term:`bytes-like object`, an open :term:`file object`, or an iterable of :class:`bytes`. If *body* is a string, it is encoded as ISO-8859-1, the default for HTTP. If it is a bytes-like object, the bytes are sent as is. If it is a :term:`file object`, the contents of the file is sent; this file object should support at least the ``read()`` method. If the file object is an instance of :class:`io.TextIOBase`, the data returned by the ``read()`` method will be encoded as ISO-8859-1, otherwise the data returned by ``read()`` is sent as is. If *body* is an iterable, the elements of the iterable are sent as is until the iterable is exhausted.
uk: Якщо вказано *body*, зазначені дані надсилаються після завершення заголовків. Це може бути :class:`str`, :term:`bytes-like object`, відкритий :term:`file object` або ітерація :class:`bytes`. Якщо *body* є рядком, він кодується як ISO-8859-1, стандартний для HTTP. Якщо це байтоподібний об’єкт, байти надсилаються як є. Якщо це :term:`file object`, вміст файлу надсилається; цей файловий об’єкт має підтримувати принаймні метод ``read()``. Якщо об’єкт файлу є екземпляром :class:`io.TextIOBase`, дані, повернуті методом ``read()``, будуть закодовані як ISO-8859-1, інакше дані, повернуті ``read()`` надсилається як є. Якщо *body* є iterable, елементи iterable надсилаються як є, доки iterable не буде вичерпано.

source: The *headers* argument should be a mapping of extra HTTP headers to send with the request.
uk: Аргумент *headers* має бути відображенням додаткових HTTP-заголовків, які надсилаються із запитом.

source: If *headers* contains neither Content-Length nor Transfer-Encoding, but there is a request body, one of those header fields will be added automatically. If *body* is ``None``, the Content-Length header is set to ``0`` for methods that expect a body (``PUT``, ``POST``, and ``PATCH``). If *body* is a string or a bytes-like object that is not also a :term:`file <file object>`, the Content-Length header is set to its length. Any other type of *body* (files and iterables in general) will be chunk-encoded, and the Transfer-Encoding header will automatically be set instead of Content-Length.
uk: Якщо *headers* не містить ані Content-Length, ані Transfer-Encoding, але є тіло запиту, одне з цих полів заголовка буде додано автоматично. Якщо *body* має значення ``None``, заголовок Content-Length встановлюється на ``0`` для методів, які очікують тіла (``PUT``, ``POST`` і ``PATCH``). . Якщо *body* є рядком або байтоподібним об’єктом, який також не є :term:`файлом <file object>`, заголовок Content-Length встановлюється на його довжину. Будь-який інший тип *body* (файли та ітерації загалом) буде закодовано фрагментами, а заголовок Transfer-Encoding буде автоматично встановлено замість Content-Length.

source: The *encode_chunked* argument is only relevant if Transfer-Encoding is specified in *headers*. If *encode_chunked* is ``False``, the HTTPConnection object assumes that all encoding is handled by the calling code. If it is ``True``, the body will be chunk-encoded.
uk: Аргумент *encode_chunked* доречний, лише якщо Transfer-Encoding указано в *headers*. Якщо *encode_chunked* має значення ``False``, об’єкт HTTPConnection припускає, що все кодування обробляється кодом виклику. Якщо значення ``True``, тіло буде закодовано фрагментами.

source: Chunked transfer encoding has been added to the HTTP protocol version 1.1. Unless the HTTP server is known to handle HTTP 1.1, the caller must either specify the Content-Length, or must pass a :class:`str` or bytes-like object that is not also a file as the body representation.
uk: До протоколу HTTP версії 1.1 додано кодування передачі фрагментами. Якщо не відомо, що HTTP-сервер обробляє HTTP 1.1, абонент повинен або вказати Content-Length, або повинен передати :class:`str` або байт-подібний об’єкт, який також не є файлом, як представлення тіла.

source: *body* can now be an iterable.
uk: *body* тепер може бути ітерованим.

source: If neither Content-Length nor Transfer-Encoding are set in *headers*, file and iterable *body* objects are now chunk-encoded. The *encode_chunked* argument was added. No attempt is made to determine the Content-Length for file objects.
uk: Якщо ані Content-Length, ані Transfer-Encoding не встановлено в *headers*, файл і ітераційні *body* об’єкти тепер закодовані фрагментами. Додано аргумент *encode_chunked*. Не робиться жодних спроб визначити довжину вмісту для файлових об’єктів.

source: Should be called after a request is sent to get the response from the server. Returns an :class:`HTTPResponse` instance.
uk: Має викликатися після надсилання запиту, щоб отримати відповідь від сервера. Повертає екземпляр :class:`HTTPResponse`.

source: Note that you must have read the whole response before you can send a new request to the server.
uk: Зверніть увагу, що ви повинні прочитати всю відповідь, перш ніж ви зможете надіслати новий запит на сервер.

source: If a :exc:`ConnectionError` or subclass is raised, the :class:`HTTPConnection` object will be ready to reconnect when a new request is sent.
uk: Якщо виникає :exc:`ConnectionError` або підклас, об’єкт :class:`HTTPConnection` буде готовий до повторного підключення, коли буде надіслано новий запит.

source: Set the debugging level. The default debug level is ``0``, meaning no debugging output is printed. Any value greater than ``0`` will cause all currently defined debug output to be printed to stdout. The ``debuglevel`` is passed to any new :class:`HTTPResponse` objects that are created.
uk: Встановіть рівень налагодження. Рівень налагодження за замовчуванням ``0``, тобто вихідні дані налагодження не друкуються. Будь-яке значення, яке перевищує ``0``, призведе до того, що весь поточний визначений вихід налагодження буде надруковано в stdout. ``debuglevel`` передається будь-яким новим об’єктам :class:`HTTPResponse`, які створюються.

source: Set the host and the port for HTTP Connect Tunnelling. This allows running the connection through a proxy server.
uk: Встановіть хост і порт для тунелювання підключення HTTP. Це дозволяє запускати підключення через проксі-сервер.

source: The host and port arguments specify the endpoint of the tunneled connection (i.e. the address included in the CONNECT request, *not* the address of the proxy server).
uk: Аргументи host і port визначають кінцеву точку тунельованого з’єднання (тобто адресу, включену в запит CONNECT, *не* адресу проксі-сервера).

source: The headers argument should be a mapping of extra HTTP headers to send with the CONNECT request.
uk: Аргумент заголовків має бути відображенням додаткових заголовків HTTP для надсилання із запитом CONNECT.

source: For example, to tunnel through a HTTPS proxy server running locally on port 8080, we would pass the address of the proxy to the :class:`HTTPSConnection` constructor, and the address of the host that we eventually want to reach to the :meth:`~HTTPConnection.set_tunnel` method::
uk: Наприклад, щоб тунелювати через проксі-сервер HTTPS, який працює локально на порту 8080, ми повинні передати адресу проксі-сервера до конструктора :class:`HTTPSConnection`, а адресу хоста, до якого ми хочемо отримати доступ, до :meth:`~HTTPConnection.set_tunnel` метод::

source: Connect to the server specified when the object was created. By default, this is called automatically when making a request if the client does not already have a connection.
uk: Підключіться до сервера, указаного під час створення об’єкта. За замовчуванням це викликається автоматично під час надсилання запиту, якщо клієнт ще не має підключення.

source: Raises an :ref:`auditing event <auditing>` ``http.client.connect`` with arguments ``self``, ``host``, ``port``.
uk: Викликає :ref:`подію аудиту <auditing>` ``http.client.connect`` з аргументами ``self``, ``host``, ``port``.

source: Close the connection to the server.
uk: Закрийте підключення до сервера.

source: Buffer size in bytes for sending a file-like message body.
uk: Розмір буфера в байтах для надсилання тіла повідомлення, схожого на файл.

source: As an alternative to using the :meth:`request` method described above, you can also send your request step by step, by using the four functions below.
uk: Як альтернативу використанню методу :meth:`request`, описаного вище, ви також можете надіслати свій запит крок за кроком, використовуючи чотири функції нижче.

source: This should be the first call after the connection to the server has been made. It sends a line to the server consisting of the *method* string, the *url* string, and the HTTP version (``HTTP/1.1``). To disable automatic sending of ``Host:`` or ``Accept-Encoding:`` headers (for example to accept additional content encodings), specify *skip_host* or *skip_accept_encoding* with non-False values.
uk: Це має бути перший виклик після підключення до сервера. Він надсилає на сервер рядок, що складається з рядка *method*, рядка *url* і версії HTTP (``HTTP/1.1``). Щоб вимкнути автоматичне надсилання заголовків ``Host:`` або ``Accept-Encoding:`` (наприклад, щоб прийняти додаткове кодування вмісту), укажіть *skip_host* або *skip_accept_encoding* зі значеннями, відмінними від False.

source: Send an :rfc:`822`\ -style header to the server. It sends a line to the server consisting of the header, a colon and a space, and the first argument. If more arguments are given, continuation lines are sent, each consisting of a tab and an argument.
uk: Надішліть на сервер заголовок у стилі :rfc:`822`\. Він надсилає на сервер рядок, що складається із заголовка, двокрапки, пробілу та першого аргументу. Якщо задано більше аргументів, надсилаються рядки продовження, кожен з яких складається з табуляції та аргументу.

source: Send a blank line to the server, signalling the end of the headers. The optional *message_body* argument can be used to pass a message body associated with the request.
uk: Надішліть порожній рядок на сервер, сигналізуючи про кінець заголовків. Додатковий аргумент *message_body* можна використовувати для передачі тіла повідомлення, пов’язаного із запитом.

source: If *encode_chunked* is ``True``, the result of each iteration of *message_body* will be chunk-encoded as specified in :rfc:`7230`, Section 3.3.1. How the data is encoded is dependent on the type of *message_body*. If *message_body* implements the :ref:`buffer interface <bufferobjects>` the encoding will result in a single chunk. If *message_body* is a :class:`collections.abc.Iterable`, each iteration of *message_body* will result in a chunk. If *message_body* is a :term:`file object`, each call to ``.read()`` will result in a chunk. The method automatically signals the end of the chunk-encoded data immediately after *message_body*.
uk: Якщо *encode_chunked* має значення ``True``, результат кожної ітерації *message_body* буде закодовано фрагментами, як зазначено в :rfc:`7230`, розділ 3.3.1. Спосіб кодування даних залежить від типу *message_body*. Якщо *message_body* реалізує :ref:`інтерфейс буфера <bufferobjects>`, кодування призведе до єдиного блоку. Якщо *message_body* є :class:`collections.abc.Iterable`, кожна ітерація *message_body* призведе до блоку. Якщо *message_body* є об’єктом :term:`file object`, кожен виклик ``.read()`` призведе до блоку. Метод автоматично сигналізує про кінець даних, закодованих фрагментами, відразу після *message_body*.

source: Due to the chunked encoding specification, empty chunks yielded by an iterator body will be ignored by the chunk-encoder. This is to avoid premature termination of the read of the request by the target server due to malformed encoding.
uk: Через специфікацію фрагментованого кодування порожні фрагменти, отримані тілом ітератора, ігноруватимуться кодувальником фрагментів. Це робиться для того, щоб уникнути передчасного припинення читання запиту цільовим сервером через неправильне кодування.

source: Chunked encoding support. The *encode_chunked* parameter was added.
uk: Підтримка фрагментованого кодування. Додано параметр *encode_chunked*.
