Repository: python/python-docs-uk
Catalog: library/http_client.po
Languages: uk

source: Send data to the server. This should be used directly only after the :meth:`endheaders` method has been called and before :meth:`getresponse` is called.
uk: Надіслати дані на сервер. Це слід використовувати безпосередньо лише після виклику методу :meth:`endheaders` і до виклику :meth:`getresponse`.

source: Raises an :ref:`auditing event <auditing>` ``http.client.send`` with arguments ``self``, ``data``.
uk: Викликає :ref:`подію аудиту <auditing>` ``http.client.send`` з аргументами ``self``, ``data``.

source: HTTPResponse Objects
uk: Об'єкти HTTPResponse

source: An :class:`HTTPResponse` instance wraps the HTTP response from the server. It provides access to the request headers and the entity body. The response is an iterable object and can be used in a with statement.
uk: Екземпляр :class:`HTTPResponse` обгортає відповідь HTTP від сервера. Він забезпечує доступ до заголовків запиту та тіла сутності. Відповідь є повторюваним об’єктом і може використовуватися в операторі with.

source: The :class:`io.BufferedIOBase` interface is now implemented and all of its reader operations are supported.
uk: Інтерфейс :class:`io.BufferedIOBase` тепер реалізовано, і всі його операції читання підтримуються.

source: Reads and returns the response body, or up to the next *amt* bytes.
uk: Читає та повертає тіло відповіді або до наступних байтів *amt*.

source: Reads up to the next len(b) bytes of the response body into the buffer *b*. Returns the number of bytes read.
uk: Зчитує до наступного len(b) байт тіла відповіді в буфер *b*. Повертає кількість прочитаних байтів.

source: Return the value of the header *name*, or *default* if there is no header matching *name*. If there is more than one header with the name *name*, return all of the values joined by ', '. If 'default' is any iterable other than a single string, its elements are similarly returned joined by commas.
uk: Повертає значення заголовка *name* або *default*, якщо заголовок не відповідає *name*. Якщо є більше одного заголовка з іменем *name*, поверніть усі значення, об’єднані ",". Якщо 'default' є будь-яким ітерованим, крім одного рядка, його елементи так само повертаються, об'єднані комами.

source: Return a list of (header, value) tuples.
uk: Повертає список кортежів (заголовок, значення).

source: Return the ``fileno`` of the underlying socket.
uk: Повертає ``fileno`` основного сокета.

source: A :class:`http.client.HTTPMessage` instance containing the response headers. :class:`http.client.HTTPMessage` is a subclass of :class:`email.message.Message`.
uk: Екземпляр :class:`http.client.HTTPMessage`, що містить заголовки відповідей. :class:`http.client.HTTPMessage` є підкласом :class:`email.message.Message`.

source: HTTP protocol version used by server. 10 for HTTP/1.0, 11 for HTTP/1.1.
uk: Версія протоколу HTTP, яку використовує сервер. 10 для HTTP/1.0, 11 для HTTP/1.1.

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
uk: URL-адреса отриманого ресурсу, яка зазвичай використовується для визначення того, чи було переспрямовано.

source: Headers of the response in the form of an :class:`email.message.EmailMessage` instance.
uk: Заголовки відповіді у формі екземпляра :class:`email.message.EmailMessage`.

source: Status code returned by server.
uk: Код статусу, повернутий сервером.

source: Reason phrase returned by server.
uk: Фраза причини, повернута сервером.

source: A debugging hook. If :attr:`debuglevel` is greater than zero, messages will be printed to stdout as the response is read and parsed.
uk: Гачок для налагодження. Якщо :attr:`debuglevel` більше нуля, повідомлення буде надруковано в стандартний вихід під час читання та аналізу відповіді.

source: Is ``True`` if the stream is closed.
uk: Значить ``True``, якщо потік закрито.

source: Deprecated in favor of :attr:`~HTTPResponse.url`.
uk: Застаріло на користь :attr:`~HTTPResponse.url`.

source: Deprecated in favor of :attr:`~HTTPResponse.headers`.
uk: Застаріло на користь :attr:`~HTTPResponse.headers`.

source: Deprecated in favor of :attr:`~HTTPResponse.status`.
uk: Застаріло на користь :attr:`~HTTPResponse.status`.

source: Examples
uk: Приклади

source: Here is an example session that uses the ``GET`` method::
uk: Ось приклад сеансу, який використовує метод ``GET``::

source: Here is an example session that uses the ``HEAD`` method. Note that the ``HEAD`` method never returns any data. ::
uk: Ось приклад сеансу, який використовує метод ``HEAD``. Зауважте, що метод ``HEAD`` ніколи не повертає жодних даних. ::

source: Here is an example session that shows how to ``POST`` requests::
uk: Ось приклад сеансу, який показує, як ``POST`` запити::

source: Client side ``HTTP PUT`` requests are very similar to ``POST`` requests. The difference lies only the server side where HTTP server will allow resources to be created via ``PUT`` request. It should be noted that custom HTTP methods are also handled in :class:`urllib.request.Request` by setting the appropriate method attribute. Here is an example session that shows how to send a ``PUT`` request using http.client::
uk: Клієнтські запити ``HTTP PUT`` дуже схожі на ``POST`` запити. Різниця полягає лише на стороні сервера, де сервер HTTP дозволить створювати ресурси за допомогою запиту ``PUT``. Слід зазначити, що спеціальні методи HTTP також обробляються в :class:`urllib.request.Request` шляхом встановлення відповідного атрибута методу. Ось приклад сеансу, який показує, як надіслати запит ``PUT`` за допомогою http.client::

source: HTTPMessage Objects
uk: Об’єкти HTTPMessage

source: An :class:`http.client.HTTPMessage` instance holds the headers from an HTTP response. It is implemented using the :class:`email.message.Message` class.
uk: Екземпляр :class:`http.client.HTTPMessage` містить заголовки відповіді HTTP. Це реалізовано за допомогою класу :class:`email.message.Message`.
