Repository: python/python-docs-uk
Catalog: library/imghdr.po
Languages: uk

source: :mod:`imghdr` --- Determine the type of an image
uk: :mod:`imghdr` --- Визначити тип зображення

source: **Source code:** :source:`Lib/imghdr.py`
uk: **Вихідний код:** :source:`Lib/imghdr.py`

source: The :mod:`imghdr` module is deprecated (see :pep:`PEP 594 <594#imghdr>` for details and alternatives).
uk: Модуль :mod:`imghdr` є застарілим (перегляньте :pep:`PEP 594 <594#imghdr>` для деталей та альтернатив).

source: The :mod:`imghdr` module determines the type of image contained in a file or byte stream.
uk: Модуль :mod:`imghdr` визначає тип зображення, що міститься у файлі чи потоці байтів.

source: The :mod:`imghdr` module defines the following function:
uk: Модуль :mod:`imghdr` визначає таку функцію:

source: Tests the image data contained in the file named by *file*, and returns a string describing the image type. If optional *h* is provided, the *file* argument is ignored and *h* is assumed to contain the byte stream to test.
uk: Перевіряє дані зображення, що містяться у файлі з іменем *file*, і повертає рядок, що описує тип зображення. Якщо вказано необов’язковий *h*, аргумент *file* ігнорується, і передбачається, що *h* містить потік байтів для перевірки.

source: Accepts a :term:`path-like object`.
uk: Приймає :term:`path-like object`.

source: The following image types are recognized, as listed below with the return value from :func:`what`:
uk: Розпізнаються наведені нижче типи зображень зі значенням, що повертається з :func:`what`:

source: Value
uk: Значення

source: Image format
uk: Формат зображення

source: SGI ImgLib Files
uk: Файли SGI ImgLib

source: GIF 87a and 89a Files
uk: Файли GIF 87a та 89a

source: Portable Bitmap Files
uk: Портативні растрові файли

source: Portable Graymap Files
uk: Портативні файли Graymap

source: Portable Pixmap Files
uk: Портативні файли Pixmap

source: TIFF Files
uk: Файли TIFF

source: Sun Raster Files
uk: Растрові файли Sun

source: X Bitmap Files
uk: Файли X Bitmap

source: JPEG data in JFIF or Exif formats
uk: Дані JPEG у форматах JFIF або Exif

source: BMP files
uk: файли BMP

source: Portable Network Graphics
uk: Портативна мережева графіка

source: WebP files
uk: Файли WebP

source: OpenEXR Files
uk: Файли OpenEXR

source: The *exr* and *webp* formats were added.
uk: Додано формати *exr* і *webp*.

source: You can extend the list of file types :mod:`imghdr` can recognize by appending to this variable:
uk: Ви можете розширити список типів файлів, які :mod:`imghdr` може розпізнати, додавши до цієї змінної:

source: A list of functions performing the individual tests. Each function takes two arguments: the byte-stream and an open file-like object. When :func:`what` is called with a byte-stream, the file-like object will be ``None``.
uk: Перелік функцій, які виконують окремі тести. Кожна функція приймає два аргументи: потік байтів і відкритий файлоподібний об’єкт. Коли :func:`what` викликається потоком байтів, файлоподібний об’єкт матиме значення ``None``.

source: The test function should return a string describing the image type if the test succeeded, or ``None`` if it failed.
uk: Функція тестування має повертати рядок із описом типу зображення, якщо тест пройшов успішно, або ``None``, якщо він не вдався.

source: Example::
uk: Приклад::
