Repository: python/python-docs-uk
Catalog: library/imp.po
Languages: uk

source: The :class:`NullImporter` type is a :pep:`302` import hook that handles non-directory path strings by failing to find any modules. Calling this type with an existing directory or empty string raises :exc:`ImportError`. Otherwise, a :class:`NullImporter` instance is returned.
uk: Тип :class:`NullImporter` — це :pep:`302` хук імпорту, який обробляє рядки шляху, не пов’язані з каталогом, не знаходячи жодного модуля. Виклик цього типу з наявним каталогом або порожнім рядком викликає :exc:`ImportError`. В іншому випадку повертається екземпляр :class:`NullImporter`.

source: Instances have only one method:
uk: Примірники мають лише один метод:

source: This method always returns ``None``, indicating that the requested module could not be found.
uk: Цей метод завжди повертає ``None``, вказуючи, що запитуваний модуль не вдалося знайти.

source: ``None`` is inserted into ``sys.path_importer_cache`` instead of an instance of :class:`NullImporter`.
uk: ``None`` вставляється в ``sys.path_importer_cache`` замість екземпляра :class:`NullImporter`.

source: Insert ``None`` into ``sys.path_importer_cache`` instead.
uk: Натомість вставте ``None`` у ``sys.path_importer_cache``.

source: Examples
uk: Приклади

source: The following function emulates what was the standard import statement up to Python 1.4 (no hierarchical module names). (This *implementation* wouldn't work in that version, since :func:`find_module` has been extended and :func:`load_module` has been added in 1.4.) ::
uk: Наступна функція емулює те, що було стандартним оператором імпорту до Python 1.4 (без ієрархічних імен модулів). (Ця *реалізація* не працюватиме в цій версії, оскільки :func:`find_module` було розширено, а :func:`load_module` додано у 1.4.) ::
