Repository: python/python-docs-uk
Catalog: library/importlib.po
Languages: uk

source: A factory function for creating a :class:`~importlib.machinery.ModuleSpec` instance based on the path to a file. Missing information will be filled in on the spec by making use of loader APIs and by the implication that the module will be file-based.
uk: Фабрична функція для створення екземпляра :class:`~importlib.machinery.ModuleSpec` на основі шляху до файлу. Відсутню інформацію буде заповнено в специфікації за допомогою API завантажувача та через те, що модуль буде заснований на файлі.

source: Return the hash of *source_bytes* as bytes. A hash-based ``.pyc`` file embeds the :func:`source_hash` of the corresponding source file's contents in its header.
uk: Повертає хеш *source_bytes* як байти. Файл ``.pyc`` на основі хешу вставляє :func:`source_hash` вмісту відповідного вихідного файлу у свій заголовок.

source: A class which postpones the execution of the loader of a module until the module has an attribute accessed.
uk: Клас, який відкладає виконання завантажувача модуля, поки модуль не отримає доступ до атрибута.

source: This class **only** works with loaders that define :meth:`~importlib.abc.Loader.exec_module` as control over what module type is used for the module is required. For those same reasons, the loader's :meth:`~importlib.abc.Loader.create_module` method must return ``None`` or a type for which its ``__class__`` attribute can be mutated along with not using :term:`slots <__slots__>`. Finally, modules which substitute the object placed into :attr:`sys.modules` will not work as there is no way to properly replace the module references throughout the interpreter safely; :exc:`ValueError` is raised if such a substitution is detected.
uk: Цей клас працює **тільки** із завантажувачами, які визначають :meth:`~importlib.abc.Loader.exec_module` як контроль над тим, який тип модуля використовується для модуля. З тих самих причин метод завантажувача :meth:`~importlib.abc.Loader.create_module` повинен повертати ``None`` або тип, для якого його атрибут ``__class__`` може бути змінений разом із невикористанням :term:`слоти <__slots__>`. Нарешті, модулі, які замінюють об’єкт, розміщений у :attr:`sys.modules`, не працюватимуть, оскільки немає способу безпечно замінити посилання на модулі в інтерпретаторі; :exc:`ValueError` викликається, якщо така заміна виявлена.

source: For projects where startup time is critical, this class allows for potentially minimizing the cost of loading a module if it is never used. For projects where startup time is not essential then use of this class is **heavily** discouraged due to error messages created during loading being postponed and thus occurring out of context.
uk: Для проектів, де час запуску є критичним, цей клас дозволяє потенційно мінімізувати вартість завантаження модуля, якщо він ніколи не використовується. Для проектів, де час запуску не є суттєвим, використання цього класу **суворо** не рекомендується через те, що повідомлення про помилки, створені під час завантаження, відкладаються та, таким чином, виникають поза контекстом.

source: Began calling :meth:`~importlib.abc.Loader.create_module`, removing the compatibility warning for :class:`importlib.machinery.BuiltinImporter` and :class:`importlib.machinery.ExtensionFileLoader`.
uk: Почався виклик :meth:`~importlib.abc.Loader.create_module`, видаляючи попередження про сумісність для :class:`importlib.machinery.BuiltinImporter` і :class:`importlib.machinery.ExtensionFileLoader`.

source: A static method which returns a callable that creates a lazy loader. This is meant to be used in situations where the loader is passed by class instead of by instance. ::
uk: Статичний метод, який повертає виклик, що створює відкладений завантажувач. Це призначено для використання в ситуаціях, коли завантажувач передається класом, а не екземпляром. ::

source: Examples
uk: Приклади

source: Importing programmatically
uk: Програмний імпорт

source: To programmatically import a module, use :func:`importlib.import_module`. ::
uk: Щоб програмно імпортувати модуль, використовуйте :func:`importlib.import_module`. ::

source: Checking if a module can be imported
uk: Перевірка можливості імпорту модуля

source: If you need to find out if a module can be imported without actually doing the import, then you should use :func:`importlib.util.find_spec`.
uk: Якщо вам потрібно з’ясувати, чи можна імпортувати модуль без фактичного імпортування, тоді вам слід скористатися :func:`importlib.util.find_spec`.

source: Note that if ``name`` is a submodule (contains a dot), :func:`importlib.util.find_spec` will import the parent module. ::
uk: Зауважте, що якщо ``name`` є підмодулем (містить крапку), :func:`importlib.util.find_spec` імпортує батьківський модуль. ::

source: Importing a source file directly
uk: Пряме імпортування вихідного файлу

source: Implementing lazy imports
uk: Реалізація відкладеного імпорту

source: The example below shows how to implement lazy imports::
uk: У прикладі нижче показано, як реалізувати відкладений імпорт:

source: Setting up an importer
uk: Налаштування імпортера

source: For deep customizations of import, you typically want to implement an :term:`importer`. This means managing both the :term:`finder` and :term:`loader` side of things. For finders there are two flavours to choose from depending on your needs: a :term:`meta path finder` or a :term:`path entry finder`. The former is what you would put on :attr:`sys.meta_path` while the latter is what you create using a :term:`path entry hook` on :attr:`sys.path_hooks` which works with :attr:`sys.path` entries to potentially create a finder. This example will show you how to register your own importers so that import will use them (for creating an importer for yourself, read the documentation for the appropriate classes defined within this package)::
uk: Для глибоких налаштувань імпорту зазвичай потрібно застосувати :term:`importer`. Це означає керування сторонами :term:`finder` і :term:`loader`. Для шукачів є два варіанти на вибір залежно від ваших потреб: :term:`meta path finder` або :term:`path entry finder`. Перше – це те, що ви б розмістили на :attr:`sys.meta_path`, тоді як останнє – це те, що ви створюєте за допомогою :term:`path entry finder` на :attr:`sys.path_hooks`, який працює з :attr:`sys.path` для потенційного створення засобу пошуку. Цей приклад покаже вам, як зареєструвати власні імпортери, щоб import використовував їх (щоб створити імпортер для себе, прочитайте документацію для відповідних класів, визначених у цьому пакеті):

source: Approximating :func:`importlib.import_module`
uk: Наближення :func:`importlib.import_module`
