Repository: python/python-docs-uk
Catalog: library/importlib.po
Languages: uk

source: From the perspective of this ABC, a *resource* is a binary artifact that is shipped within a package. Typically this is something like a data file that lives next to the ``__init__.py`` file of the package. The purpose of this class is to help abstract out the accessing of such data files so that it does not matter if the package and its data file(s) are stored in a e.g. zip file versus on the file system.
uk: З точки зору цієї ABC, *ресурс* — це бінарний артефакт, який доставляється в пакеті. Зазвичай це щось на зразок файлу даних, який знаходиться поруч із файлом ``__init__.py`` файлу пакета. Мета цього класу полягає в тому, щоб допомогти абстрагуватися від доступу до таких файлів даних, щоб не мати значення, чи зберігається пакет і його файл(и) даних у, наприклад, zip-файл проти файлової системи.

source: For any of methods of this class, a *resource* argument is expected to be a :term:`path-like object` which represents conceptually just a file name. This means that no subdirectory paths should be included in the *resource* argument. This is because the location of the package the reader is for, acts as the "directory". Hence the metaphor for directories and file names is packages and resources, respectively. This is also why instances of this class are expected to directly correlate to a specific package (instead of potentially representing multiple packages or a module).
uk: Для будь-якого методу цього класу очікується, що аргумент *resource* буде :term:`path-like object`, який концептуально представляє лише ім’я файлу. Це означає, що шляхи підкаталогів не повинні включатися в аргумент *resource*. Це пояснюється тим, що місце розташування пакета, для якого призначений зчитувач, діє як "каталог". Тому метафорою для каталогів і імен файлів є пакети та ресурси відповідно. Ось чому очікується, що екземпляри цього класу безпосередньо співвідносяться з певним пакетом (замість того, щоб потенційно представляти кілька пакетів або модуль).

source: Loaders that wish to support resource reading are expected to provide a method called ``get_resource_reader(fullname)`` which returns an object implementing this ABC's interface. If the module specified by fullname is not a package, this method should return :const:`None`. An object compatible with this ABC should only be returned when the specified module is a package.
uk: Очікується, що завантажувачі, які бажають підтримувати читання ресурсів, нададуть метод під назвою ``get_resource_reader(fullname)``, який повертає об’єкт, що реалізує цей інтерфейс ABC. Якщо модуль, указаний повним іменем, не є пакетом, цей метод має повернути :const:`None`. Об’єкт, сумісний із цим ABC, слід повертати лише тоді, коли вказаний модуль є пакетом.

source: Returns an opened, :term:`file-like object` for binary reading of the *resource*.
uk: Повертає відкритий :term:`file-like object` для двійкового читання *ресурсу*.

source: If the resource cannot be found, :exc:`FileNotFoundError` is raised.
uk: Якщо ресурс не знайдено, виникає :exc:`FileNotFoundError`.

source: Returns the file system path to the *resource*.
uk: Повертає шлях файлової системи до *ресурсу*.

source: If the resource does not concretely exist on the file system, raise :exc:`FileNotFoundError`.
uk: Якщо ресурс конкретно не існує у файловій системі, викликайте :exc:`FileNotFoundError`.

source: Returns ``True`` if the named *name* is considered a resource. :exc:`FileNotFoundError` is raised if *name* does not exist.
uk: Повертає ``True``, якщо назване *ім’я* вважається ресурсом. :exc:`FileNotFoundError` виникає, якщо *name* не існує.

source: Returns an :term:`iterable` of strings over the contents of the package. Do note that it is not required that all names returned by the iterator be actual resources, e.g. it is acceptable to return names for which :meth:`is_resource` would be false.
uk: Повертає :term:`iterable` рядків над вмістом пакета. Зауважте, що не обов’язково, щоб усі імена, які повертає ітератор, були фактичними ресурсами, наприклад. прийнятно повертати імена, для яких :meth:`is_resource` буде false.

source: Allowing non-resource names to be returned is to allow for situations where how a package and its resources are stored are known a priori and the non-resource names would be useful. For instance, returning subdirectory names is allowed so that when it is known that the package and resources are stored on the file system then those subdirectory names can be used directly.
uk: Дозволити повертати нересурсні імена, щоб дозволити ситуації, коли те, як пакет і його ресурси зберігаються, відомі апріорі, і нересурсні імена будуть корисними. Наприклад, дозволено повертати імена підкаталогів, щоб, якщо відомо, що пакет і ресурси зберігаються у файловій системі, ці імена підкаталогів можна було використовувати безпосередньо.

source: The abstract method returns an iterable of no items.
uk: Абстрактний метод повертає ітерацію без елементів.

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loading arbitrary resources from the storage back-end.
uk: Абстрактний базовий клас для :term:`loader`, який реалізує необов’язковий протокол :pep:`302` для завантаження довільних ресурсів із внутрішнього сховища.

source: This ABC is deprecated in favour of supporting resource loading through :class:`importlib.abc.ResourceReader`.
uk: Цей ABC застарів на користь підтримки завантаження ресурсів через :class:`importlib.abc.ResourceReader`.

source: An abstract method to return the bytes for the data located at *path*. Loaders that have a file-like storage back-end that allows storing arbitrary data can implement this abstract method to give direct access to the data stored. :exc:`OSError` is to be raised if the *path* cannot be found. The *path* is expected to be constructed using a module's :attr:`__file__` attribute or an item from a package's :attr:`__path__`.
uk: Абстрактний метод для повернення байтів для даних, розташованих за *шляхом*. Завантажувачі, які мають серверну систему зберігання, подібну до файлів, яка дозволяє зберігати довільні дані, можуть реалізувати цей абстрактний метод, щоб надати прямий доступ до збережених даних. :exc:`OSError` виникає, якщо *шлях* не може бути знайдений. Очікується, що *шлях* буде створено за допомогою атрибута :attr:`__file__` модуля або елемента з :attr:`__path__` пакета.

source: Raises :exc:`OSError` instead of :exc:`NotImplementedError`.
uk: Викликає :exc:`OSError` замість :exc:`NotImplementedError`.

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loaders that inspect modules.
uk: Абстрактний базовий клас для :term:`loader`, який реалізує додатковий протокол :pep:`302` для завантажувачів, які перевіряють модулі.

source: Return the code object for a module, or ``None`` if the module does not have a code object (as would be the case, for example, for a built-in module). Raise an :exc:`ImportError` if loader cannot find the requested module.
uk: Повертає об’єкт коду для модуля або ``None``, якщо модуль не має об’єкта коду (як, наприклад, у випадку вбудованого модуля). Викликати :exc:`ImportError`, якщо завантажувач не може знайти запитуваний модуль.

source: While the method has a default implementation, it is suggested that it be overridden if possible for performance.
uk: Хоча метод має реалізацію за замовчуванням, пропонується замінити його, якщо це можливо для продуктивності.

source: No longer abstract and a concrete implementation is provided.
uk: Більше не абстрактне, а конкретна реалізація.

source: An abstract method to return the source of a module. It is returned as a text string using :term:`universal newlines`, translating all recognized line separators into ``'\n'`` characters. Returns ``None`` if no source is available (e.g. a built-in module). Raises :exc:`ImportError` if the loader cannot find the module specified.
uk: Абстрактний метод для повернення вихідного коду модуля. Він повертається як текстовий рядок з використанням :term:`universal newlines`, переводячи всі розпізнані роздільники рядків у символи ``'\n'``. Повертає ``None``, якщо джерело недоступне (наприклад, вбудований модуль). Викликає :exc:`ImportError`, якщо завантажувач не може знайти вказаний модуль.

source: Raises :exc:`ImportError` instead of :exc:`NotImplementedError`.
uk: Викликає :exc:`ImportError` замість :exc:`NotImplementedError`.

source: An optional method to return a true value if the module is a package, a false value otherwise. :exc:`ImportError` is raised if the :term:`loader` cannot find the module.
uk: Додатковий метод для повернення істинного значення, якщо модуль є пакетом, і хибного значення в іншому випадку. :exc:`ImportError` виникає, якщо :term:`loader` не може знайти модуль.

source: Create a code object from Python source.
uk: Створіть об’єкт коду з джерела Python.

source: The *data* argument can be whatever the :func:`compile` function supports (i.e. string or bytes). The *path* argument should be the "path" to where the source code originated from, which can be an abstract concept (e.g. location in a zip file).
uk: Аргументом *data* може бути те, що підтримує функція :func:`compile` (тобто рядок або байти). Аргумент *path* має бути "шляхом", звідки походить вихідний код, що може бути абстрактним поняттям (наприклад, розташуванням у файлі zip).

source: With the subsequent code object one can execute it in a module by running ``exec(code, module.__dict__)``.
uk: З наступним об’єктом коду можна виконати його в модулі, запустивши ``exec(code, module.__dict__)``.

source: Made the method static.
uk: Зробив метод статичним.

source: Implementation of :meth:`Loader.exec_module`.
uk: Реалізація :meth:`Loader.exec_module`.

source: Implementation of :meth:`Loader.load_module`.
uk: Реалізація :meth:`Loader.load_module`.

source: use :meth:`exec_module` instead.
uk: замість цього використовуйте :meth:`exec_module`.

source: An abstract base class which inherits from :class:`InspectLoader` that, when implemented, helps a module to be executed as a script. The ABC represents an optional :pep:`302` protocol.
uk: Абстрактний базовий клас, успадкований від :class:`InspectLoader`, який, реалізований, допомагає модулю виконуватися як сценарій. ABC представляє необов’язковий протокол :pep:`302`.

source: An abstract method that is to return the value of :attr:`__file__` for the specified module. If no path is available, :exc:`ImportError` is raised.
uk: Абстрактний метод, який повертає значення :attr:`__file__` для зазначеного модуля. Якщо шлях недоступний, виникає :exc:`ImportError`.

source: If source code is available, then the method should return the path to the source file, regardless of whether a bytecode was used to load the module.
uk: Якщо вихідний код доступний, тоді метод має повертати шлях до вихідного файлу, незалежно від того, чи використовувався байт-код для завантаження модуля.

source: An abstract base class which inherits from :class:`ResourceLoader` and :class:`ExecutionLoader`, providing concrete implementations of :meth:`ResourceLoader.get_data` and :meth:`ExecutionLoader.get_filename`.
uk: Абстрактний базовий клас, який успадковує :class:`ResourceLoader` і :class:`ExecutionLoader`, надаючи конкретні реалізації :meth:`ResourceLoader.get_data` і :meth:`ExecutionLoader.get_filename`.

source: The *fullname* argument is a fully resolved name of the module the loader is to handle. The *path* argument is the path to the file for the module.
uk: Аргумент *повне ім’я* — це повністю визначене ім’я модуля, який має обробляти завантажувач. Аргумент *path* — це шлях до файлу модуля.

source: The name of the module the loader can handle.
uk: Назва модуля, який може обробляти завантажувач.

source: Path to the file of the module.
uk: Шлях до файлу модуля.

source: Calls super's ``load_module()``.
uk: Викликає ``load_module()`` супер.

source: Use :meth:`Loader.exec_module` instead.
uk: Натомість використовуйте :meth:`Loader.exec_module`.

source: Returns :attr:`path`.
uk: Повертає :attr:`path`.

source: Reads *path* as a binary file and returns the bytes from it.
uk: Читає *шлях* як двійковий файл і повертає байти з нього.

source: An abstract base class for implementing source (and optionally bytecode) file loading. The class inherits from both :class:`ResourceLoader` and :class:`ExecutionLoader`, requiring the implementation of:
uk: Абстрактний базовий клас для реалізації вихідного (і необов’язково байт-коду) завантаження файлу. Клас успадковує як :class:`ResourceLoader`, так і :class:`ExecutionLoader`, що вимагає реалізації:

source: Should only return the path to the source file; sourceless loading is not supported.
uk: Має повертати лише шлях до вихідного файлу; завантаження без джерел не підтримується.

source: The abstract methods defined by this class are to add optional bytecode file support. Not implementing these optional methods (or causing them to raise :exc:`NotImplementedError`) causes the loader to only work with source code. Implementing the methods allows the loader to work with source *and* bytecode files; it does not allow for *sourceless* loading where only bytecode is provided. Bytecode files are an optimization to speed up loading by removing the parsing step of Python's compiler, and so no bytecode-specific API is exposed.
uk: Абстрактні методи, визначені цим класом, призначені для додавання додаткової підтримки файлу байт-коду. Нереалізація цих додаткових методів (або виклик їх :exc:`NotImplementedError`) змушує завантажувач працювати лише з вихідним кодом. Реалізація методів дозволяє завантажувачу працювати з вихідними *та* файлами байт-коду; він не допускає *безджерельного* завантаження, де надається лише байт-код. Файли байт-коду є оптимізацією для прискорення завантаження шляхом видалення кроку синтаксичного аналізу компілятора Python, тому API, специфічний для байт-коду, не розкривається.

source: Optional abstract method which returns a :class:`dict` containing metadata about the specified path. Supported dictionary keys are:
uk: Додатковий абстрактний метод, який повертає :class:`dict`, що містить метадані про вказаний шлях. Підтримувані ключі словника:

source: ``'mtime'`` (mandatory): an integer or floating-point number representing the modification time of the source code;
uk: ``'mtime'`` (обов'язковий): ціле число або число з плаваючою комою, що представляє час модифікації вихідного коду;

source: ``'size'`` (optional): the size in bytes of the source code.
uk: ``'size'`` (необов'язковий): розмір у байтах вихідного коду.

source: Any other keys in the dictionary are ignored, to allow for future extensions. If the path cannot be handled, :exc:`OSError` is raised.
uk: Будь-які інші ключі в словнику ігноруються, щоб дозволити майбутні розширення. Якщо шлях не можна обробити, виникає :exc:`OSError`.

source: Raise :exc:`OSError` instead of :exc:`NotImplementedError`.
uk: Викликати :exc:`OSError` замість :exc:`NotImplementedError`.

source: Optional abstract method which returns the modification time for the specified path.
uk: Додатковий абстрактний метод, який повертає час модифікації для вказаного шляху.

source: This method is deprecated in favour of :meth:`path_stats`. You don't have to implement it, but it is still available for compatibility purposes. Raise :exc:`OSError` if the path cannot be handled.
uk: Цей метод застарів на користь :meth:`path_stats`. Вам не потрібно його впроваджувати, але він все ще доступний для цілей сумісності. Викликати :exc:`OSError`, якщо шлях неможливо обробити.

source: Optional abstract method which writes the specified bytes to a file path. Any intermediate directories which do not exist are to be created automatically.
uk: Додатковий абстрактний метод, який записує вказані байти в шлях до файлу. Будь-які проміжні каталоги, яких не існує, створюються автоматично.

source: When writing to the path fails because the path is read-only (:attr:`errno.EACCES`/:exc:`PermissionError`), do not propagate the exception.
uk: Якщо запис у шлях не вдається через те, що шлях доступний лише для читання (:attr:`errno.EACCES`/:exc:`PermissionError`), не поширюйте виняткову ситуацію.

source: No longer raises :exc:`NotImplementedError` when called.
uk: Більше не викликає :exc:`NotImplementedError` під час виклику.

source: Concrete implementation of :meth:`InspectLoader.get_code`.
uk: Конкретна реалізація :meth:`InspectLoader.get_code`.

source: Concrete implementation of :meth:`Loader.exec_module`.
uk: Конкретна реалізація :meth:`Loader.exec_module`.

source: Concrete implementation of :meth:`Loader.load_module`.
uk: Конкретна реалізація :meth:`Loader.load_module`.

source: Use :meth:`exec_module` instead.
uk: Замість цього використовуйте :meth:`exec_module`.

source: Concrete implementation of :meth:`InspectLoader.get_source`.
uk: Конкретна реалізація :meth:`InspectLoader.get_source`.

source: Concrete implementation of :meth:`InspectLoader.is_package`. A module is determined to be a package if its file path (as provided by :meth:`ExecutionLoader.get_filename`) is a file named ``__init__`` when the file extension is removed **and** the module name itself does not end in ``__init__``.
uk: Конкретна реалізація :meth:`InspectLoader.is_package`. Модуль вважається пакетом, якщо його шлях до файлу (як надано :meth:`ExecutionLoader.get_filename`) є файлом з назвою ``__init__``, коли розширення файлу видалено **і** сама назва модуля не закінчується на ``__init__``.

source: An object with a subset of pathlib.Path methods suitable for traversing directories and opening files.
uk: Об’єкт із підмножиною методів pathlib.Path, придатних для обходу каталогів і відкриття файлів.

source: Yield Traversable objects in self.
uk: Прибуток Traversable об'єктів в себе.

source: Return True if self is a directory.
uk: Повертає True, якщо self є каталогом.

source: Return True if self is a file.
uk: Повертає True, якщо self є файлом.

source: Return Traversable child in self.
uk: Повернення Прохідної дитини в себе.

source: *mode* may be 'r' or 'rb' to open as text or binary. Return a handle suitable for reading (same as :attr:`pathlib.Path.open`).
uk: *mode* може бути "r" або "rb", щоб відкрити як текстовий або двійковий файл. Повертає дескриптор, придатний для читання (те саме, що :attr:`pathlib.Path.open`).

source: When opening as text, accepts encoding parameters such as those accepted by :attr:`io.TextIOWrapper`.
uk: Коли відкривається як текст, приймає параметри кодування, такі як ті, які приймає :attr:`io.TextIOWrapper`.

source: Read contents of self as bytes.
uk: Читати вміст себе як байти.

source: Read contents of self as text.
uk: Прочитати вміст себе як текст.

source: Loaders that wish to support resource reading are expected to implement this interface.
uk: Очікується, що завантажувачі, які бажають підтримувати читання ресурсів, реалізують цей інтерфейс.

source: :mod:`importlib.machinery` -- Importers and path hooks
uk: :mod:`importlib.machinery` -- Імпортери та перехоплювачі шляху

source: **Source code:** :source:`Lib/importlib/machinery.py`
uk: **Вихідний код:** :source:`Lib/importlib/machinery.py`

source: This module contains the various objects that help :keyword:`import` find and load modules.
uk: Цей модуль містить різноманітні об’єкти, які допомагають :keyword:`import` знаходити та завантажувати модулі.

source: A list of strings representing the recognized file suffixes for source modules.
uk: Список рядків, що представляють розпізнані суфікси файлів для вихідних модулів.

source: A list of strings representing the file suffixes for non-optimized bytecode modules.
uk: Список рядків, що представляють суфікси файлів для неоптимізованих модулів байт-коду.

source: Use :attr:`BYTECODE_SUFFIXES` instead.
uk: Натомість використовуйте :attr:`BYTECODE_SUFFIXES`.

source: A list of strings representing the file suffixes for optimized bytecode modules.
uk: Список рядків, що представляють суфікси файлів для оптимізованих модулів байт-коду.

source: A list of strings representing the recognized file suffixes for bytecode modules (including the leading dot).
uk: Список рядків, що представляють розпізнані суфікси файлів для модулів байт-коду (включно з початковою крапкою).

source: The value is no longer dependent on ``__debug__``.
uk: Значення більше не залежить від ``__debug__``.

source: A list of strings representing the recognized file suffixes for extension modules.
uk: Список рядків, що представляють розпізнані суфікси файлів для модулів розширення.

source: Returns a combined list of strings representing all file suffixes for modules recognized by the standard import machinery. This is a helper for code which simply needs to know if a filesystem path potentially refers to a module without needing any details on the kind of module (for example, :func:`inspect.getmodulename`).
uk: Повертає комбінований список рядків, що представляють усі суфікси файлів для модулів, розпізнаних стандартним механізмом імпорту. Це допоміжний засіб для коду, якому просто потрібно знати, чи шлях до файлової системи потенційно посилається на модуль, не потребуючи жодних деталей щодо типу модуля (наприклад, :func:`inspect.getmodulename`).

source: An :term:`importer` for built-in modules. All known built-in modules are listed in :data:`sys.builtin_module_names`. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
uk: :term:`importer` для вбудованих модулів. Усі відомі вбудовані модулі перераховані в :data:`sys.builtin_module_names`. Цей клас реалізує ABC :class:`importlib.abc.MetaPathFinder` і :class:`importlib.abc.InspectLoader`.

source: Only class methods are defined by this class to alleviate the need for instantiation.
uk: У цьому класі визначені лише методи класу, щоб полегшити потребу в створенні екземплярів.

source: As part of :pep:`489`, the builtin importer now implements :meth:`Loader.create_module` and :meth:`Loader.exec_module`
uk: Як частина :pep:`489`, вбудований імпортер тепер реалізує :meth:`Loader.create_module` і :meth:`Loader.exec_module`

source: An :term:`importer` for frozen modules. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
uk: :term:`importer` для заморожених модулів. Цей клас реалізує ABC :class:`importlib.abc.MetaPathFinder` і :class:`importlib.abc.InspectLoader`.

source: Gained :meth:`~Loader.create_module` and :meth:`~Loader.exec_module` methods.
uk: Отримано методи :meth:`~Loader.create_module` і :meth:`~Loader.exec_module`.

source: :term:`Finder <finder>` for modules declared in the Windows registry. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
uk: :term:`Finder <finder>` для модулів, оголошених у реєстрі Windows. Цей клас реалізує :class:`importlib.abc.MetaPathFinder` ABC.

source: Use :mod:`site` configuration instead. Future versions of Python may not enable this finder by default.
uk: Натомість використовуйте конфігурацію :mod:`site`. Майбутні версії Python можуть не вмикати цей засіб пошуку за замовчуванням.

source: A :term:`Finder <finder>` for :data:`sys.path` and package ``__path__`` attributes. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
uk: A :term:`Finder <finder>` для атрибутів :data:`sys.path` і пакета ``__path__``. Цей клас реалізує :class:`importlib.abc.MetaPathFinder` ABC.
