Repository: python/python-docs-uk
Catalog: library/importlib.po
Languages: uk

source: :mod:`!importlib` --- The implementation of :keyword:`!import`
uk: :mod:`!importlib` --- Реалізація :keyword:`!import`

source: **Source code:** :source:`Lib/importlib/__init__.py`
uk: **Вихідний код:** :source:`Lib/importlib/__init__.py`

source: Introduction
uk: вступ

source: Two, the components to implement :keyword:`import` are exposed in this package, making it easier for users to create their own custom objects (known generically as an :term:`importer`) to participate in the import process.
uk: По-друге, компоненти для реалізації :keyword:`import` представлені в цьому пакунку, що полегшує користувачам створення власних користувацьких об’єктів (відомих загалом як :term:`importer`) для участі в процесі імпорту.

source: The language reference for the :keyword:`import` statement.
uk: Посилання на мову для оператора :keyword:`import`.

source: `Packages specification <https://www.python.org/doc/essays/packages/>`__
uk: `Специфікація пакетів <https://www.python.org/doc/essays/packages/>`__

source: Original specification of packages. Some semantics have changed since the writing of this document (e.g. redirecting based on ``None`` in :data:`sys.modules`).
uk: Оригінальна специфікація пакетів. Деяка семантика змінилася з моменту написання цього документа (наприклад, переспрямування на основі ``None`` у :data:`sys.modules`).

source: The :func:`.__import__` function
uk: Функція :func:`.__import__`

source: The :keyword:`import` statement is syntactic sugar for this function.
uk: Оператор :keyword:`import` є синтаксичним цукром для цієї функції.

source: Import on Case-Insensitive Platforms
uk: Імпорт на платформи без урахування регістру

source: Defining Python Source Code Encodings
uk: Визначення кодувань вихідного коду Python

source: New Import Hooks
uk: Нові гачки імпорту

source: Imports: Multi-Line and Absolute/Relative
uk: Імпорт: багаторядковий і абсолютний/відносний

source: Main module explicit relative imports
uk: Явний відносний імпорт головного модуля

source: Implicit namespace packages
uk: Неявні пакети простору імен

source: A ModuleSpec Type for the Import System
uk: Тип ModuleSpec для системи імпорту

source: Elimination of PYO files
uk: Видалення файлів PYO

source: Multi-phase extension module initialization
uk: Багатофазна ініціалізація модуля розширення

source: Deterministic pycs
uk: Детерміновані фото

source: Using UTF-8 as the Default Source Encoding
uk: Використання UTF-8 як вихідного кодування за умовчанням

source: PYC Repository Directories
uk: Каталоги репозиторіїв PYC

source: Functions
uk: Функції

source: An implementation of the built-in :func:`__import__` function.
uk: Реалізація вбудованої функції :func:`__import__`.

source: Programmatic importing of modules should use :func:`import_module` instead of this function.
uk: Програмне імпортування модулів має використовувати :func:`import_module` замість цієї функції.

source: Import a module. The *name* argument specifies what module to import in absolute or relative terms (e.g. either ``pkg.mod`` or ``..mod``). If the name is specified in relative terms, then the *package* argument must be set to the name of the package which is to act as the anchor for resolving the package name (e.g. ``import_module('..mod', 'pkg.subpkg')`` will import ``pkg.mod``).
uk: Імпортувати модуль. Аргумент *name* визначає, який модуль імпортувати в абсолютних чи відносних значеннях (наприклад, ``pkg.mod`` або ``..mod``). Якщо ім’я вказано у відносних термінах, тоді в аргументі *package* має бути встановлено ім’я пакета, який має діяти як прив’язка для визначення імені пакета (наприклад, ``import_module('..mod', 'pkg' .subpkg')`` імпортує ``pkg.mod``).

source: The :func:`import_module` function acts as a simplifying wrapper around :func:`importlib.__import__`. This means all semantics of the function are derived from :func:`importlib.__import__`. The most important difference between these two functions is that :func:`import_module` returns the specified package or module (e.g. ``pkg.mod``), while :func:`__import__` returns the top-level package or module (e.g. ``pkg``).
uk: Функція :func:`import_module` діє як спрощена оболонка навколо :func:`importlib.__import__`. Це означає, що вся семантика функції походить від :func:`importlib.__import__`. Найважливіша відмінність між цими двома функціями полягає в тому, що :func:`import_module` повертає вказаний пакунок або модуль (наприклад, ``pkg.mod``), а :func:`__import__` повертає пакунок або модуль верхнього рівня (напр. ``пакет``).

source: If you are dynamically importing a module that was created since the interpreter began execution (e.g., created a Python source file), you may need to call :func:`invalidate_caches` in order for the new module to be noticed by the import system.
uk: Якщо ви динамічно імпортуєте модуль, який було створено після того, як інтерпретатор почав виконання (наприклад, створив вихідний файл Python), вам може знадобитися викликати :func:`invalidate_caches`, щоб система імпорту помітила новий модуль.

source: Parent packages are automatically imported.
uk: Батьківські пакети імпортуються автоматично.

source: Find the loader for a module, optionally within the specified *path*. If the module is in :attr:`sys.modules`, then ``sys.modules[name].__loader__`` is returned (unless the loader would be ``None`` or is not set, in which case :exc:`ValueError` is raised). Otherwise a search using :attr:`sys.meta_path` is done. ``None`` is returned if no loader is found.
uk: Знайдіть завантажувач для модуля, необов’язково в межах указаного *шляху*. Якщо модуль знаходиться в :attr:`sys.modules`, тоді повертається ``sys.modules[name].__loader__`` (якщо завантажувач не буде ``None`` або не встановлено, у такому випадку :exc:`ValueError` виникає). В іншому випадку виконується пошук за допомогою :attr:`sys.meta_path`. ``None`` повертається, якщо завантажувач не знайдено.

source: A dotted name does not have its parents implicitly imported as that requires loading them and that may not be desired. To properly import a submodule you will need to import all parent packages of the submodule and use the correct argument to *path*.
uk: Ім’я з крапками не має неявно імпортованих батьків, оскільки це вимагає їх завантаження, а це може бути небажаним. Щоб правильно імпортувати підмодуль, вам потрібно буде імпортувати всі батьківські пакети підмодуля та використати правильний аргумент для *шляху*.

source: If ``__loader__`` is not set, raise :exc:`ValueError`, just like when the attribute is set to ``None``.
uk: Якщо ``__loader__`` не встановлено, викличте :exc:`ValueError`, так само, як коли для атрибута встановлено значення ``None``.

source: Use :func:`importlib.util.find_spec` instead.
uk: Натомість використовуйте :func:`importlib.util.find_spec`.

source: Invalidate the internal caches of finders stored at :data:`sys.meta_path`. If a finder implements ``invalidate_caches()`` then it will be called to perform the invalidation. This function should be called if any modules are created/installed while your program is running to guarantee all finders will notice the new module's existence.
uk: Визнати недійсними внутрішні кеші засобів пошуку, які зберігаються в :data:`sys.meta_path`. Якщо засіб пошуку реалізує ``invalidate_caches()``, тоді він буде викликаний для виконання недійсності. Цю функцію слід викликати, якщо будь-які модулі створюються/встановлюються під час роботи вашої програми, щоб гарантувати, що всі шукачі помітять існування нового модуля.

source: Reload a previously imported *module*. The argument must be a module object, so it must have been successfully imported before. This is useful if you have edited the module source file using an external editor and want to try out the new version without leaving the Python interpreter. The return value is the module object (which can be different if re-importing causes a different object to be placed in :data:`sys.modules`).
uk: Перезавантажте раніше імпортований *модуль*. Аргумент має бути об’єктом модуля, тому він має бути успішно імпортований раніше. Це корисно, якщо ви відредагували вихідний файл модуля за допомогою зовнішнього редактора і хочете випробувати нову версію, не виходячи з інтерпретатора Python. Поверненим значенням є об’єкт модуля (який може бути іншим, якщо повторне імпортування спричиняє розміщення іншого об’єкта в :data:`sys.modules`).

source: When :func:`reload` is executed:
uk: Коли :func:`reload` виконується:

source: Python module's code is recompiled and the module-level code re-executed, defining a new set of objects which are bound to names in the module's dictionary by reusing the :term:`loader` which originally loaded the module. The ``init`` function of extension modules is not called a second time.
uk: Код модуля Python перекомпілюється, а код рівня модуля повторно виконується, визначаючи новий набір об’єктів, які прив’язуються до імен у словнику модуля шляхом повторного використання :term:`loader`, який початково завантажив модуль. Функція ``init`` модулів розширення не викликається вдруге.

source: As with all other objects in Python the old objects are only reclaimed after their reference counts drop to zero.
uk: Як і у випадку з усіма іншими об’єктами в Python, старі об’єкти відновлюються лише після того, як їх кількість посилань зменшується до нуля.

source: The names in the module namespace are updated to point to any new or changed objects.
uk: Імена в просторі імен модуля оновлюються, щоб вказувати на будь-які нові або змінені об’єкти.

source: Other references to the old objects (such as names external to the module) are not rebound to refer to the new objects and must be updated in each namespace where they occur if that is desired.
uk: Інші посилання на старі об’єкти (наприклад, імена, зовнішні по відношенню до модуля) не повертаються до нових об’єктів і повинні бути оновлені в кожному просторі імен, де вони зустрічаються, якщо це потрібно.

source: There are a number of other caveats:
uk: Існує ряд інших застережень:

source: When a module is reloaded, its dictionary (containing the module's global variables) is retained. Redefinitions of names will override the old definitions, so this is generally not a problem. If the new version of a module does not define a name that was defined by the old version, the old definition remains. This feature can be used to the module's advantage if it maintains a global table or cache of objects --- with a :keyword:`try` statement it can test for the table's presence and skip its initialization if desired::
uk: Коли модуль перезавантажується, його словник (що містить глобальні змінні модуля) зберігається. Перевизначення імен замінить старі визначення, тому це, як правило, не проблема. Якщо нова версія модуля не визначає назву, яка була визначена старою версією, старе визначення залишається. Цю функцію можна використовувати на користь модуля, якщо він підтримує глобальну таблицю або кеш об’єктів --- за допомогою оператора :keyword:`try` він може перевірити наявність таблиці та за бажанням пропустити її ініціалізацію::

source: It is generally not very useful to reload built-in or dynamically loaded modules. Reloading :mod:`sys`, :mod:`__main__`, :mod:`builtins` and other key modules is not recommended. In many cases extension modules are not designed to be initialized more than once, and may fail in arbitrary ways when reloaded.
uk: Зазвичай не дуже корисно перезавантажувати вбудовані або динамічно завантажувані модулі. Перезавантажувати :mod:`sys`, :mod:`__main__`, :mod:`builtins` та інші ключові модулі не рекомендується. У багатьох випадках модулі розширення не призначені для ініціалізації більше одного разу, і можуть виникати будь-які збої під час перезавантаження.

source: If a module imports objects from another module using :keyword:`from` ... :keyword:`import` ..., calling :func:`reload` for the other module does not redefine the objects imported from it --- one way around this is to re-execute the :keyword:`!from` statement, another is to use :keyword:`!import` and qualified names (*module.name*) instead.
uk: Якщо модуль імпортує об’єкти з іншого модуля за допомогою :keyword:`from` ... :keyword:`import` ..., виклик :func:`reload` для іншого модуля не перевизначає об’єкти, імпортовані з нього --- один із способів обійти це — повторно виконати оператор :keyword:`!from`, інший — використати замість нього :keyword:`!import` і кваліфіковані імена (*module.name*).

source: If a module instantiates instances of a class, reloading the module that defines the class does not affect the method definitions of the instances --- they continue to use the old class definition. The same is true for derived classes.
uk: Якщо модуль створює екземпляри класу, перезавантаження модуля, який визначає клас, не впливає на визначення методів екземплярів --- вони продовжують використовувати старе визначення класу. Те саме стосується похідних класів.

source: :exc:`ModuleNotFoundError` is raised when the module being reloaded lacks a :class:`~importlib.machinery.ModuleSpec`.
uk: :exc:`ModuleNotFoundError` виникає, коли модуль, який перезавантажується, не має :class:`~importlib.machinery.ModuleSpec`.

source: :mod:`importlib.abc` -- Abstract base classes related to import
uk: :mod:`importlib.abc` -- Абстрактні базові класи, пов'язані з імпортом

source: **Source code:** :source:`Lib/importlib/abc.py`
uk: **Вихідний код:** :source:`Lib/importlib/abc.py`

source: The :mod:`importlib.abc` module contains all of the core abstract base classes used by :keyword:`import`. Some subclasses of the core abstract base classes are also provided to help in implementing the core ABCs.
uk: Модуль :mod:`importlib.abc` містить усі основні абстрактні базові класи, які використовуються :keyword:`import`. Деякі підкласи основних абстрактних базових класів також надаються для допомоги в реалізації основних ABC.

source: ABC hierarchy::
uk: Ієрархія ABC::

source: An abstract base class representing a :term:`finder`.
uk: Абстрактний базовий клас, що представляє :term:`finder`.

source: Use :class:`MetaPathFinder` or :class:`PathEntryFinder` instead.
uk: Замість цього використовуйте :class:`MetaPathFinder` або :class:`PathEntryFinder`.

source: An abstract method for finding a :term:`loader` for the specified module. Originally specified in :pep:`302`, this method was meant for use in :data:`sys.meta_path` and in the path-based import subsystem.
uk: Абстрактний метод пошуку :term:`loader` для вказаного модуля. Спочатку вказаний у :pep:`302`, цей метод був призначений для використання в :data:`sys.meta_path` і в підсистемі імпорту на основі шляху.

source: Returns ``None`` when called instead of raising :exc:`NotImplementedError`.
uk: Повертає ``None`` під час виклику замість виклику :exc:`NotImplementedError`.

source: Implement :meth:`MetaPathFinder.find_spec` or :meth:`PathEntryFinder.find_spec` instead.
uk: Натомість застосуйте :meth:`MetaPathFinder.find_spec` або :meth:`PathEntryFinder.find_spec`.

source: An abstract base class representing a :term:`meta path finder`.
uk: Абстрактний базовий клас, що представляє :term:`meta path finder`.

source: No longer a subclass of :class:`Finder`.
uk: Більше не є підкласом :class:`Finder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. If this is a top-level import, *path* will be ``None``. Otherwise, this is a search for a subpackage or module and *path* will be the value of :attr:`__path__` from the parent package. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``MetaPathFinders``.
uk: Абстрактний метод для пошуку :term:`spec <module spec>` для вказаного модуля. Якщо це імпорт верхнього рівня, *path* матиме значення ``None``. В іншому випадку це буде пошук підпакета або модуля, і *path* буде значенням :attr:`__path__` з батьківського пакета. Якщо специфікацію неможливо знайти, повертається ``None``. Коли передано, ``target`` є об’єктом модуля, який шукач може використовувати, щоб зробити більш освічене припущення про те, яку специфікацію потрібно повернути. :func:`importlib.util.spec_from_loader` може бути корисним для реалізації конкретних ``MetaPathFinders``.

source: A legacy method for finding a :term:`loader` for the specified module. If this is a top-level import, *path* will be ``None``. Otherwise, this is a search for a subpackage or module and *path* will be the value of :attr:`__path__` from the parent package. If a loader cannot be found, ``None`` is returned.
uk: Застарілий метод пошуку :term:`loader` для вказаного модуля. Якщо це імпорт верхнього рівня, *path* матиме значення ``None``. В іншому випадку це буде пошук підпакета або модуля, і *path* буде значенням :attr:`__path__` з батьківського пакета. Якщо завантажувач не знайдено, повертається ``None``.

source: If :meth:`find_spec` is defined, backwards-compatible functionality is provided.
uk: Якщо визначено :meth:`find_spec`, надається функція зворотної сумісності.

source: Returns ``None`` when called instead of raising :exc:`NotImplementedError`. Can use :meth:`find_spec` to provide functionality.
uk: Повертає ``None`` під час виклику замість виклику :exc:`NotImplementedError`. Можна використовувати :meth:`find_spec` для забезпечення функціональності.

source: Use :meth:`find_spec` instead.
uk: Замість цього використовуйте :meth:`find_spec`.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :func:`importlib.invalidate_caches` when invalidating the caches of all finders on :data:`sys.meta_path`.
uk: Додатковий метод, який під час виклику має зробити недійсним будь-який внутрішній кеш, який використовує шукач. Використовується :func:`importlib.invalidate_caches` під час визнання недійсними кешів усіх засобів пошуку на :data:`sys.meta_path`.

source: Returns ``None`` when called instead of ``NotImplemented``.
uk: Повертає ``None`` під час виклику замість ``NotImplemented``.

source: An abstract base class representing a :term:`path entry finder`. Though it bears some similarities to :class:`MetaPathFinder`, ``PathEntryFinder`` is meant for use only within the path-based import subsystem provided by :class:`importlib.machinery.PathFinder`.
uk: Абстрактний базовий клас, що представляє :term:`path entry finder`. Хоча він має певну схожість із :class:`MetaPathFinder`, ``PathEntryFinder`` призначений для використання лише в підсистемі імпорту на основі шляху, яку надає :class:`importlib.machinery.PathFinder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. The finder will search for the module only within the :term:`path entry` to which it is assigned. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``PathEntryFinders``.
uk: Абстрактний метод для пошуку :term:`spec <module spec>` для вказаного модуля. Шукач шукатиме модуль лише в межах :term:`path entry`, якому він призначений. Якщо специфікацію неможливо знайти, повертається ``None``. Коли передано, ``target`` є об’єктом модуля, який шукач може використовувати, щоб зробити більш освічене припущення про те, яку специфікацію потрібно повернути. :func:`importlib.util.spec_from_loader` може бути корисним для реалізації конкретних ``PathEntryFinders``.

source: A legacy method for finding a :term:`loader` for the specified module. Returns a 2-tuple of ``(loader, portion)`` where ``portion`` is a sequence of file system locations contributing to part of a namespace package. The loader may be ``None`` while specifying ``portion`` to signify the contribution of the file system locations to a namespace package. An empty list can be used for ``portion`` to signify the loader is not part of a namespace package. If ``loader`` is ``None`` and ``portion`` is the empty list then no loader or location for a namespace package were found (i.e. failure to find anything for the module).
uk: Застарілий метод для пошуку :term:`loader` для вказаного модуля. Повертає 2-кортеж ``(loader, portion)``, де ``portion`` – це послідовність розташувань файлової системи, що входять до частини пакета простору імен. Завантажувач може мати значення ``None``, коли вказано ``portion``, щоб позначити внесок розташування файлової системи в пакет простору імен. Порожній список можна використовувати для ``portion``, щоб вказати, що завантажувач не є частиною пакета простору імен. Якщо ``завантажувач`` має значення ``None``, а ``порція`` є порожнім списком, тоді не знайдено завантажувача або розташування для пакета простору імен (тобто неможливо знайти нічого для модуля).

source: If :meth:`find_spec` is defined then backwards-compatible functionality is provided.
uk: Якщо визначено :meth:`find_spec`, то надається функція зворотної сумісності.

source: Returns ``(None, [])`` instead of raising :exc:`NotImplementedError`. Uses :meth:`find_spec` when available to provide functionality.
uk: Повертає ``(None, [])`` замість виклику :exc:`NotImplementedError`. Використовує :meth:`find_spec`, коли доступний, щоб забезпечити функціональність.

source: A concrete implementation of :meth:`Finder.find_module` which is equivalent to ``self.find_loader(fullname)[0]``.
uk: Конкретна реалізація :meth:`Finder.find_module`, яка еквівалентна ``self.find_loader(fullname)[0]``.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :meth:`importlib.machinery.PathFinder.invalidate_caches` when invalidating the caches of all cached finders.
uk: Додатковий метод, який під час виклику має зробити недійсним будь-який внутрішній кеш, який використовує шукач. Використовується :meth:`importlib.machinery.PathFinder.invalidate_caches` під час визнання недійсними кешів усіх кешованих засобів пошуку.

source: An abstract base class for a :term:`loader`. See :pep:`302` for the exact definition for a loader.
uk: Абстрактний базовий клас для :term:`loader`. Перегляньте :pep:`302` для точного визначення завантажувача.

source: A method that returns the module object to use when importing a module. This method may return ``None``, indicating that default module creation semantics should take place.
uk: Метод, який повертає об’єкт модуля для використання під час імпорту модуля. Цей метод може повертати ``None``, вказуючи, що семантика створення модуля за замовчуванням має мати місце.

source: When :meth:`exec_module` is available then backwards-compatible functionality is provided.
uk: Коли :meth:`exec_module` доступний, тоді надається функція зворотної сумісності.

source: Made optional instead of an abstractmethod.
uk: Зроблено необов’язковим замість абстрактного методу.

source: The import machinery now takes care of this automatically.
uk: Імпортний механізм тепер подбає про це автоматично.

source: *Superseded by TraversableResources*
uk: *Замінено TraversableResources*

source: An :term:`abstract base class` to provide the ability to read *resources*.
uk: :term:`abstract base class` для надання можливості читати *ресурси*.
