Repository: python/python-docs-uk
Catalog: library/intro.po
Languages: uk

source: Introduction
uk: Вступ

source: The "Python library" contains several different kinds of components.
uk: "Бібліотека Python" містить кілька різних видів компонентів.

source: It contains data types that would normally be considered part of the "core" of a language, such as numbers and lists. For these types, the Python language core defines the form of literals and places some constraints on their semantics, but does not fully define the semantics. (On the other hand, the language core does define syntactic properties like the spelling and priorities of operators.)
uk: Він містить типи даних, які зазвичай вважаються частиною "ядра" мови, наприклад числа та списки. Для цих типів ядро мови Python визначає форму літералів і накладає деякі обмеження на їх семантику, але не повністю визначає семантику. (З іншого боку, ядро мови визначає синтаксичні властивості, такі як правопис і пріоритети операторів.)

source: The library also contains built-in functions and exceptions --- objects that can be used by all Python code without the need of an :keyword:`import` statement. Some of these are defined by the core language, but many are not essential for the core semantics and are only described here.
uk: Бібліотека також містить вбудовані функції та винятки --- об’єкти, які можуть використовуватися всім кодом Python без необхідності оператора :keyword:`import`. Деякі з них визначені основною мовою, але багато з них не є суттєвими для основної семантики та описані лише тут.

source: The bulk of the library, however, consists of a collection of modules. There are many ways to dissect this collection. Some modules are written in C and built in to the Python interpreter; others are written in Python and imported in source form. Some modules provide interfaces that are highly specific to Python, like printing a stack trace; some provide interfaces that are specific to particular operating systems, such as access to specific hardware; others provide interfaces that are specific to a particular application domain, like the World Wide Web. Some modules are available in all versions and ports of Python; others are only available when the underlying system supports or requires them; yet others are available only when a particular configuration option was chosen at the time when Python was compiled and installed.
uk: Основна частина бібліотеки, однак, складається з набору модулів. Є багато способів розібрати цю колекцію. Деякі модулі написані мовою C і вбудовані в інтерпретатор Python; інші написані на Python та імпортовані у вихідній формі. Деякі модулі надають інтерфейси, дуже специфічні для Python, як-от друк трасування стека; деякі надають інтерфейси, які є специфічними для конкретних операційних систем, наприклад доступ до певного апаратного забезпечення; інші надають інтерфейси, які є специфічними для конкретного домену програми, наприклад Всесвітньої павутини. Деякі модулі доступні в усіх версіях і портах Python; інші доступні лише тоді, коли базова система їх підтримує або вимагає; ще інші доступні лише тоді, коли певний параметр конфігурації було вибрано під час компіляції та встановлення Python.

source: This manual is organized "from the inside out:" it first describes the built-in functions, data types and exceptions, and finally the modules, grouped in chapters of related modules.
uk: Цей посібник організовано "зсередини назовні": спочатку в ньому описано вбудовані функції, типи даних і винятки, а нарешті — модулі, згруповані в розділи пов’язаних модулів.

source: This means that if you start reading this manual from the start, and skip to the next chapter when you get bored, you will get a reasonable overview of the available modules and application areas that are supported by the Python library. Of course, you don't *have* to read it like a novel --- you can also browse the table of contents (in front of the manual), or look for a specific function, module or term in the index (in the back). And finally, if you enjoy learning about random subjects, you choose a random page number (see module :mod:`random`) and read a section or two. Regardless of the order in which you read the sections of this manual, it helps to start with chapter :ref:`built-in-funcs`, as the remainder of the manual assumes familiarity with this material.
uk: Це означає, що якщо ви почнете читати цей посібник із самого початку та перейдете до наступного розділу, коли вам стане нудно, ви отримаєте розумний огляд доступних модулів і областей застосування, які підтримуються бібліотекою Python. Звичайно, ви не *повинні* читати це як роман --- ви також можете переглянути зміст (перед посібником) або шукати певну функцію, модуль або термін в покажчику (у спина). І, нарешті, якщо вам подобається вивчати випадкові теми, ви обираєте випадковий номер сторінки (дивіться модуль :mod:`random`) і читаєте розділ або два. Незалежно від порядку, в якому ви читаєте розділи цього посібника, корисно почати з розділу :ref:`built-in-funcs`, оскільки решта посібника передбачає знайомство з цим матеріалом.

source: Let the show begin!
uk: Нехай шоу почнеться!

source: Notes on availability
uk: Примітки щодо наявності

source: An "Availability: Unix" note means that this function is commonly found on Unix systems. It does not make any claims about its existence on a specific operating system.
uk: Примітка "Доступність: Unix" означає, що ця функція зазвичай зустрічається в системах Unix. Він не робить жодних заяв про його існування в конкретній операційній системі.

source: If not separately noted, all functions that claim "Availability: Unix" are supported on macOS, which builds on a Unix core.
uk: Якщо не зазначено окремо, усі функції, які заявляють про "Доступність: Unix", підтримуються в macOS, яка побудована на ядрі Unix.
