Repository: python/python-docs-uk
Catalog: library/io.po
Languages: uk

source: :mod:`io` --- Core tools for working with streams
uk: :mod:`io` --- Основні інструменти для роботи з потоками

source: **Source code:** :source:`Lib/io.py`
uk: **Вихідний код:** :source:`Lib/io.py`

source: Overview
uk: Огляд

source: The :mod:`io` module provides Python's main facilities for dealing with various types of I/O. There are three main types of I/O: *text I/O*, *binary I/O* and *raw I/O*. These are generic categories, and various backing stores can be used for each of them. A concrete object belonging to any of these categories is called a :term:`file object`. Other common terms are *stream* and *file-like object*.
uk: Модуль :mod:`io` надає основні можливості Python для роботи з різними типами введення-виведення. Існує три основні типи введення-виведення: *текстовий ввід-вивід*, *бінарний ввід-вивід* і *необроблений ввід-вивід*. Це загальні категорії, і для кожної з них можна використовувати різні резервні сховища. Конкретний об’єкт, що належить до будь-якої з цих категорій, називається :term:`file object`. Іншими поширеними термінами є *потік* і *файлоподібний об’єкт*.

source: Independent of its category, each concrete stream object will also have various capabilities: it can be read-only, write-only, or read-write. It can also allow arbitrary random access (seeking forwards or backwards to any location), or only sequential access (for example in the case of a socket or pipe).
uk: Незалежно від категорії, кожен конкретний об’єкт потоку також матиме різні можливості: він може бути лише для читання, лише для запису або для читання-запису. Він також може дозволити довільний довільний доступ (пошук вперед або назад до будь-якого місця) або лише послідовний доступ (наприклад, у випадку розетки чи труби).

source: All streams are careful about the type of data you give to them. For example giving a :class:`str` object to the ``write()`` method of a binary stream will raise a :exc:`TypeError`. So will giving a :class:`bytes` object to the ``write()`` method of a text stream.
uk: Усі потоки уважно ставляться до типу даних, які ви їм надаєте. Наприклад, якщо додати об’єкт :class:`str` до методу ``write()`` бінарного потоку, виникне :exc:`TypeError`. Так само буде передано об’єкт :class:`bytes` методу ``write()`` текстового потоку.

source: Operations that used to raise :exc:`IOError` now raise :exc:`OSError`, since :exc:`IOError` is now an alias of :exc:`OSError`.
uk: Операції, які раніше викликали :exc:`IOError`, тепер викликають :exc:`OSError`, оскільки :exc:`IOError` тепер є псевдонімом :exc:`OSError`.

source: Text I/O
uk: Текстовий ввід/вивід

source: Text I/O expects and produces :class:`str` objects. This means that whenever the backing store is natively made of bytes (such as in the case of a file), encoding and decoding of data is made transparently as well as optional translation of platform-specific newline characters.
uk: Текстовий ввід-вивід очікує та створює об’єкти :class:`str`. Це означає, що щоразу, коли резервне сховище спочатку складається з байтів (наприклад, у випадку файлу), кодування та декодування даних здійснюється прозоро, а також необов’язковий переклад символів нового рядка, характерних для платформи.

source: The easiest way to create a text stream is with :meth:`open()`, optionally specifying an encoding::
uk: Найпростіший спосіб створити текстовий потік за допомогою :meth:`open()`, додатково вказавши кодування::

source: In-memory text streams are also available as :class:`StringIO` objects::
uk: Текстові потоки в пам’яті також доступні як об’єкти :class:`StringIO`::

source: The text stream API is described in detail in the documentation of :class:`TextIOBase`.
uk: API текстового потоку детально описано в документації :class:`TextIOBase`.

source: Binary I/O
uk: Бінарний ввід-вивід

source: Binary I/O (also called *buffered I/O*) expects :term:`bytes-like objects <bytes-like object>` and produces :class:`bytes` objects. No encoding, decoding, or newline translation is performed. This category of streams can be used for all kinds of non-text data, and also when manual control over the handling of text data is desired.
uk: Двійковий ввід-вивід (також званий *буферизований ввід-вивід*) очікує :term:`байт-подібні об'єкти <bytes-like object>` і створює об’єкти :class:`bytes`. Кодування, декодування чи переклад нового рядка не виконується. Цю категорію потоків можна використовувати для всіх видів нетекстових даних, а також, коли потрібне ручне керування обробкою текстових даних.

source: The easiest way to create a binary stream is with :meth:`open()` with ``'b'`` in the mode string::
uk: Найпростіший спосіб створити двійковий потік за допомогою :meth:`open()` з ``'b'`` у рядку режиму::

source: In-memory binary streams are also available as :class:`BytesIO` objects::
uk: Двійкові потоки в пам’яті також доступні як об’єкти :class:`BytesIO`::

source: The binary stream API is described in detail in the docs of :class:`BufferedIOBase`.
uk: API бінарного потоку детально описано в документах :class:`BufferedIOBase`.

source: Other library modules may provide additional ways to create text or binary streams. See :meth:`socket.socket.makefile` for example.
uk: Інші бібліотечні модулі можуть надавати додаткові способи створення текстових або бінарних потоків. Дивіться, наприклад, :meth:`socket.socket.makefile`.

source: Raw I/O
uk: Необроблений ввід-вивід

source: Raw I/O (also called *unbuffered I/O*) is generally used as a low-level building-block for binary and text streams; it is rarely useful to directly manipulate a raw stream from user code. Nevertheless, you can create a raw stream by opening a file in binary mode with buffering disabled::
uk: Необроблений ввід-вивід (також званий *небуферизований ввід-вивід*) зазвичай використовується як низькорівневий будівельний блок для двійкових і текстових потоків; рідко буває корисним безпосередньо маніпулювати необробленим потоком із коду користувача. Тим не менш, ви можете створити необроблений потік, відкривши файл у бінарному режимі з вимкненою буферизацією:

source: The raw stream API is described in detail in the docs of :class:`RawIOBase`.
uk: API необробленого потоку детально описано в документах :class:`RawIOBase`.

source: Text Encoding
uk: Кодування тексту

source: However, many developers forget to specify the encoding when opening text files encoded in UTF-8 (e.g. JSON, TOML, Markdown, etc...) since most Unix platforms use UTF-8 locale by default. This causes bugs because the locale encoding is not UTF-8 for most Windows users. For example::
uk: Однак багато розробників забувають вказати кодування під час відкриття текстових файлів, закодованих у UTF-8 (наприклад, JSON, TOML, Markdown тощо), оскільки більшість платформ Unix за умовчанням використовують локаль UTF-8. Це спричиняє помилки, оскільки кодування мови не є UTF-8 для більшості користувачів Windows. Наприклад::

source: Additionally, while there is no concrete plan as of yet, Python may change the default text file encoding to UTF-8 in the future.
uk: Крім того, хоча наразі немає конкретного плану, у майбутньому Python може змінити стандартне кодування текстового файлу на UTF-8.

source: Accordingly, it is highly recommended that you specify the encoding explicitly when opening text files. If you want to use UTF-8, pass ``encoding="utf-8"``. To use the current locale encoding, ``encoding="locale"`` is supported in Python 3.10.
uk: Відповідно, настійно рекомендується явно вказувати кодування під час відкриття текстових файлів. Якщо ви хочете використовувати UTF-8, передайте ``encoding="utf-8"``. Щоб використовувати поточне кодування мови, ``encoding="locale"`` підтримується в Python 3.10.

source: When you need to run existing code on Windows that attempts to open UTF-8 files using the default locale encoding, you can enable the UTF-8 mode. See :ref:`UTF-8 mode on Windows <win-utf8-mode>`.
uk: Якщо вам потрібно запустити існуючий код у Windows, який намагається відкрити файли UTF-8, використовуючи стандартне кодування мови, ви можете ввімкнути режим UTF-8. Перегляньте :ref:`Режим UTF-8 у Windows <win-utf8-mode>`.

source: Opt-in EncodingWarning
uk: Увімкніть EncodingWarning

source: See :pep:`597` for more details.
uk: Дивіться :pep:`597` для більш детальної інформації.

source: To find where the default locale encoding is used, you can enable the ``-X warn_default_encoding`` command line option or set the :envvar:`PYTHONWARNDEFAULTENCODING` environment variable, which will emit an :exc:`EncodingWarning` when the default encoding is used.
uk: Щоб дізнатися, де використовується кодування мови за замовчуванням, ви можете ввімкнути параметр командного рядка ``-X warn_default_encoding`` або встановити змінну середовища :envvar:`PYTHONWARNDEFAULTENCODING`, яка видасть :exc:`EncodingWarning`, коли кодування за замовчуванням використовується.

source: If you are providing an API that uses :func:`open` or :class:`TextIOWrapper` and passes ``encoding=None`` as a parameter, you can use :func:`text_encoding` so that callers of the API will emit an :exc:`EncodingWarning` if they don't pass an ``encoding``. However, please consider using UTF-8 by default (i.e. ``encoding="utf-8"``) for new APIs.
uk: Якщо ви надаєте API, який використовує :func:`open` або :class:`TextIOWrapper` і передає ``encoding=None`` як параметр, ви можете використовувати :func:`text_encoding`, щоб абоненти API могли видають :exc:`EncodingWarning`, якщо вони не передають ``encoding``. Однак розгляньте можливість використання UTF-8 за умовчанням (тобто ``encoding="utf-8"``) для нових API.

source: High-level Module Interface
uk: Інтерфейс модуля високого рівня

source: An int containing the default buffer size used by the module's buffered I/O classes. :func:`open` uses the file's blksize (as obtained by :func:`os.stat`) if possible.
uk: Int, що містить стандартний розмір буфера, який використовується буферизованими класами вводу-виводу модуля. :func:`open` використовує blksize файлу (отриманий :func:`os.stat`), якщо це можливо.

source: This is an alias for the builtin :func:`open` function.
uk: Це псевдонім вбудованої функції :func:`open`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode``, ``flags``.
uk: Викликає :ref:`подію аудиту <auditing>` ``open`` з аргументами ``path``, ``mode``, ``flags``.

source: This function raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode`` and ``flags``. The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
uk: Ця функція викликає :ref:`подію аудиту <auditing>` ``open`` з аргументами ``path``, ``mode`` і ``flags``. Аргументи ``mode`` і ``flags`` могли бути змінені або виведені з початкового виклику.

source: Opens the provided file with mode ``'rb'``. This function should be used when the intent is to treat the contents as executable code.
uk: Відкриває наданий файл у режимі ``'rb``. Цю функцію слід використовувати, коли мається на меті розглядати вміст як виконуваний код.

source: ``path`` should be a :class:`str` and an absolute path.
uk: ``path`` має бути :class:`str` і абсолютним шляхом.

source: The behavior of this function may be overridden by an earlier call to the :c:func:`PyFile_SetOpenCodeHook`. However, assuming that ``path`` is a :class:`str` and an absolute path, ``open_code(path)`` should always behave the same as ``open(path, 'rb')``. Overriding the behavior is intended for additional validation or preprocessing of the file.
uk: Поведінка цієї функції може бути замінена попереднім викликом :c:func:`PyFile_SetOpenCodeHook`. Однак, припускаючи, що ``path`` є :class:`str` і абсолютним шляхом, ``open_code(path)`` завжди повинен поводитися так само, як ``open(path, 'rb')``. Перевизначення поведінки призначене для додаткової перевірки або попередньої обробки файлу.

source: This is a helper function for callables that use :func:`open` or :class:`TextIOWrapper` and have an ``encoding=None`` parameter.
uk: Це допоміжна функція для викликів, які використовують :func:`open` або :class:`TextIOWrapper` і мають параметр ``encoding=None``.

source: In this example, an :class:`EncodingWarning` is emitted for the caller of ``read_text()``.
uk: У цьому прикладі :class:`EncodingWarning` видається для викликаючого ``read_text()``.

source: See :ref:`io-text-encoding` for more information.
uk: Перегляньте :ref:`io-text-encoding` для отримання додаткової інформації.

source: This is a compatibility alias for the builtin :exc:`BlockingIOError` exception.
uk: Це псевдонім сумісності для вбудованого винятку :exc:`BlockingIOError`.

source: An exception inheriting :exc:`OSError` and :exc:`ValueError` that is raised when an unsupported operation is called on a stream.
uk: Виняток, що успадковує :exc:`OSError` і :exc:`ValueError`, який виникає, коли в потоці викликається непідтримувана операція.

source: contains the standard IO streams: :data:`sys.stdin`, :data:`sys.stdout`, and :data:`sys.stderr`.
uk: містить стандартні потоки вводу-виводу: :data:`sys.stdin`, :data:`sys.stdout` і :data:`sys.stderr`.

source: Class hierarchy
uk: Ієрархія класів

source: The implementation of I/O streams is organized as a hierarchy of classes. First :term:`abstract base classes <abstract base class>` (ABCs), which are used to specify the various categories of streams, then concrete classes providing the standard stream implementations.
uk: Реалізація потоків введення-виведення організована як ієрархія класів. Спочатку :term:`абстрактні базові класи <abstract base class>` (ABC), які використовуються для визначення різних категорій потоків, потім конкретні класи, що забезпечують реалізацію стандартних потоків.

source: The abstract base classes also provide default implementations of some methods in order to help implementation of concrete stream classes. For example, :class:`BufferedIOBase` provides unoptimized implementations of :meth:`~IOBase.readinto` and :meth:`~IOBase.readline`.
uk: Абстрактні базові класи також забезпечують реалізацію за замовчуванням деяких методів, щоб допомогти реалізації конкретних класів потоку. Наприклад, :class:`BufferedIOBase` забезпечує неоптимізовану реалізацію :meth:`~IOBase.readinto` і :meth:`~IOBase.readline`.

source: At the top of the I/O hierarchy is the abstract base class :class:`IOBase`. It defines the basic interface to a stream. Note, however, that there is no separation between reading and writing to streams; implementations are allowed to raise :exc:`UnsupportedOperation` if they do not support a given operation.
uk: На вершині ієрархії введення-виведення знаходиться абстрактний базовий клас :class:`IOBase`. Він визначає базовий інтерфейс для потоку. Зауважте, однак, що немає розділення між читанням і записом у потоки; реалізаціям дозволено викликати :exc:`UnsupportedOperation`, якщо вони не підтримують дану операцію.

source: The :class:`RawIOBase` ABC extends :class:`IOBase`. It deals with the reading and writing of bytes to a stream. :class:`FileIO` subclasses :class:`RawIOBase` to provide an interface to files in the machine's file system.
uk: :class:`RawIOBase` ABC розширює :class:`IOBase`. Він займається читанням і записом байтів у потік. :class:`FileIO` підкласи :class:`RawIOBase` для надання інтерфейсу до файлів у файловій системі машини.

source: The :class:`BufferedIOBase` ABC extends :class:`IOBase`. It deals with buffering on a raw binary stream (:class:`RawIOBase`). Its subclasses, :class:`BufferedWriter`, :class:`BufferedReader`, and :class:`BufferedRWPair` buffer raw binary streams that are readable, writable, and both readable and writable, respectively. :class:`BufferedRandom` provides a buffered interface to seekable streams. Another :class:`BufferedIOBase` subclass, :class:`BytesIO`, is a stream of in-memory bytes.
uk: :class:`BufferedIOBase` ABC розширює :class:`IOBase`. Він стосується буферизації необробленого двійкового потоку (:class:`RawIOBase`). Його підкласи :class:`BufferedWriter`, :class:`BufferedReader` і :class:`BufferedRWPair` буферизують необроблені бінарні потоки, які доступні для читання, запису, а також як для читання, так і для запису відповідно. :class:`BufferedRandom` надає буферизований інтерфейс для пошукових потоків. Інший підклас :class:`BufferedIOBase`, :class:`BytesIO`, є потоком байтів у пам’яті.

source: The :class:`TextIOBase` ABC extends :class:`IOBase`. It deals with streams whose bytes represent text, and handles encoding and decoding to and from strings. :class:`TextIOWrapper`, which extends :class:`TextIOBase`, is a buffered text interface to a buffered raw stream (:class:`BufferedIOBase`). Finally, :class:`StringIO` is an in-memory stream for text.
uk: :class:`TextIOBase` ABC розширює :class:`IOBase`. Він має справу з потоками, байти яких представляють текст, і обробляє кодування та декодування до та з рядків. :class:`TextIOWrapper`, який розширює :class:`TextIOBase`, є буферизованим текстовим інтерфейсом для буферизованого необробленого потоку (:class:`BufferedIOBase`). Нарешті, :class:`StringIO` — це потік тексту в пам’яті.

source: Argument names are not part of the specification, and only the arguments of :func:`open` are intended to be used as keyword arguments.
uk: Назви аргументів не є частиною специфікації, і лише аргументи :func:`open` призначені для використання як аргументи ключових слів.

source: The following table summarizes the ABCs provided by the :mod:`io` module:
uk: У наведеній нижче таблиці підсумовуються азбуки, надані модулем :mod:`io`:

source: Inherits
uk: Успадковує

source: Stub Methods
uk: Методи заглушки

source: Mixin Methods and Properties
uk: Методи та властивості Міксіна

source: ``fileno``, ``seek``, and ``truncate``
uk: ``fileno``, ``seek`` і ``truncate``

source: ``close``, ``closed``, ``__enter__``, ``__exit__``, ``flush``, ``isatty``, ``__iter__``, ``__next__``, ``readable``, ``readline``, ``readlines``, ``seekable``, ``tell``, ``writable``, and ``writelines``
uk: ``close``, ``closed``, ``__enter__``, ``__exit__``, ``flush``, ``isatty``, ``__iter__``, ``__next__``, ``readable``, ``readline``, ``readlines``, ``seekable``, ``tell``, ``writable`` і ``writelines``

source: ``readinto`` and ``write``
uk: ``readinto`` і ``write``

source: Inherited :class:`IOBase` methods, ``read``, and ``readall``
uk: Успадковані методи :class:`IOBase`, ``read`` і ``readall``

source: ``detach``, ``read``, ``read1``, and ``write``
uk: ``detach``, ``read``, ``read1`` і ``write``

source: Inherited :class:`IOBase` methods, ``readinto``, and ``readinto1``
uk: Успадковані методи :class:`IOBase`, ``readinto`` і ``readinto1``

source: ``detach``, ``read``, ``readline``, and ``write``
uk: ``detach``, ``read``, ``readline`` і ``write``

source: Inherited :class:`IOBase` methods, ``encoding``, ``errors``, and ``newlines``
uk: Успадковані методи :class:`IOBase`, ``encoding``, ``errors`` та ``newlines``

source: I/O Base Classes
uk: Базові класи введення/виведення

source: The abstract base class for all I/O classes.
uk: Абстрактний базовий клас для всіх класів введення-виведення.

source: This class provides empty abstract implementations for many methods that derived classes can override selectively; the default implementations represent a file that cannot be read, written or seeked.
uk: Цей клас забезпечує порожні абстрактні реалізації для багатьох методів, які похідні класи можуть вибірково перевизначати; реалізація за замовчуванням представляє файл, який не можна прочитати, записати або шукати.

source: Even though :class:`IOBase` does not declare :meth:`read` or :meth:`write` because their signatures will vary, implementations and clients should consider those methods part of the interface. Also, implementations may raise a :exc:`ValueError` (or :exc:`UnsupportedOperation`) when operations they do not support are called.
uk: Незважаючи на те, що :class:`IOBase` не оголошує :meth:`read` або :meth:`write`, оскільки їхні підписи відрізнятимуться, реалізація та клієнти повинні розглядати ці методи як частину інтерфейсу. Крім того, реалізації можуть викликати помилку :exc:`ValueError` (або :exc:`UnsupportedOperation`), коли викликаються операції, які вони не підтримують.

source: The basic type used for binary data read from or written to a file is :class:`bytes`. Other :term:`bytes-like objects <bytes-like object>` are accepted as method arguments too. Text I/O classes work with :class:`str` data.
uk: Основний тип, який використовується для зчитування чи запису у файл двійкових даних, це :class:`bytes`. Інші :term:`байтоподібні об’єкти <bytes-like object>` також приймаються як аргументи методу. Текстові класи введення/виведення працюють з даними :class:`str`.

source: Note that calling any method (even inquiries) on a closed stream is undefined. Implementations may raise :exc:`ValueError` in this case.
uk: Зверніть увагу, що виклик будь-якого методу (навіть запитів) у закритому потоці не визначений. У цьому випадку реалізації можуть викликати :exc:`ValueError`.

source: :class:`IOBase` (and its subclasses) supports the iterator protocol, meaning that an :class:`IOBase` object can be iterated over yielding the lines in a stream. Lines are defined slightly differently depending on whether the stream is a binary stream (yielding bytes), or a text stream (yielding character strings). See :meth:`~IOBase.readline` below.
uk: :class:`IOBase` (та його підкласи) підтримує протокол ітератора, що означає, що об’єкт :class:`IOBase` може повторюватися, повертаючи рядки в потік. Рядки визначаються дещо по-різному залежно від того, чи є потік двійковим потоком (передає байти) чи текстовим потоком (передає рядки символів). Див. :meth:`~IOBase.readline` нижче.

source: :class:`IOBase` is also a context manager and therefore supports the :keyword:`with` statement. In this example, *file* is closed after the :keyword:`!with` statement's suite is finished---even if an exception occurs::
uk: :class:`IOBase` також є контекстним менеджером і тому підтримує оператор :keyword:`with`. У цьому прикладі *файл* закривається після завершення набору інструкцій :keyword:`!with` --- навіть якщо виникає виняток::

source: :class:`IOBase` provides these data attributes and methods:
uk: :class:`IOBase` надає такі атрибути даних і методи:

source: Flush and close this stream. This method has no effect if the file is already closed. Once the file is closed, any operation on the file (e.g. reading or writing) will raise a :exc:`ValueError`.
uk: Промийте та закрийте цей потік. Цей метод не діє, якщо файл уже закрито. Після закриття файлу будь-яка операція з файлом (наприклад, читання або запис) викличе :exc:`ValueError`.

source: As a convenience, it is allowed to call this method more than once; only the first call, however, will have an effect.
uk: Для зручності цей метод можна викликати кілька разів; але лише перший дзвінок матиме ефект.

source: ``True`` if the stream is closed.
uk: ``True``, якщо потік закрито.

source: Return the underlying file descriptor (an integer) of the stream if it exists. An :exc:`OSError` is raised if the IO object does not use a file descriptor.
uk: Повертає базовий дескриптор файлу (ціле число) потоку, якщо він існує. :exc:`OSError` виникає, якщо об’єкт IO не використовує дескриптор файлу.

source: Flush the write buffers of the stream if applicable. This does nothing for read-only and non-blocking streams.
uk: Очистіть буфери запису потоку, якщо це можливо. Це нічого не робить для потоків лише для читання та неблокуючих потоків.

source: Return ``True`` if the stream is interactive (i.e., connected to a terminal/tty device).
uk: Повертає ``True``, якщо потік інтерактивний (тобто підключений до терміналу/пристрою tty).

source: Return ``True`` if the stream can be read from. If ``False``, :meth:`read` will raise :exc:`OSError`.
uk: Повертає ``True``, якщо потік можна прочитати. Якщо ``False``, :meth:`read` викличе :exc:`OSError`.
