Repository: python/python-docs-uk
Catalog: library/io.po
Languages: uk

source: Text I/O over a binary storage (such as a file) is significantly slower than binary I/O over the same storage, because it requires conversions between unicode and binary data using a character codec. This can become noticeable handling huge amounts of text data like large log files. Also, :meth:`TextIOWrapper.tell` and :meth:`TextIOWrapper.seek` are both quite slow due to the reconstruction algorithm used.
uk: Текстовий ввід-вивід у двійковому сховищі (наприклад, у файлі) значно повільніший, ніж двійковий ввід-вивід у тому самому сховищі, оскільки вимагає перетворення між Юнікодом і двійковими даними за допомогою символьного кодека. Це може стати помітним під час обробки величезних обсягів текстових даних, таких як великі файли журналу. Крім того, :meth:`TextIOWrapper.tell` і :meth:`TextIOWrapper.seek` обидва досить повільні через використаний алгоритм реконструкції.

source: :class:`StringIO`, however, is a native in-memory unicode container and will exhibit similar speed to :class:`BytesIO`.
uk: :class:`StringIO`, однак, є власним контейнером Юнікоду в пам’яті та демонструватиме таку ж швидкість, як :class:`BytesIO`.

source: Multi-threading
uk: Багатопотоковість

source: :class:`FileIO` objects are thread-safe to the extent that the operating system calls (such as ``read(2)`` under Unix) they wrap are thread-safe too.
uk: Об’єкти :class:`FileIO` є потокобезпечними в тій мірі, в якій виклики операційної системи (наприклад, ``read(2)`` під Unix), які вони обертають, також є потокобезпечними.

source: Binary buffered objects (instances of :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` and :class:`BufferedRWPair`) protect their internal structures using a lock; it is therefore safe to call them from multiple threads at once.
uk: Бінарні буферизовані об’єкти (екземпляри :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` і :class:`BufferedRWPair`) захищають свої внутрішні структури за допомогою блокування; тому безпечно викликати їх із кількох потоків одночасно.

source: :class:`TextIOWrapper` objects are not thread-safe.
uk: Об’єкти :class:`TextIOWrapper` не є потокобезпечними.

source: Reentrancy
uk: Повторна вхідність

source: Binary buffered objects (instances of :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` and :class:`BufferedRWPair`) are not reentrant. While reentrant calls will not happen in normal situations, they can arise from doing I/O in a :mod:`signal` handler. If a thread tries to re-enter a buffered object which it is already accessing, a :exc:`RuntimeError` is raised. Note this doesn't prohibit a different thread from entering the buffered object.
uk: Двійкові буферизовані об’єкти (екземпляри :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` і :class:`BufferedRWPair`) не є реентерабельними. Хоча реентерабельні виклики не відбуваються у звичайних ситуаціях, вони можуть виникнути внаслідок виконання введення/виведення в обробнику :mod:`signal`. Якщо потік намагається повторно ввести буферизований об’єкт, до якого він уже має доступ, виникає :exc:`RuntimeError`. Зауважте, що це не забороняє іншому потоку входити в буферизований об’єкт.

source: The above implicitly extends to text files, since the :func:`open()` function will wrap a buffered object inside a :class:`TextIOWrapper`. This includes standard streams and therefore affects the built-in :func:`print()` function as well.
uk: Вищезазначене неявно поширюється на текстові файли, оскільки функція :func:`open()` загорне буферизований об’єкт у :class:`TextIOWrapper`. Це стосується стандартних потоків і, отже, також впливає на вбудовану функцію :func:`print()`.
