Repository: python/python-docs-uk
Catalog: library/io.po
Languages: uk

source: When reading data from this object, a larger amount of data may be requested from the underlying raw stream, and kept in an internal buffer. The buffered data can then be returned directly on subsequent reads.
uk: Під час зчитування даних із цього об’єкта більший обсяг даних може бути запрошений із базового необробленого потоку та зберігатися у внутрішньому буфері. Потім буферизовані дані можна повернути безпосередньо під час наступних читань.

source: The constructor creates a :class:`BufferedReader` for the given readable *raw* stream and *buffer_size*. If *buffer_size* is omitted, :data:`DEFAULT_BUFFER_SIZE` is used.
uk: Конструктор створює :class:`BufferedReader` для даного доступного для читання потоку *raw* і *buffer_size*. Якщо *buffer_size* опущено, :data:`DEFAULT_BUFFER_SIZE` використовується.

source: :class:`BufferedReader` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
uk: :class:`BufferedReader` надає або замінює ці методи на додаток до методів з :class:`BufferedIOBase` і :class:`IOBase`:

source: Return bytes from the stream without advancing the position. At most one single read on the raw stream is done to satisfy the call. The number of bytes returned may be less or more than requested.
uk: Повернути байти з потоку без просування позиції. Щоб задовольнити виклик, виконується щонайбільше одне читання необробленого потоку. Кількість повернених байтів може бути меншою або більшою за запитувану.

source: Read and return *size* bytes, or if *size* is not given or negative, until EOF or if the read call would block in non-blocking mode.
uk: Читання та повернення байтів *size* або, якщо *size* не задано або має від’ємне значення, до EOF або якщо виклик read заблокує в неблокуючому режимі.

source: Read and return up to *size* bytes with only one call on the raw stream. If at least one byte is buffered, only buffered bytes are returned. Otherwise, one raw stream read call is made.
uk: Читайте та повертайте до *size* байтів лише одним викликом необробленого потоку. Якщо принаймні один байт буферизується, повертаються лише буферизовані байти. В іншому випадку виконується один виклик читання необробленого потоку.

source: A buffered binary stream providing higher-level access to a writeable, non seekable :class:`RawIOBase` raw binary stream. It inherits :class:`BufferedIOBase`.
uk: Буферизований двійковий потік, що забезпечує доступ вищого рівня до доступного для запису, без пошуку :class:`RawIOBase` необробленого двійкового потоку. Він успадковує :class:`BufferedIOBase`.

source: When writing to this object, data is normally placed into an internal buffer. The buffer will be written out to the underlying :class:`RawIOBase` object under various conditions, including:
uk: Під час запису в цей об’єкт дані зазвичай поміщаються у внутрішній буфер. Буфер буде записано в базовий об’єкт :class:`RawIOBase` за різних умов, зокрема:

source: when the buffer gets too small for all pending data;
uk: коли буфер стає занадто малим для всіх незавершених даних;

source: when :meth:`flush()` is called;
uk: коли викликається :meth:`flush()`;

source: when a :meth:`seek()` is requested (for :class:`BufferedRandom` objects);
uk: коли запитується :meth:`seek()` (для об’єктів :class:`BufferedRandom`);

source: when the :class:`BufferedWriter` object is closed or destroyed.
uk: коли об’єкт :class:`BufferedWriter` закрито або знищено.

source: The constructor creates a :class:`BufferedWriter` for the given writeable *raw* stream. If the *buffer_size* is not given, it defaults to :data:`DEFAULT_BUFFER_SIZE`.
uk: Конструктор створює :class:`BufferedWriter` для заданого записуваного *необробленого* потоку. Якщо *buffer_size* не вказано, за умовчанням він :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedWriter` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
uk: :class:`BufferedWriter` надає або замінює ці методи на додаток до методів з :class:`BufferedIOBase` і :class:`IOBase`:

source: Force bytes held in the buffer into the raw stream. A :exc:`BlockingIOError` should be raised if the raw stream blocks.
uk: Примусове переміщення байтів, що зберігаються в буфері, у необроблений потік. :exc:`BlockingIOError` має бути викликано, якщо необроблений потік блокується.

source: Write the :term:`bytes-like object`, *b*, and return the number of bytes written. When in non-blocking mode, a :exc:`BlockingIOError` is raised if the buffer needs to be written out but the raw stream blocks.
uk: Запишіть :term:`bytes-like object`, *b*, і поверніть кількість записаних байтів. У неблокуючому режимі виникає :exc:`BlockingIOError`, якщо буфер потрібно виписати, але вихідний потік блокується.

source: A buffered binary stream providing higher-level access to a seekable :class:`RawIOBase` raw binary stream. It inherits :class:`BufferedReader` and :class:`BufferedWriter`.
uk: Буферизований двійковий потік, що забезпечує доступ вищого рівня до доступного для пошуку бінарного потоку :class:`RawIOBase`. Він успадковує :class:`BufferedReader` і :class:`BufferedWriter`.

source: The constructor creates a reader and writer for a seekable raw stream, given in the first argument. If the *buffer_size* is omitted it defaults to :data:`DEFAULT_BUFFER_SIZE`.
uk: Конструктор створює читач і записувач для шуканого необробленого потоку, заданого в першому аргументі. Якщо *buffer_size* опущено, за замовчуванням буде :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedRandom` is capable of anything :class:`BufferedReader` or :class:`BufferedWriter` can do. In addition, :meth:`seek` and :meth:`tell` are guaranteed to be implemented.
uk: :class:`BufferedRandom` здатний на все, що можуть зробити :class:`BufferedReader` або :class:`BufferedWriter`. Крім того, :meth:`seek` і :meth:`tell` гарантовано будуть реалізовані.

source: A buffered binary stream providing higher-level access to two non seekable :class:`RawIOBase` raw binary streams---one readable, the other writeable. It inherits :class:`BufferedIOBase`.
uk: Буферизований двійковий потік, що надає доступ вищого рівня до двох необроблених двійкових потоків :class:`RawIOBase` --- один доступний для читання, інший доступний для запису. Він успадковує :class:`BufferedIOBase`.

source: *reader* and *writer* are :class:`RawIOBase` objects that are readable and writeable respectively. If the *buffer_size* is omitted it defaults to :data:`DEFAULT_BUFFER_SIZE`.
uk: *reader* і *writer* є об’єктами :class:`RawIOBase`, які доступні для читання та запису відповідно. Якщо *buffer_size* опущено, за замовчуванням буде :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedRWPair` implements all of :class:`BufferedIOBase`\'s methods except for :meth:`~BufferedIOBase.detach`, which raises :exc:`UnsupportedOperation`.
uk: :class:`BufferedRWPair` реалізує всі методи :class:`BufferedIOBase`\ за винятком :meth:`~BufferedIOBase.detach`, який викликає :exc:`UnsupportedOperation`.

source: :class:`BufferedRWPair` does not attempt to synchronize accesses to its underlying raw streams. You should not pass it the same object as reader and writer; use :class:`BufferedRandom` instead.
uk: :class:`BufferedRWPair` не намагається синхронізувати доступ до базових необроблених потоків. Ви не повинні передавати йому той самий об’єкт, що й читач і запис; замість цього використовуйте :class:`BufferedRandom`.

source: Base class for text streams. This class provides a character and line based interface to stream I/O. It inherits :class:`IOBase`.
uk: Базовий клас для текстових потоків. Цей клас забезпечує символьний і рядковий інтерфейс для потокового вводу-виводу. Він успадковує :class:`IOBase`.

source: :class:`TextIOBase` provides or overrides these data attributes and methods in addition to those from :class:`IOBase`:
uk: :class:`TextIOBase` надає або замінює ці атрибути та методи даних на додачу до тих, що є в :class:`IOBase`:

source: The name of the encoding used to decode the stream's bytes into strings, and to encode strings into bytes.
uk: Назва кодування, яке використовується для декодування байтів потоку в рядки та для кодування рядків у байти.

source: The error setting of the decoder or encoder.
uk: Налаштування помилки декодера або кодера.

source: A string, a tuple of strings, or ``None``, indicating the newlines translated so far. Depending on the implementation and the initial constructor flags, this may not be available.
uk: Рядок, кортеж рядків або ``None``, що вказує перекладені на даний момент нові рядки. Залежно від реалізації та початкових прапорів конструктора, це може бути недоступним.

source: The underlying binary buffer (a :class:`BufferedIOBase` instance) that :class:`TextIOBase` deals with. This is not part of the :class:`TextIOBase` API and may not exist in some implementations.
uk: Базовий бінарний буфер (екземпляр :class:`BufferedIOBase`), з яким працює :class:`TextIOBase`. Це не є частиною API :class:`TextIOBase` і може не існувати в деяких реалізаціях.

source: Separate the underlying binary buffer from the :class:`TextIOBase` and return it.
uk: Відокремте базовий бінарний буфер від :class:`TextIOBase` і поверніть його.

source: After the underlying buffer has been detached, the :class:`TextIOBase` is in an unusable state.
uk: Після того, як основний буфер було від’єднано, :class:`TextIOBase` перебуває в непридатному для використання стані.

source: Some :class:`TextIOBase` implementations, like :class:`StringIO`, may not have the concept of an underlying buffer and calling this method will raise :exc:`UnsupportedOperation`.
uk: Деякі реалізації :class:`TextIOBase`, наприклад :class:`StringIO`, можуть не мати концепції основного буфера, і виклик цього методу призведе до :exc:`UnsupportedOperation`.

source: Read and return at most *size* characters from the stream as a single :class:`str`. If *size* is negative or ``None``, reads until EOF.
uk: Читати та повертати не більше символів *size* із потоку як один :class:`str`. Якщо *size* є від’ємним або ``None``, читається до EOF.

source: Read until newline or EOF and return a single ``str``. If the stream is already at EOF, an empty string is returned.
uk: Читайте до нового рядка або EOF і повертайте одну ``str``. Якщо потік уже знаходиться в EOF, повертається порожній рядок.

source: If *size* is specified, at most *size* characters will be read.
uk: Якщо вказано *size*, буде прочитано не більше символів *size*.

source: Change the stream position to the given *offset*. Behaviour depends on the *whence* parameter. The default value for *whence* is :data:`SEEK_SET`.
uk: Змініть позицію потоку на вказане *зсув*. Поведінка залежить від параметра *whence*. Значенням за замовчуванням для *whence* є :data:`SEEK_SET`.

source: :data:`SEEK_SET` or ``0``: seek from the start of the stream (the default); *offset* must either be a number returned by :meth:`TextIOBase.tell`, or zero. Any other *offset* value produces undefined behaviour.
uk: :data:`SEEK_SET` або ``0``: пошук від початку потоку (за замовчуванням); *offset* має бути або числом, яке повертає :meth:`TextIOBase.tell`, або нулем. Будь-яке інше значення *offset* призводить до невизначеної поведінки.

source: :data:`SEEK_CUR` or ``1``: "seek" to the current position; *offset* must be zero, which is a no-operation (all other values are unsupported).
uk: :data:`SEEK_CUR` або ``1``: "пошук" до поточної позиції; *offset* має дорівнювати нулю, що не є операцією (усі інші значення не підтримуються).

source: :data:`SEEK_END` or ``2``: seek to the end of the stream; *offset* must be zero (all other values are unsupported).
uk: :data:`SEEK_END` або ``2``: перейти до кінця потоку; *offset* має дорівнювати нулю (інші значення не підтримуються).

source: Return the new absolute position as an opaque number.
uk: Повертає нову абсолютну позицію як непрозоре число.

source: Return the current stream position as an opaque number. The number does not usually represent a number of bytes in the underlying binary storage.
uk: Повертає поточну позицію потоку як непрозоре число. Число зазвичай не означає кількість байтів у базовому двійковому сховищі.

source: Write the string *s* to the stream and return the number of characters written.
uk: Запишіть рядок *s* у потік і поверніть кількість записаних символів.

source: A buffered text stream providing higher-level access to a :class:`BufferedIOBase` buffered binary stream. It inherits :class:`TextIOBase`.
uk: Буферизований текстовий потік, що забезпечує доступ вищого рівня до буферизованого бінарного потоку :class:`BufferedIOBase`. Він успадковує :class:`TextIOBase`.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled. Pass ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error (the default of ``None`` has the same effect), or pass ``'ignore'`` to ignore errors. (Note that ignoring encoding errors can lead to data loss.) ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data. ``'backslashreplace'`` causes malformed data to be replaced by a backslashed escape sequence. When writing, ``'xmlcharrefreplace'`` (replace with the appropriate XML character reference) or ``'namereplace'`` (replace with ``\N{...}`` escape sequences) can be used. Any other error handling name that has been registered with :func:`codecs.register_error` is also valid.
uk: *errors* — це необов’язковий рядок, який визначає, як потрібно обробляти помилки кодування та декодування. Передайте ``'strict'``, щоб викликати виняток :exc:`ValueError`, якщо є помилка кодування (за умовчанням ``None`` має той самий ефект), або передайте ``'ignore'``, щоб ігнорувати помилки. (Зауважте, що ігнорування помилок кодування може призвести до втрати даних.) ``'replace'`` спричиняє вставку маркера заміни (наприклад, ``'?'``), де є некоректні дані. ``'backslashreplace'`` змушує неправильно сформовані дані замінюватися керуючою послідовністю зі зворотною скісною рискою. Під час запису можна використовувати ``'xmlcharrefreplace'`` (замінити на відповідне посилання на символ XML) або ``'namereplace'`` (замінити на ``\N{...}`` керуючу послідовність). Будь-яка інша назва обробки помилок, зареєстрована в :func:`codecs.register_error`, також дійсна.

source: *newline* controls how line endings are handled. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
uk: *новий рядок* контролює, як обробляються закінчення рядків. Це може бути ``None``, ``''``, ``'\n'``, ``'\r'`` і ``'\r\n'``. Він працює наступним чином:

source: When reading input from the stream, if *newline* is ``None``, :term:`universal newlines` mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If *newline* is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If *newline* has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
uk: Під час читання вхідних даних із потоку, якщо *новий рядок* має значення ``None``, увімкнено режим :term:`universal newlines`. Рядки у вхідних даних можуть закінчуватися на ``'\n'``, ``'\r'`` або ``'\r\n'``, і вони перекладаються на ``'\n'`` перед поверненням до абонента. Якщо *новий рядок* дорівнює ``''``, універсальний режим нових рядків увімкнено, але закінчення рядків повертаються абоненту без перекладу. Якщо *новий рядок* має будь-яке з інших дозволених значень, рядки вводу завершуються лише заданим рядком, а закінчення рядка повертається абоненту без перекладу.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
uk: Під час запису вихідних даних у потік, якщо *новий рядок* має значення ``None``, будь-які записані символи ``'\n'`` переводяться в системний роздільник рядків за умовчанням, :data:`os.linesep`. Якщо *новий рядок* є ``''`` або ``'\n'``, переклад не відбувається. Якщо *новий рядок* є будь-яким іншим дозволеним значенням, будь-які написані символи ``'\n'`` переводяться в заданий рядок.

source: If *line_buffering* is ``True``, :meth:`flush` is implied when a call to write contains a newline character or a carriage return.
uk: Якщо *line_buffering* має значення ``True``, :meth:`flush` передбачається, коли виклик write містить символ нового рядка або повернення каретки.

source: If *write_through* is ``True``, calls to :meth:`write` are guaranteed not to be buffered: any data written on the :class:`TextIOWrapper` object is immediately handled to its underlying binary *buffer*.
uk: Якщо *write_through* має значення ``True``, виклики :meth:`write` гарантовано не буферизуються: будь-які дані, записані в об’єкт :class:`TextIOWrapper`, негайно обробляються до його базового двійкового *буфера*.

source: The *write_through* argument has been added.
uk: Додано аргумент *write_through*.

source: The default *encoding* is now ``locale.getpreferredencoding(False)`` instead of ``locale.getpreferredencoding()``. Don't change temporary the locale encoding using :func:`locale.setlocale`, use the current locale encoding instead of the user preferred encoding.
uk: Типовим *кодуванням* тепер є ``locale.getpreferredencoding(False)`` замість ``locale.getpreferredencoding()``. Не змінюйте тимчасово кодування мови за допомогою :func:`locale.setlocale`, використовуйте поточне кодування мови замість кодування, яке вибирає користувач.

source: The *encoding* argument now supports the ``"locale"`` dummy encoding name.
uk: Аргумент *encoding* тепер підтримує фіктивну назву кодування ``"locale"``.

source: :class:`TextIOWrapper` provides these data attributes and methods in addition to those from :class:`TextIOBase` and :class:`IOBase`:
uk: :class:`TextIOWrapper` надає ці атрибути даних і методи на додачу до тих, що є в :class:`TextIOBase` і :class:`IOBase`:

source: Whether line buffering is enabled.
uk: Чи ввімкнено буферизацію рядків.

source: Whether writes are passed immediately to the underlying binary buffer.
uk: Чи передаються записи негайно до базового двійкового буфера.

source: Reconfigure this text stream using new settings for *encoding*, *errors*, *newline*, *line_buffering* and *write_through*.
uk: Переконфігуруйте цей текстовий потік, використовуючи нові налаштування для *кодування*, *помилок*, *нового рядка*, *line_buffering* і *write_through*.

source: Parameters not specified keep current settings, except ``errors='strict'`` is used when *encoding* is specified but *errors* is not specified.
uk: Параметри, які не вказано, зберігають поточні налаштування, за винятком того, що ``errors='strict'`` використовується, коли вказано *кодування*, але не вказано *errors*.

source: It is not possible to change the encoding or newline if some data has already been read from the stream. On the other hand, changing encoding after write is possible.
uk: Неможливо змінити кодування або новий рядок, якщо деякі дані вже прочитано з потоку. З іншого боку, зміна кодування після запису можлива.

source: This method does an implicit stream flush before setting the new parameters.
uk: Цей метод виконує неявне очищення потоку перед встановленням нових параметрів.

source: A text stream using an in-memory text buffer. It inherits :class:`TextIOBase`.
uk: Текстовий потік із використанням текстового буфера в пам’яті. Він успадковує :class:`TextIOBase`.

source: The text buffer is discarded when the :meth:`~IOBase.close` method is called.
uk: Текстовий буфер відкидається під час виклику методу :meth:`~IOBase.close`.

source: The initial value of the buffer can be set by providing *initial_value*. If newline translation is enabled, newlines will be encoded as if by :meth:`~TextIOBase.write`. The stream is positioned at the start of the buffer.
uk: Початкове значення буфера можна встановити, вказавши *initial_value*. Якщо переклад нового рядка ввімкнено, нові рядки будуть закодовані як :meth:`~TextIOBase.write`. Потік розташовується на початку буфера.

source: The *newline* argument works like that of :class:`TextIOWrapper`, except that when writing output to the stream, if *newline* is ``None``, newlines are written as ``\n`` on all platforms.
uk: Аргумент *новий рядок* працює як аргумент :class:`TextIOWrapper`, за винятком того, що під час запису виводу в потік, якщо *новий рядок* має значення ``None``, нові рядки записуються як ``\n`` на всіх платформах.

source: :class:`StringIO` provides this method in addition to those from :class:`TextIOBase` and :class:`IOBase`:
uk: :class:`StringIO` надає цей метод на додаток до методів з :class:`TextIOBase` і :class:`IOBase`:

source: Return a ``str`` containing the entire contents of the buffer. Newlines are decoded as if by :meth:`~TextIOBase.read`, although the stream position is not changed.
uk: Повертає ``str``, що містить увесь вміст буфера. Нові рядки декодуються :meth:`~TextIOBase.read`, хоча позиція потоку не змінюється.

source: Example usage::
uk: Приклад використання::

source: A helper codec that decodes newlines for :term:`universal newlines` mode. It inherits :class:`codecs.IncrementalDecoder`.
uk: Допоміжний кодек, який розшифровує символи нового рядка для режиму :term:`universal newlines`. Він успадковує :class:`codecs.IncrementalDecoder`.

source: Performance
uk: Продуктивність

source: This section discusses the performance of the provided concrete I/O implementations.
uk: У цьому розділі обговорюється продуктивність наданих конкретних реалізацій введення-виведення.

source: By reading and writing only large chunks of data even when the user asks for a single byte, buffered I/O hides any inefficiency in calling and executing the operating system's unbuffered I/O routines. The gain depends on the OS and the kind of I/O which is performed. For example, on some modern OSes such as Linux, unbuffered disk I/O can be as fast as buffered I/O. The bottom line, however, is that buffered I/O offers predictable performance regardless of the platform and the backing device. Therefore, it is almost always preferable to use buffered I/O rather than unbuffered I/O for binary data.
uk: Завдяки читанню та запису лише великих фрагментів даних, навіть якщо користувач запитує один байт, буферизований ввід-вивід приховує будь-яку неефективність виклику та виконання небуферизованих процедур вводу-виводу операційної системи. Коефіцієнт посилення залежить від ОС і типу вводу-виводу, який виконується. Наприклад, у деяких сучасних ОС, таких як Linux, небуферизований дисковий ввід-вивід може бути таким же швидким, як буферизований ввід-вивід. Суть полягає в тому, що буферизований ввід-вивід забезпечує передбачувану продуктивність незалежно від платформи та резервного пристрою. Тому для двійкових даних майже завжди краще використовувати буферизований ввід-вивід, а не небуферизований ввід-вивід.
