Repository: python/python-docs-uk
Catalog: library/io.po
Languages: uk

source: Read and return one line from the stream. If *size* is specified, at most *size* bytes will be read.
uk: Прочитайте та поверніть один рядок із потоку. Якщо вказано *size*, буде прочитано не більше *size* байтів.

source: The line terminator is always ``b'\n'`` for binary files; for text files, the *newline* argument to :func:`open` can be used to select the line terminator(s) recognized.
uk: Для бінарних файлів символом закінчення рядка є завжди ``b'\n'``; для текстових файлів аргумент *новий рядок* для :func:`open` може бути використаний для вибору розпізнаного символу закінчення рядка.

source: Read and return a list of lines from the stream. *hint* can be specified to control the number of lines read: no more lines will be read if the total size (in bytes/characters) of all lines so far exceeds *hint*.
uk: Читання та повернення списку рядків із потоку. Можна вказати *hint*, щоб контролювати кількість прочитаних рядків: рядки більше не читатимуться, якщо загальний розмір (у байтах/символах) усіх рядків на даний момент перевищує *hint*.

source: *hint* values of ``0`` or less, as well as ``None``, are treated as no hint.
uk: Значення *hint* ``0`` або менше, а також ``None``, розглядаються як відсутність підказки.

source: Note that it's already possible to iterate on file objects using ``for line in file: ...`` without calling ``file.readlines()``.
uk: Зауважте, що вже можна виконувати ітерацію файлових об’єктів за допомогою ``for line in file: ...`` без виклику ``file.readlines()``.

source: Change the stream position to the given byte *offset*. *offset* is interpreted relative to the position indicated by *whence*. The default value for *whence* is :data:`SEEK_SET`. Values for *whence* are:
uk: Змініть позицію потоку на заданий байт *offset*. *зміщення* інтерпретується відносно позиції, зазначеної *звідки*. Значенням за замовчуванням для *whence* є :data:`SEEK_SET`. Значення для *whence* такі:

source: :data:`SEEK_SET` or ``0`` -- start of the stream (the default); *offset* should be zero or positive
uk: :data:`SEEK_SET` або ``0`` -- початок потоку (за умовчанням); *offset* має бути нульовим або позитивним

source: :data:`SEEK_CUR` or ``1`` -- current stream position; *offset* may be negative
uk: :data:`SEEK_CUR` або ``1`` -- поточна позиція потоку; *offset* може бути негативним

source: :data:`SEEK_END` or ``2`` -- end of the stream; *offset* is usually negative
uk: :data:`SEEK_END` або ``2`` -- кінець потоку; *зсув* зазвичай негативний

source: Return the new absolute position.
uk: Поверніть нову абсолютну позицію.

source: The ``SEEK_*`` constants.
uk: Константи ``SEEK_*``.

source: Some operating systems could support additional values, like :data:`os.SEEK_HOLE` or :data:`os.SEEK_DATA`. The valid values for a file could depend on it being open in text or binary mode.
uk: Деякі операційні системи можуть підтримувати додаткові значення, наприклад :data:`os.SEEK_HOLE` або :data:`os.SEEK_DATA`. Дійсні значення для файлу можуть залежати від того, чи він відкритий у текстовому чи двійковому режимі.

source: Return ``True`` if the stream supports random access. If ``False``, :meth:`seek`, :meth:`tell` and :meth:`truncate` will raise :exc:`OSError`.
uk: Повертає ``True``, якщо потік підтримує довільний доступ. Якщо ``False``, :meth:`seek`, :meth:`tell` і :meth:`truncate` викличуть :exc:`OSError`.

source: Return the current stream position.
uk: Повернути поточну позицію потоку.

source: Resize the stream to the given *size* in bytes (or the current position if *size* is not specified). The current stream position isn't changed. This resizing can extend or reduce the current file size. In case of extension, the contents of the new file area depend on the platform (on most systems, additional bytes are zero-filled). The new file size is returned.
uk: Змініть розмір потоку до вказаного *size* у байтах (або поточної позиції, якщо *size* не вказано). Поточна позиція потоку не змінена. Ця зміна розміру може збільшити або зменшити поточний розмір файлу. У разі розширення вміст нової файлової області залежить від платформи (у більшості систем додаткові байти заповнюються нулями). Повернеться новий розмір файлу.

source: Windows will now zero-fill files when extending.
uk: Windows тепер заповнюватиме файли нулем під час розширення.

source: Return ``True`` if the stream supports writing. If ``False``, :meth:`write` and :meth:`truncate` will raise :exc:`OSError`.
uk: Повертає ``True``, якщо потік підтримує запис. Якщо ``False``, :meth:`write` і :meth:`truncate` викличуть :exc:`OSError`.

source: Write a list of lines to the stream. Line separators are not added, so it is usual for each of the lines provided to have a line separator at the end.
uk: Напишіть список рядків у потік. Роздільники рядків не додаються, тому зазвичай для кожного з наданих рядків є роздільник рядків у кінці.

source: Prepare for object destruction. :class:`IOBase` provides a default implementation of this method that calls the instance's :meth:`~IOBase.close` method.
uk: Підготуйтеся до руйнування об'єкта. :class:`IOBase` забезпечує реалізацію цього методу за замовчуванням, яка викликає метод екземпляра :meth:`~IOBase.close`.

source: Base class for raw binary streams. It inherits :class:`IOBase`.
uk: Базовий клас для необроблених бінарних потоків. Він успадковує :class:`IOBase`.

source: Raw binary streams typically provide low-level access to an underlying OS device or API, and do not try to encapsulate it in high-level primitives (this functionality is done at a higher-level in buffered binary streams and text streams, described later in this page).
uk: Необроблені двійкові потоки зазвичай забезпечують низькорівневий доступ до базового пристрою ОС або API, і не намагаються інкапсулювати його в примітивах високого рівня (ця функція виконується на більш високому рівні в буферизованих двійкових потоках і текстових потоках, описаних далі в ця сторінка).

source: :class:`RawIOBase` provides these methods in addition to those from :class:`IOBase`:
uk: :class:`RawIOBase` надає ці методи на додаток до методів з :class:`IOBase`:

source: Read up to *size* bytes from the object and return them. As a convenience, if *size* is unspecified or -1, all bytes until EOF are returned. Otherwise, only one system call is ever made. Fewer than *size* bytes may be returned if the operating system call returns fewer than *size* bytes.
uk: Прочитати до *size* байтів з об’єкта та повернути їх. Для зручності, якщо *size* не вказано або -1, повертаються всі байти до EOF. В іншому випадку буде зроблено лише один системний виклик. Якщо виклик операційної системи повертає менше *size* байтів, може бути повернуто менше ніж *size* байт.

source: If 0 bytes are returned, and *size* was not 0, this indicates end of file. If the object is in non-blocking mode and no bytes are available, ``None`` is returned.
uk: Якщо повертається 0 байтів, а *size* не дорівнює 0, це вказує на кінець файлу. Якщо об’єкт перебуває в неблокуючому режимі і немає доступних байтів, повертається "Немає".

source: The default implementation defers to :meth:`readall` and :meth:`readinto`.
uk: Реалізація за замовчуванням відноситься до :meth:`readall` і :meth:`readinto`.

source: Read and return all the bytes from the stream until EOF, using multiple calls to the stream if necessary.
uk: Прочитати та повернути всі байти з потоку до EOF, використовуючи кілька викликів потоку, якщо необхідно.

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b*, and return the number of bytes read. For example, *b* might be a :class:`bytearray`. If the object is in non-blocking mode and no bytes are available, ``None`` is returned.
uk: Читання байтів у попередньо виділений записуваний :term:`bytes-like object` *b* і повернення кількості прочитаних байтів. Наприклад, *b* може бути :class:`bytearray`. Якщо об’єкт перебуває в неблокуючому режимі і немає доступних байтів, повертається "Немає".

source: Write the given :term:`bytes-like object`, *b*, to the underlying raw stream, and return the number of bytes written. This can be less than the length of *b* in bytes, depending on specifics of the underlying raw stream, and especially if it is in non-blocking mode. ``None`` is returned if the raw stream is set not to block and no single byte could be readily written to it. The caller may release or mutate *b* after this method returns, so the implementation should only access *b* during the method call.
uk: Запишіть заданий :term:`bytes-like object`, *b*, до базового необробленого потоку та поверніть кількість записаних байтів. Це може бути менше, ніж довжина *b* в байтах, залежно від специфіки базового необробленого потоку, особливо якщо він знаходиться в неблокуючому режимі. ``None`` повертається, якщо необроблений потік налаштовано на неблокування і жоден байт не може бути легко записаний до нього. Виклик може звільнити або змінити *b* після повернення цього методу, тому реалізація має звертатися до *b* лише під час виклику методу.

source: Base class for binary streams that support some kind of buffering. It inherits :class:`IOBase`.
uk: Базовий клас для бінарних потоків, які підтримують певний вид буферизації. Він успадковує :class:`IOBase`.

source: The main difference with :class:`RawIOBase` is that methods :meth:`read`, :meth:`readinto` and :meth:`write` will try (respectively) to read as much input as requested or to consume all given output, at the expense of making perhaps more than one system call.
uk: Основна відмінність від :class:`RawIOBase` полягає в тому, що методи :meth:`read`, :meth:`readinto` і :meth:`write` намагатимуться (відповідно) прочитати стільки вхідних даних, скільки запитувано, або споживати всі дані вихід, за рахунок здійснення, можливо, більше одного системного виклику.

source: In addition, those methods can raise :exc:`BlockingIOError` if the underlying raw stream is in non-blocking mode and cannot take or give enough data; unlike their :class:`RawIOBase` counterparts, they will never return ``None``.
uk: Крім того, ці методи можуть викликати :exc:`BlockingIOError`, якщо базовий необроблений потік перебуває в неблокуючому режимі та не може прийняти або надати достатньо даних; на відміну від своїх аналогів :class:`RawIOBase`, вони ніколи не повернуть ``None``.

source: Besides, the :meth:`read` method does not have a default implementation that defers to :meth:`readinto`.
uk: Крім того, метод :meth:`read` не має реалізації за замовчуванням, яка відповідає :meth:`readinto`.

source: A typical :class:`BufferedIOBase` implementation should not inherit from a :class:`RawIOBase` implementation, but wrap one, like :class:`BufferedWriter` and :class:`BufferedReader` do.
uk: Типова реалізація :class:`BufferedIOBase` не повинна успадковувати реалізацію :class:`RawIOBase`, а повинна обгортати її, як це роблять :class:`BufferedWriter` і :class:`BufferedReader`.

source: :class:`BufferedIOBase` provides or overrides these data attributes and methods in addition to those from :class:`IOBase`:
uk: :class:`BufferedIOBase` надає або замінює ці атрибути та методи даних на додачу до тих, що є в :class:`IOBase`:

source: The underlying raw stream (a :class:`RawIOBase` instance) that :class:`BufferedIOBase` deals with. This is not part of the :class:`BufferedIOBase` API and may not exist on some implementations.
uk: Основний необроблений потік (екземпляр :class:`RawIOBase`), з яким працює :class:`BufferedIOBase`. Це не є частиною API :class:`BufferedIOBase` і може не існувати в деяких реалізаціях.

source: Separate the underlying raw stream from the buffer and return it.
uk: Відокремте базовий необроблений потік від буфера та поверніть його.

source: After the raw stream has been detached, the buffer is in an unusable state.
uk: Після від’єднання необробленого потоку буфер перебуває в непридатному для використання стані.

source: Some buffers, like :class:`BytesIO`, do not have the concept of a single raw stream to return from this method. They raise :exc:`UnsupportedOperation`.
uk: Деякі буфери, наприклад :class:`BytesIO`, не мають концепції єдиного необробленого потоку, який повертається з цього методу. Вони викликають :exc:`UnsupportedOperation`.

source: Read and return up to *size* bytes. If the argument is omitted, ``None``, or negative, data is read and returned until EOF is reached. An empty :class:`bytes` object is returned if the stream is already at EOF.
uk: Читати та повертати до *size* байтів. Якщо аргумент пропущений, ``None`` або негативний, дані зчитуються та повертаються, доки не буде досягнуто EOF. Якщо потік уже знаходиться в EOF, повертається порожній об’єкт :class:`bytes`.

source: If the argument is positive, and the underlying raw stream is not interactive, multiple raw reads may be issued to satisfy the byte count (unless EOF is reached first). But for interactive raw streams, at most one raw read will be issued, and a short result does not imply that EOF is imminent.
uk: Якщо аргумент є позитивним, а основний необроблений потік не є інтерактивним, кілька необроблених зчитувань можуть бути видані, щоб задовольнити кількість байтів (якщо спочатку не досягнуто EOF). Але для інтерактивних необроблених потоків буде видано щонайбільше одне необроблене читання, і короткий результат не означає, що EOF неминуча.

source: A :exc:`BlockingIOError` is raised if the underlying raw stream is in non blocking-mode, and has no data available at the moment.
uk: Повідомлення :exc:`BlockingIOError` виникає, якщо базовий необроблений потік перебуває в неблокуючому режимі та на даний момент не має доступних даних.

source: Read and return up to *size* bytes, with at most one call to the underlying raw stream's :meth:`~RawIOBase.read` (or :meth:`~RawIOBase.readinto`) method. This can be useful if you are implementing your own buffering on top of a :class:`BufferedIOBase` object.
uk: Читати та повертати до *size* байтів, щонайбільше з одним викликом базового необробленого потоку методу :meth:`~RawIOBase.read` (або :meth:`~RawIOBase.readinto`). Це може бути корисним, якщо ви реалізуєте власну буферизацію поверх об’єкта :class:`BufferedIOBase`.

source: If *size* is ``-1`` (the default), an arbitrary number of bytes are returned (more than zero unless EOF is reached).
uk: Якщо *size* дорівнює ``-1`` (за замовчуванням), повертається довільна кількість байтів (більше нуля, якщо не досягнуто EOF).

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b* and return the number of bytes read. For example, *b* might be a :class:`bytearray`.
uk: Читання байтів у попередньо виділений записуваний :term:`bytes-like object` *b* і повертає кількість прочитаних байтів. Наприклад, *b* може бути :class:`bytearray`.

source: Like :meth:`read`, multiple reads may be issued to the underlying raw stream, unless the latter is interactive.
uk: Подібно до :meth:`read`, кілька читань можуть бути видані базовому необробленому потоку, якщо останній не є інтерактивним.

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b*, using at most one call to the underlying raw stream's :meth:`~RawIOBase.read` (or :meth:`~RawIOBase.readinto`) method. Return the number of bytes read.
uk: Зчитування байтів у попередньо виділений записуваний :term:`bytes-like object` *b*, використовуючи щонайбільше один виклик базового необробленого потоку :meth:`~RawIOBase.read` (або :meth:`~RawIOBase. метод readinto`). Повертає кількість прочитаних байтів.

source: Write the given :term:`bytes-like object`, *b*, and return the number of bytes written (always equal to the length of *b* in bytes, since if the write fails an :exc:`OSError` will be raised). Depending on the actual implementation, these bytes may be readily written to the underlying stream, or held in a buffer for performance and latency reasons.
uk: Запишіть заданий :term:`bytes-like object`, *b*, і поверніть кількість записаних байтів (завжди дорівнює довжині *b* в байтах, оскільки якщо запис не вдасться, виникне :exc:`OSError` бути підвищеним). Залежно від фактичної реалізації, ці байти можуть бути легко записані в базовий потік або зберігатися в буфері з причин продуктивності та затримки.

source: When in non-blocking mode, a :exc:`BlockingIOError` is raised if the data needed to be written to the raw stream but it couldn't accept all the data without blocking.
uk: У неблокуючому режимі виникає :exc:`BlockingIOError`, якщо дані потрібно було записати в необроблений потік, але він не міг прийняти всі дані без блокування.

source: The caller may release or mutate *b* after this method returns, so the implementation should only access *b* during the method call.
uk: Виклик може звільнити або змінити *b* після повернення цього методу, тому реалізація має звертатися до *b* лише під час виклику методу.

source: Raw File I/O
uk: Необроблений файл введення-виведення

source: A raw binary stream representing an OS-level file containing bytes data. It inherits :class:`RawIOBase`.
uk: Необроблений двійковий потік, що представляє файл рівня ОС, що містить дані в байтах. Він успадковує :class:`RawIOBase`.

source: The *name* can be one of two things:
uk: *Ім'я* може бути одним із двох:

source: a character string or :class:`bytes` object representing the path to the file which will be opened. In this case closefd must be ``True`` (the default) otherwise an error will be raised.
uk: рядок символів або об’єкт :class:`bytes`, що представляє шлях до файлу, який буде відкрито. У цьому випадку closefd має бути ``True`` (за замовчуванням), інакше виникне помилка.

source: an integer representing the number of an existing OS-level file descriptor to which the resulting :class:`FileIO` object will give access. When the FileIO object is closed this fd will be closed as well, unless *closefd* is set to ``False``.
uk: ціле число, що представляє номер існуючого файлового дескриптора рівня ОС, до якого отриманий об’єкт :class:`FileIO` надасть доступ. Коли об’єкт FileIO закрито, цей fd також буде закрито, якщо для *closefd* не встановлено значення ``False``.

source: The *mode* can be ``'r'``, ``'w'``, ``'x'`` or ``'a'`` for reading (default), writing, exclusive creation or appending. The file will be created if it doesn't exist when opened for writing or appending; it will be truncated when opened for writing. :exc:`FileExistsError` will be raised if it already exists when opened for creating. Opening a file for creating implies writing, so this mode behaves in a similar way to ``'w'``. Add a ``'+'`` to the mode to allow simultaneous reading and writing.
uk: *Режим* може бути ``'r'``, ``'w'``, ``'x'`` або ``'a'`` для читання (за замовчуванням), запису, ексклюзивного створення або додавання. Файл буде створено, якщо він не існує під час відкриття для запису чи додавання; він буде скорочений під час відкриття для запису. :exc:`FileExistsError` буде викликано, якщо він уже існує під час відкриття для створення. Відкриття файлу для створення передбачає запис, тому цей режим поводиться подібно до ``'w'``. Додайте ``'+'`` до режиму, щоб дозволити одночасне читання та запис.

source: The :meth:`read` (when called with a positive argument), :meth:`readinto` and :meth:`write` methods on this class will only make one system call.
uk: Методи :meth:`read` (при виклику з позитивним аргументом), :meth:`readinto` і :meth:`write` цього класу зроблять лише один системний виклик.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*name*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
uk: Спеціальний відкривач можна використовувати, передавши виклик як *opener*. Базовий дескриптор файлу для об’єкта файлу потім отримується шляхом виклику *opener* з (*name*, *flags*). *opener* має повертати дескриптор відкритого файлу (передача :mod:`os.open` як *opener* призводить до функціональності, подібної до передачі ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
uk: Щойно створений файл :ref:`не успадковується <fd_inheritance>`.

source: See the :func:`open` built-in function for examples on using the *opener* parameter.
uk: Перегляньте вбудовану функцію :func:`open` для прикладів використання параметра *opener*.

source: The *opener* parameter was added. The ``'x'`` mode was added.
uk: Додано параметр *opener*. Додано режим ``'x``.

source: The file is now non-inheritable.
uk: Тепер файл не успадковується.

source: :class:`FileIO` provides these data attributes in addition to those from :class:`RawIOBase` and :class:`IOBase`:
uk: :class:`FileIO` надає ці атрибути даних на додаток до атрибутів з :class:`RawIOBase` і :class:`IOBase`:

source: The mode as given in the constructor.
uk: Режим, заданий у конструкторі.

source: The file name. This is the file descriptor of the file when no name is given in the constructor.
uk: Ім'я файлу. Це дескриптор файлу, якщо в конструкторі не вказано ім’я.

source: Buffered Streams
uk: Буферизовані потоки

source: Buffered I/O streams provide a higher-level interface to an I/O device than raw I/O does.
uk: Буферизовані потоки вводу-виводу забезпечують інтерфейс вищого рівня для пристрою вводу-виводу, ніж необроблений ввід-вивод.

source: A binary stream using an in-memory bytes buffer. It inherits :class:`BufferedIOBase`. The buffer is discarded when the :meth:`~IOBase.close` method is called.
uk: Двійковий потік із використанням буфера байтів у пам’яті. Він успадковує :class:`BufferedIOBase`. Буфер скидається під час виклику методу :meth:`~IOBase.close`.

source: The optional argument *initial_bytes* is a :term:`bytes-like object` that contains initial data.
uk: Необов’язковий аргумент *initial_bytes* — це :term:`bytes-like object`, який містить початкові дані.

source: :class:`BytesIO` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
uk: :class:`BytesIO` надає або замінює ці методи на додаток до методів з :class:`BufferedIOBase` і :class:`IOBase`:

source: Return a readable and writable view over the contents of the buffer without copying them. Also, mutating the view will transparently update the contents of the buffer::
uk: Повернути доступний для читання та запису перегляд вмісту буфера без його копіювання. Крім того, зміна перегляду прозоро оновить вміст буфера::

source: As long as the view exists, the :class:`BytesIO` object cannot be resized or closed.
uk: Поки представлення існує, об’єкт :class:`BytesIO` не можна змінити розмір або закрити.

source: Return :class:`bytes` containing the entire contents of the buffer.
uk: Повертає :class:`bytes`, що містить увесь вміст буфера.

source: In :class:`BytesIO`, this is the same as :meth:`~BufferedIOBase.read`.
uk: У :class:`BytesIO` це те саме, що :meth:`~BufferedIOBase.read`.

source: The *size* argument is now optional.
uk: Аргумент *size* тепер необов’язковий.

source: In :class:`BytesIO`, this is the same as :meth:`~BufferedIOBase.readinto`.
uk: У :class:`BytesIO` це те саме, що :meth:`~BufferedIOBase.readinto`.

source: A buffered binary stream providing higher-level access to a readable, non seekable :class:`RawIOBase` raw binary stream. It inherits :class:`BufferedIOBase`.
uk: Буферизований двійковий потік, що забезпечує доступ вищого рівня до доступного для читання бінарного потоку :class:`RawIOBase` без можливості пошуку. Він успадковує :class:`BufferedIOBase`.
