Repository: python/python-docs-uk
Catalog: library/ipaddress.po
Languages: uk

source: :mod:`ipaddress` --- IPv4/IPv6 manipulation library
uk: :mod:`ipaddress` --- Бібліотека обробки IPv4/IPv6

source: **Source code:** :source:`Lib/ipaddress.py`
uk: **Вихідний код:** :source:`Lib/ipaddress.py`

source: :mod:`ipaddress` provides the capabilities to create, manipulate and operate on IPv4 and IPv6 addresses and networks.
uk: :mod:`ipaddress` надає можливості створювати, маніпулювати та працювати з адресами та мережами IPv4 та IPv6.

source: The functions and classes in this module make it straightforward to handle various tasks related to IP addresses, including checking whether or not two hosts are on the same subnet, iterating over all hosts in a particular subnet, checking whether or not a string represents a valid IP address or network definition, and so on.
uk: Функції та класи в цьому модулі спрощують виконання різноманітних завдань, пов’язаних з IP-адресами, включаючи перевірку того, чи два хости знаходяться в одній підмережі, ітерацію по всіх хостах у певній підмережі, перевірку того, чи рядок представляє дійсний чи ні IP-адреса або визначення мережі тощо.

source: This is the full module API reference—for an overview and introduction, see :ref:`ipaddress-howto`.
uk: Це повна довідка щодо API модуля — для огляду та введення див. :ref:`ipaddress-howto`.

source: Convenience factory functions
uk: Функції фабрики комфорту

source: The :mod:`ipaddress` module provides factory functions to conveniently create IP addresses, networks and interfaces:
uk: Модуль :mod:`ipaddress` надає заводські функції для зручного створення IP-адрес, мереж та інтерфейсів:

source: Return an :class:`IPv4Address` or :class:`IPv6Address` object depending on the IP address passed as argument. Either IPv4 or IPv6 addresses may be supplied; integers less than ``2**32`` will be considered to be IPv4 by default. A :exc:`ValueError` is raised if *address* does not represent a valid IPv4 or IPv6 address.
uk: Повертає об’єкт :class:`IPv4Address` або :class:`IPv6Address` залежно від IP-адреси, переданої як аргумент. Можна надати адреси IPv4 або IPv6; цілі числа, менші за ``2**32``, за умовчанням вважатимуться IPv4. Помилка :exc:`ValueError` виникає, якщо *адреса* не є дійсною адресою IPv4 або IPv6.

source: Return an :class:`IPv4Network` or :class:`IPv6Network` object depending on the IP address passed as argument. *address* is a string or integer representing the IP network. Either IPv4 or IPv6 networks may be supplied; integers less than ``2**32`` will be considered to be IPv4 by default. *strict* is passed to :class:`IPv4Network` or :class:`IPv6Network` constructor. A :exc:`ValueError` is raised if *address* does not represent a valid IPv4 or IPv6 address, or if the network has host bits set.
uk: Повертає об’єкт :class:`IPv4Network` або :class:`IPv6Network` залежно від IP-адреси, переданої як аргумент. *адреса* — це рядок або ціле число, що представляє IP-мережу. Можуть надаватися мережі IPv4 або IPv6; цілі числа, менші за ``2**32``, за умовчанням вважатимуться IPv4. *strict* передається конструктору :class:`IPv4Network` або :class:`IPv6Network`. Помилка :exc:`ValueError` виникає, якщо *адреса* не представляє дійсну адресу IPv4 або IPv6 або якщо мережа має встановлені біти хоста.

source: Return an :class:`IPv4Interface` or :class:`IPv6Interface` object depending on the IP address passed as argument. *address* is a string or integer representing the IP address. Either IPv4 or IPv6 addresses may be supplied; integers less than ``2**32`` will be considered to be IPv4 by default. A :exc:`ValueError` is raised if *address* does not represent a valid IPv4 or IPv6 address.
uk: Повертає об’єкт :class:`IPv4Interface` або :class:`IPv6Interface` залежно від IP-адреси, переданої як аргумент. *адреса* — це рядок або ціле число, що представляє IP-адресу. Можна надати адреси IPv4 або IPv6; цілі числа, менші за ``2**32``, за умовчанням вважатимуться IPv4. Помилка :exc:`ValueError` виникає, якщо *адреса* не є дійсною адресою IPv4 або IPv6.

source: One downside of these convenience functions is that the need to handle both IPv4 and IPv6 formats means that error messages provide minimal information on the precise error, as the functions don't know whether the IPv4 or IPv6 format was intended. More detailed error reporting can be obtained by calling the appropriate version specific class constructors directly.
uk: Одним із недоліків цих зручних функцій є те, що потреба в обробці форматів IPv4 і IPv6 означає, що повідомлення про помилки надають мінімальну інформацію про точну помилку, оскільки функції не знають, який формат був передбачуваний: IPv4 чи IPv6. Більш детальні звіти про помилки можна отримати, викликавши відповідні конструктори класів, що стосуються конкретної версії.

source: IP Addresses
uk: IP-адреси

source: Address objects
uk: Об'єкти адреси

source: The :class:`IPv4Address` and :class:`IPv6Address` objects share a lot of common attributes. Some attributes that are only meaningful for IPv6 addresses are also implemented by :class:`IPv4Address` objects, in order to make it easier to write code that handles both IP versions correctly. Address objects are :term:`hashable`, so they can be used as keys in dictionaries.
uk: Об’єкти :class:`IPv4Address` і :class:`IPv6Address` мають багато спільних атрибутів. Деякі атрибути, які мають значення лише для адрес IPv6, також реалізовані об’єктами :class:`IPv4Address`, щоб полегшити написання коду, який правильно обробляє обидві версії IP. Адресні об’єкти :term:`hashable`, тому їх можна використовувати як ключі в словниках.

source: Construct an IPv4 address. An :exc:`AddressValueError` is raised if *address* is not a valid IPv4 address.
uk: Створіть адресу IPv4. Помилка :exc:`AddressValueError` виникає, якщо *адреса* не є дійсною адресою IPv4.

source: The following constitutes a valid IPv4 address:
uk: Нижче наведено дійсну адресу IPv4:

source: A string in decimal-dot notation, consisting of four decimal integers in the inclusive range 0--255, separated by dots (e.g. ``192.168.0.1``). Each integer represents an octet (byte) in the address. Leading zeroes are not tolerated to prevent confusion with octal notation.
uk: Рядок у десятковій точковій нотації, що складається з чотирьох цілих десяткових чисел у діапазоні від 0 до 255, розділених крапками (наприклад, ``192.168.0.1``). Кожне ціле число представляє октет (байт) в адресі. Початкові нулі не допускаються, щоб уникнути плутанини з вісімковою системою запису.

source: An integer that fits into 32 bits.
uk: Ціле число, яке вміщується в 32 біти.

source: An integer packed into a :class:`bytes` object of length 4 (most significant octet first).
uk: Ціле число, упаковане в об’єкт :class:`bytes` довжиною 4 (старший октет спочатку).

source: Leading zeros are tolerated, even in ambiguous cases that look like octal notation.
uk: Початкові нулі допускаються, навіть у неоднозначних випадках, які виглядають як вісімкове позначення.

source: Leading zeros are no longer tolerated and are treated as an error. IPv4 address strings are now parsed as strict as glibc :func:`~socket.inet_pton`.
uk: Початкові нулі більше не допускаються та розглядаються як помилка. Рядки адреси IPv4 тепер аналізуються так само строго, як glibc :func:`~socket.inet_pton`.

source: The above change was also included in Python 3.9 starting with version 3.9.5.
uk: Вищевказана зміна також була включена в Python 3.9, починаючи з версії 3.9.5.

source: The above change was also included in Python 3.8 starting with version 3.8.12.
uk: Вищевказана зміна також була включена в Python 3.8, починаючи з версії 3.8.12.

source: The appropriate version number: ``4`` for IPv4, ``6`` for IPv6.
uk: Відповідний номер версії: ``4`` для IPv4, ``6`` для IPv6.

source: The total number of bits in the address representation for this version: ``32`` for IPv4, ``128`` for IPv6.
uk: Загальна кількість бітів у поданні адреси для цієї версії: ``32`` для IPv4, ``128`` для IPv6.

source: The prefix defines the number of leading bits in an address that are compared to determine whether or not an address is part of a network.
uk: Префікс визначає кількість початкових бітів в адресі, які порівнюються, щоб визначити, чи є адреса частиною мережі.

source: The string representation in dotted decimal notation. Leading zeroes are never included in the representation.
uk: Представлення рядка в десятковій нотації з розділеними крапками. Початкові нулі ніколи не включаються в представлення.

source: As IPv4 does not define a shorthand notation for addresses with octets set to zero, these two attributes are always the same as ``str(addr)`` for IPv4 addresses. Exposing these attributes makes it easier to write display code that can handle both IPv4 and IPv6 addresses.
uk: Оскільки IPv4 не визначає скороченого позначення для адрес з нульовими октетами, ці два атрибути завжди збігаються з ``str(addr)`` для адрес IPv4. Розкриття цих атрибутів полегшує написання коду відображення, який може обробляти адреси IPv4 і IPv6.

source: The binary representation of this address - a :class:`bytes` object of the appropriate length (most significant octet first). This is 4 bytes for IPv4 and 16 bytes for IPv6.
uk: Двійкове представлення цієї адреси – об’єкт :class:`bytes` відповідної довжини (старший октет першим). Це 4 байти для IPv4 і 16 байтів для IPv6.

source: The name of the reverse DNS PTR record for the IP address, e.g.::
uk: Ім’я зворотного запису PTR DNS для IP-адреси, наприклад::

source: This is the name that could be used for performing a PTR lookup, not the resolved hostname itself.
uk: Це ім’я, яке можна використовувати для пошуку PTR, а не саме розв’язане ім’я хоста.

source: ``True`` if the address is reserved for multicast use. See :RFC:`3171` (for IPv4) or :RFC:`2373` (for IPv6).
uk: ``True``, якщо адреса зарезервована для багатоадресного використання. Див. :RFC:`3171` (для IPv4) або :RFC:`2373` (для IPv6).

source: ``True`` if the address is allocated for private networks. See iana-ipv4-special-registry_ (for IPv4) or iana-ipv6-special-registry_ (for IPv6).
uk: ``True``, якщо адреса призначена для приватних мереж. Перегляньте iana-ipv4-special-registry_ (для IPv4) або iana-ipv6-special-registry_ (для IPv6).

source: ``True`` if the address is allocated for public networks. See iana-ipv4-special-registry_ (for IPv4) or iana-ipv6-special-registry_ (for IPv6).
uk: ``True``, якщо адреса призначена для загальнодоступних мереж. Перегляньте iana-ipv4-special-registry_ (для IPv4) або iana-ipv6-special-registry_ (для IPv6).

source: ``True`` if the address is unspecified. See :RFC:`5735` (for IPv4) or :RFC:`2373` (for IPv6).
uk: ``True``, якщо адреса не вказана. Див. :RFC:`5735` (для IPv4) або :RFC:`2373` (для IPv6).

source: ``True`` if the address is otherwise IETF reserved.
uk: ``True``, якщо інакше адреса зарезервована IETF.

source: ``True`` if this is a loopback address. See :RFC:`3330` (for IPv4) or :RFC:`2373` (for IPv6).
uk: ``True``, якщо це петлева адреса. Див. :RFC:`3330` (для IPv4) або :RFC:`2373` (для IPv6).

source: ``True`` if the address is reserved for link-local usage. See :RFC:`3927`.
uk: ``True``, якщо адреса зарезервована для локального використання посилання. Див. :RFC:`3927`.

source: Returns a string representation of the IP address, controlled by an explicit format string. *fmt* can be one of the following: ``'s'``, the default option, equivalent to :func:`str`, ``'b'`` for a zero-padded binary string, ``'X'`` or ``'x'`` for an uppercase or lowercase hexadecimal representation, or ``'n'``, which is equivalent to ``'b'`` for IPv4 addresses and ``'x'`` for IPv6. For binary and hexadecimal representations, the form specifier ``'#'`` and the grouping option ``'_'`` are available. ``__format__`` is used by ``format``, ``str.format`` and f-strings.
uk: Повертає рядкове представлення IP-адреси, кероване рядком явного формату. *fmt* може бути одним із таких: ``'s'``, параметр за замовчуванням, еквівалентний :func:`str`, ``'b'`` для двійкового рядка з доповненням нуля, ``'X '`` або ``'x'`` для шістнадцяткового представлення у верхньому чи нижньому регістрі, або ``'n'``, що еквівалентно ``'b'`` для адрес IPv4 і ``'x'`` для IPv6. Для двійкових і шістнадцяткових представлень доступні специфікатор форми ``'#'`` і опція групування ``'_'``. ``__format__`` використовується ``format``, ``str.format`` і f-рядками.

source: Construct an IPv6 address. An :exc:`AddressValueError` is raised if *address* is not a valid IPv6 address.
uk: Створіть адресу IPv6. Помилка :exc:`AddressValueError` виникає, якщо *адреса* не є дійсною адресою IPv6.

source: The following constitutes a valid IPv6 address:
uk: Нижче наведено дійсну адресу IPv6:

source: A string consisting of eight groups of four hexadecimal digits, each group representing 16 bits. The groups are separated by colons. This describes an *exploded* (longhand) notation. The string can also be *compressed* (shorthand notation) by various means. See :RFC:`4291` for details. For example, ``"0000:0000:0000:0000:0000:0abc:0007:0def"`` can be compressed to ``"::abc:7:def"``.
uk: Рядок, що складається з восьми груп по чотири шістнадцяткові цифри, кожна група представляє 16 біт. Групи розділені двокрапками. Це описує *розгорнуту* (довгу) нотацію. Рядок також можна *стиснути* (скорочений запис) різними способами. Докладніше див. :RFC:`4291`. Наприклад, ``"0000:0000:0000:0000:0000:0abc:0007:0def"`` можна стиснути до ``"::abc:7:def"``.

source: Optionally, the string may also have a scope zone ID, expressed with a suffix ``%scope_id``. If present, the scope ID must be non-empty, and may not contain ``%``. See :RFC:`4007` for details. For example, ``fe80::1234%1`` might identify address ``fe80::1234`` on the first link of the node.
uk: За бажанням рядок може також мати ідентифікатор зони видимості, виражений суфіксом ``%scope_id``. Якщо присутній, ідентифікатор області має бути непорожнім і не може містити "%". Докладніше див. :RFC:`4007`. Наприклад, ``fe80::1234%1`` може ідентифікувати адресу ``fe80::1234`` на першому посиланні вузла.

source: An integer that fits into 128 bits.
uk: Ціле число, яке вміщується в 128 біт.

source: An integer packed into a :class:`bytes` object of length 16, big-endian.
uk: Ціле число, упаковане в об’єкт :class:`bytes` довжиною 16, старший порядок байтів.

source: The short form of the address representation, with leading zeroes in groups omitted and the longest sequence of groups consisting entirely of zeroes collapsed to a single empty group.
uk: Коротка форма подання адреси з опущеними початковими нулями в групах і найдовшою послідовністю груп, що повністю складається з нулів, згорнута до однієї порожньої групи.

source: This is also the value returned by ``str(addr)`` for IPv6 addresses.
uk: Це також значення, яке повертає ``str(addr)`` для адрес IPv6.

source: The long form of the address representation, with all leading zeroes and groups consisting entirely of zeroes included.
uk: Довга форма подання адреси з усіма початковими нулями та групами, що повністю складаються з нулів.

source: For the following attributes and methods, see the corresponding documentation of the :class:`IPv4Address` class:
uk: Щоб дізнатися про такі атрибути та методи, перегляньте відповідну документацію класу :class:`IPv4Address`:

source: ``True`` if the address is reserved for site-local usage. Note that the site-local address space has been deprecated by :RFC:`3879`. Use :attr:`~IPv4Address.is_private` to test if this address is in the space of unique local addresses as defined by :RFC:`4193`.
uk: ``True``, якщо адреса зарезервована для локального використання сайту. Зауважте, що :RFC:`3879` заборонив локальний адресний простір сайту. Використовуйте :attr:`~IPv4Address.is_private`, щоб перевірити, чи ця адреса входить до простору унікальних локальних адрес, як визначено :RFC:`4193`.

source: For addresses that appear to be IPv4 mapped addresses (starting with ``::FFFF/96``), this property will report the embedded IPv4 address. For any other address, this property will be ``None``.
uk: Для адрес, які виглядають як зіставлені адреси IPv4 (починаючи з ``::FFFF/96``), ця властивість повідомить про вбудовану адресу IPv4. Для будь-якої іншої адреси ця властивість матиме значення ``None``.

source: For scoped addresses as defined by :RFC:`4007`, this property identifies the particular zone of the address's scope that the address belongs to, as a string. When no scope zone is specified, this property will be ``None``.
uk: Для адрес із областю видимості, як визначено :RFC:`4007`, ця властивість визначає конкретну зону області дії адреси, до якої належить адреса, як рядок. Якщо зона видимості не вказана, ця властивість матиме значення ``None``.

source: For addresses that appear to be 6to4 addresses (starting with ``2002::/16``) as defined by :RFC:`3056`, this property will report the embedded IPv4 address. For any other address, this property will be ``None``.
uk: Для адрес, які виглядають як адреси 6to4 (починаючи з ``2002::/16``), як визначено :RFC:`3056`, ця властивість повідомить про вбудовану адресу IPv4. Для будь-якої іншої адреси ця властивість матиме значення ``None``.

source: For addresses that appear to be Teredo addresses (starting with ``2001::/32``) as defined by :RFC:`4380`, this property will report the embedded ``(server, client)`` IP address pair. For any other address, this property will be ``None``.
uk: Для адрес, які виглядають як адреси Teredo (починаючи з ``2001::/32``), як визначено :RFC:`4380`, ця властивість повідомить про вбудовану пару IP-адрес ``(сервер, клієнт)``. Для будь-якої іншої адреси ця властивість матиме значення ``None``.

source: Refer to the corresponding method documentation in :class:`IPv4Address`.
uk: Зверніться до документації відповідного методу в :class:`IPv4Address`.

source: Conversion to Strings and Integers
uk: Перетворення на рядки та цілі числа

source: To interoperate with networking interfaces such as the socket module, addresses must be converted to strings or integers. This is handled using the :func:`str` and :func:`int` builtin functions::
uk: Для взаємодії з мережевими інтерфейсами, такими як модуль сокета, адреси повинні бути перетворені в рядки або цілі числа. Це обробляється за допомогою вбудованих функцій :func:`str` і :func:`int`:

source: Note that IPv6 scoped addresses are converted to integers without scope zone ID.
uk: Зауважте, що IPv6-адреси перетворюються на цілі числа без ідентифікатора зони.

source: Operators
uk: Оператори

source: Address objects support some operators. Unless stated otherwise, operators can only be applied between compatible objects (i.e. IPv4 with IPv4, IPv6 with IPv6).
uk: Об'єкти адреси підтримують деякі оператори. Якщо не зазначено інше, оператори можна застосовувати лише між сумісними об’єктами (наприклад, IPv4 з IPv4, IPv6 з IPv6).

source: Comparison operators
uk: Оператори порівняння

source: Address objects can be compared with the usual set of comparison operators. Same IPv6 addresses with different scope zone IDs are not equal. Some examples::
uk: Об'єкти адреси можна порівнювати за допомогою звичайного набору операторів порівняння. Однакові IPv6-адреси з різними ідентифікаторами зон дії не однакові. Деякі приклади::

source: Arithmetic operators
uk: Арифметичні оператори

source: Integers can be added to or subtracted from address objects. Some examples::
uk: Цілі числа можна додавати або віднімати від об’єктів адреси. Деякі приклади::

source: IP Network definitions
uk: Визначення мережі IP

source: The :class:`IPv4Network` and :class:`IPv6Network` objects provide a mechanism for defining and inspecting IP network definitions. A network definition consists of a *mask* and a *network address*, and as such defines a range of IP addresses that equal the network address when masked (binary AND) with the mask. For example, a network definition with the mask ``255.255.255.0`` and the network address ``192.168.1.0`` consists of IP addresses in the inclusive range ``192.168.1.0`` to ``192.168.1.255``.
uk: Об’єкти :class:`IPv4Network` і :class:`IPv6Network` забезпечують механізм для визначення та перевірки визначень IP-мереж. Визначення мережі складається з *маски* та *мережевої адреси*, і, таким чином, визначає діапазон IP-адрес, які дорівнюють мережевій адресі, коли вона маскована (двійкове І) з маскою. Наприклад, визначення мережі з маскою ``255.255.255.0`` і мережевою адресою ``192.168.1.0`` складається з IP-адрес у включному діапазоні ``192.168.1.0`` до ``192.168.1.255`` .

source: Prefix, net mask and host mask
uk: Префікс, маска мережі та маска хоста

source: There are several equivalent ways to specify IP network masks. A *prefix* ``/<nbits>`` is a notation that denotes how many high-order bits are set in the network mask. A *net mask* is an IP address with some number of high-order bits set. Thus the prefix ``/24`` is equivalent to the net mask ``255.255.255.0`` in IPv4, or ``ffff:ff00::`` in IPv6. In addition, a *host mask* is the logical inverse of a *net mask*, and is sometimes used (for example in Cisco access control lists) to denote a network mask. The host mask equivalent to ``/24`` in IPv4 is ``0.0.0.255``.
uk: Існує кілька еквівалентних способів вказати мережеві маски IP. *Префікс* ``/ <nbits>`` — це позначення, яке вказує, скільки старших бітів встановлено в масці мережі. *Мережева маска* — це IP-адреса з певною кількістю встановлених старших бітів. Таким чином, префікс ``/24`` еквівалентний масці мережі ``255.255.255.0`` в IPv4 або ``ffff:ff00::`` в IPv6. Крім того, *маска хоста* є логічною протилежністю *мережевої маски* та іноді використовується (наприклад, у списках контролю доступу Cisco) для позначення маски мережі. Маска хоста, еквівалентна ``/24`` в IPv4, є ``0.0.0.255``.

source: Network objects
uk: Об'єкти мережі

source: All attributes implemented by address objects are implemented by network objects as well. In addition, network objects implement additional attributes. All of these are common between :class:`IPv4Network` and :class:`IPv6Network`, so to avoid duplication they are only documented for :class:`IPv4Network`. Network objects are :term:`hashable`, so they can be used as keys in dictionaries.
uk: Усі атрибути, реалізовані об’єктами адреси, також реалізуються об’єктами мережі. Крім того, об'єкти мережі реалізують додаткові атрибути. Усі вони є спільними для :class:`IPv4Network` та :class:`IPv6Network`, тому, щоб уникнути дублювання, вони задокументовані лише для :class:`IPv4Network`. Мережеві об’єкти :term:`hashable`, тому їх можна використовувати як ключі в словниках.

source: Construct an IPv4 network definition. *address* can be one of the following:
uk: Створіть визначення мережі IPv4. *адреса* може бути однією з наступних:

source: A string consisting of an IP address and an optional mask, separated by a slash (``/``). The IP address is the network address, and the mask can be either a single number, which means it's a *prefix*, or a string representation of an IPv4 address. If it's the latter, the mask is interpreted as a *net mask* if it starts with a non-zero field, or as a *host mask* if it starts with a zero field, with the single exception of an all-zero mask which is treated as a *net mask*. If no mask is provided, it's considered to be ``/32``.
uk: Рядок, що складається з IP-адреси та додаткової маски, розділених скісною рискою (``/``). IP-адреса – це мережева адреса, а маска може бути або одним числом, що означає, що це *префікс*, або рядковим представленням адреси IPv4. Якщо це останнє, маска інтерпретується як *маска мережі*, якщо вона починається з ненульового поля, або як *маска хоста*, якщо вона починається з нульового поля, за винятком маски з усіма нулями який розглядається як *мережева маска*. Якщо маска не вказана, вона вважається ``/32``.
