Repository: python/python-docs-uk
Catalog: library/itertools.po
Languages: uk

source: :mod:`itertools` --- Functions creating iterators for efficient looping
uk: :mod:`itertools` --- Функції, що створюють ітератори для ефективного циклу

source: This module implements a number of :term:`iterator` building blocks inspired by constructs from APL, Haskell, and SML. Each has been recast in a form suitable for Python.
uk: Цей модуль реалізує кілька будівельних блоків :term:`iterator`, натхненних конструкціями з APL, Haskell і SML. Кожен був перероблений у формі, придатній для Python.

source: The module standardizes a core set of fast, memory efficient tools that are useful by themselves or in combination. Together, they form an "iterator algebra" making it possible to construct specialized tools succinctly and efficiently in pure Python.
uk: Модуль стандартизує основний набір швидких, ефективних інструментів пам’яті, які корисні окремо або в комбінації. Разом вони утворюють "алгебру ітераторів", що дає змогу створювати спеціалізовані інструменти лаконічно та ефективно на чистому Python.

source: For instance, SML provides a tabulation tool: ``tabulate(f)`` which produces a sequence ``f(0), f(1), ...``. The same effect can be achieved in Python by combining :func:`map` and :func:`count` to form ``map(f, count())``.
uk: Наприклад, SML надає інструмент табуляції: ``tabulate(f)``, який створює послідовність ``f(0), f(1), ...``. Такого ж ефекту можна досягти в Python, об’єднавши :func:`map` і :func:`count` для формування ``map(f, count())``.

source: These tools and their built-in counterparts also work well with the high-speed functions in the :mod:`operator` module. For example, the multiplication operator can be mapped across two vectors to form an efficient dot-product: ``sum(map(operator.mul, vector1, vector2))``.
uk: Ці інструменти та їхні вбудовані аналоги також добре працюють із високошвидкісними функціями в модулі :mod:`operator`. Наприклад, оператор множення можна відобразити на два вектори для формування ефективного скалярного добутку: ``sum(map(operator.mul, vector1, vector2))``.

source: **Infinite iterators:**
uk: **Нескінченні ітератори:**

source: Iterator
uk: Ітератор

source: Arguments
uk: Аргументи

source: Results
uk: Результати

source: Example
uk: приклад

source: start, [step]
uk: початок, [крок]

source: start, start+step, start+2*step, ...
uk: початок, початок+крок, початок+2*крок, ...

source: p
uk: стор

source: ``cycle('ABCD') --> A B C D A B C D ...``
uk: ``цикл('ABCD') --> A B C D A B C D ...``

source: elem [,n]
uk: елемент [,n]

source: elem, elem, elem, ... endlessly or up to n times
uk: елем, елем, елем, ... нескінченно або до n разів

source: ``repeat(10, 3) --> 10 10 10``
uk: ``повторити(10, 3) --> 10 10 10``

source: **Iterators terminating on the shortest input sequence:**
uk: **Ітератори, що завершуються на найкоротшій вхідній послідовності:**

source: ``accumulate([1,2,3,4,5]) --> 1 3 6 10 15``
uk: ``накопичувати([1,2,3,4,5]) --> 1 3 6 10 15``

source: ``chain('ABC', 'DEF') --> A B C D E F``
uk: ``ланцюг('ABC', 'DEF') --> A B C D E F``

source: iterable
uk: ітерований

source: data, selectors
uk: дані, селектори

source: (d[0] if s[0]), (d[1] if s[1]), ...
uk: (d[0], якщо s[0]), (d[1], якщо s[1]), ...

source: ``compress('ABCDEF', [1,0,1,0,1,1]) --> A C E F``
uk: ``стиснути('ABCDEF', [1,0,1,0,1,1]) --> A C E F``

source: pred, seq
uk: перед, посл

source: seq[n], seq[n+1], starting when pred fails
uk: seq[n], seq[n+1], починаючи з невдачі pred

source: ``dropwhile(lambda x: x<5, [1,4,6,4,1]) --> 6 4 1``
uk: ``dropwhile(лямбда x: x <5, [1,4,6,4,1]) --> 6 4 1``

source: elements of seq where pred(elem) is false
uk: елементи seq, де pred(elem) false

source: ``filterfalse(lambda x: x%2, range(10)) --> 0 2 4 6 8``
uk: ``filterfalse(лямбда x: x%2, діапазон(10)) --> 0 2 4 6 8``

source: iterable[, key]
uk: ітерований [, ключ]

source: sub-iterators grouped by value of key(v)
uk: субітератори, згруповані за значенням ключа (v)

source: seq, [start,] stop [, step]
uk: seq, [початок,] зупинка [, крок]

source: elements from seq[start:stop:step]
uk: елементи з seq[start:stop:step]

source: ``pairwise('ABCDEFG') --> AB BC CD DE EF FG``
uk: ``попарно('ABCDEFG') --> AB BC CD DE EF FG``

source: func, seq
uk: функція, посл

source: ``starmap(pow, [(2,5), (3,2), (10,3)]) --> 32 9 1000``
uk: ``зоряна карта(pow, [(2,5), (3,2), (10,3)]) --> 32 9 1000``

source: seq[0], seq[1], until pred fails
uk: seq[0], seq[1], поки pred не вийде

source: ``takewhile(lambda x: x<5, [1,4,6,4,1]) --> 1 4``
uk: ``takewhile(лямбда x: x <5, [1,4,6,4,1]) --> 1 4``

source: it, n
uk: воно, п

source: it1, it2, ... itn splits one iterator into n
uk: it1, it2, ... itn розділяє один ітератор на n

source: **Combinatoric iterators:**
uk: **Комбінаторні ітератори:**

source: cartesian product, equivalent to a nested for-loop
uk: декартовий добуток, еквівалентний вкладеному циклу for

source: r-length tuples, all possible orderings, no repeated elements
uk: кортежі довжини r, усі можливі впорядкування, відсутність повторюваних елементів

source: p, r
uk: п, р

source: r-length tuples, in sorted order, no repeated elements
uk: кортежі довжини r, у відсортованому порядку, без повторюваних елементів

source: :func:`combinations_with_replacement`
uk: :func:`комбінації_із_заміною`

source: r-length tuples, in sorted order, with repeated elements
uk: кортежі довжини r, у відсортованому порядку, з повторюваними елементами

source: Examples
uk: Приклади

source: ``permutations('ABCD', 2)``
uk: ``перестановки('ABCD', 2)``

source: Itertool functions
uk: Функції Itertool

source: The following module functions all construct and return iterators. Some provide streams of infinite length, so they should only be accessed by functions or loops that truncate the stream.
uk: У наступному модулі функціонують усі ітератори конструкцій і повернення. Деякі надають потоки нескінченної довжини, тому до них мають звертатися лише функції або цикли, які скорочують потік.

source: Make an iterator that returns accumulated sums, or accumulated results of other binary functions (specified via the optional *func* argument).
uk: Створіть ітератор, який повертає накопичені суми або накопичені результати інших бінарних функцій (зазначених за допомогою необов’язкового аргументу *func*).

source: If *func* is supplied, it should be a function of two arguments. Elements of the input *iterable* may be any type that can be accepted as arguments to *func*. (For example, with the default operation of addition, elements may be any addable type including :class:`~decimal.Decimal` or :class:`~fractions.Fraction`.)
uk: Якщо вказано *func*, це має бути функція двох аргументів. Елементи вхідних даних *iterable* можуть мати будь-який тип, який можна прийняти як аргументи *func*. (Наприклад, із операцією додавання за замовчуванням елементи можуть мати будь-який доданий тип, включаючи :class:`~decimal.Decimal` або :class:`~fractions.Fraction`.)

source: Usually, the number of elements output matches the input iterable. However, if the keyword argument *initial* is provided, the accumulation leads off with the *initial* value so that the output has one more element than the input iterable.
uk: Зазвичай кількість виведених елементів збігається з вхідним ітерованим. Однак, якщо надано ключовий аргумент *initial*, накопичення розпочинається з *початковим* значенням, так що вихід має на один елемент більше, ніж ітерований вхід.

source: Roughly equivalent to::
uk: Приблизно еквівалентно::

source: There are a number of uses for the *func* argument. It can be set to :func:`min` for a running minimum, :func:`max` for a running maximum, or :func:`operator.mul` for a running product. Amortization tables can be built by accumulating interest and applying payments. First-order `recurrence relations <https://en.wikipedia.org/wiki/Recurrence_relation>`_ can be modeled by supplying the initial value in the iterable and using only the accumulated total in *func* argument::
uk: Існує кілька способів використання аргументу *func*. Його можна встановити на :func:`min` для поточного мінімуму, :func:`max` для поточного максимуму або :func:`operator.mul` для поточного продукту. Таблиці амортизації можна побудувати шляхом накопичення відсотків і застосування платежів. `Рекурентні відносини першого порядку <https://en.wikipedia.org/wiki/Recurrence_relation>`_ можна моделювати шляхом надання початкового значення в ітеруючому елементі та використання лише накопиченої суми в аргументі *func*::

source: See :func:`functools.reduce` for a similar function that returns only the final accumulated value.
uk: Перегляньте :func:`functools.reduce` подібну функцію, яка повертає лише остаточне накопичене значення.

source: Added the optional *func* parameter.
uk: Додано необов’язковий параметр *func*.

source: Added the optional *initial* parameter.
uk: Додано необов'язковий *початковий* параметр.

source: Make an iterator that returns elements from the first iterable until it is exhausted, then proceeds to the next iterable, until all of the iterables are exhausted. Used for treating consecutive sequences as a single sequence. Roughly equivalent to::
uk: Створіть ітератор, який повертає елементи з першого ітератора, поки він не буде вичерпаний, а потім переходить до наступного ітератора, доки всі ітератори не будуть вичерпані. Використовується для обробки послідовних послідовностей як однієї послідовності. Приблизно еквівалентно::

source: Alternate constructor for :func:`chain`. Gets chained inputs from a single iterable argument that is evaluated lazily. Roughly equivalent to::
uk: Альтернативний конструктор для :func:`chain`. Отримує ланцюгові вхідні дані з одного ітерованого аргументу, який обчислюється ліниво. Приблизно еквівалентно::

source: Return *r* length subsequences of elements from the input *iterable*.
uk: Повертає *r* довжину підпослідовностей елементів із вхідного *iterable*.

source: The combination tuples are emitted in lexicographic ordering according to the order of the input *iterable*. So, if the input *iterable* is sorted, the combination tuples will be produced in sorted order.
uk: Комбінаційні кортежі видаються в лексикографічному порядку відповідно до порядку введення *iterable*. Отже, якщо вхідні дані *iterable* відсортовано, комбінаційні кортежі створюватимуться у відсортованому порядку.

source: Elements are treated as unique based on their position, not on their value. So if the input elements are unique, there will be no repeat values in each combination.
uk: Елементи розглядаються як унікальні на основі їх позиції, а не їх значення. Отже, якщо вхідні елементи унікальні, у кожній комбінації не буде повторюваних значень.

source: The code for :func:`combinations` can be also expressed as a subsequence of :func:`permutations` after filtering entries where the elements are not in sorted order (according to their position in the input pool)::
uk: Код для :func:`combinations` також може бути виражений як підпослідовність :func:`permutations` після фільтрації записів, де елементи не відсортовані (відповідно до їхньої позиції у вхідному пулі)::

source: The number of items returned is ``n! / r! / (n-r)!`` when ``0 <= r <= n`` or zero when ``r > n``.
uk: Кількість повернених елементів – ``n! / р! / (n-r)!`` коли ``0 <= r <= n`` or zero when ``r > n``.

source: Return *r* length subsequences of elements from the input *iterable* allowing individual elements to be repeated more than once.
uk: Повертає *r* довжину підпослідовностей елементів із вхідного *iterable*, що дозволяє повторювати окремі елементи більше одного разу.

source: Elements are treated as unique based on their position, not on their value. So if the input elements are unique, the generated combinations will also be unique.
uk: Елементи розглядаються як унікальні на основі їх позиції, а не їх значення. Отже, якщо вхідні елементи унікальні, згенеровані комбінації також будуть унікальними.

source: The code for :func:`combinations_with_replacement` can be also expressed as a subsequence of :func:`product` after filtering entries where the elements are not in sorted order (according to their position in the input pool)::
uk: Код для :func:`combinations_with_replacement` також можна виразити як підпослідовність :func:`product` після фільтрації записів, де елементи не відсортовані (відповідно до їхньої позиції у вхідному пулі):

source: The number of items returned is ``(n+r-1)! / r! / (n-1)!`` when ``n > 0``.
uk: Кількість повернених елементів – ``(n+r-1)! / р! / (n-1)!`` коли ``n > 0``.

source: Make an iterator that filters elements from *data* returning only those that have a corresponding element in *selectors* that evaluates to ``True``. Stops when either the *data* or *selectors* iterables has been exhausted. Roughly equivalent to::
uk: Створіть ітератор, який фільтрує елементи з *даних*, повертаючи лише ті, які мають відповідний елемент у *селекторах*, який оцінюється як ``True``. Зупиняється, коли ітерації *data* або *selectors* вичерпано. Приблизно еквівалентно::

source: Make an iterator that returns evenly spaced values starting with number *start*. Often used as an argument to :func:`map` to generate consecutive data points. Also, used with :func:`zip` to add sequence numbers. Roughly equivalent to::
uk: Створіть ітератор, який повертає значення з рівним інтервалом, починаючи з числа *start*. Часто використовується як аргумент :func:`map` для створення послідовних точок даних. Також використовується з :func:`zip` для додавання порядкових номерів. Приблизно еквівалентно::

source: When counting with floating point numbers, better accuracy can sometimes be achieved by substituting multiplicative code such as: ``(start + step * i for i in count())``.
uk: Під час підрахунку з числами з плаваючою комою кращої точності інколи можна досягти шляхом заміни мультиплікативного коду, наприклад: ``(початок + крок * i для i в count())``.

source: Added *step* argument and allowed non-integer arguments.
uk: Додано аргумент *step* і дозволено нецілі аргументи.

source: Make an iterator returning elements from the iterable and saving a copy of each. When the iterable is exhausted, return elements from the saved copy. Repeats indefinitely. Roughly equivalent to::
uk: Зробіть ітератор, який повертає елементи з iterable і зберігає копію кожного. Коли iterable вичерпано, поверніть елементи зі збереженої копії. Повторюється безкінечно. Приблизно еквівалентно::

source: Note, this member of the toolkit may require significant auxiliary storage (depending on the length of the iterable).
uk: Зверніть увагу, що цей член набору інструментів може потребувати значного допоміжного сховища (залежно від довжини ітерованого).

source: Make an iterator that drops elements from the iterable as long as the predicate is true; afterwards, returns every element. Note, the iterator does not produce *any* output until the predicate first becomes false, so it may have a lengthy start-up time. Roughly equivalent to::
uk: Створіть ітератор, який видаляє елементи з ітерованого, якщо предикат істинний; згодом повертає кожен елемент. Зауважте, що ітератор не створює *жодних* виходів, доки предикат не стане хибним, тому він може мати тривалий час запуску. Приблизно еквівалентно::

source: Make an iterator that filters elements from iterable returning only those for which the predicate is ``False``. If *predicate* is ``None``, return the items that are false. Roughly equivalent to::
uk: Створіть ітератор, який фільтрує елементи з ітерованих, повертаючи лише ті, для яких предикат має значення ``False``. Якщо *predicate* має значення ``None``, повернути елементи, які є false. Приблизно еквівалентно::

source: Make an iterator that returns consecutive keys and groups from the *iterable*. The *key* is a function computing a key value for each element. If not specified or is ``None``, *key* defaults to an identity function and returns the element unchanged. Generally, the iterable needs to already be sorted on the same key function.
uk: Створіть ітератор, який повертає послідовні ключі та групи з *iterable*. *Ключ* — це функція, яка обчислює значення ключа для кожного елемента. Якщо не вказано або має значення ``None``, *key* за замовчуванням використовується як функція ідентифікації та повертає елемент без змін. Як правило, iterable вже має бути відсортований за тією самою ключовою функцією.

source: The operation of :func:`groupby` is similar to the ``uniq`` filter in Unix. It generates a break or new group every time the value of the key function changes (which is why it is usually necessary to have sorted the data using the same key function). That behavior differs from SQL's GROUP BY which aggregates common elements regardless of their input order.
uk: Робота :func:`groupby` подібна до фільтра ``uniq`` в Unix. Він генерує розрив або нову групу щоразу, коли змінюється значення ключової функції (саме тому зазвичай необхідно відсортувати дані за допомогою тієї самої ключової функції). Така поведінка відрізняється від GROUP BY SQL, яка агрегує загальні елементи незалежно від порядку введення.

source: The returned group is itself an iterator that shares the underlying iterable with :func:`groupby`. Because the source is shared, when the :func:`groupby` object is advanced, the previous group is no longer visible. So, if that data is needed later, it should be stored as a list::
uk: Повернена група сама є ітератором, який ділиться основним ітератором із :func:`groupby`. Оскільки джерело є спільним, коли об’єкт :func:`groupby` розширено, попередня група більше не відображається. Отже, якщо ці дані знадобляться пізніше, їх слід зберегти як список::

source: :func:`groupby` is roughly equivalent to::
uk: :func:`groupby` приблизно еквівалентно::

source: Make an iterator that returns selected elements from the iterable. If *start* is non-zero, then elements from the iterable are skipped until start is reached. Afterward, elements are returned consecutively unless *step* is set higher than one which results in items being skipped. If *stop* is ``None``, then iteration continues until the iterator is exhausted, if at all; otherwise, it stops at the specified position. Unlike regular slicing, :func:`islice` does not support negative values for *start*, *stop*, or *step*. Can be used to extract related fields from data where the internal structure has been flattened (for example, a multi-line report may list a name field on every third line). Roughly equivalent to::
uk: Створіть ітератор, який повертає вибрані елементи з ітерованого. Якщо *start* відмінний від нуля, то елементи з iterable пропускаються, доки не буде досягнуто початок. Після цього елементи повертаються послідовно, якщо *крок* не встановлено вище, ніж один, що призводить до пропуску елементів. Якщо *stop* має значення ``None``, тоді ітерація продовжується, доки ітератор не буде вичерпано, якщо взагалі; інакше він зупиняється у вказаній позиції. На відміну від звичайного нарізування, :func:`islice` не підтримує від’ємні значення для *start*, *stop* або *step*. Може використовуватися для вилучення пов’язаних полів із даних, внутрішня структура яких була зведена (наприклад, багаторядковий звіт може вказувати поле імені в кожному третьому рядку). Приблизно еквівалентно::

source: If *start* is ``None``, then iteration starts at zero. If *step* is ``None``, then the step defaults to one.
uk: Якщо *start* має значення ``None``, то ітерація починається з нуля. Якщо *крок* має значення ``None``, тоді крок за умовчанням дорівнює одиниці.

source: Return successive overlapping pairs taken from the input *iterable*.
uk: Повертає послідовні пари, що перекриваються, взяті з вхідних даних *iterable*.

source: The number of 2-tuples in the output iterator will be one fewer than the number of inputs. It will be empty if the input iterable has fewer than two values.
uk: Кількість 2-кортежів у вихідному ітераторі буде на один менше, ніж кількість входів. Він буде порожнім, якщо вхідний ітератор має менше двох значень.

source: Return successive *r* length permutations of elements in the *iterable*.
uk: Повертає послідовні зміни довжини *r* елементів у *iterable*.

source: If *r* is not specified or is ``None``, then *r* defaults to the length of the *iterable* and all possible full-length permutations are generated.
uk: Якщо *r* не вказано або має значення ``None``, тоді *r* за замовчуванням відповідає довжині *iterable* і генеруються всі можливі перестановки повної довжини.

source: The permutation tuples are emitted in lexicographic ordering according to the order of the input *iterable*. So, if the input *iterable* is sorted, the combination tuples will be produced in sorted order.
uk: Кортежі перестановок випускаються в лексикографічному порядку відповідно до порядку введення *iterable*. Отже, якщо вхідні дані *iterable* відсортовано, комбінаційні кортежі створюватимуться у відсортованому порядку.

source: Elements are treated as unique based on their position, not on their value. So if the input elements are unique, there will be no repeat values in each permutation.
uk: Елементи розглядаються як унікальні на основі їх позиції, а не їх значення. Отже, якщо вхідні елементи унікальні, у кожній перестановці не буде повторюваних значень.

source: The code for :func:`permutations` can be also expressed as a subsequence of :func:`product`, filtered to exclude entries with repeated elements (those from the same position in the input pool)::
uk: Код для :func:`permutations` також може бути виражений як підпослідовність :func:`product`, відфільтрована, щоб виключити записи з повторюваними елементами (ті, що знаходяться в одній позиції у вхідному пулі):

source: The number of items returned is ``n! / (n-r)!`` when ``0 <= r <= n`` or zero when ``r > n``.
uk: Кількість повернених елементів – ``n! / (n-r)!`` коли ``0 <= r <= n`` or zero when ``r > n``.

source: Cartesian product of input iterables.
uk: Декартовий добуток вхідних ітерацій.

source: Roughly equivalent to nested for-loops in a generator expression. For example, ``product(A, B)`` returns the same as ``((x,y) for x in A for y in B)``.
uk: Приблизно еквівалентно вкладеним циклам for у виразі генератора. Наприклад, ``product(A, B)`` повертає те саме, що ``((x,y) для x в A для y у B)``.

source: The nested loops cycle like an odometer with the rightmost element advancing on every iteration. This pattern creates a lexicographic ordering so that if the input's iterables are sorted, the product tuples are emitted in sorted order.
uk: Вкладені цикли обертаються як одометр із крайнім правим елементом, що просувається на кожній ітерації. Цей шаблон створює лексикографічне впорядкування, так що якщо ітеровані вхідні елементи відсортовані, кортежі продукту видаються в відсортованому порядку.

source: To compute the product of an iterable with itself, specify the number of repetitions with the optional *repeat* keyword argument. For example, ``product(A, repeat=4)`` means the same as ``product(A, A, A, A)``.
uk: Щоб обчислити добуток iterable із самим собою, вкажіть кількість повторень за допомогою необов’язкового аргументу *repeat*. Наприклад, ``product(A, repeat=4)`` означає те саме, що ``product(A, A, A, A)``.

source: This function is roughly equivalent to the following code, except that the actual implementation does not build up intermediate results in memory::
uk: Ця функція приблизно еквівалентна наступному коду, за винятком того, що фактична реалізація не накопичує проміжні результати в пам’яті:

source: Before :func:`product` runs, it completely consumes the input iterables, keeping pools of values in memory to generate the products. Accordingly, it is only useful with finite inputs.
uk: Перед запуском :func:`product` він повністю споживає вхідні ітерації, зберігаючи пули значень у пам’яті для генерації продуктів. Відповідно, це корисно лише з обмеженими вхідними даними.
