Repository: python/python-docs-uk
Catalog: library/itertools.po
Languages: uk

source: Make an iterator that returns *object* over and over again. Runs indefinitely unless the *times* argument is specified. Used as argument to :func:`map` for invariant parameters to the called function. Also used with :func:`zip` to create an invariant part of a tuple record.
uk: Створіть ітератор, який повертає *об’єкт* знову і знову. Працює безстроково, якщо не вказано аргумент *times*. Використовується як аргумент :func:`map` для інваріантних параметрів викликаної функції. Також використовується з :func:`zip` для створення інваріантної частини запису кортежу.

source: A common use for *repeat* is to supply a stream of constant values to *map* or *zip*::
uk: Зазвичай *repeat* використовується для надання потоку постійних значень до *map* або *zip*::

source: Make an iterator that computes the function using arguments obtained from the iterable. Used instead of :func:`map` when argument parameters are already grouped in tuples from a single iterable (the data has been "pre-zipped"). The difference between :func:`map` and :func:`starmap` parallels the distinction between ``function(a,b)`` and ``function(*c)``. Roughly equivalent to::
uk: Створіть ітератор, який обчислює функцію, використовуючи аргументи, отримані від ітератора. Використовується замість :func:`map`, коли параметри аргументу вже згруповані в кортежі з одного ітерованого елемента (дані були попередньо заархівовані). Різниця між :func:`map` і :func:`starmap` є паралельною до різниці між ``function(a,b)`` і ``function(*c)``. Приблизно еквівалентно::

source: Make an iterator that returns elements from the iterable as long as the predicate is true. Roughly equivalent to::
uk: Створіть ітератор, який повертає елементи з ітерованого, якщо предикат істинний. Приблизно еквівалентно::

source: Return *n* independent iterators from a single iterable.
uk: Повертає *n* незалежних ітераторів з одного ітератора.

source: The following Python code helps explain what *tee* does (although the actual implementation is more complex and uses only a single underlying :abbr:`FIFO (first-in, first-out)` queue).
uk: Наступний код Python допомагає пояснити, що робить *tee* (хоча фактична реалізація є складнішою та використовує лише одну базову чергу :abbr:`FIFO (першим увійшов, першим вийшов)`).

source: Once :func:`tee` has made a split, the original *iterable* should not be used anywhere else; otherwise, the *iterable* could get advanced without the tee objects being informed.
uk: Після того, як :func:`tee` здійснив розбиття, оригінальний *iterable* більше ніде не слід використовувати; в іншому випадку *iterable* може бути просунуто без інформування об’єктів tee.

source: ``tee`` iterators are not threadsafe. A :exc:`RuntimeError` may be raised when using simultaneously iterators returned by the same :func:`tee` call, even if the original *iterable* is threadsafe.
uk: Ітератори ``tee`` не є потокобезпечними. Помилка :exc:`RuntimeError` може виникнути під час одночасного використання ітераторів, що повертаються тим самим викликом :func:`tee`, навіть якщо оригінальний *iterable* є потокобезпечним.

source: This itertool may require significant auxiliary storage (depending on how much temporary data needs to be stored). In general, if one iterator uses most or all of the data before another iterator starts, it is faster to use :func:`list` instead of :func:`tee`.
uk: Цей інструмент itertool може потребувати значного допоміжного сховища (залежно від того, скільки тимчасових даних потрібно зберегти). Загалом, якщо один ітератор використовує більшість або всі дані перед запуском іншого ітератора, швидше використовувати :func:`list` замість :func:`tee`.

source: Make an iterator that aggregates elements from each of the iterables. If the iterables are of uneven length, missing values are filled-in with *fillvalue*. Iteration continues until the longest iterable is exhausted. Roughly equivalent to::
uk: Створіть ітератор, який агрегує елементи з кожного ітератора. Якщо ітерації мають нерівномірну довжину, відсутні значення заповнюються за допомогою *fillvalue*. Ітерація триває до тих пір, поки не буде вичерпано найдовшу ітерацію. Приблизно еквівалентно::

source: If one of the iterables is potentially infinite, then the :func:`zip_longest` function should be wrapped with something that limits the number of calls (for example :func:`islice` or :func:`takewhile`). If not specified, *fillvalue* defaults to ``None``.
uk: Якщо один із ітераторів потенційно нескінченний, то функцію :func:`zip_longest` слід обернути чимось, що обмежує кількість викликів (наприклад, :func:`islice` або :func:`takewhile`). Якщо не вказано, *fillvalue* за замовчуванням має значення ``None``.

source: Itertools Recipes
uk: Рецепти Itertools

source: This section shows recipes for creating an extended toolset using the existing itertools as building blocks.
uk: У цьому розділі наведено рецепти для створення розширеного набору інструментів з використанням існуючих itertools як будівельних блоків.

source: Substantially all of these recipes and many, many others can be installed from the `more-itertools project <https://pypi.org/project/more-itertools/>`_ found on the Python Package Index::
uk: Практично всі ці рецепти та багато, багато інших можна встановити з `more-itertools project <https://pypi.org/project/more-itertools/>`_, знайденого в індексі пакетів Python::

source: The extended tools offer the same high performance as the underlying toolset. The superior memory performance is kept by processing elements one at a time rather than bringing the whole iterable into memory all at once. Code volume is kept small by linking the tools together in a functional style which helps eliminate temporary variables. High speed is retained by preferring "vectorized" building blocks over the use of for-loops and :term:`generator`\s which incur interpreter overhead.
uk: Розширені інструменти пропонують таку ж високу продуктивність, як і базовий набір інструментів. Чудова продуктивність пам’яті зберігається завдяки обробці елементів по одному, а не перенесенню всього ітерованого в пам’ять відразу. Обсяг коду зберігається невеликим завдяки пов’язуванню інструментів разом у функціональному стилі, що допомагає усунути тимчасові змінні. Висока швидкість зберігається завдяки відданню переваги "векторизованим" будівельним блокам перед використанням циклів for і :term:`generator`\s, які спричиняють накладні витрати інтерпретатора.
