Repository: python/python-docs-uk
Catalog: library/json.po
Languages: uk

source: **Source code:** :source:`Lib/json/__init__.py`
uk: **Вихідний код:** :source:`Lib/json/__init__.py`

source: :mod:`json` exposes an API familiar to users of the standard library :mod:`marshal` and :mod:`pickle` modules.
uk: :mod:`json` надає API, знайомий користувачам модулів стандартної бібліотеки :mod:`marshal` і :mod:`pickle`.

source: Encoding basic Python object hierarchies::
uk: Кодування основних ієрархій об’єктів Python::

source: Compact encoding::
uk: Компактне кодування::

source: Pretty printing::
uk: Гарний друк::

source: Decoding JSON::
uk: Декодування JSON::

source: Specializing JSON object decoding::
uk: Спеціалізоване декодування об'єктів JSON::

source: Extending :class:`JSONEncoder`::
uk: Розширення :class:`JSONEncoder`::

source: Using :mod:`json.tool` from the shell to validate and pretty-print:
uk: Використання :mod:`json.tool` з оболонки для перевірки та красивого друку:

source: See :ref:`json-commandline` for detailed documentation.
uk: Перегляньте :ref:`json-commandline` для детальної документації.

source: This module's encoders and decoders preserve input and output order by default. Order is only lost if the underlying containers are unordered.
uk: Кодери та декодери цього модуля зберігають порядок введення та виведення за замовчуванням. Порядок втрачається, лише якщо базові контейнери не впорядковані.

source: Basic Usage
uk: Основне використання

source: Unlike :mod:`pickle` and :mod:`marshal`, JSON is not a framed protocol, so trying to serialize multiple objects with repeated calls to :func:`dump` using the same *fp* will result in an invalid JSON file.
uk: На відміну від :mod:`pickle` і :mod:`marshal`, JSON не є фреймованим протоколом, тому спроба серіалізувати кілька об’єктів за допомогою повторних викликів :func:`dump` з використанням того самого *fp* призведе до недійсного JSON файл.

source: Parameters
uk: Параметри

source: Allow strings for *indent* in addition to integers.
uk: Дозволити рядки для *відступу* на додаток до цілих чисел.

source: Use ``(',', ': ')`` as default if *indent* is not ``None``.
uk: Використовуйте ``(',', ': ')`` за умовчанням, якщо *indent* не є ``None``.

source: All optional parameters are now :ref:`keyword-only <keyword-only_parameter>`.
uk: Усі додаткові параметри тепер :ref:`лише для ключових слів <keyword-only_parameter>`.

source: Serialize *obj* to a JSON formatted :class:`str` using this :ref:`conversion table <py-to-json-table>`. The arguments have the same meaning as in :func:`dump`.
uk: Серіалізуйте *obj* у JSON у форматі :class:`str` за допомогою цієї :ref:`таблиці перетворення <py-to-json-table>`. Аргументи мають те саме значення, що й у :func:`dump`.

source: Keys in key/value pairs of JSON are always of the type :class:`str`. When a dictionary is converted into JSON, all the keys of the dictionary are coerced to strings. As a result of this, if a dictionary is converted into JSON and then back into a dictionary, the dictionary may not equal the original one. That is, ``loads(dumps(x)) != x`` if x has non-string keys.
uk: Ключі в парах ключ/значення JSON завжди мають тип :class:`str`. Коли словник перетворюється на JSON, усі ключі словника перетворюються на рядки. У результаті цього, якщо словник перетворюється на JSON, а потім знову на словник, словник може не відповідати оригінальному. Тобто ``loads(dumps(x)) != x``, якщо x має нерядкові ключі.

source: *parse_constant* doesn't get called on 'null', 'true', 'false' anymore.
uk: *parse_constant* більше не викликається на 'null', 'true', 'false'.

source: *fp* can now be a :term:`binary file`. The input encoding should be UTF-8, UTF-16 or UTF-32.
uk: *fp* тепер може бути :term:`binary file`. Вхідне кодування має бути UTF-8, UTF-16 або UTF-32.

source: *s* can now be of type :class:`bytes` or :class:`bytearray`. The input encoding should be UTF-8, UTF-16 or UTF-32.
uk: *s* тепер може бути типу :class:`bytes` або :class:`bytearray`. Вхідне кодування має бути UTF-8, UTF-16 або UTF-32.

source: The keyword argument *encoding* has been removed.
uk: Аргумент ключового слова *кодування* видалено.

source: Encoders and Decoders
uk: Кодери та декодери

source: Simple JSON decoder.
uk: Простий декодер JSON.

source: Performs the following translations in decoding by default:
uk: Виконує такі переклади в декодуванні за замовчуванням:

source: object
uk: об'єкт

source: dict
uk: дикт

source: array
uk: масив

source: list
uk: список

source: string
uk: рядок

source: str
uk: вул

source: number (int)
uk: число (ціле)

source: int
uk: внутр

source: number (real)
uk: число (дійсне)

source: float
uk: плавати

source: true
uk: правда

source: True
uk: правда

source: false
uk: помилковий

source: False
uk: помилковий

source: null
uk: нуль

source: None
uk: Жодного

source: It also understands ``NaN``, ``Infinity``, and ``-Infinity`` as their corresponding ``float`` values, which is outside the JSON spec.
uk: Він також розуміє ``NaN``, ``Infinity`` і ``-Infinity`` як їхні відповідні значення ``float``, що виходить за межі специфікації JSON.

source: Added support for *object_pairs_hook*.
uk: Додано підтримку *object_pairs_hook*.

source: If *strict* is false (``True`` is the default), then control characters will be allowed inside strings. Control characters in this context are those with character codes in the 0--31 range, including ``'\t'`` (tab), ``'\n'``, ``'\r'`` and ``'\0'``.
uk: Якщо *strict* має значення false (``True`` є значенням за замовчуванням), то керуючі символи будуть дозволені всередині рядків. Контрольні символи в цьому контексті — це символи з кодами символів у діапазоні 0--31, включаючи ``'\t'`` (табуляція), ``'\n'``, ``'\r'`` і ``'\0'``.

source: If the data being deserialized is not a valid JSON document, a :exc:`JSONDecodeError` will be raised.
uk: Якщо дані, які десеріалізуються, не є дійсним документом JSON, виникне :exc:`JSONDecodeError`.

source: All parameters are now :ref:`keyword-only <keyword-only_parameter>`.
uk: Усі параметри тепер :ref:`лише для ключових слів <keyword-only_parameter>`.

source: Return the Python representation of *s* (a :class:`str` instance containing a JSON document).
uk: Повертає представлення Python *s* (екземпляр :class:`str`, що містить документ JSON).

source: :exc:`JSONDecodeError` will be raised if the given JSON document is not valid.
uk: :exc:`JSONDecodeError` буде викликано, якщо вказаний документ JSON недійсний.

source: Decode a JSON document from *s* (a :class:`str` beginning with a JSON document) and return a 2-tuple of the Python representation and the index in *s* where the document ended.
uk: Декодуйте документ JSON із *s* (:class:`str`, що починається з документа JSON) і повертайте 2-кортеж представлення Python та індекс у *s*, де документ закінчився.

source: This can be used to decode a JSON document from a string that may have extraneous data at the end.
uk: Це можна використовувати для декодування документа JSON із рядка, який може містити сторонні дані в кінці.

source: Extensible JSON encoder for Python data structures.
uk: Розширюваний кодувальник JSON для структур даних Python.

source: Supports the following objects and types by default:
uk: За замовчуванням підтримує такі об’єкти та типи:

source: list, tuple
uk: список, кортеж

source: number
uk: номер

source: Added support for int- and float-derived Enum classes.
uk: Додано підтримку класів Enum, похідних від int і float.

source: If *ensure_ascii* is true (the default), the output is guaranteed to have all incoming non-ASCII characters escaped. If *ensure_ascii* is false, these characters will be output as-is.
uk: Якщо *ensure_ascii* має значення true (за замовчуванням), вивід гарантовано матиме екранування всіх вхідних символів, які не є ASCII. Якщо *ensure_ascii* має значення false, ці символи виводитимуться як є.

source: If *allow_nan* is true (the default), then ``NaN``, ``Infinity``, and ``-Infinity`` will be encoded as such. This behavior is not JSON specification compliant, but is consistent with most JavaScript based encoders and decoders. Otherwise, it will be a :exc:`ValueError` to encode such floats.
uk: Якщо *allow_nan* має значення true (за замовчуванням), тоді ``NaN``, ``Infinity`` і ``-Infinity`` будуть закодовані як такі. Така поведінка не відповідає специфікації JSON, але відповідає більшості кодувальників і декодерів на основі JavaScript. В іншому випадку це буде :exc:`ValueError` для кодування таких плаваючих значень.

source: If *sort_keys* is true (default: ``False``), then the output of dictionaries will be sorted by key; this is useful for regression tests to ensure that JSON serializations can be compared on a day-to-day basis.
uk: Якщо *sort_keys* має значення true (за замовчуванням: ``False``), тоді вихідні дані словників будуть відсортовані за ключем; це корисно для регресійних тестів, щоб гарантувати, що серіалізації JSON можна порівнювати щодня.

source: If *indent* is a non-negative integer or string, then JSON array elements and object members will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the most compact representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
uk: Якщо *indent* є невід’ємним цілим числом або рядком, елементи масиву JSON і члени об’єкта будуть надруковані з таким рівнем відступу. Рівень відступу 0, негативний або ``""`` вставлятиме лише нові рядки. ``None`` (за замовчуванням) вибирає найбільш компактне представлення. Використання додатного цілого відступу робить стільки відступів на рівень. Якщо *indent* є рядком (наприклад, ``"\t"``), цей рядок використовується для відступу кожного рівня.

source: If specified, *separators* should be an ``(item_separator, key_separator)`` tuple. The default is ``(', ', ': ')`` if *indent* is ``None`` and ``(',', ': ')`` otherwise. To get the most compact JSON representation, you should specify ``(',', ':')`` to eliminate whitespace.
uk: Якщо вказано, *роздільники* мають бути кортежем ``(item_separator, key_separator)``. Типовим значенням є ``(', ', ': ')``, якщо *indent* має значення ``None``, і ``(',', ': ')`` в іншому випадку. Щоб отримати найбільш компактне представлення JSON, ви повинні вказати ``(',', ':')``, щоб усунути пробіли.

source: If specified, *default* should be a function that gets called for objects that can't otherwise be serialized. It should return a JSON encodable version of the object or raise a :exc:`TypeError`. If not specified, :exc:`TypeError` is raised.
uk: Якщо вказано, *default* має бути функцією, яка викликається для об’єктів, які не можуть бути серіалізовані інакше. Він має повертати кодовану JSON версію об’єкта або викликати :exc:`TypeError`. Якщо не вказано, виникає :exc:`TypeError`.

source: Implement this method in a subclass such that it returns a serializable object for *o*, or calls the base implementation (to raise a :exc:`TypeError`).
uk: Реалізуйте цей метод у підкласі так, щоб він повертав серіалізований об’єкт для *o* або викликав базову реалізацію (щоб викликати :exc:`TypeError`).

source: Return a JSON string representation of a Python data structure, *o*. For example::
uk: Повертає рядкове представлення JSON структури даних Python, *o*. Наприклад::

source: Encode the given object, *o*, and yield each string representation as available. For example::
uk: Закодуйте вказаний об’єкт, *o*, і передайте кожне представлення рядка як доступне. Наприклад::

source: Exceptions
uk: Винятки

source: Subclass of :exc:`ValueError` with the following additional attributes:
uk: Підклас :exc:`ValueError` з такими додатковими атрибутами:

source: The unformatted error message.
uk: Неформатне повідомлення про помилку.

source: The JSON document being parsed.
uk: Документ JSON аналізується.

source: The start index of *doc* where parsing failed.
uk: Початковий індекс *doc*, де синтаксичний аналіз не вдався.

source: The line corresponding to *pos*.
uk: Рядок, що відповідає *pos*.

source: The column corresponding to *pos*.
uk: Стовпець, що відповідає *pos*.

source: Standard Compliance and Interoperability
uk: Відповідність стандартам і сумісність

source: This module does not comply with the RFC in a strict fashion, implementing some extensions that are valid JavaScript but not valid JSON. In particular:
uk: Цей модуль не повністю відповідає RFC, реалізуючи деякі розширення, які є дійсним JavaScript, але не дійсним JSON. Зокрема:

source: Infinite and NaN number values are accepted and output;
uk: Нескінченні та NaN числові значення приймаються та виводяться;

source: Repeated names within an object are accepted, and only the value of the last name-value pair is used.
uk: Повторювані імена в межах об’єкта приймаються, і використовується лише значення останньої пари ім’я-значення.

source: Since the RFC permits RFC-compliant parsers to accept input texts that are not RFC-compliant, this module's deserializer is technically RFC-compliant under default settings.
uk: Оскільки RFC дозволяє RFC-сумісним парсерам приймати вхідні тексти, які не є RFC-сумісними, десеріалізатор цього модуля є технічно RFC-сумісним за умовчанням.

source: Character Encodings
uk: Кодування символів

source: The RFC requires that JSON be represented using either UTF-8, UTF-16, or UTF-32, with UTF-8 being the recommended default for maximum interoperability.
uk: RFC вимагає, щоб JSON був представлений за допомогою UTF-8, UTF-16 або UTF-32, причому UTF-8 є рекомендованим за замовчуванням для максимальної сумісності.

source: As permitted, though not required, by the RFC, this module's serializer sets *ensure_ascii=True* by default, thus escaping the output so that the resulting strings only contain ASCII characters.
uk: Як це дозволено, хоча й не вимагається RFC, серіалізатор цього модуля встановлює *ensure_ascii=True* за замовчуванням, таким чином усуваючи вихідні дані, щоб кінцеві рядки містили лише символи ASCII.

source: Other than the *ensure_ascii* parameter, this module is defined strictly in terms of conversion between Python objects and :class:`Unicode strings <str>`, and thus does not otherwise directly address the issue of character encodings.
uk: За винятком параметра *ensure_ascii*, цей модуль визначено суворо в термінах перетворення між об’єктами Python і :class:`рядками Unicode <str>`, і, отже, іншим чином безпосередньо не вирішує проблему кодування символів.

source: The RFC prohibits adding a byte order mark (BOM) to the start of a JSON text, and this module's serializer does not add a BOM to its output. The RFC permits, but does not require, JSON deserializers to ignore an initial BOM in their input. This module's deserializer raises a :exc:`ValueError` when an initial BOM is present.
uk: RFC забороняє додавати позначку порядку байтів (BOM) на початок тексту JSON, а серіалізатор цього модуля не додає BOM до свого виводу. RFC дозволяє, але не вимагає, щоб десеріалізатори JSON ігнорували початкову специфікацію у своїх вхідних даних. Десеріалізатор цього модуля викликає :exc:`ValueError`, коли присутня початкова специфікація.

source: The RFC does not explicitly forbid JSON strings which contain byte sequences that don't correspond to valid Unicode characters (e.g. unpaired UTF-16 surrogates), but it does note that they may cause interoperability problems. By default, this module accepts and outputs (when present in the original :class:`str`) code points for such sequences.
uk: RFC явно не забороняє рядки JSON, які містять послідовності байтів, які не відповідають дійсним символам Unicode (наприклад, непарні сурогати UTF-16), але зазначається, що вони можуть спричинити проблеми взаємодії. За замовчуванням цей модуль приймає та виводить (якщо є в оригінальному :class:`str`) кодові точки для таких послідовностей.

source: Infinite and NaN Number Values
uk: Нескінченні значення чисел NaN

source: The RFC does not permit the representation of infinite or NaN number values. Despite that, by default, this module accepts and outputs ``Infinity``, ``-Infinity``, and ``NaN`` as if they were valid JSON number literal values::
uk: RFC не дозволяє подання нескінченних значень чи чисел NaN. Незважаючи на це, за замовчуванням цей модуль приймає та виводить ``Infinity``, ``-Infinity`` і ``NaN`` так, якби вони були дійсними літеральними значеннями номерів JSON::

source: In the serializer, the *allow_nan* parameter can be used to alter this behavior. In the deserializer, the *parse_constant* parameter can be used to alter this behavior.
uk: У серіалізаторі можна використовувати параметр *allow_nan*, щоб змінити цю поведінку. У десеріалізаторі можна використовувати параметр *parse_constant*, щоб змінити цю поведінку.

source: Repeated Names Within an Object
uk: Повторювані імена в межах об’єкта

source: The RFC specifies that the names within a JSON object should be unique, but does not mandate how repeated names in JSON objects should be handled. By default, this module does not raise an exception; instead, it ignores all but the last name-value pair for a given name::
uk: RFC визначає, що імена в об’єкті JSON мають бути унікальними, але не визначає, як слід обробляти повторювані імена в об’єктах JSON. За замовчуванням цей модуль не викликає винятку; замість цього він ігнорує все, окрім пари прізвище-значення для даного імені::

source: The *object_pairs_hook* parameter can be used to alter this behavior.
uk: Параметр *object_pairs_hook* можна використовувати, щоб змінити цю поведінку.

source: Top-level Non-Object, Non-Array Values
uk: Необ’єктні та немасивні значення верхнього рівня

source: The old version of JSON specified by the obsolete :rfc:`4627` required that the top-level value of a JSON text must be either a JSON object or array (Python :class:`dict` or :class:`list`), and could not be a JSON null, boolean, number, or string value. :rfc:`7159` removed that restriction, and this module does not and has never implemented that restriction in either its serializer or its deserializer.
uk: Стара версія JSON, визначена застарілим :rfc:`4627`, вимагала, щоб значення верхнього рівня тексту JSON було або об’єктом JSON, або масивом (Python :class:`dict` або :class:`list`) і не може бути нульовим, логічним, числовим або рядковим значенням JSON. :rfc:`7159` видалив це обмеження, і цей модуль не реалізував і ніколи не реалізував це обмеження ні в серіалізаторі, ні в десеріалізаторі.

source: Regardless, for maximum interoperability, you may wish to voluntarily adhere to the restriction yourself.
uk: Незважаючи на це, для максимальної сумісності ви можете самостійно добровільно дотримуватися цього обмеження.

source: Implementation Limitations
uk: Обмеження реалізації

source: Some JSON deserializer implementations may set limits on:
uk: Деякі реалізації десеріалізатора JSON можуть встановлювати обмеження на:

source: the size of accepted JSON texts
uk: розмір прийнятих текстів JSON

source: the maximum level of nesting of JSON objects and arrays
uk: максимальний рівень вкладеності об'єктів і масивів JSON

source: the range and precision of JSON numbers
uk: діапазон і точність чисел JSON

source: the content and maximum length of JSON strings
uk: вміст і максимальну довжину рядків JSON

source: This module does not impose any such limits beyond those of the relevant Python datatypes themselves or the Python interpreter itself.
uk: Цей модуль не накладає жодних таких обмежень, окрім обмежень відповідних типів даних Python або самого інтерпретатора Python.

source: When serializing to JSON, beware any such limitations in applications that may consume your JSON. In particular, it is common for JSON numbers to be deserialized into IEEE 754 double precision numbers and thus subject to that representation's range and precision limitations. This is especially relevant when serializing Python :class:`int` values of extremely large magnitude, or when serializing instances of "exotic" numerical types such as :class:`decimal.Decimal`.
uk: Під час серіалізації в JSON уникайте таких обмежень у програмах, які можуть використовувати ваш JSON. Зокрема, зазвичай числа JSON десеріалізуються в числа подвійної точності IEEE 754 і, таким чином, підпадають під обмеження діапазону представлення та точності. Це особливо важливо під час серіалізації Python :class:`int` значень надзвичайно великої величини або під час серіалізації екзотичних числових типів, таких як :class:`decimal.Decimal`.

source: Command Line Interface
uk: Інтерфейс командного рядка

source: **Source code:** :source:`Lib/json/tool.py`
uk: **Вихідний код:** :source:`Lib/json/tool.py`

source: The :mod:`json.tool` module provides a simple command line interface to validate and pretty-print JSON objects.
uk: Модуль :mod:`json.tool` забезпечує простий інтерфейс командного рядка для перевірки та красивого друку об’єктів JSON.

source: The output is now in the same order as the input. Use the :option:`--sort-keys` option to sort the output of dictionaries alphabetically by key.
uk: Вихід тепер у такому самому порядку, як і вхід. Використовуйте опцію :option:`--sort-keys`, щоб відсортувати вихідні дані словників за алфавітом за ключем.

source: Command line options
uk: Параметри командного рядка

source: The JSON file to be validated or pretty-printed:
uk: Файл JSON, який потрібно перевірити або роздрукувати:

source: Sort the output of dictionaries alphabetically by key.
uk: Сортувати вихідні дані словників за алфавітом за ключем.

source: Disable escaping of non-ascii characters, see :func:`json.dumps` for more information.
uk: Вимкніть екранування символів, відмінних від ASCII, див. :func:`json.dumps` для отримання додаткової інформації.

source: Parse every input line as separate JSON object.
uk: Проаналізуйте кожен рядок введення як окремий об’єкт JSON.

source: Mutually exclusive options for whitespace control.
uk: Взаємовиключні параметри керування пробілами.

source: Show the help message.
uk: Показати довідкове повідомлення.

source: Footnotes
uk: Виноски

source: As noted in `the errata for RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON permits literal U+2028 (LINE SEPARATOR) and U+2029 (PARAGRAPH SEPARATOR) characters in strings, whereas JavaScript (as of ECMAScript Edition 5.1) does not.
uk: Як зазначено в `виправленнях для RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON дозволяє літерали U+2028 (РОЗДІЛЮВАЧ РЯДКУ) і U+2029 (РОЗДІЛЮВАЧ ПАРАГРАФА) у рядках, тоді як JavaScript (починаючи з версії ECMAScript 5.1) не допускає.
