Repository: python/python-docs-uk
Catalog: library/linecache.po
Languages: uk

source: **Source code:** :source:`Lib/linecache.py`
uk: **Вихідний код:** :source:`Lib/linecache.py`

source: The :mod:`linecache` module allows one to get any line from a Python source file, while attempting to optimize internally, using a cache, the common case where many lines are read from a single file. This is used by the :mod:`traceback` module to retrieve source lines for inclusion in the formatted traceback.
uk: Модуль :mod:`linecache` дозволяє отримати будь-який рядок із вихідного файлу Python, одночасно намагаючись оптимізувати внутрішню систему, використовуючи кеш, типовий випадок, коли багато рядків зчитується з одного файлу. Це використовується модулем :mod:`traceback` для отримання вихідних рядків для включення у відформатовану трасування.

source: The :func:`tokenize.open` function is used to open files. This function uses :func:`tokenize.detect_encoding` to get the encoding of the file; in the absence of an encoding token, the file encoding defaults to UTF-8.
uk: Функція :func:`tokenize.open` використовується для відкриття файлів. Ця функція використовує :func:`tokenize.detect_encoding`, щоб отримати кодування файлу; за відсутності маркера кодування, кодування файлу за замовчуванням — UTF-8.

source: The :mod:`linecache` module defines the following functions:
uk: Модуль :mod:`linecache` визначає такі функції:

source: Get line *lineno* from file named *filename*. This function will never raise an exception --- it will return ``''`` on errors (the terminating newline character will be included for lines that are found).
uk: Отримати рядок *lineno* з файлу з назвою *filename*. Ця функція ніколи не викличе виняток --- вона повертатиме ``''`` у разі помилки (кінцевий символ нового рядка буде включено для знайдених рядків).

source: If a file named *filename* is not found, the function first checks for a :pep:`302` ``__loader__`` in *module_globals*. If there is such a loader and it defines a ``get_source`` method, then that determines the source lines (if ``get_source()`` returns ``None``, then ``''`` is returned). Finally, if *filename* is a relative filename, it is looked up relative to the entries in the module search path, ``sys.path``.
uk: Якщо файл із назвою *filename* не знайдено, функція спочатку перевіряє наявність :pep:`302` ``__loader__`` у *module_globals*. Якщо такий завантажувач існує і він визначає метод get_source, то він визначає вихідні рядки (якщо get_source() повертає None, тоді повертається ``''``). Нарешті, якщо *filename* є відносною назвою файлу, вона шукається відносно записів у шляху пошуку модуля, ``sys.path``.

source: Clear the cache. Use this function if you no longer need lines from files previously read using :func:`getline`.
uk: Очистити кеш. Використовуйте цю функцію, якщо вам більше не потрібні рядки з файлів, які раніше були прочитані за допомогою :func:`getline`.

source: Check the cache for validity. Use this function if files in the cache may have changed on disk, and you require the updated version. If *filename* is omitted, it will check all the entries in the cache.
uk: Перевірте кеш на дійсність. Використовуйте цю функцію, якщо файли в кеші могли змінитися на диску, і вам потрібна оновлена версія. Якщо *ім’я файлу* опущено, буде перевірено всі записи в кеші.

source: Capture enough detail about a non-file-based module to permit getting its lines later via :func:`getline` even if *module_globals* is ``None`` in the later call. This avoids doing I/O until a line is actually needed, without having to carry the module globals around indefinitely.
uk: Зберіть достатньо деталей про нефайловий модуль, щоб дозволити отримати його рядки пізніше через :func:`getline`, навіть якщо *module_globals* має значення ``None`` у наступному виклику. Це дозволяє уникнути введення/виведення, доки рядок дійсно не знадобиться, без необхідності носити глобальні модулі безкінечно.

source: Example::
uk: Приклад::

source: module
uk: модуль
