Repository: python/python-docs-uk
Catalog: library/locale.po
Languages: uk

source: There is no way to perform case conversions and character classifications according to the locale. For (Unicode) text strings these are done according to the character value only, while for byte strings, the conversions and classifications are done according to the ASCII value of the byte, and bytes whose high bit is set (i.e., non-ASCII bytes) are never converted or considered part of a character class such as letter or whitespace.
uk: Немає способу виконати перетворення регістру та класифікацію символів відповідно до локалі. Для текстових рядків (Unicode) вони виконуються лише відповідно до значення символу, тоді як для рядків байтів перетворення та класифікація виконуються відповідно до значення ASCII байта та байтів, для яких встановлено старший біт (тобто байти, що не належать до ASCII ) ніколи не перетворюються та не вважаються частиною класу символів, такого як літера чи пробіл.

source: For extension writers and programs that embed Python
uk: Для авторів розширень і програм, які вбудовують Python

source: Extension modules should never call :func:`setlocale`, except to find out what the current locale is. But since the return value can only be used portably to restore it, that is not very useful (except perhaps to find out whether or not the locale is ``C``).
uk: Модулі розширення ніколи не повинні викликати :func:`setlocale`, за винятком того, щоб дізнатися, яка поточна локаль. Але оскільки значення, що повертається, можна використати лише портативно, щоб відновити його, це не дуже корисно (за винятком, можливо, для того, щоб дізнатися, чи є локаль ``C``).

source: Access to message catalogs
uk: Доступ до каталогів повідомлень

source: module
uk: модуль
