Repository: python/python-docs-uk
Catalog: library/locale.po
Languages: uk

source: **Source code:** :source:`Lib/locale.py`
uk: **Вихідний код:** :source:`Lib/locale.py`

source: The :mod:`locale` module opens access to the POSIX locale database and functionality. The POSIX locale mechanism allows programmers to deal with certain cultural issues in an application, without requiring the programmer to know all the specifics of each country where the software is executed.
uk: Модуль :mod:`locale` відкриває доступ до бази даних і функцій POSIX locale. Механізм локалізації POSIX дозволяє програмістам мати справу з певними культурними проблемами в додатку, не вимагаючи від програміста знання всіх особливостей кожної країни, де виконується програмне забезпечення.

source: The :mod:`locale` module defines the following exception and functions:
uk: Модуль :mod:`locale` визначає такі винятки та функції:

source: Exception raised when the locale passed to :func:`setlocale` is not recognized.
uk: Виняток виникає, коли локаль, передана :func:`setlocale`, не розпізнається.

source: If *locale* is given and not ``None``, :func:`setlocale` modifies the locale setting for the *category*. The available categories are listed in the data description below. *locale* may be a string, or an iterable of two strings (language code and encoding). If it's an iterable, it's converted to a locale name using the locale aliasing engine. An empty string specifies the user's default settings. If the modification of the locale fails, the exception :exc:`Error` is raised. If successful, the new locale setting is returned.
uk: Якщо вказано *locale*, а не ``None``, :func:`setlocale` змінює налаштування мови для *категорії*. Доступні категорії перераховані в описі даних нижче. *locale* може бути рядком або ітерацією двох рядків (код мови та кодування). Якщо це ітерація, вона перетворюється на назву локалі за допомогою механізму псевдонімів локалі. Порожній рядок визначає параметри користувача за замовчуванням. Якщо зміна локалі не вдається, виникає виняток :exc:`Error`. У разі успіху повертається нове налаштування мови.

source: If *locale* is omitted or ``None``, the current setting for *category* is returned.
uk: Якщо *locale* пропущено або ``None``, повертається поточне налаштування для *category*.

source: :func:`setlocale` is not thread-safe on most systems. Applications typically start with a call of ::
uk: :func:`setlocale` не є потокобезпечним у більшості систем. Програми зазвичай починаються з виклику ::

source: This sets the locale for all categories to the user's default setting (typically specified in the :envvar:`LANG` environment variable). If the locale is not changed thereafter, using multithreading should not cause problems.
uk: Це встановлює локаль для всіх категорій на налаштування користувача за замовчуванням (зазвичай вказується у змінній середовища :envvar:`LANG`). Якщо після цього локаль не буде змінено, використання багатопоточності не повинно викликати проблем.

source: Returns the database of the local conventions as a dictionary. This dictionary has the following strings as keys:
uk: Повертає базу даних локальних угод як словник. Цей словник має такі рядки як ключі:

source: Category
uk: Категорія

source: Key
uk: ключ

source: Meaning
uk: Значення

source: ``'decimal_point'``
uk: ``'десяткова_крапка''``

source: Decimal point character.
uk: Символ десяткової точки.

source: ``'grouping'``
uk: ``'групування''``

source: Sequence of numbers specifying which relative positions the ``'thousands_sep'`` is expected. If the sequence is terminated with :const:`CHAR_MAX`, no further grouping is performed. If the sequence terminates with a ``0``, the last group size is repeatedly used.
uk: Послідовність чисел, що вказує, які відносні позиції очікується ``'thousands_sep``. Якщо послідовність закінчується :const:`CHAR_MAX`, подальше групування не виконується. Якщо послідовність завершується ``0``, останній розмір групи використовується повторно.

source: Character used between groups.
uk: Символ, що використовується між групами.

source: International currency symbol.
uk: Міжнародний символ валюти.

source: Local currency symbol.
uk: Символ місцевої валюти.

source: Whether the currency symbol precedes the value (for positive resp. negative values).
uk: Чи передує символ валюти значенню (для додатних чи від’ємних значень).

source: Whether the currency symbol is separated from the value by a space (for positive resp. negative values).
uk: Чи відокремлено символ грошової одиниці від значення пробілом (для додатних чи від’ємних значень).

source: Decimal point used for monetary values.
uk: Десяткова кома використовується для грошових значень.

source: Number of fractional digits used in local formatting of monetary values.
uk: Кількість дробових цифр, які використовуються в локальному форматуванні грошових значень.

source: Number of fractional digits used in international formatting of monetary values.
uk: Кількість дробових цифр, які використовуються в міжнародному форматуванні грошових значень.

source: Group separator used for monetary values.
uk: Роздільник груп, який використовується для грошових значень.

source: Equivalent to ``'grouping'``, used for monetary values.
uk: Еквівалент ``'групування''``, що використовується для грошових значень.

source: ``'positive_sign'``
uk: ``'позитивний_знак'``

source: Symbol used to annotate a positive monetary value.
uk: Символ, який використовується для позначення додатної грошової вартості.

source: ``'negative_sign'``
uk: ``'негативний_знак'``

source: Symbol used to annotate a negative monetary value.
uk: Символ, який використовується для позначення від’ємної грошової вартості.

source: The position of the sign (for positive resp. negative values), see below.
uk: Розташування знака (для додатних чи від’ємних значень) див. нижче.

source: All numeric values can be set to :const:`CHAR_MAX` to indicate that there is no value specified in this locale.
uk: Для всіх числових значень можна встановити значення :const:`CHAR_MAX`, щоб вказати, що в цій локалі не вказано значення.

source: The possible values for ``'p_sign_posn'`` and ``'n_sign_posn'`` are given below.
uk: Нижче наведено можливі значення для ``'p_sign_posn'`` і ``'n_sign_posn'``.

source: Value
uk: Значення

source: Explanation
uk: Пояснення

source: Currency and value are surrounded by parentheses.
uk: Валюта та значення взяті в дужки.

source: The sign should precede the value and currency symbol.
uk: Знак має передувати символу вартості та валюти.

source: The sign should follow the value and currency symbol.
uk: Знак повинен слідувати за символом вартості та валюти.

source: The sign should immediately precede the value.
uk: Знак повинен стояти безпосередньо перед значенням.

source: The sign should immediately follow the value.
uk: Знак повинен слідувати безпосередньо за значенням.

source: Nothing is specified in this locale.
uk: У цій локалі нічого не вказано.

source: Return some locale-specific information as a string. This function is not available on all systems, and the set of possible options might also vary across platforms. The possible argument values are numbers, for which symbolic constants are available in the locale module.
uk: Повертає деяку інформацію про локаль у вигляді рядка. Ця функція доступна не в усіх системах, і набір можливих параметрів також може відрізнятися на різних платформах. Можливими значеннями аргументів є числа, для яких у модулі локалі доступні символьні константи.

source: The :func:`nl_langinfo` function accepts one of the following keys. Most descriptions are taken from the corresponding description in the GNU C library.
uk: Функція :func:`nl_langinfo` приймає один із наведених нижче ключів. Більшість описів взято з відповідного опису в бібліотеці GNU C.

source: Get a string with the name of the character encoding used in the selected locale.
uk: Отримайте рядок із назвою кодування символів, що використовується у вибраній локалі.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent date and time in a locale-specific way.
uk: Отримайте рядок, який можна використовувати як рядок формату для :func:`time.strftime` для представлення дати й часу у спосіб, що залежить від локалі.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent a date in a locale-specific way.
uk: Отримайте рядок, який можна використовувати як рядок формату для :func:`time.strftime` для представлення дати у спосіб, що залежить від локалі.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent a time in a locale-specific way.
uk: Отримайте рядок, який можна використовувати як рядок формату для :func:`time.strftime` для представлення часу у спосіб, що залежить від локалі.

source: Get a format string for :func:`time.strftime` to represent time in the am/pm format.
uk: Отримайте рядок формату для :func:`time.strftime` для представлення часу у форматі am/pm.

source: Get the name of the n-th day of the week.
uk: Отримайте назву n-го дня тижня.

source: This follows the US convention of :const:`DAY_1` being Sunday, not the international convention (ISO 8601) that Monday is the first day of the week.
uk: Це відповідає конвенції США про те, що :const:`DAY_1` є неділею, а не міжнародній конвенції (ISO 8601), що понеділок є першим днем тижня.

source: Get the abbreviated name of the n-th day of the week.
uk: Отримайте скорочену назву n-го дня тижня.

source: Get the name of the n-th month.
uk: Отримайте назву n-го місяця.

source: Get the abbreviated name of the n-th month.
uk: Отримайте скорочену назву n-го місяця.

source: Get the radix character (decimal dot, decimal comma, etc.).
uk: Отримайте символ основи (десяткову крапку, десяткову кому тощо).

source: Get the separator character for thousands (groups of three digits).
uk: Отримайте роздільник тисяч (групи з трьох цифр).

source: Get a regular expression that can be used with the regex function to recognize a positive response to a yes/no question.
uk: Отримайте регулярний вираз, який можна використовувати з функцією регулярного виразу, щоб розпізнати позитивну відповідь на запитання "так/ні".

source: Get the currency symbol, preceded by "-" if the symbol should appear before the value, "+" if the symbol should appear after the value, or "." if the symbol should replace the radix character.
uk: Отримайте символ грошової одиниці, якому передує "-", якщо символ має стояти перед значенням, "+", якщо символ має стояти після значення, або "." якщо символ повинен замінити символ основи.

source: Most locales do not define this value. An example of a locale which does define this value is the Japanese one. In Japan, the traditional representation of dates includes the name of the era corresponding to the then-emperor's reign.
uk: Більшість локалей не визначають це значення. Прикладом локалі, яка визначає це значення, є японська. У Японії традиційне представлення дат включає назву епохи, яка відповідає правлінню тодішнього імператора.

source: Get a format string for :func:`time.strftime` to represent date and time in a locale-specific era-based way.
uk: Отримайте рядок формату для :func:`time.strftime`, щоб представити дату й час у спосіб, що залежить від місцевості й епохи.

source: Get a format string for :func:`time.strftime` to represent a date in a locale-specific era-based way.
uk: Отримайте рядок формату для :func:`time.strftime`, щоб представити дату залежно від локалі на основі епохи.

source: Get a format string for :func:`time.strftime` to represent a time in a locale-specific era-based way.
uk: Отримайте рядок формату для :func:`time.strftime`, щоб представити час залежно від локалі на основі епохи.

source: Tries to determine the default locale settings and returns them as a tuple of the form ``(language code, encoding)``.
uk: Намагається визначити параметри мови за замовчуванням і повертає їх як кортеж у формі ``(код мови, кодування)``.

source: According to POSIX, a program which has not called ``setlocale(LC_ALL, '')`` runs using the portable ``'C'`` locale. Calling ``setlocale(LC_ALL, '')`` lets it use the default locale as defined by the :envvar:`LANG` variable. Since we do not want to interfere with the current locale setting we thus emulate the behavior in the way described above.
uk: Відповідно до POSIX, програма, яка не викликала ``setlocale(LC_ALL, '')``, працює з використанням портативної локалі ``'C''``. Виклик ``setlocale(LC_ALL, '')`` дозволяє використовувати локаль за замовчуванням, як визначено змінною :envvar:`LANG`. Оскільки ми не хочемо втручатися в поточні налаштування локалі, ми таким чином емулюємо поведінку, як описано вище.

source: To maintain compatibility with other platforms, not only the :envvar:`LANG` variable is tested, but a list of variables given as envvars parameter. The first found to be defined will be used. *envvars* defaults to the search path used in GNU gettext; it must always contain the variable name ``'LANG'``. The GNU gettext search path contains ``'LC_ALL'``, ``'LC_CTYPE'``, ``'LANG'`` and ``'LANGUAGE'``, in that order.
uk: Щоб підтримувати сумісність з іншими платформами, перевіряється не лише змінна :envvar:`LANG`, але й список змінних, наданий як параметр envvars. Використовуватиметься перший знайдений. *envvars* за умовчанням використовує шлях пошуку, який використовується в GNU gettext; він завжди повинен містити назву змінної ``'LANG'``. Шлях пошуку GNU gettext містить ``'LC_ALL'``, ``'LC_CTYPE'``, ``'LANG'`` і ``'LANGUAGE'``, у такому порядку.

source: Except for the code ``'C'``, the language code corresponds to :rfc:`1766`. *language code* and *encoding* may be ``None`` if their values cannot be determined.
uk: За винятком коду ``'C``, код мови відповідає :rfc:`1766`. *код мови* і *кодування* можуть мати значення ``None``, якщо їх значення неможливо визначити.

source: Return the :term:`locale encoding` used for text data, according to user preferences. User preferences are expressed differently on different systems, and might not be available programmatically on some systems, so this function only returns a guess.
uk: Повертає :term:`locale encoding`, що використовується для текстових даних, відповідно до вподобань користувача. Налаштування користувача виражаються по-різному в різних системах і можуть бути недоступні програмно в деяких системах, тому ця функція повертає лише припущення.

source: On some systems, it is necessary to invoke :func:`setlocale` to obtain the user preferences, so this function is not thread-safe. If invoking setlocale is not necessary or desired, *do_setlocale* should be set to ``False``.
uk: У деяких системах необхідно викликати :func:`setlocale`, щоб отримати параметри користувача, тому ця функція небезпечна для потоків. Якщо виклик setlocale не є необхідним або бажаним, *do_setlocale* має бути встановлено на ``False``.

source: The :ref:`Python preinitialization <c-preinit>` configures the LC_CTYPE locale. See also the :term:`filesystem encoding and error handler`.
uk: :ref:`Попередня ініціалізація Python <c-preinit>` налаштовує локаль LC_CTYPE. Дивіться також :term:`filesystem encoding and error handler`.

source: Returns a normalized locale code for the given locale name. The returned locale code is formatted for use with :func:`setlocale`. If normalization fails, the original name is returned unchanged.
uk: Повертає нормалізований код мови для заданої назви мови. Повернений код мови відформатовано для використання з :func:`setlocale`. Якщо нормалізація не вдається, вихідне ім'я повертається без змін.

source: If the given encoding is not known, the function defaults to the default encoding for the locale code just like :func:`setlocale`.
uk: Якщо задане кодування невідоме, функція за замовчуванням використовує кодування за замовчуванням для коду мови, як :func:`setlocale`.

source: Compares two strings according to the current :const:`LC_COLLATE` setting. As any other compare function, returns a negative, or a positive value, or ``0``, depending on whether *string1* collates before or after *string2* or is equal to it.
uk: Порівнює два рядки відповідно до поточного параметра :const:`LC_COLLATE`. Як і будь-яка інша функція порівняння, повертає від’ємне або додатне значення, або ``0``, залежно від того, чи *рядок1* порівнює до чи після *рядок2* або дорівнює йому.

source: Transforms a string to one that can be used in locale-aware comparisons. For example, ``strxfrm(s1) < strxfrm(s2)`` is equivalent to ``strcoll(s1, s2) < 0``. This function can be used when the same string is compared repeatedly, e.g. when collating a sequence of strings.
uk: Перетворює рядок на такий, який можна використовувати для порівняння з урахуванням локалі. Наприклад, ``strxfrm(s1) < strxfrm(s2)`` еквівалентно ``strcoll(s1, s2) < 0``. Цю функцію можна використовувати, коли той самий рядок порівнюється багаторазово, наприклад. під час зіставлення послідовності рядків.

source: If *monetary* is true, the conversion uses monetary thousands separator and grouping strings.
uk: Якщо *monetary* має значення true, для перетворення використовуються грошові розділювачі тисяч і рядки групування.

source: Processes formatting specifiers as in ``format % val``, but takes the current locale settings into account.
uk: Обробляє специфікатори форматування як у ``format % val``, але враховує поточні налаштування мови.

source: The *monetary* keyword parameter was added.
uk: Додано параметр ключового слова *monetary*.

source: Formats a number *val* according to the current :const:`LC_MONETARY` settings.
uk: Форматує число *val* відповідно до поточних налаштувань :const:`LC_MONETARY`.

source: Converts a string into a normalized number string, following the :const:`LC_NUMERIC` settings.
uk: Перетворює рядок у нормалізований числовий рядок відповідно до параметрів :const:`LC_NUMERIC`.

source: Converts a normalized number string into a formatted string following the :const:`LC_NUMERIC` settings.
uk: Перетворює нормалізований числовий рядок у відформатований рядок відповідно до параметрів :const:`LC_NUMERIC`.

source: Converts a string to a number, following the :const:`LC_NUMERIC` settings, by calling *func* on the result of calling :func:`delocalize` on *string*.
uk: Перетворює рядок на число відповідно до налаштувань :const:`LC_NUMERIC`, викликаючи *func* в результаті виклику :func:`delocalize` для *string*.

source: Converts a string to an integer, following the :const:`LC_NUMERIC` conventions.
uk: Перетворює рядок на ціле число, дотримуючись угод :const:`LC_NUMERIC`.

source: Locale category for sorting strings. The functions :func:`strcoll` and :func:`strxfrm` of the :mod:`locale` module are affected.
uk: Локальна категорія для сортування рядків. Це впливає на функції :func:`strcoll` і :func:`strxfrm` модуля :mod:`locale`.

source: Locale category for the formatting of time. The function :func:`time.strftime` follows these conventions.
uk: Локальна категорія для форматування часу. Функція :func:`time.strftime` відповідає цим умовам.

source: Locale category for formatting of monetary values. The available options are available from the :func:`localeconv` function.
uk: Локальна категорія для форматування грошових значень. Доступні параметри доступні з функції :func:`localeconv`.

source: Locale category for message display. Python currently does not support application specific locale-aware messages. Messages displayed by the operating system, like those returned by :func:`os.strerror` might be affected by this category.
uk: Категорія мови для відображення повідомлень. Python наразі не підтримує повідомлень із залежністю від мови програми. Ця категорія може вплинути на повідомлення, які відображає операційна система, наприклад ті, що повертає :func:`os.strerror`.

source: Combination of all locale settings. If this flag is used when the locale is changed, setting the locale for all categories is attempted. If that fails for any category, no category is changed at all. When the locale is retrieved using this flag, a string indicating the setting for all categories is returned. This string can be later used to restore the settings.
uk: Комбінація всіх налаштувань мови. Якщо цей прапорець використовується під час зміни локалі, намагається встановити локаль для всіх категорій. Якщо це не вдається для будь-якої категорії, жодна категорія не змінюється взагалі. Коли локаль отримується за допомогою цього прапорця, повертається рядок, що вказує на налаштування для всіх категорій. Цей рядок пізніше можна використати для відновлення налаштувань.

source: This is a symbolic constant used for different values returned by :func:`localeconv`.
uk: Це символічна константа, яка використовується для різних значень, які повертає :func:`localeconv`.

source: Example::
uk: Приклад::

source: Background, details, hints, tips and caveats
uk: Передумови, деталі, підказки, поради та застереження

source: The C standard defines the locale as a program-wide property that may be relatively expensive to change. On top of that, some implementations are broken in such a way that frequent locale changes may cause core dumps. This makes the locale somewhat painful to use correctly.
uk: Стандарт C визначає локаль як загальнопрограмну властивість, зміна якої може бути відносно дорогою. Крім того, деякі реалізації порушені таким чином, що часті зміни локалі можуть спричинити дамп ядра. Це робить локаль дещо болючим для правильного використання.

source: Initially, when a program is started, the locale is the ``C`` locale, no matter what the user's preferred locale is. There is one exception: the :data:`LC_CTYPE` category is changed at startup to set the current locale encoding to the user's preferred locale encoding. The program must explicitly say that it wants the user's preferred locale settings for other categories by calling ``setlocale(LC_ALL, '')``.
uk: Спочатку, коли програма запускається, локаль ``C`` локаль, незалежно від того, яку локаль вибирає користувач. Є один виняток: категорія :data:`LC_CTYPE` змінюється під час запуску, щоб встановити поточне кодування мови на бажане кодування мови користувача. Програма має чітко вказати, що їй потрібні бажані налаштування локалі користувача для інших категорій, викликавши ``setlocale(LC_ALL, '')``.

source: It is generally a bad idea to call :func:`setlocale` in some library routine, since as a side effect it affects the entire program. Saving and restoring it is almost as bad: it is expensive and affects other threads that happen to run before the settings have been restored.
uk: Викликати :func:`setlocale` у певній бібліотечній процедурі, як правило, погана ідея, оскільки як побічний ефект це впливає на всю програму. Зберігати та відновлювати його майже так само погано: це дорого та впливає на інші потоки, які запускаються до відновлення налаштувань.

source: If, when coding a module for general use, you need a locale independent version of an operation that is affected by the locale (such as certain formats used with :func:`time.strftime`), you will have to find a way to do it without using the standard library routine. Even better is convincing yourself that using locale settings is okay. Only as a last resort should you document that your module is not compatible with non-\ ``C`` locale settings.
uk: Якщо під час кодування модуля для загального використання вам потрібна незалежна від локалі версія операції, на яку впливає локаль (наприклад, певні формати, що використовуються з :func:`time.strftime`), вам доведеться знайти спосіб зробити це без використання стандартної бібліотечної процедури. Ще краще — переконати себе, що використання налаштувань мови — це нормально. Лише в крайньому випадку ви повинні задокументувати, що ваш модуль несумісний з налаштуваннями локалі, відмінними від \ ``C``.
