Repository: python/python-docs-uk
Catalog: library/logging.po
Languages: uk

source: An exception tuple, or ``None``.
uk: Кортеж винятків або ``None``.

source: func
uk: функц

source: The name of the function or method which invoked the logging call.
uk: Ім'я функції або методу, які викликали журналювання.

source: A stack traceback such as is provided by :func:`traceback.print_stack`, showing the call hierarchy.
uk: Зворотне трасування стека, наприклад, надається :func:`traceback.print_stack`, показуючи ієрархію викликів.

source: Additional keyword arguments.
uk: Додаткові аргументи ключових слів.

source: Module-Level Attributes
uk: Атрибути рівня модуля

source: A "handler of last resort" is available through this attribute. This is a :class:`StreamHandler` writing to ``sys.stderr`` with a level of ``WARNING``, and is used to handle logging events in the absence of any logging configuration. The end result is to just print the message to ``sys.stderr``. This replaces the earlier error message saying that "no handlers could be found for logger XYZ". If you need the earlier behaviour for some reason, ``lastResort`` can be set to ``None``.
uk: Через цей атрибут доступний "обробник останньої надії". Це :class:`StreamHandler`, який записує в ``sys.stderr`` з рівнем ``WARNING`` і використовується для обробки подій журналювання за відсутності будь-якої конфігурації журналювання. Кінцевим результатом є просто друк повідомлення в ``sys.stderr``. Це замінює попереднє повідомлення про помилку про те, що "не вдалося знайти обробників для реєстратора XYZ". Якщо з якоїсь причини вам потрібна попередня поведінка, для lastResort можна встановити значення None.

source: Integration with the warnings module
uk: Інтеграція з модулем попереджень

source: The :func:`captureWarnings` function can be used to integrate :mod:`logging` with the :mod:`warnings` module.
uk: Функцію :func:`captureWarnings` можна використовувати для інтеграції :mod:`logging` з модулем :mod:`warnings`.

source: This function is used to turn the capture of warnings by logging on and off.
uk: Ця функція використовується для ввімкнення та вимкнення захоплення попереджень під час входу.

source: If *capture* is ``True``, warnings issued by the :mod:`warnings` module will be redirected to the logging system. Specifically, a warning will be formatted using :func:`warnings.formatwarning` and the resulting string logged to a logger named ``'py.warnings'`` with a severity of :const:`WARNING`.
uk: Якщо *capture* має значення ``True``, попередження, видані модулем :mod:`warnings`, будуть перенаправлені до системи журналювання. Зокрема, попередження буде відформатовано за допомогою :func:`warnings.formatwarning`, а результуючий рядок буде зареєстровано в журналі під назвою ``'py.warnings`` з серйозністю :const:`WARNING`.

source: If *capture* is ``False``, the redirection of warnings to the logging system will stop, and warnings will be redirected to their original destinations (i.e. those in effect before ``captureWarnings(True)`` was called).
uk: Якщо *capture* має значення ``False``, перенаправлення попереджень до системи журналювання припиниться, і попередження будуть перенаправлені до початкових місць призначення (тобто тих, які діяли до виклику ``captureWarnings(True)``).

source: Module :mod:`logging.config`
uk: Модуль :mod:`logging.config`

source: Configuration API for the logging module.
uk: API конфігурації для модуля журналювання.

source: Module :mod:`logging.handlers`
uk: Модуль :mod:`logging.handlers`

source: Useful handlers included with the logging module.
uk: Корисні обробники, включені в модуль журналювання.

source: :pep:`282` - A Logging System
uk: :pep:`282` - Система реєстрації

source: The proposal which described this feature for inclusion in the Python standard library.
uk: Пропозиція, яка описує цю функцію для включення в стандартну бібліотеку Python.

source: `Original Python logging package <https://old.red-dove.com/python_logging.html>`_
uk: `Оригінальний пакет журналювання Python <https://old.red-dove.com/python_logging.html>`_

source: This is the original source for the :mod:`logging` package. The version of the package available from this site is suitable for use with Python 1.5.2, 2.1.x and 2.2.x, which do not include the :mod:`logging` package in the standard library.
uk: Це оригінальне джерело пакета :mod:`logging`. Версія пакета, доступна на цьому сайті, підходить для використання з Python 1.5.2, 2.1.x і 2.2.x, які не містять пакет :mod:`logging` у стандартній бібліотеці.
