Repository: python/python-docs-uk
Catalog: library/logging.po
Languages: uk

source: Formats the specified stack information (a string as returned by :func:`traceback.print_stack`, but with the last newline removed) as a string. This default implementation just returns the input value.
uk: Форматує вказану інформацію про стек (рядок, який повертає :func:`traceback.print_stack`, але з видаленням останнього нового рядка) як рядок. Ця реалізація за умовчанням лише повертає вхідне значення.

source: Filter Objects
uk: Фільтр об'єктів

source: ``Filters`` can be used by ``Handlers`` and ``Loggers`` for more sophisticated filtering than is provided by levels. The base filter class only allows events which are below a certain point in the logger hierarchy. For example, a filter initialized with 'A.B' will allow events logged by loggers 'A.B', 'A.B.C', 'A.B.C.D', 'A.B.D' etc. but not 'A.BB', 'B.A.B' etc. If initialized with the empty string, all events are passed.
uk: ``Фільтри`` можуть використовуватися ``Обробниками`` і ``Реєстраторами`` для більш складної фільтрації, ніж передбачено рівнями. Базовий клас фільтра дозволяє лише події, які знаходяться нижче певної точки в ієрархії реєстратора. Наприклад, фільтр, ініціалізований "A.B", дозволить події, зареєстровані реєстраторами "A.B", "A.B.C", "A.B.C.D", "A.B.D" тощо, але не "A.BB", "B.A.B" тощо. Якщо ініціалізовано порожнім рядком, усі події передаються.

source: Returns an instance of the :class:`Filter` class. If *name* is specified, it names a logger which, together with its children, will have its events allowed through the filter. If *name* is the empty string, allows every event.
uk: Повертає екземпляр класу :class:`Filter`. Якщо вказано *ім’я*, воно називає реєстратор, події якого разом із дочірніми елементами будуть дозволені через фільтр. Якщо *ім’я* є порожнім рядком, дозволяється кожна подія.

source: Is the specified record to be logged? Returns zero for no, nonzero for yes. If deemed appropriate, the record may be modified in-place by this method.
uk: Чи потрібно реєструвати вказаний запис? Повертає нуль для ні, відмінне від нуля для так. Якщо це буде визнано доцільним, запис може бути змінено на місці за допомогою цього методу.

source: Note that filters attached to handlers are consulted before an event is emitted by the handler, whereas filters attached to loggers are consulted whenever an event is logged (using :meth:`debug`, :meth:`info`, etc.), before sending an event to handlers. This means that events which have been generated by descendant loggers will not be filtered by a logger's filter setting, unless the filter has also been applied to those descendant loggers.
uk: Зауважте, що фільтри, приєднані до обробників, звертаються до того, як обробник випустить подію, тоді як фільтри, приєднані до реєстраторів, звертаються до кожного, коли подія реєструється (за допомогою :meth:`debug`, :meth:`info` тощо), до відправка події обробникам. Це означає, що події, які були згенеровані нащадками реєстраторів, не будуть відфільтровані налаштуваннями фільтра реєстратора, якщо фільтр також не застосовано до цих нащадків реєстраторів.

source: You don't actually need to subclass ``Filter``: you can pass any instance which has a ``filter`` method with the same semantics.
uk: Насправді вам не потрібно створювати підклас ``Filter``: ви можете передати будь-який екземпляр, який має метод ``filter`` з тією самою семантикою.

source: You don't need to create specialized ``Filter`` classes, or use other classes with a ``filter`` method: you can use a function (or other callable) as a filter. The filtering logic will check to see if the filter object has a ``filter`` attribute: if it does, it's assumed to be a ``Filter`` and its :meth:`~Filter.filter` method is called. Otherwise, it's assumed to be a callable and called with the record as the single parameter. The returned value should conform to that returned by :meth:`~Filter.filter`.
uk: Вам не потрібно створювати спеціалізовані класи ``Filter`` або використовувати інші класи з методом ``filter``: ви можете використовувати функцію (або інший виклик) як фільтр. Логіка фільтрації перевірить, чи має об’єкт фільтра атрибут ``filter``: якщо він має, він вважається ``Filter`` і викликається його метод :meth:`~Filter.filter`. В іншому випадку вважається, що він викликається та викликається із записом як єдиним параметром. Повернене значення має відповідати тому, яке повертає :meth:`~Filter.filter`.

source: Although filters are used primarily to filter records based on more sophisticated criteria than levels, they get to see every record which is processed by the handler or logger they're attached to: this can be useful if you want to do things like counting how many records were processed by a particular logger or handler, or adding, changing or removing attributes in the :class:`LogRecord` being processed. Obviously changing the LogRecord needs to be done with some care, but it does allow the injection of contextual information into logs (see :ref:`filters-contextual`).
uk: Хоча фільтри використовуються в основному для фільтрації записів на основі більш складних критеріїв, ніж рівні, вони бачать кожен запис, який обробляється обробником або реєстратором, до якого вони підключені: це може бути корисним, якщо ви хочете зробити щось, наприклад, підрахувати, скільки записи були оброблені певним реєстратором чи обробником, або додаванням, зміною чи видаленням атрибутів у :class:`LogRecord`, що обробляється. Очевидно, змінювати LogRecord потрібно з певною обережністю, але це дозволяє вставляти контекстну інформацію в журнали (див. :ref:`filters-contextual`).

source: LogRecord Objects
uk: Об'єкти LogRecord

source: :class:`LogRecord` instances are created automatically by the :class:`Logger` every time something is logged, and can be created manually via :func:`makeLogRecord` (for example, from a pickled event received over the wire).
uk: Екземпляри :class:`LogRecord` створюються автоматично :class:`Logger` щоразу, коли щось реєструється, і можуть бути створені вручну за допомогою :func:`makeLogRecord` (наприклад, з марінованої події, отриманої по мережі).

source: Contains all the information pertinent to the event being logged.
uk: Містить всю інформацію, що стосується події, яка реєструється.

source: The primary information is passed in :attr:`msg` and :attr:`args`, which are combined using ``msg % args`` to create the :attr:`message` field of the record.
uk: Основна інформація передається в :attr:`msg` і :attr:`args`, які поєднуються за допомогою ``msg % args`` для створення поля :attr:`message` запису.

source: Parameters
uk: Параметри

source: The name of the logger used to log the event represented by this LogRecord. Note that this name will always have this value, even though it may be emitted by a handler attached to a different (ancestor) logger.
uk: Ім'я реєстратора, який використовується для реєстрації події, представленої цим LogRecord. Зауважте, що це ім’я завжди матиме це значення, навіть якщо воно може видаватись обробником, приєднаним до іншого (попереднього) реєстратора.

source: The numeric level of the logging event (one of DEBUG, INFO etc.) Note that this is converted to *two* attributes of the LogRecord: ``levelno`` for the numeric value and ``levelname`` for the corresponding level name.
uk: Числовий рівень події журналювання (один із DEBUG, INFO тощо) Зауважте, що він перетворюється на *два* атрибути LogRecord: ``levelno`` для числового значення та ``levelname`` для відповідної назви рівня. .

source: The full pathname of the source file where the logging call was made.
uk: Повний шлях до вихідного файлу, у якому було здійснено виклик журналювання.

source: The line number in the source file where the logging call was made.
uk: Номер рядка у вихідному файлі, де було здійснено виклик журналювання.

source: The event description message, possibly a format string with placeholders for variable data.
uk: Повідомлення з описом події, можливо, рядок формату з заповнювачами для змінних даних.

source: Variable data to merge into the *msg* argument to obtain the event description.
uk: Змінні дані, які потрібно об’єднати в аргумент *msg*, щоб отримати опис події.

source: An exception tuple with the current exception information, or ``None`` if no exception information is available.
uk: Кортеж винятків із поточною інформацією про винятки або ``None``, якщо інформація про винятки недоступна.

source: The name of the function or method from which the logging call was invoked.
uk: Ім'я функції або методу, з якого було викликано журналювання.

source: A text string representing stack information from the base of the stack in the current thread, up to the logging call.
uk: Текстовий рядок, що представляє інформацію про стек від основи стека в поточному потоці до виклику журналювання.

source: Returns the message for this :class:`LogRecord` instance after merging any user-supplied arguments with the message. If the user-supplied message argument to the logging call is not a string, :func:`str` is called on it to convert it to a string. This allows use of user-defined classes as messages, whose ``__str__`` method can return the actual format string to be used.
uk: Повертає повідомлення для цього екземпляра :class:`LogRecord` після об’єднання будь-яких наданих користувачем аргументів із повідомленням. Якщо наданий користувачем аргумент повідомлення для виклику журналювання не є рядком, :func:`str` викликається для нього, щоб перетворити його на рядок. Це дозволяє використовувати визначені користувачем класи як повідомлення, чий метод ``__str__`` може повертати фактичний рядок формату для використання.

source: The creation of a :class:`LogRecord` has been made more configurable by providing a factory which is used to create the record. The factory can be set using :func:`getLogRecordFactory` and :func:`setLogRecordFactory` (see this for the factory's signature).
uk: Створення :class:`LogRecord` було зроблено більш настроюваним шляхом надання фабрики, яка використовується для створення запису. Фабрику можна встановити за допомогою :func:`getLogRecordFactory` і :func:`setLogRecordFactory` (див. тут підпис фабрики).

source: This functionality can be used to inject your own values into a :class:`LogRecord` at creation time. You can use the following pattern::
uk: Цю функцію можна використовувати для введення ваших власних значень у :class:`LogRecord` під час створення. Ви можете використовувати наступний шаблон:

source: With this pattern, multiple factories could be chained, and as long as they don't overwrite each other's attributes or unintentionally overwrite the standard attributes listed above, there should be no surprises.
uk: За допомогою цього шаблону кілька фабрик можуть бути з’єднані в ланцюг, і якщо вони не перезаписують атрибути одна одної або ненавмисно перезаписують стандартні атрибути, перелічені вище, не повинно бути сюрпризів.

source: LogRecord attributes
uk: Атрибути LogRecord

source: The LogRecord has a number of attributes, most of which are derived from the parameters to the constructor. (Note that the names do not always correspond exactly between the LogRecord constructor parameters and the LogRecord attributes.) These attributes can be used to merge data from the record into the format string. The following table lists (in alphabetical order) the attribute names, their meanings and the corresponding placeholder in a %-style format string.
uk: LogRecord має низку атрибутів, більшість із яких є похідними від параметрів конструктора. (Зауважте, що імена параметрів конструктора LogRecord і атрибутів LogRecord не завжди точно збігаються.) Ці атрибути можна використовувати для об’єднання даних із запису в рядок формату. У наведеній нижче таблиці наведено (в алфавітному порядку) назви атрибутів, їх значення та відповідний заповнювач у рядку формату %-style.

source: If you are using {}-formatting (:func:`str.format`), you can use ``{attrname}`` as the placeholder in the format string. If you are using $-formatting (:class:`string.Template`), use the form ``${attrname}``. In both cases, of course, replace ``attrname`` with the actual attribute name you want to use.
uk: Якщо ви використовуєте {}-formatting (:func:`str.format`), ви можете використовувати ``{attrname}`` як заповнювач у рядку формату. Якщо ви використовуєте $-форматування (:class:`string.Template`), використовуйте форму ``${attrname}``. В обох випадках, звичайно, замініть ``attrname`` фактичним ім'ям атрибута, який ви хочете використовувати.

source: In the case of {}-formatting, you can specify formatting flags by placing them after the attribute name, separated from it with a colon. For example: a placeholder of ``{msecs:03d}`` would format a millisecond value of ``4`` as ``004``. Refer to the :meth:`str.format` documentation for full details on the options available to you.
uk: У випадку {}-форматування ви можете вказати прапорці форматування, розмістивши їх після назви атрибута, відокремивши від нього двокрапку. Наприклад: заповнювач ``{msecs:03d}`` відформатує мілісекундне значення ``4`` як ``004``. Зверніться до документації :meth:`str.format`, щоб отримати детальну інформацію про доступні вам параметри.

source: Attribute name
uk: Назва атрибута

source: Format
uk: Формат

source: Description
uk: опис

source: args
uk: арг

source: You shouldn't need to format this yourself.
uk: Вам не потрібно форматувати це самостійно.

source: The tuple of arguments merged into ``msg`` to produce ``message``, or a dict whose values are used for the merge (when there is only one argument, and it is a dictionary).
uk: Кортеж аргументів об’єднано в ``msg`` для створення ``message`` або dict, значення якого використовуються для злиття (якщо є лише один аргумент, і це словник).

source: Human-readable time when the :class:`LogRecord` was created. By default this is of the form '2003-07-08 16:49:45,896' (the numbers after the comma are millisecond portion of the time).
uk: Зрозумілий для людини час створення :class:`LogRecord`. За замовчуванням це має форму "2003-07-08 16:49:45,896" (числа після коми є частиною часу в мілісекундах).

source: created
uk: створений

source: Time when the :class:`LogRecord` was created (as returned by :func:`time.time`).
uk: Час створення :class:`LogRecord` (як повернуто :func:`time.time`).

source: Exception tuple (à la ``sys.exc_info``) or, if no exception has occurred, ``None``.
uk: Кортеж винятків (à la ``sys.exc_info``) або, якщо винятків не сталося, ``None``.

source: filename
uk: ім'я файлу

source: Filename portion of ``pathname``.
uk: Частина імені файлу ``шляху``.

source: funcName
uk: ім'я функції

source: Name of function containing the logging call.
uk: Назва функції, яка містить виклик журналювання.

source: levelname
uk: ім'я рівня

source: Text logging level for the message (``'DEBUG'``, ``'INFO'``, ``'WARNING'``, ``'ERROR'``, ``'CRITICAL'``).
uk: Рівень реєстрації тексту для повідомлення (``'DEBUG'``, ``'INFO'``, ``'WARNING'``, ``'ERROR'``, ``'CRITICAL'``).

source: Numeric logging level for the message (:const:`DEBUG`, :const:`INFO`, :const:`WARNING`, :const:`ERROR`, :const:`CRITICAL`).
uk: Числовий рівень журналювання для повідомлення (:const:`DEBUG`, :const:`INFO`, :const:`WARNING`, :const:`ERROR`, :const:`CRITICAL`).

source: Source line number where the logging call was issued (if available).
uk: Номер вихідного рядка, де було здійснено виклик реєстрації (за наявності).

source: message
uk: повідомлення

source: The logged message, computed as ``msg % args``. This is set when :meth:`Formatter.format` is invoked.
uk: Зареєстроване повідомлення, обчислене як ``msg % args``. Це встановлюється під час виклику :meth:`Formatter.format`.

source: module
uk: модуль

source: Module (name portion of ``filename``).
uk: Модуль (частина назви ``назви файлу``).

source: msecs
uk: мс

source: Millisecond portion of the time when the :class:`LogRecord` was created.
uk: Частина мілісекунд часу, коли було створено :class:`LogRecord`.

source: msg
uk: повідомлення

source: The format string passed in the original logging call. Merged with ``args`` to produce ``message``, or an arbitrary object (see :ref:`arbitrary-object-messages`).
uk: Рядок формату, переданий у вихідному виклику журналювання. Об’єднано з ``args`` для отримання ``message`` або довільного об’єкта (див. :ref:`arbitrary-object-messages`).

source: name
uk: назва

source: Name of the logger used to log the call.
uk: Ім'я реєстратора, який використовувався для реєстрації виклику.

source: pathname
uk: шлях

source: Full pathname of the source file where the logging call was issued (if available).
uk: Повний шлях до вихідного файлу, до якого було здійснено виклик журналювання (за наявності).

source: process
uk: процес

source: Process ID (if available).
uk: ID процесу (за наявності).

source: processName
uk: назва процесу

source: Process name (if available).
uk: Назва процесу (якщо є).

source: Time in milliseconds when the LogRecord was created, relative to the time the logging module was loaded.
uk: Час у мілісекундах, коли було створено LogRecord, відносно часу завантаження модуля журналювання.

source: Stack frame information (where available) from the bottom of the stack in the current thread, up to and including the stack frame of the logging call which resulted in the creation of this record.
uk: Інформація про стек (якщо доступно) від нижньої частини стека в поточному потоці до та включно з кадром стека виклику журналювання, який призвів до створення цього запису.

source: thread
uk: нитка

source: Thread ID (if available).
uk: ID потоку (якщо є).

source: threadName
uk: ім'я потоку

source: Thread name (if available).
uk: Назва теми (за наявності).

source: *processName* was added.
uk: Додано *processName*.

source: LoggerAdapter Objects
uk: Об’єкти LoggerAdapter

source: :class:`LoggerAdapter` instances are used to conveniently pass contextual information into logging calls. For a usage example, see the section on :ref:`adding contextual information to your logging output <context-info>`.
uk: Екземпляри :class:`LoggerAdapter` використовуються для зручної передачі контекстної інформації у виклики журналювання. Для прикладу використання дивіться розділ про :ref:`додавання контекстної інформації до вихідних даних журналу <context-info>`.

source: Returns an instance of :class:`LoggerAdapter` initialized with an underlying :class:`Logger` instance and a dict-like object.
uk: Повертає екземпляр :class:`LoggerAdapter`, ініціалізований базовим екземпляром :class:`Logger` і dict-подібним об’єктом.

source: Modifies the message and/or keyword arguments passed to a logging call in order to insert contextual information. This implementation takes the object passed as *extra* to the constructor and adds it to *kwargs* using key 'extra'. The return value is a (*msg*, *kwargs*) tuple which has the (possibly modified) versions of the arguments passed in.
uk: Змінює повідомлення та/або ключові аргументи, передані виклику журналювання, щоб вставити контекстну інформацію. Ця реалізація приймає об’єкт, переданий як *extra* до конструктора, і додає його до *kwargs* за допомогою ключа "extra". Поверненим значенням є кортеж (*msg*, *kwargs*), який містить (можливо, змінені) версії переданих аргументів.

source: In addition to the above, :class:`LoggerAdapter` supports the following methods of :class:`Logger`: :meth:`~Logger.debug`, :meth:`~Logger.info`, :meth:`~Logger.warning`, :meth:`~Logger.error`, :meth:`~Logger.exception`, :meth:`~Logger.critical`, :meth:`~Logger.log`, :meth:`~Logger.isEnabledFor`, :meth:`~Logger.getEffectiveLevel`, :meth:`~Logger.setLevel` and :meth:`~Logger.hasHandlers`. These methods have the same signatures as their counterparts in :class:`Logger`, so you can use the two types of instances interchangeably.
uk: На додаток до вищезазначеного, :class:`LoggerAdapter` підтримує такі методи :class:`Logger`: :meth:`~Logger.debug`, :meth:`~Logger.info`, :meth:`~Logger .warning`, :meth:`~Logger.error`, :meth:`~Logger.exception`, :meth:`~Logger.critical`, :meth:`~Logger.log`, :meth:`~Logger .isEnabledFor`, :meth:`~Logger.getEffectiveLevel`, :meth:`~Logger.setLevel` і :meth:`~Logger.hasHandlers`. Ці методи мають ті самі сигнатури, що й їхні аналоги в :class:`Logger`, тому ви можете використовувати обидва типи екземплярів як взаємозамінні.

source: The :meth:`~Logger.isEnabledFor`, :meth:`~Logger.getEffectiveLevel`, :meth:`~Logger.setLevel` and :meth:`~Logger.hasHandlers` methods were added to :class:`LoggerAdapter`. These methods delegate to the underlying logger.
uk: Методи :meth:`~Logger.isEnabledFor`, :meth:`~Logger.getEffectiveLevel`, :meth:`~Logger.setLevel` і :meth:`~Logger.hasHandlers` додано до :class:`LoggerAdapter` . Ці методи делегують базовому реєстратору.

source: Attribute :attr:`manager` and method :meth:`_log` were added, which delegate to the underlying logger and allow adapters to be nested.
uk: Було додано атрибут :attr:`manager` і метод :meth:`_log`, які делегують базовому реєстратору та дозволяють адаптерам бути вкладеними.

source: Thread Safety
uk: Безпека ниток

source: The logging module is intended to be thread-safe without any special work needing to be done by its clients. It achieves this though using threading locks; there is one lock to serialize access to the module's shared data, and each handler also creates a lock to serialize access to its underlying I/O.
uk: Модуль журналювання призначений для потокобезпечної роботи без необхідності виконання будь-якої спеціальної роботи клієнтами. Це досягається за допомогою різьбових замків; існує одне блокування для серіалізації доступу до спільних даних модуля, і кожен обробник також створює блокування для серіалізації доступу до базового введення-виведення.

source: If you are implementing asynchronous signal handlers using the :mod:`signal` module, you may not be able to use logging from within such handlers. This is because lock implementations in the :mod:`threading` module are not always re-entrant, and so cannot be invoked from such signal handlers.
uk: Якщо ви впроваджуєте асинхронні обробники сигналів за допомогою модуля :mod:`signal`, можливо, ви не зможете використовувати журналювання в таких обробниках. Це пов’язано з тим, що реалізації блокувань у модулі :mod:`threading` не завжди можна повторно входити, і тому їх не можна викликати з таких обробників сигналів.

source: Module-Level Functions
uk: Функції рівня модуля

source: In addition to the classes described above, there are a number of module-level functions.
uk: На додаток до класів, описаних вище, існує ряд функцій рівня модуля.

source: Return a logger with the specified name or, if name is ``None``, return a logger which is the root logger of the hierarchy. If specified, the name is typically a dot-separated hierarchical name like *'a'*, *'a.b'* or *'a.b.c.d'*. Choice of these names is entirely up to the developer who is using logging.
uk: Повертає реєстратор із вказаною назвою або, якщо ім’я ``None``, повертає реєстратор, який є кореневим реєстратором ієрархії. Якщо вказано, це зазвичай ієрархічне ім’я, розділене крапками, наприклад *'a'*, *'a.b'* або *'a.b.c.d'*. Вибір цих імен повністю залежить від розробника, який використовує журналювання.

source: All calls to this function with a given name return the same logger instance. This means that logger instances never need to be passed between different parts of an application.
uk: Усі виклики цієї функції з заданим іменем повертають той самий екземпляр журналу. Це означає, що екземпляри реєстратора ніколи не потрібно передавати між різними частинами програми.
