Repository: python/python-docs-uk
Catalog: library/logging.po
Languages: uk

source: Logs a message with level :const:`ERROR` on this logger. The arguments are interpreted as for :meth:`debug`. Exception info is added to the logging message. This method should only be called from an exception handler.
uk: Реєструє повідомлення з рівнем :const:`ERROR` у цьому реєстраторі. Аргументи інтерпретуються як для :meth:`debug`. Інформація про винятки додається до повідомлення журналу. Цей метод слід викликати лише з обробника винятків.

source: Adds the specified filter *filter* to this logger.
uk: Додає вказаний фільтр *filter* до цього реєстратора.

source: Removes the specified filter *filter* from this logger.
uk: Видаляє вказаний фільтр *filter* з цього реєстратора.

source: Apply this logger's filters to the record and return ``True`` if the record is to be processed. The filters are consulted in turn, until one of them returns a false value. If none of them return a false value, the record will be processed (passed to handlers). If one returns a false value, no further processing of the record occurs.
uk: Застосуйте фільтри цього реєстратора до запису та поверніть ``True``, якщо запис потрібно обробити. Фільтри перевіряються по черзі, поки один із них не поверне хибне значення. Якщо жоден із них не повертає хибне значення, запис буде оброблено (передано обробникам). Якщо повертається хибне значення, подальша обробка запису не відбувається.

source: Adds the specified handler *hdlr* to this logger.
uk: Додає вказаний обробник *hdlr* до цього реєстратора.

source: Removes the specified handler *hdlr* from this logger.
uk: Видаляє вказаний обробник *hdlr* із цього реєстратора.

source: Finds the caller's source filename and line number. Returns the filename, line number, function name and stack information as a 4-element tuple. The stack information is returned as ``None`` unless *stack_info* is ``True``.
uk: Знаходить назву вихідного файлу абонента та номер рядка. Повертає назву файлу, номер рядка, назву функції та інформацію про стек у вигляді 4-елементного кортежу. Інформація про стек повертається як ``None``, якщо *stack_info* не має значення ``True``.

source: The *stacklevel* parameter is passed from code calling the :meth:`debug` and other APIs. If greater than 1, the excess is used to skip stack frames before determining the values to be returned. This will generally be useful when calling logging APIs from helper/wrapper code, so that the information in the event log refers not to the helper/wrapper code, but to the code that calls it.
uk: Параметр *stacklevel* передається з коду, який викликає :meth:`debug` та інші API. Якщо більше 1, надлишок використовується для пропуску кадрів стека перед визначенням значень, які потрібно повернути. Як правило, це буде корисно під час виклику API реєстрації з допоміжного коду/обгортки, щоб інформація в журналі подій стосувалася не допоміжного/оболонкового коду, а коду, який його викликає.

source: Handles a record by passing it to all handlers associated with this logger and its ancestors (until a false value of *propagate* is found). This method is used for unpickled records received from a socket, as well as those created locally. Logger-level filtering is applied using :meth:`~Logger.filter`.
uk: Обробляє запис, передаючи його всім обробникам, пов’язаним із цим реєстратором та його предками (поки не буде знайдено хибне значення *propagate*). Цей метод використовується для невибраних записів, отриманих із сокета, а також тих, що створюються локально. Фільтрування на рівні реєстратора застосовується за допомогою :meth:`~Logger.filter`.

source: This is a factory method which can be overridden in subclasses to create specialized :class:`LogRecord` instances.
uk: Це фабричний метод, який можна замінити в підкласах для створення спеціалізованих екземплярів :class:`LogRecord`.

source: Checks to see if this logger has any handlers configured. This is done by looking for handlers in this logger and its parents in the logger hierarchy. Returns ``True`` if a handler was found, else ``False``. The method stops searching up the hierarchy whenever a logger with the 'propagate' attribute set to false is found - that will be the last logger which is checked for the existence of handlers.
uk: Перевіряє, чи цей реєстратор має налаштовані обробники. Це робиться шляхом пошуку обробників у цьому реєстраторі та його батьків в ієрархії реєстратора. Повертає ``True``, якщо обробник знайдено, інакше ``False``. Метод припиняє пошук в ієрархії щоразу, коли знайдено реєстратор з атрибутом 'propagate', встановленим на false - це буде останній реєстратор, який перевіряється на наявність обробників.

source: Loggers can now be pickled and unpickled.
uk: Лісоруби тепер можна маринувати та не пикувати.

source: Logging Levels
uk: Рівні реєстрації

source: The numeric values of logging levels are given in the following table. These are primarily of interest if you want to define your own levels, and need them to have specific values relative to the predefined levels. If you define a level with the same numeric value, it overwrites the predefined value; the predefined name is lost.
uk: Числові значення рівнів журналювання наведено в наступній таблиці. Це насамперед цікаво, якщо ви бажаєте визначити власні рівні та потребуєте, щоб вони мали певні значення відносно попередньо визначених рівнів. Якщо ви визначаєте рівень з тим самим числовим значенням, він перезаписує попередньо визначене значення; попередньо визначене ім'я втрачено.

source: Level
uk: Рівень

source: Numeric value
uk: Числове значення

source: ``CRITICAL``
uk: ``КРИТИЧНО``

source: ``ERROR``
uk: ``ПОМИЛКА``

source: ``WARNING``
uk: ``ПОПЕРЕДЖЕННЯ``

source: ``INFO``
uk: ``ІНФО``

source: ``DEBUG``
uk: ``НАЛАШТУВАННЯ``

source: Handler Objects
uk: Об’єкти обробки

source: Handlers have the following attributes and methods. Note that :class:`Handler` is never instantiated directly; this class acts as a base for more useful subclasses. However, the :meth:`__init__` method in subclasses needs to call :meth:`Handler.__init__`.
uk: Обробники мають такі атрибути та методи. Зауважте, що :class:`Handler` ніколи не створюється безпосередньо; цей клас діє як основа для більш корисних підкласів. Однак метод :meth:`__init__` у підкласах має викликати :meth:`Handler.__init__`.

source: Initializes the :class:`Handler` instance by setting its level, setting the list of filters to the empty list and creating a lock (using :meth:`createLock`) for serializing access to an I/O mechanism.
uk: Ініціалізує екземпляр :class:`Handler`, встановлюючи його рівень, встановлюючи список фільтрів у порожній список і створюючи блокування (за допомогою :meth:`createLock`) для серіалізації доступу до механізму введення-виведення.

source: Initializes a thread lock which can be used to serialize access to underlying I/O functionality which may not be threadsafe.
uk: Ініціалізує блокування потоку, який можна використовувати для серіалізації доступу до основної функції введення-виведення, яка може бути небезпечною для потоків.

source: Acquires the thread lock created with :meth:`createLock`.
uk: Отримує блокування потоку, створене за допомогою :meth:`createLock`.

source: Releases the thread lock acquired with :meth:`acquire`.
uk: Звільняє блокування потоку, отримане за допомогою :meth:`acquire`.

source: Sets the threshold for this handler to *level*. Logging messages which are less severe than *level* will be ignored. When a handler is created, the level is set to :const:`NOTSET` (which causes all messages to be processed).
uk: Встановлює порогове значення для цього обробника на *рівень*. Повідомлення журналу, менш суворі, ніж *рівень*, ігноруватимуться. Коли обробник створюється, рівень встановлюється на :const:`NOTSET` (що спричиняє обробку всіх повідомлень).

source: The *level* parameter now accepts a string representation of the level such as 'INFO' as an alternative to the integer constants such as :const:`INFO`.
uk: Параметр *level* тепер приймає рядкове представлення рівня, наприклад "INFO", як альтернативу цілим константам, таким як :const:`INFO`.

source: Sets the :class:`Formatter` for this handler to *fmt*.
uk: Встановлює :class:`Formatter` для цього обробника на *fmt*.

source: Adds the specified filter *filter* to this handler.
uk: Додає вказаний фільтр *filter* до цього обробника.

source: Removes the specified filter *filter* from this handler.
uk: Видаляє вказаний фільтр *filter* з цього обробника.

source: Apply this handler's filters to the record and return ``True`` if the record is to be processed. The filters are consulted in turn, until one of them returns a false value. If none of them return a false value, the record will be emitted. If one returns a false value, the handler will not emit the record.
uk: Застосуйте фільтри цього обробника до запису та поверніть ``True``, якщо запис потрібно обробити. Фільтри перевіряються по черзі, доки один із них не поверне хибне значення. Якщо жоден із них не повертає хибне значення, запис буде видано. Якщо повертається хибне значення, обробник не видасть запис.

source: Ensure all logging output has been flushed. This version does nothing and is intended to be implemented by subclasses.
uk: Переконайтеся, що всі вихідні дані журналу скинуто. Ця версія нічого не робить і призначена для реалізації підкласами.

source: Tidy up any resources used by the handler. This version does no output but removes the handler from an internal list of handlers which is closed when :func:`shutdown` is called. Subclasses should ensure that this gets called from overridden :meth:`close` methods.
uk: Приберіть усі ресурси, які використовує обробник. Ця версія не виводить, але видаляє обробник із внутрішнього списку обробників, який закривається під час виклику :func:`shutdown`. Підкласи повинні гарантувати, що це викликається з перевизначених методів :meth:`close`.

source: Conditionally emits the specified logging record, depending on filters which may have been added to the handler. Wraps the actual emission of the record with acquisition/release of the I/O thread lock.
uk: Умовно створює вказаний запис журналу залежно від фільтрів, які могли бути додані до обробника. Обгортає фактичний випуск запису з отриманням/вивільненням блокування потоку вводу-виводу.

source: This method should be called from handlers when an exception is encountered during an :meth:`emit` call. If the module-level attribute ``raiseExceptions`` is ``False``, exceptions get silently ignored. This is what is mostly wanted for a logging system - most users will not care about errors in the logging system, they are more interested in application errors. You could, however, replace this with a custom handler if you wish. The specified record is the one which was being processed when the exception occurred. (The default value of ``raiseExceptions`` is ``True``, as that is more useful during development).
uk: Цей метод слід викликати з обробників, коли під час виклику :meth:`emit` виникає виняткова ситуація. Якщо атрибут на рівні модуля ``raiseExceptions`` має значення ``False``, винятки мовчки ігноруються. Це те, що здебільшого потрібно для системи журналювання - більшість користувачів не будуть дбати про помилки в системі журналювання, їх більше цікавлять помилки програми. Однак ви можете замінити це спеціальним обробником, якщо хочете. Указаний запис є записом, який оброблявся, коли сталася виняток. (Значенням за замовчуванням ``raiseExceptions`` є ``True``, оскільки це більш корисно під час розробки).

source: Do formatting for a record - if a formatter is set, use it. Otherwise, use the default formatter for the module.
uk: Виконайте форматування для запису - якщо встановлено форматувальник, використовуйте його. В іншому випадку використовуйте стандартний формататор для модуля.

source: Do whatever it takes to actually log the specified logging record. This version is intended to be implemented by subclasses and so raises a :exc:`NotImplementedError`.
uk: Зробіть усе можливе, щоб фактично зареєструвати вказаний запис журналу. Ця версія призначена для реалізації підкласами, тому викликає :exc:`NotImplementedError`.

source: For a list of handlers included as standard, see :mod:`logging.handlers`.
uk: Перелік стандартних обробників див. :mod:`logging.handlers`.

source: Formatter Objects
uk: Об’єкти форматування

source: :class:`Formatter` objects have the following attributes and methods. They are responsible for converting a :class:`LogRecord` to (usually) a string which can be interpreted by either a human or an external system. The base :class:`Formatter` allows a formatting string to be specified. If none is supplied, the default value of ``'%(message)s'`` is used, which just includes the message in the logging call. To have additional items of information in the formatted output (such as a timestamp), keep reading.
uk: Об’єкти :class:`Formatter` мають такі атрибути та методи. Вони відповідають за перетворення :class:`LogRecord` на (зазвичай) рядок, який може інтерпретувати або людина, або зовнішня система. База :class:`Formatter` дозволяє вказати рядок форматування. Якщо жодного не вказано, використовується значення за замовчуванням ``'%(message)s'``, яке просто включає повідомлення у виклик журналювання. Щоб мати додаткову інформацію у відформатованому виведенні (наприклад, позначку часу), продовжуйте читати.

source: A Formatter can be initialized with a format string which makes use of knowledge of the :class:`LogRecord` attributes - such as the default value mentioned above making use of the fact that the user's message and arguments are pre-formatted into a :class:`LogRecord`'s *message* attribute. This format string contains standard Python %-style mapping keys. See section :ref:`old-string-formatting` for more information on string formatting.
uk: Formatter можна ініціалізувати за допомогою рядка формату, який використовує знання атрибутів :class:`LogRecord`, таких як значення за замовчуванням, згадане вище, з використанням того факту, що повідомлення та аргументи користувача попередньо відформатовано в атрибут *повідомлення* у :class:`LogRecord`. Цей рядок формату містить стандартні ключі зіставлення Python %-style. Перегляньте розділ :ref:`old-string-formatting` для отримання додаткової інформації про форматування рядка.

source: The useful mapping keys in a :class:`LogRecord` are given in the section on :ref:`logrecord-attributes`.
uk: Корисні ключі зіставлення в :class:`LogRecord` подано в розділі про :ref:`logrecord-attributes`.

source: Returns a new instance of the :class:`Formatter` class. The instance is initialized with a format string for the message as a whole, as well as a format string for the date/time portion of a message. If no *fmt* is specified, ``'%(message)s'`` is used. If no *datefmt* is specified, a format is used which is described in the :meth:`formatTime` documentation.
uk: Повертає новий екземпляр класу :class:`Formatter`. Примірник ініціалізується рядком формату для повідомлення в цілому, а також рядком формату для частини дати/часу повідомлення. Якщо *fmt* не вказано, використовується "%(message)s". Якщо *datefmt* не вказано, використовується формат, який описано в документації :meth:`formatTime`.

source: The *style* parameter can be one of '%', '{' or '$' and determines how the format string will be merged with its data: using one of %-formatting, :meth:`str.format` or :class:`string.Template`. This only applies to the format string *fmt* (e.g. ``'%(message)s'`` or ``{message}``), not to the actual log messages passed to ``Logger.debug`` etc; see :ref:`formatting-styles` for more information on using {- and $-formatting for log messages.
uk: Параметр *style* може мати значення "%", "{" або "$" і визначає, як рядок формату буде об’єднано з його даними: за допомогою %-formatting, :meth:`str.format` або :class:`рядок.Шаблон`. Це стосується лише рядка формату *fmt* (наприклад, ``'%(message)s''`` або ``{message}``), а не фактичних повідомлень журналу, що передаються до ``Logger.debug`` тощо; див. :ref:`formatting-styles` для отримання додаткової інформації про використання {- і $-форматування для повідомлень журналу.

source: The *defaults* parameter can be a dictionary with default values to use in custom fields. For example: ``logging.Formatter('%(ip)s %(message)s', defaults={"ip": None})``
uk: Параметр *defaults* може бути словником зі значеннями за замовчуванням для використання в спеціальних полях. Наприклад: ``logging.Formatter('%(ip)s %(message)s', defaults={"ip": None})``

source: The *style* parameter was added.
uk: Додано параметр *style*.

source: The *validate* parameter was added. Incorrect or mismatched style and fmt will raise a ``ValueError``. For example: ``logging.Formatter('%(asctime)s - %(message)s', style='{')``.
uk: Додано параметр *validate*. Неправильний або невідповідний стиль і fmt викличе ``ValueError``. Наприклад: ``logging.Formatter('%(asctime)s - %(message)s', style='{')``.

source: The *defaults* parameter was added.
uk: Додано параметр *defaults*.

source: The record's attribute dictionary is used as the operand to a string formatting operation. Returns the resulting string. Before formatting the dictionary, a couple of preparatory steps are carried out. The *message* attribute of the record is computed using *msg* % *args*. If the formatting string contains ``'(asctime)'``, :meth:`formatTime` is called to format the event time. If there is exception information, it is formatted using :meth:`formatException` and appended to the message. Note that the formatted exception information is cached in attribute *exc_text*. This is useful because the exception information can be pickled and sent across the wire, but you should be careful if you have more than one :class:`Formatter` subclass which customizes the formatting of exception information. In this case, you will have to clear the cached value (by setting the *exc_text* attribute to ``None``) after a formatter has done its formatting, so that the next formatter to handle the event doesn't use the cached value, but recalculates it afresh.
uk: Словник атрибутів запису використовується як операнд для операції форматування рядка. Повертає отриманий рядок. Перед форматуванням словника виконується кілька підготовчих кроків. Атрибут *message* запису обчислюється за допомогою *msg* % *args*. Якщо рядок форматування містить ``'(asctime)'``, :meth:`formatTime` викликається для форматування часу події. Якщо є інформація про винятки, вона форматується за допомогою :meth:`formatException` і додається до повідомлення. Зауважте, що відформатована інформація про винятки кешується в атрибуті *exc_text*. Це корисно, оскільки інформацію про винятки можна відібрати та надіслати по мережі, але ви повинні бути обережними, якщо у вас є більше одного підкласу :class:`Formatter`, який налаштовує форматування інформації про винятки. У цьому випадку вам доведеться очистити кешоване значення (встановивши для атрибута *exc_text* значення ``None``) після того, як засіб форматування виконає своє форматування, щоб наступний засіб форматування для обробки події не використовував кешований значення, але перераховує його заново.

source: If stack information is available, it's appended after the exception information, using :meth:`formatStack` to transform it if necessary.
uk: Якщо інформація про стек доступна, вона додається після інформації про винятки, використовуючи :meth:`formatStack` для її перетворення, якщо необхідно.

source: This method should be called from :meth:`format` by a formatter which wants to make use of a formatted time. This method can be overridden in formatters to provide for any specific requirement, but the basic behavior is as follows: if *datefmt* (a string) is specified, it is used with :func:`time.strftime` to format the creation time of the record. Otherwise, the format '%Y-%m-%d %H:%M:%S,uuu' is used, where the uuu part is a millisecond value and the other letters are as per the :func:`time.strftime` documentation. An example time in this format is ``2003-01-23 00:29:50,411``. The resulting string is returned.
uk: Цей метод має викликатися з :meth:`format` програмою форматування, яка бажає використати відформатований час. Цей метод можна замінити у форматах для забезпечення будь-якої конкретної вимоги, але основна поведінка така: якщо вказано *datefmt* (рядок), він використовується з :func:`time.strftime` для форматування часу створення запису. В іншому випадку використовується формат "%Y-%m-%d %H:%M:%S,uuu", де частина uuu є значенням у мілісекундах, а інші літери відповідають :func:`time.strftime` документація. Прикладом часу в цьому форматі є ``2003-01-23 00:29:50,411``. Повертається отриманий рядок.

source: This function uses a user-configurable function to convert the creation time to a tuple. By default, :func:`time.localtime` is used; to change this for a particular formatter instance, set the ``converter`` attribute to a function with the same signature as :func:`time.localtime` or :func:`time.gmtime`. To change it for all formatters, for example if you want all logging times to be shown in GMT, set the ``converter`` attribute in the ``Formatter`` class.
uk: Ця функція використовує настроювану користувачем функцію для перетворення часу створення в кортеж. За замовчуванням використовується :func:`time.localtime`; щоб змінити це для конкретного екземпляра форматера, встановіть атрибут ``converter`` на функцію з тим самим підписом, що й :func:`time.localtime` або :func:`time.gmtime`. Щоб змінити його для всіх засобів форматування, наприклад, якщо ви хочете, щоб усі часи журналювання відображалися за GMT, установіть атрибут ``converter`` у класі ``Formatter``.

source: Previously, the default format was hard-coded as in this example: ``2010-09-06 22:38:15,292`` where the part before the comma is handled by a strptime format string (``'%Y-%m-%d %H:%M:%S'``), and the part after the comma is a millisecond value. Because strptime does not have a format placeholder for milliseconds, the millisecond value is appended using another format string, ``'%s,%03d'`` --- and both of these format strings have been hardcoded into this method. With the change, these strings are defined as class-level attributes which can be overridden at the instance level when desired. The names of the attributes are ``default_time_format`` (for the strptime format string) and ``default_msec_format`` (for appending the millisecond value).
uk: Раніше формат за замовчуванням був жорстко закодований, як у цьому прикладі: ``2010-09-06 22:38:15,292``, де частина перед комою обробляється рядком формату strptime (``'%Y-%m -%d %H:%M:%S''``), а частина після коми є значенням у мілісекундах. Оскільки strptime не має заповнювача формату для мілісекунд, значення мілісекунди додається за допомогою іншого рядка формату, ``'%s,%03d''`` --- і обидва ці рядки формату були жорстко закодовані в цьому методі. Зі зміною ці рядки визначаються як атрибути рівня класу, які за бажанням можна замінити на рівні екземпляра. Назви атрибутів: ``default_time_format`` (для рядка формату strptime) і ``default_msec_format`` (для додавання значення в мілісекундах).

source: The ``default_msec_format`` can be ``None``.
uk: ``default_msec_format`` може бути ``None``.

source: Formats the specified exception information (a standard exception tuple as returned by :func:`sys.exc_info`) as a string. This default implementation just uses :func:`traceback.print_exception`. The resulting string is returned.
uk: Форматує вказану інформацію про винятки (стандартний кортеж винятків, який повертає :func:`sys.exc_info`) як рядок. Ця реалізація за умовчанням просто використовує :func:`traceback.print_exception`. Повертається отриманий рядок.
