Repository: python/python-docs-uk
Catalog: library/logging.po
Languages: uk

source: :mod:`logging` --- Logging facility for Python
uk: :mod:`logging` --- Можливість журналювання для Python

source: **Source code:** :source:`Lib/logging/__init__.py`
uk: **Вихідний код:** :source:`Lib/logging/__init__.py`

source: This page contains the API reference information. For tutorial information and discussion of more advanced topics, see
uk: Ця сторінка містить довідкову інформацію про API. Інформацію про підручники та обговорення більш складних тем див

source: :ref:`Basic Tutorial <logging-basic-tutorial>`
uk: :ref:`Основний посібник <logging-basic-tutorial>`

source: :ref:`Advanced Tutorial <logging-advanced-tutorial>`
uk: :ref:`Розширений посібник <logging-advanced-tutorial>`

source: :ref:`Logging Cookbook <logging-cookbook>`
uk: :ref:`Кулінарна книга журналювання <logging-cookbook>`

source: This module defines functions and classes which implement a flexible event logging system for applications and libraries.
uk: Цей модуль визначає функції та класи, які реалізують гнучку систему реєстрації подій для програм і бібліотек.

source: The key benefit of having the logging API provided by a standard library module is that all Python modules can participate in logging, so your application log can include your own messages integrated with messages from third-party modules.
uk: Ключовою перевагою використання API журналювання, що надається стандартним бібліотечним модулем, є те, що всі модулі Python можуть брати участь у журналюванні, тому ваш журнал програми може містити ваші власні повідомлення, інтегровані з повідомленнями від сторонніх модулів.

source: The simplest example:
uk: Найпростіший приклад:

source: The module provides a lot of functionality and flexibility. If you are unfamiliar with logging, the best way to get to grips with it is to view the tutorials (**see the links above and on the right**).
uk: Модуль забезпечує багато функціональних можливостей і гнучкості. Якщо ви не знайомі з веденням журналів, найкращий спосіб зрозуміти це — переглянути навчальні посібники (**перегляньте посилання вище та праворуч**).

source: The basic classes defined by the module, together with their functions, are listed below.
uk: Основні класи, визначені модулем, разом із їхніми функціями перераховані нижче.

source: Loggers expose the interface that application code directly uses.
uk: Логери відкривають інтерфейс, який безпосередньо використовує код програми.

source: Handlers send the log records (created by loggers) to the appropriate destination.
uk: Обробники надсилають записи журналу (створені реєстраторами) у відповідне місце призначення.

source: Filters provide a finer grained facility for determining which log records to output.
uk: Фільтри забезпечують точніші засоби для визначення того, які записи журналу виводити.

source: Formatters specify the layout of log records in the final output.
uk: Засоби форматування вказують макет записів журналу в кінцевому виведенні.

source: Logger Objects
uk: Логер об'єктів

source: Loggers have the following attributes and methods. Note that Loggers should *NEVER* be instantiated directly, but always through the module-level function ``logging.getLogger(name)``. Multiple calls to :func:`getLogger` with the same name will always return a reference to the same Logger object.
uk: Реєстратори мають такі атрибути та методи. Зауважте, що Логери *НІКОЛИ* не повинні створюватися безпосередньо, а завжди через функцію рівня модуля ``logging.getLogger(name)``. Кілька викликів :func:`getLogger` з однаковою назвою завжди повертатимуть посилання на той самий об’єкт Logger.

source: The ``name`` is potentially a period-separated hierarchical value, like ``foo.bar.baz`` (though it could also be just plain ``foo``, for example). Loggers that are further down in the hierarchical list are children of loggers higher up in the list. For example, given a logger with a name of ``foo``, loggers with names of ``foo.bar``, ``foo.bar.baz``, and ``foo.bam`` are all descendants of ``foo``. The logger name hierarchy is analogous to the Python package hierarchy, and identical to it if you organise your loggers on a per-module basis using the recommended construction ``logging.getLogger(__name__)``. That's because in a module, ``__name__`` is the module's name in the Python package namespace.
uk: ``name`` потенційно є ієрархічним значенням, розділеним крапкою, наприклад ``foo.bar.baz`` (хоча це також може бути просто ``foo``, наприклад). Реєстратори, розташовані нижче в ієрархічному списку, є нащадками реєстраторів, розташованих вище в списку. Наприклад, якщо задано реєстратор із іменем ``foo``, усі реєстратори з іменами ``foo.bar``, ``foo.bar.baz`` і ``foo.bam`` є нащадками ``фу``. Ієрархія імен реєстратора аналогічна ієрархії пакетів Python і ідентична їй, якщо ви організовуєте свої реєстратори на основі кожного модуля за допомогою рекомендованої конструкції ``logging.getLogger(__name__)``. Це тому, що в модулі ``__name__`` є назвою модуля в просторі імен пакета Python.

source: If this attribute evaluates to true, events logged to this logger will be passed to the handlers of higher level (ancestor) loggers, in addition to any handlers attached to this logger. Messages are passed directly to the ancestor loggers' handlers - neither the level nor filters of the ancestor loggers in question are considered.
uk: Якщо цей атрибут оцінюється як істина, події, зареєстровані в цьому реєстраторі, будуть передані обробникам реєстраторів вищого рівня (предків), на додаток до будь-яких обробників, приєднаних до цього реєстратора. Повідомлення передаються безпосередньо до обробників попередніх реєстраторів - ні рівень, ні фільтри попередніх реєстраторів, про які йдеться.

source: If this evaluates to false, logging messages are not passed to the handlers of ancestor loggers.
uk: Якщо це значення має значення false, повідомлення журналу не передаються до обробників попередніх реєстраторів.

source: Spelling it out with an example: If the propagate attribute of the logger named ``A.B.C`` evaluates to true, any event logged to ``A.B.C`` via a method call such as ``logging.getLogger('A.B.C').error(...)`` will [subject to passing that logger's level and filter settings] be passed in turn to any handlers attached to loggers named ``A.B``, ``A`` and the root logger, after first being passed to any handlers attached to ``A.B.C``. If any logger in the chain ``A.B.C``, ``A.B``, ``A`` has its ``propagate`` attribute set to false, then that is the last logger whose handlers are offered the event to handle, and propagation stops at that point.
uk: Напишіть це на прикладі: якщо атрибут propagate реєстратора під назвою ``A.B.C`` має значення true, будь-яка подія, зареєстрована в ``A.B.C`` через виклик методу, наприклад ``logging.getLogger('A.B.C') .error(...)`` [за умови передачі цього рівня реєстратора та налаштувань фільтра] буде передано по черзі будь-яким обробникам, приєднаним до реєстраторів з назвами ``A.B``, ``A`` і кореневому реєстратору після першого передається будь-яким обробникам, приєднаним до ``A.B.C``. Якщо будь-який реєстратор у ланцюжку ``A.B.C``, ``A.B``, ``A`` має атрибут ``propagate``, встановлений на false, то це останній реєстратор, обробникам якого пропонується подія для обробки, і на цьому розповсюдження припиняється.

source: The constructor sets this attribute to ``True``.
uk: Конструктор встановлює цьому атрибуту значення ``True``.

source: If you attach a handler to a logger *and* one or more of its ancestors, it may emit the same record multiple times. In general, you should not need to attach a handler to more than one logger - if you just attach it to the appropriate logger which is highest in the logger hierarchy, then it will see all events logged by all descendant loggers, provided that their propagate setting is left set to ``True``. A common scenario is to attach handlers only to the root logger, and to let propagation take care of the rest.
uk: Якщо ви приєднаєте обробник до реєстратора *і* одного або кількох його предків, він може створювати той самий запис кілька разів. Загалом, вам не потрібно приєднувати обробник до кількох реєстраторів — якщо ви просто приєднаєте його до відповідного реєстратора, який є найвищим в ієрархії реєстратора, тоді він бачитиме всі події, зареєстровані всіма нащадками реєстраторів, за умови, що вони поширюються параметр залишається встановленим на ``True``. Поширеним сценарієм є приєднання обробників лише до кореневого реєстратора, а розповсюдження подбає про решту.

source: Sets the threshold for this logger to *level*. Logging messages which are less severe than *level* will be ignored; logging messages which have severity *level* or higher will be emitted by whichever handler or handlers service this logger, unless a handler's level has been set to a higher severity level than *level*.
uk: Встановлює порогове значення для цього реєстратора на *рівень*. Повідомлення журналу, менш суворі, ніж *рівень*, ігноруватимуться; Повідомлення журналювання, які мають рівень серйозності *рівень* або вищий, будуть випущені будь-яким обробником або обробниками, які обслуговують цей реєстратор, якщо рівень серйозності обробника не встановлено на вищий рівень серйозності, ніж *рівень*.

source: When a logger is created, the level is set to :const:`NOTSET` (which causes all messages to be processed when the logger is the root logger, or delegation to the parent when the logger is a non-root logger). Note that the root logger is created with level :const:`WARNING`.
uk: Коли реєстратор створюється, рівень встановлюється на :const:`NOTSET` (що спричиняє обробку всіх повідомлень, коли реєстратор є кореневим реєстратором, або делегування батьківському, якщо реєстратор є некореневим). Зверніть увагу, що кореневий реєстратор створюється з рівнем :const:`WARNING`.

source: The term 'delegation to the parent' means that if a logger has a level of NOTSET, its chain of ancestor loggers is traversed until either an ancestor with a level other than NOTSET is found, or the root is reached.
uk: Термін "делегування батьківському" означає, що якщо реєстратор має рівень NOTSET, його ланцюжок реєстраторів предків обходиться, доки не буде знайдено предка з рівнем, відмінним від NOTSET, або досягнуто кореня.

source: If an ancestor is found with a level other than NOTSET, then that ancestor's level is treated as the effective level of the logger where the ancestor search began, and is used to determine how a logging event is handled.
uk: Якщо знайдено предка з рівнем, відмінним від NOTSET, тоді цей рівень предка розглядається як ефективний рівень реєстратора, з якого почався пошук предка, і використовується для визначення того, як обробляється подія журналювання.

source: If the root is reached, and it has a level of NOTSET, then all messages will be processed. Otherwise, the root's level will be used as the effective level.
uk: Якщо кореневий доступ досягнутий і він має рівень NOTSET, то всі повідомлення будуть оброблені. В іншому випадку кореневий рівень буде використано як ефективний рівень.

source: See :ref:`levels` for a list of levels.
uk: Перегляньте :ref:`levels` список рівнів.

source: The *level* parameter now accepts a string representation of the level such as 'INFO' as an alternative to the integer constants such as :const:`INFO`. Note, however, that levels are internally stored as integers, and methods such as e.g. :meth:`getEffectiveLevel` and :meth:`isEnabledFor` will return/expect to be passed integers.
uk: Параметр *level* тепер приймає рядкове представлення рівня, наприклад "INFO", як альтернативу цілим константам, таким як :const:`INFO`. Однак зауважте, що рівні внутрішньо зберігаються як цілі числа, а такі методи, як, наприклад, :meth:`getEffectiveLevel` і :meth:`isEnabledFor` повертатимуть/очікуватимуть передачу цілих чисел.

source: Indicates if a message of severity *level* would be processed by this logger. This method checks first the module-level level set by ``logging.disable(level)`` and then the logger's effective level as determined by :meth:`getEffectiveLevel`.
uk: Вказує, чи буде оброблено повідомлення *рівня* серйозності цим реєстратором. Цей метод спочатку перевіряє рівень модуля, встановлений ``logging.disable(level)``, а потім ефективний рівень реєстратора, визначений :meth:`getEffectiveLevel`.

source: Indicates the effective level for this logger. If a value other than :const:`NOTSET` has been set using :meth:`setLevel`, it is returned. Otherwise, the hierarchy is traversed towards the root until a value other than :const:`NOTSET` is found, and that value is returned. The value returned is an integer, typically one of :const:`logging.DEBUG`, :const:`logging.INFO` etc.
uk: Вказує ефективний рівень для цього реєстратора. Якщо значення, відмінне від :const:`NOTSET`, було встановлено за допомогою :meth:`setLevel`, воно повертається. В іншому випадку ієрархія переміщається до кореня, доки не буде знайдено значення, відмінне від :const:`NOTSET`, і це значення повертається. Значення, що повертається, є цілим числом, зазвичай одне з :const:`logging.DEBUG`, :const:`logging.INFO` тощо.

source: Returns a logger which is a descendant to this logger, as determined by the suffix. Thus, ``logging.getLogger('abc').getChild('def.ghi')`` would return the same logger as would be returned by ``logging.getLogger('abc.def.ghi')``. This is a convenience method, useful when the parent logger is named using e.g. ``__name__`` rather than a literal string.
uk: Повертає реєстратор, який є нащадком цього реєстратора, як визначено суфіксом. Таким чином, ``logging.getLogger('abc').getChild('def.ghi')`` повертатиме той самий реєстратор, який повертає ``logging.getLogger('abc.def.ghi')``. Це зручний метод, корисний, коли батьківський реєстратор називається, наприклад, ``__name__``, а не літеральний рядок.

source: Logs a message with level :const:`DEBUG` on this logger. The *msg* is the message format string, and the *args* are the arguments which are merged into *msg* using the string formatting operator. (Note that this means that you can use keywords in the format string, together with a single dictionary argument.) No % formatting operation is performed on *msg* when no *args* are supplied.
uk: Записує повідомлення з рівнем :const:`DEBUG` у цьому реєстраторі. *msg* — це рядок формату повідомлення, а *args* — це аргументи, які об’єднуються в *msg* за допомогою оператора форматування рядка. (Зауважте, що це означає, що ви можете використовувати ключові слова в рядку формату разом із одним аргументом словника.) Операція форматування % не виконується для *msg*, якщо не надано *args*.

source: There are four keyword arguments in *kwargs* which are inspected: *exc_info*, *stack_info*, *stacklevel* and *extra*.
uk: У *kwargs* є чотири аргументи ключових слів, які перевіряються: *exc_info*, *stack_info*, *stacklevel* і *extra*.

source: If *exc_info* does not evaluate as false, it causes exception information to be added to the logging message. If an exception tuple (in the format returned by :func:`sys.exc_info`) or an exception instance is provided, it is used; otherwise, :func:`sys.exc_info` is called to get the exception information.
uk: Якщо *exc_info* не оцінюється як false, це спричиняє додавання інформації про винятки до повідомлення журналу. Якщо надано кортеж винятків (у форматі, який повертає :func:`sys.exc_info`) або екземпляр винятку, він використовується; інакше :func:`sys.exc_info` викликається для отримання інформації про винятки.

source: The second optional keyword argument is *stack_info*, which defaults to ``False``. If true, stack information is added to the logging message, including the actual logging call. Note that this is not the same stack information as that displayed through specifying *exc_info*: The former is stack frames from the bottom of the stack up to the logging call in the current thread, whereas the latter is information about stack frames which have been unwound, following an exception, while searching for exception handlers.
uk: Другим необов’язковим ключовим аргументом є *stack_info*, який за умовчанням має значення ``False``. Якщо значення true, інформація про стек додається до повідомлення журналу, включаючи фактичний виклик журналу. Зауважте, що це інша інформація про стек, яка відображається за допомогою *exc_info*: перша – це кадри стеку від нижньої частини стеку до виклику журналювання в поточному потоці, тоді як остання – це інформація про кадри стеку, які були переглянуті. unwind, після винятку, під час пошуку обробників винятків.

source: You can specify *stack_info* independently of *exc_info*, e.g. to just show how you got to a certain point in your code, even when no exceptions were raised. The stack frames are printed following a header line which says:
uk: Ви можете вказати *stack_info* незалежно від *exc_info*, наприклад. щоб просто показати, як ви дійшли до певної точки у своєму коді, навіть якщо винятків не було викликано. Фрейми стека друкуються після рядка заголовка, який говорить:

source: This mimics the ``Traceback (most recent call last):`` which is used when displaying exception frames.
uk: Це імітує ``Traceback (останній останній виклик):``, який використовується під час відображення кадрів винятків.

source: The third optional keyword argument is *stacklevel*, which defaults to ``1``. If greater than 1, the corresponding number of stack frames are skipped when computing the line number and function name set in the :class:`LogRecord` created for the logging event. This can be used in logging helpers so that the function name, filename and line number recorded are not the information for the helper function/method, but rather its caller. The name of this parameter mirrors the equivalent one in the :mod:`warnings` module.
uk: Третій необов’язковий аргумент ключового слова — *stacklevel*, який за замовчуванням має значення "1". Якщо більше 1, відповідна кількість кадрів стека пропускається під час обчислення номера рядка та назви функції, встановленої в :class:`LogRecord`, створеному для події журналювання. Це можна використовувати в помічниках журналювання, щоб ім’я функції, ім’я файлу та номер рядка були записані не для допоміжної функції/методу, а для її викликаючого. Назва цього параметра відображає еквівалентну назву в модулі :mod:`warnings`.

source: The fourth keyword argument is *extra* which can be used to pass a dictionary which is used to populate the __dict__ of the :class:`LogRecord` created for the logging event with user-defined attributes. These custom attributes can then be used as you like. For example, they could be incorporated into logged messages. For example::
uk: Четвертий аргумент ключового слова — *extra*, який можна використовувати для передачі словника, який використовується для заповнення __dict__ :class:`LogRecord`, створеного для події журналювання, атрибутами, визначеними користувачем. Потім ці настроювані атрибути можна використовувати як завгодно. Наприклад, їх можна включити до зареєстрованих повідомлень. Наприклад::

source: would print something like
uk: надрукував би щось подібне

source: The keys in the dictionary passed in *extra* should not clash with the keys used by the logging system. (See the :class:`Formatter` documentation for more information on which keys are used by the logging system.)
uk: Ключі в словнику, передані в *extra*, не повинні конфліктувати з ключами, які використовуються системою журналювання. (Див. документацію :class:`Formatter`, щоб дізнатися більше про те, які ключі використовуються системою журналювання.)

source: If you choose to use these attributes in logged messages, you need to exercise some care. In the above example, for instance, the :class:`Formatter` has been set up with a format string which expects 'clientip' and 'user' in the attribute dictionary of the :class:`LogRecord`. If these are missing, the message will not be logged because a string formatting exception will occur. So in this case, you always need to pass the *extra* dictionary with these keys.
uk: Якщо ви вирішите використовувати ці атрибути в зареєстрованих повідомленнях, вам потрібно бути обережними. У наведеному вище прикладі, наприклад, :class:`Formatter` було налаштовано за допомогою рядка формату, який очікує 'clientip' і 'user' у словнику атрибутів :class:`LogRecord`. Якщо вони відсутні, повідомлення не буде зареєстровано, оскільки виникне виняток форматування рядка. Тому в цьому випадку вам завжди потрібно передавати *додатковий* словник за допомогою цих ключів.

source: While this might be annoying, this feature is intended for use in specialized circumstances, such as multi-threaded servers where the same code executes in many contexts, and interesting conditions which arise are dependent on this context (such as remote client IP address and authenticated user name, in the above example). In such circumstances, it is likely that specialized :class:`Formatter`\ s would be used with particular :class:`Handler`\ s.
uk: Хоча це може дратувати, ця функція призначена для використання в особливих умовах, наприклад, на багатопоточних серверах, де той самий код виконується в багатьох контекстах, і цікаві умови, які виникають, залежать від цього контексту (наприклад, IP-адреса віддаленого клієнта та автентифікований ім’я користувача, у наведеному вище прикладі). За таких обставин цілком імовірно, що спеціалізовані :class:`Formatter`\ s будуть використовуватися з певними :class:`Handler`\ s.

source: If no handler is attached to this logger (or any of its ancestors, taking into account the relevant :attr:`Logger.propagate` attributes), the message will be sent to the handler set on :attr:`lastResort`.
uk: Якщо до цього реєстратора (або будь-якого з його предків) не приєднано жодного обробника, враховуючи відповідні атрибути :attr:`Logger.propagate`, повідомлення буде надіслано до обробника, встановленого на :attr:`lastResort`.

source: The *stack_info* parameter was added.
uk: Додано параметр *stack_info*.

source: The *exc_info* parameter can now accept exception instances.
uk: Параметр *exc_info* тепер може приймати винятки.

source: The *stacklevel* parameter was added.
uk: Додано параметр *stacklevel*.

source: Logs a message with level :const:`INFO` on this logger. The arguments are interpreted as for :meth:`debug`.
uk: Записує повідомлення з рівнем :const:`INFO` у цьому реєстраторі. Аргументи інтерпретуються як для :meth:`debug`.

source: Logs a message with level :const:`WARNING` on this logger. The arguments are interpreted as for :meth:`debug`.
uk: Записує повідомлення з рівнем :const:`WARNING` до цього реєстратора. Аргументи інтерпретуються як для :meth:`debug`.

source: There is an obsolete method ``warn`` which is functionally identical to ``warning``. As ``warn`` is deprecated, please do not use it - use ``warning`` instead.
uk: Існує застарілий метод ``warn``, який функціонально ідентичний ``warning``. Оскільки ``попередження`` є застарілим, будь ласка, не використовуйте його - використовуйте замість нього ``попередження``.

source: Logs a message with level :const:`ERROR` on this logger. The arguments are interpreted as for :meth:`debug`.
uk: Записує повідомлення з рівнем :const:`ERROR` у цьому реєстраторі. Аргументи інтерпретуються як для :meth:`debug`.

source: Logs a message with level :const:`CRITICAL` on this logger. The arguments are interpreted as for :meth:`debug`.
uk: Записує повідомлення з рівнем :const:`CRITICAL` до цього реєстратора. Аргументи інтерпретуються як для :meth:`debug`.

source: Logs a message with integer level *level* on this logger. The other arguments are interpreted as for :meth:`debug`.
uk: Записує повідомлення з цілочисельним рівнем *level* у цьому реєстраторі. Інші аргументи інтерпретуються як для :meth:`debug`.
