Repository: python/python-docs-uk
Catalog: library/logging.po
Languages: uk

source: Return either the standard :class:`Logger` class, or the last class passed to :func:`setLoggerClass`. This function may be called from within a new class definition, to ensure that installing a customized :class:`Logger` class will not undo customizations already applied by other code. For example::
uk: Повертає або стандартний клас :class:`Logger`, або останній клас, переданий :func:`setLoggerClass`. Цю функцію можна викликати з нового визначення класу, щоб гарантувати, що встановлення налаштованого класу :class:`Logger` не скасує налаштування, уже застосовані іншим кодом. Наприклад::

source: Return a callable which is used to create a :class:`LogRecord`.
uk: Повертає виклик, який використовується для створення :class:`LogRecord`.

source: This function has been provided, along with :func:`setLogRecordFactory`, to allow developers more control over how the :class:`LogRecord` representing a logging event is constructed.
uk: Цю функцію було надано разом із :func:`setLogRecordFactory`, щоб дозволити розробникам більше контролювати те, як створюється :class:`LogRecord`, що представляє подію журналювання.

source: See :func:`setLogRecordFactory` for more information about the how the factory is called.
uk: Перегляньте :func:`setLogRecordFactory` для отримання додаткової інформації про те, як називається фабрика.

source: Logs a message with level :const:`DEBUG` on the root logger. The *msg* is the message format string, and the *args* are the arguments which are merged into *msg* using the string formatting operator. (Note that this means that you can use keywords in the format string, together with a single dictionary argument.)
uk: Записує повідомлення з рівнем :const:`DEBUG` на кореневому реєстраторі. *msg* — це рядок формату повідомлення, а *args* — це аргументи, які об’єднуються в *msg* за допомогою оператора форматування рядка. (Зауважте, що це означає, що ви можете використовувати ключові слова в рядку формату разом із одним аргументом словника.)

source: There are three keyword arguments in *kwargs* which are inspected: *exc_info* which, if it does not evaluate as false, causes exception information to be added to the logging message. If an exception tuple (in the format returned by :func:`sys.exc_info`) or an exception instance is provided, it is used; otherwise, :func:`sys.exc_info` is called to get the exception information.
uk: У *kwargs* є три аргументи ключових слів, які перевіряються: *exc_info*, який, якщо він не оцінюється як false, призводить до додавання інформації про винятки до повідомлення журналу. Якщо надано кортеж винятків (у форматі, який повертає :func:`sys.exc_info`) або екземпляр винятку, він використовується; інакше :func:`sys.exc_info` викликається для отримання інформації про винятки.

source: The third optional keyword argument is *extra* which can be used to pass a dictionary which is used to populate the __dict__ of the LogRecord created for the logging event with user-defined attributes. These custom attributes can then be used as you like. For example, they could be incorporated into logged messages. For example::
uk: Третій необов’язковий аргумент ключового слова — *extra*, який можна використовувати для передачі словника, який використовується для заповнення __dict__ LogRecord, створеного для події журналювання, атрибутами, визначеними користувачем. Потім ці настроювані атрибути можна використовувати як завгодно. Наприклад, їх можна включити до зареєстрованих повідомлень. Наприклад::

source: would print something like:
uk: надрукував би щось на зразок:

source: If you choose to use these attributes in logged messages, you need to exercise some care. In the above example, for instance, the :class:`Formatter` has been set up with a format string which expects 'clientip' and 'user' in the attribute dictionary of the LogRecord. If these are missing, the message will not be logged because a string formatting exception will occur. So in this case, you always need to pass the *extra* dictionary with these keys.
uk: Якщо ви вирішите використовувати ці атрибути в зареєстрованих повідомленнях, вам потрібно бути обережними. У наведеному вище прикладі, наприклад, :class:`Formatter` було налаштовано за допомогою рядка формату, який очікує "clientip" і "user" у словнику атрибутів LogRecord. Якщо вони відсутні, повідомлення не буде зареєстровано, оскільки виникне виняток форматування рядка. Тому в цьому випадку вам завжди потрібно передавати *додатковий* словник за допомогою цих ключів.

source: This function (as well as :func:`info`, :func:`warning`, :func:`error` and :func:`critical`) will call :func:`basicConfig` if the root logger doesn't have any handler attached.
uk: Ця функція (а також :func:`info`, :func:`warning`, :func:`error` і :func:`critical`) викличе :func:`basicConfig`, якщо кореневий реєстратор не має будь-який доданий обробник.

source: Logs a message with level :const:`INFO` on the root logger. The arguments are interpreted as for :func:`debug`.
uk: Записує повідомлення з рівнем :const:`INFO` на кореневому реєстраторі. Аргументи інтерпретуються як для :func:`debug`.

source: Logs a message with level :const:`WARNING` on the root logger. The arguments are interpreted as for :func:`debug`.
uk: Записує повідомлення з рівнем :const:`WARNING` на кореневому реєстраторі. Аргументи інтерпретуються як для :func:`debug`.

source: There is an obsolete function ``warn`` which is functionally identical to ``warning``. As ``warn`` is deprecated, please do not use it - use ``warning`` instead.
uk: Існує застаріла функція ``warn``, яка функціонально ідентична ``warning``. Оскільки ``попередження`` застаріло, будь ласка, не використовуйте його - використовуйте замість нього ``попередження``.

source: Logs a message with level :const:`ERROR` on the root logger. The arguments are interpreted as for :func:`debug`.
uk: Записує повідомлення з рівнем :const:`ERROR` на кореневому реєстраторі. Аргументи інтерпретуються як для :func:`debug`.

source: Logs a message with level :const:`CRITICAL` on the root logger. The arguments are interpreted as for :func:`debug`.
uk: Записує повідомлення з рівнем :const:`CRITICAL` на кореневому реєстраторі. Аргументи інтерпретуються як для :func:`debug`.

source: Logs a message with level :const:`ERROR` on the root logger. The arguments are interpreted as for :func:`debug`. Exception info is added to the logging message. This function should only be called from an exception handler.
uk: Записує повідомлення з рівнем :const:`ERROR` на кореневому реєстраторі. Аргументи інтерпретуються як для :func:`debug`. Інформація про винятки додається до повідомлення журналу. Цю функцію слід викликати лише з обробника винятків.

source: Logs a message with level *level* on the root logger. The other arguments are interpreted as for :func:`debug`.
uk: Записує повідомлення з рівнем *level* на кореневому реєстраторі. Інші аргументи інтерпретуються як для :func:`debug`.

source: Provides an overriding level *level* for all loggers which takes precedence over the logger's own level. When the need arises to temporarily throttle logging output down across the whole application, this function can be useful. Its effect is to disable all logging calls of severity *level* and below, so that if you call it with a value of INFO, then all INFO and DEBUG events would be discarded, whereas those of severity WARNING and above would be processed according to the logger's effective level. If ``logging.disable(logging.NOTSET)`` is called, it effectively removes this overriding level, so that logging output again depends on the effective levels of individual loggers.
uk: Забезпечує переважний рівень *рівень* для всіх реєстраторів, який має перевагу над власним рівнем реєстратора. Ця функція може бути корисною, коли виникає потреба тимчасово зменшити вивід журналювання в усій програмі. Його ефект полягає в тому, щоб вимкнути всі виклики журналювання рівня серйозності *рівня* і нижче, так що якщо ви викликаєте його зі значенням INFO, тоді всі події INFO та DEBUG будуть відхилені, тоді як події серйозності WARNING і вище будуть оброблені відповідно до ефективний рівень реєстратора. Якщо викликається ``logging.disable(logging.NOTSET)``, це фактично видаляє цей переважний рівень, так що вихід журналу знову залежить від ефективних рівнів окремих реєстраторів.

source: Note that if you have defined any custom logging level higher than ``CRITICAL`` (this is not recommended), you won't be able to rely on the default value for the *level* parameter, but will have to explicitly supply a suitable value.
uk: Зауважте, що якщо ви визначили будь-який спеціальний рівень журналювання, вищий за ``КРИТИЧНИЙ`` (це не рекомендовано), ви не зможете покладатися на значення за замовчуванням для параметра *level*, але вам доведеться явно вказати відповідне значення.

source: The *level* parameter was defaulted to level ``CRITICAL``. See :issue:`28524` for more information about this change.
uk: Параметр *level* за замовчуванням мав рівень ``КРИТИЧНИЙ``. Перегляньте :issue:`28524`, щоб дізнатися більше про цю зміну.

source: Associates level *level* with text *levelName* in an internal dictionary, which is used to map numeric levels to a textual representation, for example when a :class:`Formatter` formats a message. This function can also be used to define your own levels. The only constraints are that all levels used must be registered using this function, levels should be positive integers and they should increase in increasing order of severity.
uk: Пов’язує рівень *level* із текстом *levelName* у внутрішньому словнику, який використовується для відображення числових рівнів у текстовому представленні, наприклад, коли :class:`Formatter` форматує повідомлення. Цю функцію також можна використовувати для визначення власних рівнів. Єдині обмеження полягають у тому, що всі використовувані рівні мають бути зареєстровані за допомогою цієї функції, рівні мають бути додатними цілими числами, і вони мають збільшуватися в порядку зростання серйозності.

source: If you are thinking of defining your own levels, please see the section on :ref:`custom-levels`.
uk: Якщо ви плануєте визначити власні рівні, перегляньте розділ про :ref:`custom-levels`.

source: Returns the textual or numeric representation of logging level *level*.
uk: Повертає текстове або числове представлення рівня реєстрації *level*.

source: If *level* is one of the predefined levels :const:`CRITICAL`, :const:`ERROR`, :const:`WARNING`, :const:`INFO` or :const:`DEBUG` then you get the corresponding string. If you have associated levels with names using :func:`addLevelName` then the name you have associated with *level* is returned. If a numeric value corresponding to one of the defined levels is passed in, the corresponding string representation is returned.
uk: Якщо *level* є одним із попередньо визначених рівнів :const:`CRITICAL`, :const:`ERROR`, :const:`WARNING`, :const:`INFO` або :const:`DEBUG`, тоді ви отримаєте відповідний рядок . Якщо ви пов’язали рівні з іменами за допомогою :func:`addLevelName`, тоді повертається ім’я, яке ви пов’язали з *рівнем*. Якщо передано числове значення, що відповідає одному з визначених рівнів, повертається відповідне представлення рядка.

source: The *level* parameter also accepts a string representation of the level such as 'INFO'. In such cases, this functions returns the corresponding numeric value of the level.
uk: Параметр *level* також приймає рядкове представлення рівня, наприклад "INFO". У таких випадках ця функція повертає відповідне числове значення рівня.

source: If no matching numeric or string value is passed in, the string 'Level %s' % level is returned.
uk: Якщо відповідного числового або рядкового значення не передано, повертається рядок "Рівень %s" % рівня.

source: Levels are internally integers (as they need to be compared in the logging logic). This function is used to convert between an integer level and the level name displayed in the formatted log output by means of the ``%(levelname)s`` format specifier (see :ref:`logrecord-attributes`), and vice versa.
uk: Рівні є внутрішніми цілими числами (оскільки їх потрібно порівнювати в логіці журналювання). Ця функція використовується для перетворення між цілочисельним рівнем і назвою рівня, що відображається у форматованому виведенні журналу за допомогою специфікатора формату ``%(levelname)s`` (див. :ref:`logrecord-attributes`), і навпаки.

source: In Python versions earlier than 3.4, this function could also be passed a text level, and would return the corresponding numeric value of the level. This undocumented behaviour was considered a mistake, and was removed in Python 3.4, but reinstated in 3.4.2 due to retain backward compatibility.
uk: У версіях Python, раніших за 3.4, ця функція також могла передаватися на текстовий рівень і повертала б відповідне числове значення рівня. Ця незадокументована поведінка вважалася помилкою та була видалена в Python 3.4, але відновлена в 3.4.2 через збереження зворотної сумісності.

source: Creates and returns a new :class:`LogRecord` instance whose attributes are defined by *attrdict*. This function is useful for taking a pickled :class:`LogRecord` attribute dictionary, sent over a socket, and reconstituting it as a :class:`LogRecord` instance at the receiving end.
uk: Створює та повертає новий екземпляр :class:`LogRecord`, атрибути якого визначено *attrdict*. Ця функція корисна для того, щоб взяти вибраний словник атрибутів :class:`LogRecord`, надісланий через сокет, і відтворити його як екземпляр :class:`LogRecord` на кінці прийому.

source: Does basic configuration for the logging system by creating a :class:`StreamHandler` with a default :class:`Formatter` and adding it to the root logger. The functions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical` will call :func:`basicConfig` automatically if no handlers are defined for the root logger.
uk: Виконує базову конфігурацію для системи журналювання, створюючи :class:`StreamHandler` із стандартним :class:`Formatter` і додаючи його до кореневого реєстратора. Функції :func:`debug`, :func:`info`, :func:`warning`, :func:`error` і :func:`critical` викличуть :func:`basicConfig` автоматично, якщо не визначено обробників для кореневого реєстратора.

source: This function does nothing if the root logger already has handlers configured, unless the keyword argument *force* is set to ``True``.
uk: Ця функція нічого не робить, якщо кореневий реєстратор уже має налаштовані обробники, якщо для ключового аргументу *force* не встановлено значення ``True``.

source: This function should be called from the main thread before other threads are started. In versions of Python prior to 2.7.1 and 3.2, if this function is called from multiple threads, it is possible (in rare circumstances) that a handler will be added to the root logger more than once, leading to unexpected results such as messages being duplicated in the log.
uk: Цю функцію слід викликати з основного потоку перед запуском інших потоків. У версіях Python до 2.7.1 і 3.2, якщо ця функція викликається з кількох потоків, можливо (у рідкісних випадках), що обробник буде додано до кореневого журналу більше одного разу, що призведе до неочікуваних результатів, таких як повідомлення дублюється в журналі.

source: The following keyword arguments are supported.
uk: Підтримуються наступні аргументи ключових слів.

source: *filename*
uk: *назва файлу*

source: Specifies that a :class:`FileHandler` be created, using the specified filename, rather than a :class:`StreamHandler`.
uk: Вказує, що буде створено :class:`FileHandler`, використовуючи вказане ім’я файлу, а не :class:`StreamHandler`.

source: *filemode*
uk: *файловий режим*

source: If *filename* is specified, open the file in this :ref:`mode <filemodes>`. Defaults to ``'a'``.
uk: Якщо вказано *ім’я файлу*, відкрийте файл у цьому :ref:`режимі <filemodes>`. За замовчуванням ``'a''``.

source: *format*
uk: *формат*

source: Use the specified format string for the handler. Defaults to attributes ``levelname``, ``name`` and ``message`` separated by colons.
uk: Використовуйте вказаний рядок формату для обробника. За замовчуванням атрибути ``levelname``, ``name`` і ``message``, розділені двокрапками.

source: Use the specified date/time format, as accepted by :func:`time.strftime`.
uk: Використовуйте вказаний формат дати/часу, прийнятний :func:`time.strftime`.

source: *style*
uk: *стиль*

source: If *format* is specified, use this style for the format string. One of ``'%'``, ``'{'`` or ``'$'`` for :ref:`printf-style <old-string-formatting>`, :meth:`str.format` or :class:`string.Template` respectively. Defaults to ``'%'``.
uk: Якщо вказано *format*, використовуйте цей стиль для рядка формату. Один із ``'%'``, ``'{'`` або ``'$'`` для :ref:`printf-style <old-string-formatting>`, :meth:`str.format` або :class:`string .Template` відповідно. За замовчуванням ``'%''``.

source: *level*
uk: *рівень*

source: Set the root logger level to the specified :ref:`level <levels>`.
uk: Встановіть рівень кореневого реєстратора на вказаний :ref:`level <levels>`.

source: *stream*
uk: *потік*

source: Use the specified stream to initialize the :class:`StreamHandler`. Note that this argument is incompatible with *filename* - if both are present, a ``ValueError`` is raised.
uk: Використовуйте вказаний потік для ініціалізації :class:`StreamHandler`. Зауважте, що цей аргумент несумісний з *ім’ям файлу* – якщо присутні обидва, виникає помилка "ValueError".

source: *handlers*
uk: *обробники*

source: If specified, this should be an iterable of already created handlers to add to the root logger. Any handlers which don't already have a formatter set will be assigned the default formatter created in this function. Note that this argument is incompatible with *filename* or *stream* - if both are present, a ``ValueError`` is raised.
uk: Якщо вказано, це має бути ітерація вже створених обробників для додавання до кореневого реєстратора. Усім обробникам, які ще не мають встановленого форматера, буде призначено стандартний форматер, створений у цій функції. Зауважте, що цей аргумент несумісний з *filename* або *stream* - якщо обидва присутні, виникає помилка ValueError.

source: *force*
uk: *сила*

source: If this keyword argument is specified as true, any existing handlers attached to the root logger are removed and closed, before carrying out the configuration as specified by the other arguments.
uk: Якщо цей аргумент ключового слова вказано як true, будь-які існуючі обробники, приєднані до кореневого реєстратора, видаляються та закриваються перед виконанням конфігурації, як зазначено іншими аргументами.

source: *encoding*
uk: *кодування*

source: If this keyword argument is specified along with *filename*, its value is used when the :class:`FileHandler` is created, and thus used when opening the output file.
uk: Якщо цей аргумент ключового слова вказано разом із *filename*, його значення використовується під час створення :class:`FileHandler` і, таким чином, використовується під час відкриття вихідного файлу.

source: *errors*
uk: *помилки*

source: If this keyword argument is specified along with *filename*, its value is used when the :class:`FileHandler` is created, and thus used when opening the output file. If not specified, the value 'backslashreplace' is used. Note that if ``None`` is specified, it will be passed as such to :func:`open`, which means that it will be treated the same as passing 'errors'.
uk: Якщо цей аргумент ключового слова вказано разом із *filename*, його значення використовується під час створення :class:`FileHandler` і, таким чином, використовується під час відкриття вихідного файлу. Якщо не вказано, використовується значення "backslashreplace". Зауважте, що якщо вказано ``None``, воно буде передано як таке до :func:`open`, що означає, що воно розглядатиметься так само, як передача 'errors'.

source: The *style* argument was added.
uk: Додано аргумент *style*.

source: The *handlers* argument was added. Additional checks were added to catch situations where incompatible arguments are specified (e.g. *handlers* together with *stream* or *filename*, or *stream* together with *filename*).
uk: Додано аргумент *обробники*. Було додано додаткові перевірки для виявлення ситуацій, коли вказано несумісні аргументи (наприклад, *обробники* разом із *потоком* або *ім’ям файлу*, або *потік* разом із *ім’ям файлу*).

source: The *force* argument was added.
uk: Додано аргумент *force*.

source: The *encoding* and *errors* arguments were added.
uk: Додано аргументи *encoding* і *errors*.

source: Informs the logging system to perform an orderly shutdown by flushing and closing all handlers. This should be called at application exit and no further use of the logging system should be made after this call.
uk: Повідомляє системі журналювання виконати впорядковане завершення роботи шляхом очищення та закриття всіх обробників. Це слід викликати під час виходу з програми, і після цього виклику не слід використовувати систему журналювання.

source: When the logging module is imported, it registers this function as an exit handler (see :mod:`atexit`), so normally there's no need to do that manually.
uk: Коли модуль журналювання імпортовано, він реєструє цю функцію як обробник виходу (див. :mod:`atexit`), тому зазвичай немає потреби робити це вручну.

source: Tells the logging system to use the class *klass* when instantiating a logger. The class should define :meth:`__init__` such that only a name argument is required, and the :meth:`__init__` should call :meth:`Logger.__init__`. This function is typically called before any loggers are instantiated by applications which need to use custom logger behavior. After this call, as at any other time, do not instantiate loggers directly using the subclass: continue to use the :func:`logging.getLogger` API to get your loggers.
uk: Вказує системі ведення журналу використовувати клас *klass* під час створення екземпляра реєстратора. Клас має визначати :meth:`__init__` таким чином, щоб потрібен був лише аргумент імені, а :meth:`__init__` має викликати :meth:`Logger.__init__`. Ця функція зазвичай викликається перед створенням будь-яких реєстраторів програмами, які потребують використання власної поведінки реєстратора. Після цього виклику, як і в будь-який інший час, не створюйте екземпляри реєстраторів безпосередньо за допомогою підкласу: продовжуйте використовувати :func:`logging.getLogger` API, щоб отримати свої журнали.

source: Set a callable which is used to create a :class:`LogRecord`.
uk: Встановіть виклик, який використовується для створення :class:`LogRecord`.

source: The factory callable to be used to instantiate a log record.
uk: Фабричний виклик, який буде використано для створення екземпляра запису журналу.

source: This function has been provided, along with :func:`getLogRecordFactory`, to allow developers more control over how the :class:`LogRecord` representing a logging event is constructed.
uk: Цю функцію було надано разом із :func:`getLogRecordFactory`, щоб дозволити розробникам більше контролювати те, як створюється :class:`LogRecord`, що представляє подію журналювання.

source: The factory has the following signature:
uk: Завод має такий підпис:

source: The logger name.
uk: Ім'я реєстратора.

source: level
uk: рівень

source: The logging level (numeric).
uk: Рівень журналювання (числовий).

source: fn
uk: фн

source: The full pathname of the file where the logging call was made.
uk: Повний шлях до файлу, у якому було здійснено виклик журналювання.

source: lno
uk: льно

source: The line number in the file where the logging call was made.
uk: Номер рядка у файлі, де було здійснено виклик журналювання.

source: The logging message.
uk: Повідомлення реєстрації.

source: The arguments for the logging message.
uk: Аргументи для повідомлення журналу.
