Repository: python/python-docs-uk
Catalog: library/lzma.po
Languages: uk

source: **Source code:** :source:`Lib/lzma.py`
uk: **Вихідний код:** :source:`Lib/lzma.py`

source: This module provides classes and convenience functions for compressing and decompressing data using the LZMA compression algorithm. Also included is a file interface supporting the ``.xz`` and legacy ``.lzma`` file formats used by the :program:`xz` utility, as well as raw compressed streams.
uk: Цей модуль надає класи та зручні функції для стиснення та розпакування даних за допомогою алгоритму стиснення LZMA. Також включено файловий інтерфейс, що підтримує формати файлів ``.xz`` і застарілі ``.lzma``, які використовуються утилітою :program:`xz`, а також необроблені стиснені потоки.

source: The interface provided by this module is very similar to that of the :mod:`bz2` module. Note that :class:`LZMAFile` and :class:`bz2.BZ2File` are *not* thread-safe, so if you need to use a single :class:`LZMAFile` instance from multiple threads, it is necessary to protect it with a lock.
uk: Інтерфейс цього модуля дуже схожий на інтерфейс модуля :mod:`bz2`. Зауважте, що :class:`LZMAFile` і :class:`bz2.BZ2File` *не* потокобезпечні, тому, якщо вам потрібно використовувати один екземпляр :class:`LZMAFile` з кількох потоків, його необхідно захистити з замком.

source: This exception is raised when an error occurs during compression or decompression, or while initializing the compressor/decompressor state.
uk: Цей виняток виникає, коли виникає помилка під час стиснення чи розпакування або під час ініціалізації стану компресора/декомпресора.

source: Reading and writing compressed files
uk: Читання та запис стиснутих файлів

source: Open an LZMA-compressed file in binary or text mode, returning a :term:`file object`.
uk: Відкрийте файл, стиснутий за допомогою LZMA, у двійковому або текстовому режимі, повертаючи :term:`file object`.

source: The *filename* argument can be either an actual file name (given as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object), in which case the named file is opened, or it can be an existing file object to read from or write to.
uk: Аргументом *filename* може бути або фактичне ім’я файлу (надане як об’єкт :class:`str`, :class:`bytes` або :term:`path-like <path-like object>`), у такому випадку відкривається названий файл або це може бути існуючий файловий об’єкт для читання або запису.

source: The *mode* argument can be any of ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` or ``"ab"`` for binary mode, or ``"rt"``, ``"wt"``, ``"xt"``, or ``"at"`` for text mode. The default is ``"rb"``.
uk: Аргумент *mode* може бути будь-яким із ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` або ``"ab"`` для двійкового режиму, або ``"rt"``, ``"wt"``, ``"xt"`` або ``"at"`` для текстового режиму. Типовим є ``"rb"``.

source: When opening a file for reading, the *format* and *filters* arguments have the same meanings as for :class:`LZMADecompressor`. In this case, the *check* and *preset* arguments should not be used.
uk: Під час відкриття файлу для читання аргументи *format* і *filters* мають такі ж значення, як і для :class:`LZMADecompressor`. У цьому випадку аргументи *check* і *preset* не повинні використовуватися.

source: When opening a file for writing, the *format*, *check*, *preset* and *filters* arguments have the same meanings as for :class:`LZMACompressor`.
uk: Під час відкриття файлу для запису аргументи *format*, *check*, *preset* і *filters* мають таке ж значення, як і для :class:`LZMACompressor`.

source: For binary mode, this function is equivalent to the :class:`LZMAFile` constructor: ``LZMAFile(filename, mode, ...)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
uk: Для бінарного режиму ця функція еквівалентна конструктору :class:`LZMAFile`: ``LZMAFile(filename, mode, ...)``. У цьому випадку аргументи *encoding*, *errors* і *newline* не повинні надаватися.

source: For text mode, a :class:`LZMAFile` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
uk: Для текстового режиму створюється об’єкт :class:`LZMAFile`, який загортається в екземпляр :class:`io.TextIOWrapper` із вказаним кодуванням, поведінкою обробки помилок і закінченнями рядків.

source: Added support for the ``"x"``, ``"xb"`` and ``"xt"`` modes.
uk: Додано підтримку режимів ``"x"``, ``"xb"`` і ``"xt"``.

source: Accepts a :term:`path-like object`.
uk: Приймає :term:`path-like object`.

source: Open an LZMA-compressed file in binary mode.
uk: Відкрийте файл, стиснутий за допомогою LZMA, у двійковому режимі.

source: An :class:`LZMAFile` can wrap an already-open :term:`file object`, or operate directly on a named file. The *filename* argument specifies either the file object to wrap, or the name of the file to open (as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object). When wrapping an existing file object, the wrapped file will not be closed when the :class:`LZMAFile` is closed.
uk: :class:`LZMAFile` може обернути вже відкритий :term:`file object` або працювати безпосередньо з іменованим файлом. Аргумент *filename* визначає або об’єкт файлу, який потрібно обернути, або ім’я файлу, який потрібно відкрити (як об’єкт :class:`str`, :class:`bytes` або :term:`path-like <path-like object>`). Під час обгортання існуючого файлового об’єкта обернутий файл не буде закрито, коли закрито :class:`LZMAFile`.

source: The *mode* argument can be either ``"r"`` for reading (default), ``"w"`` for overwriting, ``"x"`` for exclusive creation, or ``"a"`` for appending. These can equivalently be given as ``"rb"``, ``"wb"``, ``"xb"`` and ``"ab"`` respectively.
uk: Аргументом *mode* може бути ``"r"`` для читання (за замовчуванням), ``"w"`` для перезапису, ``"x"`` для ексклюзивного створення або ``"a"`` для додавання. Їх можна еквівалентно подати як ``"rb"``, ``"wb"``, ``"xb"`` і ``"ab"`` відповідно.

source: If *filename* is a file object (rather than an actual file name), a mode of ``"w"`` does not truncate the file, and is instead equivalent to ``"a"``.
uk: Якщо *filename* є файловим об’єктом (а не справжнім ім’ям файлу), режим ``"w"`` не скорочує файл, а замість цього еквівалентний ``"a"``.

source: When opening a file for reading, the input file may be the concatenation of multiple separate compressed streams. These are transparently decoded as a single logical stream.
uk: Під час відкриття файлу для читання вхідний файл може бути конкатенацією кількох окремих стиснутих потоків. Вони прозоро декодуються як єдиний логічний потік.

source: Return buffered data without advancing the file position. At least one byte of data will be returned, unless EOF has been reached. The exact number of bytes returned is unspecified (the *size* argument is ignored).
uk: Повернути буферизовані дані без просування позиції файлу. Принаймні один байт даних буде повернуто, якщо не досягнуто EOF. Точна кількість повернутих байтів не вказана (аргумент *size* ігнорується).

source: While calling :meth:`peek` does not change the file position of the :class:`LZMAFile`, it may change the position of the underlying file object (e.g. if the :class:`LZMAFile` was constructed by passing a file object for *filename*).
uk: Хоча виклик :meth:`peek` не змінює позицію файлу :class:`LZMAFile`, він може змінити позицію основного файлового об’єкта (наприклад, якщо :class:`LZMAFile` було створено шляхом передачі файлового об’єкта для *ім'я файлу*).

source: Added support for the ``"x"`` and ``"xb"`` modes.
uk: Додано підтримку режимів ``"x"`` і ``"xb"``.

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
uk: Метод :meth:`~io.BufferedIOBase.read` тепер приймає аргумент ``None``.

source: Compressing and decompressing data in memory
uk: Стиснення та розпакування даних у пам'яті

source: Create a compressor object, which can be used to compress data incrementally.
uk: Створіть об’єкт компресора, який можна використовувати для поступового стиснення даних.

source: For a more convenient way of compressing a single chunk of data, see :func:`compress`.
uk: Для більш зручного способу стиснення окремої частини даних див. :func:`compress`.

source: The *format* argument specifies what container format should be used. Possible values are:
uk: Аргумент *format* визначає, який формат контейнера слід використовувати. Можливі значення:

source: :const:`FORMAT_XZ`: The ``.xz`` container format.
uk: :const:`FORMAT_XZ`: Формат контейнера ``.xz``.

source: This is the default format.
uk: Це стандартний формат.

source: :const:`FORMAT_ALONE`: The legacy ``.lzma`` container format.
uk: :const:`FORMAT_ALONE`: Застарілий формат контейнера ``.lzma``.

source: This format is more limited than ``.xz`` -- it does not support integrity checks or multiple filters.
uk: Цей формат є більш обмеженим, ніж ``.xz`` - він не підтримує перевірку цілісності або кілька фільтрів.

source: :const:`FORMAT_RAW`: A raw data stream, not using any container format.
uk: :const:`FORMAT_RAW`: Потік необроблених даних без використання формату контейнера.

source: This format specifier does not support integrity checks, and requires that you always specify a custom filter chain (for both compression and decompression). Additionally, data compressed in this manner cannot be decompressed using :const:`FORMAT_AUTO` (see :class:`LZMADecompressor`).
uk: Цей специфікатор формату не підтримує перевірки цілісності та вимагає, щоб ви завжди вказували настроюваний ланцюжок фільтрів (як для стиснення, так і для розпакування). Крім того, дані, стиснуті таким чином, не можна розпакувати за допомогою :const:`FORMAT_AUTO` (див. :class:`LZMADecompressor`).

source: The *check* argument specifies the type of integrity check to include in the compressed data. This check is used when decompressing, to ensure that the data has not been corrupted. Possible values are:
uk: Аргумент *check* визначає тип перевірки цілісності, який слід включити до стиснутих даних. Ця перевірка використовується під час розпакування, щоб переконатися, що дані не пошкоджено. Можливі значення:

source: :const:`CHECK_NONE`: No integrity check. This is the default (and the only acceptable value) for :const:`FORMAT_ALONE` and :const:`FORMAT_RAW`.
uk: :const:`CHECK_NONE`: Без перевірки цілісності. Це стандартне (і єдине прийнятне значення) для :const:`FORMAT_ALONE` і :const:`FORMAT_RAW`.

source: :const:`CHECK_CRC32`: 32-bit Cyclic Redundancy Check.
uk: :const:`CHECK_CRC32`: 32-розрядна циклічна перевірка надмірності.

source: :const:`CHECK_CRC64`: 64-bit Cyclic Redundancy Check. This is the default for :const:`FORMAT_XZ`.
uk: :const:`CHECK_CRC64`: 64-бітна циклічна перевірка надмірності. Це типове значення для :const:`FORMAT_XZ`.

source: :const:`CHECK_SHA256`: 256-bit Secure Hash Algorithm.
uk: :const:`CHECK_SHA256`: 256-бітний безпечний алгоритм хешування.

source: If the specified check is not supported, an :class:`LZMAError` is raised.
uk: Якщо зазначена перевірка не підтримується, виникає :class:`LZMAError`.

source: The compression settings can be specified either as a preset compression level (with the *preset* argument), or in detail as a custom filter chain (with the *filters* argument).
uk: Параметри стиснення можна вказати або як попередньо встановлений рівень стиснення (за допомогою аргументу *preset*), або детально як спеціальний ланцюжок фільтрів (за допомогою аргументу *filters*).

source: The *preset* argument (if provided) should be an integer between ``0`` and ``9`` (inclusive), optionally OR-ed with the constant :const:`PRESET_EXTREME`. If neither *preset* nor *filters* are given, the default behavior is to use :const:`PRESET_DEFAULT` (preset level ``6``). Higher presets produce smaller output, but make the compression process slower.
uk: Аргумент *preset* (якщо надано) має бути цілим числом від ``0`` до ``9`` (включно), необов’язково через АБО з константою :const:`PRESET_EXTREME`. Якщо ні *попереднє налаштування*, ні *фільтри* не вказано, поведінка за замовчуванням полягає у використанні :const:`PRESET_DEFAULT` (рівень попереднього налаштування ``6``). Більш високі налаштування дають менший вихід, але сповільнюють процес стиснення.

source: In addition to being more CPU-intensive, compression with higher presets also requires much more memory (and produces output that needs more memory to decompress). With preset ``9`` for example, the overhead for an :class:`LZMACompressor` object can be as high as 800 MiB. For this reason, it is generally best to stick with the default preset.
uk: Окрім того, що стиснення з вищими попередніми настройками вимагає більшого навантаження на ЦП, воно також потребує набагато більше пам’яті (і створює вивід, для розпакування якого потрібно більше пам’яті). Наприклад, із заданим значенням ``9`` накладні витрати для об’єкта :class:`LZMACompressor` можуть сягати 800 МіБ. З цієї причини, як правило, краще дотримуватися попереднього налаштування за замовчуванням.

source: The *filters* argument (if provided) should be a filter chain specifier. See :ref:`filter-chain-specs` for details.
uk: Аргумент *filters* (якщо надається) має бути специфікатором ланцюжка фільтрів. Дивіться :ref:`filter-chain-specs` для деталей.

source: Compress *data* (a :class:`bytes` object), returning a :class:`bytes` object containing compressed data for at least part of the input. Some of *data* may be buffered internally, for use in later calls to :meth:`compress` and :meth:`flush`. The returned data should be concatenated with the output of any previous calls to :meth:`compress`.
uk: Стиснути *дані* (об’єкт :class:`bytes`), повертаючи об’єкт :class:`bytes`, що містить стислі дані принаймні для частини вхідних даних. Деякі з *даних* можуть буферизуватися усередині для використання в наступних викликах :meth:`compress` і :meth:`flush`. Повернуті дані мають бути об’єднані з результатами будь-яких попередніх викликів :meth:`compress`.

source: Finish the compression process, returning a :class:`bytes` object containing any data stored in the compressor's internal buffers.
uk: Завершіть процес стиснення, повернувши об’єкт :class:`bytes`, що містить будь-які дані, що зберігаються у внутрішніх буферах компресора.

source: The compressor cannot be used after this method has been called.
uk: Компресор не можна використовувати після виклику цього методу.

source: Create a decompressor object, which can be used to decompress data incrementally.
uk: Створіть об’єкт декомпресії, який можна використовувати для поступового розпакування даних.

source: For a more convenient way of decompressing an entire compressed stream at once, see :func:`decompress`.
uk: Для більш зручного способу розпакування всього стисненого потоку одночасно див. :func:`decompress`.

source: The *format* argument specifies the container format that should be used. The default is :const:`FORMAT_AUTO`, which can decompress both ``.xz`` and ``.lzma`` files. Other possible values are :const:`FORMAT_XZ`, :const:`FORMAT_ALONE`, and :const:`FORMAT_RAW`.
uk: Аргумент *format* визначає формат контейнера, який слід використовувати. Типовим є :const:`FORMAT_AUTO`, який може розпакувати як файли ``.xz``, так і ``.lzma``. Інші можливі значення: :const:`FORMAT_XZ`, :const:`FORMAT_ALONE` і :const:`FORMAT_RAW`.

source: The *memlimit* argument specifies a limit (in bytes) on the amount of memory that the decompressor can use. When this argument is used, decompression will fail with an :class:`LZMAError` if it is not possible to decompress the input within the given memory limit.
uk: Аргумент *memlimit* визначає обмеження (у байтах) на обсяг пам’яті, який може використовувати розпаковувач. Коли цей аргумент використовується, декомпресія буде невдалою з :class:`LZMAError`, якщо неможливо розпакувати вхідні дані в межах заданого ліміту пам’яті.

source: The *filters* argument specifies the filter chain that was used to create the stream being decompressed. This argument is required if *format* is :const:`FORMAT_RAW`, but should not be used for other formats. See :ref:`filter-chain-specs` for more information about filter chains.
uk: Аргумент *filters* визначає ланцюжок фільтрів, який використовувався для створення потоку, що розпаковується. Цей аргумент є обов’язковим, якщо *format* має значення :const:`FORMAT_RAW`, але його не слід використовувати для інших форматів. Перегляньте :ref:`filter-chain-specs` для отримання додаткової інформації про ланцюги фільтрів.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`LZMAFile`. To decompress a multi-stream input with :class:`LZMADecompressor`, you must create a new decompressor for each stream.
uk: Цей клас не обробляє прозоро вхідні дані, що містять кілька стиснутих потоків, на відміну від :func:`decompress` і :class:`LZMAFile`. Щоб розпакувати багатопотоковий вхід за допомогою :class:`LZMADecompressor`, ви повинні створити новий розпаковувач для кожного потоку.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
uk: Розпакуйте *дані* (:term:`bytes-like object`), повертаючи нестиснуті дані у вигляді байтів. Деякі з *даних* можуть бути збережені у внутрішньому буфері для використання в подальших викликах :meth:`decompress`. Повернуті дані мають бути об’єднані з результатами будь-яких попередніх викликів :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
uk: Якщо *max_length* є невід’ємним, повертає щонайбільше *max_length* байтів розпакованих даних. Якщо цей ліміт буде досягнуто, і буде створено подальший вихід, атрибут :attr:`~.needs_input` буде встановлено на ``False``. У цьому випадку наступний виклик :meth:`~.decompress` може надати *data* як ``b''``, щоб отримати більше вихідних даних.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
uk: Якщо всі вхідні дані було розпаковано та повернуто (або через те, що вони були меншими за *max_length* байтів, або через те, що *max_length* було від’ємним), для атрибута :attr:`~.needs_input` буде встановлено значення ``True`` .

source: Added the *max_length* parameter.
uk: Додано параметр *max_length*.

source: The ID of the integrity check used by the input stream. This may be :const:`CHECK_UNKNOWN` until enough of the input has been decoded to determine what integrity check it uses.
uk: Ідентифікатор перевірки цілісності, який використовується вхідним потоком. Це може бути :const:`CHECK_UNKNOWN`, поки не буде декодовано достатньо вхідних даних, щоб визначити, яку перевірку цілісності він використовує.

source: ``True`` if the end-of-stream marker has been reached.
uk: ``True``, якщо досягнуто маркера кінця потоку.

source: Data found after the end of the compressed stream.
uk: Дані знайдено після закінчення стисненого потоку.

source: Before the end of the stream is reached, this will be ``b""``.
uk: До кінця потоку це буде ``b""``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
uk: ``False``, якщо метод :meth:`.decompress` може надати більше розпакованих даних перед запитом нового нестисненого введення.

source: Compress *data* (a :class:`bytes` object), returning the compressed data as a :class:`bytes` object.
uk: Стискати *data* (об’єкт :class:`bytes`), повертаючи стислі дані як об’єкт :class:`bytes`.

source: See :class:`LZMACompressor` above for a description of the *format*, *check*, *preset* and *filters* arguments.
uk: Перегляньте :class:`LZMACompressor` вище для опису аргументів *format*, *check*, *preset* і *filters*.

source: Decompress *data* (a :class:`bytes` object), returning the uncompressed data as a :class:`bytes` object.
uk: Розархівуйте *data* (об’єкт :class:`bytes`), повертаючи нестиснуті дані як об’єкт :class:`bytes`.

source: If *data* is the concatenation of multiple distinct compressed streams, decompress all of these streams, and return the concatenation of the results.
uk: Якщо *data* є конкатенацією кількох окремих стиснутих потоків, розпакуйте всі ці потоки та поверніть конкатенацію результатів.

source: See :class:`LZMADecompressor` above for a description of the *format*, *memlimit* and *filters* arguments.
uk: Перегляньте :class:`LZMADecompressor` вище для опису аргументів *format*, *memlimit* і *filters*.

source: Miscellaneous
uk: Різне

source: Return ``True`` if the given integrity check is supported on this system.
uk: Повертає ``True``, якщо ця перевірка цілісності підтримується цією системою.

source: :const:`CHECK_NONE` and :const:`CHECK_CRC32` are always supported. :const:`CHECK_CRC64` and :const:`CHECK_SHA256` may be unavailable if you are using a version of :program:`liblzma` that was compiled with a limited feature set.
uk: :const:`CHECK_NONE` і :const:`CHECK_CRC32` підтримуються завжди. :const:`CHECK_CRC64` і :const:`CHECK_SHA256` можуть бути недоступні, якщо ви використовуєте версію :program:`liblzma`, яка була скомпільована з обмеженим набором функцій.

source: Specifying custom filter chains
uk: Визначення власних ланцюжків фільтрів

source: A filter chain specifier is a sequence of dictionaries, where each dictionary contains the ID and options for a single filter. Each dictionary must contain the key ``"id"``, and may contain additional keys to specify filter-dependent options. Valid filter IDs are as follows:
uk: Специфікатор ланцюжка фільтрів — це послідовність словників, де кожен словник містить ідентифікатор і параметри для одного фільтра. Кожен словник має містити ключ ``"id"`` і може містити додаткові ключі для визначення залежних від фільтрів параметрів. Дійсні ідентифікатори фільтрів:

source: Compression filters:
uk: Компресійні фільтри:

source: :const:`FILTER_LZMA1` (for use with :const:`FORMAT_ALONE`)
uk: :const:`FILTER_LZMA1` (для використання з :const:`FORMAT_ALONE`)

source: :const:`FILTER_LZMA2` (for use with :const:`FORMAT_XZ` and :const:`FORMAT_RAW`)
uk: :const:`FILTER_LZMA2` (для використання з :const:`FORMAT_XZ` і :const:`FORMAT_RAW`)

source: Delta filter:
uk: Дельта-фільтр:

source: Branch-Call-Jump (BCJ) filters:
uk: Фільтри Branch-Call-Jump (BCJ):

source: A filter chain can consist of up to 4 filters, and cannot be empty. The last filter in the chain must be a compression filter, and any other filters must be delta or BCJ filters.
uk: Ланцюг фільтрів може складатися з 4 фільтрів і не може бути порожнім. Останній фільтр у ланцюжку має бути фільтром стиснення, а будь-які інші фільтри мають бути фільтрами дельта або BCJ.

source: Compression filters support the following options (specified as additional entries in the dictionary representing the filter):
uk: Фільтри стиснення підтримують такі параметри (зазначені як додаткові записи в словнику, що представляє фільтр):

source: ``preset``: A compression preset to use as a source of default values for options that are not specified explicitly.
uk: ``попереднє налаштування``: Попереднє налаштування стиснення, яке використовується як джерело значень за замовчуванням для параметрів, які не вказані явно.
