Repository: python/python-docs-uk
Catalog: library/lzma.po
Languages: uk

source: ``dict_size``: Dictionary size in bytes. This should be between 4 KiB and 1.5 GiB (inclusive).
uk: ``dict_size``: розмір словника в байтах. Це має бути від 4 КіБ до 1,5 ГіБ (включно).

source: ``lc``: Number of literal context bits.
uk: ``lc``: кількість літеральних бітів контексту.

source: ``lp``: Number of literal position bits. The sum ``lc + lp`` must be at most 4.
uk: ``lp``: кількість літеральних бітів позиції. Сума "lc + lp" має бути не більше 4.

source: ``pb``: Number of position bits; must be at most 4.
uk: ``pb``: кількість бітів позиції; повинно бути не більше 4.

source: ``mode``: :const:`MODE_FAST` or :const:`MODE_NORMAL`.
uk: ``режим``: :const:`MODE_FAST` або :const:`MODE_NORMAL`.

source: ``nice_len``: What should be considered a "nice length" for a match. This should be 273 or less.
uk: ``nice_len``: що слід вважати "гарною довжиною" для збігу. Це має бути 273 або менше.

source: ``mf``: What match finder to use -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3`, or :const:`MF_BT4`.
uk: ``mf``: Який засіб пошуку збігів використовувати -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3` або :const:`MF_BT4`.

source: ``depth``: Maximum search depth used by match finder. 0 (default) means to select automatically based on other filter options.
uk: ``depth``: максимальна глибина пошуку, яка використовується шукачем збігів. 0 (за замовчуванням) означає автоматичний вибір на основі інших параметрів фільтра.

source: The delta filter stores the differences between bytes, producing more repetitive input for the compressor in certain circumstances. It supports one option, ``dist``. This indicates the distance between bytes to be subtracted. The default is 1, i.e. take the differences between adjacent bytes.
uk: Дельта-фільтр зберігає відмінності між байтами, створюючи більш повторювані вхідні дані для компресора за певних обставин. Він підтримує один параметр, ``dist``. Це вказує на відстань між байтами, які потрібно відняти. За замовчуванням 1, тобто беруться різниці між сусідніми байтами.

source: The BCJ filters are intended to be applied to machine code. They convert relative branches, calls and jumps in the code to use absolute addressing, with the aim of increasing the redundancy that can be exploited by the compressor. These filters support one option, ``start_offset``. This specifies the address that should be mapped to the beginning of the input data. The default is 0.
uk: Фільтри BCJ призначені для застосування до машинного коду. Вони перетворюють відносні розгалуження, виклики та переходи в коді на використання абсолютної адресації з метою збільшення надмірності, яку може використовувати компресор. Ці фільтри підтримують один параметр, ``start_offset``. Це вказує адресу, яку слід відобразити на початку вхідних даних. За замовчуванням 0.

source: Examples
uk: Приклади

source: Reading in a compressed file::
uk: Читання у стисненому файлі::

source: Creating a compressed file::
uk: Створення стисненого файлу::

source: Compressing data in memory::
uk: Стиснення даних у пам'яті:

source: Incremental compression::
uk: Поступове стиснення::

source: Writing compressed data to an already-open file::
uk: Запис стислих даних у вже відкритий файл::

source: Creating a compressed file using a custom filter chain::
uk: Створення стисненого файлу за допомогою спеціального ланцюжка фільтрів::
