Repository: python/python-docs-uk
Catalog: library/mailbox.po
Languages: uk

source: :mod:`mailbox` --- Manipulate mailboxes in various formats
uk: :mod:`mailbox` --- Керуйте поштовими скриньками в різних форматах

source: **Source code:** :source:`Lib/mailbox.py`
uk: **Вихідний код:** :source:`Lib/mailbox.py`

source: This module defines two classes, :class:`Mailbox` and :class:`Message`, for accessing and manipulating on-disk mailboxes and the messages they contain. :class:`Mailbox` offers a dictionary-like mapping from keys to messages. :class:`Message` extends the :mod:`email.message` module's :class:`~email.message.Message` class with format-specific state and behavior. Supported mailbox formats are Maildir, mbox, MH, Babyl, and MMDF.
uk: Цей модуль визначає два класи, :class:`Mailbox` і :class:`Message`, для доступу до поштових скриньок на диску та маніпулювання ними та повідомленнями, які вони містять. :class:`Mailbox` пропонує відображення ключів у повідомленнях, подібне до словника. :class:`Message` розширює клас :class:`~email.message.Message` модуля :mod:`email.message` за допомогою стану та поведінки, що залежать від формату. Підтримувані формати поштових скриньок: Maildir, mbox, MH, Babyl і MMDF.

source: Module :mod:`email`
uk: Модуль :mod:`email`

source: Represent and manipulate messages.
uk: Представляти та маніпулювати повідомленнями.

source: :class:`Mailbox` objects
uk: :class:`Mailbox`

source: A mailbox, which may be inspected and modified.
uk: Поштова скринька, яку можна перевірити та змінити.

source: The :class:`Mailbox` class defines an interface and is not intended to be instantiated. Instead, format-specific subclasses should inherit from :class:`Mailbox` and your code should instantiate a particular subclass.
uk: Клас :class:`Mailbox` визначає інтерфейс і не призначений для створення екземплярів. Замість цього підкласи, що стосуються певного формату, повинні успадковуватись від :class:`Mailbox`, і ваш код має створити екземпляр певного підкласу.

source: The :class:`Mailbox` interface is dictionary-like, with small keys corresponding to messages. Keys are issued by the :class:`Mailbox` instance with which they will be used and are only meaningful to that :class:`Mailbox` instance. A key continues to identify a message even if the corresponding message is modified, such as by replacing it with another message.
uk: Інтерфейс :class:`Mailbox` подібний до словника, з маленькими клавішами, що відповідають повідомленням. Ключі видаються екземпляром :class:`Mailbox`, з яким вони використовуватимуться, і мають значення лише для цього екземпляра :class:`Mailbox`. Ключ продовжує ідентифікувати повідомлення, навіть якщо відповідне повідомлення змінено, наприклад, замінивши його іншим повідомленням.

source: Messages may be added to a :class:`Mailbox` instance using the set-like method :meth:`add` and removed using a ``del`` statement or the set-like methods :meth:`remove` and :meth:`discard`.
uk: Повідомлення можна додавати до екземпляра :class:`Mailbox` за допомогою методу set-like :meth:`add` і видаляти за допомогою оператора ``del`` або методів set-подібних :meth:`remove` і :meth:`discard`.

source: :class:`Mailbox` interface semantics differ from dictionary semantics in some noteworthy ways. Each time a message is requested, a new representation (typically a :class:`Message` instance) is generated based upon the current state of the mailbox. Similarly, when a message is added to a :class:`Mailbox` instance, the provided message representation's contents are copied. In neither case is a reference to the message representation kept by the :class:`Mailbox` instance.
uk: Семантика інтерфейсу :class:`Mailbox` відрізняється від семантики словника декількома важливими способами. Кожного разу, коли запитується повідомлення, генерується нове представлення (зазвичай екземпляр :class:`Message`) на основі поточного стану поштової скриньки. Подібним чином, коли повідомлення додається до екземпляра :class:`Mailbox`, надане представлення вмісту повідомлення копіюється. У жодному випадку посилання на представлення повідомлення не зберігається екземпляром :class:`Mailbox`.

source: The default :class:`Mailbox` iterator iterates over message representations, not keys as the default dictionary iterator does. Moreover, modification of a mailbox during iteration is safe and well-defined. Messages added to the mailbox after an iterator is created will not be seen by the iterator. Messages removed from the mailbox before the iterator yields them will be silently skipped, though using a key from an iterator may result in a :exc:`KeyError` exception if the corresponding message is subsequently removed.
uk: Ітератор :class:`Mailbox` за замовчуванням перебирає представлення повідомлень, а не ключі, як це робить ітератор словника за замовчуванням. Крім того, модифікація поштової скриньки під час ітерації є безпечною та чітко визначеною. Повідомлення, додані до поштової скриньки після створення ітератора, не бачитимуться ітератором. Повідомлення, видалені з поштової скриньки до того, як ітератор видасть їх, будуть мовчки пропущені, хоча використання ключа з ітератора може призвести до винятку :exc:`KeyError`, якщо відповідне повідомлення згодом буде видалено.

source: Be very cautious when modifying mailboxes that might be simultaneously changed by some other process. The safest mailbox format to use for such tasks is Maildir; try to avoid using single-file formats such as mbox for concurrent writing. If you're modifying a mailbox, you *must* lock it by calling the :meth:`lock` and :meth:`unlock` methods *before* reading any messages in the file or making any changes by adding or deleting a message. Failing to lock the mailbox runs the risk of losing messages or corrupting the entire mailbox.
uk: Будьте дуже обережні, змінюючи поштові скриньки, які можуть бути одночасно змінені іншим процесом. Найбезпечнішим форматом поштової скриньки для таких завдань є Maildir; намагайтеся уникати використання однофайлових форматів, таких як mbox, для одночасного запису. Якщо ви змінюєте поштову скриньку, ви *має* заблокувати її, викликавши методи :meth:`lock` і :meth:`unlock` *перед* читанням будь-яких повідомлень у файлі або внесенням будь-яких змін шляхом додавання чи видалення повідомлення . Якщо поштову скриньку не заблокувати, існує ризик втрати повідомлень або пошкодження всієї поштової скриньки.

source: :class:`Mailbox` instances have the following methods:
uk: Екземпляри :class:`Mailbox` мають такі методи:

source: Add *message* to the mailbox and return the key that has been assigned to it.
uk: Додайте *повідомлення* до поштової скриньки та поверніть призначений їй ключ.

source: Parameter *message* may be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, a byte string, or a file-like object (which should be open in binary mode). If *message* is an instance of the appropriate format-specific :class:`Message` subclass (e.g., if it's an :class:`mboxMessage` instance and this is an :class:`mbox` instance), its format-specific information is used. Otherwise, reasonable defaults for format-specific information are used.
uk: Параметр *message* може бути екземпляром :class:`Message`, екземпляром :class:`email.message.Message`, рядком, рядком байтів або файлоподібним об’єктом (який має бути відкритий у двійковому режимі) . Якщо *message* є екземпляром відповідного підкласу :class:`Message` (наприклад, якщо це екземпляр :class:`mboxMessage`, а це екземпляр :class:`mbox`), його специфічний для формату використовується інформація. В іншому випадку використовуються розумні значення за замовчуванням для інформації про певний формат.

source: Support for binary input was added.
uk: Додано підтримку двійкового введення.

source: Delete the message corresponding to *key* from the mailbox.
uk: Видалити з поштової скриньки повідомлення, що відповідає *ключу*.

source: If no such message exists, a :exc:`KeyError` exception is raised if the method was called as :meth:`remove` or :meth:`__delitem__` but no exception is raised if the method was called as :meth:`discard`. The behavior of :meth:`discard` may be preferred if the underlying mailbox format supports concurrent modification by other processes.
uk: Якщо такого повідомлення немає, виникає виняток :exc:`KeyError`, якщо метод викликано як :meth:`remove` або :meth:`__delitem__`, але жодного винятку не виникає, якщо метод викликано як :meth:`discard`. Поведінка :meth:`discard` може бути кращою, якщо базовий формат поштової скриньки підтримує одночасну модифікацію іншими процесами.

source: Replace the message corresponding to *key* with *message*. Raise a :exc:`KeyError` exception if no message already corresponds to *key*.
uk: Замініть повідомлення, що відповідає *ключу* на *повідомлення*. Викликати виняток :exc:`KeyError`, якщо жодне повідомлення вже не відповідає *ключу*.

source: As with :meth:`add`, parameter *message* may be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, a byte string, or a file-like object (which should be open in binary mode). If *message* is an instance of the appropriate format-specific :class:`Message` subclass (e.g., if it's an :class:`mboxMessage` instance and this is an :class:`mbox` instance), its format-specific information is used. Otherwise, the format-specific information of the message that currently corresponds to *key* is left unchanged.
uk: Як і :meth:`add`, параметр *message* може бути екземпляром :class:`Message`, екземпляром :class:`email.message.Message`, рядком, рядком байтів або файлоподібним об’єктом (який має бути відкритий у двійковому режимі). Якщо *message* є екземпляром відповідного підкласу :class:`Message` (наприклад, якщо це екземпляр :class:`mboxMessage`, а це екземпляр :class:`mbox`), його специфічний для формату використовується інформація. В іншому випадку інформація про формат повідомлення, яке наразі відповідає *ключу*, залишається без змін.

source: Return an iterator over all keys if called as :meth:`iterkeys` or return a list of keys if called as :meth:`keys`.
uk: Повертає ітератор для всіх ключів, якщо викликається як :meth:`iterkeys`, або повертає список ключів, якщо викликається як :meth:`keys`.

source: Return an iterator over representations of all messages if called as :meth:`itervalues` or :meth:`__iter__` or return a list of such representations if called as :meth:`values`. The messages are represented as instances of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
uk: Повертає ітератор над представленнями всіх повідомлень, якщо викликається як :meth:`itervalues` або :meth:`__iter__`, або повертає список таких представлень, якщо викликається як :meth:`values`. Повідомлення представлені як екземпляри відповідного підкласу :class:`Message`, що залежить від формату, якщо під час ініціалізації екземпляра :class:`Mailbox` не було вказано спеціальну фабрику повідомлень.

source: The behavior of :meth:`__iter__` is unlike that of dictionaries, which iterate over keys.
uk: Поведінка :meth:`__iter__` відрізняється від поведінки словників, які перебирають ключі.

source: Return an iterator over (*key*, *message*) pairs, where *key* is a key and *message* is a message representation, if called as :meth:`iteritems` or return a list of such pairs if called as :meth:`items`. The messages are represented as instances of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
uk: Повертає ітератор над парами (*key*, *message*), де *key* є ключем, а *message* є представленням повідомлення, якщо викликається як :meth:`iteritems`, або повертає список таких пар, якщо викликається як :meth:`items`. Повідомлення представлено як екземпляри відповідного підкласу :class:`Message`, що залежить від формату, якщо під час ініціалізації екземпляра :class:`Mailbox` не було вказано спеціальну фабрику повідомлень.

source: Return a representation of the message corresponding to *key*. If no such message exists, *default* is returned if the method was called as :meth:`get` and a :exc:`KeyError` exception is raised if the method was called as :meth:`__getitem__`. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
uk: Повертає представлення повідомлення, що відповідає *ключу*. Якщо такого повідомлення немає, повертається *default*, якщо метод було викликано як :meth:`get`, а якщо метод було викликано як :meth:`__getitem__`, виникає виняток :exc:`KeyError`. Повідомлення представлено як екземпляр відповідного підкласу :class:`Message`, що залежить від формату, якщо під час ініціалізації екземпляра :class:`Mailbox` не було вказано спеціальну фабрику повідомлень.

source: Return a representation of the message corresponding to *key* as an instance of the appropriate format-specific :class:`Message` subclass, or raise a :exc:`KeyError` exception if no such message exists.
uk: Повернути представлення повідомлення, що відповідає *key*, як екземпляр відповідного підкласу :class:`Message` або створити виняток :exc:`KeyError`, якщо таке повідомлення не існує.

source: Return a byte representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists.
uk: Повертає байтове представлення повідомлення, що відповідає *key*, або викликає виняток :exc:`KeyError`, якщо такого повідомлення не існує.

source: Return a string representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists. The message is processed through :class:`email.message.Message` to convert it to a 7bit clean representation.
uk: Повернути рядкове представлення повідомлення, що відповідає *key*, або викликати виняток :exc:`KeyError`, якщо такого повідомлення не існує. Повідомлення обробляється через :class:`email.message.Message`, щоб перетворити його на 7-бітне чисте представлення.

source: Return a file-like representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists. The file-like object behaves as if open in binary mode. This file should be closed once it is no longer needed.
uk: Повернути файлоподібне представлення повідомлення, що відповідає *ключу*, або викликати виняток :exc:`KeyError`, якщо такого повідомлення не існує. Файлоподібний об'єкт поводиться як відкритий у двійковому режимі. Цей файл слід закрити, коли він більше не потрібен.

source: The file object really is a binary file; previously it was incorrectly returned in text mode. Also, the file-like object now supports the context management protocol: you can use a :keyword:`with` statement to automatically close it.
uk: Файловий об'єкт насправді є двійковим файлом; раніше він некоректно повертався в текстовому режимі. Крім того, файлоподібний об’єкт тепер підтримує протокол керування контекстом: ви можете використовувати оператор :keyword:`with`, щоб автоматично закрити його.

source: Unlike other representations of messages, file-like representations are not necessarily independent of the :class:`Mailbox` instance that created them or of the underlying mailbox. More specific documentation is provided by each subclass.
uk: На відміну від інших представлень повідомлень, файлоподібні представлення не обов’язково є незалежними від примірника :class:`Mailbox`, який їх створив, або від основної поштової скриньки. Більш детальну документацію надає кожен підклас.

source: Return ``True`` if *key* corresponds to a message, ``False`` otherwise.
uk: Повертає ``True``, якщо *ключ* відповідає повідомленню, ``False`` інакше.

source: Return a count of messages in the mailbox.
uk: Повернути кількість повідомлень у поштовій скриньці.

source: Delete all messages from the mailbox.
uk: Видалити всі повідомлення з поштової скриньки.

source: Return a representation of the message corresponding to *key* and delete the message. If no such message exists, return *default*. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
uk: Повернути представлення повідомлення, що відповідає *ключу*, і видалити повідомлення. Якщо такого повідомлення немає, поверніть *default*. Повідомлення представлено як екземпляр відповідного підкласу :class:`Message`, що залежить від формату, якщо під час ініціалізації екземпляра :class:`Mailbox` не було вказано спеціальну фабрику повідомлень.

source: Return an arbitrary (*key*, *message*) pair, where *key* is a key and *message* is a message representation, and delete the corresponding message. If the mailbox is empty, raise a :exc:`KeyError` exception. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
uk: Повертає довільну пару (*ключ*, *повідомлення*), де *ключ* — це ключ, а *повідомлення* — представлення повідомлення, і видаляє відповідне повідомлення. Якщо поштова скринька порожня, викликайте виняток :exc:`KeyError`. Повідомлення представлено як екземпляр відповідного підкласу :class:`Message`, що залежить від формату, якщо під час ініціалізації екземпляра :class:`Mailbox` не було вказано спеціальну фабрику повідомлень.

source: Parameter *arg* should be a *key*-to-*message* mapping or an iterable of (*key*, *message*) pairs. Updates the mailbox so that, for each given *key* and *message*, the message corresponding to *key* is set to *message* as if by using :meth:`__setitem__`. As with :meth:`__setitem__`, each *key* must already correspond to a message in the mailbox or else a :exc:`KeyError` exception will be raised, so in general it is incorrect for *arg* to be a :class:`Mailbox` instance.
uk: Параметр *arg* має бути зіставленням *ключ*до*повідомлення* або ітерацією пар (*ключ*, *повідомлення*). Оновлює поштову скриньку таким чином, що для кожного заданого *ключа* та *повідомлення* повідомлення, що відповідає *ключу*, встановлюється на *повідомлення*, ніби за допомогою :meth:`__setitem__`. Як і у випадку з :meth:`__setitem__`, кожен *ключ* має вже відповідати повідомленню в поштовій скриньці, інакше буде викликано виняток :exc:`KeyError`, тому загалом невірно, щоб *arg* був екземпляр :class:`Mailbox`.

source: Unlike with dictionaries, keyword arguments are not supported.
uk: На відміну від словників, аргументи ключових слів не підтримуються.

source: Write any pending changes to the filesystem. For some :class:`Mailbox` subclasses, changes are always written immediately and :meth:`flush` does nothing, but you should still make a habit of calling this method.
uk: Запишіть усі незавершені зміни до файлової системи. Для деяких підкласів :class:`Mailbox` зміни завжди записуються негайно, а :meth:`flush` нічого не робить, але ви все одно повинні мати звичку викликати цей метод.

source: Acquire an exclusive advisory lock on the mailbox so that other processes know not to modify it. An :exc:`ExternalClashError` is raised if the lock is not available. The particular locking mechanisms used depend upon the mailbox format. You should *always* lock the mailbox before making any modifications to its contents.
uk: Отримайте ексклюзивне консультаційне блокування поштової скриньки, щоб інші процеси знали, що не потрібно її змінювати. Якщо блокування недоступне, виникає :exc:`ExternalClashError`. Використовувані конкретні механізми блокування залежать від формату поштової скриньки. Ви повинні *завжди* блокувати поштову скриньку, перш ніж вносити будь-які зміни в її вміст.

source: Release the lock on the mailbox, if any.
uk: Зніміть блокування поштової скриньки, якщо є.

source: Flush the mailbox, unlock it if necessary, and close any open files. For some :class:`Mailbox` subclasses, this method does nothing.
uk: Очистіть поштову скриньку, розблокуйте її, якщо необхідно, і закрийте всі відкриті файли. Для деяких підкласів :class:`Mailbox` цей метод нічого не робить.

source: A subclass of :class:`Mailbox` for mailboxes in Maildir format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MaildirMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
uk: Підклас :class:`Mailbox` для поштових скриньок у форматі Maildir. Параметр *factory* — це викликаючий об’єкт, який приймає файлоподібне представлення повідомлення (яке поводиться так, ніби відкрито в двійковому режимі) і повертає спеціальне представлення. Якщо *factory* має значення ``None``, :class:`MaildirMessage` використовується як типове представлення повідомлення. Якщо *create* має значення ``True``, поштова скринька буде створена, якщо вона не існує.

source: If *create* is ``True`` and the *dirname* path exists, it will be treated as an existing maildir without attempting to verify its directory layout.
uk: Якщо *create* має значення ``True`` і шлях *dirname* існує, він розглядатиметься як існуючий maildir без спроби перевірити розташування його каталогу.

source: It is for historical reasons that *dirname* is named as such rather than *path*.
uk: З історичних причин *dirname* названо так, а не *path*.

source: Maildir is a directory-based mailbox format invented for the qmail mail transfer agent and now widely supported by other programs. Messages in a Maildir mailbox are stored in separate files within a common directory structure. This design allows Maildir mailboxes to be accessed and modified by multiple unrelated programs without data corruption, so file locking is unnecessary.
uk: Maildir — це формат поштової скриньки на основі каталогу, винайдений для агента передачі пошти qmail і тепер широко підтримується іншими програмами. Повідомлення в поштовій скриньці Maildir зберігаються в окремих файлах у загальній структурі каталогу. Ця конструкція дозволяє отримувати доступ до поштових скриньок Maildir і змінювати їх кількома непов’язаними програмами без пошкодження даних, тому блокування файлів непотрібне.

source: Maildir mailboxes contain three subdirectories, namely: :file:`tmp`, :file:`new`, and :file:`cur`. Messages are created momentarily in the :file:`tmp` subdirectory and then moved to the :file:`new` subdirectory to finalize delivery. A mail user agent may subsequently move the message to the :file:`cur` subdirectory and store information about the state of the message in a special "info" section appended to its file name.
uk: Поштові скриньки Maildir містять три підкаталоги, а саме: :file:`tmp`, :file:`new` і :file:`cur`. Повідомлення миттєво створюються в підкаталозі :file:`tmp`, а потім переміщуються в підкаталог :file:`new` для завершення доставки. Поштовий агент користувача може згодом перемістити повідомлення до підкаталогу :file:`cur` і зберегти інформацію про стан повідомлення в спеціальному розділі "info", доданому до імені файлу.
