Repository: python/python-docs-uk
Catalog: library/mailbox.po
Languages: uk

source: Folders of the style introduced by the Courier mail transfer agent are also supported. Any subdirectory of the main mailbox is considered a folder if ``'.'`` is the first character in its name. Folder names are represented by :class:`Maildir` without the leading ``'.'``. Each folder is itself a Maildir mailbox but should not contain other folders. Instead, a logical nesting is indicated using ``'.'`` to delimit levels, e.g., "Archived.2005.07".
uk: Також підтримуються папки стилю, представленого агентом передачі пошти "Кур'єр". Будь-який підкаталог головної поштової скриньки вважається папкою, якщо ``'.'`` є першим символом у його імені. Імена папок представлені :class:`Maildir` без початкового ``'.''``. Кожна папка сама є поштовою скринькою Maildir, але не повинна містити інших папок. Натомість логічне вкладення вказується за допомогою ``'.'`` для розмежування рівнів, наприклад, "Архівовано.2005.07".

source: The Maildir specification requires the use of a colon (``':'``) in certain message file names. However, some operating systems do not permit this character in file names, If you wish to use a Maildir-like format on such an operating system, you should specify another character to use instead. The exclamation point (``'!'``) is a popular choice. For example::
uk: Специфікація Maildir вимагає використання двокрапки (``':'``) у певних іменах файлів повідомлень. Однак деякі операційні системи не дозволяють використовувати цей символ у назвах файлів. Якщо ви бажаєте використовувати формат, подібний до Maildir, у такій операційній системі, вам слід указати інший символ для використання замість нього. Знак оклику (``'!'``) є популярним вибором. Наприклад::

source: The :attr:`colon` attribute may also be set on a per-instance basis.
uk: Атрибут :attr:`colon` також можна встановити для кожного екземпляра.

source: :class:`Maildir` instances have all of the methods of :class:`Mailbox` in addition to the following:
uk: Екземпляри :class:`Maildir` мають усі методи :class:`Mailbox` на додаток до наступного:

source: Return a list of the names of all folders.
uk: Повернути список імен усіх папок.

source: Return a :class:`Maildir` instance representing the folder whose name is *folder*. A :exc:`NoSuchMailboxError` exception is raised if the folder does not exist.
uk: Повертає екземпляр :class:`Maildir`, який представляє папку з назвою *folder*. Виняток :exc:`NoSuchMailboxError` виникає, якщо папка не існує.

source: Create a folder whose name is *folder* and return a :class:`Maildir` instance representing it.
uk: Створіть папку з іменем *folder* і поверніть екземпляр :class:`Maildir`, що її представляє.

source: Delete the folder whose name is *folder*. If the folder contains any messages, a :exc:`NotEmptyError` exception will be raised and the folder will not be deleted.
uk: Видаліть папку з назвою *папка*. Якщо папка містить будь-які повідомлення, буде викликано виняток :exc:`NotEmptyError` і папку не буде видалено.

source: Delete temporary files from the mailbox that have not been accessed in the last 36 hours. The Maildir specification says that mail-reading programs should do this occasionally.
uk: Видаліть із поштової скриньки тимчасові файли, до яких не було доступу протягом останніх 36 годин. Специфікація Maildir говорить, що програми для читання пошти повинні робити це час від часу.

source: Some :class:`Mailbox` methods implemented by :class:`Maildir` deserve special remarks:
uk: Деякі методи :class:`Mailbox`, реалізовані :class:`Maildir`, заслуговують на особливі зауваження:

source: These methods generate unique file names based upon the current process ID. When using multiple threads, undetected name clashes may occur and cause corruption of the mailbox unless threads are coordinated to avoid using these methods to manipulate the same mailbox simultaneously.
uk: Ці методи генерують унікальні імена файлів на основі ідентифікатора поточного процесу. Під час використання кількох потоків можуть виникнути невиявлені конфлікти імен і спричинити пошкодження поштової скриньки, якщо потоки не координуються, щоб уникнути використання цих методів для одночасного маніпулювання тією самою поштовою скринькою.

source: All changes to Maildir mailboxes are immediately applied, so this method does nothing.
uk: Усі зміни в поштових скриньках Maildir застосовуються негайно, тому цей метод нічого не робить.

source: Maildir mailboxes do not support (or require) locking, so these methods do nothing.
uk: Поштові скриньки Maildir не підтримують (або вимагають) блокування, тому ці методи нічого не роблять.

source: :class:`Maildir` instances do not keep any open files and the underlying mailboxes do not support locking, so this method does nothing.
uk: Екземпляри :class:`Maildir` не зберігають жодних відкритих файлів, а основні поштові скриньки не підтримують блокування, тому цей метод нічого не робить.

source: Depending upon the host platform, it may not be possible to modify or remove the underlying message while the returned file remains open.
uk: Залежно від хост-платформи може бути неможливо змінити або видалити базове повідомлення, поки повернутий файл залишається відкритим.

source: `maildir man page from Courier <http://www.courier-mta.org/maildir.html>`_
uk: `довідкова сторінка maildir від Courier <http://www.courier-mta.org/maildir.html>`_

source: A specification of the format. Describes a common extension for supporting folders.
uk: Специфікація формату. Описує загальне розширення для підтримки папок.

source: `Using maildir format <https://cr.yp.to/proto/maildir.html>`_
uk: `Використання формату maildir <https://cr.yp.to/proto/maildir.html>`_

source: Notes on Maildir by its inventor. Includes an updated name-creation scheme and details on "info" semantics.
uk: Нотатки про Maildir від його винахідника. Включає оновлену схему створення імен і подробиці семантики "info".

source: A subclass of :class:`Mailbox` for mailboxes in mbox format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`mboxMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
uk: Підклас :class:`Mailbox` для поштових скриньок у форматі mbox. Параметр *factory* — це викликаючий об’єкт, який приймає файлоподібне представлення повідомлення (яке поводиться так, ніби відкрито в двійковому режимі) і повертає спеціальне представлення. Якщо *factory* має значення ``None``, :class:`mboxMessage` використовується як типове представлення повідомлення. Якщо *create* має значення ``True``, поштова скринька буде створена, якщо вона не існує.

source: The mbox format is the classic format for storing mail on Unix systems. All messages in an mbox mailbox are stored in a single file with the beginning of each message indicated by a line whose first five characters are "From ".
uk: Формат mbox є класичним форматом для зберігання пошти в системах Unix. Усі повідомлення в поштовій скриньці mbox зберігаються в одному файлі, початок кожного повідомлення позначається рядком, перші п’ять символів якого є "Від".

source: Several variations of the mbox format exist to address perceived shortcomings in the original. In the interest of compatibility, :class:`mbox` implements the original format, which is sometimes referred to as :dfn:`mboxo`. This means that the :mailheader:`Content-Length` header, if present, is ignored and that any occurrences of "From " at the beginning of a line in a message body are transformed to ">From " when storing the message, although occurrences of ">From " are not transformed to "From " when reading the message.
uk: Існує кілька варіантів формату mbox для усунення недоліків оригіналу. В інтересах сумісності :class:`mbox` реалізує вихідний формат, який іноді називають :dfn:`mboxo`. Це означає, що заголовок :mailheader:`Content-Length`, якщо він присутній, ігнорується, а будь-які випадки "Від" на початку рядка в тілі повідомлення перетворюються на ">Від" під час збереження повідомлення, хоча входження ">Від" не перетворюються на "Від" під час читання повідомлення.

source: Some :class:`Mailbox` methods implemented by :class:`mbox` deserve special remarks:
uk: Деякі методи :class:`Mailbox`, реалізовані :class:`mbox`, заслуговують на особливі зауваження:

source: Using the file after calling :meth:`flush` or :meth:`close` on the :class:`mbox` instance may yield unpredictable results or raise an exception.
uk: Використання файлу після виклику :meth:`flush` або :meth:`close` для екземпляра :class:`mbox` може призвести до непередбачуваних результатів або викликати виняткову ситуацію.

source: Three locking mechanisms are used---dot locking and, if available, the :c:func:`flock` and :c:func:`lockf` system calls.
uk: Використовуються три механізми блокування ---точкове блокування та, якщо доступно, системні виклики :c:func:`flock` і :c:func:`lockf`.

source: `mbox man page from tin <http://www.tin.org/bin/man.cgi?section=5&topic=mbox>`_
uk: `сторінка довідки mbox з tin <http://www.tin.org/bin/man.cgi?section=5&topic=mbox>`_

source: A specification of the format, with details on locking.
uk: Специфікація формату з деталями щодо блокування.

source: `Configuring Netscape Mail on Unix: Why The Content-Length Format is Bad <https://www.jwz.org/doc/content-length.html>`_
uk: `Налаштування Netscape Mail в Unix: Чому формат довжини вмісту поганий <https://www.jwz.org/doc/content-length.html>`_

source: An argument for using the original mbox format rather than a variation.
uk: Аргумент для використання оригінального формату mbox, а не варіації.

source: `"mbox" is a family of several mutually incompatible mailbox formats <https://www.loc.gov/preservation/digital/formats/fdd/fdd000383.shtml>`_
uk: `"mbox" - це сімейство з кількох взаємно несумісних форматів поштових скриньок <https://www.loc.gov/preservation/digital/formats/fdd/fdd000383.shtml>`_

source: A history of mbox variations.
uk: Історія різновидів mbox.

source: A subclass of :class:`Mailbox` for mailboxes in MH format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MHMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
uk: Підклас :class:`Mailbox` для поштових скриньок у форматі MH. Параметр *factory* — це викликаючий об’єкт, який приймає файлоподібне представлення повідомлення (яке поводиться так, ніби відкрито в двійковому режимі) і повертає спеціальне представлення. Якщо *factory* має значення ``None``, :class:`MHMessage` використовується як типове представлення повідомлення. Якщо *create* має значення ``True``, поштова скринька буде створена, якщо вона не існує.

source: MH is a directory-based mailbox format invented for the MH Message Handling System, a mail user agent. Each message in an MH mailbox resides in its own file. An MH mailbox may contain other MH mailboxes (called :dfn:`folders`) in addition to messages. Folders may be nested indefinitely. MH mailboxes also support :dfn:`sequences`, which are named lists used to logically group messages without moving them to sub-folders. Sequences are defined in a file called :file:`.mh_sequences` in each folder.
uk: MH — це формат поштової скриньки на основі каталогу, створений для системи обробки повідомлень MH, агента користувача електронної пошти. Кожне повідомлення в поштовій скриньці MH зберігається в окремому файлі. Крім повідомлень, поштова скринька MH може містити інші поштові скриньки MH (так звані :dfn:`folders`). Папки можуть бути вкладеними нескінченно довго. Поштові скриньки MH також підтримують :dfn:`sequences`, які є іменованими списками, які використовуються для логічного групування повідомлень без їх переміщення до підпапок. Послідовності визначено у файлі під назвою :file:`.mh_sequences` у кожній папці.

source: The :class:`MH` class manipulates MH mailboxes, but it does not attempt to emulate all of :program:`mh`'s behaviors. In particular, it does not modify and is not affected by the :file:`context` or :file:`.mh_profile` files that are used by :program:`mh` to store its state and configuration.
uk: Клас :class:`MH` керує поштовими скриньками MH, але він не намагається емулювати всю поведінку :program:`mh`. Зокрема, він не змінюється та не впливає на файли :file:`context` або :file:`.mh_profile`, які використовуються :program:`mh` для зберігання його стану та конфігурації.

source: :class:`MH` instances have all of the methods of :class:`Mailbox` in addition to the following:
uk: Екземпляри :class:`MH` мають усі методи :class:`Mailbox` на додаток до наступного:

source: Return an :class:`MH` instance representing the folder whose name is *folder*. A :exc:`NoSuchMailboxError` exception is raised if the folder does not exist.
uk: Повертає екземпляр :class:`MH`, який представляє папку з назвою *folder*. Виняток :exc:`NoSuchMailboxError` викликається, якщо папка не існує.

source: Create a folder whose name is *folder* and return an :class:`MH` instance representing it.
uk: Створіть папку з іменем *folder* і поверніть екземпляр :class:`MH`, що її представляє.

source: Return a dictionary of sequence names mapped to key lists. If there are no sequences, the empty dictionary is returned.
uk: Повертає словник імен послідовностей, зіставлених зі списками ключів. Якщо послідовностей немає, повертається порожній словник.

source: Re-define the sequences that exist in the mailbox based upon *sequences*, a dictionary of names mapped to key lists, like returned by :meth:`get_sequences`.
uk: Повторно визначте послідовності, які існують у поштовій скриньці, на основі *sequences*, словника імен, зіставлених зі списками ключів, як повертає :meth:`get_sequences`.

source: Rename messages in the mailbox as necessary to eliminate gaps in numbering. Entries in the sequences list are updated correspondingly.
uk: Перейменуйте повідомлення в поштовій скриньці за потреби, щоб усунути прогалини в нумерації. Записи в списку послідовностей оновлюються відповідно.

source: Already-issued keys are invalidated by this operation and should not be subsequently used.
uk: Уже видані ключі стають недійсними під час цієї операції та не повинні використовуватися згодом.

source: Some :class:`Mailbox` methods implemented by :class:`MH` deserve special remarks:
uk: Деякі методи :class:`Mailbox`, реалізовані :class:`MH`, заслуговують на особливі зауваження:

source: These methods immediately delete the message. The MH convention of marking a message for deletion by prepending a comma to its name is not used.
uk: Ці методи негайно видаляють повідомлення. Угода MH про позначення повідомлення для видалення шляхом додавання коми перед його назвою не використовується.

source: Three locking mechanisms are used---dot locking and, if available, the :c:func:`flock` and :c:func:`lockf` system calls. For MH mailboxes, locking the mailbox means locking the :file:`.mh_sequences` file and, only for the duration of any operations that affect them, locking individual message files.
uk: Використовуються три механізми блокування ---точкове блокування та, якщо доступно, системні виклики :c:func:`flock` і :c:func:`lockf`. Для поштових скриньок MH блокування поштової скриньки означає блокування файлу :file:`.mh_sequences` і блокування окремих файлів повідомлень лише на час виконання будь-яких операцій, які на них впливають.

source: Depending upon the host platform, it may not be possible to remove the underlying message while the returned file remains open.
uk: Залежно від хост-платформи може бути неможливо видалити базове повідомлення, поки повернутий файл залишається відкритим.

source: All changes to MH mailboxes are immediately applied, so this method does nothing.
uk: Усі зміни до поштових скриньок MH негайно застосовуються, тому цей метод нічого не робить.

source: :class:`MH` instances do not keep any open files, so this method is equivalent to :meth:`unlock`.
uk: Екземпляри :class:`MH` не зберігають відкритих файлів, тому цей метод еквівалентний :meth:`unlock`.

source: `nmh - Message Handling System <http://www.nongnu.org/nmh/>`_
uk: `nmh - система обробки повідомлень <http://www.nongnu.org/nmh/>`_

source: Home page of :program:`nmh`, an updated version of the original :program:`mh`.
uk: Домашня сторінка :program:`nmh`, оновленої версії оригінальної :program:`mh`.

source: `MH & nmh: Email for Users & Programmers <https://rand-mh.sourceforge.io/book/>`_
uk: `MH & nmh: Електронна пошта для користувачів і програмістів <https://rand-mh.sourceforge.io/book/>`_

source: A GPL-licensed book on :program:`mh` and :program:`nmh`, with some information on the mailbox format.
uk: Ліцензована GPL книга про :program:`mh` і :program:`nmh`, з деякою інформацією про формат поштової скриньки.

source: A subclass of :class:`Mailbox` for mailboxes in Babyl format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`BabylMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
uk: Підклас :class:`Mailbox` для поштових скриньок у форматі Babyl. Параметр *factory* — це викликаючий об’єкт, який приймає файлоподібне представлення повідомлення (яке поводиться так, ніби відкрито в двійковому режимі) і повертає спеціальне представлення. Якщо *factory* має значення ``None``, :class:`BabylMessage` використовується як типове представлення повідомлення. Якщо *create* має значення ``True``, поштова скринька буде створена, якщо вона не існує.

source: Babyl is a single-file mailbox format used by the Rmail mail user agent included with Emacs. The beginning of a message is indicated by a line containing the two characters Control-Underscore (``'\037'``) and Control-L (``'\014'``). The end of a message is indicated by the start of the next message or, in the case of the last message, a line containing a Control-Underscore (``'\037'``) character.
uk: Babyl — це однофайловий формат поштової скриньки, який використовується поштовим агентом користувача Rmail, що входить до складу Emacs. Початок повідомлення позначається рядком, що містить два символи Control-Underscore (``'\037'``) і Control-L (``'\014'``). Кінець повідомлення позначається початком наступного повідомлення або, у випадку останнього повідомлення, рядком, що містить символ Control-Underscore (``'\037'``).

source: Messages in a Babyl mailbox have two sets of headers, original headers and so-called visible headers. Visible headers are typically a subset of the original headers that have been reformatted or abridged to be more attractive. Each message in a Babyl mailbox also has an accompanying list of :dfn:`labels`, or short strings that record extra information about the message, and a list of all user-defined labels found in the mailbox is kept in the Babyl options section.
uk: Повідомлення в поштовій скриньці Babyl мають два набори заголовків, оригінальні заголовки та так звані видимі заголовки. Видимі заголовки зазвичай є підмножиною вихідних заголовків, які було переформатовано або скорочено, щоб бути більш привабливими. Кожне повідомлення в поштовій скриньці Babyl також має супровідний список :dfn:`labels` або коротких рядків, які записують додаткову інформацію про повідомлення, а список усіх визначених користувачем міток, знайдених у поштовій скриньці, зберігається в розділі параметрів Babyl .

source: :class:`Babyl` instances have all of the methods of :class:`Mailbox` in addition to the following:
uk: Екземпляри :class:`Babyl` мають усі методи :class:`Mailbox` на додаток до наступного:

source: Return a list of the names of all user-defined labels used in the mailbox.
uk: Повертає список імен усіх визначених користувачем міток, які використовуються в поштовій скриньці.

source: The actual messages are inspected to determine which labels exist in the mailbox rather than consulting the list of labels in the Babyl options section, but the Babyl section is updated whenever the mailbox is modified.
uk: Фактичні повідомлення перевіряються, щоб визначити, які мітки існують у поштовій скриньці, замість перегляду списку міток у розділі параметрів Babyl, але розділ Babyl оновлюється щоразу, коли поштова скринька змінюється.

source: Some :class:`Mailbox` methods implemented by :class:`Babyl` deserve special remarks:
uk: Деякі методи :class:`Mailbox`, реалізовані :class:`Babyl`, заслуговують на окремі зауваження:

source: In Babyl mailboxes, the headers of a message are not stored contiguously with the body of the message. To generate a file-like representation, the headers and body are copied together into an :class:`io.BytesIO` instance, which has an API identical to that of a file. As a result, the file-like object is truly independent of the underlying mailbox but does not save memory compared to a string representation.
uk: У поштових скриньках Babyl заголовки повідомлення не зберігаються поруч із тілом повідомлення. Щоб створити файлоподібне представлення, заголовки та тіло копіюються разом у екземпляр :class:`io.BytesIO`, який має API, ідентичний API файлу. Як наслідок, файлоподібний об’єкт справді не залежить від базової поштової скриньки, але не економить пам’ять у порівнянні з представленням рядків.

source: `Format of Version 5 Babyl Files <https://quimby.gnus.org/notes/BABYL>`_
uk: `Формат файлів Babyl версії 5 <https://quimby.gnus.org/notes/BABYL>`_

source: A specification of the Babyl format.
uk: Специфікація формату Babyl.

source: `Reading Mail with Rmail <https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html>`_
uk: `Читання пошти за допомогою Rmail <https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html>`_

source: The Rmail manual, with some information on Babyl semantics.
uk: Посібник Rmail з деякою інформацією про семантику Babyl.

source: A subclass of :class:`Mailbox` for mailboxes in MMDF format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MMDFMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
uk: Підклас :class:`Mailbox` для поштових скриньок у форматі MMDF. Параметр *factory* — це викликаючий об’єкт, який приймає файлоподібне представлення повідомлення (яке поводиться так, ніби відкрито в двійковому режимі) і повертає спеціальне представлення. Якщо *factory* має значення ``None``, :class:`MMDFMessage` використовується як типове представлення повідомлення. Якщо *create* має значення ``True``, поштова скринька буде створена, якщо вона не існує.
