Repository: python/python-docs-uk
Catalog: library/mailbox.po
Languages: uk

source: MMDF is a single-file mailbox format invented for the Multichannel Memorandum Distribution Facility, a mail transfer agent. Each message is in the same form as an mbox message but is bracketed before and after by lines containing four Control-A (``'\001'``) characters. As with the mbox format, the beginning of each message is indicated by a line whose first five characters are "From ", but additional occurrences of "From " are not transformed to ">From " when storing messages because the extra message separator lines prevent mistaking such occurrences for the starts of subsequent messages.
uk: MMDF — це однофайловий формат поштової скриньки, винайдений для Multichannel Memorandum Distribution Facility, агента пересилання пошти. Кожне повідомлення має таку саму форму, що й повідомлення mbox, але в дужках перед і після рядки містять чотири символи Control-A (``'\001'``). Як і у форматі mbox, початок кожного повідомлення позначається рядком, перші п’ять символів якого є "Від", але додаткові входження "Від" не перетворюються на ">Від" під час зберігання повідомлень, оскільки додаткові рядки-роздільники повідомлень запобігають помилково приймаючи такі випадки за початок наступних повідомлень.

source: Some :class:`Mailbox` methods implemented by :class:`MMDF` deserve special remarks:
uk: Деякі методи :class:`Mailbox`, реалізовані :class:`MMDF`, заслуговують на особливі зауваження:

source: Using the file after calling :meth:`flush` or :meth:`close` on the :class:`MMDF` instance may yield unpredictable results or raise an exception.
uk: Використання файлу після виклику :meth:`flush` або :meth:`close` для екземпляра :class:`MMDF` може призвести до непередбачуваних результатів або викликати виняткову ситуацію.

source: `mmdf man page from tin <http://www.tin.org/bin/man.cgi?section=5&topic=mmdf>`_
uk: `сторінка довідки mmdf з tin <http://www.tin.org/bin/man.cgi?section=5&topic=mmdf>`_

source: A specification of MMDF format from the documentation of tin, a newsreader.
uk: Специфікація формату MMDF із документації tin, читання новин.

source: A Wikipedia article describing the Multichannel Memorandum Distribution Facility.
uk: Стаття у Вікіпедії, що описує багатоканальний засіб розповсюдження меморандумів.

source: :class:`Message` objects
uk: :class:`Message` об’єкти

source: A subclass of the :mod:`email.message` module's :class:`~email.message.Message`. Subclasses of :class:`mailbox.Message` add mailbox-format-specific state and behavior.
uk: Підклас модуля :mod:`email.message` :class:`~email.message.Message`. Підкласи :class:`mailbox.Message` додають стан і поведінку, залежні від формату поштової скриньки.

source: If *message* is omitted, the new instance is created in a default, empty state. If *message* is an :class:`email.message.Message` instance, its contents are copied; furthermore, any format-specific information is converted insofar as possible if *message* is a :class:`Message` instance. If *message* is a string, a byte string, or a file, it should contain an :rfc:`2822`\ -compliant message, which is read and parsed. Files should be open in binary mode, but text mode files are accepted for backward compatibility.
uk: Якщо *повідомлення* пропущено, новий екземпляр створюється в порожньому стані за замовчуванням. Якщо *message* є екземпляром :class:`email.message.Message`, його вміст копіюється; крім того, будь-яка інформація про певний формат перетворюється настільки, наскільки це можливо, якщо *message* є екземпляром :class:`Message`. Якщо *повідомлення* є рядком, рядком байтів або файлом, воно має містити :rfc:`2822`\ -сумісне повідомлення, яке читається та аналізується. Файли мають бути відкриті у двійковому режимі, але текстові файли приймаються для зворотної сумісності.

source: The format-specific state and behaviors offered by subclasses vary, but in general it is only the properties that are not specific to a particular mailbox that are supported (although presumably the properties are specific to a particular mailbox format). For example, file offsets for single-file mailbox formats and file names for directory-based mailbox formats are not retained, because they are only applicable to the original mailbox. But state such as whether a message has been read by the user or marked as important is retained, because it applies to the message itself.
uk: Специфічний для формату стан і поведінка, запропоновані підкласами, відрізняються, але загалом підтримуються лише ті властивості, які не є специфічними для конкретної поштової скриньки (хоча, імовірно, властивості є специфічними для певного формату поштової скриньки). Наприклад, зміщення файлів для однофайлових форматів поштової скриньки та імена файлів для форматів поштової скриньки на основі каталогу не зберігаються, оскільки вони застосовуються лише до оригінальної поштової скриньки. Але інформація про те, чи було повідомлення прочитано користувачем або позначено як важливе, зберігається, оскільки воно стосується самого повідомлення.

source: There is no requirement that :class:`Message` instances be used to represent messages retrieved using :class:`Mailbox` instances. In some situations, the time and memory required to generate :class:`Message` representations might not be acceptable. For such situations, :class:`Mailbox` instances also offer string and file-like representations, and a custom message factory may be specified when a :class:`Mailbox` instance is initialized.
uk: Немає вимог щодо використання екземплярів :class:`Message` для представлення повідомлень, отриманих за допомогою екземплярів :class:`Mailbox`. У деяких ситуаціях час і пам’ять, необхідні для створення представлень :class:`Message`, можуть бути неприйнятними. Для таких ситуацій екземпляри :class:`Mailbox` також пропонують представлення у вигляді рядків і файлів, і власну фабрику повідомлень можна вказати під час ініціалізації екземпляра :class:`Mailbox`.

source: A message with Maildir-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
uk: Повідомлення зі специфічною поведінкою Maildir. Параметр *message* має те саме значення, що й у конструкторі :class:`Message`.

source: Typically, a mail user agent application moves all of the messages in the :file:`new` subdirectory to the :file:`cur` subdirectory after the first time the user opens and closes the mailbox, recording that the messages are old whether or not they've actually been read. Each message in :file:`cur` has an "info" section added to its file name to store information about its state. (Some mail readers may also add an "info" section to messages in :file:`new`.) The "info" section may take one of two forms: it may contain "2," followed by a list of standardized flags (e.g., "2,FR") or it may contain "1," followed by so-called experimental information. Standard flags for Maildir messages are as follows:
uk: Як правило, програма поштового агента користувача переміщує всі повідомлення з підкаталогу :file:`new` до підкаталогу :file:`cur` після того, як користувач вперше відкриває та закриває поштову скриньку, записуючи, що повідомлення є старими незалежно від того чи вони насправді не були прочитані. Кожне повідомлення в :file:`cur` має розділ "info", доданий до імені файлу для зберігання інформації про його стан. (Деякі програми для читання пошти також можуть додавати розділ "info" до повідомлень у :file:`new`.) Розділ "info" може мати одну з двох форм: він може містити "2", після якого йде список стандартизованих позначок ( наприклад, "2,FR") або може містити "1", за яким слідує так звана експериментальна інформація. Стандартні позначки для повідомлень Maildir такі:

source: Flag
uk: Прапор

source: Meaning
uk: Значення

source: Explanation
uk: Пояснення

source: D
uk: Д

source: Draft
uk: Чернетка

source: Under composition
uk: Під композицією

source: F
uk: Ф

source: Flagged
uk: Позначено

source: Marked as important
uk: Позначено як важливе

source: P
uk: П

source: Passed
uk: Пройшов

source: Forwarded, resent, or bounced
uk: Переслано, повторно надіслано або відхилено

source: R
uk: Р

source: Replied
uk: Відповів

source: Replied to
uk: Відповів

source: S
uk: С

source: Seen
uk: Бачив

source: Read
uk: Прочитайте

source: T
uk: Т

source: Trashed
uk: У кошик

source: Marked for subsequent deletion
uk: Позначено для подальшого видалення

source: :class:`MaildirMessage` instances offer the following methods:
uk: Екземпляри :class:`MaildirMessage` пропонують такі методи:

source: Return either "new" (if the message should be stored in the :file:`new` subdirectory) or "cur" (if the message should be stored in the :file:`cur` subdirectory).
uk: Повертає або "новий" (якщо повідомлення має зберігатися в підкаталозі :file:`new`), або "cur" (якщо повідомлення має зберігатися в підкаталозі :file:`cur`).

source: A message is typically moved from :file:`new` to :file:`cur` after its mailbox has been accessed, whether or not the message is has been read. A message ``msg`` has been read if ``"S" in msg.get_flags()`` is ``True``.
uk: Зазвичай повідомлення переміщується з :file:`new` до :file:`cur` після доступу до його поштової скриньки, незалежно від того, прочитано чи ні повідомлення. Повідомлення ``msg`` було прочитано, якщо ``"S" у msg.get_flags()`` має значення ``True``.

source: Set the subdirectory the message should be stored in. Parameter *subdir* must be either "new" or "cur".
uk: Встановіть підкаталог, у якому має зберігатися повідомлення. Параметр *subdir* повинен мати значення "new" або "cur".

source: Return a string specifying the flags that are currently set. If the message complies with the standard Maildir format, the result is the concatenation in alphabetical order of zero or one occurrence of each of ``'D'``, ``'F'``, ``'P'``, ``'R'``, ``'S'``, and ``'T'``. The empty string is returned if no flags are set or if "info" contains experimental semantics.
uk: Повертає рядок із зазначенням поточних встановлених прапорів. Якщо повідомлення відповідає стандартному формату Maildir, результатом є конкатенація в алфавітному порядку нуля або одного входження кожного з ``'D'``, ``'F'``, ``'P'``, ``'R'``, ``'S'`` і ``'T''``. Порожній рядок повертається, якщо не встановлено прапори або якщо "info" містить експериментальну семантику.

source: Set the flags specified by *flags* and unset all others.
uk: Встановіть прапорці, визначені *flags*, і скасуйте всі інші.

source: Set the flag(s) specified by *flag* without changing other flags. To add more than one flag at a time, *flag* may be a string of more than one character. The current "info" is overwritten whether or not it contains experimental information rather than flags.
uk: Встановіть прапор(и), визначені *flag*, не змінюючи інші прапори. Щоб додати більше ніж один прапор одночасно, *flag* може бути рядком із кількох символів. Поточна "інформація" перезаписується незалежно від того, чи містить вона експериментальну інформацію, а не прапорці.

source: Unset the flag(s) specified by *flag* without changing other flags. To remove more than one flag at a time, *flag* maybe a string of more than one character. If "info" contains experimental information rather than flags, the current "info" is not modified.
uk: Скасувати прапор(и), визначені *flag*, не змінюючи інші прапори. Щоб видалити кілька прапорців одночасно, *flag* може бути рядком із кількох символів. Якщо "info" містить експериментальну інформацію, а не прапорці, поточна "info" не змінюється.

source: Return the delivery date of the message as a floating-point number representing seconds since the epoch.
uk: Повертає дату доставки повідомлення як число з плаваючою комою, яке представляє секунди з епохи.

source: Set the delivery date of the message to *date*, a floating-point number representing seconds since the epoch.
uk: Встановіть дату доставки повідомлення на *date*, число з плаваючою комою, яке представляє секунди з епохи.

source: Return a string containing the "info" for a message. This is useful for accessing and modifying "info" that is experimental (i.e., not a list of flags).
uk: Повертає рядок, що містить "інформацію" про повідомлення. Це корисно для доступу та модифікації "інформації", яка є експериментальною (тобто не списку позначок).

source: Set "info" to *info*, which should be a string.
uk: Встановіть для "info" значення *info*, яке має бути рядком.

source: When a :class:`MaildirMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
uk: Коли екземпляр :class:`MaildirMessage` створюється на основі екземпляра :class:`mboxMessage` або :class:`MMDFMessage`, заголовки :mailheader:`Status` і :mailheader:`X-Status` пропускаються, а відбуваються такі перетворення:

source: Resulting state
uk: Результуючий стан

source: :class:`mboxMessage` or :class:`MMDFMessage` state
uk: стан :class:`mboxMessage` або :class:`MMDFMessage`

source: "cur" subdirectory
uk: підкаталог "cur".

source: O flag
uk: О прапор

source: F flag
uk: Прапор F

source: R flag
uk: Прапор R

source: A flag
uk: Прапор

source: S flag
uk: S прапор

source: T flag
uk: Т прапор

source: D flag
uk: D прапор

source: When a :class:`MaildirMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
uk: Коли примірник :class:`MaildirMessage` створюється на основі примірника :class:`MHMessage`, відбуваються такі перетворення:

source: :class:`MHMessage` state
uk: :class:`MHMessage` стан

source: "unseen" sequence
uk: "невидима" послідовність

source: "cur" subdirectory and S flag
uk: підкаталог "cur" і прапор S

source: no "unseen" sequence
uk: немає "невидимої" послідовності

source: "flagged" sequence
uk: "позначена" послідовність

source: "replied" sequence
uk: послідовність "відповів".

source: When a :class:`MaildirMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
uk: Коли примірник :class:`MaildirMessage` створюється на основі примірника :class:`BabylMessage`, відбуваються такі перетворення:

source: :class:`BabylMessage` state
uk: :class:`BabylMessage` стан

source: "unseen" label
uk: ярлик "невидимий".

source: no "unseen" label
uk: немає мітки "невидиме".

source: P flag
uk: P прапор

source: "forwarded" or "resent" label
uk: мітка "переслано" або "повторно надіслано".

source: "answered" label
uk: мітка "відповів".

source: "deleted" label
uk: ярлик "видалено".

source: A message with mbox-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
uk: Повідомлення зі специфічною поведінкою mbox. Параметр *message* має те саме значення, що й у конструкторі :class:`Message`.

source: Messages in an mbox mailbox are stored together in a single file. The sender's envelope address and the time of delivery are typically stored in a line beginning with "From " that is used to indicate the start of a message, though there is considerable variation in the exact format of this data among mbox implementations. Flags that indicate the state of the message, such as whether it has been read or marked as important, are typically stored in :mailheader:`Status` and :mailheader:`X-Status` headers.
uk: Повідомлення в поштовій скриньці mbox зберігаються разом в одному файлі. Адреса конверта відправника та час доставки зазвичай зберігаються в рядку, що починається на "Від", який використовується для позначення початку повідомлення, хоча існують значні відмінності в точному форматі цих даних серед реалізацій mbox. Прапорці, які вказують на стан повідомлення, наприклад, чи було воно прочитано чи позначено як важливе, зазвичай зберігаються в заголовках :mailheader:`Status` і :mailheader:`X-Status`.

source: Conventional flags for mbox messages are as follows:
uk: Звичайні позначки для повідомлень mbox такі:

source: O
uk: О

source: Old
uk: Старий

source: Previously detected by MUA
uk: Раніше виявлено MUA

source: Deleted
uk: Видалено

source: A
uk: А

source: Answered
uk: відповів

source: The "R" and "O" flags are stored in the :mailheader:`Status` header, and the "D", "F", and "A" flags are stored in the :mailheader:`X-Status` header. The flags and headers typically appear in the order mentioned.
uk: Прапорці "R" і "O" зберігаються в заголовку :mailheader:`Status`, а прапорці "D", "F" і "A" зберігаються в заголовку :mailheader:`X-Status`. Прапорці та заголовки зазвичай з’являються у зазначеному порядку.

source: :class:`mboxMessage` instances offer the following methods:
uk: Екземпляри :class:`mboxMessage` пропонують такі методи:

source: Return a string representing the "From " line that marks the start of the message in an mbox mailbox. The leading "From " and the trailing newline are excluded.
uk: Повертає рядок, що представляє рядок "Від", який позначає початок повідомлення в поштовій скриньці mbox. Початковий "Від" і кінцевий символ нового рядка виключаються.

source: Set the "From " line to *from_*, which should be specified without a leading "From " or trailing newline. For convenience, *time_* may be specified and will be formatted appropriately and appended to *from_*. If *time_* is specified, it should be a :class:`time.struct_time` instance, a tuple suitable for passing to :meth:`time.strftime`, or ``True`` (to use :meth:`time.gmtime`).
uk: Встановіть для рядка "Від" значення *from_*, яке слід вказати без початку "Від" або завершення нового рядка. Для зручності можна вказати *time_*, яке буде відповідним чином відформатовано та додано до *from_*. Якщо вказано *time_*, це має бути екземпляр :class:`time.struct_time`, кортеж, придатний для передачі в :meth:`time.strftime` або ``True`` (для використання :meth:`time .gmtime`).

source: Return a string specifying the flags that are currently set. If the message complies with the conventional format, the result is the concatenation in the following order of zero or one occurrence of each of ``'R'``, ``'O'``, ``'D'``, ``'F'``, and ``'A'``.
uk: Повертає рядок із зазначенням поточних встановлених прапорів. Якщо повідомлення відповідає загальноприйнятому формату, результатом є конкатенація в наступному порядку нуля або одного входження кожного з ``'R'``, ``'O'``, ``'D'``, ``'F''`` і ``'A'``.

source: Set the flags specified by *flags* and unset all others. Parameter *flags* should be the concatenation in any order of zero or more occurrences of each of ``'R'``, ``'O'``, ``'D'``, ``'F'``, and ``'A'``.
uk: Встановіть прапорці, визначені *flags*, і скасуйте всі інші. Параметр *flags* має бути конкатенацією в будь-якому порядку нуля або більше входжень кожного з ``'R'``, ``'O'``, ``'D'``, ``'F'`` і ``'A'``.

source: Set the flag(s) specified by *flag* without changing other flags. To add more than one flag at a time, *flag* may be a string of more than one character.
uk: Встановіть прапор(и), визначені *flag*, не змінюючи інші прапори. Щоб додати більше ніж один прапор одночасно, *flag* може бути рядком із кількох символів.

source: Unset the flag(s) specified by *flag* without changing other flags. To remove more than one flag at a time, *flag* maybe a string of more than one character.
uk: Скасувати прапор(и), визначені *flag*, не змінюючи інші прапори. Щоб видалити кілька прапорців одночасно, *flag* може бути рядком із кількох символів.

source: When an :class:`mboxMessage` instance is created based upon a :class:`MaildirMessage` instance, a "From " line is generated based upon the :class:`MaildirMessage` instance's delivery date, and the following conversions take place:
uk: Коли екземпляр :class:`mboxMessage` створюється на основі екземпляра :class:`MaildirMessage`, рядок "Від" створюється на основі дати доставки екземпляра :class:`MaildirMessage` і відбуваються такі перетворення:

source: :class:`MaildirMessage` state
uk: :class:`MaildirMessage` стан

source: When an :class:`mboxMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
uk: Коли примірник :class:`mboxMessage` створюється на основі примірника :class:`MHMessage`, відбуваються такі перетворення:

source: R flag and O flag
uk: Прапор R і прапор O

source: When an :class:`mboxMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
uk: Коли примірник :class:`mboxMessage` створюється на основі примірника :class:`BabylMessage`, відбуваються такі перетворення:

source: When a :class:`Message` instance is created based upon an :class:`MMDFMessage` instance, the "From " line is copied and all flags directly correspond:
uk: Коли екземпляр :class:`Message` створюється на основі екземпляра :class:`MMDFMessage`, рядок "Від" копіюється, і всі позначки безпосередньо відповідають:

source: :class:`MMDFMessage` state
uk: :class:`MMDFMessage` стан

source: A message with MH-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
uk: Повідомлення зі специфічними для MH поведінками. Параметр *message* має те саме значення, що й у конструкторі :class:`Message`.

source: MH messages do not support marks or flags in the traditional sense, but they do support sequences, which are logical groupings of arbitrary messages. Some mail reading programs (although not the standard :program:`mh` and :program:`nmh`) use sequences in much the same way flags are used with other formats, as follows:
uk: Повідомлення MH не підтримують позначки чи прапорці в традиційному розумінні, але вони підтримують послідовності, які є логічними групами довільних повідомлень. Деякі програми читання пошти (хоча не стандартні :program:`mh` і :program:`nmh`) використовують послідовності приблизно так само, як прапорці використовуються з іншими форматами, а саме:

source: Sequence
uk: Послідовність

source: unseen
uk: невидимий

source: Not read, but previously detected by MUA
uk: Не прочитано, але раніше виявлено MUA

source: replied
uk: відповів

source: flagged
uk: позначено

source: :class:`MHMessage` instances offer the following methods:
uk: Екземпляри :class:`MHMessage` пропонують такі методи:

source: Return a list of the names of sequences that include this message.
uk: Повернути список імен послідовностей, які містять це повідомлення.

source: Set the list of sequences that include this message.
uk: Встановіть список послідовностей, які включають це повідомлення.

source: Add *sequence* to the list of sequences that include this message.
uk: Додайте *послідовність* до списку послідовностей, які містять це повідомлення.

source: Remove *sequence* from the list of sequences that include this message.
uk: Видаліть *послідовність* зі списку послідовностей, які містять це повідомлення.

source: When an :class:`MHMessage` instance is created based upon a :class:`MaildirMessage` instance, the following conversions take place:
uk: Коли примірник :class:`MHMessage` створюється на основі примірника :class:`MaildirMessage`, відбуваються такі перетворення:

source: no S flag
uk: немає прапора S

source: When an :class:`MHMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
uk: Коли екземпляр :class:`MHMessage` створюється на основі екземпляра :class:`mboxMessage` або :class:`MMDFMessage`, заголовки :mailheader:`Status` і :mailheader:`X-Status` пропускаються, а відбуваються такі перетворення:

source: no R flag
uk: немає прапора R

source: When an :class:`MHMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
uk: Коли примірник :class:`MHMessage` створюється на основі примірника :class:`BabylMessage`, відбуваються такі перетворення:
