Repository: python/python-docs-uk
Catalog: library/mailbox.po
Languages: uk

source: A message with Babyl-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
uk: Повідомлення з особливостями поведінки Babyl. Параметр *message* має те саме значення, що й у конструкторі :class:`Message`.

source: Certain message labels, called :dfn:`attributes`, are defined by convention to have special meanings. The attributes are as follows:
uk: Певні мітки повідомлень, які називаються :dfn:`attributes`, визначені угодою як такі, що мають спеціальні значення. Атрибути такі:

source: Label
uk: Мітка

source: deleted
uk: видалено

source: filed
uk: подано

source: Copied to another file or mailbox
uk: Скопійовано в інший файл або поштову скриньку

source: answered
uk: відповів

source: forwarded
uk: пересилається

source: Forwarded
uk: Переслано

source: edited
uk: відредаговано

source: Modified by the user
uk: Змінено користувачем

source: resent
uk: обурюватися

source: Resent
uk: Обурюватися

source: By default, Rmail displays only visible headers. The :class:`BabylMessage` class, though, uses the original headers because they are more complete. Visible headers may be accessed explicitly if desired.
uk: За замовчуванням Rmail відображає лише видимі заголовки. Клас :class:`BabylMessage`, однак, використовує оригінальні заголовки, оскільки вони більш повні. За бажанням доступ до видимих заголовків можна отримати явно.

source: :class:`BabylMessage` instances offer the following methods:
uk: Екземпляри :class:`BabylMessage` пропонують такі методи:

source: Return a list of labels on the message.
uk: Повернути список міток у повідомленні.

source: Set the list of labels on the message to *labels*.
uk: Установіть список міток у повідомленні на *мітки*.

source: Add *label* to the list of labels on the message.
uk: Додайте *label* до списку міток у повідомленні.

source: Remove *label* from the list of labels on the message.
uk: Видаліть *label* зі списку міток у повідомленні.

source: Return an :class:`Message` instance whose headers are the message's visible headers and whose body is empty.
uk: Повертає екземпляр :class:`Message`, заголовки якого є видимими заголовками повідомлення, а тіло порожнє.

source: Set the message's visible headers to be the same as the headers in *message*. Parameter *visible* should be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, or a file-like object (which should be open in text mode).
uk: Налаштуйте видимі заголовки повідомлення такими ж, як заголовки в *повідомленні*. Параметр *visible* має бути екземпляром :class:`Message`, екземпляром :class:`email.message.Message`, рядком або файлоподібним об’єктом (який має бути відкритий у текстовому режимі).

source: When a :class:`BabylMessage` instance's original headers are modified, the visible headers are not automatically modified to correspond. This method updates the visible headers as follows: each visible header with a corresponding original header is set to the value of the original header, each visible header without a corresponding original header is removed, and any of :mailheader:`Date`, :mailheader:`From`, :mailheader:`Reply-To`, :mailheader:`To`, :mailheader:`CC`, and :mailheader:`Subject` that are present in the original headers but not the visible headers are added to the visible headers.
uk: Коли оригінальні заголовки примірника :class:`BabylMessage` змінюються, видимі заголовки не змінюються автоматично відповідно. Цей метод оновлює видимі заголовки наступним чином: для кожного видимого заголовка з відповідним оригінальним заголовком встановлюється значення оригінального заголовка, кожен видимий заголовок без відповідного оригінального заголовка видаляється, а будь-який із :mailheader:`Date`, :mailheader:`From`, :mailheader:`Reply-To`, :mailheader:`To`, :mailheader:`CC` і :mailheader:`Subject`, які присутні в оригінальних заголовках, але не у видимих заголовках, додаються до видимі заголовки.

source: When a :class:`BabylMessage` instance is created based upon a :class:`MaildirMessage` instance, the following conversions take place:
uk: Коли примірник :class:`BabylMessage` створюється на основі примірника :class:`MaildirMessage`, відбуваються такі перетворення:

source: "forwarded" label
uk: мітка "переслано".

source: When a :class:`BabylMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
uk: Коли екземпляр :class:`BabylMessage` створюється на основі екземпляра :class:`mboxMessage` або :class:`MMDFMessage`, заголовки :mailheader:`Status` і :mailheader:`X-Status` пропускаються, а відбуваються такі перетворення:

source: When a :class:`BabylMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
uk: Коли примірник :class:`BabylMessage` створюється на основі примірника :class:`MHMessage`, відбуваються такі перетворення:

source: A message with MMDF-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
uk: Повідомлення зі специфічною для MMDF поведінкою. Параметр *message* має те саме значення, що й у конструкторі :class:`Message`.

source: As with message in an mbox mailbox, MMDF messages are stored with the sender's address and the delivery date in an initial line beginning with "From ". Likewise, flags that indicate the state of the message are typically stored in :mailheader:`Status` and :mailheader:`X-Status` headers.
uk: Як і повідомлення в поштовій скриньці mbox, повідомлення MMDF зберігаються з адресою відправника та датою доставки в початковому рядку, що починається з "Від". Подібним чином прапорці, які вказують на стан повідомлення, зазвичай зберігаються в заголовках :mailheader:`Status` і :mailheader:`X-Status`.

source: Conventional flags for MMDF messages are identical to those of mbox message and are as follows:
uk: Звичайні позначки для повідомлень MMDF ідентичні прапорцям для повідомлень mbox і такі:

source: :class:`MMDFMessage` instances offer the following methods, which are identical to those offered by :class:`mboxMessage`:
uk: Екземпляри :class:`MMDFMessage` пропонують такі методи, ідентичні тим, які пропонує :class:`mboxMessage`:

source: When an :class:`MMDFMessage` instance is created based upon a :class:`MaildirMessage` instance, a "From " line is generated based upon the :class:`MaildirMessage` instance's delivery date, and the following conversions take place:
uk: Коли екземпляр :class:`MMDFMessage` створюється на основі екземпляра :class:`MaildirMessage`, рядок "Від" створюється на основі дати доставки екземпляра :class:`MaildirMessage` і відбуваються такі перетворення:

source: When an :class:`MMDFMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
uk: Коли примірник :class:`MMDFMessage` створюється на основі примірника :class:`MHMessage`, відбуваються такі перетворення:

source: When an :class:`MMDFMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
uk: Коли примірник :class:`MMDFMessage` створюється на основі примірника :class:`BabylMessage`, відбуваються такі перетворення:

source: When an :class:`MMDFMessage` instance is created based upon an :class:`mboxMessage` instance, the "From " line is copied and all flags directly correspond:
uk: Коли екземпляр :class:`MMDFMessage` створюється на основі екземпляра :class:`mboxMessage`, рядок "Від" копіюється, і всі позначки безпосередньо відповідають:

source: :class:`mboxMessage` state
uk: :class:`mboxMessage` стан

source: Exceptions
uk: Винятки

source: The following exception classes are defined in the :mod:`mailbox` module:
uk: Наступні класи винятків визначені в модулі :mod:`mailbox`:

source: The based class for all other module-specific exceptions.
uk: Основний клас для всіх інших винятків, специфічних для модуля.

source: Raised when a mailbox is expected but is not found, such as when instantiating a :class:`Mailbox` subclass with a path that does not exist (and with the *create* parameter set to ``False``), or when opening a folder that does not exist.
uk: Викликається, коли поштова скринька очікується, але не знайдена, наприклад, під час створення екземпляра підкласу :class:`Mailbox` із шляхом, якого не існує (і з параметром *create*, встановленим на ``False``), або під час відкриття папку, яка не існує.

source: Raised when a mailbox is not empty but is expected to be, such as when deleting a folder that contains messages.
uk: Викликається, коли поштова скринька не порожня, але очікується, що вона буде порожньою, наприклад, під час видалення папки, яка містить повідомлення.

source: Raised when some mailbox-related condition beyond the control of the program causes it to be unable to proceed, such as when failing to acquire a lock that another program already holds a lock, or when a uniquely-generated file name already exists.
uk: Викликається, коли якась умова, пов’язана з поштовою скринькою, поза контролем програми, спричиняє її нездатність продовжити, наприклад, коли не вдається отримати блокування, коли інша програма вже утримує блокування, або коли вже існує унікальне згенероване ім’я файлу.

source: Raised when the data in a file cannot be parsed, such as when an :class:`MH` instance attempts to read a corrupted :file:`.mh_sequences` file.
uk: Викликається, коли дані у файлі неможливо проаналізувати, наприклад, коли примірник :class:`MH` намагається прочитати пошкоджений файл :file:`.mh_sequences`.

source: Examples
uk: Приклади

source: A simple example of printing the subjects of all messages in a mailbox that seem interesting::
uk: Простий приклад друку тем усіх повідомлень у поштовій скриньці, які здаються цікавими:

source: To copy all mail from a Babyl mailbox to an MH mailbox, converting all of the format-specific information that can be converted::
uk: Щоб скопіювати всю пошту з поштової скриньки Babyl до поштової скриньки MH, перетворивши всю інформацію про певний формат, яку можна конвертувати:

source: This example sorts mail from several mailing lists into different mailboxes, being careful to avoid mail corruption due to concurrent modification by other programs, mail loss due to interruption of the program, or premature termination due to malformed messages in the mailbox::
uk: Цей приклад сортує пошту з кількох списків розсилки в різні поштові скриньки, намагаючись уникнути пошкодження пошти через одночасну модифікацію іншими програмами, втрати пошти через переривання програми або передчасне завершення через неправильно сформовані повідомлення в поштовій скриньці::
