Repository: python/python-docs-uk
Catalog: library/mimetypes.po
Languages: uk

source: **Source code:** :source:`Lib/mimetypes.py`
uk: **Вихідний код:** :source:`Lib/mimetypes.py`

source: The :mod:`mimetypes` module converts between a filename or URL and the MIME type associated with the filename extension. Conversions are provided from filename to MIME type and from MIME type to filename extension; encodings are not supported for the latter conversion.
uk: Модуль :mod:`mimetypes` перетворює назву файлу або URL-адресу на тип MIME, пов’язаний із розширенням назви файлу. Передбачено перетворення імені файлу в тип MIME та типу MIME у розширення імені файла; кодування не підтримуються для останнього перетворення.

source: The module provides one class and a number of convenience functions. The functions are the normal interface to this module, but some applications may be interested in the class as well.
uk: Модуль надає один клас і ряд зручних функцій. Функції є звичайним інтерфейсом для цього модуля, але деякі програми також можуть бути зацікавлені в класі.

source: The functions described below provide the primary interface for this module. If the module has not been initialized, they will call :func:`init` if they rely on the information :func:`init` sets up.
uk: Описані нижче функції забезпечують основний інтерфейс для цього модуля. Якщо модуль не було ініціалізовано, вони викличуть :func:`init`, якщо вони покладаються на інформацію, встановлену :func:`init`.

source: Guess the type of a file based on its filename, path or URL, given by *url*. URL can be a string or a :term:`path-like object`.
uk: Вгадайте тип файлу на основі його назви файлу, шляху або URL-адреси, заданої *url*. URL-адреса може бути рядком або :term:`path-like object`.

source: The return value is a tuple ``(type, encoding)`` where *type* is ``None`` if the type can't be guessed (missing or unknown suffix) or a string of the form ``'type/subtype'``, usable for a MIME :mailheader:`content-type` header.
uk: Поверненим значенням є кортеж ``(тип, кодування)``, де *type* є ``None``, якщо тип неможливо вгадати (відсутній або невідомий суфікс), або рядок у формі ``'type/ subtype''``, який можна використовувати для заголовка MIME :mailheader:`content-type`.

source: *encoding* is ``None`` for no encoding or the name of the program used to encode (e.g. :program:`compress` or :program:`gzip`). The encoding is suitable for use as a :mailheader:`Content-Encoding` header, **not** as a :mailheader:`Content-Transfer-Encoding` header. The mappings are table driven. Encoding suffixes are case sensitive; type suffixes are first tried case sensitively, then case insensitively.
uk: *encoding* — це ``None`` для відсутності кодування або назви програми, що використовується для кодування (наприклад, :program:`compress` або :program:`gzip`). Кодування підходить для використання як заголовок :mailheader:`Content-Encoding`, **не** як заголовок :mailheader:`Content-Transfer-Encoding`. Відображення керуються таблицею. Суфікси кодування чутливі до регістру; Суфікси типу спочатку перевіряються з урахуванням регістру, потім без урахування регістру.

source: The optional *strict* argument is a flag specifying whether the list of known MIME types is limited to only the official types `registered with IANA <https://www.iana.org/assignments/media-types/media-types.xhtml>`_. When *strict* is ``True`` (the default), only the IANA types are supported; when *strict* is ``False``, some additional non-standard but commonly used MIME types are also recognized.
uk: Необов’язковий аргумент *strict* — це прапорець, який визначає, чи обмежено список відомих типів MIME лише офіційними типами, `зареєстрованими в IANA <https://www.iana.org/assignments/media-types/media-types.xhtml>`_. Якщо *strict* має значення ``True`` (за замовчуванням), підтримуються лише типи IANA; коли *strict* має значення ``False``, також розпізнаються деякі додаткові нестандартні, але часто використовувані типи MIME.

source: The optional *strict* argument has the same meaning as with the :func:`guess_type` function.
uk: Необов’язковий аргумент *strict* має те саме значення, що й функція :func:`guess_type`.

source: Some additional functions and data items are available for controlling the behavior of the module.
uk: Деякі додаткові функції та елементи даних доступні для керування поведінкою модуля.

source: Initialize the internal data structures. If given, *files* must be a sequence of file names which should be used to augment the default type map. If omitted, the file names to use are taken from :const:`knownfiles`; on Windows, the current registry settings are loaded. Each file named in *files* or :const:`knownfiles` takes precedence over those named before it. Calling :func:`init` repeatedly is allowed.
uk: Ініціалізація внутрішніх структур даних. Якщо задано, *files* має бути послідовністю імен файлів, які слід використовувати для доповнення карти типів за замовчуванням. Якщо опущено, імена файлів для використання беруться з :const:`knownfiles`; у Windows завантажуються поточні параметри реєстру. Кожен файл, названий у *files* або :const:`knownfiles`, має пріоритет над файлами, названими перед ним. Повторний виклик :func:`init` дозволено.

source: Specifying an empty list for *files* will prevent the system defaults from being applied: only the well-known values will be present from a built-in list.
uk: Якщо вказати порожній список для *файлів*, системні параметри за замовчуванням не будуть застосовані: із вбудованого списку будуть присутні лише добре відомі значення.

source: If *files* is ``None`` the internal data structure is completely rebuilt to its initial default value. This is a stable operation and will produce the same results when called multiple times.
uk: Якщо *files* має значення ``None``, внутрішня структура даних повністю перебудовується до початкового значення за замовчуванням. Це стабільна операція, яка дає однакові результати при багаторазовому виклику.

source: Previously, Windows registry settings were ignored.
uk: Раніше параметри реєстру Windows ігнорувалися.

source: Load the type map given in the file *filename*, if it exists. The type map is returned as a dictionary mapping filename extensions, including the leading dot (``'.'``), to strings of the form ``'type/subtype'``. If the file *filename* does not exist or cannot be read, ``None`` is returned.
uk: Завантажте карту типів, указану у файлі *filename*, якщо вона існує. Карта типів повертається як словник, який зіставляє розширення імен файлів, включаючи початкову крапку (``'.''``), на рядки у формі ``'тип/підтип'``. Якщо файл *filename* не існує або не може бути прочитаний, повертається ``None``.

source: Add a mapping from the MIME type *type* to the extension *ext*. When the extension is already known, the new type will replace the old one. When the type is already known the extension will be added to the list of known extensions.
uk: Додайте зіставлення типу MIME *type* з розширенням *ext*. Коли розширення вже відомо, новий тип замінить старий. Якщо тип уже відомий, розширення буде додано до списку відомих розширень.

source: When *strict* is ``True`` (the default), the mapping will be added to the official MIME types, otherwise to the non-standard ones.
uk: Якщо *strict* має значення ``True`` (за замовчуванням), відображення буде додано до офіційних типів MIME, інакше – до нестандартних.

source: Flag indicating whether or not the global data structures have been initialized. This is set to ``True`` by :func:`init`.
uk: Прапорець, що вказує, чи ініціалізовано глобальні структури даних. :func:`init` встановлює значення ``True``.

source: List of type map file names commonly installed. These files are typically named :file:`mime.types` and are installed in different locations by different packages.
uk: Список імен типових файлів карт, які зазвичай встановлюються. Ці файли зазвичай називаються :file:`mime.types` і встановлюються в різних місцях різними пакетами.

source: Dictionary mapping suffixes to suffixes. This is used to allow recognition of encoded files for which the encoding and the type are indicated by the same extension. For example, the :file:`.tgz` extension is mapped to :file:`.tar.gz` to allow the encoding and type to be recognized separately.
uk: Словник зіставлення суфіксів із суфіксами. Це використовується для розпізнавання закодованих файлів, для яких кодування та тип позначено тим самим розширенням. Наприклад, розширення :file:`.tgz` зіставляється з :file:`.tar.gz`, щоб дозволити кодування та тип розпізнаватися окремо.

source: Dictionary mapping filename extensions to encoding types.
uk: Словник зіставляє розширення імен файлів із типами кодування.

source: Dictionary mapping filename extensions to MIME types.
uk: Словник зіставляє розширення імен файлів із типами MIME.

source: Dictionary mapping filename extensions to non-standard, but commonly found MIME types.
uk: Словник зіставляє розширення імен файлів із нестандартними, але часто зустрічаються типами MIME.

source: An example usage of the module::
uk: Приклад використання модуля::

source: MimeTypes Objects
uk: Об’єкти MimeTypes

source: The :class:`MimeTypes` class may be useful for applications which may want more than one MIME-type database; it provides an interface similar to the one of the :mod:`mimetypes` module.
uk: Клас :class:`MimeTypes` може бути корисним для програм, яким може знадобитися більше однієї бази даних типу MIME; він забезпечує інтерфейс, подібний до інтерфейсу модуля :mod:`mimetypes`.

source: This class represents a MIME-types database. By default, it provides access to the same database as the rest of this module. The initial database is a copy of that provided by the module, and may be extended by loading additional :file:`mime.types`\ -style files into the database using the :meth:`read` or :meth:`readfp` methods. The mapping dictionaries may also be cleared before loading additional data if the default data is not desired.
uk: Цей клас представляє базу даних типів MIME. За замовчуванням він надає доступ до тієї самої бази даних, що й решта цього модуля. Початкова база даних є копією тієї, що надається модулем, і може бути розширена шляхом завантаження додаткових файлів у стилі :file:`mime.types`\ у базу даних за допомогою :meth:`read` або :meth:`readfp` методи. Словники зіставлення також можна очистити перед завантаженням додаткових даних, якщо дані за замовчуванням не потрібні.

source: The optional *filenames* parameter can be used to cause additional files to be loaded "on top" of the default database.
uk: Необов’язковий параметр *filenames* можна використовувати, щоб завантажувати додаткові файли "поверх" бази даних за замовчуванням.

source: Dictionary mapping suffixes to suffixes. This is used to allow recognition of encoded files for which the encoding and the type are indicated by the same extension. For example, the :file:`.tgz` extension is mapped to :file:`.tar.gz` to allow the encoding and type to be recognized separately. This is initially a copy of the global :data:`suffix_map` defined in the module.
uk: Словник зіставлення суфіксів із суфіксами. Це використовується для розпізнавання закодованих файлів, для яких кодування та тип позначено тим самим розширенням. Наприклад, розширення :file:`.tgz` зіставляється з :file:`.tar.gz`, щоб дозволити кодування та тип розпізнаватися окремо. Спочатку це копія глобального :data:`suffix_map`, визначеного в модулі.

source: Dictionary mapping filename extensions to encoding types. This is initially a copy of the global :data:`encodings_map` defined in the module.
uk: Словник зіставляє розширення імен файлів із типами кодування. Спочатку це копія глобального :data:`encodings_map`, визначеного в модулі.

source: Tuple containing two dictionaries, mapping filename extensions to MIME types: the first dictionary is for the non-standards types and the second one is for the standard types. They are initialized by :data:`common_types` and :data:`types_map`.
uk: Кортеж, що містить два словники, зіставляючи розширення імен файлів із типами MIME: перший словник призначений для нестандартних типів, а другий — для стандартних типів. Вони ініціалізуються :data:`common_types` і :data:`types_map`.

source: Tuple containing two dictionaries, mapping MIME types to a list of filename extensions: the first dictionary is for the non-standards types and the second one is for the standard types. They are initialized by :data:`common_types` and :data:`types_map`.
uk: Кортеж, що містить два словники, зіставляючи типи MIME зі списком розширень імен файлів: перший словник призначений для нестандартних типів, а другий — для стандартних типів. Вони ініціалізуються :data:`common_types` і :data:`types_map`.

source: Similar to the :func:`guess_extension` function, using the tables stored as part of the object.
uk: Подібно до функції :func:`guess_extension`, використовуючи таблиці, що зберігаються як частина об’єкта.

source: Similar to the :func:`guess_type` function, using the tables stored as part of the object.
uk: Подібно до функції :func:`guess_type`, використовуючи таблиці, що зберігаються як частина об’єкта.

source: Similar to the :func:`guess_all_extensions` function, using the tables stored as part of the object.
uk: Подібно до функції :func:`guess_all_extensions`, використовуючи таблиці, що зберігаються як частина об’єкта.

source: Load MIME information from a file named *filename*. This uses :meth:`readfp` to parse the file.
uk: Завантажте інформацію MIME з файлу з іменем *filename*. Це використовує :meth:`readfp` для аналізу файлу.

source: If *strict* is ``True``, information will be added to list of standard types, else to the list of non-standard types.
uk: Якщо *strict* має значення ``True``, інформацію буде додано до списку стандартних типів, інакше до списку нестандартних типів.

source: Load MIME type information from an open file *fp*. The file must have the format of the standard :file:`mime.types` files.
uk: Завантажте інформацію про тип MIME із відкритого файлу *fp*. Файл повинен мати формат стандартних файлів :file:`mime.types`.

source: If *strict* is ``True``, information will be added to the list of standard types, else to the list of non-standard types.
uk: Якщо *strict* має значення ``True``, інформацію буде додано до списку стандартних типів, інакше – до списку нестандартних типів.

source: Load MIME type information from the Windows registry.
uk: Завантажте інформацію про тип MIME з реєстру Windows.
