Repository: python/python-docs-uk
Catalog: library/modulefinder.po
Languages: uk

source: **Source code:** :source:`Lib/modulefinder.py`
uk: **Вихідний код:** :source:`Lib/modulefinder.py`

source: This module provides a :class:`ModuleFinder` class that can be used to determine the set of modules imported by a script. ``modulefinder.py`` can also be run as a script, giving the filename of a Python script as its argument, after which a report of the imported modules will be printed.
uk: Цей модуль надає клас :class:`ModuleFinder`, який можна використовувати для визначення набору модулів, імпортованих сценарієм. ``modulefinder.py`` також можна запустити як сценарій, надаючи назву файлу сценарію Python як аргумент, після чого буде надруковано звіт про імпортовані модулі.

source: Record that the package named *pkg_name* can be found in the specified *path*.
uk: Запишіть, що пакет із назвою *pkg_name* можна знайти у вказаному *шляху*.

source: Allows specifying that the module named *oldname* is in fact the package named *newname*.
uk: Дозволяє вказати, що модуль з назвою *oldname* насправді є пакетом з назвою *newname*.

source: This class provides :meth:`run_script` and :meth:`report` methods to determine the set of modules imported by a script. *path* can be a list of directories to search for modules; if not specified, ``sys.path`` is used. *debug* sets the debugging level; higher values make the class print debugging messages about what it's doing. *excludes* is a list of module names to exclude from the analysis. *replace_paths* is a list of ``(oldpath, newpath)`` tuples that will be replaced in module paths.
uk: Цей клас надає методи :meth:`run_script` і :meth:`report` для визначення набору модулів, імпортованих сценарієм. *шлях* може бути списком каталогів для пошуку модулів; якщо не вказано, використовується ``sys.path``. *debug* встановлює рівень налагодження; вищі значення змушують клас друкувати повідомлення про те, що він робить. *excludes* — список імен модулів, які потрібно виключити з аналізу. *replace_paths* — це список кортежів ``(oldpath, newpath)``, які будуть замінені в шляхах модуля.

source: Print a report to standard output that lists the modules imported by the script and their paths, as well as modules that are missing or seem to be missing.
uk: Роздрукуйте звіт у стандартний вихід із переліком модулів, імпортованих сценарієм, і їхніх шляхів, а також модулів, які відсутні або здаються відсутніми.

source: Analyze the contents of the *pathname* file, which must contain Python code.
uk: Проаналізуйте вміст файлу *pathname*, який повинен містити код Python.

source: A dictionary mapping module names to modules. See :ref:`modulefinder-example`.
uk: Словник зіставляє імена модулів із модулями. Див. :ref:`modulefinder-example`.

source: Example usage of :class:`ModuleFinder`
uk: Приклад використання :class:`ModuleFinder`

source: The script that is going to get analyzed later on (bacon.py)::
uk: Сценарій, який буде проаналізовано пізніше (bacon.py):

source: The script that will output the report of bacon.py::
uk: Сценарій, який виведе звіт bacon.py::

source: Sample output (may vary depending on the architecture)::
uk: Зразок вихідних даних (може відрізнятися залежно від архітектури):
