Repository: python/python-docs-uk
Catalog: library/msvcrt.po
Languages: uk

source: :mod:`msvcrt` --- Useful routines from the MS VC++ runtime
uk: :mod:`msvcrt` --- Корисні процедури із середовища виконання MS VC++

source: These functions provide access to some useful capabilities on Windows platforms. Some higher-level modules use these functions to build the Windows implementations of their services. For example, the :mod:`getpass` module uses this in the implementation of the :func:`getpass` function.
uk: Ці функції надають доступ до деяких корисних можливостей на платформах Windows. Деякі модулі вищого рівня використовують ці функції для створення реалізацій Windows своїх служб. Наприклад, модуль :mod:`getpass` використовує це в реалізації функції :func:`getpass`.

source: Further documentation on these functions can be found in the Platform API documentation.
uk: Додаткову документацію щодо цих функцій можна знайти в документації API платформи.

source: The module implements both the normal and wide char variants of the console I/O api. The normal API deals only with ASCII characters and is of limited use for internationalized applications. The wide char API should be used where ever possible.
uk: Модуль реалізує як звичайний, так і широкий варіанти char API консолі вводу-виводу. Звичайний API працює лише з символами ASCII і обмежено використовується для інтернаціоналізованих програм. Широкий char API слід використовувати, де це можливо.

source: Operations in this module now raise :exc:`OSError` where :exc:`IOError` was raised.
uk: Операції в цьому модулі тепер викликають :exc:`OSError` там, де було викликано :exc:`IOError`.

source: File Operations
uk: Операції з файлами

source: Lock part of a file based on file descriptor *fd* from the C runtime. Raises :exc:`OSError` on failure. The locked region of the file extends from the current file position for *nbytes* bytes, and may continue beyond the end of the file. *mode* must be one of the :const:`LK_\*` constants listed below. Multiple regions in a file may be locked at the same time, but may not overlap. Adjacent regions are not merged; they must be unlocked individually.
uk: Блокування частини файлу на основі файлового дескриптора *fd* із середовища виконання C. Викликає :exc:`OSError` у разі помилки. Заблокована область файлу простягається від поточної позиції файлу на *nbytes* байтів і може продовжуватися після кінця файлу. *mode* має бути однією з констант :const:`LK_\*`, наведених нижче. Кілька областей у файлі можуть бути заблоковані одночасно, але не можуть перекриватися. Суміжні регіони не об'єднуються; їх необхідно розблокувати окремо.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.locking`` with arguments ``fd``, ``mode``, ``nbytes``.
uk: Викликає :ref:`подію аудиту <auditing>` ``msvcrt.locking`` з аргументами ``fd``, ``mode``, ``nbytes``.

source: Locks the specified bytes. If the bytes cannot be locked, the program immediately tries again after 1 second. If, after 10 attempts, the bytes cannot be locked, :exc:`OSError` is raised.
uk: Блокує вказані байти. Якщо байти неможливо заблокувати, програма негайно повторить спробу через 1 секунду. Якщо після 10 спроб не вдається заблокувати байти, виникає :exc:`OSError`.

source: Locks the specified bytes. If the bytes cannot be locked, :exc:`OSError` is raised.
uk: Блокує вказані байти. Якщо байти неможливо заблокувати, виникає :exc:`OSError`.

source: Unlocks the specified bytes, which must have been previously locked.
uk: Розблоковує вказані байти, які мають бути попередньо заблоковані.

source: Set the line-end translation mode for the file descriptor *fd*. To set it to text mode, *flags* should be :const:`os.O_TEXT`; for binary, it should be :const:`os.O_BINARY`.
uk: Встановіть режим перекладу кінця рядка для дескриптора файлу *fd*. Щоб встановити його в текстовий режим, *flags* має бути :const:`os.O_TEXT`; для двійкового файлу це має бути :const:`os.O_BINARY`.

source: Create a C runtime file descriptor from the file handle *handle*. The *flags* parameter should be a bitwise OR of :const:`os.O_APPEND`, :const:`os.O_RDONLY`, and :const:`os.O_TEXT`. The returned file descriptor may be used as a parameter to :func:`os.fdopen` to create a file object.
uk: Створіть файловий дескриптор середовища виконання C з дескриптора файлу *handle*. Параметр *flags* має бути порозрядним АБО :const:`os.O_APPEND`, :const:`os.O_RDONLY` і :const:`os.O_TEXT`. Повернений файловий дескриптор можна використовувати як параметр для :func:`os.fdopen` для створення файлового об’єкта.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.open_osfhandle`` with arguments ``handle``, ``flags``.
uk: Викликає :ref:`подію аудиту <auditing>` ``msvcrt.open_osfhandle`` з аргументами ``handle``, ``flags``.

source: Return the file handle for the file descriptor *fd*. Raises :exc:`OSError` if *fd* is not recognized.
uk: Повертає дескриптор файлу для дескриптора файлу *fd*. Викликає :exc:`OSError`, якщо *fd* не розпізнається.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.get_osfhandle`` with argument ``fd``.
uk: Викликає :ref:`подію аудиту <auditing>` ``msvcrt.get_osfhandle`` з аргументом ``fd``.

source: Console I/O
uk: Консоль введення/виведення

source: Return ``True`` if a keypress is waiting to be read.
uk: Повертає ``True``, якщо натискання клавіші очікує на прочитання.

source: Read a keypress and return the resulting character as a byte string. Nothing is echoed to the console. This call will block if a keypress is not already available, but will not wait for :kbd:`Enter` to be pressed. If the pressed key was a special function key, this will return ``'\000'`` or ``'\xe0'``; the next call will return the keycode. The :kbd:`Control-C` keypress cannot be read with this function.
uk: Зчитування натискання клавіші та повернення отриманого символу як рядок байтів. На консоль нічого не відтворюється. Цей виклик буде заблоковано, якщо натискання клавіші ще не доступне, але не чекатиме, поки буде натиснуто :kbd:`Enter`. Якщо натиснута клавіша була спеціальною функціональною, це поверне ``'\000'`` або ``'\xe0'``; наступний виклик поверне код ключа. Натискання клавіші :kbd:`Control-C` не можна прочитати за допомогою цієї функції.

source: Wide char variant of :func:`getch`, returning a Unicode value.
uk: Широкосимвольний варіант :func:`getch`, що повертає значення Unicode.

source: Similar to :func:`getch`, but the keypress will be echoed if it represents a printable character.
uk: Подібно до :func:`getch`, але натискання клавіші повторюватиметься, якщо воно представляє друкований символ.

source: Wide char variant of :func:`getche`, returning a Unicode value.
uk: Широкосимвольний варіант :func:`getche`, що повертає значення Unicode.

source: Print the byte string *char* to the console without buffering.
uk: Вивести рядок байтів *char* на консоль без буферизації.

source: Wide char variant of :func:`putch`, accepting a Unicode value.
uk: Широкосимвольний варіант :func:`putch`, що приймає значення Unicode.

source: Cause the byte string *char* to be "pushed back" into the console buffer; it will be the next character read by :func:`getch` or :func:`getche`.
uk: Змусити рядок байтів *char* "відштовхнути назад" у буфер консолі; це буде наступний символ, який читатиме :func:`getch` або :func:`getche`.

source: Wide char variant of :func:`ungetch`, accepting a Unicode value.
uk: Широкосимвольний варіант :func:`ungetch`, який приймає значення Unicode.

source: Other Functions
uk: Інші функції

source: Force the :c:func:`malloc` heap to clean itself up and return unused blocks to the operating system. On failure, this raises :exc:`OSError`.
uk: Примусово очистити купу :c:func:`malloc` і повернути невикористані блоки в операційну систему. У разі помилки це викликає :exc:`OSError`.
