Repository: python/python-docs-uk
Catalog: library/multiprocessing.po
Languages: uk

source: A proxy object has methods which invoke corresponding methods of its referent (although not every method of the referent will necessarily be available through the proxy). In this way, a proxy can be used just like its referent can:
uk: Проксі-об’єкт має методи, які викликають відповідні методи його референта (хоча не кожен метод референта обов’язково буде доступним через проксі). Таким чином, проксі можна використовувати так само, як і його референт:

source: Notice that applying :func:`str` to a proxy will return the representation of the referent, whereas applying :func:`repr` will return the representation of the proxy.
uk: Зауважте, що застосування :func:`str` до проксі поверне подання референта, тоді як застосування :func:`repr` поверне подання проксі.

source: An important feature of proxy objects is that they are picklable so they can be passed between processes. As such, a referent can contain :ref:`multiprocessing-proxy_objects`. This permits nesting of these managed lists, dicts, and other :ref:`multiprocessing-proxy_objects`:
uk: Важливою особливістю проксі-об’єктів є те, що їх можна вибирати, тому їх можна передавати між процесами. Таким чином, референт може містити :ref:`multiprocessing-proxy_objects`. Це дозволяє вкладати ці керовані списки, dicts та інші :ref:`multiprocessing-proxy_objects`:

source: Similarly, dict and list proxies may be nested inside one another::
uk: Подібним чином, проксі dict і список можуть бути вкладені один в одного:

source: If standard (non-proxy) :class:`list` or :class:`dict` objects are contained in a referent, modifications to those mutable values will not be propagated through the manager because the proxy has no way of knowing when the values contained within are modified. However, storing a value in a container proxy (which triggers a ``__setitem__`` on the proxy object) does propagate through the manager and so to effectively modify such an item, one could re-assign the modified value to the container proxy::
uk: Якщо стандартні (не проксі) :class:`list` або :class:`dict` об’єкти містяться в референті, модифікації цих змінних значень не поширюватимуться через менеджер, оскільки проксі не може дізнатися, коли значення що містяться в них, змінено. Однак збереження значення в проксі-контейнері (що запускає ``__setitem__`` в проксі-об’єкті) поширюється через менеджер, тому для ефективної зміни такого елемента можна повторно призначити змінене значення проксі-серверу контейнера: :

source: This approach is perhaps less convenient than employing nested :ref:`multiprocessing-proxy_objects` for most use cases but also demonstrates a level of control over the synchronization.
uk: Цей підхід, можливо, менш зручний, ніж використання вкладених :ref:`multiprocessing-proxy_objects` для більшості випадків використання, але також демонструє рівень контролю над синхронізацією.

source: The proxy types in :mod:`multiprocessing` do nothing to support comparisons by value. So, for instance, we have:
uk: Проксі-типи в :mod:`multiprocessing` не підтримують порівняння за значенням. Так, наприклад, ми маємо:

source: One should just use a copy of the referent instead when making comparisons.
uk: Під час порівнянь слід просто використовувати копію референта.

source: Proxy objects are instances of subclasses of :class:`BaseProxy`.
uk: Проксі-об’єкти є екземплярами підкласів :class:`BaseProxy`.

source: Call and return the result of a method of the proxy's referent.
uk: Виклик і повернення результату методу референта проксі.

source: If ``proxy`` is a proxy whose referent is ``obj`` then the expression ::
uk: Якщо ``proxy`` є проксі, референтом якого є ``obj``, тоді вираз ::

source: will evaluate the expression ::
uk: обчислить вираз ::

source: in the manager's process.
uk: в процесі менеджера.

source: The returned value will be a copy of the result of the call or a proxy to a new shared object -- see documentation for the *method_to_typeid* argument of :meth:`BaseManager.register`.
uk: Поверненим значенням буде копія результату виклику або проксі для нового спільного об’єкта – див. документацію щодо аргументу *method_to_typeid* :meth:`BaseManager.register`.

source: If an exception is raised by the call, then is re-raised by :meth:`_callmethod`. If some other exception is raised in the manager's process then this is converted into a :exc:`RemoteError` exception and is raised by :meth:`_callmethod`.
uk: Якщо виклик викликає виняток, він повторно викликається :meth:`_callmethod`. Якщо в процесі менеджера виникає інший виняток, він перетворюється на виняток :exc:`RemoteError` і викликається :meth:`_callmethod`.

source: Note in particular that an exception will be raised if *methodname* has not been *exposed*.
uk: Зокрема, зауважте, що виняток буде створено, якщо *methodname* не було *виявлено*.

source: An example of the usage of :meth:`_callmethod`:
uk: Приклад використання :meth:`_callmethod`:

source: Return a copy of the referent.
uk: Повернути копію референту.

source: If the referent is unpicklable then this will raise an exception.
uk: Якщо референт неможливо вибрати, це спричинить виняток.

source: Return a representation of the proxy object.
uk: Повертає представлення проксі-об’єкта.

source: Return the representation of the referent.
uk: Повернути представлення референта.

source: Cleanup
uk: Прибирати

source: A proxy object uses a weakref callback so that when it gets garbage collected it deregisters itself from the manager which owns its referent.
uk: Проксі-об’єкт використовує зворотний виклик weakref, щоб, коли він збирає сміття, він скасовує реєстрацію в менеджері, якому належить його референт.

source: A shared object gets deleted from the manager process when there are no longer any proxies referring to it.
uk: Спільний об’єкт видаляється з процесу менеджера, коли більше немає проксі-серверів, які посилаються на нього.

source: Process Pools
uk: Пули процесів

source: One can create a pool of processes which will carry out tasks submitted to it with the :class:`Pool` class.
uk: Можна створити пул процесів, які виконуватимуть передані йому завдання за допомогою класу :class:`Pool`.

source: A process pool object which controls a pool of worker processes to which jobs can be submitted. It supports asynchronous results with timeouts and callbacks and has a parallel map implementation.
uk: Об’єкт пулу процесів, який керує пулом робочих процесів, до яких можна надсилати завдання. Він підтримує асинхронні результати з тайм-аутами та зворотними викликами та має реалізацію паралельної карти.

source: If *initializer* is not ``None`` then each worker process will call ``initializer(*initargs)`` when it starts.
uk: Якщо *initializer* не ``None``, тоді кожен робочий процес викличе ``initializer(*initargs)`` під час свого запуску.

source: *maxtasksperchild* is the number of tasks a worker process can complete before it will exit and be replaced with a fresh worker process, to enable unused resources to be freed. The default *maxtasksperchild* is ``None``, which means worker processes will live as long as the pool.
uk: *maxtasksperchild* — це кількість завдань, які робочий процес може виконати, перш ніж він вийде та буде замінений новим робочим процесом, щоб звільнити невикористані ресурси. Типовим значенням *maxtasksperchild* є ``None``, що означає, що робочі процеси живуть стільки ж, скільки пул.

source: *context* can be used to specify the context used for starting the worker processes. Usually a pool is created using the function :func:`multiprocessing.Pool` or the :meth:`Pool` method of a context object. In both cases *context* is set appropriately.
uk: *context* можна використовувати для визначення контексту, який використовується для запуску робочих процесів. Зазвичай пул створюється за допомогою функції :func:`multiprocessing.Pool` або методу :meth:`Pool` контекстного об’єкта. В обох випадках *контекст* встановлено належним чином.

source: Note that the methods of the pool object should only be called by the process which created the pool.
uk: Зауважте, що методи об’єкта пулу має викликати тільки процес, який створив пул.

source: :class:`multiprocessing.pool` objects have internal resources that need to be properly managed (like any other resource) by using the pool as a context manager or by calling :meth:`close` and :meth:`terminate` manually. Failure to do this can lead to the process hanging on finalization.
uk: Об’єкти :class:`multiprocessing.pool` мають внутрішні ресурси, якими потрібно належним чином керувати (як і будь-яким іншим ресурсом), використовуючи пул як контекстний менеджер або викликаючи :meth:`close` і :meth:`terminate` вручну. Якщо цього не зробити, процес може призупинити завершення.

source: Note that it is **not correct** to rely on the garbage collector to destroy the pool as CPython does not assure that the finalizer of the pool will be called (see :meth:`object.__del__` for more information).
uk: Зауважте, що **некоректно** покладатися на збирач сміття для знищення пулу, оскільки CPython не гарантує, що буде викликано фіналізатор пулу (див. :meth:`object.__del__` для отримання додаткової інформації).

source: Worker processes within a :class:`Pool` typically live for the complete duration of the Pool's work queue. A frequent pattern found in other systems (such as Apache, mod_wsgi, etc) to free resources held by workers is to allow a worker within a pool to complete only a set amount of work before being exiting, being cleaned up and a new process spawned to replace the old one. The *maxtasksperchild* argument to the :class:`Pool` exposes this ability to the end user.
uk: Робочі процеси в межах :class:`Pool` зазвичай живі протягом повної тривалості робочої черги пулу. Частий шаблон, який зустрічається в інших системах (таких як Apache, mod_wsgi тощо) для звільнення ресурсів, які зберігаються робочими засобами, полягає в тому, щоб дозволити робочому в межах пулу завершити лише певний обсяг роботи перед виходом, очищенням і породженням нового процесу на заміну старого. Аргумент *maxtasksperchild* для :class:`Pool` надає цю можливість кінцевому користувачеві.

source: Call *func* with arguments *args* and keyword arguments *kwds*. It blocks until the result is ready. Given this blocks, :meth:`apply_async` is better suited for performing work in parallel. Additionally, *func* is only executed in one of the workers of the pool.
uk: Виклик *func* з аргументами *args* і ключовими аргументами *kwds*. Блокується, поки не буде готовий результат. Враховуючи ці блоки, :meth:`apply_async` краще підходить для виконання роботи паралельно. Крім того, *func* виконується лише в одному з воркерів пулу.

source: A variant of the :meth:`apply` method which returns a :class:`~multiprocessing.pool.AsyncResult` object.
uk: Варіант методу :meth:`apply`, який повертає об’єкт :class:`~multiprocessing.pool.AsyncResult`.

source: If *callback* is specified then it should be a callable which accepts a single argument. When the result becomes ready *callback* is applied to it, that is unless the call failed, in which case the *error_callback* is applied instead.
uk: Якщо вказано *callback*, це має бути виклик, який приймає один аргумент. Коли результат стає готовим, до нього застосовується *callback*, якщо тільки виклик не вдався, у цьому випадку замість нього застосовується *error_callback*.

source: If *error_callback* is specified then it should be a callable which accepts a single argument. If the target function fails, then the *error_callback* is called with the exception instance.
uk: Якщо вказано *error_callback*, це має бути виклик, який приймає один аргумент. Якщо цільова функція дає збій, то *error_callback* викликається з екземпляром винятку.

source: Callbacks should complete immediately since otherwise the thread which handles the results will get blocked.
uk: Зворотні виклики мають завершитися негайно, інакше потік, який обробляє результати, буде заблоковано.

source: A parallel equivalent of the :func:`map` built-in function (it supports only one *iterable* argument though, for multiple iterables see :meth:`starmap`). It blocks until the result is ready.
uk: Паралельний еквівалент вбудованої функції :func:`map` (хоча вона підтримує лише один аргумент *iterable*, для кількох ітерацій див. :meth:`starmap`). Блокується, поки не буде готовий результат.

source: This method chops the iterable into a number of chunks which it submits to the process pool as separate tasks. The (approximate) size of these chunks can be specified by setting *chunksize* to a positive integer.
uk: Цей метод розбиває iterable на декілька фрагментів, які він надсилає до пулу процесів як окремі завдання. (Приблизний) розмір цих фрагментів можна вказати, встановивши для *chunksize* додатне ціле число.

source: Note that it may cause high memory usage for very long iterables. Consider using :meth:`imap` or :meth:`imap_unordered` with explicit *chunksize* option for better efficiency.
uk: Зауважте, що це може спричинити велике використання пам’яті для дуже довгих ітерацій. Розгляньте можливість використання :meth:`imap` або :meth:`imap_unordered` з явним параметром *chunksize* для кращої ефективності.

source: A variant of the :meth:`.map` method which returns a :class:`~multiprocessing.pool.AsyncResult` object.
uk: Варіант методу :meth:`.map`, який повертає об’єкт :class:`~multiprocessing.pool.AsyncResult`.

source: A lazier version of :meth:`.map`.
uk: Ленича версія :meth:`.map`.

source: The *chunksize* argument is the same as the one used by the :meth:`.map` method. For very long iterables using a large value for *chunksize* can make the job complete **much** faster than using the default value of ``1``.
uk: Аргумент *chunksize* такий самий, як той, який використовується методом :meth:`.map`. Для дуже довгих ітерацій використання великого значення для *chunksize* може зробити роботу завершеною **набагато** швидше, ніж використання значення за замовчуванням ``1``.

source: Also if *chunksize* is ``1`` then the :meth:`!next` method of the iterator returned by the :meth:`imap` method has an optional *timeout* parameter: ``next(timeout)`` will raise :exc:`multiprocessing.TimeoutError` if the result cannot be returned within *timeout* seconds.
uk: Крім того, якщо *chunksize* дорівнює ``1``, тоді метод :meth:`!next` ітератора, який повертає метод :meth:`imap`, має додатковий параметр *timeout*: ``next(timeout)`` викличе :exc:`multiprocessing.TimeoutError`, якщо результат не може бути повернутий протягом *часу очікування* секунд.

source: The same as :meth:`imap` except that the ordering of the results from the returned iterator should be considered arbitrary. (Only when there is only one worker process is the order guaranteed to be "correct".)
uk: Те саме, що :meth:`imap`, за винятком того, що порядок результатів від повернутого ітератора слід вважати довільним. (Тільки коли є лише один робочий процес, порядок гарантовано буде "правильним".)

source: Like :meth:`~multiprocessing.pool.Pool.map` except that the elements of the *iterable* are expected to be iterables that are unpacked as arguments.
uk: Подібно до :meth:`~multiprocessing.pool.Pool.map`, за винятком того, що елементи *iterable* мають бути ітерованими, які розпаковуються як аргументи.

source: Hence an *iterable* of ``[(1,2), (3, 4)]`` results in ``[func(1,2), func(3,4)]``.
uk: Тому *ітерація* ``[(1,2), (3, 4)]`` призводить до ``[func(1,2), func(3,4)]``.

source: A combination of :meth:`starmap` and :meth:`map_async` that iterates over *iterable* of iterables and calls *func* with the iterables unpacked. Returns a result object.
uk: Комбінація :meth:`starmap` і :meth:`map_async`, яка виконує ітерацію по *iterable* ітерацій і викликає *func* з розпакованими ітераціями. Повертає об’єкт результату.

source: Prevents any more tasks from being submitted to the pool. Once all the tasks have been completed the worker processes will exit.
uk: Запобігає надсиланню додаткових завдань до пулу. Після виконання всіх завдань робочі процеси завершаться.

source: Stops the worker processes immediately without completing outstanding work. When the pool object is garbage collected :meth:`terminate` will be called immediately.
uk: Негайно зупиняє робочі процеси, не завершуючи незавершену роботу. Коли об’єкт пулу збирається як сміття, негайно буде викликано :meth:`terminate`.

source: Wait for the worker processes to exit. One must call :meth:`close` or :meth:`terminate` before using :meth:`join`.
uk: Зачекайте, поки робочі процеси завершаться. Потрібно викликати :meth:`close` або :meth:`terminate` перед використанням :meth:`join`.

source: Pool objects now support the context management protocol -- see :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` returns the pool object, and :meth:`~contextmanager.__exit__` calls :meth:`terminate`.
uk: Об’єкти пулу тепер підтримують протокол керування контекстом – див. :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` повертає об’єкт пулу, а :meth:`~contextmanager.__exit__` викликає :meth:`terminate`.

source: The class of the result returned by :meth:`Pool.apply_async` and :meth:`Pool.map_async`.
uk: Клас результату, який повертають :meth:`Pool.apply_async` і :meth:`Pool.map_async`.

source: Return the result when it arrives. If *timeout* is not ``None`` and the result does not arrive within *timeout* seconds then :exc:`multiprocessing.TimeoutError` is raised. If the remote call raised an exception then that exception will be reraised by :meth:`get`.
uk: Поверніть результат, коли він надійде. Якщо *timeout* не ``None`` і результат не надходить протягом *timeout* секунд, тоді виникає :exc:`multiprocessing.TimeoutError`. Якщо віддалений виклик викликав виняток, цей виняток буде повторно викликано :meth:`get`.

source: Wait until the result is available or until *timeout* seconds pass.
uk: Зачекайте, поки буде доступний результат або поки не мине *тайм-аут* секунди.

source: Return whether the call has completed.
uk: Повідомити, чи завершено виклик.

source: Return whether the call completed without raising an exception. Will raise :exc:`ValueError` if the result is not ready.
uk: Повертає, чи завершено виклик без виклику винятку. Викличе :exc:`ValueError`, якщо результат не готовий.

source: If the result is not ready, :exc:`ValueError` is raised instead of :exc:`AssertionError`.
uk: Якщо результат не готовий, замість :exc:`AssertionError` виникає :exc:`ValueError`.

source: The following example demonstrates the use of a pool::
uk: Наступний приклад демонструє використання пулу:

source: Listeners and Clients
uk: Слухачі та клієнти

source: Usually message passing between processes is done using queues or by using :class:`~Connection` objects returned by :func:`~multiprocessing.Pipe`.
uk: Зазвичай передача повідомлень між процесами здійснюється за допомогою черг або за допомогою об’єктів :class:`~Connection`, які повертає :func:`~multiprocessing.Pipe`.

source: However, the :mod:`multiprocessing.connection` module allows some extra flexibility. It basically gives a high level message oriented API for dealing with sockets or Windows named pipes. It also has support for *digest authentication* using the :mod:`hmac` module, and for polling multiple connections at the same time.
uk: Однак модуль :mod:`multiprocessing.connection` забезпечує додаткову гнучкість. По суті, це надає API високого рівня, орієнтований на повідомлення, для роботи з сокетами або іменованими каналами Windows. Він також підтримує *дайджест-автентифікацію* за допомогою модуля :mod:`hmac` і для опитування кількох з’єднань одночасно.

source: Send a randomly generated message to the other end of the connection and wait for a reply.
uk: Надішліть випадково згенероване повідомлення на інший кінець з’єднання та дочекайтеся відповіді.

source: If the reply matches the digest of the message using *authkey* as the key then a welcome message is sent to the other end of the connection. Otherwise :exc:`~multiprocessing.AuthenticationError` is raised.
uk: Якщо відповідь відповідає дайджесту повідомлення з використанням *authkey* як ключа, тоді на інший кінець з’єднання надсилається вітальне повідомлення. Інакше виникає :exc:`~multiprocessing.AuthenticationError`.

source: Receive a message, calculate the digest of the message using *authkey* as the key, and then send the digest back.
uk: Отримайте повідомлення, обчисліть дайджест повідомлення, використовуючи *authkey* як ключ, а потім надішліть дайджест назад.

source: If a welcome message is not received, then :exc:`~multiprocessing.AuthenticationError` is raised.
uk: Якщо вітальне повідомлення не отримано, виникає :exc:`~multiprocessing.AuthenticationError`.

source: Attempt to set up a connection to the listener which is using address *address*, returning a :class:`~Connection`.
uk: Спроба встановити з’єднання зі слухачем, який використовує адресу *address*, повертаючи :class:`~Connection`.

source: The type of the connection is determined by *family* argument, but this can generally be omitted since it can usually be inferred from the format of *address*. (See :ref:`multiprocessing-address-formats`)
uk: Тип з’єднання визначається аргументом *family*, але зазвичай його можна опустити, оскільки його зазвичай можна визначити з формату *address*. (Див. :ref:`multiprocessing-address-formats`)

source: A wrapper for a bound socket or Windows named pipe which is 'listening' for connections.
uk: Обгортка для пов’язаного сокета або каналу з іменем Windows, який "слухає" з’єднання.

source: *address* is the address to be used by the bound socket or named pipe of the listener object.
uk: *address* — це адреса, яка буде використовуватися зв’язаним сокетом або іменованим каналом об’єкта слухача.

source: If an address of '0.0.0.0' is used, the address will not be a connectable end point on Windows. If you require a connectable end-point, you should use '127.0.0.1'.
uk: Якщо використовується адреса "0.0.0.0", ця адреса не буде кінцевою точкою підключення в Windows. Якщо вам потрібна підключена кінцева точка, вам слід використовувати "127.0.0.1".

source: *family* is the type of socket (or named pipe) to use. This can be one of the strings ``'AF_INET'`` (for a TCP socket), ``'AF_UNIX'`` (for a Unix domain socket) or ``'AF_PIPE'`` (for a Windows named pipe). Of these only the first is guaranteed to be available. If *family* is ``None`` then the family is inferred from the format of *address*. If *address* is also ``None`` then a default is chosen. This default is the family which is assumed to be the fastest available. See :ref:`multiprocessing-address-formats`. Note that if *family* is ``'AF_UNIX'`` and address is ``None`` then the socket will be created in a private temporary directory created using :func:`tempfile.mkstemp`.
uk: *сімейство* — це тип розетки (або названої труби), яку слід використовувати. Це може бути один із рядків ``'AF_INET'`` (для сокета TCP), ``'AF_UNIX'`` (для сокета домену Unix) або ``'AF_PIPE''`` (для іменованого каналу Windows) . З них лише перший гарантовано доступний. Якщо *family* має значення ``None``, тоді сім'я виводиться з формату *address*. Якщо *адреса* також ``None``, тоді вибрано значення за замовчуванням. Це за замовчуванням сімейство, яке вважається найшвидшим із доступних. Дивіться :ref:`multiprocessing-address-formats`. Зауважте, що якщо *сімейство* має значення ``'AF_UNIX``, а адреса ``None``, то сокет буде створено в приватному тимчасовому каталозі, створеному за допомогою :func:`tempfile.mkstemp`.

source: If the listener object uses a socket then *backlog* (1 by default) is passed to the :meth:`~socket.socket.listen` method of the socket once it has been bound.
uk: Якщо об’єкт слухача використовує сокет, тоді *backlog* (1 за замовчуванням) передається в метод :meth:`~socket.socket.listen` сокета після того, як його буде зв’язано.
