Repository: python/python-docs-uk
Catalog: library/multiprocessing.po
Languages: uk

source: If *lock* is ``True`` (the default) then a new lock object is created to synchronize access to the value. If *lock* is a :class:`Lock` or :class:`RLock` object then that will be used to synchronize access to the value. If *lock* is ``False`` then access to the returned object will not be automatically protected by a lock, so it will not necessarily be "process-safe".
uk: Якщо *lock* має значення ``True`` (за замовчуванням), тоді створюється новий об’єкт блокування для синхронізації доступу до значення. Якщо *lock* є об’єктом :class:`Lock` або :class:`RLock`, то він використовуватиметься для синхронізації доступу до значення. Якщо *lock* має значення ``False``, тоді доступ до повернутого об’єкта не буде автоматично захищений блокуванням, тому він не обов’язково буде "безпечним для процесу".

source: Note that *lock* is a keyword only argument.
uk: Зауважте, що *lock* є лише ключовим аргументом.

source: Note that an array of :data:`ctypes.c_char` has *value* and *raw* attributes which allow one to use it to store and retrieve strings.
uk: Зауважте, що масив :data:`ctypes.c_char` має атрибути *value* і *raw*, які дозволяють використовувати його для зберігання та отримання рядків.

source: The :mod:`multiprocessing.sharedctypes` module
uk: Модуль :mod:`multiprocessing.sharedctypes`

source: The :mod:`multiprocessing.sharedctypes` module provides functions for allocating :mod:`ctypes` objects from shared memory which can be inherited by child processes.
uk: Модуль :mod:`multiprocessing.sharedctypes` надає функції для виділення об’єктів :mod:`ctypes` зі спільної пам’яті, які можуть бути успадковані дочірніми процесами.

source: Although it is possible to store a pointer in shared memory remember that this will refer to a location in the address space of a specific process. However, the pointer is quite likely to be invalid in the context of a second process and trying to dereference the pointer from the second process may cause a crash.
uk: Хоча можна зберігати вказівник у спільній пам’яті, пам’ятайте, що це посилатиметься на розташування в адресному просторі певного процесу. Однак вказівник, швидше за все, буде недійсним у контексті другого процесу, і спроба розіменувати вказівник з другого процесу може спричинити збій.

source: Return a ctypes array allocated from shared memory.
uk: Повертає масив ctypes, виділений зі спільної пам’яті.

source: *typecode_or_type* determines the type of the elements of the returned array: it is either a ctypes type or a one character typecode of the kind used by the :mod:`array` module. If *size_or_initializer* is an integer then it determines the length of the array, and the array will be initially zeroed. Otherwise *size_or_initializer* is a sequence which is used to initialize the array and whose length determines the length of the array.
uk: *typecode_or_type* визначає тип елементів повернутого масиву: це або тип ctypes, або односимвольний код типу, який використовується модулем :mod:`array`. Якщо *size_or_initializer* є цілим числом, воно визначає довжину масиву, і масив буде спочатку обнулено. В іншому випадку *size_or_initializer* — це послідовність, яка використовується для ініціалізації масиву і довжина якої визначає довжину масиву.

source: Note that setting and getting an element is potentially non-atomic -- use :func:`Array` instead to make sure that access is automatically synchronized using a lock.
uk: Зауважте, що встановлення й отримання елемента потенційно не є атомарним — замість цього використовуйте :func:`Array`, щоб переконатися, що доступ автоматично синхронізується за допомогою блокування.

source: Return a ctypes object allocated from shared memory.
uk: Повертає об’єкт ctypes, виділений зі спільної пам’яті.

source: Note that setting and getting the value is potentially non-atomic -- use :func:`Value` instead to make sure that access is automatically synchronized using a lock.
uk: Зауважте, що встановлення й отримання значення потенційно не є атомарним — замість цього використовуйте :func:`Value`, щоб переконатися, що доступ автоматично синхронізується за допомогою блокування.

source: Note that an array of :data:`ctypes.c_char` has ``value`` and ``raw`` attributes which allow one to use it to store and retrieve strings -- see documentation for :mod:`ctypes`.
uk: Зауважте, що масив :data:`ctypes.c_char` має атрибути ``value`` і ``raw``, які дозволяють використовувати його для зберігання та отримання рядків - дивіться документацію для :mod:`ctypes`.

source: The same as :func:`RawArray` except that depending on the value of *lock* a process-safe synchronization wrapper may be returned instead of a raw ctypes array.
uk: Те саме, що :func:`RawArray`, за винятком того, що залежно від значення *lock* замість необробленого масиву ctypes може повертатися обгортка синхронізації, безпечна для процесу.

source: If *lock* is ``True`` (the default) then a new lock object is created to synchronize access to the value. If *lock* is a :class:`~multiprocessing.Lock` or :class:`~multiprocessing.RLock` object then that will be used to synchronize access to the value. If *lock* is ``False`` then access to the returned object will not be automatically protected by a lock, so it will not necessarily be "process-safe".
uk: Якщо *lock* має значення ``True`` (за замовчуванням), тоді створюється новий об’єкт блокування для синхронізації доступу до значення. Якщо *lock* є об’єктом :class:`~multiprocessing.Lock` або :class:`~multiprocessing.RLock`, то він використовуватиметься для синхронізації доступу до значення. Якщо *lock* має значення ``False``, тоді доступ до повернутого об’єкта не буде автоматично захищений блокуванням, тому він не обов’язково буде "безпечним для процесу".

source: The same as :func:`RawValue` except that depending on the value of *lock* a process-safe synchronization wrapper may be returned instead of a raw ctypes object.
uk: Те саме, що :func:`RawValue`, за винятком того, що залежно від значення *lock* замість необробленого об’єкта ctypes може повертатися безпечна для процесу оболонка синхронізації.

source: Return a ctypes object allocated from shared memory which is a copy of the ctypes object *obj*.
uk: Повертає об’єкт ctypes, виділений зі спільної пам’яті, який є копією об’єкта ctypes *obj*.

source: Return a process-safe wrapper object for a ctypes object which uses *lock* to synchronize access. If *lock* is ``None`` (the default) then a :class:`multiprocessing.RLock` object is created automatically.
uk: Повертає безпечний для процесу об’єкт оболонки для об’єкта ctypes, який використовує *lock* для синхронізації доступу. Якщо *lock* має значення ``None`` (за замовчуванням), то об’єкт :class:`multiprocessing.RLock` створюється автоматично.

source: A synchronized wrapper will have two methods in addition to those of the object it wraps: :meth:`get_obj` returns the wrapped object and :meth:`get_lock` returns the lock object used for synchronization.
uk: Синхронізована оболонка матиме два методи на додаток до методів об’єкта, який вона обертає: :meth:`get_obj` повертає обгорнутий об’єкт, а :meth:`get_lock` повертає об’єкт блокування, який використовується для синхронізації.

source: Note that accessing the ctypes object through the wrapper can be a lot slower than accessing the raw ctypes object.
uk: Зверніть увагу, що доступ до об’єкта ctypes через оболонку може бути набагато повільнішим, ніж доступ до необробленого об’єкта ctypes.

source: Synchronized objects support the :term:`context manager` protocol.
uk: Синхронізовані об’єкти підтримують протокол :term:`context manager`.

source: The table below compares the syntax for creating shared ctypes objects from shared memory with the normal ctypes syntax. (In the table ``MyStruct`` is some subclass of :class:`ctypes.Structure`.)
uk: У наведеній нижче таблиці порівнюється синтаксис для створення спільних об’єктів ctypes зі спільної пам’яті зі звичайним синтаксисом ctypes. (У таблиці ``MyStruct`` є деякий підклас :class:`ctypes.Structure`.)

source: sharedctypes using type
uk: sharedctypes за допомогою типу

source: sharedctypes using typecode
uk: sharedctypes з використанням коду типу

source: Below is an example where a number of ctypes objects are modified by a child process::
uk: Нижче наведено приклад, коли кілька об’єктів ctypes змінено дочірнім процесом:

source: The results printed are ::
uk: Надруковані результати:

source: Managers
uk: Менеджери

source: Managers provide a way to create data which can be shared between different processes, including sharing over a network between processes running on different machines. A manager object controls a server process which manages *shared objects*. Other processes can access the shared objects by using proxies.
uk: Менеджери надають можливість створювати дані, якими можна ділитися між різними процесами, включно з загальним доступом через мережу між процесами, що виконуються на різних машинах. Об’єкт менеджера контролює серверний процес, який керує *спільними об’єктами*. Інші процеси можуть отримати доступ до спільних об’єктів за допомогою проксі-серверів.

source: Returns a started :class:`~multiprocessing.managers.SyncManager` object which can be used for sharing objects between processes. The returned manager object corresponds to a spawned child process and has methods which will create shared objects and return corresponding proxies.
uk: Повертає запущений об’єкт :class:`~multiprocessing.managers.SyncManager`, який можна використовувати для спільного використання об’єктів між процесами. Повернений об’єкт менеджера відповідає породженому дочірньому процесу та має методи, які створюватимуть спільні об’єкти та повертатимуть відповідні проксі-сервери.

source: Manager processes will be shutdown as soon as they are garbage collected or their parent process exits. The manager classes are defined in the :mod:`multiprocessing.managers` module:
uk: Процеси менеджера буде закрито, щойно їх буде зібрано сміття або їхній батьківський процес завершиться. Класи менеджерів визначені в модулі :mod:`multiprocessing.managers`:

source: Create a BaseManager object.
uk: Створіть об’єкт BaseManager.

source: Once created one should call :meth:`start` or ``get_server().serve_forever()`` to ensure that the manager object refers to a started manager process.
uk: Після створення потрібно викликати :meth:`start` або ``get_server().serve_forever()``, щоб переконатися, що об’єкт менеджера посилається на запущений процес менеджера.

source: *address* is the address on which the manager process listens for new connections. If *address* is ``None`` then an arbitrary one is chosen.
uk: *адреса* — це адреса, на якій процес менеджера прослуховує нові підключення. Якщо *адреса* має значення ``None``, тоді вибирається довільна адреса.

source: *authkey* is the authentication key which will be used to check the validity of incoming connections to the server process. If *authkey* is ``None`` then ``current_process().authkey`` is used. Otherwise *authkey* is used and it must be a byte string.
uk: *authkey* — це ключ автентифікації, який використовуватиметься для перевірки дійсності вхідних підключень до процесу сервера. Якщо *authkey* має значення ``None``, тоді використовується ``current_process().authkey``. В іншому випадку використовується *authkey*, і це має бути рядок байтів.

source: Start a subprocess to start the manager. If *initializer* is not ``None`` then the subprocess will call ``initializer(*initargs)`` when it starts.
uk: Запустіть підпроцес, щоб запустити менеджер. Якщо *initializer* не ``None``, тоді підпроцес викличе ``initializer(*initargs)`` під час запуску.

source: Returns a :class:`Server` object which represents the actual server under the control of the Manager. The :class:`Server` object supports the :meth:`serve_forever` method::
uk: Повертає об’єкт :class:`Server`, який представляє фактичний сервер під керуванням менеджера. Об’єкт :class:`Server` підтримує метод :meth:`serve_forever`::

source: :class:`Server` additionally has an :attr:`address` attribute.
uk: :class:`Server` додатково має атрибут :attr:`address`.

source: Connect a local manager object to a remote manager process::
uk: Підключіть об’єкт локального менеджера до віддаленого процесу менеджера:

source: Stop the process used by the manager. This is only available if :meth:`start` has been used to start the server process.
uk: Зупиніть процес, який використовує менеджер. Це доступно, лише якщо :meth:`start` було використано для запуску процесу сервера.

source: This can be called multiple times.
uk: Це можна викликати кілька разів.

source: A classmethod which can be used for registering a type or callable with the manager class.
uk: Метод класу, який можна використовувати для реєстрації типу або виклику в класі менеджера.

source: *typeid* is a "type identifier" which is used to identify a particular type of shared object. This must be a string.
uk: *typeid* — це "ідентифікатор типу", який використовується для ідентифікації певного типу спільного об’єкта. Це має бути рядок.

source: *callable* is a callable used for creating objects for this type identifier. If a manager instance will be connected to the server using the :meth:`connect` method, or if the *create_method* argument is ``False`` then this can be left as ``None``.
uk: *callable* — це виклик, який використовується для створення об’єктів для ідентифікатора цього типу. Якщо екземпляр менеджера буде підключено до сервера за допомогою методу :meth:`connect` або якщо аргумент *create_method* має значення ``False``, тоді це можна залишити як ``None``.

source: *proxytype* is a subclass of :class:`BaseProxy` which is used to create proxies for shared objects with this *typeid*. If ``None`` then a proxy class is created automatically.
uk: *proxytype* є підкласом :class:`BaseProxy`, який використовується для створення проксі для спільних об’єктів із цим *typeid*. Якщо ``None``, то проксі-клас створюється автоматично.

source: *exposed* is used to specify a sequence of method names which proxies for this typeid should be allowed to access using :meth:`BaseProxy._callmethod`. (If *exposed* is ``None`` then :attr:`proxytype._exposed_` is used instead if it exists.) In the case where no exposed list is specified, all "public methods" of the shared object will be accessible. (Here a "public method" means any attribute which has a :meth:`~object.__call__` method and whose name does not begin with ``'_'``.)
uk: *exposed* використовується для визначення послідовності назв методів, до яких проксі-серверам для цього typeid має бути дозволено доступ за допомогою :meth:`BaseProxy._callmethod`. (Якщо *exposed* має значення ``None``, тоді замість нього використовується :attr:`proxytype._exposed_`, якщо він існує.) У випадку, коли відкритий список не вказано, усі "загальнодоступні методи" спільного об’єкта будуть доступними. . (Тут "публічний метод" означає будь-який атрибут, який має метод :meth:`~object.__call__` і ім’я якого не починається з ``'_'``.)

source: *method_to_typeid* is a mapping used to specify the return type of those exposed methods which should return a proxy. It maps method names to typeid strings. (If *method_to_typeid* is ``None`` then :attr:`proxytype._method_to_typeid_` is used instead if it exists.) If a method's name is not a key of this mapping or if the mapping is ``None`` then the object returned by the method will be copied by value.
uk: *method_to_typeid* — це зіставлення, яке використовується для визначення типу повернення тих відкритих методів, які мають повертати проксі. Він відображає назви методів у рядках typeid. (Якщо *method_to_typeid* має значення ``None``, тоді замість нього використовується :attr:`proxytype._method_to_typeid_`, якщо він існує.) Якщо назва методу не є ключем цього відображення або якщо відображення має значення ``None``, тоді об'єкт, повернутий методом, буде скопійовано за значенням.

source: *create_method* determines whether a method should be created with name *typeid* which can be used to tell the server process to create a new shared object and return a proxy for it. By default it is ``True``.
uk: *create_method* визначає, чи слід створювати метод з іменем *typeid*, яке можна використовувати, щоб наказати серверному процесу створити новий спільний об’єкт і повернути для нього проксі. За замовчуванням це ``True``.

source: :class:`BaseManager` instances also have one read-only property:
uk: Екземпляри :class:`BaseManager` також мають одну властивість лише для читання:

source: The address used by the manager.
uk: Адреса, яку використовує менеджер.

source: Manager objects support the context management protocol -- see :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` starts the server process (if it has not already started) and then returns the manager object. :meth:`~contextmanager.__exit__` calls :meth:`shutdown`.
uk: Об’єкти менеджера підтримують протокол керування контекстом – див. :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` запускає серверний процес (якщо він ще не запущений), а потім повертає об’єкт менеджера. :meth:`~contextmanager.__exit__` викликає :meth:`shutdown`.

source: In previous versions :meth:`~contextmanager.__enter__` did not start the manager's server process if it was not already started.
uk: У попередніх версіях :meth:`~contextmanager.__enter__` не запускав серверний процес менеджера, якщо він ще не був запущений.

source: A subclass of :class:`BaseManager` which can be used for the synchronization of processes. Objects of this type are returned by :func:`multiprocessing.Manager`.
uk: Підклас :class:`BaseManager`, який можна використовувати для синхронізації процесів. Об’єкти цього типу повертає :func:`multiprocessing.Manager`.

source: Its methods create and return :ref:`multiprocessing-proxy_objects` for a number of commonly used data types to be synchronized across processes. This notably includes shared lists and dictionaries.
uk: Його методи створюють і повертають :ref:`multiprocessing-proxy_objects` для ряду типів даних, які зазвичай використовуються, щоб синхронізувати між процесами. Це, зокрема, включає спільні списки та словники.

source: Create a shared :class:`threading.Barrier` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`threading.Barrier` і поверніть для нього проксі.

source: Create a shared :class:`threading.BoundedSemaphore` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`threading.BoundedSemaphore` і поверніть для нього проксі.

source: Create a shared :class:`threading.Condition` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`threading.Condition` і поверніть для нього проксі.

source: If *lock* is supplied then it should be a proxy for a :class:`threading.Lock` or :class:`threading.RLock` object.
uk: Якщо вказано *lock*, це має бути проксі для об’єкта :class:`threading.Lock` або :class:`threading.RLock`.

source: Create a shared :class:`threading.Event` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`threading.Event` і поверніть для нього проксі.

source: Create a shared :class:`threading.Lock` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`threading.Lock` і поверніть для нього проксі.

source: Create a shared :class:`Namespace` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`Namespace` і поверніть для нього проксі.

source: Create a shared :class:`queue.Queue` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`queue.Queue` і поверніть для нього проксі.

source: Create a shared :class:`threading.RLock` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`threading.RLock` і поверніть для нього проксі.

source: Create a shared :class:`threading.Semaphore` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`threading.Semaphore` і поверніть для нього проксі.

source: Create an array and return a proxy for it.
uk: Створіть масив і поверніть для нього проксі.

source: Create an object with a writable ``value`` attribute and return a proxy for it.
uk: Створіть об’єкт із доступним для запису атрибутом "значення" та поверніть для нього проксі-сервер.

source: Create a shared :class:`dict` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`dict` і поверніть для нього проксі.

source: Create a shared :class:`list` object and return a proxy for it.
uk: Створіть спільний об’єкт :class:`list` і поверніть для нього проксі.

source: Shared objects are capable of being nested. For example, a shared container object such as a shared list can contain other shared objects which will all be managed and synchronized by the :class:`SyncManager`.
uk: Спільні об’єкти можуть бути вкладеними. Наприклад, спільний об’єкт-контейнер, такий як спільний список, може містити інші спільні об’єкти, якими керуватиме та синхронізуватиме :class:`SyncManager`.

source: A type that can register with :class:`SyncManager`.
uk: Тип, який можна зареєструвати в :class:`SyncManager`.

source: A namespace object has no public methods, but does have writable attributes. Its representation shows the values of its attributes.
uk: Об’єкт простору імен не має відкритих методів, але має атрибути, доступні для запису. Його подання показує значення його атрибутів.

source: However, when using a proxy for a namespace object, an attribute beginning with ``'_'`` will be an attribute of the proxy and not an attribute of the referent:
uk: Однак, коли використовується проксі для об’єкта простору імен, атрибут, що починається з ``'_''`` буде атрибутом проксі, а не атрибутом референта:

source: Customized managers
uk: Індивідуальні менеджери

source: To create one's own manager, one creates a subclass of :class:`BaseManager` and uses the :meth:`~BaseManager.register` classmethod to register new types or callables with the manager class. For example::
uk: Щоб створити власний менеджер, потрібно створити підклас :class:`BaseManager` і використовувати метод класу :meth:`~BaseManager.register` для реєстрації нових типів або викликів у класі менеджера. Наприклад::

source: Using a remote manager
uk: Використання віддаленого менеджера

source: It is possible to run a manager server on one machine and have clients use it from other machines (assuming that the firewalls involved allow it).
uk: Можна запустити керуючий сервер на одній машині, а клієнти використовуватимуть його з інших машин (за умови, що задіяні брандмауери дозволяють це).

source: Running the following commands creates a server for a single shared queue which remote clients can access::
uk: Виконання наступних команд створює сервер для однієї спільної черги, до якої мають доступ віддалені клієнти:

source: One client can access the server as follows::
uk: Один клієнт може отримати доступ до сервера наступним чином:

source: Another client can also use it::
uk: Інший клієнт також може використовувати його:

source: Local processes can also access that queue, using the code from above on the client to access it remotely::
uk: Локальні процеси також можуть отримати доступ до цієї черги, використовуючи код вище на клієнті для доступу до неї віддалено:

source: Proxy Objects
uk: Проксі об'єкти

source: A proxy is an object which *refers* to a shared object which lives (presumably) in a different process. The shared object is said to be the *referent* of the proxy. Multiple proxy objects may have the same referent.
uk: Проксі — це об’єкт, який *посилається* на спільний об’єкт, який живе (імовірно) в іншому процесі. Спільний об’єкт називається *референтом* проксі. Кілька проксі-об’єктів можуть мати один і той же референт.
