Repository: python/python-docs-uk
Catalog: library/multiprocessing.po
Languages: uk

source: For passing messages one can use :func:`Pipe` (for a connection between two processes) or a queue (which allows multiple producers and consumers).
uk: Для передачі повідомлень можна використовувати :func:`Pipe` (для з’єднання між двома процесами) або чергу (що дозволяє використовувати кілька виробників і споживачів).

source: The :class:`Queue`, :class:`SimpleQueue` and :class:`JoinableQueue` types are multi-producer, multi-consumer :abbr:`FIFO (first-in, first-out)` queues modelled on the :class:`queue.Queue` class in the standard library. They differ in that :class:`Queue` lacks the :meth:`~queue.Queue.task_done` and :meth:`~queue.Queue.join` methods introduced into Python 2.5's :class:`queue.Queue` class.
uk: Типи :class:`Queue`, :class:`SimpleQueue` і :class:`JoinableQueue` є чергами багатьох виробників і споживачів :abbr:`FIFO (першим увійшов, першим вийшов)`, змодельованими на основі :class:`queue.Queue` клас у стандартній бібліотеці. Вони відрізняються тим, що :class:`Queue` не має методів :meth:`~queue.Queue.task_done` і :meth:`~queue.Queue.join`, представлених у :class:`queue.Queue` Python 2.5 клас.

source: If you use :class:`JoinableQueue` then you **must** call :meth:`JoinableQueue.task_done` for each task removed from the queue or else the semaphore used to count the number of unfinished tasks may eventually overflow, raising an exception.
uk: Якщо ви використовуєте :class:`JoinableQueue`, тоді ви **має** викликати :meth:`JoinableQueue.task_done` для кожного завдання, вилученого з черги, інакше семафор, який використовується для підрахунку кількості незавершених завдань, може зрештою переповнитися, викликаючи виняток.

source: Note that one can also create a shared queue by using a manager object -- see :ref:`multiprocessing-managers`.
uk: Зауважте, що можна також створити спільну чергу за допомогою об’єкта менеджера – див. :ref:`multiprocessing-managers`.

source: :mod:`multiprocessing` uses the usual :exc:`queue.Empty` and :exc:`queue.Full` exceptions to signal a timeout. They are not available in the :mod:`multiprocessing` namespace so you need to import them from :mod:`queue`.
uk: :mod:`multiprocessing` використовує звичайні винятки :exc:`queue.Empty` і :exc:`queue.Full`, щоб сигналізувати про час очікування. Вони недоступні в просторі імен :mod:`multiprocessing`, тому їх потрібно імпортувати з :mod:`queue`.

source: When an object is put on a queue, the object is pickled and a background thread later flushes the pickled data to an underlying pipe. This has some consequences which are a little surprising, but should not cause any practical difficulties -- if they really bother you then you can instead use a queue created with a :ref:`manager <multiprocessing-managers>`.
uk: Коли об’єкт ставиться в чергу, об’єкт очищається, а фоновий потік пізніше скидає обрані дані в базовий канал. Це має деякі наслідки, які є трохи дивними, але не повинні викликати жодних практичних труднощів - якщо вони дійсно вас турбують, ви можете натомість використати чергу, створену за допомогою :ref:`manager <multiprocessing-managers>`.

source: After putting an object on an empty queue there may be an infinitesimal delay before the queue's :meth:`~Queue.empty` method returns :const:`False` and :meth:`~Queue.get_nowait` can return without raising :exc:`queue.Empty`.
uk: Після розміщення об’єкта в порожній черзі може виникнути нескінченно мала затримка, перш ніж метод :meth:`~Queue.empty` черги поверне :const:`False`, а :meth:`~Queue.get_nowait` зможе повернутися без виклику :exc:`queue.Empty`.

source: If multiple processes are enqueuing objects, it is possible for the objects to be received at the other end out-of-order. However, objects enqueued by the same process will always be in the expected order with respect to each other.
uk: Якщо кілька процесів ставлять об’єкти в чергу, об’єкти можуть бути отримані на іншому кінці не за порядком. Однак об’єкти, поставлені в чергу одним і тим же процесом, завжди будуть в очікуваному порядку один відносно одного.

source: If a process is killed using :meth:`Process.terminate` or :func:`os.kill` while it is trying to use a :class:`Queue`, then the data in the queue is likely to become corrupted. This may cause any other process to get an exception when it tries to use the queue later on.
uk: Якщо процес зупинено за допомогою :meth:`Process.terminate` або :func:`os.kill` під час спроби використання :class:`Queue`, то дані в черзі, ймовірно, будуть пошкоджені. Це може призвести до того, що будь-який інший процес отримає виняток, коли він спробує використати чергу пізніше.

source: As mentioned above, if a child process has put items on a queue (and it has not used :meth:`JoinableQueue.cancel_join_thread <multiprocessing.Queue.cancel_join_thread>`), then that process will not terminate until all buffered items have been flushed to the pipe.
uk: Як згадувалося вище, якщо дочірній процес поставив елементи в чергу (і він не використовував :meth:`JoinableQueue.cancel_join_thread <multiprocessing.Queue.cancel_join_thread>`), тоді цей процес не завершиться, доки всі буферизовані елементи не будуть скинуті в канал.

source: This means that if you try joining that process you may get a deadlock unless you are sure that all items which have been put on the queue have been consumed. Similarly, if the child process is non-daemonic then the parent process may hang on exit when it tries to join all its non-daemonic children.
uk: Це означає, що якщо ви спробуєте приєднатися до цього процесу, ви можете отримати тупикову блокування, якщо ви не впевнені, що всі елементи, які були поставлені в чергу, використано. Так само, якщо дочірній процес є недемонічним, тоді батьківський процес може зависнути при виході, коли він намагається приєднатися до всіх своїх недемонічних дочірніх процесів.

source: Note that a queue created using a manager does not have this issue. See :ref:`multiprocessing-programming`.
uk: Зауважте, що черга, створена за допомогою менеджера, не має цієї проблеми. Дивіться :ref:`multiprocessing-programming`.

source: For an example of the usage of queues for interprocess communication see :ref:`multiprocessing-examples`.
uk: Для прикладу використання черг для міжпроцесного зв’язку див. :ref:`multiprocessing-examples`.

source: Returns a pair ``(conn1, conn2)`` of :class:`~multiprocessing.connection.Connection` objects representing the ends of a pipe.
uk: Повертає пару об’єктів ``(conn1, conn2)`` :class:`~multiprocessing.connection.Connection`, що представляють кінці труби.

source: If *duplex* is ``True`` (the default) then the pipe is bidirectional. If *duplex* is ``False`` then the pipe is unidirectional: ``conn1`` can only be used for receiving messages and ``conn2`` can only be used for sending messages.
uk: Якщо *duplex* має значення ``True`` (за замовчуванням), тоді канал є двонаправленим. Якщо *duplex* має значення ``False``, тоді канал є односпрямованим: ``conn1`` можна використовувати лише для отримання повідомлень, а ``conn2`` — лише для надсилання повідомлень.

source: Returns a process shared queue implemented using a pipe and a few locks/semaphores. When a process first puts an item on the queue a feeder thread is started which transfers objects from a buffer into the pipe.
uk: Повертає спільну чергу процесу, реалізовану за допомогою каналу та кількох блокувань/семафорів. Коли процес вперше ставить елемент у чергу, запускається потік, який передає об’єкти з буфера в канал.

source: The usual :exc:`queue.Empty` and :exc:`queue.Full` exceptions from the standard library's :mod:`queue` module are raised to signal timeouts.
uk: Звичайні винятки :exc:`queue.Empty` і :exc:`queue.Full` із модуля :mod:`queue` стандартної бібліотеки створюються, щоб повідомити про час очікування.

source: :class:`Queue` implements all the methods of :class:`queue.Queue` except for :meth:`~queue.Queue.task_done` and :meth:`~queue.Queue.join`.
uk: :class:`Queue` реалізує всі методи :class:`queue.Queue`, крім :meth:`~queue.Queue.task_done` і :meth:`~queue.Queue.join`.

source: Return the approximate size of the queue. Because of multithreading/multiprocessing semantics, this number is not reliable.
uk: Повертає приблизний розмір черги. Через семантику багатопоточності/багатопроцесорності це число ненадійне.

source: Return ``True`` if the queue is empty, ``False`` otherwise. Because of multithreading/multiprocessing semantics, this is not reliable.
uk: Повертає ``True``, якщо черга порожня, ``False`` інакше. Через семантику багатопоточності/багатопроцесорності це ненадійно.

source: Return ``True`` if the queue is full, ``False`` otherwise. Because of multithreading/multiprocessing semantics, this is not reliable.
uk: Повертає ``True``, якщо черга заповнена, ``False`` інакше. Через семантику багатопоточності/багатопроцесорності це ненадійно.

source: Put obj into the queue. If the optional argument *block* is ``True`` (the default) and *timeout* is ``None`` (the default), block if necessary until a free slot is available. If *timeout* is a positive number, it blocks at most *timeout* seconds and raises the :exc:`queue.Full` exception if no free slot was available within that time. Otherwise (*block* is ``False``), put an item on the queue if a free slot is immediately available, else raise the :exc:`queue.Full` exception (*timeout* is ignored in that case).
uk: Помістіть obj у чергу. Якщо необов’язковий аргумент *block* має значення ``True`` (за замовчуванням), а *timeout* має значення ``None`` (за замовчуванням), за потреби блокуйте, доки не з’явиться вільний слот. Якщо *timeout* є додатним числом, він блокує щонайбільше *timeout* секунд і викликає виняток :exc:`queue.Full`, якщо протягом цього часу не було вільного місця. В іншому випадку (*block* має значення ``False``), помістіть елемент у чергу, якщо вільний слот є негайно доступним, інакше викликайте виняток :exc:`queue.Full` (*timeout* у цьому випадку ігнорується).

source: If the queue is closed, :exc:`ValueError` is raised instead of :exc:`AssertionError`.
uk: Якщо чергу закрито, замість :exc:`AssertionError` виникає :exc:`ValueError`.

source: Equivalent to ``put(obj, False)``.
uk: Еквівалент ``put(obj, False)``.

source: Remove and return an item from the queue. If optional args *block* is ``True`` (the default) and *timeout* is ``None`` (the default), block if necessary until an item is available. If *timeout* is a positive number, it blocks at most *timeout* seconds and raises the :exc:`queue.Empty` exception if no item was available within that time. Otherwise (block is ``False``), return an item if one is immediately available, else raise the :exc:`queue.Empty` exception (*timeout* is ignored in that case).
uk: Видалити та повернути елемент із черги. Якщо необов’язкові аргументи *block* мають значення ``True`` (за замовчуванням), а *timeout* — ``None`` (за замовчуванням), за потреби блокуйте, доки елемент не стане доступним. Якщо *timeout* є додатним числом, він блокує щонайбільше *timeout* секунд і викликає виняток :exc:`queue.Empty`, якщо жоден елемент не був доступний протягом цього часу. В іншому випадку (блок має значення ``False``), повертає елемент, якщо він одразу доступний, інакше викликає виняток :exc:`queue.Empty` (у цьому випадку *timeout* ігнорується).

source: If the queue is closed, :exc:`ValueError` is raised instead of :exc:`OSError`.
uk: Якщо чергу закрито, замість :exc:`OSError` виникає :exc:`ValueError`.

source: Equivalent to ``get(False)``.
uk: Еквівалент ``get(False)``.

source: :class:`multiprocessing.Queue` has a few additional methods not found in :class:`queue.Queue`. These methods are usually unnecessary for most code:
uk: :class:`multiprocessing.Queue` має кілька додаткових методів, яких немає в :class:`queue.Queue`. Ці методи зазвичай непотрібні для більшості коду:

source: Indicate that no more data will be put on this queue by the current process. The background thread will quit once it has flushed all buffered data to the pipe. This is called automatically when the queue is garbage collected.
uk: Укажіть, що поточний процес більше не додаватиме дані до цієї черги. Фоновий потік завершиться, коли всі буферизовані дані буде скинуто в канал. Це викликається автоматично, коли в черзі збирається сміття.

source: Join the background thread. This can only be used after :meth:`close` has been called. It blocks until the background thread exits, ensuring that all data in the buffer has been flushed to the pipe.
uk: Приєднайтеся до фонової нитки. Це можна використовувати лише після виклику :meth:`close`. Він блокується, доки не завершиться фоновий потік, гарантуючи, що всі дані в буфері скинуті в канал.

source: By default if a process is not the creator of the queue then on exit it will attempt to join the queue's background thread. The process can call :meth:`cancel_join_thread` to make :meth:`join_thread` do nothing.
uk: За замовчуванням, якщо процес не є творцем черги, після виходу він спробує приєднатися до фонового потоку черги. Процес може викликати :meth:`cancel_join_thread`, щоб змусити :meth:`join_thread` нічого не робити.

source: Prevent :meth:`join_thread` from blocking. In particular, this prevents the background thread from being joined automatically when the process exits -- see :meth:`join_thread`.
uk: Запобігти блокуванню :meth:`join_thread`. Зокрема, це запобігає автоматичному приєднанню фонового потоку під час завершення процесу -- див. :meth:`join_thread`.

source: A better name for this method might be ``allow_exit_without_flush()``. It is likely to cause enqueued data to be lost, and you almost certainly will not need to use it. It is really only there if you need the current process to exit immediately without waiting to flush enqueued data to the underlying pipe, and you don't care about lost data.
uk: Кращою назвою для цього методу може бути ``allow_exit_without_flush()``. Ймовірно, це спричинить втрату даних у черзі, і вам майже напевно не потрібно буде їх використовувати. Насправді він доступний лише тоді, коли вам потрібно, щоб поточний процес завершився негайно, не чекаючи, щоб скинути дані з черги в основний канал, і ви не дбаєте про втрачені дані.

source: This class's functionality requires a functioning shared semaphore implementation on the host operating system. Without one, the functionality in this class will be disabled, and attempts to instantiate a :class:`Queue` will result in an :exc:`ImportError`. See :issue:`3770` for additional information. The same holds true for any of the specialized queue types listed below.
uk: Функціональність цього класу вимагає функціонуючої спільної реалізації семафора в головній операційній системі. Без нього функціональні можливості цього класу будуть вимкнені, а спроби створити екземпляр :class:`Queue` призведуть до :exc:`ImportError`. Додаткову інформацію див. :issue:`3770`. Те саме стосується будь-якого зі спеціалізованих типів черги, перелічених нижче.

source: It is a simplified :class:`Queue` type, very close to a locked :class:`Pipe`.
uk: Це спрощений тип :class:`Queue`, дуже схожий на заблокований :class:`Pipe`.

source: Close the queue: release internal resources.
uk: Закрийте чергу: звільніть внутрішні ресурси.

source: A queue must not be used anymore after it is closed. For example, :meth:`get`, :meth:`put` and :meth:`empty` methods must no longer be called.
uk: Після закриття чергу більше не можна використовувати. Наприклад, методи :meth:`get`, :meth:`put` і :meth:`empty` більше не можна викликати.

source: Return ``True`` if the queue is empty, ``False`` otherwise.
uk: Повертає ``True``, якщо черга порожня, ``False`` інакше.

source: Remove and return an item from the queue.
uk: Видалити та повернути елемент із черги.

source: Put *item* into the queue.
uk: Поставте *товар* в чергу.

source: :class:`JoinableQueue`, a :class:`Queue` subclass, is a queue which additionally has :meth:`task_done` and :meth:`join` methods.
uk: :class:`JoinableQueue`, підклас :class:`Queue`, це черга, яка додатково має методи :meth:`task_done` і :meth:`join`.

source: Indicate that a formerly enqueued task is complete. Used by queue consumers. For each :meth:`~Queue.get` used to fetch a task, a subsequent call to :meth:`task_done` tells the queue that the processing on the task is complete.
uk: Вказує на те, що завдання, яке раніше було в черзі, виконано. Використовується споживачами черги. Для кожного :meth:`~Queue.get`, який використовується для отримання завдання, наступний виклик :meth:`task_done` повідомляє черзі, що обробку завдання завершено.

source: If a :meth:`~queue.Queue.join` is currently blocking, it will resume when all items have been processed (meaning that a :meth:`task_done` call was received for every item that had been :meth:`~Queue.put` into the queue).
uk: Якщо :meth:`~queue.Queue.join` зараз блокується, воно відновиться, коли всі елементи будуть оброблені (це означає, що виклик :meth:`task_done` отримано для кожного елемента, який був :meth:`~Queue.put` в чергу).

source: Raises a :exc:`ValueError` if called more times than there were items placed in the queue.
uk: Викликає :exc:`ValueError`, якщо викликається стільки разів, скільки було елементів у черзі.

source: Block until all items in the queue have been gotten and processed.
uk: Блокуйте, доки не буде отримано та оброблено всі елементи в черзі.

source: The count of unfinished tasks goes up whenever an item is added to the queue. The count goes down whenever a consumer calls :meth:`task_done` to indicate that the item was retrieved and all work on it is complete. When the count of unfinished tasks drops to zero, :meth:`~queue.Queue.join` unblocks.
uk: Кількість незавершених завдань зростає щоразу, коли елемент додається до черги. Підрахунок зменшується щоразу, коли споживач викликає :meth:`task_done`, щоб вказати, що елемент отримано та вся робота над ним завершена. Коли кількість незавершених завдань падає до нуля, :meth:`~queue.Queue.join` розблоковується.

source: Miscellaneous
uk: Різне

source: Return list of all live children of the current process.
uk: Повернути список усіх живих дітей поточного процесу.

source: Calling this has the side effect of "joining" any processes which have already finished.
uk: Виклик цього має побічний ефект "приєднання" до будь-яких процесів, які вже завершилися.

source: Return the number of CPUs in the system.
uk: Повертає кількість процесорів у системі.

source: When the number of CPUs cannot be determined a :exc:`NotImplementedError` is raised.
uk: Коли кількість ЦП не може бути визначена, виникає :exc:`NotImplementedError`.

source: Return the :class:`Process` object corresponding to the current process.
uk: Повертає об’єкт :class:`Process`, що відповідає поточному процесу.

source: An analogue of :func:`threading.current_thread`.
uk: Аналог :func:`threading.current_thread`.

source: Return the :class:`Process` object corresponding to the parent process of the :func:`current_process`. For the main process, ``parent_process`` will be ``None``.
uk: Повертає об’єкт :class:`Process`, що відповідає батьківському процесу :func:`current_process`. Для основного процесу ``parent_process`` буде ``None``.

source: Add support for when a program which uses :mod:`multiprocessing` has been frozen to produce a Windows executable. (Has been tested with **py2exe**, **PyInstaller** and **cx_Freeze**.)
uk: Додайте підтримку, коли програма, яка використовує :mod:`multiprocessing`, була заморожена для створення виконуваного файлу Windows. (Було перевірено за допомогою **py2exe**, **PyInstaller** і **cx_Freeze**.)

source: One needs to call this function straight after the ``if __name__ == '__main__'`` line of the main module. For example::
uk: Цю функцію потрібно викликати відразу після рядка ``if __name__ == '__main__'`` головного модуля. Наприклад::

source: If the ``freeze_support()`` line is omitted then trying to run the frozen executable will raise :exc:`RuntimeError`.
uk: Якщо рядок ``freeze_support()`` пропущено, спроба запустити заморожений виконуваний файл викличе :exc:`RuntimeError`.

source: Calling ``freeze_support()`` has no effect when invoked on any operating system other than Windows. In addition, if the module is being run normally by the Python interpreter on Windows (the program has not been frozen), then ``freeze_support()`` has no effect.
uk: Виклик ``freeze_support()`` не має ефекту під час виклику в будь-якій операційній системі, крім Windows. Крім того, якщо модуль нормально запускається інтерпретатором Python у Windows (програма не була заморожена), то ``freeze_support()`` не має ефекту.

source: Return a context object which has the same attributes as the :mod:`multiprocessing` module.
uk: Повертає об’єкт контексту, який має ті самі атрибути, що й модуль :mod:`multiprocessing`.

source: Return the name of start method used for starting processes.
uk: Повертає назву методу запуску, який використовується для запуску процесів.

source: If the start method has not been fixed and *allow_none* is false, then the start method is fixed to the default and the name is returned. If the start method has not been fixed and *allow_none* is true then ``None`` is returned.
uk: Якщо метод запуску не було виправлено і *allow_none* має значення false, тоді метод запуску фіксується за замовчуванням і повертається ім’я. Якщо метод запуску не було виправлено і *allow_none* має значення true, тоді повертається ``None``.

source: On macOS, the *spawn* start method is now the default. The *fork* start method should be considered unsafe as it can lead to crashes of the subprocess. See :issue:`33725`.
uk: У macOS метод запуску *spawn* тепер є типовим. Метод запуску *fork* слід вважати небезпечним, оскільки він може призвести до збою підпроцесу. Див. :issue:`33725`.

source: Set the path of the Python interpreter to use when starting a child process. (By default :data:`sys.executable` is used). Embedders will probably need to do some thing like ::
uk: Встановіть шлях інтерпретатора Python для використання під час запуску дочірнього процесу. (За замовчуванням використовується :data:`sys.executable`). Вбудовувачі, ймовірно, повинні будуть зробити щось на зразок:

source: before they can create child processes.
uk: перш ніж вони зможуть створити дочірні процеси.

source: Accepts a :term:`path-like object`.
uk: Приймає :term:`path-like object`.

source: Note that this should be called at most once, and it should be protected inside the ``if __name__ == '__main__'`` clause of the main module.
uk: Зверніть увагу, що це має бути викликано щонайбільше один раз, і його слід захистити всередині пропозиції ``if __name__ == '__main__'`` головного модуля.

source: :mod:`multiprocessing` contains no analogues of :func:`threading.active_count`, :func:`threading.enumerate`, :func:`threading.settrace`, :func:`threading.setprofile`, :class:`threading.Timer`, or :class:`threading.local`.
uk: :mod:`multiprocessing` не містить аналогів :func:`threading.active_count`, :func:`threading.enumerate`, :func:`threading.settrace`, :func:`threading.setprofile`, :class:`threading.Timer` або :class:`threading.local`.

source: Connection Objects
uk: Об'єкти підключення

source: Connection objects allow the sending and receiving of picklable objects or strings. They can be thought of as message oriented connected sockets.
uk: Об’єкти підключення дозволяють надсилати та отримувати об’єкти або рядки, які можна вибрати. Їх можна розглядати як підключені сокети, орієнтовані на повідомлення.

source: Connection objects are usually created using :func:`Pipe <multiprocessing.Pipe>` -- see also :ref:`multiprocessing-listeners-clients`.
uk: Об’єкти підключення зазвичай створюються за допомогою :func:`Pipe <multiprocessing.Pipe>` -- див. також :ref:`multiprocessing-listeners-clients`.
