Repository: python/python-docs-uk
Catalog: library/multiprocessing.po
Languages: uk

source: Send an object to the other end of the connection which should be read using :meth:`recv`.
uk: Надішліть об’єкт на інший кінець з’єднання, який слід прочитати за допомогою :meth:`recv`.

source: The object must be picklable. Very large pickles (approximately 32 MiB+, though it depends on the OS) may raise a :exc:`ValueError` exception.
uk: Об'єкт має бути маринованим. Дуже великі pickles (приблизно 32 MiB+, хоча це залежить від ОС) можуть викликати виняток :exc:`ValueError`.

source: Return an object sent from the other end of the connection using :meth:`send`. Blocks until there is something to receive. Raises :exc:`EOFError` if there is nothing left to receive and the other end was closed.
uk: Повернути об’єкт, надісланий з іншого кінця з’єднання за допомогою :meth:`send`. Блокує, поки не буде що отримати. Викликає :exc:`EOFError`, якщо не залишилося нічого для отримання, а інший кінець був закритий.

source: Return the file descriptor or handle used by the connection.
uk: Повертає дескриптор файлу або дескриптор, який використовується підключенням.

source: Close the connection.
uk: Закрийте з'єднання.

source: This is called automatically when the connection is garbage collected.
uk: Це викликається автоматично, коли підключення збирається сміттям.

source: Return whether there is any data available to be read.
uk: Повернути, чи є дані для читання.

source: If *timeout* is not specified then it will return immediately. If *timeout* is a number then this specifies the maximum time in seconds to block. If *timeout* is ``None`` then an infinite timeout is used.
uk: Якщо *timeout* не вказано, він негайно повернеться. Якщо *timeout* є числом, це вказує максимальний час у секундах для блокування. Якщо *timeout* має значення ``None``, тоді використовується нескінченний тайм-аут.

source: Note that multiple connection objects may be polled at once by using :func:`multiprocessing.connection.wait`.
uk: Зауважте, що кілька об’єктів з’єднання можна опитувати одночасно за допомогою :func:`multiprocessing.connection.wait`.

source: Send byte data from a :term:`bytes-like object` as a complete message.
uk: Надіслати байтові дані з :term:`bytes-like object` як повне повідомлення.

source: If *offset* is given then data is read from that position in *buffer*. If *size* is given then that many bytes will be read from buffer. Very large buffers (approximately 32 MiB+, though it depends on the OS) may raise a :exc:`ValueError` exception
uk: Якщо вказано *зсув*, дані зчитуються з цієї позиції в *буфері*. Якщо задано *size*, то стільки байтів буде прочитано з буфера. Дуже великі буфери (приблизно 32 MiB+, хоча це залежить від ОС) можуть викликати виключення :exc:`ValueError`

source: Return a complete message of byte data sent from the other end of the connection as a string. Blocks until there is something to receive. Raises :exc:`EOFError` if there is nothing left to receive and the other end has closed.
uk: Повертає повне повідомлення байтових даних, надісланих з іншого кінця з’єднання, у вигляді рядка. Блокує, поки не буде що отримати. Викликає :exc:`EOFError`, якщо не залишилося нічого для отримання, а інший кінець закрито.

source: If *maxlength* is specified and the message is longer than *maxlength* then :exc:`OSError` is raised and the connection will no longer be readable.
uk: Якщо вказано *maxlength* і повідомлення довше, ніж *maxlength*, тоді виникає :exc:`OSError` і з’єднання більше не читається.

source: This function used to raise :exc:`IOError`, which is now an alias of :exc:`OSError`.
uk: Раніше ця функція викликала :exc:`IOError`, який тепер є псевдонімом :exc:`OSError`.

source: Read into *buffer* a complete message of byte data sent from the other end of the connection and return the number of bytes in the message. Blocks until there is something to receive. Raises :exc:`EOFError` if there is nothing left to receive and the other end was closed.
uk: Прочитайте в *buffer* повне повідомлення байтових даних, надісланих з іншого кінця з’єднання, і поверніть кількість байтів у повідомленні. Блокує, поки не буде що отримати. Викликає :exc:`EOFError`, якщо не залишилося нічого для отримання, а інший кінець був закритий.

source: *buffer* must be a writable :term:`bytes-like object`. If *offset* is given then the message will be written into the buffer from that position. Offset must be a non-negative integer less than the length of *buffer* (in bytes).
uk: *buffer* має бути доступним для запису :term:`bytes-like object`. Якщо задано *offset*, повідомлення буде записано в буфер із цієї позиції. Зсув має бути невід’ємним цілим числом, меншим за довжину *буфера* (у байтах).

source: If the buffer is too short then a :exc:`BufferTooShort` exception is raised and the complete message is available as ``e.args[0]`` where ``e`` is the exception instance.
uk: Якщо буфер закороткий, виникає виняток :exc:`BufferTooShort`, і повне повідомлення доступне як ``e.args[0]``, де ``e`` є винятком.

source: Connection objects themselves can now be transferred between processes using :meth:`Connection.send` and :meth:`Connection.recv`.
uk: Самі об’єкти підключення тепер можна передавати між процесами за допомогою :meth:`Connection.send` і :meth:`Connection.recv`.

source: For example:
uk: Наприклад:

source: The :meth:`Connection.recv` method automatically unpickles the data it receives, which can be a security risk unless you can trust the process which sent the message.
uk: Метод :meth:`Connection.recv` автоматично видаляє отримані дані, що може становити загрозу безпеці, якщо ви не можете довіряти процесу, який надіслав повідомлення.

source: Therefore, unless the connection object was produced using :func:`Pipe` you should only use the :meth:`~Connection.recv` and :meth:`~Connection.send` methods after performing some sort of authentication. See :ref:`multiprocessing-auth-keys`.
uk: Таким чином, якщо об’єкт підключення не було створено за допомогою :func:`Pipe`, ви повинні використовувати лише методи :meth:`~Connection.recv` і :meth:`~Connection.send` після виконання певної автентифікації. Перегляньте :ref:`multiprocessing-auth-keys`.

source: If a process is killed while it is trying to read or write to a pipe then the data in the pipe is likely to become corrupted, because it may become impossible to be sure where the message boundaries lie.
uk: Якщо процес зупиняється під час спроби читання або запису в канал, то дані в каналі, ймовірно, будуть пошкоджені, тому що може стати неможливо точно визначити, де пролягають межі повідомлення.

source: Synchronization primitives
uk: Примітиви синхронізації

source: Generally synchronization primitives are not as necessary in a multiprocess program as they are in a multithreaded program. See the documentation for :mod:`threading` module.
uk: Зазвичай примітиви синхронізації не такі необхідні в багатопроцесовій програмі, як у багатопотоковій програмі. Перегляньте документацію для модуля :mod:`threading`.

source: Note that one can also create synchronization primitives by using a manager object -- see :ref:`multiprocessing-managers`.
uk: Зауважте, що можна також створити примітиви синхронізації за допомогою об’єкта менеджера – див. :ref:`multiprocessing-managers`.

source: A barrier object: a clone of :class:`threading.Barrier`.
uk: Бар’єрний об’єкт: клон :class:`threading.Barrier`.

source: A bounded semaphore object: a close analog of :class:`threading.BoundedSemaphore`.
uk: Обмежений семафорний об’єкт: близький аналог :class:`threading.BoundedSemaphore`.

source: A solitary difference from its close analog exists: its ``acquire`` method's first argument is named *block*, as is consistent with :meth:`Lock.acquire`.
uk: Існує єдина відмінність від його близького аналога: перший аргумент методу ``acquire`` має назву *block*, що узгоджується з :meth:`Lock.acquire`.

source: On macOS, this is indistinguishable from :class:`Semaphore` because ``sem_getvalue()`` is not implemented on that platform.
uk: У macOS це неможливо відрізнити від :class:`Semaphore`, оскільки ``sem_getvalue()`` не реалізовано на цій платформі.

source: A condition variable: an alias for :class:`threading.Condition`.
uk: Змінна умови: псевдонім для :class:`threading.Condition`.

source: If *lock* is specified then it should be a :class:`Lock` or :class:`RLock` object from :mod:`multiprocessing`.
uk: Якщо вказано *lock*, це має бути об’єкт :class:`Lock` або :class:`RLock` із :mod:`multiprocessing`.

source: The :meth:`~threading.Condition.wait_for` method was added.
uk: Додано метод :meth:`~threading.Condition.wait_for`.

source: A clone of :class:`threading.Event`.
uk: Клон :class:`threading.Event`.

source: A non-recursive lock object: a close analog of :class:`threading.Lock`. Once a process or thread has acquired a lock, subsequent attempts to acquire it from any process or thread will block until it is released; any process or thread may release it. The concepts and behaviors of :class:`threading.Lock` as it applies to threads are replicated here in :class:`multiprocessing.Lock` as it applies to either processes or threads, except as noted.
uk: Нерекурсивний об’єкт блокування: близький аналог :class:`threading.Lock`. Після того, як процес або потік отримав блокування, наступні спроби отримати його від будь-якого процесу або потоку будуть блокуватися, доки його не буде звільнено; будь-який процес або потік може його звільнити. Концепції та поведінка :class:`threading.Lock`, які застосовуються до потоків, відтворені тут у :class:`multiprocessing.Lock`, оскільки вони застосовуються до процесів або потоків, за винятком зазначених випадків.

source: Note that :class:`Lock` is actually a factory function which returns an instance of ``multiprocessing.synchronize.Lock`` initialized with a default context.
uk: Зауважте, що :class:`Lock` насправді є фабричною функцією, яка повертає примірник ``multiprocessing.synchronize.Lock``, ініціалізований контекстом за замовчуванням.

source: :class:`Lock` supports the :term:`context manager` protocol and thus may be used in :keyword:`with` statements.
uk: :class:`Lock` підтримує протокол :term:`context manager` і тому може використовуватися в :keyword:`with` операторах.

source: Acquire a lock, blocking or non-blocking.
uk: Отримайте блокування, блокування або неблокування.

source: With the *block* argument set to ``True`` (the default), the method call will block until the lock is in an unlocked state, then set it to locked and return ``True``. Note that the name of this first argument differs from that in :meth:`threading.Lock.acquire`.
uk: Якщо для аргументу *block* встановлено значення ``True`` (за замовчуванням), виклик методу блокуватиметься, доки блокування не перейде в розблокований стан, а потім встановлюватиме для нього значення ``True`` і повертатиме ``True``. Зауважте, що назва цього першого аргументу відрізняється від такої в :meth:`threading.Lock.acquire`.

source: With the *block* argument set to ``False``, the method call does not block. If the lock is currently in a locked state, return ``False``; otherwise set the lock to a locked state and return ``True``.
uk: Якщо для аргументу *block* встановлено значення ``False``, виклик методу не блокується. Якщо блокування зараз у заблокованому стані, поверніть ``False``; інакше встановіть блокування в заблокований стан і поверніть ``True``.

source: When invoked with a positive, floating-point value for *timeout*, block for at most the number of seconds specified by *timeout* as long as the lock can not be acquired. Invocations with a negative value for *timeout* are equivalent to a *timeout* of zero. Invocations with a *timeout* value of ``None`` (the default) set the timeout period to infinite. Note that the treatment of negative or ``None`` values for *timeout* differs from the implemented behavior in :meth:`threading.Lock.acquire`. The *timeout* argument has no practical implications if the *block* argument is set to ``False`` and is thus ignored. Returns ``True`` if the lock has been acquired or ``False`` if the timeout period has elapsed.
uk: При виклику з додатним значенням з плаваючою комою для *timeout*, блокувати щонайбільше на кількість секунд, визначену *timeout*, доки не вдасться отримати блокування. Виклики з від’ємним значенням для *timeout* еквівалентні *timeout* рівному нулю. Виклики зі значенням *timeout* ``None`` (за замовчуванням) встановлюють період очікування як нескінченний. Зауважте, що обробка негативних значень або значень ``None`` для *timeout* відрізняється від реалізованої поведінки в :meth:`threading.Lock.acquire`. Аргумент *timeout* не має практичного значення, якщо для аргументу *block* встановлено значення ``False`` і, таким чином, він ігнорується. Повертає ``True``, якщо блокування отримано, або ``False``, якщо період очікування минув.

source: Release a lock. This can be called from any process or thread, not only the process or thread which originally acquired the lock.
uk: Відпустіть блокування. Це може бути викликано з будь-якого процесу або потоку, а не тільки процесу або потоку, який спочатку отримав блокування.

source: Behavior is the same as in :meth:`threading.Lock.release` except that when invoked on an unlocked lock, a :exc:`ValueError` is raised.
uk: Поведінка така ж, як у :meth:`threading.Lock.release`, за винятком того, що під час виклику для розблокованого блокування виникає :exc:`ValueError`.

source: A recursive lock object: a close analog of :class:`threading.RLock`. A recursive lock must be released by the process or thread that acquired it. Once a process or thread has acquired a recursive lock, the same process or thread may acquire it again without blocking; that process or thread must release it once for each time it has been acquired.
uk: Об’єкт рекурсивного блокування: близький аналог :class:`threading.RLock`. Рекурсивне блокування має бути звільнено процесом або потоком, який його отримав. Після того як процес або потік отримав рекурсивне блокування, той самий процес або потік може отримати його знову без блокування; цей процес або потік повинен випускати його один раз за кожен раз, коли його було отримано.

source: Note that :class:`RLock` is actually a factory function which returns an instance of ``multiprocessing.synchronize.RLock`` initialized with a default context.
uk: Зауважте, що :class:`RLock` насправді є фабричною функцією, яка повертає екземпляр ``multiprocessing.synchronize.RLock``, ініціалізований контекстом за замовчуванням.

source: :class:`RLock` supports the :term:`context manager` protocol and thus may be used in :keyword:`with` statements.
uk: :class:`RLock` підтримує протокол :term:`context manager` і тому може використовуватися в :keyword:`with` операторах.

source: When invoked with the *block* argument set to ``True``, block until the lock is in an unlocked state (not owned by any process or thread) unless the lock is already owned by the current process or thread. The current process or thread then takes ownership of the lock (if it does not already have ownership) and the recursion level inside the lock increments by one, resulting in a return value of ``True``. Note that there are several differences in this first argument's behavior compared to the implementation of :meth:`threading.RLock.acquire`, starting with the name of the argument itself.
uk: При виклику з аргументом *block*, встановленим у значення ``True``, блокувати, доки блокування не буде в розблокованому стані (не належить жодному процесу або потоку), якщо блокування вже не належить поточному процесу або потоку. Тоді поточний процес або потік отримує право власності на блокування (якщо він ще не має права власності), а рівень рекурсії всередині блокування збільшується на одиницю, що призводить до повернення значення ``True``. Зауважте, що є кілька відмінностей у поведінці цього першого аргументу порівняно з реалізацією :meth:`threading.RLock.acquire`, починаючи з назви самого аргументу.

source: When invoked with the *block* argument set to ``False``, do not block. If the lock has already been acquired (and thus is owned) by another process or thread, the current process or thread does not take ownership and the recursion level within the lock is not changed, resulting in a return value of ``False``. If the lock is in an unlocked state, the current process or thread takes ownership and the recursion level is incremented, resulting in a return value of ``True``.
uk: При виклику з аргументом *block*, встановленим на ``False``, не блокувати. Якщо блокування вже було отримано (і, отже, ним володіє) інший процес або потік, поточний процес або потік не приймає права власності, а рівень рекурсії в межах блокування не змінюється, що призводить до повернення значення ``False`` . Якщо блокування знаходиться в розблокованому стані, поточний процес або потік приймає право власності, і рівень рекурсії збільшується, що призводить до повернення значення ``True``.

source: Use and behaviors of the *timeout* argument are the same as in :meth:`Lock.acquire`. Note that some of these behaviors of *timeout* differ from the implemented behaviors in :meth:`threading.RLock.acquire`.
uk: Використання та поведінка аргументу *timeout* такі ж, як і в :meth:`Lock.acquire`. Зауважте, що деякі з цих дій *timeout* відрізняються від реалізованих у :meth:`threading.RLock.acquire`.

source: Release a lock, decrementing the recursion level. If after the decrement the recursion level is zero, reset the lock to unlocked (not owned by any process or thread) and if any other processes or threads are blocked waiting for the lock to become unlocked, allow exactly one of them to proceed. If after the decrement the recursion level is still nonzero, the lock remains locked and owned by the calling process or thread.
uk: Зніміть блокування, зменшивши рівень рекурсії. Якщо після зменшення рівень рекурсії дорівнює нулю, скиньте блокування до розблокованого (не належить жодному процесу чи потоку), а якщо будь-які інші процеси чи потоки заблоковані в очікуванні розблокування блокування, дозвольте рівно одному з них продовжити. Якщо після декременту рівень рекурсії все ще ненульовий, блокування залишається заблокованим і належить процесу або потоку, що викликає.

source: Only call this method when the calling process or thread owns the lock. An :exc:`AssertionError` is raised if this method is called by a process or thread other than the owner or if the lock is in an unlocked (unowned) state. Note that the type of exception raised in this situation differs from the implemented behavior in :meth:`threading.RLock.release`.
uk: Викликайте цей метод лише тоді, коли процес або потік, що викликає, володіє блокуванням. Помилка :exc:`AssertionError` виникає, якщо цей метод викликається процесом або потоком, відмінним від власника, або якщо блокування знаходиться в розблокованому стані (не належить). Зауважте, що тип винятку, викликаного в цій ситуації, відрізняється від реалізованої поведінки в :meth:`threading.RLock.release`.

source: A semaphore object: a close analog of :class:`threading.Semaphore`.
uk: Об’єкт семафор: близький аналог :class:`threading.Semaphore`.

source: On macOS, ``sem_timedwait`` is unsupported, so calling ``acquire()`` with a timeout will emulate that function's behavior using a sleeping loop.
uk: У macOS ``sem_timedwait`` не підтримується, тому виклик ``acquire()`` із тайм-аутом буде емулювати поведінку цієї функції за допомогою циклу сну.

source: Some of this package's functionality requires a functioning shared semaphore implementation on the host operating system. Without one, the :mod:`multiprocessing.synchronize` module will be disabled, and attempts to import it will result in an :exc:`ImportError`. See :issue:`3770` for additional information.
uk: Для деяких функцій цього пакета необхідна функціональна реалізація спільного семафора в головній операційній системі. Без нього модуль :mod:`multiprocessing.synchronize` буде вимкнено, а спроби його імпортувати призведуть до :exc:`ImportError`. Додаткову інформацію див. :issue:`3770`.

source: Shared :mod:`ctypes` Objects
uk: Спільні об’єкти :mod:`ctypes`

source: It is possible to create shared objects using shared memory which can be inherited by child processes.
uk: Можна створювати спільні об’єкти, використовуючи спільну пам’ять, яку можуть успадковувати дочірні процеси.

source: Return a :mod:`ctypes` object allocated from shared memory. By default the return value is actually a synchronized wrapper for the object. The object itself can be accessed via the *value* attribute of a :class:`Value`.
uk: Повертає об’єкт :mod:`ctypes`, виділений зі спільної пам’яті. За замовчуванням значення, що повертається, фактично є синхронізованою оболонкою для об’єкта. До самого об’єкта можна отримати доступ через атрибут *value* :class:`Value`.

source: *typecode_or_type* determines the type of the returned object: it is either a ctypes type or a one character typecode of the kind used by the :mod:`array` module. *\*args* is passed on to the constructor for the type.
uk: *typecode_or_type* визначає тип повернутого об’єкта: це або тип ctypes, або односимвольний код типу, який використовується модулем :mod:`array`. *\*args* передається конструктору для типу.

source: If *lock* is ``True`` (the default) then a new recursive lock object is created to synchronize access to the value. If *lock* is a :class:`Lock` or :class:`RLock` object then that will be used to synchronize access to the value. If *lock* is ``False`` then access to the returned object will not be automatically protected by a lock, so it will not necessarily be "process-safe".
uk: Якщо *lock* має значення ``True`` (за замовчуванням), тоді створюється новий об’єкт рекурсивного блокування для синхронізації доступу до значення. Якщо *lock* є об’єктом :class:`Lock` або :class:`RLock`, то він використовуватиметься для синхронізації доступу до значення. Якщо *lock* має значення ``False``, тоді доступ до повернутого об’єкта не буде автоматично захищений блокуванням, тому він не обов’язково буде "безпечним для процесу".

source: Operations like ``+=`` which involve a read and write are not atomic. So if, for instance, you want to atomically increment a shared value it is insufficient to just do ::
uk: Такі операції, як ``+=``, які передбачають читання та запис, не є атомарними. Отже, якщо, наприклад, ви хочете атомарно збільшити спільне значення, недостатньо просто зробити ::

source: Assuming the associated lock is recursive (which it is by default) you can instead do ::
uk: Якщо припустити, що пов’язане блокування є рекурсивним (що є за замовчуванням), ви можете замість цього зробити:

source: Note that *lock* is a keyword-only argument.
uk: Зверніть увагу, що *lock* є аргументом лише для ключового слова.

source: Return a ctypes array allocated from shared memory. By default the return value is actually a synchronized wrapper for the array.
uk: Повертає масив ctypes, виділений зі спільної пам’яті. За замовчуванням значення, що повертається, фактично є синхронізованою оболонкою для масиву.

source: *typecode_or_type* determines the type of the elements of the returned array: it is either a ctypes type or a one character typecode of the kind used by the :mod:`array` module. If *size_or_initializer* is an integer, then it determines the length of the array, and the array will be initially zeroed. Otherwise, *size_or_initializer* is a sequence which is used to initialize the array and whose length determines the length of the array.
uk: *typecode_or_type* визначає тип елементів повернутого масиву: це або тип ctypes, або односимвольний код типу, який використовується модулем :mod:`array`. Якщо *size_or_initializer* є цілим числом, воно визначає довжину масиву, і масив буде спочатку обнулений. В іншому випадку *size_or_initializer* — це послідовність, яка використовується для ініціалізації масиву, довжина якої визначає довжину масиву.
