Repository: python/python-docs-uk
Catalog: library/multiprocessing.po
Languages: uk

source: **Source code:** :source:`Lib/multiprocessing/`
uk: **Вихідний код:** :source:`Lib/multiprocessing/`

source: Introduction
uk: Вступ

source: The :mod:`multiprocessing` module also introduces APIs which do not have analogs in the :mod:`threading` module. A prime example of this is the :class:`~multiprocessing.pool.Pool` object which offers a convenient means of parallelizing the execution of a function across multiple input values, distributing the input data across processes (data parallelism). The following example demonstrates the common practice of defining such functions in a module so that child processes can successfully import that module. This basic example of data parallelism using :class:`~multiprocessing.pool.Pool`, ::
uk: Модуль :mod:`multiprocessing` також представляє API, які не мають аналогів у модулі :mod:`threading`. Яскравим прикладом цього є об’єкт :class:`~multiprocessing.pool.Pool`, який пропонує зручний засіб розпаралелювання виконання функції для кількох вхідних значень, розподіляючи вхідні дані між процесами (паралелізм даних). Наступний приклад демонструє звичайну практику визначення таких функцій у модулі, щоб дочірні процеси могли успішно імпортувати цей модуль. Цей базовий приклад паралелізму даних з використанням :class:`~multiprocessing.pool.Pool`, ::

source: will print to standard output ::
uk: друкуватиме стандартний вихід ::

source: The :class:`Process` class
uk: Клас :class:`Process`

source: In :mod:`multiprocessing`, processes are spawned by creating a :class:`Process` object and then calling its :meth:`~Process.start` method. :class:`Process` follows the API of :class:`threading.Thread`. A trivial example of a multiprocess program is ::
uk: У :mod:`multiprocessing` процеси породжуються шляхом створення об’єкта :class:`Process` і виклику його методу :meth:`~Process.start`. :class:`Process` відповідає API :class:`threading.Thread`. Тривіальним прикладом багатопроцесорної програми є:

source: To show the individual process IDs involved, here is an expanded example::
uk: Щоб показати ідентифікатори окремих процесів, ось розширений приклад:

source: For an explanation of why the ``if __name__ == '__main__'`` part is necessary, see :ref:`multiprocessing-programming`.
uk: Щоб отримати пояснення, чому потрібна частина ``if __name__ == '__main__''``, див. :ref:`multiprocessing-programming`.

source: Contexts and start methods
uk: Контексти та методи запуску

source: Depending on the platform, :mod:`multiprocessing` supports three ways to start a process. These *start methods* are
uk: Залежно від платформи :mod:`multiprocessing` підтримує три способи запуску процесу. Це *методи запуску*

source: *spawn*
uk: *спаун*

source: *fork*
uk: *вилка*

source: The parent process uses :func:`os.fork` to fork the Python interpreter. The child process, when it begins, is effectively identical to the parent process. All resources of the parent are inherited by the child process. Note that safely forking a multithreaded process is problematic.
uk: Батьківський процес використовує :func:`os.fork` для розгалуження інтерпретатора Python. Дочірній процес, коли він починається, фактично ідентичний батьківському процесу. Усі ресурси батьківського процесу успадковуються дочірнім процесом. Зверніть увагу, що безпечне розгалуження багатопотокового процесу є проблематичним.

source: *forkserver*
uk: *форксервер*

source: To select a start method you use the :func:`set_start_method` in the ``if __name__ == '__main__'`` clause of the main module. For example::
uk: Щоб вибрати метод запуску, ви використовуєте :func:`set_start_method` в пункті ``if __name__ == '__main__'`` головного модуля. Наприклад::

source: :func:`set_start_method` should not be used more than once in the program.
uk: :func:`set_start_method` не слід використовувати більше одного разу в програмі.

source: Alternatively, you can use :func:`get_context` to obtain a context object. Context objects have the same API as the multiprocessing module, and allow one to use multiple start methods in the same program. ::
uk: Крім того, ви можете використовувати :func:`get_context`, щоб отримати об’єкт контексту. Контекстні об’єкти мають той самий API, що й багатопроцесорний модуль, і дозволяють використовувати кілька методів запуску в одній програмі. ::

source: Note that objects related to one context may not be compatible with processes for a different context. In particular, locks created using the *fork* context cannot be passed to processes started using the *spawn* or *forkserver* start methods.
uk: Зауважте, що об’єкти, пов’язані з одним контекстом, можуть бути несумісними з процесами для іншого контексту. Зокрема, блокування, створені за допомогою контексту *fork*, не можна передати процесам, запущеним за допомогою методів запуску *spawn* або *forkserver*.

source: A library which wants to use a particular start method should probably use :func:`get_context` to avoid interfering with the choice of the library user.
uk: Бібліотека, яка хоче використовувати певний метод запуску, ймовірно, повинна використовувати :func:`get_context`, щоб уникнути втручання у вибір користувача бібліотеки.

source: Exchanging objects between processes
uk: Обмін об'єктами між процесами

source: :mod:`multiprocessing` supports two types of communication channel between processes:
uk: :mod:`multiprocessing` підтримує два типи каналів зв'язку між процесами:

source: **Queues**
uk: **Черги**

source: The :class:`Queue` class is a near clone of :class:`queue.Queue`. For example::
uk: Клас :class:`Queue` є майже клоном :class:`queue.Queue`. Наприклад::

source: **Pipes**
uk: **Труби**

source: The :func:`Pipe` function returns a pair of connection objects connected by a pipe which by default is duplex (two-way). For example::
uk: Функція :func:`Pipe` повертає пару об’єктів з’єднання, з’єднаних трубою, яка за умовчанням є дуплексною (двосторонньою). Наприклад::

source: The two connection objects returned by :func:`Pipe` represent the two ends of the pipe. Each connection object has :meth:`~Connection.send` and :meth:`~Connection.recv` methods (among others). Note that data in a pipe may become corrupted if two processes (or threads) try to read from or write to the *same* end of the pipe at the same time. Of course there is no risk of corruption from processes using different ends of the pipe at the same time.
uk: Два об’єкти з’єднання, які повертає :func:`Pipe`, представляють два кінці труби. Кожен об’єкт підключення має методи :meth:`~Connection.send` і :meth:`~Connection.recv` (серед інших). Зауважте, що дані в каналі можуть бути пошкоджені, якщо два процеси (або потоки) намагаються зчитувати або писати в *той самий* кінець каналу одночасно. Звичайно, немає ризику пошкодження через процеси, що використовують різні кінці труби одночасно.

source: Synchronization between processes
uk: Синхронізація між процесами

source: :mod:`multiprocessing` contains equivalents of all the synchronization primitives from :mod:`threading`. For instance one can use a lock to ensure that only one process prints to standard output at a time::
uk: :mod:`multiprocessing` містить еквіваленти всіх примітивів синхронізації з :mod:`threading`. Наприклад, можна використовувати блокування, щоб гарантувати, що лише один процес друкує на стандартний вивід одночасно:

source: Without using the lock output from the different processes is liable to get all mixed up.
uk: Без використання блокування вихідні дані різних процесів можуть переплутатися.

source: Sharing state between processes
uk: Спільне використання стану між процесами

source: As mentioned above, when doing concurrent programming it is usually best to avoid using shared state as far as possible. This is particularly true when using multiple processes.
uk: Як згадувалося вище, під час паралельного програмування зазвичай краще уникати використання спільного стану, наскільки це можливо. Це особливо актуально при використанні кількох процесів.

source: However, if you really do need to use some shared data then :mod:`multiprocessing` provides a couple of ways of doing so.
uk: Однак, якщо вам справді потрібно використовувати спільні дані, тоді :mod:`multiprocessing` надає кілька способів зробити це.

source: **Shared memory**
uk: **Спільна пам'ять**

source: Data can be stored in a shared memory map using :class:`Value` or :class:`Array`. For example, the following code ::
uk: Дані можна зберігати в спільній карті пам’яті за допомогою :class:`Value` або :class:`Array`. Наприклад, такий код::

source: will print ::
uk: надрукую ::

source: The ``'d'`` and ``'i'`` arguments used when creating ``num`` and ``arr`` are typecodes of the kind used by the :mod:`array` module: ``'d'`` indicates a double precision float and ``'i'`` indicates a signed integer. These shared objects will be process and thread-safe.
uk: Аргументи ``'d'`` і ``'i'``, що використовуються під час створення ``num`` і ``arr``, є кодами типу, які використовуються модулем :mod:`array`: ``' d''`` вказує на число з плаваючою точкою подвійної точності, а ``'i''`` вказує на ціле число зі знаком. Ці спільні об’єкти будуть безпечними для процесу та потоків.

source: For more flexibility in using shared memory one can use the :mod:`multiprocessing.sharedctypes` module which supports the creation of arbitrary ctypes objects allocated from shared memory.
uk: Для більшої гнучкості використання спільної пам’яті можна використовувати модуль :mod:`multiprocessing.sharedctypes`, який підтримує створення довільних об’єктів ctypes, виділених із спільної пам’яті.

source: **Server process**
uk: **Серверний процес**

source: A manager object returned by :func:`Manager` controls a server process which holds Python objects and allows other processes to manipulate them using proxies.
uk: Об’єкт менеджера, який повертає :func:`Manager`, контролює серверний процес, який містить об’єкти Python і дозволяє іншим процесам маніпулювати ними за допомогою проксі-серверів.

source: A manager returned by :func:`Manager` will support types :class:`list`, :class:`dict`, :class:`~managers.Namespace`, :class:`Lock`, :class:`RLock`, :class:`Semaphore`, :class:`BoundedSemaphore`, :class:`Condition`, :class:`Event`, :class:`Barrier`, :class:`Queue`, :class:`Value` and :class:`Array`. For example, ::
uk: Менеджер, який повертає :func:`Manager`, підтримуватиме типи :class:`list`, :class:`dict`, :class:`~managers.Namespace`, :class:`Lock`, :class:`RLock` і :class:`Semaphore`, :class:`BoundedSemaphore`, :class:`Condition`, :class:`Event`, :class:`Barrier`, :class:`Queue`, :class:`Value` and :class:`Array`. Наприклад, ::

source: Server process managers are more flexible than using shared memory objects because they can be made to support arbitrary object types. Also, a single manager can be shared by processes on different computers over a network. They are, however, slower than using shared memory.
uk: Менеджери серверних процесів є більш гнучкими, ніж використання спільних об’єктів пам’яті, оскільки вони можуть підтримувати довільні типи об’єктів. Крім того, один менеджер може спільно використовуватися процесами на різних комп’ютерах у мережі. Однак вони повільніші, ніж використання спільної пам’яті.

source: Using a pool of workers
uk: Використання пулу працівників

source: The :class:`~multiprocessing.pool.Pool` class represents a pool of worker processes. It has methods which allows tasks to be offloaded to the worker processes in a few different ways.
uk: Клас :class:`~multiprocessing.pool.Pool` представляє пул робочих процесів. Він має методи, які дозволяють розвантажувати завдання на робочі процеси кількома різними способами.

source: For example::
uk: Наприклад::

source: Note that the methods of a pool should only ever be used by the process which created it.
uk: Зверніть увагу, що методи пулу повинні використовуватися тільки тим процесом, який його створив.

source: Functionality within this package requires that the ``__main__`` module be importable by the children. This is covered in :ref:`multiprocessing-programming` however it is worth pointing out here. This means that some examples, such as the :class:`multiprocessing.pool.Pool` examples will not work in the interactive interpreter. For example::
uk: Функціональність цього пакета вимагає, щоб модуль ``__main__`` міг імпортуватися дочірніми елементами. Це описано в :ref:`multiprocessing-programming`, проте тут варто звернути увагу на це. Це означає, що деякі приклади, такі як приклади :class:`multiprocessing.pool.Pool` не працюватимуть в інтерактивному інтерпретаторі. Наприклад::

source: (If you try this it will actually output three full tracebacks interleaved in a semi-random fashion, and then you may have to stop the parent process somehow.)
uk: (Якщо ви спробуєте це, він фактично виведе три повні трасування, чергувані напіввипадковим чином, і тоді вам, можливо, доведеться якось зупинити батьківський процес.)

source: Reference
uk: довідка

source: The :mod:`multiprocessing` package mostly replicates the API of the :mod:`threading` module.
uk: Пакет :mod:`multiprocessing` здебільшого повторює API модуля :mod:`threading`.

source: :class:`Process` and exceptions
uk: :class:`Process` і винятки

source: Process objects represent activity that is run in a separate process. The :class:`Process` class has equivalents of all the methods of :class:`threading.Thread`.
uk: Об’єкти процесу представляють діяльність, яка виконується в окремому процесі. Клас :class:`Process` має еквіваленти всіх методів :class:`threading.Thread`.

source: If a subclass overrides the constructor, it must make sure it invokes the base class constructor (:meth:`Process.__init__`) before doing anything else to the process.
uk: Якщо підклас перевизначає конструктор, він повинен переконатися, що він викликає конструктор базового класу (:meth:`Process.__init__`), перш ніж щось робити з процесом.

source: Method representing the process's activity.
uk: Метод, що представляє діяльність процесу.

source: You may override this method in a subclass. The standard :meth:`run` method invokes the callable object passed to the object's constructor as the target argument, if any, with sequential and keyword arguments taken from the *args* and *kwargs* arguments, respectively.
uk: Ви можете перевизначити цей метод у підкласі. Стандартний метод :meth:`run` викликає викликаний об’єкт, переданий конструктору об’єкта як цільовий аргумент, якщо такий є, з послідовними аргументами та ключовими аргументами, взятими з аргументів *args* і *kwargs* відповідно.

source: Example::
uk: Приклад::

source: Start the process's activity.
uk: Запустіть процес.

source: This must be called at most once per process object. It arranges for the object's :meth:`run` method to be invoked in a separate process.
uk: Це має бути викликано щонайбільше один раз на об’єкт процесу. Він організовує виклик методу :meth:`run` об’єкта в окремому процесі.

source: If the optional argument *timeout* is ``None`` (the default), the method blocks until the process whose :meth:`join` method is called terminates. If *timeout* is a positive number, it blocks at most *timeout* seconds. Note that the method returns ``None`` if its process terminates or if the method times out. Check the process's :attr:`exitcode` to determine if it terminated.
uk: Якщо додатковий аргумент *timeout* має значення ``None`` (за замовчуванням), метод блокується, доки процес, чий метод :meth:`join` викликається, не завершиться. Якщо *timeout* є додатним числом, воно блокує щонайбільше *timeout* секунд. Зауважте, що метод повертає ``None``, якщо його процес завершується або якщо метод закінчився. Перевірте :attr:`exitcode` процесу, щоб визначити, чи він завершився.

source: A process can be joined many times.
uk: До процесу можна приєднуватися багато разів.

source: A process cannot join itself because this would cause a deadlock. It is an error to attempt to join a process before it has been started.
uk: Процес не може приєднатися до себе, оскільки це спричинить тупикову блокування. Спроба приєднатися до процесу до його запуску є помилкою.

source: The process's name. The name is a string used for identification purposes only. It has no semantics. Multiple processes may be given the same name.
uk: Назва процесу. Ім'я - це рядок, який використовується лише для ідентифікації. Він не має семантики. Кілька процесів можуть мати однакові назви.

source: The initial name is set by the constructor. If no explicit name is provided to the constructor, a name of the form 'Process-N\ :sub:`1`:N\ :sub:`2`:...:N\ :sub:`k`' is constructed, where each N\ :sub:`k` is the N-th child of its parent.
uk: Початкове ім'я задається конструктором. Якщо конструктору не надано явної назви, ім’я у формі 'Process-N\ :sub:`1`:N\ :sub:`2`:...:N\ :sub:`k`' побудований, де кожен N\ :sub:`k` є N-м дочірнім елементом свого батька.

source: Return whether the process is alive.
uk: Повернути, чи процес активний.

source: Roughly, a process object is alive from the moment the :meth:`start` method returns until the child process terminates.
uk: Приблизно, об’єкт процесу живий з моменту повернення методу :meth:`start` до завершення дочірнього процесу.

source: The process's daemon flag, a Boolean value. This must be set before :meth:`start` is called.
uk: Прапор демона процесу, логічне значення. Це має бути встановлено перед викликом :meth:`start`.

source: The initial value is inherited from the creating process.
uk: Початкове значення успадковується від процесу створення.

source: When a process exits, it attempts to terminate all of its daemonic child processes.
uk: Коли процес завершується, він намагається завершити всі свої демонічні дочірні процеси.

source: Note that a daemonic process is not allowed to create child processes. Otherwise a daemonic process would leave its children orphaned if it gets terminated when its parent process exits. Additionally, these are **not** Unix daemons or services, they are normal processes that will be terminated (and not joined) if non-daemonic processes have exited.
uk: Зауважте, що демонічному процесу не дозволяється створювати дочірні процеси. Інакше демонічний процес залишив би своїх нащадків сиротами, якщо він буде припинений під час завершення процесу батьківського процесу. Крім того, це **не** демони чи служби Unix, це звичайні процеси, які будуть припинені (і не приєднані), якщо недемонічні процеси вийшли.

source: In addition to the :class:`threading.Thread` API, :class:`Process` objects also support the following attributes and methods:
uk: Окрім API :class:`threading.Thread`, об’єкти :class:`Process` також підтримують такі атрибути та методи:

source: Return the process ID. Before the process is spawned, this will be ``None``.
uk: Поверніть ідентифікатор процесу. До того, як процес буде створено, це буде ``None``.

source: The child's exit code. This will be ``None`` if the process has not yet terminated.
uk: Код виходу дитини. Це буде ``None``, якщо процес ще не завершено.

source: If the child's :meth:`run` method returned normally, the exit code will be 0. If it terminated via :func:`sys.exit` with an integer argument *N*, the exit code will be *N*.
uk: Якщо дочірній метод :meth:`run` повернувся нормально, код виходу буде 0. Якщо він закінчився через :func:`sys.exit` із цілим аргументом *N*, код виходу буде *N*.

source: If the child terminated due to an exception not caught within :meth:`run`, the exit code will be 1. If it was terminated by signal *N*, the exit code will be the negative value *-N*.
uk: Якщо дочірній процес завершився через виняток, який не було перехоплено в :meth:`run`, код виходу буде 1. Якщо його було завершено сигналом *N*, код виходу матиме від’ємне значення *-N*.

source: The process's authentication key (a byte string).
uk: Ключ автентифікації процесу (рядок байтів).

source: When :mod:`multiprocessing` is initialized the main process is assigned a random string using :func:`os.urandom`.
uk: Коли :mod:`multiprocessing` ініціалізовано, головному процесу призначається випадковий рядок за допомогою :func:`os.urandom`.

source: When a :class:`Process` object is created, it will inherit the authentication key of its parent process, although this may be changed by setting :attr:`authkey` to another byte string.
uk: Коли об’єкт :class:`Process` створюється, він успадковує ключ автентифікації свого батьківського процесу, хоча це можна змінити, встановивши :attr:`authkey` інший байтовий рядок.

source: See :ref:`multiprocessing-auth-keys`.
uk: Перегляньте :ref:`multiprocessing-auth-keys`.

source: A numeric handle of a system object which will become "ready" when the process ends.
uk: Числовий дескриптор системного об’єкта, який стане "готовим" після завершення процесу.

source: Note that descendant processes of the process will *not* be terminated -- they will simply become orphaned.
uk: Зверніть увагу, що процеси-нащадки процесу *не* будуть припинені -- вони просто стануть сиротами.

source: If this method is used when the associated process is using a pipe or queue then the pipe or queue is liable to become corrupted and may become unusable by other process. Similarly, if the process has acquired a lock or semaphore etc. then terminating it is liable to cause other processes to deadlock.
uk: Якщо цей метод використовується, коли пов’язаний процес використовує канал або чергу, канал або чергу можуть бути пошкоджені та можуть стати непридатними для використання іншим процесом. Подібним чином, якщо процес отримав блокування або семафор тощо, його завершення може призвести до блокування інших процесів.

source: Close the :class:`Process` object, releasing all resources associated with it. :exc:`ValueError` is raised if the underlying process is still running. Once :meth:`close` returns successfully, most other methods and attributes of the :class:`Process` object will raise :exc:`ValueError`.
uk: Закрийте об’єкт :class:`Process`, звільнивши всі пов’язані з ним ресурси. :exc:`ValueError` виникає, якщо основний процес все ще виконується. Після успішного повернення :meth:`close` більшість інших методів і атрибутів об’єкта :class:`Process` викличуть :exc:`ValueError`.

source: Note that the :meth:`start`, :meth:`join`, :meth:`is_alive`, :meth:`terminate` and :attr:`exitcode` methods should only be called by the process that created the process object.
uk: Зауважте, що методи :meth:`start`, :meth:`join`, :meth:`is_alive`, :meth:`terminate` і :attr:`exitcode` має викликати лише процес, який створив об’єкт процесу .

source: Example usage of some of the methods of :class:`Process`:
uk: Приклад використання деяких методів :class:`Process`:

source: The base class of all :mod:`multiprocessing` exceptions.
uk: Базовий клас усіх винятків :mod:`multiprocessing`.

source: If ``e`` is an instance of :exc:`BufferTooShort` then ``e.args[0]`` will give the message as a byte string.
uk: Якщо ``e`` є екземпляром :exc:`BufferTooShort`, то ``e.args[0]`` видасть повідомлення як рядок байтів.

source: Raised when there is an authentication error.
uk: Викликається, коли виникає помилка автентифікації.

source: Raised by methods with a timeout when the timeout expires.
uk: Викликається методами з тайм-аутом, коли час очікування закінчується.

source: Pipes and Queues
uk: Труби та черги

source: When using multiple processes, one generally uses message passing for communication between processes and avoids having to use any synchronization primitives like locks.
uk: При використанні кількох процесів зазвичай використовується передача повідомлень для зв’язку між процесами та уникається використання будь-яких примітивів синхронізації, таких як блокування.
