Repository: python/python-docs-uk
Catalog: library/multiprocessing.po
Languages: uk

source: Accept a connection on the bound socket or named pipe of the listener object and return a :class:`~Connection` object. If authentication is attempted and fails, then :exc:`~multiprocessing.AuthenticationError` is raised.
uk: Прийняти підключення до зв’язаного сокета або іменованого каналу об’єкта слухача та повернути об’єкт :class:`~Connection`. Якщо спроба автентифікації не вдається, виникає :exc:`~multiprocessing.AuthenticationError`.

source: Close the bound socket or named pipe of the listener object. This is called automatically when the listener is garbage collected. However it is advisable to call it explicitly.
uk: Закрийте прив’язаний сокет або іменований канал об’єкта слухача. Це викликається автоматично, коли слухач збирає сміття. Однак бажано називати це явно.

source: Listener objects have the following read-only properties:
uk: Об’єкти слухача мають такі властивості лише для читання:

source: The address which is being used by the Listener object.
uk: Адреса, яка використовується об’єктом Listener.

source: The address from which the last accepted connection came. If this is unavailable then it is ``None``.
uk: Адреса, з якої надійшло останнє прийняте підключення. Якщо це недоступно, це ``None``.

source: Listener objects now support the context management protocol -- see :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` returns the listener object, and :meth:`~contextmanager.__exit__` calls :meth:`close`.
uk: Об’єкти слухача тепер підтримують протокол керування контекстом – див. :ref:`typecontextmanager`. :meth:`~contextmanager.__enter__` повертає об’єкт слухача, а :meth:`~contextmanager.__exit__` викликає :meth:`close`.

source: Wait till an object in *object_list* is ready. Returns the list of those objects in *object_list* which are ready. If *timeout* is a float then the call blocks for at most that many seconds. If *timeout* is ``None`` then it will block for an unlimited period. A negative timeout is equivalent to a zero timeout.
uk: Зачекайте, поки об'єкт у *object_list* буде готовий. Повертає список тих об'єктів у *object_list*, які готові. Якщо *timeout* є числом з плаваючою точкою, виклик блокується щонайбільше на стільки секунд. Якщо *timeout* має значення ``None``, тоді він блокуватиметься на необмежений період. Від’ємний тайм-аут еквівалентний нульовому тайм-ауту.

source: a readable :class:`~multiprocessing.connection.Connection` object;
uk: читабельний об’єкт :class:`~multiprocessing.connection.Connection`;

source: a connected and readable :class:`socket.socket` object; or
uk: підключений і читабельний об’єкт :class:`socket.socket`; або

source: the :attr:`~multiprocessing.Process.sentinel` attribute of a :class:`~multiprocessing.Process` object.
uk: атрибут :attr:`~multiprocessing.Process.sentinel` об’єкта :class:`~multiprocessing.Process`.

source: A connection or socket object is ready when there is data available to be read from it, or the other end has been closed.
uk: Об’єкт з’єднання або сокета готовий, коли є доступні дані для читання з нього, або інший кінець закрито.

source: **Examples**
uk: **Приклади**

source: The following server code creates a listener which uses ``'secret password'`` as an authentication key. It then waits for a connection and sends some data to the client::
uk: Наступний код сервера створює прослуховувач, який використовує ``'секретний пароль`` як ключ автентифікації. Потім він очікує з’єднання та надсилає деякі дані клієнту::

source: The following code connects to the server and receives some data from the server::
uk: Наступний код підключається до сервера та отримує деякі дані з сервера:

source: The following code uses :func:`~multiprocessing.connection.wait` to wait for messages from multiple processes at once::
uk: Наступний код використовує :func:`~multiprocessing.connection.wait` для очікування повідомлень від кількох процесів одночасно::

source: Address Formats
uk: Формати адрес

source: An ``'AF_INET'`` address is a tuple of the form ``(hostname, port)`` where *hostname* is a string and *port* is an integer.
uk: Адреса "AF_INET" — це кортеж у формі "(ім’я хоста, порт)", де *ім’я хоста* — рядок, а *порт* — ціле число.

source: An ``'AF_UNIX'`` address is a string representing a filename on the filesystem.
uk: Адреса "AF_UNIX" — це рядок, що представляє назву файлу у файловій системі.

source: Note that any string beginning with two backslashes is assumed by default to be an ``'AF_PIPE'`` address rather than an ``'AF_UNIX'`` address.
uk: Зауважте, що будь-який рядок, який починається двома зворотними похилими рисками, за замовчуванням вважається адресою ``'AF_PIPE'``, а не адресою ``'AF_UNIX'``.

source: Authentication keys
uk: Ключі автентифікації

source: When one uses :meth:`Connection.recv <Connection.recv>`, the data received is automatically unpickled. Unfortunately unpickling data from an untrusted source is a security risk. Therefore :class:`Listener` and :func:`Client` use the :mod:`hmac` module to provide digest authentication.
uk: Коли використовується :meth:`Connection.recv <Connection.recv>`, отримані дані автоматично видаляються. На жаль, видалення даних із ненадійного джерела становить загрозу безпеці. Тому :class:`Listener` і :func:`Client` використовують модуль :mod:`hmac` для забезпечення автентифікації дайджесту.

source: An authentication key is a byte string which can be thought of as a password: once a connection is established both ends will demand proof that the other knows the authentication key. (Demonstrating that both ends are using the same key does **not** involve sending the key over the connection.)
uk: Ключ автентифікації — це рядок байтів, який можна розглядати як пароль: коли з’єднання встановлено, обидва кінці вимагатимуть підтвердження того, що інший знає ключ автентифікації. (Демонстрація того, що обидві сторони використовують той самий ключ, **не** передбачає надсилання ключа через з’єднання.)

source: If authentication is requested but no authentication key is specified then the return value of ``current_process().authkey`` is used (see :class:`~multiprocessing.Process`). This value will be automatically inherited by any :class:`~multiprocessing.Process` object that the current process creates. This means that (by default) all processes of a multi-process program will share a single authentication key which can be used when setting up connections between themselves.
uk: Якщо автентифікація запитується, але ключ автентифікації не вказано, тоді використовується значення, що повертається ``current_process().authkey`` (див. :class:`~multiprocessing.Process`). Це значення буде автоматично успадковано будь-яким об’єктом :class:`~multiprocessing.Process`, який створює поточний процес. Це означає, що (за замовчуванням) усі процеси багатопроцесної програми спільно використовуватимуть один ключ автентифікації, який можна використовувати під час встановлення з’єднань між собою.

source: Suitable authentication keys can also be generated by using :func:`os.urandom`.
uk: Відповідні ключі автентифікації також можна згенерувати за допомогою :func:`os.urandom`.

source: Logging
uk: Лісозаготівля

source: Some support for logging is available. Note, however, that the :mod:`logging` package does not use process shared locks so it is possible (depending on the handler type) for messages from different processes to get mixed up.
uk: Доступна певна підтримка журналювання. Однак зауважте, що пакунок :mod:`logging` не використовує спільні блокування процесів, тому (залежно від типу обробника) повідомлення від різних процесів можуть переплутатися.

source: Returns the logger used by :mod:`multiprocessing`. If necessary, a new one will be created.
uk: Повертає реєстратор, який використовується :mod:`multiprocessing`. За потреби буде створено новий.

source: Note that on Windows child processes will only inherit the level of the parent process's logger -- any other customization of the logger will not be inherited.
uk: Зауважте, що у Windows дочірні процеси успадковуватимуть лише рівень реєстратора батьківського процесу – будь-які інші налаштування реєстратора не успадковуватимуться.

source: This function performs a call to :func:`get_logger` but in addition to returning the logger created by get_logger, it adds a handler which sends output to :data:`sys.stderr` using format ``'[%(levelname)s/%(processName)s] %(message)s'``. You can modify ``levelname`` of the logger by passing a ``level`` argument.
uk: Ця функція виконує виклик :func:`get_logger`, але окрім повернення реєстратора, створеного get_logger, вона додає обробник, який надсилає вихідні дані до :data:`sys.stderr` у форматі ``'[%(levelname)s/%(processName)s] %(message)s ''``. Ви можете змінити ``levelname`` реєстратора, передавши аргумент ``level``.

source: Below is an example session with logging turned on::
uk: Нижче наведено приклад сеансу з увімкненим журналюванням::

source: For a full table of logging levels, see the :mod:`logging` module.
uk: Щоб отримати повну таблицю рівнів журналювання, перегляньте модуль :mod:`logging`.

source: The :mod:`multiprocessing.dummy` module
uk: Модуль :mod:`multiprocessing.dummy`

source: :mod:`multiprocessing.dummy` replicates the API of :mod:`multiprocessing` but is no more than a wrapper around the :mod:`threading` module.
uk: :mod:`multiprocessing.dummy` повторює API :mod:`multiprocessing`, але є не більше ніж обгорткою модуля :mod:`threading`.

source: In particular, the ``Pool`` function provided by :mod:`multiprocessing.dummy` returns an instance of :class:`ThreadPool`, which is a subclass of :class:`Pool` that supports all the same method calls but uses a pool of worker threads rather than worker processes.
uk: Зокрема, функція ``Pool``, надана :mod:`multiprocessing.dummy`, повертає екземпляр :class:`ThreadPool`, який є підкласом :class:`Pool`, який підтримує всі виклики методів, але використовує пул робочих потоків, а не робочих процесів.

source: A thread pool object which controls a pool of worker threads to which jobs can be submitted. :class:`ThreadPool` instances are fully interface compatible with :class:`Pool` instances, and their resources must also be properly managed, either by using the pool as a context manager or by calling :meth:`~multiprocessing.pool.Pool.close` and :meth:`~multiprocessing.pool.Pool.terminate` manually.
uk: Об’єкт пулу потоків, який керує пулом робочих потоків, до яких можна надсилати завдання. Екземпляри :class:`ThreadPool` повністю сумісні з інтерфейсом екземплярів :class:`Pool`, і їхніми ресурсами також потрібно правильно керувати, використовуючи пул як контекстний менеджер або викликаючи :meth:`~multiprocessing.pool. Pool.close` і :meth:`~multiprocessing.pool.Pool.terminate` вручну.

source: Unlike :class:`Pool`, *maxtasksperchild* and *context* cannot be provided.
uk: На відміну від :class:`Pool`, *maxtasksperchild* і *context* не можна надати.

source: A :class:`ThreadPool` shares the same interface as :class:`Pool`, which is designed around a pool of processes and predates the introduction of the :class:`concurrent.futures` module. As such, it inherits some operations that don't make sense for a pool backed by threads, and it has its own type for representing the status of asynchronous jobs, :class:`AsyncResult`, that is not understood by any other libraries.
uk: :class:`ThreadPool` має той самий інтерфейс, що й :class:`Pool`, який розроблено навколо пулу процесів і передує появі модуля :class:`concurrent.futures`. Таким чином, він успадковує деякі операції, які не мають сенсу для пулу, що підтримується потоками, і має власний тип для представлення статусу асинхронних завдань, :class:`AsyncResult`, який не розуміється жодною іншою бібліотекою.

source: Users should generally prefer to use :class:`concurrent.futures.ThreadPoolExecutor`, which has a simpler interface that was designed around threads from the start, and which returns :class:`concurrent.futures.Future` instances that are compatible with many other libraries, including :mod:`asyncio`.
uk: Зазвичай користувачі мають віддавати перевагу використанню :class:`concurrent.futures.ThreadPoolExecutor`, який має простіший інтерфейс, розроблений навколо потоків із самого початку та повертає :class:`concurrent.futures.Future` екземпляри, сумісні з багатьма інші бібліотеки, включаючи :mod:`asyncio`.

source: Programming guidelines
uk: Інструкції з програмування

source: There are certain guidelines and idioms which should be adhered to when using :mod:`multiprocessing`.
uk: Існують певні вказівки та ідіоми, яких слід дотримуватися під час використання :mod:`multiprocessing`.

source: All start methods
uk: Всі методи запуску

source: The following applies to all start methods.
uk: Наступне стосується всіх методів запуску.

source: Avoid shared state
uk: Уникайте спільного стану

source: As far as possible one should try to avoid shifting large amounts of data between processes.
uk: Наскільки це можливо, слід намагатися уникати переміщення великих обсягів даних між процесами.

source: It is probably best to stick to using queues or pipes for communication between processes rather than using the lower level synchronization primitives.
uk: Ймовірно, найкраще використовувати черги або канали для зв’язку між процесами, а не використовувати примітиви синхронізації нижчого рівня.

source: Picklability
uk: Пробірність

source: Ensure that the arguments to the methods of proxies are picklable.
uk: Переконайтеся, що аргументи методів проксі-серверів можна вибрати.

source: Thread safety of proxies
uk: Безпека потоків проксі

source: Do not use a proxy object from more than one thread unless you protect it with a lock.
uk: Не використовуйте проксі-об’єкт із кількох потоків, якщо ви не захистите його за допомогою блокування.

source: (There is never a problem with different processes using the *same* proxy.)
uk: (Ніколи не виникає проблем із різними процесами, які використовують *той самий* проксі.)

source: Joining zombie processes
uk: Приєднання до зомбованих процесів

source: Better to inherit than pickle/unpickle
uk: Краще успадкувати, ніж маринувати/розмаринувати

source: When using the *spawn* or *forkserver* start methods many types from :mod:`multiprocessing` need to be picklable so that child processes can use them. However, one should generally avoid sending shared objects to other processes using pipes or queues. Instead you should arrange the program so that a process which needs access to a shared resource created elsewhere can inherit it from an ancestor process.
uk: Під час використання методів запуску *spawn* або *forkserver* багато типів із :mod:`multiprocessing` мають бути доступними для вибору, щоб дочірні процеси могли їх використовувати. Однак зазвичай слід уникати надсилання спільних об’єктів іншим процесам за допомогою каналів або черг. Натомість ви повинні організувати програму так, щоб процес, якому потрібен доступ до спільного ресурсу, створеного в іншому місці, міг успадкувати його від процесу-предка.

source: Avoid terminating processes
uk: Уникайте завершення процесів

source: Using the :meth:`Process.terminate <multiprocessing.Process.terminate>` method to stop a process is liable to cause any shared resources (such as locks, semaphores, pipes and queues) currently being used by the process to become broken or unavailable to other processes.
uk: Використання методу :meth:`Process.terminate <multiprocessing.Process.terminate>` для зупинки процесу може призвести до того, що будь-які спільні ресурси (такі як блокування, семафори, канали та черги), які зараз використовуються цим процесом, стануть несправними або недоступними для інших процесів.

source: Therefore it is probably best to only consider using :meth:`Process.terminate <multiprocessing.Process.terminate>` on processes which never use any shared resources.
uk: Тому, ймовірно, найкраще використовувати :meth:`Process.terminate <multiprocessing.Process.terminate>` лише для процесів, які ніколи не використовують спільні ресурси.

source: Joining processes that use queues
uk: Приєднання до процесів, які використовують черги

source: Bear in mind that a process that has put items in a queue will wait before terminating until all the buffered items are fed by the "feeder" thread to the underlying pipe. (The child process can call the :meth:`Queue.cancel_join_thread <multiprocessing.Queue.cancel_join_thread>` method of the queue to avoid this behaviour.)
uk: Майте на увазі, що процес, який поставив елементи в чергу, чекатиме перед завершенням, доки всі буферизовані елементи не будуть передані потоком "фідера" до основного каналу. (Дочірній процес може викликати метод :meth:`Queue.cancel_join_thread <multiprocessing.Queue.cancel_join_thread>` черги, щоб уникнути такої поведінки.)

source: This means that whenever you use a queue you need to make sure that all items which have been put on the queue will eventually be removed before the process is joined. Otherwise you cannot be sure that processes which have put items on the queue will terminate. Remember also that non-daemonic processes will be joined automatically.
uk: Це означає, що щоразу, коли ви використовуєте чергу, вам потрібно переконатися, що всі елементи, які було поставлено в чергу, зрештою буде видалено перед приєднанням до процесу. Інакше ви не можете бути впевнені, що процеси, які поставили елементи в чергу, завершаться. Пам'ятайте також, що недемонічні процеси будуть приєднані автоматично.

source: An example which will deadlock is the following::
uk: Прикладом, який призведе до взаємоблокування, є наступний:

source: A fix here would be to swap the last two lines (or simply remove the ``p.join()`` line).
uk: Виправити тут можна було б поміняти місцями останні два рядки (або просто видалити рядок ``p.join()``).

source: Explicitly pass resources to child processes
uk: Явно передати ресурси дочірнім процесам

source: Apart from making the code (potentially) compatible with Windows and the other start methods this also ensures that as long as the child process is still alive the object will not be garbage collected in the parent process. This might be important if some resource is freed when the object is garbage collected in the parent process.
uk: Окрім того, що код (потенційно) сумісний із Windows та іншими методами запуску, це також гарантує, що поки дочірній процес живий, об’єкт не збиратиме сміття в батьківському процесі. Це може бути важливо, якщо якийсь ресурс звільняється, коли об’єкт збирається як сміття в батьківському процесі.

source: So for instance ::
uk: Так наприклад ::

source: should be rewritten as ::
uk: слід переписати як ::

source: Beware of replacing :data:`sys.stdin` with a "file like object"
uk: Остерігайтеся заміни :data:`sys.stdin` на "файлоподібний об’єкт"

source: :mod:`multiprocessing` originally unconditionally called::
uk: :mod:`multiprocessing` спочатку безумовно називався::

source: in the :meth:`multiprocessing.Process._bootstrap` method --- this resulted in issues with processes-in-processes. This has been changed to::
uk: у методі :meth:`multiprocessing.Process._bootstrap` --- це призвело до проблем із процесами в процесах. Це було змінено на::

source: If you write a file-like object and implement your own caching, you can make it fork-safe by storing the pid whenever you append to the cache, and discarding the cache when the pid changes. For example::
uk: Якщо ви пишете файлоподібний об’єкт і використовуєте власне кешування, ви можете зробити його безпечним для розгалуження, зберігаючи pid кожного разу, коли ви додаєте його до кешу, і відкидаючи кеш, коли pid змінюється. Наприклад::

source: For more information, see :issue:`5155`, :issue:`5313` and :issue:`5331`
uk: Для отримання додаткової інформації перегляньте :issue:`5155`, :issue:`5313` та :issue:`5331`

source: The *spawn* and *forkserver* start methods
uk: Методи запуску *spawn* і *forkserver*

source: More picklability
uk: Більше маринування

source: Ensure that all arguments to :meth:`Process.__init__` are picklable. Also, if you subclass :class:`~multiprocessing.Process` then make sure that instances will be picklable when the :meth:`Process.start <multiprocessing.Process.start>` method is called.
uk: Переконайтеся, що всі аргументи :meth:`Process.__init__` можна вибрати. Крім того, якщо ви створите підклас :class:`~multiprocessing.Process`, то переконайтеся, що екземпляри можна вибрати під час виклику методу :meth:`Process.start <multiprocessing.Process.start>`.

source: Global variables
uk: Глобальні змінні

source: Bear in mind that if code run in a child process tries to access a global variable, then the value it sees (if any) may not be the same as the value in the parent process at the time that :meth:`Process.start <multiprocessing.Process.start>` was called.
uk: Майте на увазі, що якщо код, запущений у дочірньому процесі, намагається отримати доступ до глобальної змінної, тоді значення, яке він бачить (якщо таке є), може не збігатися зі значенням у батьківському процесі під час :meth:`Process.start викликано <multiprocessing.Process.start>`.

source: However, global variables which are just module level constants cause no problems.
uk: Однак глобальні змінні, які є лише константами рівня модуля, не викликають проблем.

source: Safe importing of main module
uk: Безпечне імпортування основного модуля

source: For example, using the *spawn* or *forkserver* start method running the following module would fail with a :exc:`RuntimeError`::
uk: Наприклад, використання методу запуску *spawn* або *forkserver* під час запуску наступного модуля призведе до помилки з :exc:`RuntimeError`::

source: Instead one should protect the "entry point" of the program by using ``if __name__ == '__main__':`` as follows::
uk: Натомість слід захистити "точку входу" програми за допомогою ``if __name__ == '__main__':`` наступним чином::

source: (The ``freeze_support()`` line can be omitted if the program will be run normally instead of frozen.)
uk: (Рядок ``freeze_support()`` можна опустити, якщо програма буде працювати нормально, а не зависати.)

source: This allows the newly spawned Python interpreter to safely import the module and then run the module's ``foo()`` function.
uk: Це дозволяє щойно створеному інтерпретатору Python безпечно імпортувати модуль, а потім запускати функцію foo() модуля.

source: Similar restrictions apply if a pool or manager is created in the main module.
uk: Подібні обмеження застосовуються, якщо пул або менеджер створено в основному модулі.

source: Examples
uk: Приклади

source: Demonstration of how to create and use customized managers and proxies:
uk: Демонстрація створення та використання налаштованих менеджерів і проксі-серверів:

source: Using :class:`~multiprocessing.pool.Pool`:
uk: Використання :class:`~multiprocessing.pool.Pool`:

source: An example showing how to use queues to feed tasks to a collection of worker processes and collect the results:
uk: Приклад, який показує, як використовувати черги для передачі завдань у колекцію робочих процесів і збору результатів:
