Repository: python/python-docs-uk
Catalog: library/netrc.po
Languages: uk

source: **Source code:** :source:`Lib/netrc.py`
uk: **Вихідний код:** :source:`Lib/netrc.py`

source: The :class:`~netrc.netrc` class parses and encapsulates the netrc file format used by the Unix :program:`ftp` program and other FTP clients.
uk: Клас :class:`~netrc.netrc` аналізує та інкапсулює формат файлу netrc, який використовується програмою Unix :program:`ftp` та іншими клієнтами FTP.

source: A :class:`~netrc.netrc` instance or subclass instance encapsulates data from a netrc file. The initialization argument, if present, specifies the file to parse. If no argument is given, the file :file:`.netrc` in the user's home directory -- as determined by :func:`os.path.expanduser` -- will be read. Otherwise, a :exc:`FileNotFoundError` exception will be raised. Parse errors will raise :exc:`NetrcParseError` with diagnostic information including the file name, line number, and terminating token. If no argument is specified on a POSIX system, the presence of passwords in the :file:`.netrc` file will raise a :exc:`NetrcParseError` if the file ownership or permissions are insecure (owned by a user other than the user running the process, or accessible for read or write by any other user). This implements security behavior equivalent to that of ftp and other programs that use :file:`.netrc`.
uk: Екземпляр або підклас :class:`~netrc.netrc` інкапсулює дані з файлу netrc. Аргумент ініціалізації, якщо він присутній, визначає файл для аналізу. Якщо не вказано жодного аргументу, буде прочитано файл :file:`.netrc` у домашньому каталозі користувача, як визначено :func:`os.path.expanduser`. В іншому випадку буде викликано виняток :exc:`FileNotFoundError`. Помилки аналізу викличуть :exc:`NetrcParseError` з діагностичною інформацією, включаючи назву файлу, номер рядка та завершальний маркер. Якщо в системі POSIX не вказано жодного аргументу, наявність паролів у файлі :file:`.netrc` викличе :exc:`NetrcParseError`, якщо право власності на файл або дозволи є незахищеними (належить користувачу, відмінному від користувача запущений процес або доступний для читання чи запису будь-яким іншим користувачем). Це реалізує поведінку безпеки, еквівалентну поведінці ftp та інших програм, які використовують :file:`.netrc`.

source: Added the POSIX permission check.
uk: Додано перевірку дозволів POSIX.

source: :func:`os.path.expanduser` is used to find the location of the :file:`.netrc` file when *file* is not passed as argument.
uk: :func:`os.path.expanduser` використовується для пошуку розташування файлу :file:`.netrc`, якщо *file* не передається як аргумент.

source: netrc Objects
uk: Об'єкти netrc

source: A :class:`~netrc.netrc` instance has the following methods:
uk: Екземпляр :class:`~netrc.netrc` має такі методи:

source: Return a 3-tuple ``(login, account, password)`` of authenticators for *host*. If the netrc file did not contain an entry for the given host, return the tuple associated with the 'default' entry. If neither matching host nor default entry is available, return ``None``.
uk: Повертає 3-кортеж ``(логін, обліковий запис, пароль)`` автентифікаторів для *host*. Якщо файл netrc не містить запису для даного хоста, поверніть кортеж, пов’язаний із записом "default". Якщо ні відповідний хост, ні запис за замовчуванням недоступні, поверніть ``None``.

source: Dump the class data as a string in the format of a netrc file. (This discards comments and may reorder the entries.)
uk: Дамп даних класу як рядок у форматі файлу netrc. (Це відхиляє коментарі та може змінити порядок записів.)

source: Instances of :class:`~netrc.netrc` have public instance variables:
uk: Екземпляри :class:`~netrc.netrc` мають публічні змінні екземпляра:

source: Dictionary mapping host names to ``(login, account, password)`` tuples. The 'default' entry, if any, is represented as a pseudo-host by that name.
uk: Словник зіставляє імена хостів із кортежами ``(логін, обліковий запис, пароль)``. Запис "за замовчуванням", якщо такий є, представляється як псевдохост під таким іменем.

source: Dictionary mapping macro names to string lists.
uk: Словник зіставляє імена макросів зі списками рядків.
