Repository: python/python-docs-uk
Catalog: library/numbers.po
Languages: uk

source: :mod:`numbers` --- Numeric abstract base classes
uk: :mod:`numbers` --- Числові абстрактні базові класи

source: **Source code:** :source:`Lib/numbers.py`
uk: **Вихідний код:** :source:`Lib/numbers.py`

source: The :mod:`numbers` module (:pep:`3141`) defines a hierarchy of numeric :term:`abstract base classes <abstract base class>` which progressively define more operations. None of the types defined in this module are intended to be instantiated.
uk: Модуль :mod:`numbers` (:pep:`3141`) визначає ієрархію числових :term:`абстрактних базових класів <abstract base class>`, які поступово визначають більше операцій. Жоден із типів, визначених у цьому модулі, не призначений для створення екземплярів.

source: The root of the numeric hierarchy. If you just want to check if an argument *x* is a number, without caring what kind, use ``isinstance(x, Number)``.
uk: Корінь числової ієрархії. Якщо ви просто хочете перевірити, чи є аргумент *x* числом, не звертаючи уваги на те, якого типу, використовуйте ``isinstance(x, Number)``.

source: The numeric tower
uk: Числова вежа

source: Subclasses of this type describe complex numbers and include the operations that work on the built-in :class:`complex` type. These are: conversions to :class:`complex` and :class:`bool`, :attr:`.real`, :attr:`.imag`, ``+``, ``-``, ``*``, ``/``, ``**``, :func:`abs`, :meth:`conjugate`, ``==``, and ``!=``. All except ``-`` and ``!=`` are abstract.
uk: Підкласи цього типу описують комплексні числа та включають операції, які працюють із вбудованим типом :class:`complex`. Це: перетворення на :class:`complex` і :class:`bool`, :attr:`.real`, :attr:`.imag`, ``+``, ``-``, ``* ``, ``/``, ``**``, :func:`abs`, :meth:`conjugate`, ``==`` і ``!=``. Усі, крім ``-`` і ``!=``, є абстрактними.

source: Abstract. Retrieves the real component of this number.
uk: Анотація. Отримує дійсний компонент цього числа.

source: Abstract. Retrieves the imaginary component of this number.
uk: Анотація. Отримує уявний компонент цього числа.

source: Abstract. Returns the complex conjugate. For example, ``(1+3j).conjugate() == (1-3j)``.
uk: Анотація. Повертає комплексне сполучення. Наприклад, ``(1+3j).conjugate() == (1-3j)``.

source: To :class:`Complex`, :class:`Real` adds the operations that work on real numbers.
uk: До :class:`Complex` :class:`Real` додає операції, які працюють над дійсними числами.

source: In short, those are: a conversion to :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>``, and ``>=``.
uk: Якщо коротко, це: перетворення на :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>`` і ``>=``.

source: Real also provides defaults for :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag`, and :meth:`~Complex.conjugate`.
uk: Real також надає значення за замовчуванням для :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag` і :meth:`~Complex.conjugate`.

source: Subtypes :class:`Real` and adds :attr:`~Rational.numerator` and :attr:`~Rational.denominator` properties, which should be in lowest terms. With these, it provides a default for :func:`float`.
uk: Підтипи :class:`Real` і додає властивості :attr:`~Rational.numerator` і :attr:`~Rational.denominator`, які мають бути в найнижчих термінах. З ними він забезпечує типове значення для :func:`float`.

source: Abstract.
uk: Анотація.

source: Subtypes :class:`Rational` and adds a conversion to :class:`int`. Provides defaults for :func:`float`, :attr:`~Rational.numerator`, and :attr:`~Rational.denominator`. Adds abstract methods for :func:`pow` with modulus and bit-string operations: ``<<``, ``>>``, ``&``, ``^``, ``|``, ``~``.
uk: Підтипує :class:`Rational` і додає перетворення до :class:`int`. Надає значення за замовчуванням для :func:`float`, :attr:`~Rational.numerator` і :attr:`~Rational.denominator`. Додає абстрактні методи для :func:`pow` з операціями модуля та бітового рядка: ``<<``, ``>>``, ``&``, ``^``, ``|``, ``~``.

source: Notes for type implementors
uk: Примітки для розробників типу

source: Implementors should be careful to make equal numbers equal and hash them to the same values. This may be subtle if there are two different extensions of the real numbers. For example, :class:`fractions.Fraction` implements :func:`hash` as follows::
uk: Розробники повинні бути обережними, щоб зробити однакові числа рівними та хешувати їх до однакових значень. Це може бути непомітно, якщо є два різних розширення дійсних чисел. Наприклад, :class:`fractions.Fraction` реалізує :func:`hash` наступним чином:

source: Adding More Numeric ABCs
uk: Додавання додаткових числових букв

source: There are, of course, more possible ABCs for numbers, and this would be a poor hierarchy if it precluded the possibility of adding those. You can add ``MyFoo`` between :class:`Complex` and :class:`Real` with::
uk: Звичайно, існує більше можливих азбуки для чисел, і це була б погана ієрархія, якби вона виключала можливість їх додавання. Ви можете додати ``MyFoo`` між :class:`Complex` і :class:`Real` за допомогою::

source: Implementing the arithmetic operations
uk: Реалізація арифметичних дій

source: We want to implement the arithmetic operations so that mixed-mode operations either call an implementation whose author knew about the types of both arguments, or convert both to the nearest built in type and do the operation there. For subtypes of :class:`Integral`, this means that :meth:`__add__` and :meth:`__radd__` should be defined as::
uk: Ми хочемо реалізувати арифметичні операції так, щоб операції змішаного режиму або викликали реалізацію, автор якої знав про типи обох аргументів, або конвертували обидва до найближчого вбудованого типу та виконували операцію там. Для підтипів :class:`Integral` це означає, що :meth:`__add__` і :meth:`__radd__` мають бути визначені як:

source: There are 5 different cases for a mixed-type operation on subclasses of :class:`Complex`. I'll refer to all of the above code that doesn't refer to ``MyIntegral`` and ``OtherTypeIKnowAbout`` as "boilerplate". ``a`` will be an instance of ``A``, which is a subtype of :class:`Complex` (``a : A <: Complex``), and ``b : B <: Complex``. I'll consider ``a + b``:
uk: Є 5 різних випадків для операції змішаного типу над підкласами :class:`Complex`. Я буду називати весь наведений вище код, який не посилається на ``MyIntegral`` і ``OtherTypeIKnowAbout``, як "шаблонний". ``a`` буде екземпляром ``A``, який є підтипом :class:`Complex` (``a : A <: Complex``), і ``b : B <: Complex``. Я розглядаю ``a + b``:

source: If ``A`` defines an :meth:`__add__` which accepts ``b``, all is well.
uk: Якщо ``A`` визначає :meth:`__add__`, який приймає ``b``, все добре.

source: If ``A`` falls back to the boilerplate code, and it were to return a value from :meth:`__add__`, we'd miss the possibility that ``B`` defines a more intelligent :meth:`__radd__`, so the boilerplate should return :const:`NotImplemented` from :meth:`__add__`. (Or ``A`` may not implement :meth:`__add__` at all.)
uk: Якщо ``A`` повернеться до шаблонного коду, і він мав би повернути значення з :meth:`__add__`, ми упустимо можливість того, що ``B`` визначає більш розумний :meth:`__radd__` , тому шаблон має повертати :const:`NotImplemented` з :meth:`__add__`. (Або ``A`` може взагалі не реалізовувати :meth:`__add__`.)

source: Then ``B``'s :meth:`__radd__` gets a chance. If it accepts ``a``, all is well.
uk: Тоді ``B`` :meth:`__radd__` отримує шанс. Якщо він приймає ``a``, все добре.

source: If it falls back to the boilerplate, there are no more possible methods to try, so this is where the default implementation should live.
uk: Якщо він повернеться до шаблону, більше не буде можливих методів, які можна спробувати, тому тут має бути реалізація за замовчуванням.

source: If ``B <: A``, Python tries ``B.__radd__`` before ``A.__add__``. This is ok, because it was implemented with knowledge of ``A``, so it can handle those instances before delegating to :class:`Complex`.
uk: Якщо ``B <: A``, Python намагається ``B.__radd__`` перед ``A.__add__``. Це нормально, тому що його було реалізовано зі знанням ``A``, тому він може обробити ці випадки перед делегуванням :class:`Complex`.

source: If ``A <: Complex`` and ``B <: Real`` without sharing any other knowledge, then the appropriate shared operation is the one involving the built in :class:`complex`, and both :meth:`__radd__` s land there, so ``a+b == b+a``.
uk: Якщо ``A <: Complex`` і ``B <: Real`` без спільного використання будь-яких інших знань, то відповідною спільною операцією є та, що включає вбудований :class:`complex`, і обидві :meth:`__radd__`s земля там, тому ``a+b == b+a``.

source: Because most of the operations on any given type will be very similar, it can be useful to define a helper function which generates the forward and reverse instances of any given operator. For example, :class:`fractions.Fraction` uses::
uk: Оскільки більшість операцій над будь-яким заданим типом будуть дуже схожими, може бути корисним визначити допоміжну функцію, яка генерує прямі та зворотні екземпляри будь-якого даного оператора. Наприклад, :class:`fractions.Fraction` використовує::
