Repository: python/python-docs-uk
Catalog: library/operator.po
Languages: uk

source: **Source code:** :source:`Lib/operator.py`
uk: **Вихідний код:** :source:`Lib/operator.py`

source: The :mod:`operator` module exports a set of efficient functions corresponding to the intrinsic operators of Python. For example, ``operator.add(x, y)`` is equivalent to the expression ``x+y``. Many function names are those used for special methods, without the double underscores. For backward compatibility, many of these have a variant with the double underscores kept. The variants without the double underscores are preferred for clarity.
uk: Модуль :mod:`operator` експортує набір ефективних функцій, що відповідають внутрішнім операторам Python. Наприклад, ``operator.add(x, y)`` еквівалентний виразу ``x+y``. Багато назв функцій використовуються для спеціальних методів без подвійного підкреслення. Для зворотної сумісності багато з них мають варіант із збереженням подвійного підкреслення. Варіанти без подвійного підкреслення є кращими для ясності.

source: The functions fall into categories that perform object comparisons, logical operations, mathematical operations and sequence operations.
uk: Функції поділяються на категорії, які виконують порівняння об’єктів, логічні операції, математичні операції та операції послідовності.

source: The object comparison functions are useful for all objects, and are named after the rich comparison operators they support:
uk: Функції порівняння об’єктів корисні для всіх об’єктів і названі на честь розширених операторів порівняння, які вони підтримують:

source: Perform "rich comparisons" between *a* and *b*. Specifically, ``lt(a, b)`` is equivalent to ``a < b``, ``le(a, b)`` is equivalent to ``a <= b``, ``eq(a, b)`` is equivalent to ``a == b``, ``ne(a, b)`` is equivalent to ``a != b``, ``gt(a, b)`` is equivalent to ``a > b`` and ``ge(a, b)`` is equivalent to ``a >= b``. Note that these functions can return any value, which may or may not be interpretable as a Boolean value. See :ref:`comparisons` for more information about rich comparisons.
uk: Виконайте "багаті порівняння" між *a* і *b*. Зокрема, ``lt(a, b)`` еквівалентно ``a < b``, ``le(a, b)`` is equivalent to ``a <= b``, ``eq(a, b)`` is equivalent to ``a == b``, ``ne(a, b)`` is equivalent to ``a != b``, ``gt(a, b)`` is equivalent to ``a > b``, а ``ge(a, b)`` еквівалентно ``a >= b``. Зауважте, що ці функції можуть повертати будь-яке значення, яке може інтерпретуватися як логічне значення. Перегляньте :ref:`comparisons` для отримання додаткової інформації про розширені порівняння.

source: The logical operations are also generally applicable to all objects, and support truth tests, identity tests, and boolean operations:
uk: Логічні операції також зазвичай застосовуються до всіх об’єктів і підтримують тести істинності, перевірки ідентичності та логічні операції:

source: Return :const:`True` if *obj* is true, and :const:`False` otherwise. This is equivalent to using the :class:`bool` constructor.
uk: Повертає :const:`True`, якщо *obj* має значення true, і :const:`False` в іншому випадку. Це еквівалентно використанню конструктора :class:`bool`.

source: Return ``a is b``. Tests object identity.
uk: Повернути ``a is b``. Перевіряє ідентичність об'єкта.

source: Return ``a is not b``. Tests object identity.
uk: Повернути ``a не є b``. Перевіряє ідентичність об'єкта.

source: The mathematical and bitwise operations are the most numerous:
uk: Найбільш численні математичні та порозрядні операції:

source: Return the absolute value of *obj*.
uk: Повертає абсолютне значення *obj*.

source: Return ``a + b``, for *a* and *b* numbers.
uk: Повертає ``a + b`` для чисел *a* і *b*.

source: Return the bitwise and of *a* and *b*.
uk: Повертає побітове і для *a* і *b*.

source: Return ``a // b``.
uk: Повернути ``a // b``.

source: Return *a* converted to an integer. Equivalent to ``a.__index__()``.
uk: Повернути *a*, перетворене на ціле число. Еквівалент ``a.__index__()``.

source: The result always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``.
uk: Результат завжди має точний тип :class:`int`. Раніше результат міг бути екземпляром підкласу ``int``.

source: Return the bitwise inverse of the number *obj*. This is equivalent to ``~obj``.
uk: Повертає побітове обернення числа *obj*. Це еквівалентно ``~obj``.

source: Return *a* shifted left by *b*.
uk: Повернути *a* зі зсувом вліво на *b*.

source: Return ``a % b``.
uk: Повернути ``a % b``.

source: Return ``a * b``, for *a* and *b* numbers.
uk: Повертає ``a * b`` для чисел *a* і *b*.

source: Return ``a @ b``.
uk: Повернути ``a @ b``.

source: Return *obj* negated (``-obj``).
uk: Повернути *obj* відхилено (``-obj``).

source: Return the bitwise or of *a* and *b*.
uk: Повертає побітове або *a* і *b*.

source: Return *obj* positive (``+obj``).
uk: Повертає *obj* позитивний (``+obj``).

source: Return ``a ** b``, for *a* and *b* numbers.
uk: Повертає ``a ** b`` для чисел *a* і *b*.

source: Return *a* shifted right by *b*.
uk: Повернути *a* зі зсувом вправо на *b*.

source: Return ``a - b``.
uk: Повернути ``a - b``.

source: Return ``a / b`` where 2/3 is .66 rather than 0. This is also known as "true" division.
uk: Повертає ``a / b``, де 2/3 дорівнює 0,66, а не 0. Це також відоме як "справжнє" ділення.

source: Return the bitwise exclusive or of *a* and *b*.
uk: Повертає порозрядне виключне або *a* і *b*.

source: Operations which work with sequences (some of them with mappings too) include:
uk: Операції, які працюють із послідовностями (деякі з них також із відображеннями), включають:

source: Return ``a + b`` for *a* and *b* sequences.
uk: Повертає ``a + b`` для послідовностей *a* і *b*.

source: Return the outcome of the test ``b in a``. Note the reversed operands.
uk: Повертає результат тесту ``b в a``. Зверніть увагу на зворотні операнди.

source: Return the number of occurrences of *b* in *a*.
uk: Повертає кількість входжень *b* у *a*.

source: Remove the value of *a* at index *b*.
uk: Видалити значення *a* в індексі *b*.

source: Return the value of *a* at index *b*.
uk: Повертає значення *a* за індексом *b*.

source: Return the index of the first of occurrence of *b* in *a*.
uk: Повертає індекс першого входження *b* в *a*.

source: Set the value of *a* at index *b* to *c*.
uk: Установіть значення *a* в індексі *b* на *c*.

source: The :mod:`operator` module also defines tools for generalized attribute and item lookups. These are useful for making fast field extractors as arguments for :func:`map`, :func:`sorted`, :meth:`itertools.groupby`, or other functions that expect a function argument.
uk: Модуль :mod:`operator` також визначає інструменти для узагальненого пошуку атрибутів і елементів. Вони корисні для створення швидких екстракторів полів як аргументів для :func:`map`, :func:`sorted`, :meth:`itertools.groupby` або інших функцій, які очікують аргумент функції.

source: Return a callable object that fetches *attr* from its operand. If more than one attribute is requested, returns a tuple of attributes. The attribute names can also contain dots. For example:
uk: Повертає викликаний об’єкт, який отримує *attr* зі свого операнда. Якщо запитується більше ніж один атрибут, повертає кортеж атрибутів. Назви атрибутів також можуть містити крапки. Наприклад:

source: After ``f = attrgetter('name')``, the call ``f(b)`` returns ``b.name``.
uk: Після ``f = attrgetter('name')`` виклик ``f(b)`` повертає ``b.name``.

source: After ``f = attrgetter('name', 'date')``, the call ``f(b)`` returns ``(b.name, b.date)``.
uk: Після ``f = attrgetter('name', 'date')`` виклик ``f(b)`` повертає ``(b.name, b.date)``.

source: After ``f = attrgetter('name.first', 'name.last')``, the call ``f(b)`` returns ``(b.name.first, b.name.last)``.
uk: Після ``f = attrgetter('name.first', 'name.last')`` виклик ``f(b)`` повертає ``(b.name.first, b.name.last)`` .

source: Equivalent to::
uk: Дорівнює::

source: After ``f = itemgetter(2)``, the call ``f(r)`` returns ``r[2]``.
uk: Після ``f = itemgetter(2)`` виклик ``f(r)`` повертає ``r[2]``.

source: After ``g = itemgetter(2, 5, 3)``, the call ``g(r)`` returns ``(r[2], r[5], r[3])``.
uk: Після ``g = itemgetter(2, 5, 3)`` виклик ``g(r)`` повертає ``(r[2], r[5], r[3])``.

source: Example of using :func:`itemgetter` to retrieve specific fields from a tuple record:
uk: Приклад використання :func:`itemgetter` для отримання певних полів із запису кортежу:

source: Return a callable object that calls the method *name* on its operand. If additional arguments and/or keyword arguments are given, they will be given to the method as well. For example:
uk: Повертає викликаний об’єкт, який викликає метод *ім’я* свого операнда. Якщо надано додаткові аргументи та/або ключові аргументи, вони також будуть надані методу. Наприклад:

source: After ``f = methodcaller('name')``, the call ``f(b)`` returns ``b.name()``.
uk: Після ``f = methodcaller('name')`` виклик ``f(b)`` повертає ``b.name()``.

source: After ``f = methodcaller('name', 'foo', bar=1)``, the call ``f(b)`` returns ``b.name('foo', bar=1)``.
uk: Після ``f = methodcaller('name', 'foo', bar=1)`` виклик ``f(b)`` повертає ``b.name('foo', bar=1)``.

source: Mapping Operators to Functions
uk: Відображення операторів у функції

source: This table shows how abstract operations correspond to operator symbols in the Python syntax and the functions in the :mod:`operator` module.
uk: У цій таблиці показано, як абстрактні операції відповідають символам операторів у синтаксисі Python і функціям у модулі :mod:`operator`.

source: Operation
uk: Операція

source: Syntax
uk: Синтаксис

source: Function
uk: функція

source: Addition
uk: Доповнення

source: Concatenation
uk: Конкатенація

source: Containment Test
uk: Тест на утримання

source: Division
uk: Поділ

source: Bitwise And
uk: Порозрядне І

source: ``a & b``
uk: ``а і б``

source: ``and_(a, b)``
uk: ``і_(a, b)``

source: Bitwise Exclusive Or
uk: Порозрядне виняткове або

source: Bitwise Inversion
uk: Побітова інверсія

source: Bitwise Or
uk: Побітове або

source: ``or_(a, b)``
uk: ``або_(a, b)``

source: Exponentiation
uk: Піднесення до степеня

source: Identity
uk: Ідентичність

source: ``a is b``
uk: ``a є b``

source: ``a is not b``
uk: ``a не є b``

source: Indexed Assignment
uk: Індексоване призначення

source: Indexed Deletion
uk: Індексоване видалення

source: ``delitem(obj, k)``
uk: ``виділення(obj, k)``

source: Indexing
uk: Індексація

source: Left Shift
uk: Ліворуч

source: Modulo
uk: Модуло

source: Multiplication
uk: Множення

source: Matrix Multiplication
uk: Множення матриць

source: Negation (Arithmetic)
uk: Заперечення (арифметика)

source: Negation (Logical)
uk: Заперечення (логічне)

source: ``not a``
uk: ``не``

source: Positive
uk: Позитивний

source: Right Shift
uk: Правий Shift

source: Slice Assignment
uk: Призначення фрагмента

source: ``seq[i:j] = values``
uk: ``seq[i:j] = значення``

source: Slice Deletion
uk: Видалення фрагмента

source: Slicing
uk: Нарізка

source: String Formatting
uk: Форматування рядка

source: Subtraction
uk: Віднімання

source: ``a - b``
uk: ``а - б``

source: ``sub(a, b)``
uk: ``під(a, b)``

source: Truth Test
uk: Тест на правду

source: Ordering
uk: Замовлення

source: Equality
uk: Рівність

source: Difference
uk: Різниця

source: In-place Operators
uk: Оператори на місці

source: Many operations have an "in-place" version. Listed below are functions providing a more primitive access to in-place operators than the usual syntax does; for example, the :term:`statement` ``x += y`` is equivalent to ``x = operator.iadd(x, y)``. Another way to put it is to say that ``z = operator.iadd(x, y)`` is equivalent to the compound statement ``z = x; z += y``.
uk: Багато операцій мають версію "на місці". Нижче наведено функції, які забезпечують примітивніший доступ до операторів на місці, ніж звичайний синтаксис; наприклад, раз (:term:`statement`) ``x += y`` еквівалентний ``x = operator.iadd(x, y)``. Інший спосіб сказати, що ``z = operator.iadd(x, y)`` еквівалентно складеному оператору ``z = x; z += y``.

source: In those examples, note that when an in-place method is called, the computation and assignment are performed in two separate steps. The in-place functions listed below only do the first step, calling the in-place method. The second step, assignment, is not handled.
uk: У цих прикладах зауважте, що під час виклику методу на місці обчислення та призначення виконуються у два окремі кроки. Перелічені нижче функції на місці виконують лише перший крок, викликаючи метод на місці. Другий крок, призначення, не обробляється.

source: For immutable targets such as strings, numbers, and tuples, the updated value is computed, but not assigned back to the input variable:
uk: Для незмінних цілей, таких як рядки, числа та кортежі, оновлене значення обчислюється, але не призначається назад вхідній змінній:

source: For mutable targets such as lists and dictionaries, the in-place method will perform the update, so no subsequent assignment is necessary:
uk: Для змінних цілей, таких як списки та словники, метод на місці виконає оновлення, тому подальше призначення не потрібне:

source: ``a = iadd(a, b)`` is equivalent to ``a += b``.
uk: ``a = iadd(a, b)`` еквівалентно ``a += b``.

source: ``a = iand(a, b)`` is equivalent to ``a &= b``.
uk: ``a = iand(a, b)`` еквівалентно ``a &= b``.

source: ``a = iconcat(a, b)`` is equivalent to ``a += b`` for *a* and *b* sequences.
uk: ``a = iconcat(a, b)`` еквівалентно ``a += b`` для послідовностей *a* і *b*.

source: ``a = ifloordiv(a, b)`` is equivalent to ``a //= b``.
uk: ``a = ifloordiv(a, b)`` еквівалентно ``a //= b``.

source: ``a = ilshift(a, b)`` is equivalent to ``a <<= b``.
uk: ``a = ilshift(a, b)`` еквівалентно ``a <<= b``.

source: ``a = imod(a, b)`` is equivalent to ``a %= b``.
uk: ``a = imod(a, b)`` еквівалентно ``a %= b``.

source: ``a = imul(a, b)`` is equivalent to ``a *= b``.
uk: ``a = imul(a, b)`` еквівалентно ``a *= b``.

source: ``a = imatmul(a, b)`` is equivalent to ``a @= b``.
uk: ``a = imatmul(a, b)`` еквівалентно ``a @= b``.

source: ``a = ior(a, b)`` is equivalent to ``a |= b``.
uk: ``a = ior(a, b)`` еквівалентно ``a |= b``.

source: ``a = ipow(a, b)`` is equivalent to ``a **= b``.
uk: ``a = ipow(a, b)`` еквівалентно ``a **= b``.

source: ``a = irshift(a, b)`` is equivalent to ``a >>= b``.
uk: ``a = irshift(a, b)`` еквівалентно ``a >>= b``.

source: ``a = isub(a, b)`` is equivalent to ``a -= b``.
uk: ``a = isub(a, b)`` еквівалентно ``a -= b``.

source: ``a = itruediv(a, b)`` is equivalent to ``a /= b``.
uk: ``a = itruediv(a, b)`` еквівалентно ``a /= b``.

source: ``a = ixor(a, b)`` is equivalent to ``a ^= b``.
uk: ``a = ixor(a, b)`` еквівалентно ``a ^= b``.
