Repository: python/python-docs-uk
Catalog: library/optparse.po
Languages: uk

source: Default values
uk: Значення за замовчуванням

source: All of the above examples involve setting some variable (the "destination") when certain command-line options are seen. What happens if those options are never seen? Since we didn't supply any defaults, they are all set to ``None``. This is usually fine, but sometimes you want more control. :mod:`optparse` lets you supply a default value for each destination, which is assigned before the command line is parsed.
uk: Усі наведені вище приклади включають встановлення деякої змінної ("призначення"), коли відображаються певні параметри командного рядка. Що трапиться, якщо ці варіанти ніколи не побачать? Оскільки ми не вказали жодних значень за замовчуванням, для всіх встановлено значення ``None``. Зазвичай це добре, але іноді потрібно більше контролю. :mod:`optparse` дозволяє вказати значення за умовчанням для кожного пункту призначення, яке призначається перед аналізом командного рядка.

source: First, consider the verbose/quiet example. If we want :mod:`optparse` to set ``verbose`` to ``True`` unless ``-q`` is seen, then we can do this::
uk: Спочатку розглянемо багатослівний/тихий приклад. Якщо ми хочемо, щоб :mod:`optparse` встановив для ``verbose`` значення ``True``, якщо не видно ``-q``, ми можемо зробити це:

source: Since default values apply to the *destination* rather than to any particular option, and these two options happen to have the same destination, this is exactly equivalent::
uk: Оскільки значення за замовчуванням застосовуються до *призначення*, а не до будь-якого конкретного параметра, і ці два параметри мають одне призначення, це точно еквівалентно::

source: Consider this::
uk: Розглянемо це::

source: Again, the default value for ``verbose`` will be ``True``: the last default value supplied for any particular destination is the one that counts.
uk: Знову ж таки, значенням за замовчуванням для ``verbose`` буде ``True``: останнє значення за замовчуванням, надане для будь-якого конкретного призначення, є тим, яке враховується.

source: As before, the last value specified for a given option destination is the one that counts. For clarity, try to use one method or the other of setting default values, not both.
uk: Як і раніше, зараховується останнє значення, указане для даного призначення опції. Для ясності спробуйте використовувати один або інший метод встановлення значень за замовчуванням, а не обидва.

source: Generating help
uk: Створення довідки

source: :mod:`optparse`'s ability to generate help and usage text automatically is useful for creating user-friendly command-line interfaces. All you have to do is supply a :attr:`~Option.help` value for each option, and optionally a short usage message for your whole program. Here's an OptionParser populated with user-friendly (documented) options::
uk: Здатність :mod:`optparse` автоматично генерувати текст довідки та використання корисна для створення зручних інтерфейсів командного рядка. Все, що вам потрібно зробити, це вказати значення :attr:`~Option.help` для кожного параметра та, за бажанням, коротке повідомлення про використання для всієї програми. Ось OptionParser, заповнений зручними (задокументованими) параметрами::

source: If :mod:`optparse` encounters either ``-h`` or ``--help`` on the command-line, or if you just call :meth:`parser.print_help`, it prints the following to standard output:
uk: Якщо :mod:`optparse` зустрічає ``-h`` або ``--help`` у командному рядку, або якщо ви просто викликаєте :meth:`parser.print_help`, він виводить наступне у стандартний вивід :

source: (If the help output is triggered by a help option, :mod:`optparse` exits after printing the help text.)
uk: (Якщо вихід довідки ініціюється опцією довідки, :mod:`optparse` завершує роботу після друку тексту довідки.)

source: There's a lot going on here to help :mod:`optparse` generate the best possible help message:
uk: Тут багато чого робиться, щоб допомогти :mod:`optparse` створити найкраще довідкове повідомлення:

source: the script defines its own usage message::
uk: сценарій визначає власне повідомлення про використання::

source: :mod:`optparse` expands ``%prog`` in the usage string to the name of the current program, i.e. ``os.path.basename(sys.argv[0])``. The expanded string is then printed before the detailed option help.
uk: :mod:`optparse` розширює ``%prog`` у рядку використання до назви поточної програми, тобто ``os.path.basename(sys.argv[0])``. Потім розгорнутий рядок друкується перед детальною довідкою параметрів.

source: If you don't supply a usage string, :mod:`optparse` uses a bland but sensible default: ``"Usage: %prog [options]"``, which is fine if your script doesn't take any positional arguments.
uk: Якщо ви не вказали рядок використання, :mod:`optparse` використовує м’яке, але розумне значення за умовчанням: ``"Використання: %prog [параметри]"``, що добре, якщо ваш сценарій не приймає жодних позиційних аргументів.

source: every option defines a help string, and doesn't worry about line-wrapping---\ :mod:`optparse` takes care of wrapping lines and making the help output look good.
uk: кожен параметр визначає довідковий рядок і не турбується про перенесення рядків---\ :mod:`optparse` піклується про обтікання рядків і робить вихід довідки гарним.

source: This is important for more than just saving space, though: the manually written help text uses the meta-variable ``FILE`` to clue the user in that there's a connection between the semi-formal syntax ``-f FILE`` and the informal semantic description "write output to FILE". This is a simple but effective way to make your help text a lot clearer and more useful for end users.
uk: Однак це важливо не тільки для економії місця: написаний вручну текст довідки використовує мета-змінну ``FILE``, щоб зрозуміти користувачеві, що існує зв’язок між напівформальним синтаксисом ``-f FILE`` і неформальний семантичний опис "записати вихід у ФАЙЛ". Це простий, але ефективний спосіб зробити ваш текст довідки набагато зрозумілішим і кориснішим для кінцевих користувачів.

source: options that have a default value can include ``%default`` in the help string---\ :mod:`optparse` will replace it with :func:`str` of the option's default value. If an option has no default value (or the default value is ``None``), ``%default`` expands to ``none``.
uk: параметри, які мають значення за замовчуванням, можуть містити ``%default`` у рядку довідки ---\ :mod:`optparse` замінить його на :func:`str` значення параметра за замовчуванням. Якщо параметр не має значення за замовчуванням (або стандартним значенням є ``None``), ``%default`` розширюється до ``none``.

source: Grouping Options
uk: Параметри групування

source: When dealing with many options, it is convenient to group these options for better help output. An :class:`OptionParser` can contain several option groups, each of which can contain several options.
uk: Коли ви маєте справу з багатьма параметрами, зручно згрупувати ці параметри для кращого виведення довідки. :class:`OptionParser` може містити кілька груп опцій, кожна з яких може містити кілька опцій.

source: An option group is obtained using the class :class:`OptionGroup`:
uk: Група опцій отримується за допомогою класу :class:`OptionGroup`:

source: where
uk: де

source: parser is the :class:`OptionParser` instance the group will be inserted in to
uk: parser — це екземпляр :class:`OptionParser`, до якого буде вставлено групу

source: title is the group title
uk: title — назва групи

source: description, optional, is a long description of the group
uk: description, необов'язковий, це довгий опис групи

source: :class:`OptionGroup` inherits from :class:`OptionContainer` (like :class:`OptionParser`) and so the :meth:`add_option` method can be used to add an option to the group.
uk: :class:`OptionGroup` успадковує :class:`OptionContainer` (наприклад, :class:`OptionParser`), тому метод :meth:`add_option` можна використовувати для додавання опції до групи.

source: Once all the options are declared, using the :class:`OptionParser` method :meth:`add_option_group` the group is added to the previously defined parser.
uk: Після оголошення всіх опцій за допомогою методу :class:`OptionParser` :meth:`add_option_group` група додається до попередньо визначеного аналізатора.

source: Continuing with the parser defined in the previous section, adding an :class:`OptionGroup` to a parser is easy::
uk: Продовжуючи роботу з аналізатором, визначеним у попередньому розділі, додати :class:`OptionGroup` до аналізатора легко:

source: This would result in the following help output:
uk: Це призведе до наступного результату довідки:

source: A bit more complete example might involve using more than one group: still extending the previous example::
uk: Трохи повніший приклад може включати використання кількох груп: все ще розширюючи попередній приклад::

source: that results in the following output:
uk: що призводить до наступного результату:

source: Another interesting method, in particular when working programmatically with option groups is:
uk: Ще один цікавий метод, зокрема під час програмної роботи з групами параметрів:

source: Return the :class:`OptionGroup` to which the short or long option string *opt_str* (e.g. ``'-o'`` or ``'--option'``) belongs. If there's no such :class:`OptionGroup`, return ``None``.
uk: Повертає :class:`OptionGroup`, до якої належить короткий або довгий рядок параметрів *opt_str* (наприклад, ``'-o'`` або ``'--option'``). Якщо такої :class:`OptionGroup` немає, поверніть ``None``.

source: Printing a version string
uk: Друк рядка версії

source: Similar to the brief usage string, :mod:`optparse` can also print a version string for your program. You have to supply the string as the ``version`` argument to OptionParser::
uk: Подібно до короткого рядка використання, :mod:`optparse` також може надрукувати рядок версії вашої програми. Ви повинні надати рядок як аргумент ``version`` для OptionParser::

source: ``%prog`` is expanded just like it is in ``usage``. Apart from that, ``version`` can contain anything you like. When you supply it, :mod:`optparse` automatically adds a ``--version`` option to your parser. If it encounters this option on the command line, it expands your ``version`` string (by replacing ``%prog``), prints it to stdout, and exits.
uk: ``%prog`` розгортається так само, як і в ``usage``. Окрім цього, ``версія`` може містити все, що завгодно. Коли ви вказуєте його, :mod:`optparse` автоматично додає опцію ``--version`` до вашого аналізатора. Якщо він зустрічає цей параметр у командному рядку, він розгортає ваш рядок ``version`` (шляхом заміни ``%prog``), друкує його в stdout і завершує роботу.

source: For example, if your script is called ``/usr/bin/foo``:
uk: Наприклад, якщо ваш скрипт називається ``/usr/bin/foo``:

source: The following two methods can be used to print and get the ``version`` string:
uk: Наступні два методи можна використати для друку та отримання рядка ``version``:

source: Print the version message for the current program (``self.version``) to *file* (default stdout). As with :meth:`print_usage`, any occurrence of ``%prog`` in ``self.version`` is replaced with the name of the current program. Does nothing if ``self.version`` is empty or undefined.
uk: Вивести повідомлення про версію для поточної програми (``self.version``) у *файл* (стандартний вивід за замовчуванням). Як і у випадку з :meth:`print_usage`, будь-яке входження ``%prog`` у ``self.version`` замінюється назвою поточної програми. Нічого не робить, якщо ``self.version`` порожній або невизначений.

source: Same as :meth:`print_version` but returns the version string instead of printing it.
uk: Те саме, що :meth:`print_version`, але повертає рядок версії замість її друку.

source: How :mod:`optparse` handles errors
uk: Як :mod:`optparse` обробляє помилки

source: There are two broad classes of errors that :mod:`optparse` has to worry about: programmer errors and user errors. Programmer errors are usually erroneous calls to :func:`OptionParser.add_option`, e.g. invalid option strings, unknown option attributes, missing option attributes, etc. These are dealt with in the usual way: raise an exception (either :exc:`optparse.OptionError` or :exc:`TypeError`) and let the program crash.
uk: Є два широких класи помилок, про які :mod:`optparse` має турбуватися: помилки програміста та помилки користувача. Помилки програміста зазвичай є помилковими викликами :func:`OptionParser.add_option`, напр. недійсні рядки опцій, невідомі атрибути опцій, відсутні атрибути опцій тощо. З цими справляються звичайним способом: викликають виняток (або :exc:`optparse.OptionError` або :exc:`TypeError`) і дозволяють програмі аварійно завершувати роботу.

source: Handling user errors is much more important, since they are guaranteed to happen no matter how stable your code is. :mod:`optparse` can automatically detect some user errors, such as bad option arguments (passing ``-n 4x`` where ``-n`` takes an integer argument), missing arguments (``-n`` at the end of the command line, where ``-n`` takes an argument of any type). Also, you can call :func:`OptionParser.error` to signal an application-defined error condition::
uk: Обробка помилок користувача є набагато важливішою, оскільки вони гарантовано траплятимуться незалежно від того, наскільки стабільним є ваш код. :mod:`optparse` може автоматично виявляти деякі помилки користувача, такі як неправильні аргументи параметрів (передача ``-n 4x``, де ``-n`` приймає цілочисельний аргумент), відсутні аргументи (``-n`` у кінець командного рядка, де ``-n`` приймає аргумент будь-якого типу). Крім того, ви можете викликати :func:`OptionParser.error`, щоб повідомити про помилку, визначену програмою:

source: In either case, :mod:`optparse` handles the error the same way: it prints the program's usage message and an error message to standard error and exits with error status 2.
uk: У будь-якому випадку :mod:`optparse` обробляє помилку однаково: він друкує повідомлення про використання програми та повідомлення про помилку до стандартної помилки та виходить зі статусом помилки 2.

source: Consider the first example above, where the user passes ``4x`` to an option that takes an integer:
uk: Розглянемо перший приклад вище, де користувач передає ``4x`` опції, яка приймає ціле число:

source: Or, where the user fails to pass a value at all:
uk: Або, коли користувач взагалі не може передати значення:

source: :mod:`optparse`\ -generated error messages take care always to mention the option involved in the error; be sure to do the same when calling :func:`OptionParser.error` from your application code.
uk: :mod:`optparse`\ -згенеровані повідомлення про помилку завжди вказують опцію, пов’язану з помилкою; обов’язково зробіть те саме під час виклику :func:`OptionParser.error` із коду програми.

source: If :mod:`optparse`'s default error-handling behaviour does not suit your needs, you'll need to subclass OptionParser and override its :meth:`~OptionParser.exit` and/or :meth:`~OptionParser.error` methods.
uk: Якщо стандартна поведінка обробки помилок :mod:`optparse` не відповідає вашим потребам, вам потрібно створити підклас OptionParser і перевизначити його :meth:`~OptionParser.exit` та/або :meth:`~OptionParser.error` методи.

source: Putting it all together
uk: Зібравши все разом

source: Here's what :mod:`optparse`\ -based scripts usually look like::
uk: Ось як зазвичай виглядають сценарії на основі :mod:`optparse`\:

source: Reference Guide
uk: Довідковий посібник

source: Creating the parser
uk: Створення аналізатора

source: The first step in using :mod:`optparse` is to create an OptionParser instance.
uk: Першим кроком у використанні :mod:`optparse` є створення екземпляра OptionParser.

source: The OptionParser constructor has no required arguments, but a number of optional keyword arguments. You should always pass them as keyword arguments, i.e. do not rely on the order in which the arguments are declared.
uk: Конструктор OptionParser не має обов’язкових аргументів, але має декілька необов’язкових ключових аргументів. Ви завжди повинні передавати їх як аргументи ключового слова, тобто не покладайтеся на порядок, у якому оголошено аргументи.

source: ``usage`` (default: ``"%prog [options]"``)
uk: ``використання`` (за замовчуванням: ``"%prog [параметри]"``)

source: ``option_list`` (default: ``[]``)
uk: ``option_list`` (за замовчуванням: ``[]``)

source: A list of Option objects to populate the parser with. The options in ``option_list`` are added after any options in ``standard_option_list`` (a class attribute that may be set by OptionParser subclasses), but before any version or help options. Deprecated; use :meth:`add_option` after creating the parser instead.
uk: Список об’єктів Option для заповнення аналізатора. Опції в ``option_list`` додаються після будь-яких опцій в ``standard_option_list`` (атрибут класу, який може бути встановлений підкласами OptionParser), але перед будь-якою версією або опціями довідки. Застаріле; замість цього використовуйте :meth:`add_option` після створення аналізатора.

source: ``option_class`` (default: optparse.Option)
uk: ``option_class`` (за замовчуванням: optparse.Option)

source: Class to use when adding options to the parser in :meth:`add_option`.
uk: Клас для використання під час додавання параметрів до аналізатора в :meth:`add_option`.

source: ``version`` (default: ``None``)
uk: ``version`` (за замовчуванням: ``None``)

source: A version string to print when the user supplies a version option. If you supply a true value for ``version``, :mod:`optparse` automatically adds a version option with the single option string ``--version``. The substring ``%prog`` is expanded the same as for ``usage``.
uk: Рядок версії для друку, коли користувач вказує параметр версії. Якщо ви вказуєте справжнє значення для ``version``, :mod:`optparse` автоматично додає опцію версії з єдиним рядком опції ``--version``. Підрядок ``%prog`` розгортається так само, як і ``usage``.

source: ``conflict_handler`` (default: ``"error"``)
uk: ``conflict_handler`` (за замовчуванням: ``"помилка"``)

source: Specifies what to do when options with conflicting option strings are added to the parser; see section :ref:`optparse-conflicts-between-options`.
uk: Вказує, що робити, коли параметри з конфліктуючими рядками параметрів додаються до аналізатора; див. розділ :ref:`optparse-conflicts-between-options`.

source: ``description`` (default: ``None``)
uk: ``опис`` (за замовчуванням: ``None``)

source: A paragraph of text giving a brief overview of your program. :mod:`optparse` reformats this paragraph to fit the current terminal width and prints it when the user requests help (after ``usage``, but before the list of options).
uk: Абзац тексту, що дає короткий огляд вашої програми. :mod:`optparse` переформатує цей абзац відповідно до поточної ширини терміналу та друкує його, коли користувач запитує допомогу (після ``використання``, але перед списком параметрів).

source: ``formatter`` (default: a new :class:`IndentedHelpFormatter`)
uk: ``formatter`` (за замовчуванням: новий :class:`IndentedHelpFormatter`)

source: An instance of optparse.HelpFormatter that will be used for printing help text. :mod:`optparse` provides two concrete classes for this purpose: IndentedHelpFormatter and TitledHelpFormatter.
uk: Екземпляр optparse.HelpFormatter, який використовуватиметься для друку тексту довідки. :mod:`optparse` надає два конкретних класи для цієї мети: IndentedHelpFormatter і TitledHelpFormatter.

source: ``add_help_option`` (default: ``True``)
uk: ``add_help_option`` (за замовчуванням: ``True``)

source: If true, :mod:`optparse` will add a help option (with option strings ``-h`` and ``--help``) to the parser.
uk: Якщо істина, :mod:`optparse` додасть параметр довідки (із рядками параметрів ``-h`` і ``--help``) до аналізатора.

source: ``prog``
uk: ``програма``

source: The string to use when expanding ``%prog`` in ``usage`` and ``version`` instead of ``os.path.basename(sys.argv[0])``.
uk: Рядок для використання під час розширення ``%prog`` у ``usage`` і ``version`` замість ``os.path.basename(sys.argv[0])``.

source: ``epilog`` (default: ``None``)
uk: ``епілог`` (за замовчуванням: ``None``)

source: A paragraph of help text to print after the option help.
uk: Абзац тексту довідки для друку після довідки параметра.

source: Populating the parser
uk: Заповнення аналізатора

source: There are several ways to populate the parser with options. The preferred way is by using :meth:`OptionParser.add_option`, as shown in section :ref:`optparse-tutorial`. :meth:`add_option` can be called in one of two ways:
uk: Є кілька способів заповнити аналізатор параметрами. Кращим способом є використання :meth:`OptionParser.add_option`, як показано в розділі :ref:`optparse-tutorial`. :meth:`add_option` можна викликати одним із двох способів:

source: pass it an Option instance (as returned by :func:`make_option`)
uk: передати йому екземпляр Option (як повертає :func:`make_option`)

source: pass it any combination of positional and keyword arguments that are acceptable to :func:`make_option` (i.e., to the Option constructor), and it will create the Option instance for you
uk: передайте йому будь-яку комбінацію позиційних і ключових аргументів, які прийнятні для :func:`make_option` (тобто для конструктора Option), і він створить екземпляр Option для вас

source: The other alternative is to pass a list of pre-constructed Option instances to the OptionParser constructor, as in::
uk: Іншою альтернативою є передача списку попередньо сконструйованих екземплярів Option конструктору OptionParser, як у::

source: (:func:`make_option` is a factory function for creating Option instances; currently it is an alias for the Option constructor. A future version of :mod:`optparse` may split Option into several classes, and :func:`make_option` will pick the right class to instantiate. Do not instantiate Option directly.)
uk: (:func:`make_option` є фабричною функцією для створення екземплярів Option; наразі це псевдонім для конструктора Option. Майбутня версія :mod:`optparse` може розділити Option на кілька класів і :func:`make_option` вибере правильний клас для створення екземпляра. Не створюйте екземпляр Option безпосередньо.)

source: Defining options
uk: Визначення варіантів

source: Each Option instance represents a set of synonymous command-line option strings, e.g. ``-f`` and ``--file``. You can specify any number of short or long option strings, but you must specify at least one overall option string.
uk: Кожен екземпляр Option представляє набір синонімічних рядків параметрів командного рядка, напр. ``-f`` і ``--file``. Ви можете вказати будь-яку кількість коротких або довгих рядків параметрів, але ви повинні вказати принаймні один загальний рядок параметрів.

source: The canonical way to create an :class:`Option` instance is with the :meth:`add_option` method of :class:`OptionParser`.
uk: Канонічним способом створення екземпляра :class:`Option` є метод :meth:`add_option` :class:`OptionParser`.

source: To define an option with only a short option string::
uk: Щоб визначити опцію лише за допомогою короткого рядка опції:

source: And to define an option with only a long option string::
uk: І щоб визначити опцію лише з довгим рядком опції::
