Repository: python/python-docs-uk
Catalog: library/optparse.po
Languages: uk

source: If the :class:`OptionParser` has an option corresponding to *opt_str*, that option is removed. If that option provided any other option strings, all of those option strings become invalid. If *opt_str* does not occur in any option belonging to this :class:`OptionParser`, raises :exc:`ValueError`.
uk: Якщо :class:`OptionParser` має параметр, що відповідає *opt_str*, цей параметр буде видалено. Якщо цей параметр містить будь-які інші рядки параметрів, усі ці рядки параметрів стають недійсними. Якщо *opt_str* не зустрічається в жодному параметрі, що належить цьому :class:`OptionParser`, викликає :exc:`ValueError`.

source: Conflicts between options
uk: Конфлікти між варіантами

source: If you're not careful, it's easy to define options with conflicting option strings::
uk: Якщо ви не будете обережні, можна легко визначити параметри з конфліктуючими рядками параметрів::

source: (This is particularly true if you've defined your own OptionParser subclass with some standard options.)
uk: (Це особливо вірно, якщо ви визначили свій власний підклас OptionParser з деякими стандартними параметрами.)

source: Every time you add an option, :mod:`optparse` checks for conflicts with existing options. If it finds any, it invokes the current conflict-handling mechanism. You can set the conflict-handling mechanism either in the constructor::
uk: Кожного разу, коли ви додаєте опцію, :mod:`optparse` перевіряє наявність конфліктів із існуючими опціями. Якщо він знайде будь-який, він викликає поточний механізм обробки конфліктів. Ви можете встановити механізм обробки конфліктів у конструкторі:

source: or with a separate call::
uk: або окремим дзвінком::

source: The available conflict handlers are:
uk: Доступні засоби обробки конфліктів:

source: ``"error"`` (default)
uk: ``"помилка"`` (за замовчуванням)

source: assume option conflicts are a programming error and raise :exc:`OptionConflictError`
uk: припустити, що конфлікти параметрів є помилкою програмування, і викликати :exc:`OptionConflictError`

source: ``"resolve"``
uk: ``"розв'язати"``

source: resolve option conflicts intelligently (see below)
uk: розумно вирішувати конфлікти варіантів (див. нижче)

source: As an example, let's define an :class:`OptionParser` that resolves conflicts intelligently and add conflicting options to it::
uk: Як приклад, давайте визначимо :class:`OptionParser`, який розумно вирішує конфлікти, і додамо до нього конфліктуючі параметри::

source: At this point, the original ``-n``/``--dry-run`` option is no longer accessible, so :mod:`optparse` removes it, leaving this help text::
uk: На цьому етапі вихідний параметр ``-n``/``--dry-run`` більше не доступний, тому :mod:`optparse` видаляє його, залишаючи цей текст довідки::

source: Cleanup
uk: Прибирати

source: OptionParser instances have several cyclic references. This should not be a problem for Python's garbage collector, but you may wish to break the cyclic references explicitly by calling :meth:`~OptionParser.destroy` on your OptionParser once you are done with it. This is particularly useful in long-running applications where large object graphs are reachable from your OptionParser.
uk: Екземпляри OptionParser мають кілька циклічних посилань. Це не повинно бути проблемою для збирача сміття Python, але ви можете розірвати циклічні посилання явно, викликавши :meth:`~OptionParser.destroy` на вашому OptionParser, коли ви закінчите з цим. Це особливо корисно в довготривалих програмах, де великі об’єктні графіки доступні з вашого OptionParser.

source: Other methods
uk: Інші методи

source: OptionParser supports several other public methods:
uk: OptionParser підтримує кілька інших публічних методів:

source: Print the usage message for the current program (``self.usage``) to *file* (default stdout). Any occurrence of the string ``%prog`` in ``self.usage`` is replaced with the name of the current program. Does nothing if ``self.usage`` is empty or not defined.
uk: Надрукувати повідомлення про використання для поточної програми (``self.usage``) у *файл* (стандартний вихід за замовчуванням). Будь-яке входження рядка ``%prog`` у ``self.usage`` замінюється назвою поточної програми. Нічого не робить, якщо ``self.usage`` порожній або не визначений.

source: Same as :meth:`print_usage` but returns the usage string instead of printing it.
uk: Те саме, що :meth:`print_usage`, але повертає рядок використання замість його друку.

source: Set default values for several option destinations at once. Using :meth:`set_defaults` is the preferred way to set default values for options, since multiple options can share the same destination. For example, if several "mode" options all set the same destination, any one of them can set the default, and the last one wins::
uk: Встановіть значення за замовчуванням для кількох пунктів призначення одночасно. Використання :meth:`set_defaults` є кращим способом встановлення значень за замовчуванням для параметрів, оскільки кілька параметрів можуть мати одне призначення. Наприклад, якщо кілька параметрів "режиму" встановлюють одне й те саме призначення, будь-який із них може встановити значення за замовчуванням, і виграє останній:

source: To avoid this confusion, use :meth:`set_defaults`::
uk: Щоб уникнути цієї плутанини, використовуйте :meth:`set_defaults`::

source: Option Callbacks
uk: Опція зворотних викликів

source: When :mod:`optparse`'s built-in actions and types aren't quite enough for your needs, you have two choices: extend :mod:`optparse` or define a callback option. Extending :mod:`optparse` is more general, but overkill for a lot of simple cases. Quite often a simple callback is all you need.
uk: Якщо вбудованих дій і типів :mod:`optparse` недостатньо для ваших потреб, у вас є два варіанти: розширити :mod:`optparse` або визначити опцію зворотного виклику. Розширення :mod:`optparse` є більш загальним, але надмірним для багатьох простих випадків. Досить часто простий зворотний дзвінок - це все, що вам потрібно.

source: There are two steps to defining a callback option:
uk: Існує два кроки, щоб визначити опцію зворотного виклику:

source: define the option itself using the ``"callback"`` action
uk: визначте саму опцію за допомогою дії ``"callback"``

source: write the callback; this is a function (or method) that takes at least four arguments, as described below
uk: написати зворотний дзвінок; це функція (або метод), яка приймає щонайменше чотири аргументи, як описано нижче

source: Defining a callback option
uk: Визначення опції зворотного виклику

source: As always, the easiest way to define a callback option is by using the :meth:`OptionParser.add_option` method. Apart from :attr:`~Option.action`, the only option attribute you must specify is ``callback``, the function to call::
uk: Як завжди, найпростішим способом визначення опції зворотного виклику є використання методу :meth:`OptionParser.add_option`. Окрім :attr:`~Option.action`, єдиним атрибутом параметра, який ви повинні вказати, є ``callback``, функція для виклику::

source: ``callback`` is a function (or other callable object), so you must have already defined ``my_callback()`` when you create this callback option. In this simple case, :mod:`optparse` doesn't even know if ``-c`` takes any arguments, which usually means that the option takes no arguments---the mere presence of ``-c`` on the command-line is all it needs to know. In some circumstances, though, you might want your callback to consume an arbitrary number of command-line arguments. This is where writing callbacks gets tricky; it's covered later in this section.
uk: ``callback`` є функцією (або іншим викликаним об'єктом), тому ви повинні вже визначати ``my_callback()``, створюючи цю опцію зворотного виклику. У цьому простому випадку :mod:`optparse` навіть не знає, чи ``-c`` приймає будь-які аргументи, що зазвичай означає, що опція не приймає аргументів --- сама наявність ``-c`` на командний рядок — це все, що йому потрібно знати. Проте за деяких обставин ви можете захотіти, щоб ваш зворотній виклик споживав довільну кількість аргументів командного рядка. Тут написання зворотних викликів стає складним; це розглянуто далі в цьому розділі.

source: :mod:`optparse` always passes four particular arguments to your callback, and it will only pass additional arguments if you specify them via :attr:`~Option.callback_args` and :attr:`~Option.callback_kwargs`. Thus, the minimal callback function signature is::
uk: :mod:`optparse` завжди передає чотири конкретні аргументи вашому зворотному виклику, і він передасть додаткові аргументи, лише якщо ви вкажете їх через :attr:`~Option.callback_args` і :attr:`~Option.callback_kwargs`. Таким чином, мінімальна сигнатура функції зворотного виклику:

source: The four arguments to a callback are described below.
uk: Чотири аргументи зворотного виклику описані нижче.

source: There are several other option attributes that you can supply when you define a callback option:
uk: Є кілька інших атрибутів опції, які ви можете надати, коли визначаєте опцію зворотного виклику:

source: has its usual meaning: as with the ``"store"`` or ``"append"`` actions, it instructs :mod:`optparse` to consume one argument and convert it to :attr:`~Option.type`. Rather than storing the converted value(s) anywhere, though, :mod:`optparse` passes it to your callback function.
uk: має своє звичайне значення: як і з діями ``"store"`` або ``"append"``, воно наказує :mod:`optparse` споживати один аргумент і перетворювати його на :attr:`~Option.type` . Замість того, щоб десь зберігати перетворені значення, :mod:`optparse` передає їх вашій функції зворотного виклику.

source: also has its usual meaning: if it is supplied and > 1, :mod:`optparse` will consume :attr:`~Option.nargs` arguments, each of which must be convertible to :attr:`~Option.type`. It then passes a tuple of converted values to your callback.
uk: також має своє звичайне значення: якщо його надано та > 1, :mod:`optparse` споживатиме аргументи :attr:`~Option.nargs`, кожен із яких має бути конвертованим у :attr:`~Option.type`. Потім він передає кортеж перетворених значень у ваш зворотній виклик.

source: a tuple of extra positional arguments to pass to the callback
uk: кортеж додаткових позиційних аргументів для передачі зворотному виклику

source: a dictionary of extra keyword arguments to pass to the callback
uk: словник додаткових ключових аргументів для передачі зворотному виклику

source: How callbacks are called
uk: Як називаються зворотні виклики

source: All callbacks are called as follows::
uk: Усі зворотні виклики викликаються наступним чином:

source: ``option``
uk: ``опція``

source: is the Option instance that's calling the callback
uk: це екземпляр Option, який викликає зворотний виклик

source: is the option string seen on the command-line that's triggering the callback. (If an abbreviated long option was used, ``opt_str`` will be the full, canonical option string---e.g. if the user puts ``--foo`` on the command-line as an abbreviation for ``--foobar``, then ``opt_str`` will be ``"--foobar"``.)
uk: це рядок параметрів, який можна побачити в командному рядку, який запускає зворотний виклик. (Якщо використовувався скорочений довгий параметр, ``opt_str`` буде повним, канонічним рядком параметра --- наприклад, якщо користувач розміщує ``--foo`` у командному рядку як скорочення для ``-- foobar``, тоді ``opt_str`` буде ``"--foobar"``.)

source: ``value``
uk: ``значення``

source: is the argument to this option seen on the command-line. :mod:`optparse` will only expect an argument if :attr:`~Option.type` is set; the type of ``value`` will be the type implied by the option's type. If :attr:`~Option.type` for this option is ``None`` (no argument expected), then ``value`` will be ``None``. If :attr:`~Option.nargs` > 1, ``value`` will be a tuple of values of the appropriate type.
uk: є аргументом цього параметра в командному рядку. :mod:`optparse` очікуватиме аргумент, лише якщо встановлено :attr:`~Option.type`; тип ``значення`` буде типом, який передбачається типом опції. Якщо :attr:`~Option.type` для цього параметра має значення ``None`` (аргумент не очікується), тоді ``value`` буде ``None``. Якщо :attr:`~Option.nargs` > 1, ``value`` буде кортежем значень відповідного типу.

source: ``parser``
uk: ``парсер``

source: is the OptionParser instance driving the whole thing, mainly useful because you can access some other interesting data through its instance attributes:
uk: це екземпляр OptionParser, який керує всім цим, головним чином корисний, оскільки ви можете отримати доступ до деяких інших цікавих даних через його атрибути екземпляра:

source: the current list of remaining arguments, ie. with ``opt_str`` and ``value`` (if applicable) removed, and only the arguments following them still there. Feel free to modify ``parser.rargs``, e.g. by consuming more arguments.
uk: поточний список аргументів, що залишилися, тобто. з вилученими параметрами ``opt_str`` і ``value`` (якщо застосовно), і залишаються лише наступні за ними аргументи. Не соромтеся змінити ``parser.rargs``, напр. споживаючи більше аргументів.

source: the object where option values are by default stored (an instance of optparse.OptionValues). This lets callbacks use the same mechanism as the rest of :mod:`optparse` for storing option values; you don't need to mess around with globals or closures. You can also access or modify the value(s) of any options already encountered on the command-line.
uk: об’єкт, де за замовчуванням зберігаються значення параметрів (екземпляр optparse.OptionValues). Це дозволяє зворотним викликам використовувати той самий механізм, що й решта :mod:`optparse` для зберігання значень параметрів; вам не потрібно возитися з глобалами чи закриттями. Ви також можете отримати доступ або змінити значення будь-яких параметрів, які вже зустрічаються в командному рядку.

source: is a tuple of arbitrary positional arguments supplied via the :attr:`~Option.callback_args` option attribute.
uk: це кортеж довільних позиційних аргументів, що надаються через атрибут опції :attr:`~Option.callback_args`.

source: ``kwargs``
uk: ``кварги``

source: is a dictionary of arbitrary keyword arguments supplied via :attr:`~Option.callback_kwargs`.
uk: це словник довільних аргументів ключових слів, які надаються через :attr:`~Option.callback_kwargs`.

source: Raising errors in a callback
uk: Викликання помилок у зворотному виклику

source: The callback function should raise :exc:`OptionValueError` if there are any problems with the option or its argument(s). :mod:`optparse` catches this and terminates the program, printing the error message you supply to stderr. Your message should be clear, concise, accurate, and mention the option at fault. Otherwise, the user will have a hard time figuring out what they did wrong.
uk: Функція зворотного виклику має викликати :exc:`OptionValueError`, якщо є проблеми з параметром або його аргументом(ами). :mod:`optparse` вловлює це та завершує програму, друкуючи повідомлення про помилку, яке ви надаєте на stderr. Ваше повідомлення має бути ясним, лаконічним, точним і вказувати на помилковий варіант. В іншому випадку користувачеві буде важко зрозуміти, що він зробив не так.

source: Callback example 1: trivial callback
uk: Приклад зворотного виклику 1: тривіальний зворотний виклик

source: Here's an example of a callback option that takes no arguments, and simply records that the option was seen::
uk: Ось приклад опції зворотного виклику, яка не приймає аргументів і просто записує, що опцію було розглянуто::

source: Of course, you could do that with the ``"store_true"`` action.
uk: Звичайно, ви можете зробити це за допомогою дії ``"store_true"``.

source: Callback example 2: check option order
uk: Приклад зворотного виклику 2: перевірте порядок варіантів

source: Here's a slightly more interesting example: record the fact that ``-a`` is seen, but blow up if it comes after ``-b`` in the command-line. ::
uk: Ось трохи цікавіший приклад: зафіксуйте факт відображення ``-a``, але роздуйте, якщо він стоїть після ``-b`` у командному рядку. ::

source: Callback example 3: check option order (generalized)
uk: Приклад зворотного виклику 3: перевірка порядку опцій (узагальнено)

source: Callback example 4: check arbitrary condition
uk: Приклад зворотного виклику 4: перевірка довільної умови

source: Of course, you could put any condition in there---you're not limited to checking the values of already-defined options. For example, if you have options that should not be called when the moon is full, all you have to do is this::
uk: Звичайно, ви можете поставити туди будь-яку умову --- ви не обмежені перевіркою значень уже визначених параметрів. Наприклад, якщо у вас є опції, які не слід викликати в повний місяць, все, що вам потрібно зробити, це:

source: (The definition of ``is_moon_full()`` is left as an exercise for the reader.)
uk: (Визначення ``is_moon_full()`` залишено як вправа для читача.)

source: Callback example 5: fixed arguments
uk: Приклад зворотного виклику 5: фіксовані аргументи

source: Things get slightly more interesting when you define callback options that take a fixed number of arguments. Specifying that a callback option takes arguments is similar to defining a ``"store"`` or ``"append"`` option: if you define :attr:`~Option.type`, then the option takes one argument that must be convertible to that type; if you further define :attr:`~Option.nargs`, then the option takes :attr:`~Option.nargs` arguments.
uk: Справи стають трохи цікавішими, коли ви визначаєте параметри зворотного виклику, які приймають фіксовану кількість аргументів. Вказівка того, що опція зворотного виклику приймає аргументи, подібна до визначення опції ``"store"`` або ``"append"``: якщо ви визначаєте :attr:`~Option.type`, тоді опція приймає один аргумент, який повинен бути конвертованим у цей тип; якщо ви далі визначаєте :attr:`~Option.nargs`, тоді параметр приймає аргументи :attr:`~Option.nargs`.

source: Here's an example that just emulates the standard ``"store"`` action::
uk: Ось приклад, який просто емулює стандартну дію ``"store"``:

source: Note that :mod:`optparse` takes care of consuming 3 arguments and converting them to integers for you; all you have to do is store them. (Or whatever; obviously you don't need a callback for this example.)
uk: Зауважте, що :mod:`optparse` піклується про споживання 3 аргументів і перетворення їх на цілі числа за вас; все, що вам потрібно зробити, це зберегти їх. (Або що завгодно; очевидно, вам не потрібен зворотний виклик для цього прикладу.)

source: Callback example 6: variable arguments
uk: Приклад зворотного виклику 6: змінні аргументи

source: Things get hairy when you want an option to take a variable number of arguments. For this case, you must write a callback, as :mod:`optparse` doesn't provide any built-in capabilities for it. And you have to deal with certain intricacies of conventional Unix command-line parsing that :mod:`optparse` normally handles for you. In particular, callbacks should implement the conventional rules for bare ``--`` and ``-`` arguments:
uk: Справи стають заплутаними, коли ви хочете, щоб параметр приймав змінну кількість аргументів. У цьому випадку ви повинні написати зворотний виклик, оскільки :mod:`optparse` не надає жодних вбудованих можливостей для нього. І вам доведеться мати справу з певними тонкощами звичайного аналізу командного рядка Unix, який :mod:`optparse` зазвичай обробляє для вас. Зокрема, зворотні виклики мають реалізовувати звичайні правила для голих аргументів ``--`` і ``-``:

source: either ``--`` or ``-`` can be option arguments
uk: ``--`` або ``-`` можуть бути аргументами опції

source: bare ``--`` (if not the argument to some option): halt command-line processing and discard the ``--``
uk: голий ``--`` (якщо не аргумент для якогось параметра): зупинити обробку командного рядка та відкинути ``--``

source: bare ``-`` (if not the argument to some option): halt command-line processing but keep the ``-`` (append it to ``parser.largs``)
uk: голий ``-`` (якщо не аргумент для якогось параметра): зупинити обробку командного рядка, але зберегти ``-`` (додати його до ``parser.largs``)

source: If you want an option that takes a variable number of arguments, there are several subtle, tricky issues to worry about. The exact implementation you choose will be based on which trade-offs you're willing to make for your application (which is why :mod:`optparse` doesn't support this sort of thing directly).
uk: Якщо вам потрібна опція, яка приймає змінну кількість аргументів, є кілька тонких, складних питань, про які варто потурбуватися. Точна реалізація, яку ви виберете, базуватиметься на компромісах, які ви готові зробити для своєї програми (саме тому :mod:`optparse` не підтримує подібні речі напряму).

source: Nevertheless, here's a stab at a callback for an option with variable arguments::
uk: Тим не менш, ось спроба зворотного виклику для опції зі змінними аргументами::

source: Extending :mod:`optparse`
uk: Розширення :mod:`optparse`

source: Since the two major controlling factors in how :mod:`optparse` interprets command-line options are the action and type of each option, the most likely direction of extension is to add new actions and new types.
uk: Оскільки двома основними факторами, що впливають на те, як :mod:`optparse` інтерпретує параметри командного рядка, є дія та тип кожного параметра, найімовірнішим напрямком розширення є додавання нових дій і нових типів.

source: Adding new types
uk: Додавання нових типів

source: To add new types, you need to define your own subclass of :mod:`optparse`'s :class:`Option` class. This class has a couple of attributes that define :mod:`optparse`'s types: :attr:`~Option.TYPES` and :attr:`~Option.TYPE_CHECKER`.
uk: Щоб додати нові типи, вам потрібно визначити власний підклас класу :mod:`optparse` :class:`Option`. Цей клас має кілька атрибутів, які визначають типи :mod:`optparse`: :attr:`~Option.TYPES` і :attr:`~Option.TYPE_CHECKER`.

source: A tuple of type names; in your subclass, simply define a new tuple :attr:`TYPES` that builds on the standard one.
uk: Кортеж імен типів; у своєму підкласі просто визначте новий кортеж :attr:`TYPES`, який базується на стандартному.

source: A dictionary mapping type names to type-checking functions. A type-checking function has the following signature::
uk: Словник, що зіставляє назви типів із функціями перевірки типу. Функція перевірки типу має такий підпис:

source: where ``option`` is an :class:`Option` instance, ``opt`` is an option string (e.g., ``-f``), and ``value`` is the string from the command line that must be checked and converted to your desired type. ``check_mytype()`` should return an object of the hypothetical type ``mytype``. The value returned by a type-checking function will wind up in the OptionValues instance returned by :meth:`OptionParser.parse_args`, or be passed to a callback as the ``value`` parameter.
uk: де ``option`` - це екземпляр :class:`Option`, ``opt`` - це рядок параметра (наприклад, ``-f``), а ``value`` - це рядок із командного рядка, який необхідно перевірити та перетворити на потрібний тип. ``check_mytype()`` має повертати об’єкт гіпотетичного типу ``mytype``. Значення, повернуте функцією перевірки типу, з’явиться в екземплярі OptionValues, поверненому :meth:`OptionParser.parse_args`, або буде передано зворотному виклику як параметр ``value``.
