Repository: python/python-docs-uk
Catalog: library/os_path.po
Languages: uk

source: Split the pathname *path* into a pair ``(drive, tail)`` where *drive* is either a mount point or the empty string. On systems which do not use drive specifications, *drive* will always be the empty string. In all cases, ``drive + tail`` will be the same as *path*.
uk: Розділіть назву шляху *path* на пару ``(диск, хвіст)``, де *диск* є або точкою монтування, або порожнім рядком. У системах, які не використовують специфікації дисків, *drive* завжди буде порожнім рядком. У всіх випадках ``drive + tail`` буде таким самим, як *path*.

source: On Windows, splits a pathname into drive/UNC sharepoint and relative path.
uk: У Windows розділяє шлях на диск/загальну точку UNC і відносний шлях.

source: If the path contains a drive letter, drive will contain everything up to and including the colon::
uk: Якщо шлях містить букву диска, диск міститиме все, аж до двокрапки включно::

source: If the path contains a UNC path, drive will contain the host name and share, up to but not including the fourth separator::
uk: Якщо шлях містить UNC-шлях, диск міститиме ім’я хоста та спільний ресурс, до четвертого роздільника, але не включаючи::

source: Split the pathname *path* into a pair ``(root, ext)`` such that ``root + ext == path``, and the extension, *ext*, is empty or begins with a period and contains at most one period.
uk: Розділіть назву шляху *path* на пару ``(root, ext)`` таким чином, ``root + ext == path``, а розширення *ext* буде порожнім або починається з крапки та містить щонайбільше один період.

source: If the path contains no extension, *ext* will be ``''``::
uk: Якщо шлях не містить розширення, *ext* буде ``''``::

source: If the path contains an extension, then *ext* will be set to this extension, including the leading period. Note that previous periods will be ignored::
uk: Якщо шлях містить розширення, то *ext* буде встановлено для цього розширення, включаючи початкову точку. Зауважте, що попередні періоди ігноруватимуться:

source: Leading periods of the last component of the path are considered to be part of the root::
uk: Початкові періоди останнього компонента шляху вважаються частиною кореня::

source: ``True`` if arbitrary Unicode strings can be used as file names (within limitations imposed by the file system).
uk: ``True``, якщо довільні рядки Unicode можуть використовуватися як імена файлів (в межах обмежень, накладених файловою системою).
