Repository: python/python-docs-uk
Catalog: library/pickle.po
Languages: uk

source: Out-of-band Buffers
uk: Позасмугові буфери

source: In some contexts, the :mod:`pickle` module is used to transfer massive amounts of data. Therefore, it can be important to minimize the number of memory copies, to preserve performance and resource consumption. However, normal operation of the :mod:`pickle` module, as it transforms a graph-like structure of objects into a sequential stream of bytes, intrinsically involves copying data to and from the pickle stream.
uk: У деяких контекстах модуль :mod:`pickle` використовується для передачі величезних обсягів даних. Тому може бути важливо мінімізувати кількість копій пам’яті, щоб зберегти продуктивність і споживання ресурсів. Однак нормальна робота модуля :mod:`pickle`, оскільки він перетворює графоподібну структуру об’єктів у послідовний потік байтів, за своєю суттю передбачає копіювання даних до потоку pickle і з нього.

source: This constraint can be eschewed if both the *provider* (the implementation of the object types to be transferred) and the *consumer* (the implementation of the communications system) support the out-of-band transfer facilities provided by pickle protocol 5 and higher.
uk: Це обмеження можна уникнути, якщо і *провайдер* (реалізація типів об’єктів, що передаються), і *споживач* (реалізація системи зв’язку) підтримують засоби позасмугової передачі, надані протоколом pickle 5 і вище.

source: Provider API
uk: API провайдера

source: A :class:`PickleBuffer` object *signals* that the underlying buffer is eligible for out-of-band data transfer. Those objects remain compatible with normal usage of the :mod:`pickle` module. However, consumers can also opt-in to tell :mod:`pickle` that they will handle those buffers by themselves.
uk: Об’єкт :class:`PickleBuffer` *сигналізує*, що базовий буфер придатний для позасмугової передачі даних. Ці об’єкти залишаються сумісними зі звичайним використанням модуля :mod:`pickle`. Однак споживачі також можуть повідомити :mod:`pickle`, що вони самостійно оброблятимуть ці буфери.

source: Consumer API
uk: Споживацький API

source: A communications system can enable custom handling of the :class:`PickleBuffer` objects generated when serializing an object graph.
uk: Система зв’язку може ввімкнути спеціальну обробку об’єктів :class:`PickleBuffer`, створених під час серіалізації графа об’єктів.

source: On the sending side, it needs to pass a *buffer_callback* argument to :class:`Pickler` (or to the :func:`dump` or :func:`dumps` function), which will be called with each :class:`PickleBuffer` generated while pickling the object graph. Buffers accumulated by the *buffer_callback* will not see their data copied into the pickle stream, only a cheap marker will be inserted.
uk: На стороні надсилання йому потрібно передати аргумент *buffer_callback* до :class:`Pickler` (або до функції :func:`dump` або :func:`dumps`), який буде викликано з кожним :class:`PickleBuffer`, створений під час маринування графа об’єкта. Буфери, накопичені *buffer_callback*, не бачитимуть своїх даних, скопійованих у потік pickle, буде вставлено лише дешевий маркер.

source: On the receiving side, it needs to pass a *buffers* argument to :class:`Unpickler` (or to the :func:`load` or :func:`loads` function), which is an iterable of the buffers which were passed to *buffer_callback*. That iterable should produce buffers in the same order as they were passed to *buffer_callback*. Those buffers will provide the data expected by the reconstructors of the objects whose pickling produced the original :class:`PickleBuffer` objects.
uk: На стороні приймача йому потрібно передати аргумент *buffers* до :class:`Unpickler` (або до функції :func:`load` або :func:`loads`), який є ітерацією буферів, які були передається до *buffer_callback*. Ця ітерація повинна створювати буфери в тому ж порядку, в якому вони були передані *buffer_callback*. Ці буфери нададуть дані, очікувані реконструкторами об’єктів, маринування яких створило оригінальні об’єкти :class:`PickleBuffer`.

source: Between the sending side and the receiving side, the communications system is free to implement its own transfer mechanism for out-of-band buffers. Potential optimizations include the use of shared memory or datatype-dependent compression.
uk: Між відправною та приймальною сторонами система зв’язку може вільно реалізувати власний механізм передачі для позасмугових буферів. Потенційна оптимізація включає використання спільної пам’яті або залежне від типу даних стиснення.

source: Example
uk: приклад

source: Here is a trivial example where we implement a :class:`bytearray` subclass able to participate in out-of-band buffer pickling::
uk: Ось тривіальний приклад, у якому ми реалізуємо підклас :class:`bytearray`, здатний брати участь у позаполосному відбиранні буфера:

source: The reconstructor (the ``_reconstruct`` class method) returns the buffer's providing object if it has the right type. This is an easy way to simulate zero-copy behaviour on this toy example.
uk: Реконструктор (метод класу ``_reconstruct``) повертає наданий об’єкт буфера, якщо він має правильний тип. Це простий спосіб імітувати поведінку без копіювання на цьому прикладі іграшки.

source: On the consumer side, we can pickle those objects the usual way, which when unserialized will give us a copy of the original object::
uk: Зі сторони споживача ми можемо відібрати ці об’єкти звичайним способом, який після десеріалізації дасть нам копію оригінального об’єкта:

source: But if we pass a *buffer_callback* and then give back the accumulated buffers when unserializing, we are able to get back the original object::
uk: Але якщо ми передаємо *buffer_callback*, а потім повертаємо накопичені буфери під час десеріалізації, ми можемо повернути вихідний об’єкт::

source: This example is limited by the fact that :class:`bytearray` allocates its own memory: you cannot create a :class:`bytearray` instance that is backed by another object's memory. However, third-party datatypes such as NumPy arrays do not have this limitation, and allow use of zero-copy pickling (or making as few copies as possible) when transferring between distinct processes or systems.
uk: Цей приклад обмежений тим фактом, що :class:`bytearray` виділяє власну пам’ять: ви не можете створити екземпляр :class:`bytearray`, який підтримується пам’яттю іншого об’єкта. Однак сторонні типи даних, такі як масиви NumPy, не мають цього обмеження та дозволяють використовувати нульове копіювання (або створення якомога меншої кількості копій) під час передачі між окремими процесами чи системами.

source: :pep:`574` -- Pickle protocol 5 with out-of-band data
uk: :pep:`574` -- Протокол Pickle 5 із позаполосними даними

source: Restricting Globals
uk: Обмеження Globals

source: By default, unpickling will import any class or function that it finds in the pickle data. For many applications, this behaviour is unacceptable as it permits the unpickler to import and invoke arbitrary code. Just consider what this hand-crafted pickle data stream does when loaded::
uk: За замовчуванням unpickling імпортує будь-який клас або функцію, знайдені в даних pickle. Для багатьох програм така поведінка є неприйнятною, оскільки вона дозволяє unpickler імпортувати та викликати довільний код. Просто подумайте, що робить цей створений вручну потік даних маринованих огірків під час завантаження:

source: In this example, the unpickler imports the :func:`os.system` function and then apply the string argument "echo hello world". Although this example is inoffensive, it is not difficult to imagine one that could damage your system.
uk: У цьому прикладі unpickler імпортує функцію :func:`os.system`, а потім застосовує рядковий аргумент "echo hello world". Хоча цей приклад не образливий, неважко уявити такий, який може пошкодити вашу систему.

source: For this reason, you may want to control what gets unpickled by customizing :meth:`Unpickler.find_class`. Unlike its name suggests, :meth:`Unpickler.find_class` is called whenever a global (i.e., a class or a function) is requested. Thus it is possible to either completely forbid globals or restrict them to a safe subset.
uk: З цієї причини ви можете контролювати те, що буде видалено, налаштувавши :meth:`Unpickler.find_class`. На відміну від назви, :meth:`Unpickler.find_class` викликається щоразу, коли запитується глобал (тобто клас або функція). Таким чином, можна або повністю заборонити глобальні елементи, або обмежити їх безпечною підмножиною.

source: Here is an example of an unpickler allowing only few safe classes from the :mod:`builtins` module to be loaded::
uk: Ось приклад unpickler, який дозволяє завантажити лише декілька безпечних класів із модуля :mod:`builtins`:

source: A sample usage of our unpickler working as intended::
uk: Зразок використання нашого unpickler, що працює за призначенням::

source: As our examples shows, you have to be careful with what you allow to be unpickled. Therefore if security is a concern, you may want to consider alternatives such as the marshalling API in :mod:`xmlrpc.client` or third-party solutions.
uk: Як показують наші приклади, ви повинні бути обережними з тим, що ви дозволяєте не маринувати. Тому, якщо питання безпеки викликає занепокоєння, ви можете розглянути такі альтернативи, як маршалінговий API у :mod:`xmlrpc.client` або рішення сторонніх розробників.

source: Performance
uk: Продуктивність

source: Recent versions of the pickle protocol (from protocol 2 and upwards) feature efficient binary encodings for several common features and built-in types. Also, the :mod:`pickle` module has a transparent optimizer written in C.
uk: Останні версії протоколу pickle (від протоколу 2 і вище) містять ефективне двійкове кодування для кількох загальних функцій і вбудованих типів. Крім того, модуль :mod:`pickle` має прозорий оптимізатор, написаний мовою C.

source: Examples
uk: Приклади

source: For the simplest code, use the :func:`dump` and :func:`load` functions. ::
uk: Для найпростішого коду використовуйте функції :func:`dump` і :func:`load`. ::

source: The following example reads the resulting pickled data. ::
uk: У наступному прикладі зчитуються результуючі мариновані дані. ::

source: Module :mod:`copyreg`
uk: Модуль :mod:`copyreg`

source: Pickle interface constructor registration for extension types.
uk: Реєстрація конструктора інтерфейсу Pickle для типів розширень.

source: Module :mod:`pickletools`
uk: Модуль :mod:`pickletools`

source: Tools for working with and analyzing pickled data.
uk: Інструменти для роботи з маринованими даними та їх аналізу.

source: Module :mod:`shelve`
uk: Модуль :mod:`shelve`

source: Indexed databases of objects; uses :mod:`pickle`.
uk: Індексовані бази даних об'єктів; використовує :mod:`pickle`.

source: Module :mod:`copy`
uk: Модуль :mod:`copy`

source: Shallow and deep object copying.
uk: Неглибоке і глибоке копіювання об'єктів.

source: Module :mod:`marshal`
uk: Модуль :mod:`marshal`

source: High-performance serialization of built-in types.
uk: Високопродуктивна серіалізація вбудованих типів.

source: Footnotes
uk: Виноски

source: Don't confuse this with the :mod:`marshal` module
uk: Не плутайте це з модулем :mod:`marshal`

source: This is why :keyword:`lambda` functions cannot be pickled: all :keyword:`!lambda` functions share the same name: ``<lambda>``.
uk: Ось чому функції :keyword:`lambda` не можна маринувати: усі функції :keyword:`!lambda` мають однакову назву: ``<lambda>``.

source: The exception raised will likely be an :exc:`ImportError` or an :exc:`AttributeError` but it could be something else.
uk: Виняток, імовірно, буде :exc:`ImportError` або :exc:`AttributeError`, але це може бути щось інше.

source: The :mod:`copy` module uses this protocol for shallow and deep copying operations.
uk: Модуль :mod:`copy` використовує цей протокол для дрібних і глибоких операцій копіювання.

source: The limitation on alphanumeric characters is due to the fact that persistent IDs in protocol 0 are delimited by the newline character. Therefore if any kind of newline characters occurs in persistent IDs, the resulting pickled data will become unreadable.
uk: Обмеження щодо буквено-цифрових символів пов’язане з тим, що постійні ідентифікатори в протоколі 0 відокремлюються символом нового рядка. Тому, якщо в постійних ідентифікаторах зустрічаються будь-які символи нового рядка, результуючі мариновані дані стануть нечитабельними.
