Repository: python/python-docs-uk
Catalog: library/pickle.po
Languages: uk

source: Use :func:`pickletools.optimize` if you need more compact pickles.
uk: Використовуйте :func:`pickletools.optimize`, якщо вам потрібні більш компактні соління.

source: This takes a binary file for reading a pickle data stream.
uk: Це бере двійковий файл для читання потоку даних pickle.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed.
uk: Версія протоколу pickle визначається автоматично, тому аргумент протоколу не потрібен.

source: The argument *file* must have three methods, a read() method that takes an integer argument, a readinto() method that takes a buffer argument and a readline() method that requires no arguments, as in the :class:`io.BufferedIOBase` interface. Thus *file* can be an on-disk file opened for binary reading, an :class:`io.BytesIO` object, or any other custom object that meets this interface.
uk: Аргумент *file* повинен мати три методи: метод read(), який приймає цілочисельний аргумент, метод readinto(), який приймає аргумент буфера, і метод readline(), який не потребує аргументів, як у Інтерфейс :class:`io.BufferedIOBase`. Таким чином, *file* може бути файлом на диску, відкритим для двійкового читання, об’єктом :class:`io.BytesIO` або будь-яким іншим спеціальним об’єктом, який відповідає цьому інтерфейсу.

source: The optional arguments *fix_imports*, *encoding* and *errors* are used to control compatibility support for pickle stream generated by Python 2. If *fix_imports* is true, pickle will try to map the old Python 2 names to the new names used in Python 3. The *encoding* and *errors* tell pickle how to decode 8-bit string instances pickled by Python 2; these default to 'ASCII' and 'strict', respectively. The *encoding* can be 'bytes' to read these 8-bit string instances as bytes objects. Using ``encoding='latin1'`` is required for unpickling NumPy arrays and instances of :class:`~datetime.datetime`, :class:`~datetime.date` and :class:`~datetime.time` pickled by Python 2.
uk: Необов’язкові аргументи *fix_imports*, *encoding* і *errors* використовуються для керування підтримкою сумісності для потоку pickle, створеного Python 2. Якщо *fix_imports* має значення true, pickle спробує зіставити старі імена Python 2 з новими іменами, які використовуються у Python 3. *кодування* та *помилки* повідомляють pickle, як декодувати 8-бітні екземпляри рядків, вибрані Python 2; за замовчуванням вони мають значення "ASCII" і "strict" відповідно. *Кодуванням* може бути "байт" для читання цих 8-бітних екземплярів рядка як об’єктів bytes. Використання ``encoding='latin1'`` потрібне для видалення масивів NumPy і екземплярів :class:`~datetime.datetime`, :class:`~datetime.date` і :class:`~datetime.time`, вибраних Python 2.

source: Read the pickled representation of an object from the open file object given in the constructor, and return the reconstituted object hierarchy specified therein. Bytes past the pickled representation of the object are ignored.
uk: Зчитувати виділене представлення об’єкта з відкритого файлового об’єкта, наданого в конструкторі, і повертати відновлену ієрархію об’єктів, указану в ньому. Байти, які перебувають після виділеного представлення об’єкта, ігноруються.

source: Raise an :exc:`UnpicklingError` by default.
uk: Викликати :exc:`UnpicklingError` за замовчуванням.

source: If defined, :meth:`persistent_load` should return the object specified by the persistent ID *pid*. If an invalid persistent ID is encountered, an :exc:`UnpicklingError` should be raised.
uk: Якщо визначено, :meth:`persistent_load` має повертати об’єкт, указаний постійним ідентифікатором *pid*. Якщо виявлено недійсний постійний ідентифікатор, має бути викликано :exc:`UnpicklingError`.

source: Import *module* if necessary and return the object called *name* from it, where the *module* and *name* arguments are :class:`str` objects. Note, unlike its name suggests, :meth:`find_class` is also used for finding functions.
uk: Імпортуйте *module*, якщо необхідно, і поверніть з нього об’єкт із назвою *name*, де аргументи *module* і *name* є об’єктами :class:`str`. Зверніть увагу, на відміну від назви, :meth:`find_class` також використовується для пошуку функцій.

source: Subclasses may override this to gain control over what type of objects and how they can be loaded, potentially reducing security risks. Refer to :ref:`pickle-restrict` for details.
uk: Підкласи можуть замінити це, щоб отримати контроль над тим, який тип об’єктів і як їх можна завантажувати, потенційно зменшуючи ризики безпеки. Зверніться до :ref:`pickle-restrict` для деталей.

source: Raises an :ref:`auditing event <auditing>` ``pickle.find_class`` with arguments ``module``, ``name``.
uk: Викликає :ref:`подію аудиту <auditing>` ``pickle.find_class`` з аргументами ``module``, ``name``.

source: A wrapper for a buffer representing picklable data. *buffer* must be a :ref:`buffer-providing <bufferobjects>` object, such as a :term:`bytes-like object` or a N-dimensional array.
uk: Обгортка для буфера, що представляє дані, які можна вибрати. *buffer* має бути об’єктом, :ref:`що надає буфер <bufferobjects>`, наприклад :term:`bytes-like object` або N-вимірним масивом.

source: :class:`PickleBuffer` is itself a buffer provider, therefore it is possible to pass it to other APIs expecting a buffer-providing object, such as :class:`memoryview`.
uk: :class:`PickleBuffer` сам є постачальником буфера, тому його можна передати іншим API, які очікують об’єкта, що надає буфер, наприклад :class:`memoryview`.

source: :class:`PickleBuffer` objects can only be serialized using pickle protocol 5 or higher. They are eligible for :ref:`out-of-band serialization <pickle-oob>`.
uk: Об’єкти :class:`PickleBuffer` можна серіалізувати лише за допомогою протоколу pickle версії 5 або вище. Вони підходять для :ref:`позасмугової серіалізації <pickle-oob>`.

source: Return a :class:`memoryview` of the memory area underlying this buffer. The returned object is a one-dimensional, C-contiguous memoryview with format ``B`` (unsigned bytes). :exc:`BufferError` is raised if the buffer is neither C- nor Fortran-contiguous.
uk: Повертає :class:`memoryview` області пам’яті, що лежить в основі цього буфера. Повернений об’єкт є одновимірним C-суміжним представленням пам’яті у форматі ``B`` (байти без знаку). :exc:`BufferError` виникає, якщо буфер не суміжний ні на C, ні на Fortran.

source: Release the underlying buffer exposed by the PickleBuffer object.
uk: Вивільніть базовий буфер, відкритий об’єктом PickleBuffer.

source: What can be pickled and unpickled?
uk: Що можна маринувати і не квашети?

source: The following types can be pickled:
uk: Маринувати можна такі види:

source: integers, floating-point numbers, complex numbers;
uk: цілі числа, числа з плаваючою комою, комплексні числа;

source: strings, bytes, bytearrays;
uk: рядки, байти, байтові масиви;

source: tuples, lists, sets, and dictionaries containing only picklable objects;
uk: кортежі, списки, набори та словники, що містять лише об’єкти, які можна вибирати;

source: functions (built-in and user-defined) accessible from the top level of a module (using :keyword:`def`, not :keyword:`lambda`);
uk: функції (вбудовані та визначені користувачем), доступні з верхнього рівня модуля (за допомогою :keyword:`def`, а не :keyword:`lambda`);

source: classes accessible from the top level of a module;
uk: класи, доступні з верхнього рівня модуля;

source: Attempts to pickle unpicklable objects will raise the :exc:`PicklingError` exception; when this happens, an unspecified number of bytes may have already been written to the underlying file. Trying to pickle a highly recursive data structure may exceed the maximum recursion depth, a :exc:`RecursionError` will be raised in this case. You can carefully raise this limit with :func:`sys.setrecursionlimit`.
uk: Спроби маринувати об’єкти, які неможливо вибрати, викличуть виняток :exc:`PicklingError`; коли це трапляється, невизначену кількість байтів, можливо, уже було записано до основного файлу. Спроба відібрати високорекурсивну структуру даних може перевищити максимальну глибину рекурсії, у цьому випадку виникне :exc:`RecursionError`. Ви можете обережно збільшити це обмеження за допомогою :func:`sys.setrecursionlimit`.

source: Note that functions (built-in and user-defined) are pickled by fully :term:`qualified name`, not by value. [#]_ This means that only the function name is pickled, along with the name of the containing module and classes. Neither the function's code, nor any of its function attributes are pickled. Thus the defining module must be importable in the unpickling environment, and the module must contain the named object, otherwise an exception will be raised. [#]_
uk: Зауважте, що функції (вбудовані та визначені користувачем) вибираються за повним :term:`qualified name`, а не за значенням. [#]_ Це означає, що виділяється лише назва функції, а також назва модуля та класів, що містять. Ні код функції, ні будь-які її атрибути функції не мариновані. Таким чином, визначальний модуль має бути імпортованим у середовищі unpickling, і модуль має містити названий об’єкт, інакше буде створено виняток. [#]_

source: Similarly, classes are pickled by fully qualified name, so the same restrictions in the unpickling environment apply. Note that none of the class's code or data is pickled, so in the following example the class attribute ``attr`` is not restored in the unpickling environment::
uk: Подібним чином, класи вибираються за повним іменем, тому застосовуються ті самі обмеження в середовищі розбирання. Зауважте, що жоден із коду чи даних класу не вибирається, тому в наступному прикладі атрибут класу ``attr`` не відновлюється в середовищі розбирання::

source: These restrictions are why picklable functions and classes must be defined at the top level of a module.
uk: Через ці обмеження функції та класи, які можна вибрати, повинні бути визначені на верхньому рівні модуля.

source: Pickling Class Instances
uk: Примірники класу маринування

source: In this section, we describe the general mechanisms available to you to define, customize, and control how class instances are pickled and unpickled.
uk: У цьому розділі ми описуємо загальні механізми, доступні вам для визначення, налаштування та контролю того, як екземпляри класу вибираються та не вибираються.

source: Classes can alter the default behaviour by providing one or several special methods:
uk: Класи можуть змінювати типову поведінку, надаючи один або декілька спеціальних методів:

source: In protocols 2 and newer, classes that implements the :meth:`__getnewargs_ex__` method can dictate the values passed to the :meth:`__new__` method upon unpickling. The method must return a pair ``(args, kwargs)`` where *args* is a tuple of positional arguments and *kwargs* a dictionary of named arguments for constructing the object. Those will be passed to the :meth:`__new__` method upon unpickling.
uk: У протоколах 2 і новіших класи, які реалізують метод :meth:`__getnewargs_ex__`, можуть диктувати значення, що передаються в метод :meth:`__new__` після видалення. Метод має повертати пару "(args, kwargs)", де *args* — це кортеж позиційних аргументів, а *kwargs* — словник іменованих аргументів для побудови об’єкта. Вони будуть передані в метод :meth:`__new__` після видалення.

source: You should implement this method if the :meth:`__new__` method of your class requires keyword-only arguments. Otherwise, it is recommended for compatibility to implement :meth:`__getnewargs__`.
uk: Ви повинні застосувати цей метод, якщо метод :meth:`__new__` вашого класу вимагає аргументів лише з ключовими словами. В іншому випадку для сумісності рекомендується реалізувати :meth:`__getnewargs__`.

source: :meth:`__getnewargs_ex__` is now used in protocols 2 and 3.
uk: :meth:`__getnewargs_ex__` тепер використовується в протоколах 2 і 3.

source: This method serves a similar purpose as :meth:`__getnewargs_ex__`, but supports only positional arguments. It must return a tuple of arguments ``args`` which will be passed to the :meth:`__new__` method upon unpickling.
uk: Цей метод виконує таку саму мету, як :meth:`__getnewargs_ex__`, але підтримує лише позиційні аргументи. Він має повертати кортеж аргументів ``args``, який буде передано методу :meth:`__new__` після видалення.

source: :meth:`__getnewargs__` will not be called if :meth:`__getnewargs_ex__` is defined.
uk: :meth:`__getnewargs__` не буде викликано, якщо :meth:`__getnewargs_ex__` визначено.

source: Before Python 3.6, :meth:`__getnewargs__` was called instead of :meth:`__getnewargs_ex__` in protocols 2 and 3.
uk: До Python 3.6 :meth:`__getnewargs__` викликався замість :meth:`__getnewargs_ex__` у протоколах 2 і 3.

source: Upon unpickling, if the class defines :meth:`__setstate__`, it is called with the unpickled state. In that case, there is no requirement for the state object to be a dictionary. Otherwise, the pickled state must be a dictionary and its items are assigned to the new instance's dictionary.
uk: Якщо під час розбирання клас визначає :meth:`__setstate__`, він викликається зі станом unpickled. У цьому випадку немає вимоги, щоб об’єкт стану був словником. В іншому випадку маринований стан має бути словником, а його елементи призначаються словнику нового екземпляра.

source: The interface is currently defined as follows. The :meth:`__reduce__` method takes no argument and shall return either a string or preferably a tuple (the returned object is often referred to as the "reduce value").
uk: На даний момент інтерфейс визначається наступним чином. Метод :meth:`__reduce__` не приймає аргументів і повертає або рядок, або, бажано, кортеж (повернений об’єкт часто називають "зменшеним значенням").

source: If a string is returned, the string should be interpreted as the name of a global variable. It should be the object's local name relative to its module; the pickle module searches the module namespace to determine the object's module. This behaviour is typically useful for singletons.
uk: Якщо повертається рядок, цей рядок слід інтерпретувати як назву глобальної змінної. Це має бути локальне ім’я об’єкта відносно його модуля; модуль pickle шукає простір імен модуля, щоб визначити модуль об’єкта. Така поведінка, як правило, корисна для одиночних користувачів.

source: When a tuple is returned, it must be between two and six items long. Optional items can either be omitted, or ``None`` can be provided as their value. The semantics of each item are in order:
uk: Коли повертається кортеж, він має містити від двох до шести елементів. Необов’язкові елементи можна або пропустити, або в якості їхнього значення можна вказати ``None``. Семантика кожного елемента в порядку:

source: A callable object that will be called to create the initial version of the object.
uk: Викликаний об’єкт, який буде викликано для створення початкової версії об’єкта.

source: A tuple of arguments for the callable object. An empty tuple must be given if the callable does not accept any argument.
uk: Кортеж аргументів для викликаного об’єкта. Порожній кортеж повинен бути наданий, якщо викликаний не приймає жодних аргументів.

source: Optionally, the object's state, which will be passed to the object's :meth:`__setstate__` method as previously described. If the object has no such method then, the value must be a dictionary and it will be added to the object's :attr:`~object.__dict__` attribute.
uk: Необов’язково, стан об’єкта, який буде передано методу :meth:`__setstate__` об’єкта, як описано раніше. Якщо об’єкт не має такого методу, значення має бути словником, і воно буде додано до атрибута об’єкта :attr:`~object.__dict__`.

source: Optionally, an iterator (not a sequence) yielding successive key-value pairs. These items will be stored to the object using ``obj[key] = value``. This is primarily used for dictionary subclasses, but may be used by other classes as long as they implement :meth:`__setitem__`.
uk: Необов’язково, ітератор (не послідовність), що дає послідовні пари ключ-значення. Ці елементи будуть збережені в об’єкті за допомогою ``obj[key] = value``. Це в основному використовується для підкласів словників, але може використовуватися іншими класами, якщо вони реалізують :meth:`__setitem__`.

source: Optionally, a callable with a ``(obj, state)`` signature. This callable allows the user to programmatically control the state-updating behavior of a specific object, instead of using ``obj``'s static :meth:`__setstate__` method. If not ``None``, this callable will have priority over ``obj``'s :meth:`__setstate__`.
uk: Необов’язково, викликається з підписом ``(obj, state)``. Цей виклик дозволяє користувачеві програмно керувати поведінкою оновлення стану конкретного об’єкта замість використання статичного методу ``obj`` :meth:`__setstate__`. Якщо не ``None``, цей виклик матиме пріоритет над ``obj`` :meth:`__setstate__`.

source: The optional sixth tuple item, ``(obj, state)``, was added.
uk: Додано необов’язковий шостий елемент кортежу, ``(obj, state)``.

source: Alternatively, a :meth:`__reduce_ex__` method may be defined. The only difference is this method should take a single integer argument, the protocol version. When defined, pickle will prefer it over the :meth:`__reduce__` method. In addition, :meth:`__reduce__` automatically becomes a synonym for the extended version. The main use for this method is to provide backwards-compatible reduce values for older Python releases.
uk: В якості альтернативи можна визначити метод :meth:`__reduce_ex__`. Єдина відмінність полягає в тому, що цей метод має приймати один цілий аргумент, версію протоколу. Якщо визначено, pickle віддасть перевагу цьому методу :meth:`__reduce__`. Крім того, :meth:`__reduce__` автоматично стає синонімом розширеної версії. Основним використанням цього методу є надання зворотно сумісних значень зменшення для старіших випусків Python.

source: Persistence of External Objects
uk: Постійність зовнішніх об'єктів

source: For the benefit of object persistence, the :mod:`pickle` module supports the notion of a reference to an object outside the pickled data stream. Such objects are referenced by a persistent ID, which should be either a string of alphanumeric characters (for protocol 0) [#]_ or just an arbitrary object (for any newer protocol).
uk: На користь збереження об’єкта модуль :mod:`pickle` підтримує поняття посилання на об’єкт за межами марінованого потоку даних. На такі об’єкти посилається постійний ідентифікатор, який має бути або рядком буквено-цифрових символів (для протоколу 0) [#]_, або просто довільним об’єктом (для будь-якого новішого протоколу).

source: The resolution of such persistent IDs is not defined by the :mod:`pickle` module; it will delegate this resolution to the user-defined methods on the pickler and unpickler, :meth:`~Pickler.persistent_id` and :meth:`~Unpickler.persistent_load` respectively.
uk: Роздільна здатність таких постійних ідентифікаторів не визначається модулем :mod:`pickle`; він делегує це вирішення визначеним користувачем методам pickler і unpickler, :meth:`~Pickler.persistent_id` і :meth:`~Unpickler.persistent_load` відповідно.

source: To pickle objects that have an external persistent ID, the pickler must have a custom :meth:`~Pickler.persistent_id` method that takes an object as an argument and returns either ``None`` or the persistent ID for that object. When ``None`` is returned, the pickler simply pickles the object as normal. When a persistent ID string is returned, the pickler will pickle that object, along with a marker so that the unpickler will recognize it as a persistent ID.
uk: Щоб вибирати об’єкти, які мають зовнішній постійний ідентифікатор, засіб вибору повинен мати спеціальний метод :meth:`~Pickler.persistent_id`, який приймає об’єкт як аргумент і повертає "Немає" або постійний ідентифікатор для цього об’єкта. Коли повертається ``None``, піклер просто маринує об’єкт як зазвичай. Коли повертається рядок постійного ідентифікатора, засіб вибору виділяє цей об’єкт разом із маркером, щоб засіб вилучення розпізнавало його як постійний ідентифікатор.

source: To unpickle external objects, the unpickler must have a custom :meth:`~Unpickler.persistent_load` method that takes a persistent ID object and returns the referenced object.
uk: Щоб розібрати зовнішні об’єкти, розбірник повинен мати спеціальний метод :meth:`~Unpickler.persistent_load`, який приймає об’єкт постійного ідентифікатора та повертає об’єкт, на який посилається.

source: Here is a comprehensive example presenting how persistent ID can be used to pickle external objects by reference.
uk: Ось вичерпний приклад, який демонструє, як постійний ідентифікатор можна використовувати для маринування зовнішніх об’єктів за посиланням.

source: Dispatch Tables
uk: Таблиці відправлення

source: If one wants to customize pickling of some classes without disturbing any other code which depends on pickling, then one can create a pickler with a private dispatch table.
uk: Якщо ви хочете налаштувати маринування деяких класів, не порушуючи будь-який інший код, який залежить від маринування, тоді можна створити піклер із приватною таблицею відправлення.

source: For example ::
uk: Наприклад ::

source: creates an instance of :class:`pickle.Pickler` with a private dispatch table which handles the ``SomeClass`` class specially. Alternatively, the code ::
uk: створює екземпляр :class:`pickle.Pickler` із приватною таблицею відправлення, яка спеціально обробляє клас ``SomeClass``. Як альтернатива, код::

source: does the same but all instances of ``MyPickler`` will by default share the private dispatch table. On the other hand, the code ::
uk: робить те саме, але всі екземпляри ``MyPickler`` за замовчуванням спільно використовуватимуть приватну таблицю відправлення. З іншого боку, код ::

source: modifies the global dispatch table shared by all users of the :mod:`copyreg` module.
uk: змінює глобальну таблицю відправлення, яку використовують усі користувачі модуля :mod:`copyreg`.

source: Handling Stateful Objects
uk: Обробка об'єктів із збереженням стану

source: A sample usage might be something like this::
uk: Зразок використання може бути приблизно таким:

source: Custom Reduction for Types, Functions, and Other Objects
uk: Спеціальне скорочення для типів, функцій та інших об’єктів

source: Sometimes, :attr:`~Pickler.dispatch_table` may not be flexible enough. In particular we may want to customize pickling based on another criterion than the object's type, or we may want to customize the pickling of functions and classes.
uk: Іноді :attr:`~Pickler.dispatch_table` може бути недостатньо гнучким. Зокрема, ми можемо захотіти налаштувати маринування на основі іншого критерію, ніж тип об’єкта, або ми можемо захотіти налаштувати маринування функцій і класів.

source: If both the :attr:`~Pickler.dispatch_table` and :meth:`~Pickler.reducer_override` are defined, then :meth:`~Pickler.reducer_override` method takes priority.
uk: Якщо визначено і :attr:`~Pickler.dispatch_table`, і :meth:`~Pickler.reducer_override`, то метод :meth:`~Pickler.reducer_override` має пріоритет.

source: For performance reasons, :meth:`~Pickler.reducer_override` may not be called for the following objects: ``None``, ``True``, ``False``, and exact instances of :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` and :class:`tuple`.
uk: З міркувань продуктивності :meth:`~Pickler.reducer_override` не можна викликати для таких об’єктів: ``None``, ``True``, ``False`` і точних екземплярів :class:`int` , :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` і :class:`tuple`.

source: Here is a simple example where we allow pickling and reconstructing a given class::
uk: Ось простий приклад, де ми дозволяємо маринувати та реконструювати заданий клас:
