Repository: python/python-docs-uk
Catalog: library/pickletools.po
Languages: uk

source: **Source code:** :source:`Lib/pickletools.py`
uk: **Вихідний код:** :source:`Lib/pickletools.py`

source: This module contains various constants relating to the intimate details of the :mod:`pickle` module, some lengthy comments about the implementation, and a few useful functions for analyzing pickled data. The contents of this module are useful for Python core developers who are working on the :mod:`pickle`; ordinary users of the :mod:`pickle` module probably won't find the :mod:`pickletools` module relevant.
uk: Цей модуль містить різні константи, що стосуються інтимних деталей модуля :mod:`pickle`, деякі розлогі коментарі щодо реалізації та кілька корисних функцій для аналізу маринованих даних. Вміст цього модуля корисний для розробників ядра Python, які працюють над :mod:`pickle`; звичайні користувачі модуля :mod:`pickle`, ймовірно, не знайдуть модуль :mod:`pickletools` доречним.

source: Command line usage
uk: Використання командного рядка

source: When invoked from the command line, ``python -m pickletools`` will disassemble the contents of one or more pickle files. Note that if you want to see the Python object stored in the pickle rather than the details of pickle format, you may want to use ``-m pickle`` instead. However, when the pickle file that you want to examine comes from an untrusted source, ``-m pickletools`` is a safer option because it does not execute pickle bytecode.
uk: При виклику з командного рядка ``python -m pickletools`` розбере вміст одного або кількох файлів pickle. Зауважте, що якщо ви хочете бачити об’єкт Python, який зберігається в pickle, а не деталі формату pickle, ви можете замість цього використовувати ``-m pickle``. Однак, якщо файл pickle, який ви хочете перевірити, походить із ненадійного джерела, ``-m pickletools`` є безпечнішим варіантом, оскільки він не виконує байт-код pickle.

source: For example, with a tuple ``(1, 2)`` pickled in file ``x.pickle``:
uk: Наприклад, з кортежем ``(1, 2)``, маринованим у файлі ``x.pickle``:

source: Command line options
uk: Параметри командного рядка

source: Annotate each line with a short opcode description.
uk: Додайте до кожного рядка короткий опис коду операції.

source: Name of a file where the output should be written.
uk: Ім'я файлу, куди слід записати вихідні дані.

source: The number of blanks by which to indent a new MARK level.
uk: Кількість пробілів, на які потрібно відступити новий рівень MARK.

source: When multiple objects are disassembled, preserve memo between disassemblies.
uk: Коли кілька об’єктів розібрано, зберігайте пам’ятку між розбираннями.

source: When more than one pickle file are specified, print given preamble before each disassembly.
uk: Якщо вказано більше одного файлу pickle, друкуйте надану преамбулу перед кожним розбиранням.

source: Programmatic Interface
uk: Програмний інтерфейс

source: Outputs a symbolic disassembly of the pickle to the file-like object *out*, defaulting to ``sys.stdout``. *pickle* can be a string or a file-like object. *memo* can be a Python dictionary that will be used as the pickle's memo; it can be used to perform disassemblies across multiple pickles created by the same pickler. Successive levels, indicated by ``MARK`` opcodes in the stream, are indented by *indentlevel* spaces. If a nonzero value is given to *annotate*, each opcode in the output is annotated with a short description. The value of *annotate* is used as a hint for the column where annotation should start.
uk: Виводить символічне розбирання pickle у файлоподібний об’єкт *out*, за умовчанням ``sys.stdout``. *pickle* може бути рядком або файлоподібним об’єктом. *memo* може бути словником Python, який використовуватиметься як пам’ятка pickle; його можна використовувати для розбирання кількох маринованих пікселів, створених одним піклером. Послідовні рівні, позначені кодами операцій ``MARK`` у потоці, відступають пробілами *indentlevel*. Якщо для *annotate* задано ненульове значення, кожен код операції у виведених даних анотується коротким описом. Значення *annotate* використовується як підказка для стовпця, з якого має починатися анотація.

source: Provides an :term:`iterator` over all of the opcodes in a pickle, returning a sequence of ``(opcode, arg, pos)`` triples. *opcode* is an instance of an :class:`OpcodeInfo` class; *arg* is the decoded value, as a Python object, of the opcode's argument; *pos* is the position at which this opcode is located. *pickle* can be a string or a file-like object.
uk: Надає :term:`iterator` для всіх кодів операцій у pickle, повертаючи послідовність ``(opcode, arg, pos)`` потрійок. *opcode* є екземпляром класу :class:`OpcodeInfo`; *arg* — це декодоване значення аргументу коду операції як об’єкт Python; *pos* - це позиція, у якій знаходиться цей код операції. *pickle* може бути рядком або файлоподібним об’єктом.

source: Returns a new equivalent pickle string after eliminating unused ``PUT`` opcodes. The optimized pickle is shorter, takes less transmission time, requires less storage space, and unpickles more efficiently.
uk: Повертає новий еквівалентний рядок pickle після видалення невикористаних кодів операцій ``PUT``. Оптимізоване маринування коротше, займає менше часу на передачу, вимагає менше місця для зберігання та ефективніше знімає травлення.
