Repository: python/python-docs-uk
Catalog: library/pickle.po
Languages: uk

source: **Source code:** :source:`Lib/pickle.py`
uk: **Вихідний код:** :source:`Lib/pickle.py`

source: The :mod:`pickle` module implements binary protocols for serializing and de-serializing a Python object structure. *"Pickling"* is the process whereby a Python object hierarchy is converted into a byte stream, and *"unpickling"* is the inverse operation, whereby a byte stream (from a :term:`binary file` or :term:`bytes-like object`) is converted back into an object hierarchy. Pickling (and unpickling) is alternatively known as "serialization", "marshalling," [#]_ or "flattening"; however, to avoid confusion, the terms used here are "pickling" and "unpickling".
uk: Модуль :mod:`pickle` реалізує двійкові протоколи для серіалізації та десеріалізації структури об’єктів Python. *"Pickling"* - це процес, за допомогою якого ієрархія об'єктів Python перетворюється на потік байтів, а *"unpickling"* - це зворотна операція, за допомогою якої потік байтів (з :term:`binary file` або :term:`bytes-like object`) перетворюється назад в ієрархію об’єктів. Травлення (і розбирання) також відоме як "серіалізація", "маршалінг", [#]_ або "зведення"; однак, щоб уникнути плутанини, тут використовуються терміни "маринування" та "розмаринування".

source: The ``pickle`` module **is not secure**. Only unpickle data you trust.
uk: Модуль ``pickle`` **не захищений**. Вилучайте лише дані, яким довіряєте.

source: It is possible to construct malicious pickle data which will **execute arbitrary code during unpickling**. Never unpickle data that could have come from an untrusted source, or that could have been tampered with.
uk: Можна створити шкідливі дані pickle, які **виконуватимуть довільний код під час unpickling**. Ніколи не видаляйте дані, які могли надійти з ненадійного джерела або які могли бути підроблені.

source: Consider signing data with :mod:`hmac` if you need to ensure that it has not been tampered with.
uk: Розгляньте можливість підписати дані за допомогою :mod:`hmac`, якщо вам потрібно переконатися, що вони не були змінені.

source: Safer serialization formats such as :mod:`json` may be more appropriate if you are processing untrusted data. See :ref:`comparison-with-json`.
uk: Більш безпечні формати серіалізації, такі як :mod:`json`, можуть бути більш доречними, якщо ви обробляєте ненадійні дані. Перегляньте :ref:`comparison-with-json`.

source: Relationship to other Python modules
uk: Зв'язок з іншими модулями Python

source: Comparison with ``marshal``
uk: Порівняння з ``маршалом``

source: Python has a more primitive serialization module called :mod:`marshal`, but in general :mod:`pickle` should always be the preferred way to serialize Python objects. :mod:`marshal` exists primarily to support Python's :file:`.pyc` files.
uk: Python має примітивніший модуль серіалізації під назвою :mod:`marshal`, але загалом :mod:`pickle` має завжди бути кращим способом серіалізації об’єктів Python. :mod:`marshal` існує в основному для підтримки файлів :file:`.pyc` Python.

source: The :mod:`pickle` module differs from :mod:`marshal` in several significant ways:
uk: Модуль :mod:`pickle` відрізняється від :mod:`marshal` кількома суттєвими ознаками:

source: The :mod:`pickle` module keeps track of the objects it has already serialized, so that later references to the same object won't be serialized again. :mod:`marshal` doesn't do this.
uk: Модуль :mod:`pickle` відстежує об’єкти, які він уже серіалізував, так що пізніші посилання на той самий об’єкт не будуть серіалізовані знову. :mod:`marshal` цього не робить.

source: This has implications both for recursive objects and object sharing. Recursive objects are objects that contain references to themselves. These are not handled by marshal, and in fact, attempting to marshal recursive objects will crash your Python interpreter. Object sharing happens when there are multiple references to the same object in different places in the object hierarchy being serialized. :mod:`pickle` stores such objects only once, and ensures that all other references point to the master copy. Shared objects remain shared, which can be very important for mutable objects.
uk: Це стосується як рекурсивних об’єктів, так і спільного використання об’єктів. Рекурсивні об'єкти - це об'єкти, які містять посилання на себе. Вони не обробляються маршалом, і фактично спроба маршалу рекурсивних об’єктів призведе до збою вашого інтерпретатора Python. Спільне використання об’єктів відбувається, коли існує кілька посилань на той самий об’єкт у різних місцях ієрархії об’єктів, що серіалізується. :mod:`pickle` зберігає такі об’єкти лише один раз і гарантує, що всі інші посилання вказують на головну копію. Спільні об’єкти залишаються спільними, що може бути дуже важливим для змінних об’єктів.

source: :mod:`marshal` cannot be used to serialize user-defined classes and their instances. :mod:`pickle` can save and restore class instances transparently, however the class definition must be importable and live in the same module as when the object was stored.
uk: :mod:`marshal` не можна використовувати для серіалізації визначених користувачем класів та їх екземплярів. :mod:`pickle` може прозоро зберігати та відновлювати екземпляри класу, однак визначення класу має бути імпортованим і знаходитись у тому самому модулі, що й під час зберігання об’єкта.

source: The :mod:`marshal` serialization format is not guaranteed to be portable across Python versions. Because its primary job in life is to support :file:`.pyc` files, the Python implementers reserve the right to change the serialization format in non-backwards compatible ways should the need arise. The :mod:`pickle` serialization format is guaranteed to be backwards compatible across Python releases provided a compatible pickle protocol is chosen and pickling and unpickling code deals with Python 2 to Python 3 type differences if your data is crossing that unique breaking change language boundary.
uk: Формат серіалізації :mod:`marshal` не гарантовано переноситься між версіями Python. Оскільки основним завданням у житті є підтримка файлів :file:`.pyc`, розробники Python залишають за собою право змінювати формат серіалізації несумісними способами, якщо виникне така потреба. Формат серіалізації :mod:`pickle` гарантовано буде зворотно сумісним з усіма випусками Python за умови, що вибрано сумісний протокол pickle, а код піклування та депіклування враховує відмінності типів Python 2 і Python 3, якщо ваші дані перетинають цю унікальну межу мови зміни порушення. .

source: Comparison with ``json``
uk: Порівняння з ``json``

source: JSON is a text serialization format (it outputs unicode text, although most of the time it is then encoded to ``utf-8``), while pickle is a binary serialization format;
uk: JSON — це формат текстової серіалізації (він виводить текст Юнікод, хоча здебільшого він потім кодується у ``utf-8``), тоді як pickle — це двійковий формат серіалізації;

source: JSON is human-readable, while pickle is not;
uk: JSON читається людиною, а pickle – ні;

source: JSON is interoperable and widely used outside of the Python ecosystem, while pickle is Python-specific;
uk: JSON є сумісним і широко використовується за межами екосистеми Python, тоді як pickle є специфічним для Python;

source: JSON, by default, can only represent a subset of the Python built-in types, and no custom classes; pickle can represent an extremely large number of Python types (many of them automatically, by clever usage of Python's introspection facilities; complex cases can be tackled by implementing :ref:`specific object APIs <pickle-inst>`);
uk: За замовчуванням JSON може представляти лише підмножину вбудованих типів Python, а не спеціальні класи; pickle може представляти надзвичайно велику кількість типів Python (багато з них автоматично, завдяки розумному використанню можливостей інтроспекції Python; складні випадки можна вирішити шляхом впровадження :ref:`спеціальних API об’єктів <pickle-inst>`);

source: Unlike pickle, deserializing untrusted JSON does not in itself create an arbitrary code execution vulnerability.
uk: На відміну від pickle, десеріалізація ненадійного JSON сама по собі не створює вразливості виконання довільного коду.

source: The :mod:`json` module: a standard library module allowing JSON serialization and deserialization.
uk: Модуль :mod:`json`: стандартний бібліотечний модуль, який дозволяє серіалізацію та десеріалізацію JSON.

source: Data stream format
uk: Формат потоку даних

source: By default, the :mod:`pickle` data format uses a relatively compact binary representation. If you need optimal size characteristics, you can efficiently :doc:`compress <archiving>` pickled data.
uk: За замовчуванням формат даних :mod:`pickle` використовує відносно компактне двійкове представлення. Якщо вам потрібні оптимальні характеристики розміру, ви можете ефективно :doc:`стиснути <archiving>` мариновані дані.

source: The module :mod:`pickletools` contains tools for analyzing data streams generated by :mod:`pickle`. :mod:`pickletools` source code has extensive comments about opcodes used by pickle protocols.
uk: Модуль :mod:`pickletools` містить інструменти для аналізу потоків даних, згенерованих :mod:`pickle`. Вихідний код :mod:`pickletools` містить численні коментарі щодо кодів операцій, які використовуються протоколами pickle.

source: There are currently 6 different protocols which can be used for pickling. The higher the protocol used, the more recent the version of Python needed to read the pickle produced.
uk: На даний момент існує 6 різних протоколів, які можна використовувати для маринування. Чим вищий протокол використовується, тим новіша версія Python потрібна для читання створеного пікле.

source: Protocol version 0 is the original "human-readable" protocol and is backwards compatible with earlier versions of Python.
uk: Протокол версії 0 — це оригінальний "людиночитаний" протокол, який зворотно сумісний із попередніми версіями Python.

source: Protocol version 1 is an old binary format which is also compatible with earlier versions of Python.
uk: Протокол версії 1 — це старий двійковий формат, який також сумісний із попередніми версіями Python.

source: Protocol version 2 was introduced in Python 2.3. It provides much more efficient pickling of :term:`new-style classes <new-style class>`. Refer to :pep:`307` for information about improvements brought by protocol 2.
uk: Протокол версії 2 був представлений у Python 2.3. Він забезпечує набагато ефективніше маринування :term:`класів нового стилю <new-style class>`. Зверніться до :pep:`307`, щоб отримати інформацію про покращення, внесені протоколом 2.

source: Protocol version 3 was added in Python 3.0. It has explicit support for :class:`bytes` objects and cannot be unpickled by Python 2.x. This was the default protocol in Python 3.0--3.7.
uk: Протокол версії 3 додано в Python 3.0. Він має явну підтримку об’єктів :class:`bytes` і не може бути скасований Python 2.x. Це був протокол за замовчуванням у Python 3.0-3.7.

source: Protocol version 4 was added in Python 3.4. It adds support for very large objects, pickling more kinds of objects, and some data format optimizations. It is the default protocol starting with Python 3.8. Refer to :pep:`3154` for information about improvements brought by protocol 4.
uk: Протокол версії 4 додано в Python 3.4. Він додає підтримку для дуже великих об’єктів, маринування більшої кількості типів об’єктів і деяку оптимізацію формату даних. Це стандартний протокол, починаючи з Python 3.8. Зверніться до :pep:`3154` для отримання інформації про покращення, внесені протоколом 4.

source: Protocol version 5 was added in Python 3.8. It adds support for out-of-band data and speedup for in-band data. Refer to :pep:`574` for information about improvements brought by protocol 5.
uk: Протокол версії 5 додано в Python 3.8. Він додає підтримку позасмугових даних і прискорення для внутрішньосмугових даних. Зверніться до :pep:`574` для отримання інформації про покращення, внесені протоколом 5.

source: Serialization is a more primitive notion than persistence; although :mod:`pickle` reads and writes file objects, it does not handle the issue of naming persistent objects, nor the (even more complicated) issue of concurrent access to persistent objects. The :mod:`pickle` module can transform a complex object into a byte stream and it can transform the byte stream into an object with the same internal structure. Perhaps the most obvious thing to do with these byte streams is to write them onto a file, but it is also conceivable to send them across a network or store them in a database. The :mod:`shelve` module provides a simple interface to pickle and unpickle objects on DBM-style database files.
uk: Серіалізація є більш примітивним поняттям, ніж стійкість; хоча :mod:`pickle` читає та записує файлові об’єкти, він не вирішує проблему іменування постійних об’єктів, ані (навіть більш складну) проблему одночасного доступу до постійних об’єктів. Модуль :mod:`pickle` може перетворити складний об’єкт у потік байтів, і він може перетворити потік байтів в об’єкт із такою ж внутрішньою структурою. Мабуть, найочевидніша річ, яку можна зробити з цими потоками байтів, — це записати їх у файл, але також можливо надіслати їх через мережу або зберегти в базі даних. Модуль :mod:`shelve` забезпечує простий інтерфейс для вибору та вилучення об’єктів у файлах бази даних у стилі DBM.

source: Module Interface
uk: Інтерфейс модуля

source: To serialize an object hierarchy, you simply call the :func:`dumps` function. Similarly, to de-serialize a data stream, you call the :func:`loads` function. However, if you want more control over serialization and de-serialization, you can create a :class:`Pickler` or an :class:`Unpickler` object, respectively.
uk: Щоб серіалізувати ієрархію об’єктів, ви просто викликаєте функцію :func:`dumps`. Так само, щоб десеріалізувати потік даних, ви викликаєте функцію :func:`loads`. Однак, якщо ви хочете більше контролювати серіалізацію та десеріалізацію, ви можете створити об’єкт :class:`Pickler` або :class:`Unpickler` відповідно.

source: The :mod:`pickle` module provides the following constants:
uk: Модуль :mod:`pickle` надає такі константи:

source: An integer, the highest :ref:`protocol version <pickle-protocols>` available. This value can be passed as a *protocol* value to functions :func:`dump` and :func:`dumps` as well as the :class:`Pickler` constructor.
uk: Ціле число, найвища доступна :ref:`версія протоколу <pickle-protocols>`. Це значення можна передати як значення *protocol* до функцій :func:`dump` і :func:`dumps`, а також до конструктора :class:`Pickler`.

source: An integer, the default :ref:`protocol version <pickle-protocols>` used for pickling. May be less than :data:`HIGHEST_PROTOCOL`. Currently the default protocol is 4, first introduced in Python 3.4 and incompatible with previous versions.
uk: Ціле число, стандартна :ref:`версія протоколу <pickle-protocols>`, що використовується для травлення. Може бути менше ніж :data:`HIGHEST_PROTOCOL`. Наразі стандартним протоколом є 4, вперше представлений у Python 3.4 і несумісний із попередніми версіями.

source: The default protocol is 3.
uk: Стандартний протокол – 3.

source: The default protocol is 4.
uk: Стандартний протокол – 4.

source: The :mod:`pickle` module provides the following functions to make the pickling process more convenient:
uk: Модуль :mod:`pickle` надає такі функції, щоб зробити процес маринування зручнішим:

source: Write the pickled representation of the object *obj* to the open :term:`file object` *file*. This is equivalent to ``Pickler(file, protocol).dump(obj)``.
uk: Запишіть виділене представлення об’єкта *obj* у відкритий :term:`file object` *file*. Це еквівалентно ``Pickler(file, protocol).dump(obj)``.

source: Arguments *file*, *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
uk: Аргументи *file*, *protocol*, *fix_imports* і *buffer_callback* мають те саме значення, що й у конструкторі :class:`Pickler`.

source: The *buffer_callback* argument was added.
uk: Додано аргумент *buffer_callback*.

source: Return the pickled representation of the object *obj* as a :class:`bytes` object, instead of writing it to a file.
uk: Повернути відібране представлення об’єкта *obj* як об’єкт :class:`bytes` замість запису його у файл.

source: Arguments *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
uk: Аргументи *protocol*, *fix_imports* і *buffer_callback* мають те саме значення, що й у конструкторі :class:`Pickler`.

source: Read the pickled representation of an object from the open :term:`file object` *file* and return the reconstituted object hierarchy specified therein. This is equivalent to ``Unpickler(file).load()``.
uk: Зчитувати виділене представлення об’єкта з відкритого :term:`file object` *file* і повертати відновлену ієрархію об’єктів, указану в ньому. Це еквівалентно ``Unpickler(file).load()``.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed. Bytes past the pickled representation of the object are ignored.
uk: Версія протоколу pickle визначається автоматично, тому аргумент протоколу не потрібен. Байти, що перебувають після виділеного представлення об’єкта, ігноруються.

source: Arguments *file*, *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
uk: Аргументи *file*, *fix_imports*, *encoding*, *errors*, *strict* і *buffers* мають те саме значення, що й у конструкторі :class:`Unpickler`.

source: The *buffers* argument was added.
uk: Додано аргумент *buffers*.

source: Return the reconstituted object hierarchy of the pickled representation *data* of an object. *data* must be a :term:`bytes-like object`.
uk: Повертає відновлену ієрархію об’єктів маринованого представлення *даних* об’єкта. *data* має бути :term:`bytes-like object`.

source: Arguments *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
uk: Аргументи *fix_imports*, *encoding*, *errors*, *strict* і *buffers* мають те саме значення, що й у конструкторі :class:`Unpickler`.

source: The :mod:`pickle` module defines three exceptions:
uk: Модуль :mod:`pickle` визначає три винятки:

source: Refer to :ref:`pickle-picklable` to learn what kinds of objects can be pickled.
uk: Зверніться до :ref:`pickle-picklable`, щоб дізнатися, які види об’єктів можна маринувати.

source: Note that other exceptions may also be raised during unpickling, including (but not necessarily limited to) AttributeError, EOFError, ImportError, and IndexError.
uk: Зауважте, що інші винятки також можуть виникати під час видалення, включаючи (але не обов’язково обмежуючись ними) AttributeError, EOFError, ImportError та IndexError.

source: The :mod:`pickle` module exports three classes, :class:`Pickler`, :class:`Unpickler` and :class:`PickleBuffer`:
uk: Модуль :mod:`pickle` експортує три класи, :class:`Pickler`, :class:`Unpickler` і :class:`PickleBuffer`:

source: This takes a binary file for writing a pickle data stream.
uk: Це бере двійковий файл для запису потоку даних pickle.

source: The optional *protocol* argument, an integer, tells the pickler to use the given protocol; supported protocols are 0 to :data:`HIGHEST_PROTOCOL`. If not specified, the default is :data:`DEFAULT_PROTOCOL`. If a negative number is specified, :data:`HIGHEST_PROTOCOL` is selected.
uk: Необов’язковий аргумент *protocol*, ціле число, повідомляє піклеру використовувати заданий протокол; підтримувані протоколи від 0 до :data:`HIGHEST_PROTOCOL`. Якщо не вказано, типовим є :data:`DEFAULT_PROTOCOL`. Якщо вказано від’ємне число, вибирається :data:`HIGHEST_PROTOCOL`.

source: The *file* argument must have a write() method that accepts a single bytes argument. It can thus be an on-disk file opened for binary writing, an :class:`io.BytesIO` instance, or any other custom object that meets this interface.
uk: Аргумент *file* повинен мати метод write(), який приймає однобайтовий аргумент. Таким чином, це може бути файл на диску, відкритий для двійкового запису, екземпляр :class:`io.BytesIO` або будь-який інший спеціальний об’єкт, який відповідає цьому інтерфейсу.

source: If *fix_imports* is true and *protocol* is less than 3, pickle will try to map the new Python 3 names to the old module names used in Python 2, so that the pickle data stream is readable with Python 2.
uk: Якщо *fix_imports* має значення true, а *protocol* — менше 3, pickle спробує зіставити нові імена Python 3 зі старими назвами модулів, які використовуються в Python 2, щоб потік даних pickle можна було читати за допомогою Python 2.

source: Write the pickled representation of *obj* to the open file object given in the constructor.
uk: Запишіть виділене представлення *obj* до відкритого файлового об’єкта, наданого в конструкторі.

source: Do nothing by default. This exists so a subclass can override it.
uk: За замовчуванням нічого не робити. Це існує, тому підклас може замінити його.

source: If :meth:`persistent_id` returns ``None``, *obj* is pickled as usual. Any other value causes :class:`Pickler` to emit the returned value as a persistent ID for *obj*. The meaning of this persistent ID should be defined by :meth:`Unpickler.persistent_load`. Note that the value returned by :meth:`persistent_id` cannot itself have a persistent ID.
uk: Якщо :meth:`persistent_id` повертає ``None``, *obj* маринується як зазвичай. Будь-яке інше значення змушує :class:`Pickler` видати повернуте значення як постійний ідентифікатор для *obj*. Значення цього постійного ідентифікатора має бути визначено :meth:`Unpickler.persistent_load`. Зауважте, що значення, яке повертає :meth:`persistent_id`, не може мати постійний ідентифікатор.

source: See :ref:`pickle-persistent` for details and examples of uses.
uk: Перегляньте :ref:`pickle-persistent` для деталей та прикладів використання.

source: By default, a pickler object will not have a :attr:`dispatch_table` attribute, and it will instead use the global dispatch table managed by the :mod:`copyreg` module. However, to customize the pickling for a specific pickler object one can set the :attr:`dispatch_table` attribute to a dict-like object. Alternatively, if a subclass of :class:`Pickler` has a :attr:`dispatch_table` attribute then this will be used as the default dispatch table for instances of that class.
uk: За замовчуванням об’єкт pickler не матиме атрибута :attr:`dispatch_table`, натомість він використовуватиме глобальну таблицю відправлення, якою керує модуль :mod:`copyreg`. Однак, щоб налаштувати травлення для певного об’єкта піклеру, можна встановити атрибут :attr:`dispatch_table` на об’єкт, подібний до dict. Крім того, якщо підклас :class:`Pickler` має атрибут :attr:`dispatch_table`, тоді він використовуватиметься як типова таблиця відправлення для екземплярів цього класу.

source: See :ref:`pickle-dispatch` for usage examples.
uk: Перегляньте :ref:`pickle-dispatch` приклади використання.

source: For a detailed example, see :ref:`reducer_override`.
uk: Детальний приклад див. :ref:`reducer_override`.

source: Deprecated. Enable fast mode if set to a true value. The fast mode disables the usage of memo, therefore speeding the pickling process by not generating superfluous PUT opcodes. It should not be used with self-referential objects, doing otherwise will cause :class:`Pickler` to recurse infinitely.
uk: Застаріле. Увімкнути швидкий режим, якщо встановлено справжнє значення. Швидкий режим вимикає використання memo, таким чином прискорюючи процес маринування, не генеруючи зайвих кодів операцій PUT. Його не слід використовувати з об’єктами, що посилаються на себе, інакше призведе до безкінечної рекурсії :class:`Pickler`.
