Repository: python/python-docs-uk
Catalog: library/pipes.po
Languages: uk

source: :mod:`pipes` --- Interface to shell pipelines
uk: :mod:`pipes` --- Інтерфейс до конвеєрів оболонки

source: **Source code:** :source:`Lib/pipes.py`
uk: **Вихідний код:** :source:`Lib/pipes.py`

source: The :mod:`pipes` module is deprecated (see :pep:`PEP 594 <594#pipes>` for details). Please use the :mod:`subprocess` module instead.
uk: Модуль :mod:`pipes` є застарілим (докладніше див. :pep:`PEP 594 <594#pipes>`). Натомість використовуйте модуль :mod:`subprocess`.

source: The :mod:`pipes` module defines a class to abstract the concept of a *pipeline* --- a sequence of converters from one file to another.
uk: Модуль :mod:`pipes` визначає клас для абстрагування концепції *конвеєра* --- послідовності конвертерів з одного файлу в інший.

source: Because the module uses :program:`/bin/sh` command lines, a POSIX or compatible shell for :func:`os.system` and :func:`os.popen` is required.
uk: Оскільки модуль використовує командні рядки :program:`/bin/sh`, потрібна POSIX або сумісна оболонка для :func:`os.system` і :func:`os.popen`.

source: :ref:`Availability <availability>`: Unix. Not available on VxWorks.
uk: :ref:`Наявність <availability>`: Unix. Недоступно на VxWorks.

source: The :mod:`pipes` module defines the following class:
uk: Модуль :mod:`pipes` визначає такий клас:

source: An abstraction of a pipeline.
uk: Абстракція трубопроводу.

source: Example::
uk: Приклад::

source: Template Objects
uk: Об'єкти шаблону

source: Template objects following methods:
uk: Об'єкти шаблону наступні методи:

source: Restore a pipeline template to its initial state.
uk: Відновлення шаблону конвеєра до початкового стану.

source: Return a new, equivalent, pipeline template.
uk: Поверніть новий еквівалентний шаблон конвеєра.

source: If *flag* is true, turn debugging on. Otherwise, turn debugging off. When debugging is on, commands to be executed are printed, and the shell is given ``set -x`` command to be more verbose.
uk: Якщо *flag* має значення true, увімкніть налагодження. В іншому випадку вимкніть налагодження. Коли налагодження ввімкнено, команди, які потрібно виконати, друкуються, а оболонкі надається команда ``set -x``, щоб бути більш детальною.

source: Append a new action at the end. The *cmd* variable must be a valid bourne shell command. The *kind* variable consists of two letters.
uk: Додайте нову дію в кінці. Змінна *cmd* має бути дійсною командою оболонки bourne. Змінна *kind* складається з двох літер.

source: The first letter can be either of ``'-'`` (which means the command reads its standard input), ``'f'`` (which means the commands reads a given file on the command line) or ``'.'`` (which means the commands reads no input, and hence must be first.)
uk: Першою літерою може бути ``'-'`` (що означає, що команда читає стандартний ввід), ``'f'`` (що означає, що команда читає заданий файл у командному рядку) або ``' .''`` (це означає, що команди не читають введених даних, а отже, мають бути першими.)

source: Similarly, the second letter can be either of ``'-'`` (which means the command writes to standard output), ``'f'`` (which means the command writes a file on the command line) or ``'.'`` (which means the command does not write anything, and hence must be last.)
uk: Подібним чином друга літера може мати значення ``'-'`` (що означає, що команда записує в стандартний вивід), ``'f'`` (що означає, що команда записує файл у командний рядок) або ``'.'`` (що означає, що команда нічого не записує, тому має бути останньою.)

source: Add a new action at the beginning. See :meth:`append` for explanations of the arguments.
uk: Додайте нову дію на початку. Перегляньте :meth:`append` для пояснення аргументів.

source: Return a file-like object, open to *file*, but read from or written to by the pipeline. Note that only one of ``'r'``, ``'w'`` may be given.
uk: Повертає файлоподібний об’єкт, відкритий у *file*, але зчитований або записаний конвеєром. Зауважте, що можна вказати лише одне з ``'r'``, ``'w'``.

source: Copy *infile* to *outfile* through the pipe.
uk: Скопіюйте *infile* до *outfile* через канал.
