Repository: python/python-docs-uk
Catalog: library/pkgutil.po
Languages: uk

source: **Source code:** :source:`Lib/pkgutil.py`
uk: **Вихідний код:** :source:`Lib/pkgutil.py`

source: This module provides utilities for the import system, in particular package support.
uk: Цей модуль надає утиліти для системи імпорту, зокрема підтримку пакетів.

source: A namedtuple that holds a brief summary of a module's info.
uk: Іменований кортеж, який містить короткий опис інформації про модуль.

source: Extend the search path for the modules which comprise a package. Intended use is to place the following code in a package's :file:`__init__.py`::
uk: Розширте шлях пошуку для модулів, які складають пакет. Цільове використання – розмістити наступний код у :file:`__init__.py`::

source: If the input path is not a list (as is the case for frozen packages) it is returned unchanged. The input path is not modified; an extended copy is returned. Items are only appended to the copy at the end.
uk: Якщо шлях введення не є списком (як у випадку заморожених пакунків), він повертається без змін. Вхідний шлях не змінено; повертається розширена копія. Елементи додаються до копії лише в кінці.

source: It is assumed that :data:`sys.path` is a sequence. Items of :data:`sys.path` that are not strings referring to existing directories are ignored. Unicode items on :data:`sys.path` that cause errors when used as filenames may cause this function to raise an exception (in line with :func:`os.path.isdir` behavior).
uk: Передбачається, що :data:`sys.path` є послідовністю. Елементи :data:`sys.path`, які не є рядками, що посилаються на існуючі каталоги, ігноруються. Елементи Юнікоду в :data:`sys.path`, які спричиняють помилки, коли використовуються як імена файлів, можуть викликати виняток у цій функції (відповідно до поведінки :func:`os.path.isdir`).

source: Retrieve a module :term:`loader` for the given *fullname*.
uk: Отримати модуль :term:`loader` для вказаного *повного імені*.

source: Updated to be based directly on :mod:`importlib` rather than relying on the package internal :pep:`302` import emulation.
uk: Оновлено, щоб базуватися безпосередньо на :mod:`importlib`, а не на внутрішній емуляції імпорту :pep:`302` пакета.

source: Updated to be based on :pep:`451`
uk: Оновлено на основі :pep:`451`

source: Use :func:`importlib.util.find_spec` instead.
uk: Натомість використовуйте :func:`importlib.util.find_spec`.

source: Retrieve a :term:`finder` for the given *path_item*.
uk: Отримати :term:`finder` для заданого *path_item*.

source: The returned finder is cached in :data:`sys.path_importer_cache` if it was newly created by a path hook.
uk: Повернений засіб пошуку зберігається в :data:`sys.path_importer_cache`, якщо він був щойно створений за допомогою перехоплювача шляху.

source: The cache (or part of it) can be cleared manually if a rescan of :data:`sys.path_hooks` is necessary.
uk: Кеш (або його частину) можна очистити вручну, якщо потрібно повторне сканування :data:`sys.path_hooks`.

source: Get a :term:`loader` object for *module_or_name*.
uk: Отримайте об’єкт :term:`loader` для *module_or_name*.

source: If the module or package is accessible via the normal import mechanism, a wrapper around the relevant part of that machinery is returned. Returns ``None`` if the module cannot be found or imported. If the named module is not already imported, its containing package (if any) is imported, in order to establish the package ``__path__``.
uk: Якщо модуль або пакет доступні через звичайний механізм імпорту, повертається обгортка навколо відповідної частини цього механізму. Повертає ``None``, якщо модуль неможливо знайти або імпортувати. Якщо вказаний модуль ще не імпортовано, його пакет (якщо є) імпортується, щоб створити пакет ``__path__``.

source: Yield :term:`finder` objects for the given module name.
uk: Видає об’єкти :term:`finder` для вказаного імені модуля.

source: If fullname contains a ``'.'``, the finders will be for the package containing fullname, otherwise they will be all registered top level finders (i.e. those on both :data:`sys.meta_path` and :data:`sys.path_hooks`).
uk: Якщо повне ім’я містить ``'.'``, the finders will be for the package containing fullname, otherwise they will be all registered top level finders (i.e. those on both :data:`sys.meta_path` and :data:`sys.path_hooks`).

source: If the named module is in a package, that package is imported as a side effect of invoking this function.
uk: Якщо вказаний модуль міститься в пакеті, цей пакет імпортується як побічний ефект виклику цієї функції.

source: If no module name is specified, all top level finders are produced.
uk: Якщо ім’я модуля не вказано, створюються всі шукачі верхнього рівня.

source: Yields :class:`ModuleInfo` for all submodules on *path*, or, if *path* is ``None``, all top-level modules on :data:`sys.path`.
uk: Видає :class:`ModuleInfo` для всіх підмодулів на *path* або, якщо *path* має значення ``None``, усі модулі верхнього рівня на :data:`sys.path`.

source: *path* should be either ``None`` or a list of paths to look for modules in.
uk: *path* має бути або ``None``, або список шляхів для пошуку модулів.

source: *prefix* is a string to output on the front of every module name on output.
uk: *префікс* — це рядок, який виводиться на початку кожного імені модуля при виведенні.

source: Only works for a :term:`finder` which defines an ``iter_modules()`` method. This interface is non-standard, so the module also provides implementations for :class:`importlib.machinery.FileFinder` and :class:`zipimport.zipimporter`.
uk: Працює лише для :term:`finder`, який визначає метод ``iter_modules()``. Цей інтерфейс є нестандартним, тому модуль також забезпечує реалізації для :class:`importlib.machinery.FileFinder` і :class:`zipimport.zipimporter`.

source: Yields :class:`ModuleInfo` for all modules recursively on *path*, or, if *path* is ``None``, all accessible modules.
uk: Видає :class:`ModuleInfo` для всіх модулів рекурсивно за *шляхом* або, якщо *шлях* має значення ``None``, усі доступні модулі.

source: Note that this function must import all *packages* (*not* all modules!) on the given *path*, in order to access the ``__path__`` attribute to find submodules.
uk: Зауважте, що ця функція має імпортувати всі *пакети* (*не* всі модулі!) за вказаним *шляхом*, щоб отримати доступ до атрибута ``__path__`` для пошуку підмодулів.

source: *onerror* is a function which gets called with one argument (the name of the package which was being imported) if any exception occurs while trying to import a package. If no *onerror* function is supplied, :exc:`ImportError`\s are caught and ignored, while all other exceptions are propagated, terminating the search.
uk: *onerror* — це функція, яка викликається з одним аргументом (назва пакета, який імпортувався), якщо під час спроби імпортувати пакет виникає будь-яка виняткова ситуація. Якщо функція *onerror* не надається, :exc:`ImportError`\s перехоплюються та ігноруються, тоді як усі інші винятки поширюються, припиняючи пошук.

source: Examples::
uk: Приклади::

source: Get a resource from a package.
uk: Отримати ресурс із пакету.

source: This is a wrapper for the :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>` API. The *package* argument should be the name of a package, in standard module format (``foo.bar``). The *resource* argument should be in the form of a relative filename, using ``/`` as the path separator. The parent directory name ``..`` is not allowed, and nor is a rooted name (starting with a ``/``).
uk: Це оболонка для API :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>`. Аргумент *package* має бути назвою пакета в стандартному форматі модуля (``foo.bar``). Аргумент *resource* має бути у формі відносного імені файлу, використовуючи ``/`` як роздільник шляху. Ім’я батьківського каталогу ``..`` не допускається, а також коренева назва (починається з ``/``).

source: The function returns a binary string that is the contents of the specified resource.
uk: Функція повертає двійковий рядок, який є вмістом зазначеного ресурсу.

source: For packages located in the filesystem, which have already been imported, this is the rough equivalent of::
uk: Для пакетів, розташованих у файловій системі, які вже були імпортовані, це приблизний еквівалент::

source: If the package cannot be located or loaded, or it uses a :term:`loader` which does not support :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, then ``None`` is returned. In particular, the :term:`loader` for :term:`namespace packages <namespace package>` does not support :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.
uk: Якщо пакет не вдається знайти або завантажити, або він використовує :term:`loader`, який не підтримує :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, повертається ``None``. Зокрема, :term:`loader` для :term:`пакетів простору імен <namespace package>` не підтримує :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.

source: Resolve a name to an object.
uk: Розв’яжіть ім’я з об’єктом.

source: This functionality is used in numerous places in the standard library (see :issue:`12915`) - and equivalent functionality is also in widely used third-party packages such as setuptools, Django and Pyramid.
uk: Ця функціональність використовується в багатьох місцях у стандартній бібліотеці (див. :issue:`12915`), а еквівалентна функціональність також є в широко використовуваних пакетах сторонніх розробників, таких як setuptools, Django та Pyramid.

source: It is expected that *name* will be a string in one of the following formats, where W is shorthand for a valid Python identifier and dot stands for a literal period in these pseudo-regexes:
uk: Очікується, що *ім’я* буде рядком в одному з таких форматів, де W є скороченням дійсного ідентифікатора Python, а крапка означає крапку в цих псевдорегулярних виразах:

source: The first form is intended for backward compatibility only. It assumes that some part of the dotted name is a package, and the rest is an object somewhere within that package, possibly nested inside other objects. Because the place where the package stops and the object hierarchy starts can't be inferred by inspection, repeated attempts to import must be done with this form.
uk: Перша форма призначена лише для зворотної сумісності. Припускається, що деяка частина назви з крапками є пакетом, а решта є об’єктом десь у цьому пакеті, можливо, вкладеним в інші об’єкти. Оскільки місце, де зупиняється пакет і починається ієрархія об’єктів, не може бути встановлено шляхом перевірки, повторні спроби імпорту потрібно робити за допомогою цієї форми.

source: In the second form, the caller makes the division point clear through the provision of a single colon: the dotted name to the left of the colon is a package to be imported, and the dotted name to the right is the object hierarchy within that package. Only one import is needed in this form. If it ends with the colon, then a module object is returned.
uk: У другій формі абонент чітко пояснює точку розділення за допомогою однієї двокрапки: назва з крапками ліворуч від двокрапки означає пакет, який потрібно імпортувати, а назва з крапками праворуч — це ієрархія об’єктів у цьому пакеті. . У цій формі потрібен лише один імпорт. Якщо він закінчується двокрапкою, повертається об’єкт модуля.

source: The function will return an object (which might be a module), or raise one of the following exceptions:
uk: Функція поверне об’єкт (який може бути модулем) або викличе одне з таких винятків:

source: :exc:`ValueError` -- if *name* isn't in a recognised format.
uk: :exc:`ValueError` -- якщо *ім'я* не в розпізнаному форматі.

source: :exc:`ImportError` -- if an import failed when it shouldn't have.
uk: :exc:`ImportError` -- якщо імпорт не вдався, а не мав бути.

source: :exc:`AttributeError` -- If a failure occurred when traversing the object hierarchy within the imported package to get to the desired object.
uk: :exc:`AttributeError` -- Якщо сталася помилка під час проходження ієрархії об’єктів в імпортованому пакеті, щоб дістатися до потрібного об’єкта.
