Repository: python/python-docs-uk
Catalog: library/plistlib.po
Languages: uk

source: **Source code:** :source:`Lib/plistlib.py`
uk: **Вихідний код:** :source:`Lib/plistlib.py`

source: This module provides an interface for reading and writing the "property list" files used by Apple, primarily on macOS and iOS. This module supports both binary and XML plist files.
uk: Цей модуль надає інтерфейс для читання та запису файлів "списку властивостей", які використовуються Apple, переважно в macOS та iOS. Цей модуль підтримує двійкові та XML-файли plist.

source: The property list (``.plist``) file format is a simple serialization supporting basic object types, like dictionaries, lists, numbers and strings. Usually the top level object is a dictionary.
uk: Формат файлу списку властивостей (``.plist``) — це проста серіалізація, яка підтримує базові типи об’єктів, як-от словники, списки, числа та рядки. Зазвичай об'єктом верхнього рівня є словник.

source: To write out and to parse a plist file, use the :func:`dump` and :func:`load` functions.
uk: Щоб вивести та проаналізувати файл plist, використовуйте функції :func:`dump` і :func:`load`.

source: Values can be strings, integers, floats, booleans, tuples, lists, dictionaries (but only with string keys), :class:`bytes`, :class:`bytearray` or :class:`datetime.datetime` objects.
uk: Значеннями можуть бути рядки, цілі числа, числа з плаваючою точкою, логічні значення, кортежі, списки, словники (але лише з рядковими ключами), об’єкти :class:`bytes`, :class:`bytearray` або :class:`datetime.datetime`.

source: New API, old API deprecated. Support for binary format plists added.
uk: Новий API, старий API застарів. Додано підтримку бінарних форматів plists.

source: Support added for reading and writing :class:`UID` tokens in binary plists as used by NSKeyedArchiver and NSKeyedUnarchiver.
uk: Додано підтримку для читання та запису токенів :class:`UID` у бінарних списках, що використовуються NSKeyedArchiver і NSKeyedUnarchiver.

source: Old API removed.
uk: Старий API видалено.

source: Apple's documentation of the file format.
uk: Документація Apple про формат файлу.

source: This module defines the following functions:
uk: Цей модуль визначає такі функції:

source: Read a plist file. *fp* should be a readable and binary file object. Return the unpacked root object (which usually is a dictionary).
uk: Прочитайте файл plist. *fp* має бути читабельним і двійковим файловим об’єктом. Повертає розпакований кореневий об’єкт (який зазвичай є словником).

source: The *fmt* is the format of the file and the following values are valid:
uk: *fmt* — це формат файлу, і такі значення є дійсними:

source: :data:`None`: Autodetect the file format
uk: :data:`None`: Автоматичне визначення формату файлу

source: :data:`FMT_XML`: XML file format
uk: :data:`FMT_XML`: формат файлу XML

source: :data:`FMT_BINARY`: Binary plist format
uk: :data:`FMT_BINARY`: двійковий формат plist

source: The *dict_type* is the type used for dictionaries that are read from the plist file.
uk: *dict_type* — це тип, який використовується для словників, які читаються з файлу plist.

source: XML data for the :data:`FMT_XML` format is parsed using the Expat parser from :mod:`xml.parsers.expat` -- see its documentation for possible exceptions on ill-formed XML. Unknown elements will simply be ignored by the plist parser.
uk: XML-дані для формату :data:`FMT_XML` аналізуються за допомогою синтаксичного аналізатора Expat із :mod:`xml.parsers.expat` — перегляньте його документацію щодо можливих винятків щодо неправильно сформованого XML. Невідомі елементи просто ігноруватимуться аналізатором plist.

source: The parser for the binary format raises :exc:`InvalidFileException` when the file cannot be parsed.
uk: Синтаксичний аналізатор двійкового формату викликає :exc:`InvalidFileException`, коли файл не може бути проаналізований.

source: Write *value* to a plist file. *Fp* should be a writable, binary file object.
uk: Запишіть *значення* у файл plist. *Fp* має бути доступним для запису двійковим файловим об’єктом.

source: The *fmt* argument specifies the format of the plist file and can be one of the following values:
uk: Аргумент *fmt* визначає формат файлу plist і може бути одним із таких значень:

source: :data:`FMT_XML`: XML formatted plist file
uk: :data:`FMT_XML`: Plist-файл у форматі XML

source: :data:`FMT_BINARY`: Binary formatted plist file
uk: :data:`FMT_BINARY`: файл plist у двійковому форматі

source: When *sort_keys* is true (the default) the keys for dictionaries will be written to the plist in sorted order, otherwise they will be written in the iteration order of the dictionary.
uk: Якщо *sort_keys* має значення true (за замовчуванням), ключі для словників будуть записані до plist у відсортованому порядку, інакше вони будуть записані в порядку ітерацій словника.

source: When *skipkeys* is false (the default) the function raises :exc:`TypeError` when a key of a dictionary is not a string, otherwise such keys are skipped.
uk: Якщо *skipkeys* має значення false (за замовчуванням), функція викликає :exc:`TypeError`, коли ключ словника не є рядком, інакше такі ключі пропускаються.

source: A :exc:`TypeError` will be raised if the object is of an unsupported type or a container that contains objects of unsupported types.
uk: Якщо тип об’єкта не підтримується або контейнер містить об’єкти непідтримуваних типів, виникне :exc:`TypeError`.

source: An :exc:`OverflowError` will be raised for integer values that cannot be represented in (binary) plist files.
uk: Помилка :exc:`OverflowError` буде викликана для цілих значень, які не можуть бути представлені в (бінарних) файлах plist.

source: Return *value* as a plist-formatted bytes object. See the documentation for :func:`dump` for an explanation of the keyword arguments of this function.
uk: Повертає *значення* як об’єкт bytes у форматі plist. Перегляньте документацію для :func:`dump` для пояснення ключових аргументів цієї функції.

source: The following classes are available:
uk: Доступні такі класи:

source: Wraps an :class:`int`. This is used when reading or writing NSKeyedArchiver encoded data, which contains UID (see PList manual).
uk: Обгортає :class:`int`. Це використовується під час читання або запису даних, закодованих NSKeyedArchiver, які містять UID (див. посібник PList).

source: It has one attribute, :attr:`data`, which can be used to retrieve the int value of the UID. :attr:`data` must be in the range ``0 <= data < 2**64``.
uk: Він має один атрибут, :attr:`data`, який можна використовувати для отримання int-значення UID. :attr:`data` має бути в діапазоні ``0 <= data < 2**64``.

source: The following constants are available:
uk: Доступні такі константи:

source: The XML format for plist files.
uk: Формат XML для файлів plist.

source: The binary format for plist files
uk: Двійковий формат для файлів plist

source: Examples
uk: Приклади

source: Generating a plist::
uk: Створення plist::

source: Parsing a plist::
uk: Розбір plist::
