Repository: python/python-docs-uk
Catalog: library/pty.po
Languages: uk

source: **Source code:** :source:`Lib/pty.py`
uk: **Вихідний код:** :source:`Lib/pty.py`

source: The :mod:`pty` module defines operations for handling the pseudo-terminal concept: starting another process and being able to write to and read from its controlling terminal programmatically.
uk: Модуль :mod:`pty` визначає операції для обробки концепції псевдотерміналу: запуск іншого процесу та можливість програмно записувати та читати з його керуючого терміналу.

source: Pseudo-terminal handling is highly platform dependent. This code is mainly tested on Linux, FreeBSD, and macOS (it is supposed to work on other POSIX platforms but it's not been thoroughly tested).
uk: Робота з псевдотерміналом сильно залежить від платформи. Цей код в основному тестується на Linux, FreeBSD і macOS (передбачається, що він працює на інших платформах POSIX, але не був ретельно протестований).

source: The :mod:`pty` module defines the following functions:
uk: Модуль :mod:`pty` визначає такі функції:

source: Fork. Connect the child's controlling terminal to a pseudo-terminal. Return value is ``(pid, fd)``. Note that the child gets *pid* 0, and the *fd* is *invalid*. The parent's return value is the *pid* of the child, and *fd* is a file descriptor connected to the child's controlling terminal (and also to the child's standard input and output).
uk: Вилка. Підключіть керуючий термінал дитини до псевдотерміналу. Повернене значення: ``(pid, fd)``. Зверніть увагу, що дитина отримує *pid* 0, а *fd* є *недійсним*. Значенням, що повертає батьківський елемент, є *pid* дочірнього, а *fd* — це дескриптор файлу, підключений до керуючого терміналу дочірнього (а також до стандартного введення та виведення дочірнього).

source: Open a new pseudo-terminal pair, using :func:`os.openpty` if possible, or emulation code for generic Unix systems. Return a pair of file descriptors ``(master, slave)``, for the master and the slave end, respectively.
uk: Відкрийте нову пару псевдотерміналів, використовуючи :func:`os.openpty`, якщо можливо, або код емуляції для загальних систем Unix. Повертає пару файлових дескрипторів ``(master, slave)`` для головного та підлеглого кінця відповідно.

source: Spawn a process, and connect its controlling terminal with the current process's standard io. This is often used to baffle programs which insist on reading from the controlling terminal. It is expected that the process spawned behind the pty will eventually terminate, and when it does *spawn* will return.
uk: Створіть процес і підключіть його керуючий термінал до стандартного io поточного процесу. Це часто використовується, щоб збентежити програми, які наполягають на читанні з керуючого терміналу. Очікується, що процес, породжений за pty, зрештою завершиться, і коли це станеться, *spawn* повернеться.

source: A loop copies STDIN of the current process to the child and data received from the child to STDOUT of the current process. It is not signaled to the child if STDIN of the current process closes down.
uk: Цикл копіює STDIN поточного процесу до дочірнього процесу, а дані, отримані від дочірнього процесу, до STDOUT поточного процесу. Дочірній процес не повідомляється, якщо STDIN поточного процесу закривається.

source: The functions *master_read* and *stdin_read* are passed a file descriptor which they should read from, and they should always return a byte string. In order to force spawn to return before the child process exits an empty byte array should be returned to signal end of file.
uk: Функціям *master_read* і *stdin_read* передається дескриптор файлу, з якого вони повинні читати, і вони завжди повинні повертати рядок байтів. Щоб змусити spawn повернутися до того, як дочірній процес завершить роботу, слід повернути порожній масив байтів до кінця файлу.

source: The default implementation for both functions will read and return up to 1024 bytes each time the function is called. The *master_read* callback is passed the pseudoterminal’s master file descriptor to read output from the child process, and *stdin_read* is passed file descriptor 0, to read from the parent process's standard input.
uk: Реалізація за замовчуванням для обох функцій буде читати та повертати до 1024 байтів кожного разу, коли функція викликається. Зворотний виклик *master_read* передається дескриптору головного файлу псевдотерміналу для читання виводу з дочірнього процесу, а *stdin_read* передається дескриптор файлу 0 для читання зі стандартного введення батьківського процесу.

source: Returning an empty byte string from either callback is interpreted as an end-of-file (EOF) condition, and that callback will not be called after that. If *stdin_read* signals EOF the controlling terminal can no longer communicate with the parent process OR the child process. Unless the child process will quit without any input, *spawn* will then loop forever. If *master_read* signals EOF the same behavior results (on linux at least).
uk: Повернення порожнього байтового рядка з будь-якого зворотного виклику інтерпретується як умова кінця файлу (EOF), і цей зворотний виклик не буде викликано після цього. Якщо *stdin_read* сигналізує EOF, керуючий термінал більше не може спілкуватися з батьківським процесом АБО дочірнім процесом. Якщо дочірній процес не завершить роботу без будь-яких вхідних даних, *spawn* буде зациклюватися назавжди. Якщо *master_read* сигналізує EOF, це призводить до такої ж поведінки (принаймні в Linux).

source: Return the exit status value from :func:`os.waitpid` on the child process.
uk: Повертає значення статусу виходу з :func:`os.waitpid` дочірнього процесу.

source: Raises an :ref:`auditing event <auditing>` ``pty.spawn`` with argument ``argv``.
uk: Викликає :ref:`подію аудиту <auditing>` ``pty.spawn`` з аргументом ``argv``.

source: :func:`spawn` now returns the status value from :func:`os.waitpid` on the child process.
uk: :func:`spawn` тепер повертає значення стану з :func:`os.waitpid` дочірнього процесу.

source: Example
uk: приклад

source: The following program acts like the Unix command :manpage:`script(1)`, using a pseudo-terminal to record all input and output of a terminal session in a "typescript". ::
uk: Наступна програма діє як команда Unix :manpage:`script(1)`, використовуючи псевдотермінал для запису всіх вхідних і вихідних даних сеансу терміналу в "typescript". ::
