Repository: python/python-docs-uk
Catalog: library/pwd.po
Languages: uk

source: :mod:`pwd` --- The password database
uk: :mod:`pwd` --- База даних паролів

source: This module provides access to the Unix user account and password database. It is available on all Unix versions.
uk: Цей модуль забезпечує доступ до бази даних облікових записів користувачів і паролів Unix. Він доступний у всіх версіях Unix.

source: Password database entries are reported as a tuple-like object, whose attributes correspond to the members of the ``passwd`` structure (Attribute field below, see ``<pwd.h>``):
uk: Записи бази даних паролів повідомляються як об’єкт, подібний до кортежу, атрибути якого відповідають членам структури ``passwd`` (поле атрибута нижче, див. ``<pwd.h>``):

source: Index
uk: Індекс

source: Attribute
uk: Атрибут

source: Meaning
uk: Значення

source: Login name
uk: Логін

source: Optional encrypted password
uk: Додатковий зашифрований пароль

source: Numerical user ID
uk: Числовий ідентифікатор користувача

source: Numerical group ID
uk: Ідентифікатор числової групи

source: User name or comment field
uk: Ім'я користувача або поле коментаря

source: User home directory
uk: Домашній каталог користувача

source: User command interpreter
uk: Інтерпретатор команд користувача

source: The uid and gid items are integers, all others are strings. :exc:`KeyError` is raised if the entry asked for cannot be found.
uk: Елементи uid і gid є цілими числами, всі інші є рядками. :exc:`KeyError` виникає, якщо запитуваний запис не знайдено.

source: In traditional Unix the field ``pw_passwd`` usually contains a password encrypted with a DES derived algorithm (see module :mod:`crypt`). However most modern unices use a so-called *shadow password* system. On those unices the *pw_passwd* field only contains an asterisk (``'*'``) or the letter ``'x'`` where the encrypted password is stored in a file :file:`/etc/shadow` which is not world readable. Whether the *pw_passwd* field contains anything useful is system-dependent. If available, the :mod:`spwd` module should be used where access to the encrypted password is required.
uk: У традиційному Unix поле ``pw_passwd`` зазвичай містить пароль, зашифрований за допомогою алгоритму, отриманого від DES (див. модуль :mod:`crypt`). Однак більшість сучасних уніксів використовують так звану систему *тіньових паролів*. У цих уніксах поле *pw_passwd* містить лише зірочку (``'*'``) або літеру ``'x'``, де зашифрований пароль зберігається у файлі :file:`/etc/shadow`, який не читається світом. Чи містить поле *pw_passwd* щось корисне, залежить від системи. Якщо доступний, модуль :mod:`spwd` слід використовувати там, де потрібен доступ до зашифрованого пароля.

source: It defines the following items:
uk: Він визначає такі пункти:

source: Return the password database entry for the given numeric user ID.
uk: Повернути запис бази даних паролів для вказаного числового ідентифікатора користувача.

source: Return the password database entry for the given user name.
uk: Повернути запис бази даних паролів для вказаного імені користувача.

source: Return a list of all available password database entries, in arbitrary order.
uk: Повертає список усіх доступних записів бази даних паролів у довільному порядку.

source: Module :mod:`grp`
uk: Модуль :mod:`grp`

source: An interface to the group database, similar to this.
uk: Подібний до цього інтерфейс до бази даних групи.

source: Module :mod:`spwd`
uk: Модуль :mod:`spwd`

source: An interface to the shadow password database, similar to this.
uk: Подібний до цього інтерфейс тіньової бази даних паролів.
