Repository: python/python-docs-uk
Catalog: library/pydoc.po
Languages: uk

source: :mod:`pydoc` --- Documentation generator and online help system
uk: :mod:`pydoc` --- Генератор документації та онлайнова довідкова система

source: **Source code:** :source:`Lib/pydoc.py`
uk: **Вихідний код:** :source:`Lib/pydoc.py`

source: The :mod:`pydoc` module automatically generates documentation from Python modules. The documentation can be presented as pages of text on the console, served to a web browser, or saved to HTML files.
uk: Модуль :mod:`pydoc` автоматично створює документацію з модулів Python. Документація може бути представлена у вигляді сторінок тексту на консолі, подана у веб-браузері або збережена у файлах HTML.

source: For modules, classes, functions and methods, the displayed documentation is derived from the docstring (i.e. the :attr:`__doc__` attribute) of the object, and recursively of its documentable members. If there is no docstring, :mod:`pydoc` tries to obtain a description from the block of comment lines just above the definition of the class, function or method in the source file, or at the top of the module (see :func:`inspect.getcomments`).
uk: Для модулів, класів, функцій і методів відображена документація походить із рядка документації (тобто атрибута :attr:`__doc__`) об’єкта та рекурсивно з його документованих членів. Якщо рядка документа немає, :mod:`pydoc` намагається отримати опис із блоку рядків коментарів безпосередньо над визначенням класу, функції чи методу у вихідному файлі або у верхній частині модуля (див. :func:`inspect.getcomments`).

source: The built-in function :func:`help` invokes the online help system in the interactive interpreter, which uses :mod:`pydoc` to generate its documentation as text on the console. The same text documentation can also be viewed from outside the Python interpreter by running :program:`pydoc` as a script at the operating system's command prompt. For example, running ::
uk: Вбудована функція :func:`help` викликає систему онлайн-довідки в інтерактивному інтерпретаторі, який використовує :mod:`pydoc` для створення документації у вигляді тексту на консолі. Цю ж текстову документацію також можна переглядати поза інтерпретатором Python, запустивши :program:`pydoc` як сценарій у командному рядку операційної системи. Наприклад, запуск ::

source: at a shell prompt will display documentation on the :mod:`sys` module, in a style similar to the manual pages shown by the Unix :program:`man` command. The argument to :program:`pydoc` can be the name of a function, module, or package, or a dotted reference to a class, method, or function within a module or module in a package. If the argument to :program:`pydoc` looks like a path (that is, it contains the path separator for your operating system, such as a slash in Unix), and refers to an existing Python source file, then documentation is produced for that file.
uk: у підказці оболонки відобразить документацію щодо модуля :mod:`sys` у стилі, подібному до сторінок посібника, показаних командою Unix :program:`man`. Аргументом :program:`pydoc` може бути назва функції, модуля чи пакета, або посилання з крапками на клас, метод або функцію в межах модуля чи модуля в пакеті. Якщо аргумент :program:`pydoc` виглядає як шлях (тобто він містить роздільник шляхів для вашої операційної системи, наприклад косу риску в Unix), і посилається на існуючий вихідний файл Python, тоді створюється документація для цей файл.

source: In order to find objects and their documentation, :mod:`pydoc` imports the module(s) to be documented. Therefore, any code on module level will be executed on that occasion. Use an ``if __name__ == '__main__':`` guard to only execute code when a file is invoked as a script and not just imported.
uk: Щоб знайти об’єкти та їхню документацію, :mod:`pydoc` імпортує модуль(и), які потрібно задокументувати. Таким чином, будь-який код на рівні модуля буде виконано в цьому випадку. Використовуйте захист ``if __name__ == '__main__':``, щоб виконувати код лише тоді, коли файл викликається як сценарій, а не просто імпортований.

source: When printing output to the console, :program:`pydoc` attempts to paginate the output for easier reading. If the :envvar:`PAGER` environment variable is set, :program:`pydoc` will use its value as a pagination program.
uk: Під час друку виведення на консоль :program:`pydoc` намагається розбити вивід на сторінки для легшого читання. Якщо встановлено змінну середовища :envvar:`PAGER`, :program:`pydoc` використовуватиме її значення як програму розбиття на сторінки.

source: Specifying a ``-w`` flag before the argument will cause HTML documentation to be written out to a file in the current directory, instead of displaying text on the console.
uk: Якщо вказати прапорець ``-w`` перед аргументом, документація HTML буде записана у файл у поточному каталозі замість відображення тексту на консолі.

source: Specifying a ``-k`` flag before the argument will search the synopsis lines of all available modules for the keyword given as the argument, again in a manner similar to the Unix :program:`man` command. The synopsis line of a module is the first line of its documentation string.
uk: Якщо вказати прапорець ``-k`` перед аргументом, буде здійснюватися пошук ключових слів, указаних як аргумент, у рядках короткого опису всіх доступних модулів, знову ж таки, як у команді Unix :program:`man`. Рядок короткого опису модуля є першим рядком рядка документації.

source: You can also use :program:`pydoc` to start an HTTP server on the local machine that will serve documentation to visiting web browsers. :program:`pydoc -p 1234` will start a HTTP server on port 1234, allowing you to browse the documentation at ``http://localhost:1234/`` in your preferred web browser. Specifying ``0`` as the port number will select an arbitrary unused port.
uk: Ви також можете використовувати :program:`pydoc` для запуску HTTP-сервера на локальному комп’ютері, який надаватиме документацію відвідувачам у веб-браузерах. :program:`pydoc -p 1234` запустить HTTP-сервер на порту 1234, дозволяючи вам переглядати документацію за адресою ``http://localhost:1234/`` у бажаному веб-браузері. Якщо вказати ``0`` як номер порту, буде вибрано довільний невикористаний порт.

source: :program:`pydoc -n <hostname>` will start the server listening at the given hostname. By default the hostname is 'localhost' but if you want the server to be reached from other machines, you may want to change the host name that the server responds to. During development this is especially useful if you want to run pydoc from within a container.
uk: :program:`pydoc -n <hostname>` почне прослуховування сервера на вказаному імені хоста. За замовчуванням ім’я хоста – "localhost", але якщо ви бажаєте, щоб сервер був доступним з інших машин, ви можете змінити ім’я хоста, на яке відповідає сервер. Під час розробки це особливо корисно, якщо ви хочете запустити pydoc з контейнера.

source: :program:`pydoc -b` will start the server and additionally open a web browser to a module index page. Each served page has a navigation bar at the top where you can *Get* help on an individual item, *Search* all modules with a keyword in their synopsis line, and go to the *Module index*, *Topics* and *Keywords* pages.
uk: :program:`pydoc -b` запустить сервер і додатково відкриє веб-браузер для сторінки індексу модуля. Кожна обслуговувана сторінка має навігаційну панель у верхній частині, де ви можете *отримати* довідку щодо окремого елемента, *шукати* всі модулі за ключовим словом у їхньому рядку короткого опису та перейти до *Індексу модулів*, *Тем* і *Ключових слів* сторінки.

source: When :program:`pydoc` generates documentation, it uses the current environment and path to locate modules. Thus, invoking :program:`pydoc spam` documents precisely the version of the module you would get if you started the Python interpreter and typed ``import spam``.
uk: Коли :program:`pydoc` створює документацію, вона використовує поточне середовище та шлях для пошуку модулів. Таким чином, виклик :program:`pydoc spam` документує саме ту версію модуля, яку ви отримаєте, якщо запустите інтерпретатор Python і введете ``import spam``.

source: Module docs for core modules are assumed to reside in ``https://docs.python.org/X.Y/library/`` where ``X`` and ``Y`` are the major and minor version numbers of the Python interpreter. This can be overridden by setting the :envvar:`PYTHONDOCS` environment variable to a different URL or to a local directory containing the Library Reference Manual pages.
uk: Передбачається, що документи модулів для основних модулів знаходяться в ``https://docs.python.org/X.Y/library/``, де ``X`` і ``Y`` — номери основної та другорядної версій Python перекладач. Це можна змінити, встановивши для змінної середовища :envvar:`PYTHONDOCS` іншу URL-адресу або локальний каталог, що містить сторінки Довідкового посібника з бібліотеки.

source: Added the ``-b`` option.
uk: Додано опцію ``-b``.

source: The ``-g`` command line option was removed.
uk: Параметр командного рядка ``-g`` видалено.

source: :mod:`pydoc` now uses :func:`inspect.signature` rather than :func:`inspect.getfullargspec` to extract signature information from callables.
uk: :mod:`pydoc` тепер використовує :func:`inspect.signature` замість :func:`inspect.getfullargspec` для отримання інформації підпису з викликів.

source: Added the ``-n`` option.
uk: Додано опцію ``-n``.
