Repository: python/python-docs-uk
Catalog: library/pyexpat.po
Languages: uk

source: :mod:`xml.parsers.expat` --- Fast XML parsing using Expat
uk: :mod:`xml.parsers.expat` --- Швидкий аналіз XML за допомогою Expat

source: The :mod:`pyexpat` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
uk: Модуль :mod:`pyexpat` не захищений від зловмисно створених даних. Якщо вам потрібно проаналізувати ненадійні або неавтентифіковані дані, перегляньте :ref:`xml-vulnerabilities`.

source: The :mod:`xml.parsers.expat` module is a Python interface to the Expat non-validating XML parser. The module provides a single extension type, :class:`xmlparser`, that represents the current state of an XML parser. After an :class:`xmlparser` object has been created, various attributes of the object can be set to handler functions. When an XML document is then fed to the parser, the handler functions are called for the character data and markup in the XML document.
uk: Модуль :mod:`xml.parsers.expat` — це інтерфейс Python для XML-аналізатора Expat без перевірки. Модуль надає єдиний тип розширення, :class:`xmlparser`, який представляє поточний стан аналізатора XML. Після створення об’єкта :class:`xmlparser` різні атрибути об’єкта можуть бути встановлені для функцій обробки. Коли XML-документ надходить до аналізатора, викликаються функції обробки символьних даних і розмітки в XML-документі.

source: This module uses the :mod:`pyexpat` module to provide access to the Expat parser. Direct use of the :mod:`pyexpat` module is deprecated.
uk: Цей модуль використовує модуль :mod:`pyexpat` для надання доступу до аналізатора Expat. Пряме використання модуля :mod:`pyexpat` застаріло.

source: This module provides one exception and one type object:
uk: Цей модуль надає один виняток і об’єкт одного типу:

source: The exception raised when Expat reports an error. See section :ref:`expaterror-objects` for more information on interpreting Expat errors.
uk: Виняток виникає, коли Expat повідомляє про помилку. Перегляньте розділ :ref:`expaterror-objects` для отримання додаткової інформації про інтерпретацію помилок Expat.

source: Alias for :exc:`ExpatError`.
uk: Псевдонім для :exc:`ExpatError`.

source: The type of the return values from the :func:`ParserCreate` function.
uk: Тип значень, які повертає функція :func:`ParserCreate`.

source: The :mod:`xml.parsers.expat` module contains two functions:
uk: Модуль :mod:`xml.parsers.expat` містить дві функції:

source: Returns an explanatory string for a given error number *errno*.
uk: Повертає пояснювальний рядок для заданого номера помилки *errno*.

source: Creates and returns a new :class:`xmlparser` object. *encoding*, if specified, must be a string naming the encoding used by the XML data. Expat doesn't support as many encodings as Python does, and its repertoire of encodings can't be extended; it supports UTF-8, UTF-16, ISO-8859-1 (Latin1), and ASCII. If *encoding* [1]_ is given it will override the implicit or explicit encoding of the document.
uk: Створює та повертає новий об’єкт :class:`xmlparser`. *encoding*, якщо вказано, має бути рядком із назвою кодування, що використовується в XML-даних. Expat не підтримує таку кількість кодувань, як Python, і його набір кодувань не можна розширити; він підтримує UTF-8, UTF-16, ISO-8859-1 (Latin1) і ASCII. Якщо задано *кодування* [1]_, воно замінить неявне або явне кодування документа.

source: Expat can optionally do XML namespace processing for you, enabled by providing a value for *namespace_separator*. The value must be a one-character string; a :exc:`ValueError` will be raised if the string has an illegal length (``None`` is considered the same as omission). When namespace processing is enabled, element type names and attribute names that belong to a namespace will be expanded. The element name passed to the element handlers :attr:`StartElementHandler` and :attr:`EndElementHandler` will be the concatenation of the namespace URI, the namespace separator character, and the local part of the name. If the namespace separator is a zero byte (``chr(0)``) then the namespace URI and the local part will be concatenated without any separator.
uk: Експат може додатково виконувати обробку простору імен XML для вас, увімкнувши значення для *namespace_separator*. Значення має бути односимвольним рядком; a :exc:`ValueError` буде викликано, якщо рядок має недопустиму довжину (``None`` вважається тим самим, що пропуск). Коли обробку простору імен увімкнено, назви типів елементів і назви атрибутів, які належать до простору імен, будуть розгорнуті. Ім’я елемента, яке передається обробникам елемента :attr:`StartElementHandler` і :attr:`EndElementHandler`, буде конкатенацією URI простору імен, символу роздільника простору імен і локальної частини імені. Якщо роздільником простору імен є нульовий байт (``chr(0)``), тоді URI простору імен і локальна частина будуть об’єднані без будь-якого роздільника.

source: For example, if *namespace_separator* is set to a space character (``' '``) and the following document is parsed:
uk: Наприклад, якщо *namespace_separator* встановлено на символ пробілу (``' '``), а наступний документ аналізується:

source: :attr:`StartElementHandler` will receive the following strings for each element::
uk: :attr:`StartElementHandler` отримає такі рядки для кожного елемента:

source: Due to limitations in the ``Expat`` library used by :mod:`pyexpat`, the :class:`xmlparser` instance returned can only be used to parse a single XML document. Call ``ParserCreate`` for each document to provide unique parser instances.
uk: Через обмеження бібліотеки ``Expat``, яку використовує :mod:`pyexpat`, повернутий екземпляр :class:`xmlparser` можна використовувати лише для аналізу одного документа XML. Викликайте ``ParserCreate`` для кожного документа, щоб надати унікальні екземпляри аналізатора.

source: `The Expat XML Parser <http://www.libexpat.org/>`_
uk: `Аналізатор Expat XML <http://www.libexpat.org/>`_

source: Home page of the Expat project.
uk: Домашня сторінка проекту Expat.

source: XMLParser Objects
uk: Об’єкти XMLParser

source: :class:`xmlparser` objects have the following methods:
uk: Об’єкти :class:`xmlparser` мають такі методи:

source: Parses the contents of the string *data*, calling the appropriate handler functions to process the parsed data. *isfinal* must be true on the final call to this method; it allows the parsing of a single file in fragments, not the submission of multiple files. *data* can be the empty string at any time.
uk: Аналізує вміст рядка *data*, викликаючи відповідні функції обробки для обробки аналізованих даних. *isfinal* має бути true під час останнього виклику цього методу; це дозволяє розбирати один файл у фрагментах, а не надсилати кілька файлів. *data* може бути порожнім рядком у будь-який час.

source: Parse XML data reading from the object *file*. *file* only needs to provide the ``read(nbytes)`` method, returning the empty string when there's no more data.
uk: Проаналізуйте читання даних XML з об'єктного *файлу*. *file* потребує лише надання методу ``read(nbytes)``, повертаючи порожній рядок, коли більше немає даних.

source: Sets the base to be used for resolving relative URIs in system identifiers in declarations. Resolving relative identifiers is left to the application: this value will be passed through as the *base* argument to the :func:`ExternalEntityRefHandler`, :func:`NotationDeclHandler`, and :func:`UnparsedEntityDeclHandler` functions.
uk: Встановлює базу для визначення відносних URI у системних ідентифікаторах у оголошеннях. Розпізнавання відносних ідентифікаторів залишається за додатком: це значення буде передано як аргумент *base* до функцій :func:`ExternalEntityRefHandler`, :func:`NotationDeclHandler` і :func:`UnparsedEntityDeclHandler`.

source: Returns a string containing the base set by a previous call to :meth:`SetBase`, or ``None`` if :meth:`SetBase` hasn't been called.
uk: Повертає рядок, що містить базовий набір попереднім викликом :meth:`SetBase` або ``None``, якщо :meth:`SetBase` не викликався.

source: Returns the input data that generated the current event as a string. The data is in the encoding of the entity which contains the text. When called while an event handler is not active, the return value is ``None``.
uk: Повертає вхідні дані, які згенерували поточну подію, у вигляді рядка. Дані знаходяться в кодуванні сутності, яка містить текст. Під час виклику, коли обробник події неактивний, повертається значення ``None``.

source: Create a "child" parser which can be used to parse an external parsed entity referred to by content parsed by the parent parser. The *context* parameter should be the string passed to the :meth:`ExternalEntityRefHandler` handler function, described below. The child parser is created with the :attr:`ordered_attributes` and :attr:`specified_attributes` set to the values of this parser.
uk: Створіть "дочірній" аналізатор, який можна використовувати для аналізу зовнішньої проаналізованої сутності, на яку посилається вміст, розібраний батьківським аналізатором. Параметр *context* має бути рядком, який передається до функції обробки :meth:`ExternalEntityRefHandler`, описаної нижче. Дочірній аналізатор створюється з :attr:`ordered_attributes` і :attr:`specified_attributes`, встановленими на значення цього аналізатора.

source: Control parsing of parameter entities (including the external DTD subset). Possible *flag* values are :const:`XML_PARAM_ENTITY_PARSING_NEVER`, :const:`XML_PARAM_ENTITY_PARSING_UNLESS_STANDALONE` and :const:`XML_PARAM_ENTITY_PARSING_ALWAYS`. Return true if setting the flag was successful.
uk: Контроль аналізу сутностей параметрів (включаючи підмножину зовнішнього DTD). Можливі значення *flag*: :const:`XML_PARAM_ENTITY_PARSING_NEVER`, :const:`XML_PARAM_ENTITY_PARSING_UNLESS_STANDALONE` і :const:`XML_PARAM_ENTITY_PARSING_ALWAYS`. Повертає true, якщо прапорець встановлено успішно.

source: Calling this with a true value for *flag* (the default) will cause Expat to call the :attr:`ExternalEntityRefHandler` with :const:`None` for all arguments to allow an alternate DTD to be loaded. If the document does not contain a document type declaration, the :attr:`ExternalEntityRefHandler` will still be called, but the :attr:`StartDoctypeDeclHandler` and :attr:`EndDoctypeDeclHandler` will not be called.
uk: Виклик цього з істинним значенням для *flag* (за замовчуванням) змусить Expat викликати :attr:`ExternalEntityRefHandler` з :const:`None` для всіх аргументів, щоб дозволити завантажувати альтернативний DTD. Якщо документ не містить оголошення типу документа, :attr:`ExternalEntityRefHandler` все одно буде викликано, але :attr:`StartDoctypeDeclHandler` і :attr:`EndDoctypeDeclHandler` не буде викликано.

source: Passing a false value for *flag* will cancel a previous call that passed a true value, but otherwise has no effect.
uk: Передача хибного значення для *flag* призведе до скасування попереднього виклику, який передав істинне значення, але в іншому випадку не матиме ефекту.

source: This method can only be called before the :meth:`Parse` or :meth:`ParseFile` methods are called; calling it after either of those have been called causes :exc:`ExpatError` to be raised with the :attr:`code` attribute set to ``errors.codes[errors.XML_ERROR_CANT_CHANGE_FEATURE_ONCE_PARSING]``.
uk: Цей метод можна викликати лише перед викликом методів :meth:`Parse` або :meth:`ParseFile`; його виклик після виклику будь-якого з них викликає :exc:`ExpatError`, коли атрибут :attr:`code` має значення ``errors.codes[errors.XML_ERROR_CANT_CHANGE_FEATURE_ONCE_PARSING]``.

source: :class:`xmlparser` objects have the following attributes:
uk: Об’єкти :class:`xmlparser` мають такі атрибути:

source: The size of the buffer used when :attr:`buffer_text` is true. A new buffer size can be set by assigning a new integer value to this attribute. When the size is changed, the buffer will be flushed.
uk: Розмір буфера, який використовується, коли :attr:`buffer_text` має значення true. Новий розмір буфера можна встановити, присвоївши цьому атрибуту нове ціле значення. Коли розмір змінено, буфер буде очищено.

source: Setting this to true causes the :class:`xmlparser` object to buffer textual content returned by Expat to avoid multiple calls to the :meth:`CharacterDataHandler` callback whenever possible. This can improve performance substantially since Expat normally breaks character data into chunks at every line ending. This attribute is false by default, and may be changed at any time.
uk: Якщо встановити для цього значення true, об’єкт :class:`xmlparser` буферизує текстовий вміст, повернутий Expat, щоб уникнути багаторазових викликів зворотного виклику :meth:`CharacterDataHandler`, коли це можливо. Це може значно підвищити продуктивність, оскільки Expat зазвичай розбиває символьні дані на частини в кінці кожного рядка. Цей атрибут за замовчуванням має значення false і може бути змінений у будь-який час.

source: If :attr:`buffer_text` is enabled, the number of bytes stored in the buffer. These bytes represent UTF-8 encoded text. This attribute has no meaningful interpretation when :attr:`buffer_text` is false.
uk: Якщо :attr:`buffer_text` увімкнено, кількість байтів, що зберігаються в буфері. Ці байти представляють текст у кодуванні UTF-8. Цей атрибут не має значущої інтерпретації, якщо :attr:`buffer_text` має значення false.

source: Setting this attribute to a non-zero integer causes the attributes to be reported as a list rather than a dictionary. The attributes are presented in the order found in the document text. For each attribute, two list entries are presented: the attribute name and the attribute value. (Older versions of this module also used this format.) By default, this attribute is false; it may be changed at any time.
uk: Встановлення для цього атрибута ненульового цілого числа призводить до того, що атрибути повідомлятимуться як список, а не як словник. Атрибути представлені в порядку, указаному в тексті документа. Для кожного атрибута представлено два записи списку: назва атрибута та значення атрибута. (Старіші версії цього модуля також використовували цей формат.) За замовчуванням цей атрибут має значення false; його можна змінити в будь-який час.

source: If set to a non-zero integer, the parser will report only those attributes which were specified in the document instance and not those which were derived from attribute declarations. Applications which set this need to be especially careful to use what additional information is available from the declarations as needed to comply with the standards for the behavior of XML processors. By default, this attribute is false; it may be changed at any time.
uk: Якщо встановлено ненульове ціле число, аналізатор повідомлятиме лише про ті атрибути, які були вказані в екземплярі документа, а не про ті, які були отримані з оголошень атрибутів. Програми, які встановлюють це, повинні бути особливо обережними, щоб використовувати додаткову інформацію, доступну з декларацій, якщо це необхідно для відповідності стандартам поведінки процесорів XML. За замовчуванням цей атрибут має значення false; його можна змінити в будь-який час.

source: The following attributes contain values relating to the most recent error encountered by an :class:`xmlparser` object, and will only have correct values once a call to :meth:`Parse` or :meth:`ParseFile` has raised an :exc:`xml.parsers.expat.ExpatError` exception.
uk: Наступні атрибути містять значення, пов’язані з останньою помилкою, яку виявив об’єкт :class:`xmlparser`, і матимуть правильні значення лише тоді, коли виклик :meth:`Parse` або :meth:`ParseFile` викликає Виняток :exc:`xml.parsers.expat.ExpatError`.

source: Byte index at which an error occurred.
uk: Індекс байта, на якому сталася помилка.

source: Numeric code specifying the problem. This value can be passed to the :func:`ErrorString` function, or compared to one of the constants defined in the ``errors`` object.
uk: Числовий код, що визначає проблему. Це значення можна передати у функцію :func:`ErrorString` або порівняти з однією з констант, визначених в об’єкті ``errors``.

source: Column number at which an error occurred.
uk: Номер стовпця, в якому сталася помилка.

source: Line number at which an error occurred.
uk: Номер рядка, в якому сталася помилка.

source: The following attributes contain values relating to the current parse location in an :class:`xmlparser` object. During a callback reporting a parse event they indicate the location of the first of the sequence of characters that generated the event. When called outside of a callback, the position indicated will be just past the last parse event (regardless of whether there was an associated callback).
uk: Наступні атрибути містять значення, пов’язані з поточним місцем аналізу в об’єкті :class:`xmlparser`. Під час зворотного виклику, повідомляючи про подію синтаксичного аналізу, вони вказують розташування першого з послідовності символів, які породили подію. При виклику за межами зворотного виклику вказана позиція буде відразу після останньої події аналізу (незалежно від того, чи був пов’язаний зворотний виклик).

source: Current byte index in the parser input.
uk: Поточний індекс байта у вхідних даних аналізатора.

source: Current column number in the parser input.
uk: Поточний номер стовпця у вхідних даних аналізатора.

source: Current line number in the parser input.
uk: Поточний номер рядка у вхідних даних аналізатора.

source: Here is the list of handlers that can be set. To set a handler on an :class:`xmlparser` object *o*, use ``o.handlername = func``. *handlername* must be taken from the following list, and *func* must be a callable object accepting the correct number of arguments. The arguments are all strings, unless otherwise stated.
uk: Ось список обробників, які можна встановити. Щоб встановити обробник для об’єкта :class:`xmlparser` *o*, використовуйте ``o.handlername = func``. *handlername* має бути взято з наступного списку, а *func* має бути викликаним об’єктом, який приймає правильну кількість аргументів. Усі аргументи є рядками, якщо не вказано інше.

source: Called when the XML declaration is parsed. The XML declaration is the (optional) declaration of the applicable version of the XML recommendation, the encoding of the document text, and an optional "standalone" declaration. *version* and *encoding* will be strings, and *standalone* will be ``1`` if the document is declared standalone, ``0`` if it is declared not to be standalone, or ``-1`` if the standalone clause was omitted. This is only available with Expat version 1.95.0 or newer.
uk: Викликається під час аналізу XML-декларації. Оголошення XML – це (необов’язкове) оголошення відповідної версії рекомендації XML, кодування тексту документа та необов’язкове "окреме" оголошення. *version* і *encoding* будуть рядками, а *standalone* матиме значення ``1``, якщо документ оголошено автономним, ``0``, якщо він оголошено не автономним, або ``-1`` якщо окреме речення було пропущено. Це доступно лише для Expat версії 1.95.0 або новішої.

source: Called when Expat begins parsing the document type declaration (``<!DOCTYPE ...``). The *doctypeName* is provided exactly as presented. The *systemId* and *publicId* parameters give the system and public identifiers if specified, or ``None`` if omitted. *has_internal_subset* will be true if the document contains and internal document declaration subset. This requires Expat version 1.2 or newer.
uk: Викликається, коли Expat починає розбирати декларацію типу документа (``<!DOCTYPE ...``). *doctypeName* надається точно так, як представлено. Параметри *systemId* і *publicId* дають системний і публічний ідентифікатори, якщо вказано, або ``None``, якщо опущено. *has_internal_subset* матиме значення true, якщо документ містить підмножину декларацій внутрішнього документа. Для цього потрібна версія Expat 1.2 або новіша.

source: Called when Expat is done parsing the document type declaration. This requires Expat version 1.2 or newer.
uk: Викликається, коли Expat завершує аналіз декларації типу документа. Для цього потрібна версія Expat 1.2 або новіша.

source: Called once for each element type declaration. *name* is the name of the element type, and *model* is a representation of the content model.
uk: Викликається один раз для кожного оголошення типу елемента. *name* — це ім’я типу елемента, а *model* — це представлення моделі вмісту.

source: Called for each declared attribute for an element type. If an attribute list declaration declares three attributes, this handler is called three times, once for each attribute. *elname* is the name of the element to which the declaration applies and *attname* is the name of the attribute declared. The attribute type is a string passed as *type*; the possible values are ``'CDATA'``, ``'ID'``, ``'IDREF'``, ... *default* gives the default value for the attribute used when the attribute is not specified by the document instance, or ``None`` if there is no default value (``#IMPLIED`` values). If the attribute is required to be given in the document instance, *required* will be true. This requires Expat version 1.95.0 or newer.
uk: Викликається для кожного оголошеного атрибута для типу елемента. Якщо оголошення списку атрибутів оголошує три атрибути, цей обробник викликається тричі, по одному для кожного атрибута. *elname* — це ім’я елемента, до якого застосовується оголошення, а *attname* — це ім’я оголошеного атрибута. Тип атрибута — це рядок, що передається як *type*; можливі значення: ``'CDATA'``, ``'ID'``, ``'IDREF'``, ... *default* дає значення за замовчуванням для атрибута, який використовується, коли атрибут не вказано в екземпляр документа або ``None``, якщо немає значення за замовчуванням (``#IMPLIED`` значення). Якщо атрибут потрібно вказати в екземплярі документа, *required* матиме значення true. Для цього потрібна версія Expat 1.95.0 або новіша.

source: Called for the start of every element. *name* is a string containing the element name, and *attributes* is the element attributes. If :attr:`ordered_attributes` is true, this is a list (see :attr:`ordered_attributes` for a full description). Otherwise it's a dictionary mapping names to values.
uk: Викликається для початку кожного елемента. *name* — це рядок, що містить назву елемента, а *attributes* — це атрибути елемента. Якщо :attr:`ordered_attributes` має значення true, це список (див. :attr:`ordered_attributes` для повного опису). В іншому випадку це словник, який зіставляє імена зі значеннями.

source: Called for the end of every element.
uk: Викликається в кінці кожного елемента.

source: Called for every processing instruction.
uk: Викликається для кожної інструкції з обробки.

source: Called for character data. This will be called for normal character data, CDATA marked content, and ignorable whitespace. Applications which must distinguish these cases can use the :attr:`StartCdataSectionHandler`, :attr:`EndCdataSectionHandler`, and :attr:`ElementDeclHandler` callbacks to collect the required information.
uk: Викликається для символьних даних. Це буде викликано для звичайних символьних даних, вмісту з позначкою CDATA та пропусків, які можна ігнорувати. Програми, які повинні розрізняти ці випадки, можуть використовувати зворотні виклики :attr:`StartCdataSectionHandler`, :attr:`EndCdataSectionHandler` і :attr:`ElementDeclHandler` для збору необхідної інформації.
