Repository: python/python-docs-uk
Catalog: library/pyexpat.po
Languages: uk

source: Called for unparsed (NDATA) entity declarations. This is only present for version 1.2 of the Expat library; for more recent versions, use :attr:`EntityDeclHandler` instead. (The underlying function in the Expat library has been declared obsolete.)
uk: Викликається для нерозібраних (NDATA) декларацій сутностей. Це доступно лише для версії 1.2 бібліотеки Expat; для останніх версій замість цього використовуйте :attr:`EntityDeclHandler`. (Основну функцію в бібліотеці Expat було оголошено застарілою.)

source: Called for all entity declarations. For parameter and internal entities, *value* will be a string giving the declared contents of the entity; this will be ``None`` for external entities. The *notationName* parameter will be ``None`` for parsed entities, and the name of the notation for unparsed entities. *is_parameter_entity* will be true if the entity is a parameter entity or false for general entities (most applications only need to be concerned with general entities). This is only available starting with version 1.95.0 of the Expat library.
uk: Викликається для всіх декларацій сутностей. Для параметрів і внутрішніх сутностей *value* буде рядком, що надає оголошений вміст сутності; це буде ``None`` для зовнішніх об'єктів. Параметр *notationName* матиме значення ``None`` для проаналізованих сутностей і ім’я нотації для нерозібраних сутностей. *is_parameter_entity* матиме значення true, якщо сутність є параметром, або false для загальних сутностей (більшості програм потрібно мати справу лише із загальними сутностями). Це доступно лише з версії 1.95.0 бібліотеки Expat.

source: Called for notation declarations. *notationName*, *base*, and *systemId*, and *publicId* are strings if given. If the public identifier is omitted, *publicId* will be ``None``.
uk: Викликані нотні декларації. *notationName*, *base*, *systemId* і *publicId* є рядками, якщо вони задані. Якщо публічний ідентифікатор пропущено, *publicId* матиме значення ``None``.

source: Called when an element contains a namespace declaration. Namespace declarations are processed before the :attr:`StartElementHandler` is called for the element on which declarations are placed.
uk: Викликається, коли елемент містить оголошення простору імен. Оголошення простору імен обробляються перед викликом :attr:`StartElementHandler` для елемента, на якому розміщено оголошення.

source: Called when the closing tag is reached for an element that contained a namespace declaration. This is called once for each namespace declaration on the element in the reverse of the order for which the :attr:`StartNamespaceDeclHandler` was called to indicate the start of each namespace declaration's scope. Calls to this handler are made after the corresponding :attr:`EndElementHandler` for the end of the element.
uk: Викликається, коли досягається закриваючий тег для елемента, який містив оголошення простору імен. Це викликається один раз для кожної декларації простору імен для елемента в порядку, зворотному порядку, для якого було викликано :attr:`StartNamespaceDeclHandler`, щоб вказати початок кожної області декларації простору імен. Виклики цього обробника здійснюються після відповідного :attr:`EndElementHandler` для кінця елемента.

source: Called for comments. *data* is the text of the comment, excluding the leading ``'<!-``\ ``-'`` and trailing ``'-``\ ``->'``.
uk: Звертався за коментарями. *data* — це текст коментаря, за винятком початкового ``'<!-``\ ``-'`` і кінцевого ``'-``\ ``->'``.

source: Called at the start of a CDATA section. This and :attr:`EndCdataSectionHandler` are needed to be able to identify the syntactical start and end for CDATA sections.
uk: Викликається на початку розділу CDATA. Це та :attr:`EndCdataSectionHandler` потрібні, щоб мати можливість ідентифікувати синтаксичний початок і кінець для розділів CDATA.

source: Called at the end of a CDATA section.
uk: Викликається в кінці розділу CDATA.

source: Called for any characters in the XML document for which no applicable handler has been specified. This means characters that are part of a construct which could be reported, but for which no handler has been supplied.
uk: Викликається для будь-яких символів у документі XML, для яких не вказано відповідний обробник. Це означає символи, які є частиною конструкції, про яку можна повідомити, але для яких не надано обробник.

source: This is the same as the :func:`DefaultHandler`, but doesn't inhibit expansion of internal entities. The entity reference will not be passed to the default handler.
uk: Це те саме, що :func:`DefaultHandler`, але не перешкоджає розширенню внутрішніх сутностей. Посилання на сутність не буде передано обробнику за замовчуванням.

source: Called if the XML document hasn't been declared as being a standalone document. This happens when there is an external subset or a reference to a parameter entity, but the XML declaration does not set standalone to ``yes`` in an XML declaration. If this handler returns ``0``, then the parser will raise an :const:`XML_ERROR_NOT_STANDALONE` error. If this handler is not set, no exception is raised by the parser for this condition.
uk: Викликається, якщо документ XML не оголошено як окремий документ. Це трапляється, коли існує зовнішня підмножина або посилання на сутність параметра, але XML-декларація не встановлює standalone на ``yes`` в XML-декларації. Якщо цей обробник повертає ``0``, тоді аналізатор викличе помилку :const:`XML_ERROR_NOT_STANDALONE`. Якщо цей обробник не встановлено, синтаксичний аналізатор не створює винятків для цієї умови.

source: Called for references to external entities. *base* is the current base, as set by a previous call to :meth:`SetBase`. The public and system identifiers, *systemId* and *publicId*, are strings if given; if the public identifier is not given, *publicId* will be ``None``. The *context* value is opaque and should only be used as described below.
uk: Викликаються посилання на зовнішні сутності. *base* — це поточна база, встановлена попереднім викликом :meth:`SetBase`. Загальнодоступні та системні ідентифікатори, *systemId* і *publicId*, є рядками, якщо вони задані; якщо публічний ідентифікатор не вказано, *publicId* буде ``None``. Значення *context* є непрозорим і його слід використовувати лише як описано нижче.

source: For external entities to be parsed, this handler must be implemented. It is responsible for creating the sub-parser using ``ExternalEntityParserCreate(context)``, initializing it with the appropriate callbacks, and parsing the entity. This handler should return an integer; if it returns ``0``, the parser will raise an :const:`XML_ERROR_EXTERNAL_ENTITY_HANDLING` error, otherwise parsing will continue.
uk: Для аналізу зовнішніх об’єктів цей обробник має бути реалізований. Він відповідає за створення суб-парсера за допомогою ``ExternalEntityParserCreate(context)``, його ініціалізацію за допомогою відповідних зворотних викликів і аналіз сутності. Цей обробник має повертати ціле число; якщо він повертає ``0``, аналізатор викличе помилку :const:`XML_ERROR_EXTERNAL_ENTITY_HANDLING`, інакше аналіз продовжиться.

source: If this handler is not provided, external entities are reported by the :attr:`DefaultHandler` callback, if provided.
uk: Якщо цей обробник не надано, зовнішні сутності повідомляються зворотним викликом :attr:`DefaultHandler`, якщо він надається.

source: ExpatError Exceptions
uk: Винятки ExpatError

source: :exc:`ExpatError` exceptions have a number of interesting attributes:
uk: Винятки :exc:`ExpatError` мають ряд цікавих атрибутів:

source: Expat's internal error number for the specific error. The :data:`errors.messages <xml.parsers.expat.errors.messages>` dictionary maps these error numbers to Expat's error messages. For example::
uk: Внутрішній номер помилки Expat для конкретної помилки. Словник :data:`errors.messages <xml.parsers.expat.errors.messages>` зіставляє ці номери помилок із повідомленнями про помилки Expat. Наприклад::

source: The :mod:`~xml.parsers.expat.errors` module also provides error message constants and a dictionary :data:`~xml.parsers.expat.errors.codes` mapping these messages back to the error codes, see below.
uk: Модуль :mod:`~xml.parsers.expat.errors` також надає константи повідомлень про помилки та словник :data:`~xml.parsers.expat.errors.codes`, який відображає ці повідомлення назад до кодів помилок, див. нижче.

source: Line number on which the error was detected. The first line is numbered ``1``.
uk: Номер рядка, в якому виявлено помилку. Перший рядок має номер ``1``.

source: Character offset into the line where the error occurred. The first column is numbered ``0``.
uk: Зміщення символу в рядку, де сталася помилка. Перший стовпець має номер ``0``.

source: Example
uk: приклад

source: The following program defines three handlers that just print out their arguments. ::
uk: Наступна програма визначає три обробники, які просто виводять свої аргументи. ::

source: The output from this program is::
uk: Результат цієї програми:

source: Content Model Descriptions
uk: Опис моделі вмісту

source: Content models are described using nested tuples. Each tuple contains four values: the type, the quantifier, the name, and a tuple of children. Children are simply additional content model descriptions.
uk: Моделі вмісту описуються за допомогою вкладених кортежів. Кожен кортеж містить чотири значення: тип, квантор, ім’я та кортеж дітей. Дочірні елементи – це просто додаткові описи моделі контенту.

source: The values of the first two fields are constants defined in the :mod:`xml.parsers.expat.model` module. These constants can be collected in two groups: the model type group and the quantifier group.
uk: Значення перших двох полів є константами, визначеними в модулі :mod:`xml.parsers.expat.model`. Ці константи можна зібрати у дві групи: групу типу моделі та групу квантора.

source: The constants in the model type group are:
uk: Константи в групі типу моделі:

source: The element named by the model name was declared to have a content model of ``ANY``.
uk: Елемент, названий іменем моделі, було оголошено таким, що має модель вмісту "БУДЬ-ЯКА".

source: The named element allows a choice from a number of options; this is used for content models such as ``(A | B | C)``.
uk: Названий елемент дозволяє вибирати з кількох варіантів; це використовується для моделей вмісту, таких як ``(A | B | C)``.

source: Elements which are declared to be ``EMPTY`` have this model type.
uk: Елементи, які оголошено як ``EMPTY``, мають цей тип моделі.

source: Models which represent a series of models which follow one after the other are indicated with this model type. This is used for models such as ``(A, B, C)``.
uk: Моделі, які представляють серію моделей, що йдуть одна за одною, позначаються цим типом моделі. Це використовується для таких моделей, як "(A, B, C)".

source: The constants in the quantifier group are:
uk: Константи в групі кванторів такі:

source: No modifier is given, so it can appear exactly once, as for ``A``.
uk: Модифікатор не надано, тому він може з’явитися лише один раз, як для ``A``.

source: The model is optional: it can appear once or not at all, as for ``A?``.
uk: Модель необов'язкова: вона може з'являтися один раз або не з'являтися взагалі, як для ``A?``.

source: The model must occur one or more times (like ``A+``).
uk: Модель має зустрічатися один або кілька разів (наприклад, ``A+``).

source: The model must occur zero or more times, as for ``A*``.
uk: Модель має зустрічатися нуль або більше разів, як для ``A*``.

source: Expat error constants
uk: Константи помилок Expat

source: The following constants are provided in the :mod:`xml.parsers.expat.errors` module. These constants are useful in interpreting some of the attributes of the :exc:`ExpatError` exception objects raised when an error has occurred. Since for backwards compatibility reasons, the constants' value is the error *message* and not the numeric error *code*, you do this by comparing its :attr:`code` attribute with :samp:`errors.codes[errors.XML_ERROR_{CONSTANT_NAME}]`.
uk: Наступні константи надаються в модулі :mod:`xml.parsers.expat.errors`. Ці константи корисні для інтерпретації деяких атрибутів об’єктів винятку :exc:`ExpatError`, які виникають у разі виникнення помилки. Оскільки з міркувань зворотної сумісності значенням констант є *повідомлення про помилку*, а не числова *код* помилки, ви робите це, порівнюючи його атрибут :attr:`code` з :samp:`errors.codes[errors.XML_ERROR_ {CONSTANT_NAME}]`.

source: The ``errors`` module has the following attributes:
uk: Модуль ``errors`` має такі атрибути:

source: A dictionary mapping string descriptions to their error codes.
uk: Словник, що зіставляє описи рядків із їхніми кодами помилок.

source: A dictionary mapping numeric error codes to their string descriptions.
uk: Словник, що зіставляє числові коди помилок з їхніми описами рядків.

source: An entity reference in an attribute value referred to an external entity instead of an internal entity.
uk: Посилання на сутність у значенні атрибута посилалося на зовнішню сутність замість внутрішньої сутності.

source: A character reference referred to a character which is illegal in XML (for example, character ``0``, or '``&#0;``').
uk: Посилання на символ стосується символу, який є недопустимим у XML (наприклад, символ ``0`` або '``&#0;``').

source: An entity reference referred to an entity which was declared with a notation, so cannot be parsed.
uk: Посилання на сутність посилається на сутність, яка була оголошена за допомогою нотації, тому не може бути проаналізована.

source: An attribute was used more than once in a start tag.
uk: Атрибут використовувався більше одного разу в початковому тегу.

source: Raised when an input byte could not properly be assigned to a character; for example, a NUL byte (value ``0``) in a UTF-8 input stream.
uk: Викликається, коли вхідний байт не може бути належним чином призначений символу; наприклад, байт NUL (значення ``0``) у вхідному потоці UTF-8.

source: Something other than whitespace occurred after the document element.
uk: Щось інше, ніж пробіл, сталося після елемента документа.

source: An XML declaration was found somewhere other than the start of the input data.
uk: Оголошення XML знайдено не на початку вхідних даних.

source: The document contains no elements (XML requires all documents to contain exactly one top-level element)..
uk: Документ не містить елементів (XML вимагає, щоб усі документи містили рівно один елемент верхнього рівня).

source: Expat was not able to allocate memory internally.
uk: Expat не зміг внутрішньо виділити пам’ять.

source: A parameter entity reference was found where it was not allowed.
uk: Знайдено посилання на сутність параметра там, де це було заборонено.

source: An incomplete character was found in the input.
uk: У вхідних даних знайдено неповний символ.

source: An entity reference contained another reference to the same entity; possibly via a different name, and possibly indirectly.
uk: Посилання на сутність містило інше посилання на ту саму сутність; можливо, через інше ім'я та, можливо, опосередковано.

source: Some unspecified syntax error was encountered.
uk: Виявлено невідому синтаксичну помилку.

source: An end tag did not match the innermost open start tag.
uk: Кінцевий тег не збігається з внутрішнім відкритим початковим тегом.

source: Some token (such as a start tag) was not closed before the end of the stream or the next token was encountered.
uk: Деякий маркер (наприклад, початковий тег) не було закрито до кінця потоку або виявлено наступний маркер.

source: A reference was made to an entity which was not defined.
uk: Було зроблено посилання на сутність, яка не була визначена.

source: The document encoding is not supported by Expat.
uk: Кодування документа не підтримується Expat.

source: A CDATA marked section was not closed.
uk: Розділ, позначений CDATA, не було закрито.

source: The parser determined that the document was not "standalone" though it declared itself to be in the XML declaration, and the :attr:`NotStandaloneHandler` was set and returned ``0``.
uk: Синтаксичний аналізатор визначив, що документ не був "автономним", хоча він оголошував себе таким у декларації XML, а :attr:`NotStandaloneHandler` було встановлено та повернуто ``0``.

source: An operation was requested that requires DTD support to be compiled in, but Expat was configured without DTD support. This should never be reported by a standard build of the :mod:`xml.parsers.expat` module.
uk: Був запит на операцію, яка потребує підтримки DTD для компіляції, але Expat було налаштовано без підтримки DTD. Стандартна збірка модуля :mod:`xml.parsers.expat` ніколи не повинна повідомляти про це.

source: A behavioral change was requested after parsing started that can only be changed before parsing has started. This is (currently) only raised by :meth:`UseForeignDTD`.
uk: Після початку аналізу надійшов запит на зміну поведінки, яку можна змінити лише до початку аналізу. Це (наразі) викликає лише :meth:`UseForeignDTD`.

source: An undeclared prefix was found when namespace processing was enabled.
uk: Коли обробку простору імен було ввімкнено, виявлено неоголошений префікс.

source: The document attempted to remove the namespace declaration associated with a prefix.
uk: У документі зроблено спробу видалити декларацію простору імен, пов’язану з префіксом.

source: A parameter entity contained incomplete markup.
uk: Сутність параметра містила неповну розмітку.

source: The document contained no document element at all.
uk: Документ взагалі не містив елемента документа.

source: There was an error parsing a text declaration in an external entity.
uk: Під час синтаксичного аналізу текстової декларації у зовнішній сутності сталася помилка.

source: Characters were found in the public id that are not allowed.
uk: У загальнодоступному ідентифікаторі знайдено неприпустимі символи.

source: The requested operation was made on a suspended parser, but isn't allowed. This includes attempts to provide additional input or to stop the parser.
uk: Потрібну операцію було виконано на призупиненому аналізаторі, але вона не дозволена. Це включає спроби надати додаткові вхідні дані або зупинити аналізатор.

source: An attempt to resume the parser was made when the parser had not been suspended.
uk: Спроба відновити аналізатор була зроблена, коли аналізатор не було призупинено.

source: This should not be reported to Python applications.
uk: Про це не слід повідомляти програми Python.

source: The requested operation was made on a parser which was finished parsing input, but isn't allowed. This includes attempts to provide additional input or to stop the parser.
uk: Потрібну операцію було виконано на синтаксичному аналізаторі, який завершив розбір вхідних даних, але це не дозволено. Це включає спроби надати додаткові вхідні дані або зупинити аналізатор.

source: Footnotes
uk: Виноски

source: The encoding string included in XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
uk: Рядок кодування, включений у вивід XML, має відповідати відповідним стандартам. Наприклад, "UTF-8" дійсний, а "UTF8" – ні. Див. https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl і https://www.iana.org/assignments/character-sets/character-sets.xhtml.
