Repository: python/python-docs-uk
Catalog: library/re.po
Languages: uk

source: :mod:`re` --- Regular expression operations
uk: :mod:`re` --- Операції регулярних виразів

source: This module provides regular expression matching operations similar to those found in Perl.
uk: Цей модуль забезпечує операції зіставлення регулярних виразів, подібні до тих, які є в Perl.

source: Both patterns and strings to be searched can be Unicode strings (:class:`str`) as well as 8-bit strings (:class:`bytes`). However, Unicode strings and 8-bit strings cannot be mixed: that is, you cannot match a Unicode string with a byte pattern or vice-versa; similarly, when asking for a substitution, the replacement string must be of the same type as both the pattern and the search string.
uk: І шаблони, і рядки для пошуку можуть бути рядками Unicode (:class:`str`), а також 8-бітовими рядками (:class:`bytes`). Однак рядки Unicode та 8-бітові рядки не можна змішувати: тобто ви не можете зіставити рядок Unicode з шаблоном байтів або навпаки; так само, коли запитується заміна, рядок заміни має бути того самого типу, що й шаблон, і рядок пошуку.

source: Regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This collides with Python's usage of the same character for the same purpose in string literals; for example, to match a literal backslash, one might have to write ``'\\\\'`` as the pattern string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. Also, please note that any invalid escape sequences in Python's usage of the backslash in string literals now generate a :exc:`DeprecationWarning` and in the future this will become a :exc:`SyntaxError`. This behaviour will happen even if it is a valid escape sequence for a regular expression.
uk: У регулярних виразах використовується символ зворотної косої риски (``'\'``), щоб позначити спеціальні форми або дозволити використовувати спеціальні символи без виклику їх спеціального значення. Це суперечить використанню Python того самого символу для тієї ж мети в рядкових літералах; наприклад, щоб відповідати буквальному зворотному слешу, можливо, доведеться написати ``'\\\\'`` як рядок шаблону, оскільки регулярний вираз має бути ``\\``, а кожен зворотний слеш має бути виражений як ``\\`` всередині звичайного рядкового літералу Python. Також зауважте, що будь-які недійсні керуючі послідовності під час використання Python зворотної косої риски в рядкових літералах тепер генерують :exc:`DeprecationWarning`, а в майбутньому це стане :exc:`SyntaxError`. Така поведінка відбуватиметься, навіть якщо це дійсна керуюча послідовність для регулярного виразу.

source: The solution is to use Python's raw string notation for regular expression patterns; backslashes are not handled in any special way in a string literal prefixed with ``'r'``. So ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Usually patterns will be expressed in Python code using this raw string notation.
uk: Рішення полягає у використанні необробленої рядкової нотації Python для шаблонів регулярних виразів; зворотні косі риски не обробляються жодним особливим чином у рядковому літералі з префіксом ``'r'``. Отже, ``r"\n"`` — це двосимвольний рядок, що містить ``'\'`` і ``'n'``, тоді як ``"\n"`` є односимвольним рядком, що містить новий рядок. Зазвичай шаблони виражаються в коді Python за допомогою цієї необробленої рядкової нотації.

source: It is important to note that most regular expression operations are available as module-level functions and methods on :ref:`compiled regular expressions <re-objects>`. The functions are shortcuts that don't require you to compile a regex object first, but miss some fine-tuning parameters.
uk: Важливо відзначити, що більшість операцій з регулярними виразами доступні як функції та методи на рівні модуля для :ref:`компільованих регулярних виразів <re-objects>`. Функції — це ярлики, які не потребують компіляції об’єкта регулярного виразу, але пропускають деякі параметри тонкого налаштування.

source: The third-party `regex <https://pypi.org/project/regex/>`_ module, which has an API compatible with the standard library :mod:`re` module, but offers additional functionality and a more thorough Unicode support.
uk: Сторонній модуль `regex <https://pypi.org/project/regex/>`_, який має API, сумісний із модулем стандартної бібліотеки :mod:`re`, але пропонує додаткові функції та більш повну підтримку Unicode.

source: Regular Expression Syntax
uk: Синтаксис регулярного виразу

source: A regular expression (or RE) specifies a set of strings that matches it; the functions in this module let you check if a particular string matches a given regular expression (or if a given regular expression matches a particular string, which comes down to the same thing).
uk: Регулярний вираз (або RE) визначає набір рядків, який йому відповідає; функції в цьому модулі дозволяють вам перевірити, чи збігається певний рядок з даним регулярним виразом (або чи збігається даний регулярний вираз з певним рядком, що зводиться до того самого).

source: Regular expressions can be concatenated to form new regular expressions; if *A* and *B* are both regular expressions, then *AB* is also a regular expression. In general, if a string *p* matches *A* and another string *q* matches *B*, the string *pq* will match AB. This holds unless *A* or *B* contain low precedence operations; boundary conditions between *A* and *B*; or have numbered group references. Thus, complex expressions can easily be constructed from simpler primitive expressions like the ones described here. For details of the theory and implementation of regular expressions, consult the Friedl book [Frie09]_, or almost any textbook about compiler construction.
uk: Регулярні вирази можна об’єднувати для створення нових регулярних виразів; якщо *A* і *B* є регулярними виразами, то *AB* також є регулярним виразом. Загалом, якщо рядок *p* відповідає *A*, а інший рядок *q* відповідає *B*, рядок *pq* відповідатиме AB. Це справедливо, якщо *A* або *B* не містять операції з низьким пріоритетом; граничні умови між *A* і *B*; або мають пронумеровані посилання на групи. Таким чином, складні вирази можна легко побудувати з простіших примітивних виразів, таких як описані тут. Щоб отримати детальну інформацію про теорію та реалізацію регулярних виразів, зверніться до книги Фрідла [Frie09]_ або майже до будь-якого підручника про побудову компілятора.

source: A brief explanation of the format of regular expressions follows. For further information and a gentler presentation, consult the :ref:`regex-howto`.
uk: Нижче наведено коротке пояснення формату регулярних виразів. Для отримання додаткової інформації та більш щадної презентації зверніться до :ref:`regex-howto`.

source: Regular expressions can contain both special and ordinary characters. Most ordinary characters, like ``'A'``, ``'a'``, or ``'0'``, are the simplest regular expressions; they simply match themselves. You can concatenate ordinary characters, so ``last`` matches the string ``'last'``. (In the rest of this section, we'll write RE's in ``this special style``, usually without quotes, and strings to be matched ``'in single quotes'``.)
uk: Регулярні вирази можуть містити як спеціальні, так і звичайні символи. Більшість звичайних символів, таких як ``'A'``, ``'a'`` або ``'0'``, є найпростішими регулярними виразами; вони просто збігаються. Ви можете об’єднувати звичайні символи, тому ``last`` збігається з рядком ``'last'``. (У решті цього розділу ми будемо писати RE в ``цим особливим стилі``, як правило, без лапок, а рядки для відповідності ``'в одинарних лапках``.)

source: Some characters, like ``'|'`` or ``'('``, are special. Special characters either stand for classes of ordinary characters, or affect how the regular expressions around them are interpreted.
uk: Деякі символи, наприклад ``'|'`` або ``'(''``, є спеціальними. Спеціальні символи або позначають класи звичайних символів, або впливають на інтерпретацію регулярних виразів навколо них.

source: The special characters are:
uk: Спеціальними символами є:

source: (Dot.) In the default mode, this matches any character except a newline. If the :const:`DOTALL` flag has been specified, this matches any character including a newline.
uk: (Точка.) У режимі за замовчуванням це відповідає будь-якому символу, крім символу нового рядка. Якщо вказано прапорець :const:`DOTALL`, він відповідає будь-якому символу, включаючи новий рядок.

source: (Caret.) Matches the start of the string, and in :const:`MULTILINE` mode also matches immediately after each newline.
uk: (Caret.) Збігається з початком рядка, а в режимі :const:`MULTILINE` також збігається одразу після кожного нового рядка.

source: Matches the end of the string or just before the newline at the end of the string, and in :const:`MULTILINE` mode also matches before a newline. ``foo`` matches both 'foo' and 'foobar', while the regular expression ``foo$`` matches only 'foo'. More interestingly, searching for ``foo.$`` in ``'foo1\nfoo2\n'`` matches 'foo2' normally, but 'foo1' in :const:`MULTILINE` mode; searching for a single ``$`` in ``'foo\n'`` will find two (empty) matches: one just before the newline, and one at the end of the string.
uk: Збігається з кінцем рядка або безпосередньо перед символом нового рядка в кінці рядка, а в режимі :const:`MULTILINE` також збігається перед символом нового рядка. ``foo`` відповідає як 'foo', так і 'foobar', тоді як регулярний вираз ``foo$`` відповідає лише 'foo'. Що ще цікавіше, пошук ``foo.$`` у ``'foo1\nfoo2\n''`` зазвичай відповідає 'foo2', але 'foo1' у режимі :const:`MULTILINE`; пошук одного ``$`` у ``'foo\n'`` знайде два (порожні) збіги: один безпосередньо перед символом нового рядка та один у кінці рядка.

source: Causes the resulting RE to match 0 or more repetitions of the preceding RE, as many repetitions as are possible. ``ab*`` will match 'a', 'ab', or 'a' followed by any number of 'b's.
uk: Примушує кінцевий RE відповідати 0 або більше повторень попереднього RE, якомога більше повторень. ``ab*`` відповідатиме 'a', 'ab' або 'a', за якими йде будь-яка кількість 'b'.

source: Causes the resulting RE to match 1 or more repetitions of the preceding RE. ``ab+`` will match 'a' followed by any non-zero number of 'b's; it will not match just 'a'.
uk: Примушує кінцевий RE відповідати 1 або більше повторень попереднього RE. ``ab+`` відповідатиме 'a', за яким слідує будь-яке ненульове число 'b'; воно не збігатиметься лише з "а".

source: Causes the resulting RE to match 0 or 1 repetitions of the preceding RE. ``ab?`` will match either 'a' or 'ab'.
uk: Примушує результуюче RE відповідати 0 або 1 повторенням попереднього RE. ``ab?`` відповідатиме або 'a', або 'ab'.

source: Specifies that exactly *m* copies of the previous RE should be matched; fewer matches cause the entire RE not to match. For example, ``a{6}`` will match exactly six ``'a'`` characters, but not five.
uk: Вказує, що точно *m* копій попереднього RE мають відповідати; менша кількість збігів призводить до того, що весь RE не збігається. Наприклад, ``a{6}`` відповідатиме рівно шести символам ``'a'``, але не п’яти.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as many repetitions as possible. For example, ``a{3,5}`` will match from 3 to 5 ``'a'`` characters. Omitting *m* specifies a lower bound of zero, and omitting *n* specifies an infinite upper bound. As an example, ``a{4,}b`` will match ``'aaaab'`` or a thousand ``'a'`` characters followed by a ``'b'``, but not ``'aaab'``. The comma may not be omitted or the modifier would be confused with the previously described form.
uk: Примушує результуючий RE відповідати від *m* до *n* повторень попереднього RE, намагаючись зіставити якомога більше повторень. Наприклад, ``a{3,5}`` відповідатиме від 3 до 5 символів ``'a'``. Пропуск *m* визначає нижню межу нуля, а пропуск *n* визначає нескінченну верхню межу. Наприклад, ``a{4,}b`` відповідатиме ``'aaaab'`` або тисячі символів ``'a'``, після яких ``'b'``, але не ``' аааб''``. Кому не можна опускати, інакше модифікатор можна сплутати з попередньо описаною формою.

source: Either escapes special characters (permitting you to match characters like ``'*'``, ``'?'``, and so forth), or signals a special sequence; special sequences are discussed below.
uk: Або екранує спеціальні символи (дозволяючи вам зіставляти такі символи, як ``'*'``, ``'?''`` і так далі), або сигналізує про спеціальну послідовність; спеціальні послідовності обговорюються нижче.

source: If you're not using a raw string to express the pattern, remember that Python also uses the backslash as an escape sequence in string literals; if the escape sequence isn't recognized by Python's parser, the backslash and subsequent character are included in the resulting string. However, if Python would recognize the resulting sequence, the backslash should be repeated twice. This is complicated and hard to understand, so it's highly recommended that you use raw strings for all but the simplest expressions.
uk: Якщо ви не використовуєте необроблений рядок для вираження шаблону, пам’ятайте, що Python також використовує зворотну косу риску як керуючу послідовність у рядкових літералах; якщо escape-послідовність не розпізнається синтаксичним аналізатором Python, зворотна коса риска та наступний символ включаються в результуючий рядок. Однак, якщо Python розпізнає отриману послідовність, зворотну косу риску слід повторити двічі. Це складно і важко зрозуміти, тому настійно рекомендується використовувати необроблені рядки для всіх виразів, крім найпростіших.

source: Used to indicate a set of characters. In a set:
uk: Використовується для позначення набору символів. В комплекті:

source: Characters can be listed individually, e.g. ``[amk]`` will match ``'a'``, ``'m'``, or ``'k'``.
uk: Символи можуть бути перераховані окремо, напр. "[amk]" відповідатиме "a", "m" або "k".

source: Ranges of characters can be indicated by giving two characters and separating them by a ``'-'``, for example ``[a-z]`` will match any lowercase ASCII letter, ``[0-5][0-9]`` will match all the two-digits numbers from ``00`` to ``59``, and ``[0-9A-Fa-f]`` will match any hexadecimal digit. If ``-`` is escaped (e.g. ``[a\-z]``) or if it's placed as the first or last character (e.g. ``[-a]`` or ``[a-]``), it will match a literal ``'-'``.
uk: Діапазони символів можна вказати, вказавши два символи та розділивши їх символом ``'-'``, наприклад, ``[a-z]`` відповідатиме будь-якій літері ASCII у нижньому регістрі, ``[0-5][0-9]. ]`` відповідатиме всім двозначним числам від ``00`` до ``59``, а ``[0-9A-Fa-f]`` відповідатиме будь-якій шістнадцятковій цифрі. Якщо ``-`` є екранованим (наприклад, ``[a\-z]``) або якщо він розміщений як перший чи останній символ (наприклад ``[-a]`` або ``[a-]`` ), він відповідатиме літералу ``'-'``.

source: Special characters lose their special meaning inside sets. For example, ``[(+*)]`` will match any of the literal characters ``'('``, ``'+'``, ``'*'``, or ``')'``.
uk: Спеціальні символи втрачають своє особливе значення в наборах. Наприклад, ``[(+*)]`` відповідатиме будь-якому з літеральних символів ``'('``, ``'+'``, ``'*'`` або ``')'``.

source: Character classes such as ``\w`` or ``\S`` (defined below) are also accepted inside a set, although the characters they match depends on whether :const:`ASCII` or :const:`LOCALE` mode is in force.
uk: Класи символів, такі як ``\w`` або ``\S`` (визначені нижче), також приймаються всередині набору, хоча символи, яким вони відповідають, залежать від режиму :const:`ASCII` або :const:`LOCALE` є чинним.

source: Characters that are not within a range can be matched by :dfn:`complementing` the set. If the first character of the set is ``'^'``, all the characters that are *not* in the set will be matched. For example, ``[^5]`` will match any character except ``'5'``, and ``[^^]`` will match any character except ``'^'``. ``^`` has no special meaning if it's not the first character in the set.
uk: Символи, які не входять до діапазону, можуть бути зіставлені шляхом :dfn:`complementing` набору. Якщо першим символом набору є ``'^'``, усі символи, яких *не* в наборі, будуть зіставлені. Наприклад, ``[^5]`` відповідатиме будь-якому символу, крім ``'5''``, а ``[^^]`` відповідатиме будь-якому символу, крім ``'^'``. ``^`` не має особливого значення, якщо це не перший символ у наборі.

source: To match a literal ``']'`` inside a set, precede it with a backslash, or place it at the beginning of the set. For example, both ``[()[\]{}]`` and ``[]()[{}]`` will both match a parenthesis.
uk: Щоб відповідати літералу ``']''`` всередині набору, поставте перед ним зворотну косу риску або розмістіть його на початку набору. Наприклад, як ``[()[\]{}]``, так і ``[]()[{}]`` відповідатимуть дужці.

source: Support of nested sets and set operations as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax, so to facilitate this change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That includes sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning escape them with a backslash.
uk: У майбутньому може бути додано підтримку вкладених наборів і операцій із наборами, як у `технічному стандарті Unicode #18`_. Це призведе до зміни синтаксису, тож для полегшення цієї зміни :exc:`FutureWarning` наразі буде викликано у неоднозначних випадках. Це включає в себе набори, що починаються з літерала ``'['`` або містять літеральні послідовності символів ``'--'``, ``'&&'``, ``'~~'`` і ``'| |'``. Щоб уникнути попередження, екрануйте їх зворотною скісною рискою.

source: :exc:`FutureWarning` is raised if a character set contains constructs that will change semantically in the future.
uk: :exc:`FutureWarning` викликається, якщо набір символів містить конструкції, які семантично зміняться в майбутньому.

source: ``A|B``, where *A* and *B* can be arbitrary REs, creates a regular expression that will match either *A* or *B*. An arbitrary number of REs can be separated by the ``'|'`` in this way. This can be used inside groups (see below) as well. As the target string is scanned, REs separated by ``'|'`` are tried from left to right. When one pattern completely matches, that branch is accepted. This means that once *A* matches, *B* will not be tested further, even if it would produce a longer overall match. In other words, the ``'|'`` operator is never greedy. To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
uk: ``A|B``, де *A* і *B* можуть бути довільними RE, створює регулярний вираз, який відповідатиме *A* або *B*. Таким чином довільна кількість RE може бути розділена символом ``'|'``. Це також можна використовувати всередині груп (див. нижче). Під час сканування цільового рядка RE, розділені ``'|'``, пробуються зліва направо. Якщо один шаблон повністю збігається, ця гілка приймається. Це означає, що як тільки *A* збігається, *B* більше не перевірятиметься, навіть якщо це призведе до довшого загального збігу. Іншими словами, оператор ``'|''`` ніколи не є жадібним. Щоб відповідати літералу ``'|'``, використовуйте ``\|`` або вкладіть його в клас символів, як у ``[|]``.

source: Matches whatever regular expression is inside the parentheses, and indicates the start and end of a group; the contents of a group can be retrieved after a match has been performed, and can be matched later in the string with the ``\number`` special sequence, described below. To match the literals ``'('`` or ``')'``, use ``\(`` or ``\)``, or enclose them inside a character class: ``[(]``, ``[)]``.
uk: Збігається з будь-яким регулярним виразом у дужках і вказує на початок і кінець групи; вміст групи може бути отриманий після того, як було виконано збіг, і може бути зіставлений пізніше в рядку за допомогою спеціальної послідовності ``\number``, описаної нижче. Щоб зіставити літерали ``'('`` або ``')'``, використовуйте ``\(`` або ``\)`` або вкладіть їх у клас символів: ``[(]`` , ``[)]``.

source: This is an extension notation (a ``'?'`` following a ``'('`` is not meaningful otherwise). The first character after the ``'?'`` determines what the meaning and further syntax of the construct is. Extensions usually do not create a new group; ``(?P<name>...)`` is the only exception to this rule. Following are the currently supported extensions.
uk: Це нотація розширення (``'?''`` після ``' (''`` не має значення інакше). Перший символ після ``'?''`` визначає значення та подальший синтаксис Розширення зазвичай не створюють нову групу; ``(?P <name> ...)`` є єдиним винятком із цього правила. Нижче наведено наразі підтримувані розширення.

source: (One or more letters from the set ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``.) The group matches the empty string; the letters set the corresponding flags: :const:`re.A` (ASCII-only matching), :const:`re.I` (ignore case), :const:`re.L` (locale dependent), :const:`re.M` (multi-line), :const:`re.S` (dot matches all), :const:`re.U` (Unicode matching), and :const:`re.X` (verbose), for the entire regular expression. (The flags are described in :ref:`contents-of-module-re`.) This is useful if you wish to include the flags as part of the regular expression, instead of passing a *flag* argument to the :func:`re.compile` function. Flags should be used first in the expression string.
uk: (Одна або кілька літер із набору ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``.) Група відповідає порожньому рядку; літери встановлюють відповідні позначки: :const:`re.A` (відповідність лише ASCII), :const:`re.I` (ігнорувати регістр), :const:`re.L` (залежно від локалі), :const:`re.M` (багаторядковий), :const:`re.S` (крапка відповідає всім), :const:`re.U` (відповідність Unicode) і :const:`re.X` (дослівний ), для всього регулярного виразу. (Прапори описано в :ref:`contents-of-module-re`.) Це корисно, якщо ви бажаєте включити прапори як частину регулярного виразу замість передачі аргументу *flag* до функція :func:`re.compile`. Прапори слід використовувати першими в рядку виразу.

source: A non-capturing version of regular parentheses. Matches whatever regular expression is inside the parentheses, but the substring matched by the group *cannot* be retrieved after performing a match or referenced later in the pattern.
uk: Версія звичайних круглих дужок без захоплення. Збігається з будь-яким регулярним виразом у дужках, але підрядок, який відповідає групі, *неможливо* отримати після виконання збігу або посилатися на нього пізніше в шаблоні.
