Repository: python/python-docs-uk
Catalog: library/re.po
Languages: uk

source: :const:`re.LOCALE` can be used only with bytes patterns and is not compatible with :const:`re.ASCII`.
uk: :const:`re.LOCALE` можна використовувати лише з шаблонами байтів і несумісний з :const:`re.ASCII`.

source: Compiled regular expression objects with the :const:`re.LOCALE` flag no longer depend on the locale at compile time. Only the locale at matching time affects the result of matching.
uk: Зкомпільовані регулярні вирази з прапорцем :const:`re.LOCALE` більше не залежать від локалі під час компіляції. Лише локаль під час зіставлення впливає на результат зіставлення.

source: When specified, the pattern character ``'^'`` matches at the beginning of the string and at the beginning of each line (immediately following each newline); and the pattern character ``'$'`` matches at the end of the string and at the end of each line (immediately preceding each newline). By default, ``'^'`` matches only at the beginning of the string, and ``'$'`` only at the end of the string and immediately before the newline (if any) at the end of the string. Corresponds to the inline flag ``(?m)``.
uk: Якщо вказано, символ шаблону ``'^'`` збігається на початку рядка та на початку кожного рядка (відразу після кожного нового рядка); і символ шаблону ``'$'`` збігається в кінці рядка та в кінці кожного рядка (безпосередньо перед кожним новим рядком). За замовчуванням ``'^'`` збігається лише на початку рядка, а ``'$'`` лише в кінці рядка та безпосередньо перед символом нового рядка (якщо є) у кінці рядка. Відповідає вбудованому прапору ``(?m)``.

source: Make the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline. Corresponds to the inline flag ``(?s)``.
uk: Зробіть так, щоб спеціальний символ ``'.'`` відповідав будь-якому символу взагалі, включаючи новий рядок; без цього прапорця ``'.'`` відповідатиме будь-чому *крім* нового рядка. Відповідає вбудованому прапору ``(?s)``.

source: This flag allows you to write regular expressions that look nicer and are more readable by allowing you to visually separate logical sections of the pattern and add comments. Whitespace within the pattern is ignored, except when in a character class, or when preceded by an unescaped backslash, or within tokens like ``*?``, ``(?:`` or ``(?P<...>``. When a line contains a ``#`` that is not in a character class and is not preceded by an unescaped backslash, all characters from the leftmost such ``#`` through the end of the line are ignored.
uk: Цей прапорець дозволяє писати регулярні вирази, які виглядають привабливіше та легше читаються, дозволяючи візуально відокремлювати логічні частини шаблону та додавати коментарі. Пробіли в шаблоні ігноруються, за винятком випадків, коли вони містяться в класі символів, або коли перед ними стоїть неекранована зворотна скісна риска, або в межах таких токенів, як ``*?``, ``(?:`` або ``(?P <...>``. Якщо рядок містить ``#``, який не входить до класу символів і якому не передує неекранована зворотна скісна риска, усі символи від самого лівого, наприклад ``#`` до кінця рядка, ігноруються.

source: This means that the two following regular expression objects that match a decimal number are functionally equal::
uk: Це означає, що два наступних об’єкти регулярного виразу, які відповідають десятковому числу, функціонально однакові:

source: Corresponds to the inline flag ``(?x)``.
uk: Відповідає вбудованому прапору ``(?x)``.

source: Functions
uk: Функції

source: Compile a regular expression pattern into a :ref:`regular expression object <re-objects>`, which can be used for matching using its :func:`~Pattern.match`, :func:`~Pattern.search` and other methods, described below.
uk: Скомпілюйте шаблон регулярного виразу в :ref:`об’єкт регулярного виразу <re-objects>`, який можна використовувати для зіставлення за допомогою його :func:`~Pattern.match`, :func:`~Pattern.search` та інших методів, описаних нижче .

source: The expression's behaviour can be modified by specifying a *flags* value. Values can be any of the following variables, combined using bitwise OR (the ``|`` operator).
uk: Поведінку виразу можна змінити, вказавши значення *flags*. Значеннями можуть бути будь-які з наведених нижче змінних, об’єднаних за допомогою побітового АБО (оператор ``|``).

source: The sequence ::
uk: Послідовність ::

source: is equivalent to ::
uk: еквівалентно ::

source: but using :func:`re.compile` and saving the resulting regular expression object for reuse is more efficient when the expression will be used several times in a single program.
uk: але використання :func:`re.compile` і збереження отриманого об’єкта регулярного виразу для повторного використання ефективніше, якщо вираз використовуватиметься кілька разів в одній програмі.

source: The compiled versions of the most recent patterns passed to :func:`re.compile` and the module-level matching functions are cached, so programs that use only a few regular expressions at a time needn't worry about compiling regular expressions.
uk: Зібрані версії найновіших шаблонів, переданих до :func:`re.compile`, і функції відповідності на рівні модуля кешуються, тому програмам, які використовують лише кілька регулярних виразів одночасно, не потрібно турбуватися про компіляцію регулярних виразів.

source: Scan through *string* looking for the first location where the regular expression *pattern* produces a match, and return a corresponding :ref:`match object <match-objects>`. Return ``None`` if no position in the string matches the pattern; note that this is different from finding a zero-length match at some point in the string.
uk: Перегляньте *рядок*, шукаючи перше розташування, де регулярний вираз *шаблон* створює збіг, і поверніть відповідний :ref:`об’єкт відповідності <match-objects>`. Повертає ``None``, якщо жодна позиція в рядку не відповідає шаблону; зауважте, що це відрізняється від пошуку збігу нульової довжини в деякій точці рядка.

source: If zero or more characters at the beginning of *string* match the regular expression *pattern*, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
uk: Якщо нуль або більше символів на початку *string* відповідає регулярному виразу *pattern*, поверніть відповідний :ref:`match object <match-objects>`. Повертає ``None``, якщо рядок не відповідає шаблону; зауважте, що це відрізняється від збігу нульової довжини.

source: Note that even in :const:`MULTILINE` mode, :func:`re.match` will only match at the beginning of the string and not at the beginning of each line.
uk: Зауважте, що навіть у режимі :const:`MULTILINE` :func:`re.match` збігатиметься лише на початку рядка, а не на початку кожного рядка.

source: If you want to locate a match anywhere in *string*, use :func:`search` instead (see also :ref:`search-vs-match`).
uk: Якщо ви хочете знайти збіг будь-де в *string*, використовуйте натомість :func:`search` (див. також :ref:`search-vs-match`).

source: If the whole *string* matches the regular expression *pattern*, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
uk: Якщо весь *рядок* відповідає регулярному виразу *шаблону*, поверніть відповідний :ref:`об’єкт відповідності <match-objects>`. Повертає ``None``, якщо рядок не відповідає шаблону; зауважте, що це відрізняється від збігу нульової довжини.

source: Split *string* by the occurrences of *pattern*. If capturing parentheses are used in *pattern*, then the text of all groups in the pattern are also returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits occur, and the remainder of the string is returned as the final element of the list. ::
uk: Розділіть *рядок* на входження *шаблону*. Якщо в *шаблоні* використовуються дужки для захоплення, тоді текст усіх груп у шаблоні також повертається як частина результуючого списку. Якщо *maxsplit* відмінний від нуля, відбувається не більше ніж *maxsplit*, а залишок рядка повертається як останній елемент списку. ::

source: If there are capturing groups in the separator and it matches at the start of the string, the result will start with an empty string. The same holds for the end of the string::
uk: Якщо в розділювачі є групи захоплення, і він збігається на початку рядка, результат розпочнеться з порожнього рядка. Те саме стосується кінця рядка::

source: That way, separator components are always found at the same relative indices within the result list.
uk: Таким чином, компоненти роздільників завжди знаходяться за однаковими відносними індексами в списку результатів.

source: Empty matches for the pattern split the string only when not adjacent to a previous empty match.
uk: Порожні збіги для шаблону розділяють рядок лише тоді, коли вони не суміжні з попереднім порожнім збігом.

source: Added the optional flags argument.
uk: Додано необов’язковий аргумент flags.

source: Added support of splitting on a pattern that could match an empty string.
uk: Додано підтримку розбиття на шаблон, який може відповідати порожньому рядку.

source: Return all non-overlapping matches of *pattern* in *string*, as a list of strings or tuples. The *string* is scanned left-to-right, and matches are returned in the order found. Empty matches are included in the result.
uk: Повертає всі неперекриваючі збіги *шаблону* в *рядку* у вигляді списку рядків або кортежів. *Рядок* сканується зліва направо, і збіги повертаються в порядку знайдення. Порожні збіги включаються в результат.

source: The result depends on the number of capturing groups in the pattern. If there are no groups, return a list of strings matching the whole pattern. If there is exactly one group, return a list of strings matching that group. If multiple groups are present, return a list of tuples of strings matching the groups. Non-capturing groups do not affect the form of the result.
uk: Результат залежить від кількості груп захоплення в шаблоні. Якщо груп немає, поверніть список рядків, які відповідають повному шаблону. Якщо існує рівно одна група, поверніть список рядків, які відповідають цій групі. Якщо присутні кілька груп, поверніть список кортежів рядків, які відповідають групам. Незахоплюючі групи не впливають на форму результату.

source: Non-empty matches can now start just after a previous empty match.
uk: Непорожні збіги тепер можуть починатися одразу після попереднього порожнього збігу.

source: Return an :term:`iterator` yielding :ref:`match objects <match-objects>` over all non-overlapping matches for the RE *pattern* in *string*. The *string* is scanned left-to-right, and matches are returned in the order found. Empty matches are included in the result.
uk: Повертає :term:`iterator`, що дає :ref:`match об’єкти <match-objects>` над усіма неперекриваючими збігами для *шаблону* RE в *рядку*. *Рядок* сканується зліва направо, і збіги повертаються в порядку знайдення. Порожні збіги включаються в результат.

source: Return the string obtained by replacing the leftmost non-overlapping occurrences of *pattern* in *string* by the replacement *repl*. If the pattern isn't found, *string* is returned unchanged. *repl* can be a string or a function; if it is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes of ASCII letters are reserved for future use and treated as errors. Other unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by group 6 in the pattern. For example::
uk: Повертає рядок, отриманий шляхом заміни крайніх лівих неперекриваючих входжень *pattern* у *string* на заміну *repl*. Якщо шаблон не знайдено, *рядок* повертається без змін. *repl* може бути рядком або функцією; якщо це рядок, будь-які вихідні символи зворотної косої риски в ньому обробляються. Тобто ``\n`` перетворюється на один символ нового рядка, ``\r`` перетворюється на повернення каретки і так далі. Невідомі вихідні коди літер ASCII зарезервовано для майбутнього використання та розглядаються як помилки. Інші невідомі вихідні сигнали, такі як ``\&`` залишаються в спокої. Зворотні посилання, такі як ``\6``, замінюються підрядком, який відповідає групі 6 у шаблоні. Наприклад::

source: If *repl* is a function, it is called for every non-overlapping occurrence of *pattern*. The function takes a single :ref:`match object <match-objects>` argument, and returns the replacement string. For example::
uk: Якщо *repl* є функцією, вона викликається для кожного неперекриваючого входження *шаблону*. Функція приймає один аргумент :ref:`match object <match-objects>` і повертає рядок заміни. Наприклад::

source: The pattern may be a string or a :ref:`pattern object <re-objects>`.
uk: Шаблон може бути рядком або :ref:`об’єктом шаблону <re-objects>`.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. If omitted or zero, all occurrences will be replaced. Empty matches for the pattern are replaced only when not adjacent to a previous empty match, so ``sub('x*', '-', 'abxd')`` returns ``'-a-b--d-'``.
uk: Необов’язковий аргумент *count* — це максимальна кількість шаблонів, які потрібно замінити; *count* має бути невід’ємним цілим числом. Якщо опущено або дорівнює нулю, усі входження буде замінено. Порожні збіги для шаблону замінюються лише тоді, коли вони не суміжні з попереднім порожнім збігом, тому ``sub('x*', '-', 'abxd')`` повертає ``'-a-b--d-'`` .

source: In string-type *repl* arguments, in addition to the character escapes and backreferences described above, ``\g<name>`` will use the substring matched by the group named ``name``, as defined by the ``(?P<name>...)`` syntax. ``\g<number>`` uses the corresponding group number; ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement such as ``\g<2>0``. ``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``. The backreference ``\g<0>`` substitutes in the entire substring matched by the RE.
uk: В аргументах рядкового типу *repl*, на додаток до екранованих символів і зворотних посилань, описаних вище, ``\g <name>`` використовуватиме підрядок, який відповідає групі з назвою ``name``, як визначено ``(? P <name> ...)`` синтаксис. ``\g <number>`` використовує відповідний номер групи; ``\g <2>``, отже, еквівалентний ``\2``, але не є неоднозначним у заміні, такій як ``\g <2> 0``. ``\20`` інтерпретуватиметься як посилання на групу 20, а не як посилання на групу 2, за якою йде літеральний символ ``'0'``. Зворотне посилання ``\g <0>`` замінює весь підрядок, який відповідає RE.

source: Unmatched groups are replaced with an empty string.
uk: Невідповідні групи замінюються порожнім рядком.

source: Unknown escapes in *pattern* consisting of ``'\'`` and an ASCII letter now are errors.
uk: Невідомі вихідні коди в *шаблоні*, що складаються з ``'\'`` і літери ASCII, тепер є помилками.

source: Unknown escapes in *repl* consisting of ``'\'`` and an ASCII letter now are errors.
uk: Невідомі вихідні символи в *repl*, які складаються з ``'\'`` і літери ASCII, тепер є помилками.

source: Empty matches for the pattern are replaced when adjacent to a previous non-empty match.
uk: Порожні збіги для шаблону замінюються, якщо вони суміжні з попереднім непорожнім збігом.

source: Perform the same operation as :func:`sub`, but return a tuple ``(new_string, number_of_subs_made)``.
uk: Виконайте ту саму операцію, що й :func:`sub`, але поверніть кортеж ``(new_string, number_of_subs_made)``.

source: Escape special characters in *pattern*. This is useful if you want to match an arbitrary literal string that may have regular expression metacharacters in it. For example::
uk: Екранування спеціальних символів у *шаблоні*. Це корисно, якщо ви хочете зіставити довільний рядок літералу, який може містити метасимволи регулярного виразу. Наприклад::

source: This function must not be used for the replacement string in :func:`sub` and :func:`subn`, only backslashes should be escaped. For example::
uk: Цю функцію не можна використовувати для рядка заміни в :func:`sub` і :func:`subn`, слід екранувати лише зворотні косі риски. Наприклад::

source: The ``'_'`` character is no longer escaped.
uk: Символ "_" більше не екранується.

source: Only characters that can have special meaning in a regular expression are escaped. As a result, ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'``, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'``, and ``"`"`` are no longer escaped.
uk: Екрануються лише символи, які можуть мати спеціальне значення в регулярному виразі. У результаті ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'` `, ``':'``, ``';'``, ``' <'``, ``'='``, ``'> '``, ``'@'`` і ``"`"`` більше не екрануються.

source: Clear the regular expression cache.
uk: Очистити кеш регулярних виразів.

source: Exceptions
uk: Винятки

source: Exception raised when a string passed to one of the functions here is not a valid regular expression (for example, it might contain unmatched parentheses) or when some other error occurs during compilation or matching. It is never an error if a string contains no match for a pattern. The error instance has the following additional attributes:
uk: Виняток виникає, коли рядок, переданий одній із функцій тут, не є дійсним регулярним виразом (наприклад, він може містити невідповідні дужки) або коли під час компіляції чи зіставлення виникає інша помилка. Ніколи не буде помилкою, якщо рядок не містить збігів для шаблону. Екземпляр помилки має такі додаткові атрибути:

source: The unformatted error message.
uk: Неформатне повідомлення про помилку.

source: The regular expression pattern.
uk: Шаблон регулярного виразу.

source: The index in *pattern* where compilation failed (may be ``None``).
uk: Індекс у *шаблоні*, де не вдалося компілювати (може бути ``None``).

source: The line corresponding to *pos* (may be ``None``).
uk: Рядок, що відповідає *pos* (може бути ``None``).

source: The column corresponding to *pos* (may be ``None``).
uk: Стовпець, що відповідає *pos* (може бути ``None``).

source: Added additional attributes.
uk: Додані додаткові атрибути.

source: Regular Expression Objects
uk: Об’єкти регулярного виразу

source: Compiled regular expression objects support the following methods and attributes:
uk: Зкомпільовані об’єкти регулярного виразу підтримують наступні методи та атрибути:

source: Scan through *string* looking for the first location where this regular expression produces a match, and return a corresponding :ref:`match object <match-objects>`. Return ``None`` if no position in the string matches the pattern; note that this is different from finding a zero-length match at some point in the string.
uk: Проскануйте *рядок*, шукаючи перше місце, де цей регулярний вираз створює збіг, і поверніть відповідний :ref:`об’єкт відповідності <match-objects>`. Повертає ``None``, якщо жодна позиція в рядку не відповідає шаблону; зауважте, що це відрізняється від пошуку збігу нульової довжини в деякій точці рядка.

source: The optional second parameter *pos* gives an index in the string where the search is to start; it defaults to ``0``. This is not completely equivalent to slicing the string; the ``'^'`` pattern character matches at the real beginning of the string and at positions just after a newline, but not necessarily at the index where the search is to start.
uk: Необов’язковий другий параметр *pos* дає індекс у рядку, з якого має початися пошук; за замовчуванням ``0``. Це не зовсім еквівалентно нарізанню струни; символ шаблону ``'^'`` збігається на справжньому початку рядка та в позиціях одразу після нового рядка, але не обов’язково в індексі, з якого має початися пошук.

source: The optional parameter *endpos* limits how far the string will be searched; it will be as if the string is *endpos* characters long, so only the characters from *pos* to ``endpos - 1`` will be searched for a match. If *endpos* is less than *pos*, no match will be found; otherwise, if *rx* is a compiled regular expression object, ``rx.search(string, 0, 50)`` is equivalent to ``rx.search(string[:50], 0)``. ::
uk: Необов'язковий параметр *endpos* обмежує, наскільки далеко буде здійснюватися пошук рядка; це буде так, ніби рядок складається з *endpos* символів, тому шукатимуть збіги лише за символами від *pos* до ``endpos - 1``. Якщо *endpos* менше ніж *pos*, збіг не знайдено; інакше, якщо *rx* є скомпільованим об’єктом регулярного виразу, ``rx.search(string, 0, 50)`` еквівалентно ``rx.search(string[:50], 0)``. ::

source: If zero or more characters at the *beginning* of *string* match this regular expression, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
uk: Якщо цьому регулярному виразу відповідає нуль або більше символів на *початку* *рядка*, повертається відповідний :ref:`об’єкт відповідності <match-objects>`. Повертає ``None``, якщо рядок не відповідає шаблону; зауважте, що це відрізняється від збігу нульової довжини.

source: The optional *pos* and *endpos* parameters have the same meaning as for the :meth:`~Pattern.search` method. ::
uk: Необов’язкові параметри *pos* і *endpos* мають те саме значення, що й для методу :meth:`~Pattern.search`. ::

source: If you want to locate a match anywhere in *string*, use :meth:`~Pattern.search` instead (see also :ref:`search-vs-match`).
uk: Якщо ви хочете знайти збіг будь-де в *string*, використовуйте натомість :meth:`~Pattern.search` (див. також :ref:`search-vs-match`).

source: If the whole *string* matches this regular expression, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
uk: Якщо весь *рядок* відповідає цьому регулярному виразу, поверніть відповідний :ref:`match object <match-objects>`. Повертає ``None``, якщо рядок не відповідає шаблону; зауважте, що це відрізняється від збігу нульової довжини.

source: Identical to the :func:`split` function, using the compiled pattern.
uk: Ідентична функції :func:`split`, використовуючи скомпільований шаблон.

source: Similar to the :func:`findall` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
uk: Подібно до функції :func:`findall`, використовує скомпільований шаблон, але також приймає додаткові параметри *pos* і *endpos*, які обмежують область пошуку, як для :meth:`search`.

source: Similar to the :func:`finditer` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
uk: Подібно до функції :func:`finditer`, яка використовує скомпільований шаблон, але також приймає додаткові параметри *pos* і *endpos*, які обмежують область пошуку, як для :meth:`search`.

source: Identical to the :func:`sub` function, using the compiled pattern.
uk: Ідентична функції :func:`sub`, використовуючи скомпільований шаблон.

source: Identical to the :func:`subn` function, using the compiled pattern.
uk: Ідентична функції :func:`subn`, використовуючи скомпільований шаблон.
