Repository: python/python-docs-uk
Catalog: library/re.po
Languages: uk

source: The regex matching flags. This is a combination of the flags given to :func:`.compile`, any ``(?...)`` inline flags in the pattern, and implicit flags such as :data:`UNICODE` if the pattern is a Unicode string.
uk: Прапори відповідності регулярних виразів. Це комбінація прапорів, наданих :func:`.compile`, будь-яких вбудованих прапорів ``(?...)`` у шаблоні та неявних прапорів, таких як :data:`UNICODE`, якщо шаблон є Рядок Unicode.

source: The number of capturing groups in the pattern.
uk: Кількість груп захоплення в шаблоні.

source: A dictionary mapping any symbolic group names defined by ``(?P<id>)`` to group numbers. The dictionary is empty if no symbolic groups were used in the pattern.
uk: Словник, що відображає будь-які символічні назви груп, визначені ``(?P <id> )``, на номери груп. Словник порожній, якщо в шаблоні не використовувалися символічні групи.

source: The pattern string from which the pattern object was compiled.
uk: Рядок шаблону, з якого було скомпільовано об’єкт шаблону.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Compiled regular expression objects are considered atomic.
uk: Додано підтримку :func:`copy.copy` і :func:`copy.deepcopy`. Зкомпільовані об’єкти регулярного виразу вважаються атомарними.

source: Match Objects
uk: Зіставте об’єкти

source: Match objects always have a boolean value of ``True``. Since :meth:`~Pattern.match` and :meth:`~Pattern.search` return ``None`` when there is no match, you can test whether there was a match with a simple ``if`` statement::
uk: Об’єкти відповідності завжди мають логічне значення ``True``. Оскільки :meth:`~Pattern.match` і :meth:`~Pattern.search` повертають ``None`` за відсутності збігу, ви можете перевірити, чи був збіг за допомогою простого оператора ``if``: :

source: Match objects support the following methods and attributes:
uk: Об’єкти відповідності підтримують такі методи й атрибути:

source: Return the string obtained by doing backslash substitution on the template string *template*, as done by the :meth:`~Pattern.sub` method. Escapes such as ``\n`` are converted to the appropriate characters, and numeric backreferences (``\1``, ``\2``) and named backreferences (``\g<1>``, ``\g<name>``) are replaced by the contents of the corresponding group.
uk: Повертає рядок, отриманий заміною зворотної похилої риски в рядку шаблону *template*, як це робиться методом :meth:`~Pattern.sub`. Екрани, такі як ``\n``, перетворюються на відповідні символи, а також числові зворотні посилання (``\1``, ``\2``) і іменовані зворотні посилання (``\g <1>``, ``\g <name>``) замінюються вмістом відповідної групи.

source: Returns one or more subgroups of the match. If there is a single argument, the result is a single string; if there are multiple arguments, the result is a tuple with one item per argument. Without arguments, *group1* defaults to zero (the whole match is returned). If a *groupN* argument is zero, the corresponding return value is the entire matching string; if it is in the inclusive range [1..99], it is the string matching the corresponding parenthesized group. If a group number is negative or larger than the number of groups defined in the pattern, an :exc:`IndexError` exception is raised. If a group is contained in a part of the pattern that did not match, the corresponding result is ``None``. If a group is contained in a part of the pattern that matched multiple times, the last match is returned. ::
uk: Повертає одну або кілька підгруп збігу. Якщо є один аргумент, результатом буде один рядок; якщо є кілька аргументів, результатом є кортеж з одним елементом на аргумент. Без аргументів *group1* за замовчуванням дорівнює нулю (повертається весь збіг). Якщо аргумент *groupN* дорівнює нулю, відповідним значенням, що повертається, є весь відповідний рядок; якщо він знаходиться у включному діапазоні [1..99], це рядок, що відповідає відповідній групі в дужках. Якщо номер групи є від’ємним або перевищує кількість груп, визначених у шаблоні, виникає виняток :exc:`IndexError`. Якщо група міститься в частині шаблону, яка не відповідає, відповідним результатом є ``None``. Якщо група міститься в частині шаблону, яка збігалася кілька разів, повертається останній збіг. ::

source: If the regular expression uses the ``(?P<name>...)`` syntax, the *groupN* arguments may also be strings identifying groups by their group name. If a string argument is not used as a group name in the pattern, an :exc:`IndexError` exception is raised.
uk: Якщо регулярний вираз використовує синтаксис ``(?P <name> ...)``, аргументи *groupN* також можуть бути рядками, що ідентифікують групи за назвою групи. Якщо рядковий аргумент не використовується як ім’я групи в шаблоні, виникає виняток :exc:`IndexError`.

source: A moderately complicated example::
uk: Помірно складний приклад:

source: Named groups can also be referred to by their index::
uk: Іменовані групи також можна посилатися за їх індексом::

source: If a group matches multiple times, only the last match is accessible::
uk: Якщо група збігається кілька разів, доступним буде лише останній збіг::

source: This is identical to ``m.group(g)``. This allows easier access to an individual group from a match::
uk: Це ідентично ``m.group(g)``. Це дозволяє легше отримати доступ до окремої групи з матчу::

source: Return a tuple containing all the subgroups of the match, from 1 up to however many groups are in the pattern. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``.
uk: Повертає кортеж, що містить усі підгрупи відповідності, від 1 до будь-якої кількості груп у шаблоні. Аргумент *default* використовується для груп, які не брали участі в матчі; за замовчуванням ``None``.

source: For example::
uk: Наприклад::

source: If we make the decimal place and everything after it optional, not all groups might participate in the match. These groups will default to ``None`` unless the *default* argument is given::
uk: Якщо ми зробимо знак після коми необов’язковим, не всі групи можуть брати участь у матчі. Для цих груп за замовчуванням буде ``None``, якщо не вказано аргумент *default*::

source: Return a dictionary containing all the *named* subgroups of the match, keyed by the subgroup name. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``. For example::
uk: Повертає словник, що містить усі *іменовані* підгрупи збігу, ключ яких містить назву підгрупи. Аргумент *default* використовується для груп, які не брали участі в матчі; за замовчуванням ``None``. Наприклад::

source: Return the indices of the start and end of the substring matched by *group*; *group* defaults to zero (meaning the whole matched substring). Return ``-1`` if *group* exists but did not contribute to the match. For a match object *m*, and a group *g* that did contribute to the match, the substring matched by group *g* (equivalent to ``m.group(g)``) is ::
uk: Повертає індекси початку та кінця підрядка, які відповідають *групі*; *group* за замовчуванням дорівнює нулю (це означає весь відповідний підрядок). Повертає ``-1``, якщо *група* існує, але не брала участі в матчі. Для об’єкта збігу *m* і групи *g*, яка внесла свій внесок у збіг, підрядок, який відповідає групі *g* (еквівалент ``m.group(g)``) є ::

source: Note that ``m.start(group)`` will equal ``m.end(group)`` if *group* matched a null string. For example, after ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` is 1, ``m.end(0)`` is 2, ``m.start(1)`` and ``m.end(1)`` are both 2, and ``m.start(2)`` raises an :exc:`IndexError` exception.
uk: Зауважте, що ``m.start(group)`` дорівнюватиме ``m.end(group)``, якщо *group* відповідає нульовому рядку. Наприклад, після ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` дорівнює 1, ``m.end(0)`` дорівнює 2, ``m.start(1)`` і ``m.end(1)`` мають значення 2, а ``m.start(2)`` викликає виняток :exc:`IndexError`.

source: An example that will remove *remove_this* from email addresses::
uk: Приклад видалення *remove_this* з електронних адрес::

source: For a match *m*, return the 2-tuple ``(m.start(group), m.end(group))``. Note that if *group* did not contribute to the match, this is ``(-1, -1)``. *group* defaults to zero, the entire match.
uk: Для збігу *m* поверніть 2-кортеж ``(m.start(group), m.end(group))``. Зауважте, що якщо *група* не брала участі в матчі, це ``(-1, -1)``. *група* за замовчуванням дорівнює нулю, весь збіг.

source: The value of *pos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string at which the RE engine started looking for a match.
uk: Значення *pos*, яке було передано в метод :meth:`~Pattern.search` або :meth:`~Pattern.match` об’єкта :ref:`regex <re-objects>`. Це індекс у рядку, за яким механізм RE почав шукати збіг.

source: The value of *endpos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string beyond which the RE engine will not go.
uk: Значення *endpos*, яке було передано в метод :meth:`~Pattern.search` або :meth:`~Pattern.match` об’єкта :ref:`regex <re-objects>`. Це індекс у рядку, за який механізм RE не виходить.

source: The integer index of the last matched capturing group, or ``None`` if no group was matched at all. For example, the expressions ``(a)b``, ``((a)(b))``, and ``((ab))`` will have ``lastindex == 1`` if applied to the string ``'ab'``, while the expression ``(a)(b)`` will have ``lastindex == 2``, if applied to the same string.
uk: Цілочисельний індекс останньої відповідної групи захоплення або ``None``, якщо жодна група не була знайдена взагалі. Наприклад, вирази ``(a)b``, ``((a)(b))`` і ``((ab))`` матимуть ``lastindex == 1``, якщо застосувати до рядок ``'ab''``, тоді як вираз ``(a)(b)`` матиме ``lastindex == 2``, якщо застосувати до того самого рядка.

source: The name of the last matched capturing group, or ``None`` if the group didn't have a name, or if no group was matched at all.
uk: Ім’я останньої відповідної групи захоплення або ``None``, якщо група не мала назви, або якщо жодна група не була знайдена взагалі.

source: The :ref:`regular expression object <re-objects>` whose :meth:`~Pattern.match` or :meth:`~Pattern.search` method produced this match instance.
uk: Об’єкт :ref:`регулярного виразу <re-objects>`, чий метод :meth:`~Pattern.match` або :meth:`~Pattern.search` створив цей екземпляр відповідності.

source: The string passed to :meth:`~Pattern.match` or :meth:`~Pattern.search`.
uk: Рядок передається до :meth:`~Pattern.match` або :meth:`~Pattern.search`.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Match objects are considered atomic.
uk: Додано підтримку :func:`copy.copy` і :func:`copy.deepcopy`. Об'єкти відповідності вважаються атомарними.

source: Regular Expression Examples
uk: Приклади регулярних виразів

source: Checking for a Pair
uk: Перевірка на пару

source: In this example, we'll use the following helper function to display match objects a little more gracefully::
uk: У цьому прикладі ми використаємо наступну допоміжну функцію, щоб відобразити об’єкти відповідності трохи витонченіше:

source: Suppose you are writing a poker program where a player's hand is represented as a 5-character string with each character representing a card, "a" for ace, "k" for king, "q" for queen, "j" for jack, "t" for 10, and "2" through "9" representing the card with that value.
uk: Припустімо, що ви пишете покерну програму, де рука гравця представлена у вигляді рядка з 5 символів, де кожен символ представляє карту, "a" — туз, "k" — король, "q" — дама, "j" — валет, "t" означає 10 і "2" - "9", що представляють картку з таким значенням.

source: To see if a given string is a valid hand, one could do the following::
uk: Щоб перевірити, чи даний рядок є правильною рукою, можна зробити наступне:

source: That last hand, ``"727ak"``, contained a pair, or two of the same valued cards. To match this with a regular expression, one could use backreferences as such::
uk: Ця остання роздача, ``"727ak"``, містила пару або дві карти однакового значення. Щоб зіставити це з регулярним виразом, можна використовувати зворотні посилання як такі:

source: To find out what card the pair consists of, one could use the :meth:`~Match.group` method of the match object in the following manner::
uk: Щоб дізнатися, з якої карти складається пара, можна використати метод :meth:`~Match.group` об’єкта відповідності таким чином:

source: Simulating scanf()
uk: Імітація scanf()

source: Python does not currently have an equivalent to :c:func:`scanf`. Regular expressions are generally more powerful, though also more verbose, than :c:func:`scanf` format strings. The table below offers some more-or-less equivalent mappings between :c:func:`scanf` format tokens and regular expressions.
uk: Python наразі не має еквівалента :c:func:`scanf`. Регулярні вирази, як правило, потужніші, хоча й більш докладні, ніж рядки формату :c:func:`scanf`. Таблиця нижче пропонує деякі більш-менш еквівалентні відповідності між маркерами формату :c:func:`scanf` і регулярними виразами.

source: :c:func:`scanf` Token
uk: :c:func:`scanf` Токен

source: Regular Expression
uk: Регулярний вираз

source: To extract the filename and numbers from a string like ::
uk: Щоб витягти назву файлу та номери з рядка на зразок ::

source: you would use a :c:func:`scanf` format like ::
uk: ви б використовували формат :c:func:`scanf`, наприклад ::

source: The equivalent regular expression would be ::
uk: Еквівалентним регулярним виразом буде::

source: search() vs. match()
uk: search() проти match()

source: Python offers two different primitive operations based on regular expressions: :func:`re.match` checks for a match only at the beginning of the string, while :func:`re.search` checks for a match anywhere in the string (this is what Perl does by default).
uk: Python пропонує дві різні примітивні операції на основі регулярних виразів: :func:`re.match` перевіряє збіг лише на початку рядка, тоді як :func:`re.search` перевіряє збіг будь-де в рядку (це це те, що Perl робить за замовчуванням).

source: Regular expressions beginning with ``'^'`` can be used with :func:`search` to restrict the match at the beginning of the string::
uk: Регулярні вирази, що починаються з ``'^'``, можна використовувати з :func:`search`, щоб обмежити збіг на початку рядка::

source: Note however that in :const:`MULTILINE` mode :func:`match` only matches at the beginning of the string, whereas using :func:`search` with a regular expression beginning with ``'^'`` will match at the beginning of each line. ::
uk: Однак зауважте, що в режимі :const:`MULTILINE` :func:`match` збігається лише на початку рядка, тоді як використання :func:`search` із регулярним виразом, що починається з ``'^'`` збігається на початок кожного рядка. ::

source: Making a Phonebook
uk: Створення телефонної книги

source: :func:`split` splits a string into a list delimited by the passed pattern. The method is invaluable for converting textual data into data structures that can be easily read and modified by Python as demonstrated in the following example that creates a phonebook.
uk: :func:`split` розбиває рядок на список, розділений переданим шаблоном. Цей метод є безцінним для перетворення текстових даних у структури даних, які можна легко читати та змінювати Python, як показано в наступному прикладі створення телефонної книги.

source: First, here is the input. Normally it may come from a file, here we are using triple-quoted string syntax
uk: По-перше, ось вхідні дані. Зазвичай він може надходити з файлу, тут ми використовуємо синтаксис рядка в потрійних лапках

source: The entries are separated by one or more newlines. Now we convert the string into a list with each nonempty line having its own entry:
uk: Записи розділені одним або кількома символами нового рядка. Тепер ми перетворюємо рядок на список, у якому кожен непорожній рядок має окремий запис:

source: Finally, split each entry into a list with first name, last name, telephone number, and address. We use the ``maxsplit`` parameter of :func:`split` because the address has spaces, our splitting pattern, in it:
uk: Нарешті, розділіть кожен запис на список із іменем, прізвищем, номером телефону та адресою. Ми використовуємо параметр ``maxsplit`` :func:`split`, тому що в адресі є пробіли, наш шаблон поділу:

source: The ``:?`` pattern matches the colon after the last name, so that it does not occur in the result list. With a ``maxsplit`` of ``4``, we could separate the house number from the street name:
uk: Шаблон ``:?`` відповідає двокрапці після прізвища, щоб він не зустрічався в списку результатів. За допомогою ``maxsplit`` ``4`` ми можемо відокремити номер будинку від назви вулиці:

source: Text Munging
uk: Перебирання тексту

source: :func:`sub` replaces every occurrence of a pattern with a string or the result of a function. This example demonstrates using :func:`sub` with a function to "munge" text, or randomize the order of all the characters in each word of a sentence except for the first and last characters::
uk: :func:`sub` замінює кожне входження шаблону рядком або результатом функції. У цьому прикладі демонструється використання :func:`sub` із функцією для "переміщення" тексту або випадкового порядку всіх символів у кожному слові речення, за винятком першого та останнього символів::

source: Finding all Adverbs
uk: Знайти всі прислівники

source: :func:`findall` matches *all* occurrences of a pattern, not just the first one as :func:`search` does. For example, if a writer wanted to find all of the adverbs in some text, they might use :func:`findall` in the following manner::
uk: :func:`findall` відповідає *всім* входженням шаблону, а не лише першому, як це робить :func:`search`. Наприклад, якщо автор хоче знайти всі прислівники в якомусь тексті, він може використати :func:`findall` у такий спосіб:

source: Finding all Adverbs and their Positions
uk: Знайти всі прислівники та їх позиції

source: If one wants more information about all matches of a pattern than the matched text, :func:`finditer` is useful as it provides :ref:`match objects <match-objects>` instead of strings. Continuing with the previous example, if a writer wanted to find all of the adverbs *and their positions* in some text, they would use :func:`finditer` in the following manner::
uk: Якщо потрібно отримати більше інформації про всі збіги шаблону, ніж відповідний текст, :func:`finditer` буде корисним, оскільки він надає :ref:`match objects <match-objects>` замість рядків. Продовжуючи попередній приклад, якби автор хотів знайти всі прислівники *та їх позиції* в якомусь тексті, він використав би :func:`finditer` таким чином::

source: Raw String Notation
uk: Необроблена рядкова нотація

source: Raw string notation (``r"text"``) keeps regular expressions sane. Without it, every backslash (``'\'``) in a regular expression would have to be prefixed with another one to escape it. For example, the two following lines of code are functionally identical::
uk: Необроблена нотація рядка (``r"текст"``) зберігає регулярні вирази нормальними. Без нього кожен зворотний слеш (``'\'``) у регулярному виразі повинен був би мати префікс іншим, щоб уникнути його. Наприклад, два наступних рядки коду функціонально ідентичні:

source: When one wants to match a literal backslash, it must be escaped in the regular expression. With raw string notation, this means ``r"\\"``. Without raw string notation, one must use ``"\\\\"``, making the following lines of code functionally identical::
uk: Якщо потрібно зіставити літеральний зворотний слеш, його потрібно екранувати у регулярному виразі. У необробленому рядковому записі це означає ``r"\\"``. Без нотації необробленого рядка потрібно використовувати ``"\\\\"``, роблячи наступні рядки коду функціонально ідентичними::

source: Writing a Tokenizer
uk: Написання токенізера

source: A `tokenizer or scanner <https://en.wikipedia.org/wiki/Lexical_analysis>`_ analyzes a string to categorize groups of characters. This is a useful first step in writing a compiler or interpreter.
uk: `Токенизатор або сканер <https://en.wikipedia.org/wiki/Lexical_analysis>`_ аналізує рядок, щоб класифікувати групи символів. Це корисний перший крок у написанні компілятора чи інтерпретатора.

source: The text categories are specified with regular expressions. The technique is to combine those into a single master regular expression and to loop over successive matches::
uk: Текстові категорії вказуються регулярними виразами. Техніка полягає в тому, щоб об’єднати їх у єдиний основний регулярний вираз і виконати цикл послідовних збігів:

source: The tokenizer produces the following output::
uk: Токенізатор видає такий вихід:

source: Friedl, Jeffrey. Mastering Regular Expressions. 3rd ed., O'Reilly Media, 2009. The third edition of the book no longer covers Python at all, but the first edition covered writing good regular expression patterns in great detail.
uk: Фрідл, Джеффрі. Освоєння регулярних виразів. 3rd ed., O'Reilly Media, 2009. Третє видання книги більше не охоплює Python взагалі, але перше видання охоплювало написання хороших шаблонів регулярних виразів дуже детально.
