Repository: python/python-docs-uk
Catalog: library/re.po
Languages: uk

source: (Zero or more letters from the set ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``, optionally followed by ``'-'`` followed by one or more letters from the ``'i'``, ``'m'``, ``'s'``, ``'x'``.) The letters set or remove the corresponding flags: :const:`re.A` (ASCII-only matching), :const:`re.I` (ignore case), :const:`re.L` (locale dependent), :const:`re.M` (multi-line), :const:`re.S` (dot matches all), :const:`re.U` (Unicode matching), and :const:`re.X` (verbose), for the part of the expression. (The flags are described in :ref:`contents-of-module-re`.)
uk: (Нуль або більше літер із набору ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``, необов'язково після ``'-''``, за якою слідує одна або більше літер ``'i'``, ``'m'``, ``'s'``, ``'x'``.) Літери встановлюють або видаляють відповідні позначки: :const:`re.A` (відповідність лише ASCII), :const:`re.I` (ігнорувати регістр ), :const:`re.L` (залежно від локалі), :const:`re.M` (багаторядковий), :const:`re.S` (точка відповідає всім), :const:`re.U` (збіг Юнікоду) і :const:`re.X` (дослівно) для частини виразу. (Прапорці описані в :ref:`contents-of-module-re`.)

source: The letters ``'a'``, ``'L'`` and ``'u'`` are mutually exclusive when used as inline flags, so they can't be combined or follow ``'-'``. Instead, when one of them appears in an inline group, it overrides the matching mode in the enclosing group. In Unicode patterns ``(?a:...)`` switches to ASCII-only matching, and ``(?u:...)`` switches to Unicode matching (default). In byte pattern ``(?L:...)`` switches to locale depending matching, and ``(?a:...)`` switches to ASCII-only matching (default). This override is only in effect for the narrow inline group, and the original matching mode is restored outside of the group.
uk: Літери ``'a'``, ``'L'`` і ``'u'`` є взаємовиключними, коли використовуються як вбудовані прапорці, тому їх не можна поєднувати або слідувати за ``'-'`` . Натомість, коли один із них з’являється у вбудованій групі, він замінює режим відповідності в охоплюючій групі. У шаблонах Unicode ``(?a:...)`` перемикається на відповідність лише ASCII, а ``(?u:...)`` перемикається на відповідність Unicode (за замовчуванням). У шаблоні байтів ``(?L:...)`` перемикається на відповідність залежно від локалі, а ``(?a:...)`` перемикається на відповідність лише ASCII (за замовчуванням). Це перевизначення діє лише для вузької вбудованої групи, а вихідний режим відповідності відновлюється за межами групи.

source: The letters ``'a'``, ``'L'`` and ``'u'`` also can be used in a group.
uk: Літери ``'a'``, ``'L'`` і ``'u'`` також можна використовувати в групі.

source: Similar to regular parentheses, but the substring matched by the group is accessible via the symbolic group name *name*. Group names must be valid Python identifiers, and each group name must be defined only once within a regular expression. A symbolic group is also a numbered group, just as if the group were not named.
uk: Подібно до звичайних дужок, але підрядок, який відповідає групі, доступний через символічне ім’я групи *name*. Імена груп мають бути дійсними ідентифікаторами Python, і кожне ім’я групи має бути визначено лише один раз у регулярному виразі. Символічна група також є пронумерованою групою, так само, якби група не мала імені.

source: Named groups can be referenced in three contexts. If the pattern is ``(?P<quote>['"]).*?(?P=quote)`` (i.e. matching a string quoted with either single or double quotes):
uk: На іменовані групи можна посилатися в трьох контекстах. Якщо шаблон ``(?P <quote> ['"]).*?(?P=quote)`` (тобто відповідає рядку в одинарних або подвійних лапках):

source: Context of reference to group "quote"
uk: Контекст посилання на групу "цитата"

source: Ways to reference it
uk: Способи посилання на нього

source: in the same pattern itself
uk: за таким самим шаблоном

source: ``(?P=quote)`` (as shown)
uk: ``(?P=quote)`` (як показано)

source: when processing match object *m*
uk: під час обробки відповідного об'єкта *m*

source: ``m.end('quote')`` (etc.)
uk: ``m.end('quote')`` (і т.д.)

source: in a string passed to the *repl* argument of ``re.sub()``
uk: у рядку, переданому в аргумент *repl* ``re.sub()``

source: A backreference to a named group; it matches whatever text was matched by the earlier group named *name*.
uk: Зворотне посилання на іменовану групу; він відповідає будь-якому тексту, який відповідав попередній групі під назвою *name*.

source: A comment; the contents of the parentheses are simply ignored.
uk: коментар; вміст круглих дужок просто ігнорується.

source: Matches if ``...`` matches next, but doesn't consume any of the string. This is called a :dfn:`lookahead assertion`. For example, ``Isaac (?=Asimov)`` will match ``'Isaac '`` only if it's followed by ``'Asimov'``.
uk: Збігається, якщо ``...`` збігається наступним, але не споживає жоден рядок. Це називається :dfn:`lookahead assertion`. Наприклад, ``Isaac (?=Azimov)`` відповідатиме ``'Isaac ''``, лише якщо за ним йде ``'Azimov'``.

source: Matches if ``...`` doesn't match next. This is a :dfn:`negative lookahead assertion`. For example, ``Isaac (?!Asimov)`` will match ``'Isaac '`` only if it's *not* followed by ``'Asimov'``.
uk: Збігається, якщо ``...`` не збігається наступним. Це :dfn:`негативне випереджальне твердження`. Наприклад, ``Isaac (?!Azimov)`` відповідатиме ``'Isaac ''``, лише якщо за ним *не* йде ``'Azimov'``.

source: Matches if the current position in the string is preceded by a match for ``...`` that ends at the current position. This is called a :dfn:`positive lookbehind assertion`. ``(?<=abc)def`` will find a match in ``'abcdef'``, since the lookbehind will back up 3 characters and check if the contained pattern matches. The contained pattern must only match strings of some fixed length, meaning that ``abc`` or ``a|b`` are allowed, but ``a*`` and ``a{3,4}`` are not. Note that patterns which start with positive lookbehind assertions will not match at the beginning of the string being searched; you will most likely want to use the :func:`search` function rather than the :func:`match` function:
uk: Збігається, якщо поточній позиції в рядку передує відповідність для ``...``, яка закінчується на поточній позиції. Це називається :dfn:`позитивним ретроспективним твердженням`. ``(?<=abc)def`` знайде збіг у ``'abcdef'``, оскільки огляд назад створить резервну копію 3 символів і перевірить, чи збігається шаблон, що міститься. Вміщений шаблон має збігатися лише з рядками певної фіксованої довжини, тобто допустимі ``abc`` або ``a|b``, але ``a*`` і ``a{3,4}`` заборонені . Зауважте, що шаблони, які починаються з позитивних ретроспективних тверджень, не збігатимуться на початку рядка, що шукається; швидше за все, ви захочете використовувати функцію :func:`search`, а не функцію :func:`match`:

source: This example looks for a word following a hyphen:
uk: У цьому прикладі шукається слово після дефіса:

source: Added support for group references of fixed length.
uk: Додано підтримку групових посилань фіксованої довжини.

source: Matches if the current position in the string is not preceded by a match for ``...``. This is called a :dfn:`negative lookbehind assertion`. Similar to positive lookbehind assertions, the contained pattern must only match strings of some fixed length. Patterns which start with negative lookbehind assertions may match at the beginning of the string being searched.
uk: Збігається, якщо поточній позиції в рядку не передує збіг для ``...``. Це називається :dfn:`negative lookbehind assertion`. Подібно до позитивних ретроспективних тверджень, шаблон, що міститься, повинен відповідати лише рядкам певної фіксованої довжини. Шаблони, які починаються з негативних ретроспективних тверджень, можуть збігатися на початку рядка, який шукається.

source: Will try to match with ``yes-pattern`` if the group with given *id* or *name* exists, and with ``no-pattern`` if it doesn't. ``no-pattern`` is optional and can be omitted. For example, ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>|$)`` is a poor email matching pattern, which will match with ``'<user@host.com>'`` as well as ``'user@host.com'``, but not with ``'<user@host.com'`` nor ``'user@host.com>'``.
uk: Спробує знайти відповідність за допомогою ``yes-pattern``, якщо група з заданим *id* або *name* існує, і за допомогою ``no-pattern``, якщо вона не існує. ``no-pattern`` є необов'язковим і його можна опустити. Наприклад, ``( <)?(\w+@\w+(?:\.\w+)+)(?(1)> |$)`` є поганим шаблоном відповідності електронної пошти, який збігатиметься з ``'<user@host.com>'``, а також ``'user@host.com'``, але не з ``'<user@host.com'`` nor ``'user@host.com> '``.

source: The special sequences consist of ``'\'`` and a character from the list below. If the ordinary character is not an ASCII digit or an ASCII letter, then the resulting RE will match the second character. For example, ``\$`` matches the character ``'$'``.
uk: Спеціальні послідовності складаються з ``'\'`` і символу зі списку нижче. Якщо звичайний символ не є цифрою ASCII або літерою ASCII, тоді результуючий RE відповідатиме другому символу. Наприклад, ``\$`` відповідає символу ``''$'``.

source: ``\number``
uk: ``\номер``

source: Matches the contents of the group of the same number. Groups are numbered starting from 1. For example, ``(.+) \1`` matches ``'the the'`` or ``'55 55'``, but not ``'thethe'`` (note the space after the group). This special sequence can only be used to match one of the first 99 groups. If the first digit of *number* is 0, or *number* is 3 octal digits long, it will not be interpreted as a group match, but as the character with octal value *number*. Inside the ``'['`` and ``']'`` of a character class, all numeric escapes are treated as characters.
uk: Відповідає вмісту групи з тим самим номером. Групи нумеруються, починаючи з 1. Наприклад, ``(.+) \1`` відповідає ``'the'`` або ``'55 55'``, але не ``'thethe'`` (примітка пробіл після групи). Цю спеціальну послідовність можна використовувати лише для відповідності одній із перших 99 груп. Якщо перша цифра *числа* дорівнює 0 або *число* складається з 3 вісімкових цифр, це не буде інтерпретовано як збіг групи, а як символ із вісімковим значенням *число*. Усередині ``'['`` і ``']'`` класу символів усі цифрові екрановані символи розглядаються як символи.

source: Matches only at the start of the string.
uk: Збігається лише на початку рядка.

source: Matches the empty string, but only at the beginning or end of a word. A word is defined as a sequence of word characters. Note that formally, ``\b`` is defined as the boundary between a ``\w`` and a ``\W`` character (or vice versa), or between ``\w`` and the beginning/end of the string. This means that ``r'\bfoo\b'`` matches ``'foo'``, ``'foo.'``, ``'(foo)'``, ``'bar foo baz'`` but not ``'foobar'`` or ``'foo3'``.
uk: Збігається з порожнім рядком, але лише на початку або в кінці слова. Слово визначається як послідовність символів слова. Зауважте, що формально ``\b`` визначається як межа між символом ``\w`` і ``\W`` (або навпаки), або між ``\w`` і початком/ кінець рядка. Це означає, що ``r'\bfoo\b'`` відповідає ``'foo'``, ``'foo.''``, ``'(foo)'``, ``'bar foo baz'``, але не ``'foobar'`` або ``'foo3'``.

source: By default Unicode alphanumerics are the ones used in Unicode patterns, but this can be changed by using the :const:`ASCII` flag. Word boundaries are determined by the current locale if the :const:`LOCALE` flag is used. Inside a character range, ``\b`` represents the backspace character, for compatibility with Python's string literals.
uk: За замовчуванням буквено-цифрові символи Unicode використовуються в шаблонах Unicode, але це можна змінити за допомогою прапорця :const:`ASCII`. Межі слів визначаються поточною мовою, якщо використовується прапорець :const:`LOCALE`. Усередині діапазону символів ``\b`` представляє символ зворотного пробілу для сумісності з рядковими літералами Python.

source: Matches the empty string, but only when it is *not* at the beginning or end of a word. This means that ``r'py\B'`` matches ``'python'``, ``'py3'``, ``'py2'``, but not ``'py'``, ``'py.'``, or ``'py!'``. ``\B`` is just the opposite of ``\b``, so word characters in Unicode patterns are Unicode alphanumerics or the underscore, although this can be changed by using the :const:`ASCII` flag. Word boundaries are determined by the current locale if the :const:`LOCALE` flag is used.
uk: Збігається з порожнім рядком, але лише якщо він *не* на початку або в кінці слова. Це означає, що ``r'py\B''`` відповідає ``'python'``, ``'py3'``, ``'py2'``, але не ``'py'``, ``'py.'`` або ``'py!'``. ``\B`` є прямою протилежністю ``\b``, тому символи слів у шаблонах Unicode є буквено-цифровими символами Unicode або підкресленням, хоча це можна змінити за допомогою прапорця :const:`ASCII`. Межі слів визначаються поточною мовою, якщо використовується прапорець :const:`LOCALE`.

source: For Unicode (str) patterns:
uk: Для шаблонів Unicode (str):

source: Matches any Unicode decimal digit (that is, any character in Unicode character category [Nd]). This includes ``[0-9]``, and also many other digit characters. If the :const:`ASCII` flag is used only ``[0-9]`` is matched.
uk: Відповідає будь-якій десятковій цифрі Unicode (тобто будь-якому символу в категорії символів Unicode [Nd]). Це включає в себе "[0-9]", а також багато інших цифрових символів. Якщо використовується прапорець :const:`ASCII`, збігається лише ``[0-9]``.

source: For 8-bit (bytes) patterns:
uk: Для 8-бітових (байтових) шаблонів:

source: Matches any decimal digit; this is equivalent to ``[0-9]``.
uk: Збігається з будь-якою десятковою цифрою; це еквівалентно ``[0-9]``.

source: Matches any character which is not a decimal digit. This is the opposite of ``\d``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^0-9]``.
uk: Відповідає будь-якому символу, який не є десятковою цифрою. Це протилежність ``\d``. Якщо використовується прапорець :const:`ASCII`, це стає еквівалентом ``[^0-9]``.

source: Matches Unicode whitespace characters (which includes ``[ \t\n\r\f\v]``, and also many other characters, for example the non-breaking spaces mandated by typography rules in many languages). If the :const:`ASCII` flag is used, only ``[ \t\n\r\f\v]`` is matched.
uk: Відповідає пробілам Юнікоду (зокрема, ``[ \t\n\r\f\v]``, а також багатьом іншим символам, наприклад нерозривним пробілам, передбаченим правилами типографіки багатьох мов). Якщо використовується прапорець :const:`ASCII`, збігається лише ``[ \t\n\r\f\v]``.

source: Matches characters considered whitespace in the ASCII character set; this is equivalent to ``[ \t\n\r\f\v]``.
uk: Відповідає символам, які вважаються пробілами в наборі символів ASCII; це еквівалентно ``[ \t\n\r\f\v]``.

source: Matches any character which is not a whitespace character. This is the opposite of ``\s``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^ \t\n\r\f\v]``.
uk: Відповідає будь-якому символу, який не є пробілом. Це протилежність ``\s``. Якщо використовується прапорець :const:`ASCII`, це стає еквівалентом ``[^ \t\n\r\f\v]``.

source: Matches Unicode word characters; this includes most characters that can be part of a word in any language, as well as numbers and the underscore. If the :const:`ASCII` flag is used, only ``[a-zA-Z0-9_]`` is matched.
uk: Відповідає символам слів Unicode; це включає більшість символів, які можуть бути частиною слова будь-якою мовою, а також цифри та підкреслення. Якщо використовується прапорець :const:`ASCII`, збігається лише ``[a-zA-Z0-9_]``.

source: Matches characters considered alphanumeric in the ASCII character set; this is equivalent to ``[a-zA-Z0-9_]``. If the :const:`LOCALE` flag is used, matches characters considered alphanumeric in the current locale and the underscore.
uk: Відповідає символам, які вважаються буквено-цифровими в наборі символів ASCII; це еквівалентно ``[a-zA-Z0-9_]``. Якщо використовується прапорець :const:`LOCALE`, відповідає символам, які вважаються буквено-цифровими в поточній локалі, і підкресленню.

source: Matches any character which is not a word character. This is the opposite of ``\w``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^a-zA-Z0-9_]``. If the :const:`LOCALE` flag is used, matches characters which are neither alphanumeric in the current locale nor the underscore.
uk: Відповідає будь-якому символу, який не є символом слова. Це протилежність ``\w``. Якщо використовується прапорець :const:`ASCII`, це стає еквівалентом ``[^a-zA-Z0-9_]``. Якщо використовується прапорець :const:`LOCALE`, відповідає символам, які не є ані буквено-цифровими в поточній локалі, ані підкресленням.

source: Matches only at the end of the string.
uk: Збігається лише в кінці рядка.

source: Most of the standard escapes supported by Python string literals are also accepted by the regular expression parser::
uk: Більшість стандартних екранованих символів, які підтримуються рядковими літералами Python, також приймаються аналізатором регулярних виразів::

source: (Note that ``\b`` is used to represent word boundaries, and means "backspace" only inside character classes.)
uk: (Зауважте, що ``\b`` використовується для представлення меж слів і означає "backspace" лише всередині класів символів.)

source: ``'\u'``, ``'\U'``, and ``'\N'`` escape sequences are only recognized in Unicode patterns. In bytes patterns they are errors. Unknown escapes of ASCII letters are reserved for future use and treated as errors.
uk: Екран-послідовності ``'\u'``, ``'\U'`` і ``'\N''`` розпізнаються лише в шаблонах Unicode. У шаблонах байтів це помилки. Невідомі вихідні коди літер ASCII зарезервовано для майбутнього використання та розглядаються як помилки.

source: Octal escapes are included in a limited form. If the first digit is a 0, or if there are three octal digits, it is considered an octal escape. Otherwise, it is a group reference. As for string literals, octal escapes are always at most three digits in length.
uk: Вісімкові втечі включені в обмеженій формі. Якщо першою цифрою є 0 або є три вісімкові цифри, це вважається вісімковим екрануванням. В іншому випадку це посилання на групу. Що стосується рядкових літералів, вісімкові символи екранування завжди мають не більше трьох цифр.

source: The ``'\u'`` and ``'\U'`` escape sequences have been added.
uk: Було додано керуючі послідовності ``'\u'`` і ``'\U'``.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter now are errors.
uk: Невідомі вихідні символи, що складаються з ``'\'`` і літери ASCII, тепер є помилками.

source: The ``'\N{name}'`` escape sequence has been added. As in string literals, it expands to the named Unicode character (e.g. ``'\N{EM DASH}'``).
uk: Додано керуючу послідовність ``'\N{name}''``. Як і в рядкових літералах, він розширюється до названого символу Unicode (наприклад, ``'\N{EM DASH}''``).

source: Module Contents
uk: Зміст модуля

source: The module defines several functions, constants, and an exception. Some of the functions are simplified versions of the full featured methods for compiled regular expressions. Most non-trivial applications always use the compiled form.
uk: Модуль визначає кілька функцій, констант і виключення. Деякі функції є спрощеними версіями повнофункціональних методів для скомпільованих регулярних виразів. Більшість нетривіальних програм завжди використовують скомпільовану форму.

source: Flags
uk: Прапори

source: Flag constants are now instances of :class:`RegexFlag`, which is a subclass of :class:`enum.IntFlag`.
uk: Константи прапорів тепер є екземплярами :class:`RegexFlag`, який є підкласом :class:`enum.IntFlag`.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\d``, ``\D``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns. Corresponds to the inline flag ``(?a)``.
uk: Зробіть ``\w``, ``\W``, ``\b``, ``\B``, ``\d``, ``\D``, ``\s`` і ``\S`` виконує зіставлення тільки ASCII замість повного зіставлення Unicode. Це має значення лише для шаблонів Unicode та ігнорується для шаблонів байтів. Відповідає вбудованому прапору ``(?a)``.

source: Note that for backward compatibility, the :const:`re.U` flag still exists (as well as its synonym :const:`re.UNICODE` and its embedded counterpart ``(?u)``), but these are redundant in Python 3 since matches are Unicode by default for strings (and Unicode matching isn't allowed for bytes).
uk: Зауважте, що для зворотної сумісності прапор :const:`re.U` все ще існує (а також його синонім :const:`re.UNICODE` і його вбудований аналог ``(?u)``), але вони зайві. у Python 3, оскільки збіги є Юнікодом за замовчуванням для рядків (і збіги Юнікоду не дозволені для байтів).

source: Display debug information about compiled expression. No corresponding inline flag.
uk: Відображення налагоджувальної інформації про скомпільований вираз. Немає відповідного вбудованого прапора.

source: Perform case-insensitive matching; expressions like ``[A-Z]`` will also match lowercase letters. Full Unicode matching (such as ``Ü`` matching ``ü``) also works unless the :const:`re.ASCII` flag is used to disable non-ASCII matches. The current locale does not change the effect of this flag unless the :const:`re.LOCALE` flag is also used. Corresponds to the inline flag ``(?i)``.
uk: Виконуйте зіставлення без урахування регістру; такі вирази, як ``[A-Z]`` також відповідатимуть малим регістрам. Повна відповідність Юнікоду (наприклад, ``Ü``, яка відповідає ``ü``) також працює, якщо не використовується прапор :const:`re.ASCII`, щоб вимкнути збіги, відмінні від ASCII. Поточна локаль не змінює ефект цього прапорця, якщо також не використовується прапорець :const:`re.LOCALE`. Відповідає вбудованому прапору ``(?i)``.

source: Note that when the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). If the :const:`ASCII` flag is used, only letters 'a' to 'z' and 'A' to 'Z' are matched.
uk: Зауважте, що коли шаблони Unicode ``[a-z]`` або ``[A-Z]`` використовуються в поєднанні з прапором :const:`IGNORECASE`, вони відповідатимуть 52 літерам ASCII і 4 додатковим літерам, які не належать до ASCII: 'İ' (U+0130, латинська велика літера I з крапкою вгорі), 'ı' (U+0131, латинська мала літера i без крапки), 'ſ' (U+017F, латинська мала літера довга s) і 'K' (U+212A, знак Кельвіна). Якщо використовується прапорець :const:`ASCII`, збігаються лише літери від 'a' до 'z' і від 'A' до 'Z'.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale. This flag can be used only with bytes patterns. The use of this flag is discouraged as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages. Corresponds to the inline flag ``(?L)``.
uk: Зробити ``\w``, ``\W``, ``\b``, ``\B`` і відповідність без урахування регістру залежно від поточної мови. Цей прапорець можна використовувати лише з шаблонами байтів. Використання цього прапорця не рекомендується, оскільки механізм локалізації є дуже ненадійним, він обробляє лише одну "культуру" за раз і працює лише з 8-бітними локалізаціями. Зіставлення Unicode вже ввімкнено за замовчуванням у Python 3 для шаблонів Unicode (str), і він здатний обробляти різні локалі/мови. Відповідає вбудованому прапору ``(?L)``.
