Repository: python/python-docs-uk
Catalog: library/readline.po
Languages: uk

source: The :mod:`readline` module defines a number of functions to facilitate completion and reading/writing of history files from the Python interpreter. This module can be used directly, or via the :mod:`rlcompleter` module, which supports completion of Python identifiers at the interactive prompt. Settings made using this module affect the behaviour of both the interpreter's interactive prompt and the prompts offered by the built-in :func:`input` function.
uk: Модуль :mod:`readline` визначає низку функцій для полегшення завершення та читання/запису файлів історії з інтерпретатора Python. Цей модуль можна використовувати безпосередньо або через модуль :mod:`rlcompleter`, який підтримує завершення ідентифікаторів Python за інтерактивним запитом. Параметри, зроблені за допомогою цього модуля, впливають на поведінку як інтерактивної підказки інтерпретатора, так і підказок, запропонованих вбудованою функцією :func:`input`.

source: Init file
uk: Ініціальний файл

source: The following functions relate to the init file and user configuration:
uk: Наступні функції стосуються файлу ініціалізації та конфігурації користувача:

source: Execute the init line provided in the *string* argument. This calls :c:func:`rl_parse_and_bind` in the underlying library.
uk: Виконайте рядок ініціалізації, наданий в аргументі *string*. Це викликає :c:func:`rl_parse_and_bind` у базовій бібліотеці.

source: Execute a readline initialization file. The default filename is the last filename used. This calls :c:func:`rl_read_init_file` in the underlying library.
uk: Виконайте файл ініціалізації рядка читання. Назва файлу за замовчуванням — це останнє використане ім’я файлу. Це викликає :c:func:`rl_read_init_file` у базовій бібліотеці.

source: Line buffer
uk: Лінійний буфер

source: The following functions operate on the line buffer:
uk: На буфері лінії працюють такі функції:

source: Return the current contents of the line buffer (:c:data:`rl_line_buffer` in the underlying library).
uk: Повертає поточний вміст буфера рядків (:c:data:`rl_line_buffer` у базовій бібліотеці).

source: Insert text into the line buffer at the cursor position. This calls :c:func:`rl_insert_text` in the underlying library, but ignores the return value.
uk: Вставте текст у буфер рядків у позиції курсора. Це викликає :c:func:`rl_insert_text` у базовій бібліотеці, але ігнорує повернуте значення.

source: Change what's displayed on the screen to reflect the current contents of the line buffer. This calls :c:func:`rl_redisplay` in the underlying library.
uk: Змініть те, що відображається на екрані, щоб відобразити поточний вміст рядкового буфера. Це викликає :c:func:`rl_redisplay` у базовій бібліотеці.

source: History file
uk: Файл історії

source: The following functions operate on a history file:
uk: З файлом історії працюють такі функції:

source: Load a readline history file, and append it to the history list. The default filename is :file:`~/.history`. This calls :c:func:`read_history` in the underlying library.
uk: Завантажте файл історії рядка читання та додайте його до списку історії. Назва файлу за замовчуванням :file:`~/.history`. Це викликає :c:func:`read_history` у базовій бібліотеці.

source: Save the history list to a readline history file, overwriting any existing file. The default filename is :file:`~/.history`. This calls :c:func:`write_history` in the underlying library.
uk: Збережіть список історії у файл історії рядка читання, перезаписавши будь-який існуючий файл. Назва файлу за замовчуванням :file:`~/.history`. Це викликає :c:func:`write_history` у базовій бібліотеці.

source: Append the last *nelements* items of history to a file. The default filename is :file:`~/.history`. The file must already exist. This calls :c:func:`append_history` in the underlying library. This function only exists if Python was compiled for a version of the library that supports it.
uk: Додайте останні *elements* елементи історії до файлу. Назва файлу за замовчуванням :file:`~/.history`. Файл уже має існувати. Це викликає :c:func:`append_history` у базовій бібліотеці. Ця функція існує, лише якщо Python було скомпільовано для версії бібліотеки, яка її підтримує.

source: Set or return the desired number of lines to save in the history file. The :func:`write_history_file` function uses this value to truncate the history file, by calling :c:func:`history_truncate_file` in the underlying library. Negative values imply unlimited history file size.
uk: Установіть або поверніть потрібну кількість рядків для збереження у файлі історії. Функція :func:`write_history_file` використовує це значення для скорочення файлу історії, викликаючи :c:func:`history_truncate_file` у базовій бібліотеці. Від’ємні значення означають необмежений розмір файлу історії.

source: History list
uk: Список історії

source: The following functions operate on a global history list:
uk: У списку глобальної історії працюють такі функції:

source: Clear the current history. This calls :c:func:`clear_history` in the underlying library. The Python function only exists if Python was compiled for a version of the library that supports it.
uk: Очистити поточну історію. Це викликає :c:func:`clear_history` у базовій бібліотеці. Функція Python існує, лише якщо Python було скомпільовано для версії бібліотеки, яка її підтримує.

source: Return the number of items currently in the history. (This is different from :func:`get_history_length`, which returns the maximum number of lines that will be written to a history file.)
uk: Повертає кількість елементів в історії. (Це відрізняється від :func:`get_history_length`, який повертає максимальну кількість рядків, які будуть записані у файл історії.)

source: Return the current contents of history item at *index*. The item index is one-based. This calls :c:func:`history_get` in the underlying library.
uk: Повернути поточний вміст елемента історії за *index*. Індекс позиції складається з однієї основи. Це викликає :c:func:`history_get` у базовій бібліотеці.

source: Remove history item specified by its position from the history. The position is zero-based. This calls :c:func:`remove_history` in the underlying library.
uk: Видалити з історії елемент історії, визначений його позицією. Позиція відраховується з нуля. Це викликає :c:func:`remove_history` у базовій бібліотеці.

source: Replace history item specified by its position with *line*. The position is zero-based. This calls :c:func:`replace_history_entry` in the underlying library.
uk: Замінити елемент історії, визначений його позицією, на *рядок*. Позиція відраховується з нуля. Це викликає :c:func:`replace_history_entry` у базовій бібліотеці.

source: Append *line* to the history buffer, as if it was the last line typed. This calls :c:func:`add_history` in the underlying library.
uk: Додайте *рядок* до буфера історії, ніби це був останній введений рядок. Це викликає :c:func:`add_history` у базовій бібліотеці.

source: Enable or disable automatic calls to :c:func:`add_history` when reading input via readline. The *enabled* argument should be a Boolean value that when true, enables auto history, and that when false, disables auto history.
uk: Увімкнути або вимкнути автоматичні виклики :c:func:`add_history` під час читання введених даних через рядок читання. Аргумент *enabled* має бути логічним значенням, яке, коли істина, вмикає автоматичну історію, а коли хибна, вимикає автоматичну історію.

source: Startup hooks
uk: Хуки для запуску

source: Set or remove the function invoked by the :c:data:`rl_startup_hook` callback of the underlying library. If *function* is specified, it will be used as the new hook function; if omitted or ``None``, any function already installed is removed. The hook is called with no arguments just before readline prints the first prompt.
uk: Установіть або видаліть функцію, викликану зворотним викликом :c:data:`rl_startup_hook` основної бібліотеки. Якщо вказано *функцію*, її буде використано як нову функцію підключення; якщо опущено або ``None``, усі вже встановлені функції буде видалено. Хук викликається без аргументів безпосередньо перед тим, як readline надрукує перший запит.

source: Set or remove the function invoked by the :c:data:`rl_pre_input_hook` callback of the underlying library. If *function* is specified, it will be used as the new hook function; if omitted or ``None``, any function already installed is removed. The hook is called with no arguments after the first prompt has been printed and just before readline starts reading input characters. This function only exists if Python was compiled for a version of the library that supports it.
uk: Установіть або видаліть функцію, викликану зворотним викликом :c:data:`rl_pre_input_hook` основної бібліотеки. Якщо вказано *функцію*, її буде використано як нову функцію підключення; якщо опущено або ``None``, усі вже встановлені функції буде видалено. Хук викликається без аргументів після того, як перше запрошення буде надруковано та безпосередньо перед тим, як readline почне читати введені символи. Ця функція існує, лише якщо Python було скомпільовано для версії бібліотеки, яка її підтримує.

source: Completion
uk: Завершення

source: The following functions relate to implementing a custom word completion function. This is typically operated by the Tab key, and can suggest and automatically complete a word being typed. By default, Readline is set up to be used by :mod:`rlcompleter` to complete Python identifiers for the interactive interpreter. If the :mod:`readline` module is to be used with a custom completer, a different set of word delimiters should be set.
uk: Наступні функції стосуються реалізації спеціальної функції доповнення слів. Зазвичай це працює за допомогою клавіші Tab і може пропонувати та автоматично завершувати введене слово. За замовчуванням Readline налаштовано на використання :mod:`rlcompleter` для заповнення ідентифікаторів Python для інтерактивного інтерпретатора. Якщо модуль :mod:`readline` використовуватиметься з настроюваним доповнювачем, слід встановити інший набір розділювачів слів.

source: Set or remove the completer function. If *function* is specified, it will be used as the new completer function; if omitted or ``None``, any completer function already installed is removed. The completer function is called as ``function(text, state)``, for *state* in ``0``, ``1``, ``2``, ..., until it returns a non-string value. It should return the next possible completion starting with *text*.
uk: Встановити або видалити функцію завершення. Якщо вказано *функцію*, вона використовуватиметься як нова функція завершення; якщо опущено або ``None``, усі вже встановлені завершальні функції видаляються. Функція завершення викликається як ``function(text, state)`` для *state* в ``0``, ``1``, ``2``, ..., доки вона не поверне не- значення рядка. Він має повернути наступне можливе завершення, починаючи з *тексту*.

source: The installed completer function is invoked by the *entry_func* callback passed to :c:func:`rl_completion_matches` in the underlying library. The *text* string comes from the first parameter to the :c:data:`rl_attempted_completion_function` callback of the underlying library.
uk: Встановлена функція завершувача викликається зворотним викликом *entry_func*, переданим до :c:func:`rl_completion_matches` у базовій бібліотеці. Рядок *text* надходить із першого параметра зворотного виклику :c:data:`rl_attempted_completion_function` основної бібліотеки.

source: Get the completer function, or ``None`` if no completer function has been set.
uk: Отримайте функцію завершувача або ``None``, якщо функцію завершувача не встановлено.

source: Get the type of completion being attempted. This returns the :c:data:`rl_completion_type` variable in the underlying library as an integer.
uk: Отримайте тип завершення, яке намагається виконати. Це повертає змінну :c:data:`rl_completion_type` у базовій бібліотеці як ціле число.

source: Get the beginning or ending index of the completion scope. These indexes are the *start* and *end* arguments passed to the :c:data:`rl_attempted_completion_function` callback of the underlying library. The values may be different in the same input editing scenario based on the underlying C readline implementation. Ex: libedit is known to behave differently than libreadline.
uk: Отримати початковий або кінцевий індекс області завершення. Ці індекси є аргументами *start* і *end*, що передаються до зворотного виклику :c:data:`rl_attempted_completion_function` основної бібліотеки. Значення можуть відрізнятися в тому самому сценарії редагування введення на основі базової реалізації C readline. Приклад: libedit, як відомо, поводиться інакше, ніж libreadline.

source: Set or get the word delimiters for completion. These determine the start of the word to be considered for completion (the completion scope). These functions access the :c:data:`rl_completer_word_break_characters` variable in the underlying library.
uk: Установіть або отримайте роздільники слів для завершення. Вони визначають початок слова, яке розглядається для завершення (область завершення). Ці функції отримують доступ до змінної :c:data:`rl_completer_word_break_characters` у базовій бібліотеці.

source: Set or remove the completion display function. If *function* is specified, it will be used as the new completion display function; if omitted or ``None``, any completion display function already installed is removed. This sets or clears the :c:data:`rl_completion_display_matches_hook` callback in the underlying library. The completion display function is called as ``function(substitution, [matches], longest_match_length)`` once each time matches need to be displayed.
uk: Встановіть або видаліть функцію відображення завершення. Якщо вказано *функцію*, вона використовуватиметься як нова функція відображення завершення; якщо опущено або ``None``, усі вже встановлені функції відображення завершення видаляються. Це встановлює або очищає зворотний виклик :c:data:`rl_completion_display_matches_hook` у базовій бібліотеці. Функція відображення завершення викликається як ``function(substitution, [matches], longest_match_length)`` щоразу, коли потрібно відображати збіги.

source: Example
uk: приклад

source: The following example demonstrates how to use the :mod:`readline` module's history reading and writing functions to automatically load and save a history file named :file:`.python_history` from the user's home directory. The code below would normally be executed automatically during interactive sessions from the user's :envvar:`PYTHONSTARTUP` file. ::
uk: У наступному прикладі показано, як використовувати функції читання та запису історії модуля :mod:`readline` для автоматичного завантаження та збереження файлу історії під назвою :file:`.python_history` з домашнього каталогу користувача. Наведений нижче код зазвичай виконується автоматично під час інтерактивних сеансів із файлу користувача :envvar:`PYTHONSTARTUP`. ::

source: This code is actually automatically run when Python is run in :ref:`interactive mode <tut-interactive>` (see :ref:`rlcompleter-config`).
uk: Цей код насправді запускається автоматично, коли Python запускається в :ref:`інтерактивному режимі <tut-interactive>` (див. :ref:`rlcompleter-config`).

source: The following example achieves the same goal but supports concurrent interactive sessions, by only appending the new history. ::
uk: Наступний приклад досягає тієї ж мети, але підтримує одночасні інтерактивні сеанси, лише додаючи нову історію. ::

source: The following example extends the :class:`code.InteractiveConsole` class to support history save/restore. ::
uk: Наступний приклад розширює клас :class:`code.InteractiveConsole` для підтримки збереження/відновлення історії. ::
