Repository: python/python-docs-uk
Catalog: library/rlcompleter.po
Languages: uk

source: :mod:`rlcompleter` --- Completion function for GNU readline
uk: :mod:`rlcompleter` --- Функція завершення рядка читання GNU

source: **Source code:** :source:`Lib/rlcompleter.py`
uk: **Вихідний код:** :source:`Lib/rlcompleter.py`

source: The :mod:`rlcompleter` module defines a completion function suitable for the :mod:`readline` module by completing valid Python identifiers and keywords.
uk: Модуль :mod:`rlcompleter` визначає функцію завершення, придатну для модуля :mod:`readline` шляхом заповнення дійсних ідентифікаторів і ключових слів Python.

source: When this module is imported on a Unix platform with the :mod:`readline` module available, an instance of the :class:`Completer` class is automatically created and its :meth:`complete` method is set as the :mod:`readline` completer.
uk: Коли цей модуль імпортується на платформу Unix із доступним модулем :mod:`readline`, екземпляр класу :class:`Completer` створюється автоматично, а його метод :meth:`complete` встановлюється як завершувач :mod:`readline`.

source: Example::
uk: Приклад::

source: The :mod:`rlcompleter` module is designed for use with Python's :ref:`interactive mode <tut-interactive>`. Unless Python is run with the :option:`-S` option, the module is automatically imported and configured (see :ref:`rlcompleter-config`).
uk: Модуль :mod:`rlcompleter` призначений для використання з :ref:`інтерактивним режимом Python <tut-interactive>`. Якщо Python не запускається з параметром :option:`-S`, модуль автоматично імпортується та налаштовується (див. :ref:`rlcompleter-config`).

source: On platforms without :mod:`readline`, the :class:`Completer` class defined by this module can still be used for custom purposes.
uk: На платформах без :mod:`readline` клас :class:`Completer`, визначений цим модулем, усе ще можна використовувати для спеціальних цілей.

source: Completer Objects
uk: Повні об'єкти

source: Completer objects have the following method:
uk: Повні об’єкти мають такий метод:

source: Return the *state*\ th completion for *text*.
uk: Повернути *стан*\ завершення для *тексту*.

source: If called for *text* that doesn't include a period character (``'.'``), it will complete from names currently defined in :mod:`__main__`, :mod:`builtins` and keywords (as defined by the :mod:`keyword` module).
uk: Якщо викликати *текст*, який не містить символ крапки (``'.''``), він завершуватиметься іменами, визначеними в :mod:`__main__`, :mod:`builtins` та ключовими словами (як визначено) за допомогою модуля :mod:`keyword`).

source: If called for a dotted name, it will try to evaluate anything without obvious side-effects (functions will not be evaluated, but it can generate calls to :meth:`__getattr__`) up to the last part, and find matches for the rest via the :func:`dir` function. Any exception raised during the evaluation of the expression is caught, silenced and :const:`None` is returned.
uk: Якщо викликати назву з крапками, вона намагатиметься оцінити будь-що без очевидних побічних ефектів (функції не оцінюватимуться, але вона може генерувати виклики :meth:`__getattr__`) до останньої частини та знаходити збіги для решти за допомогою функції :func:`dir`. Будь-які винятки, викликані під час оцінки виразу, перехоплюються, мовчаться та повертається :const:`None`.
