Repository: python/python-docs-uk
Catalog: library/security_warnings.po
Languages: uk

source: Security Considerations
uk: Міркування безпеки

source: The following modules have specific security considerations:
uk: Наступні модулі мають особливі міркування безпеки:

source: :mod:`base64`: :ref:`base64 security considerations <base64-security>` in :rfc:`4648`
uk: :mod:`base64`: :ref:`аспекти безпеки base64 <base64-security>` в :rfc:`4648`

source: :mod:`hashlib`: :ref:`all constructors take a "usedforsecurity" keyword-only argument disabling known insecure and blocked algorithms <hashlib-usedforsecurity>`
uk: :mod:`hashlib`: :ref:`усі конструктори приймають лише ключовий аргумент "usedforsecurity", який вимикає відомі небезпечні та заблоковані алгоритми <hashlib-usedforsecurity>`

source: :mod:`logging`: :ref:`Logging configuration uses eval() <logging-eval-security>`
uk: :mod:`logging`: :ref:`Конфігурація журналювання використовує eval() <logging-eval-security>`

source: :mod:`multiprocessing`: :ref:`Connection.recv() uses pickle <multiprocessing-recv-pickle-security>`
uk: :mod:`multiprocessing`: :ref:`Connection.recv() використовує pickle <multiprocessing-recv-pickle-security>`

source: :mod:`pickle`: :ref:`Restricting globals in pickle <pickle-restrict>`
uk: :mod:`pickle`: :ref:`Обмеження глобалів у pickle <pickle-restrict>`

source: :mod:`random` shouldn't be used for security purposes, use :mod:`secrets` instead
uk: :mod:`random` не слід використовувати з метою безпеки, замість цього використовуйте :mod:`secrets`

source: :mod:`shelve`: :ref:`shelve is based on pickle and thus unsuitable for dealing with untrusted sources <shelve-security>`
uk: :mod:`shelve`: :ref:`shelve базується на pickle і тому не підходить для роботи з ненадійними джерелами <shelve-security>`

source: :mod:`ssl`: :ref:`SSL/TLS security considerations <ssl-security>`
uk: :mod:`ssl`: :ref:`Міркування безпеки SSL/TLS <ssl-security>`

source: :mod:`subprocess`: :ref:`Subprocess security considerations <subprocess-security>`
uk: :mod:`subprocess`: :ref:`Міркування щодо безпеки підпроцесів <subprocess-security>`

source: :mod:`tempfile`: :ref:`mktemp is deprecated due to vulnerability to race conditions <tempfile-mktemp-deprecated>`
uk: :mod:`tempfile`: :ref:`mktemp застаріло через вразливість до умов гонки <tempfile-mktemp-deprecated>`

source: :mod:`xml`: :ref:`XML vulnerabilities <xml-vulnerabilities>`
uk: :mod:`xml`: :ref:`Уразливості XML <xml-vulnerabilities>`

source: :mod:`zipfile`: :ref:`maliciously prepared .zip files can cause disk volume exhaustion <zipfile-resources-limitations>`
uk: :mod:`zipfile`: :ref:`зловмисно підготовлені файли .zip можуть спричинити вичерпання обсягу диска <zipfile-resources-limitations>`
