Repository: python/python-docs-uk
Catalog: library/select.po
Languages: uk

source: :mod:`select` --- Waiting for I/O completion
uk: :mod:`select` --- Очікування завершення введення/виведення

source: This module provides access to the :c:func:`select` and :c:func:`poll` functions available in most operating systems, :c:func:`devpoll` available on Solaris and derivatives, :c:func:`epoll` available on Linux 2.5+ and :c:func:`kqueue` available on most BSD. Note that on Windows, it only works for sockets; on other operating systems, it also works for other file types (in particular, on Unix, it works on pipes). It cannot be used on regular files to determine whether a file has grown since it was last read.
uk: Цей модуль надає доступ до функцій :c:func:`select` і :c:func:`poll`, доступних у більшості операційних систем, :c:func:`devpoll`, доступних у Solaris і похідних, :c:func:`epoll` доступний у Linux 2.5+ і :c:func:`kqueue` доступний у більшості BSD. Зверніть увагу, що в Windows це працює лише для сокетів; в інших операційних системах він також працює для інших типів файлів (зокрема, в Unix він працює на каналах). Його не можна використовувати для звичайних файлів, щоб визначити, чи збільшився файл після останнього читання.

source: The :mod:`selectors` module allows high-level and efficient I/O multiplexing, built upon the :mod:`select` module primitives. Users are encouraged to use the :mod:`selectors` module instead, unless they want precise control over the OS-level primitives used.
uk: Модуль :mod:`selectors` забезпечує високорівневе й ефективне мультиплексування вводу/виводу, побудоване на основі примітивів модуля :mod:`select`. Замість цього користувачам рекомендується використовувати модуль :mod:`selectors`, якщо вони не бажають точного контролю над використовуваними примітивами рівня ОС.

source: The module defines the following:
uk: Модуль визначає наступне:

source: A deprecated alias of :exc:`OSError`.
uk: Застарілий псевдонім :exc:`OSError`.

source: Following :pep:`3151`, this class was made an alias of :exc:`OSError`.
uk: Після :pep:`3151` цей клас отримав псевдонім :exc:`OSError`.

source: (Only supported on Solaris and derivatives.) Returns a ``/dev/poll`` polling object; see section :ref:`devpoll-objects` below for the methods supported by devpoll objects.
uk: (Підтримується лише в Solaris і похідних.) Повертає об’єкт опитування ``/dev/poll``; дивіться розділ :ref:`devpoll-objects` нижче щодо методів, які підтримуються об’єктами devpoll.

source: :c:func:`devpoll` objects are linked to the number of file descriptors allowed at the time of instantiation. If your program reduces this value, :c:func:`devpoll` will fail. If your program increases this value, :c:func:`devpoll` may return an incomplete list of active file descriptors.
uk: Об’єкти :c:func:`devpoll` пов’язані з кількістю дескрипторів файлів, дозволених на момент створення екземпляра. Якщо ваша програма зменшить це значення, :c:func:`devpoll` не вийде. Якщо ваша програма збільшує це значення, :c:func:`devpoll` може повернути неповний список активних файлових дескрипторів.

source: The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
uk: Новий файловий дескриптор :ref:`не успадковується <fd_inheritance>`.

source: The new file descriptor is now non-inheritable.
uk: Новий файловий дескриптор тепер не успадковується.

source: (Only supported on Linux 2.5.44 and newer.) Return an edge polling object, which can be used as Edge or Level Triggered interface for I/O events.
uk: (Підтримується лише в Linux 2.5.44 і новіших версіях.) Повертає об’єкт опитування краю, який можна використовувати як інтерфейс Edge або Level Triggered для подій введення/виведення.

source: *sizehint* informs epoll about the expected number of events to be registered. It must be positive, or `-1` to use the default. It is only used on older systems where :c:func:`epoll_create1` is not available; otherwise it has no effect (though its value is still checked).
uk: *sizehint* повідомляє epoll про очікувану кількість подій, які будуть зареєстровані. Він має бути позитивним або `-1`, щоб використовувати значення за умовчанням. Він використовується лише в старих системах, де :c:func:`epoll_create1` недоступний; інакше це не має ефекту (хоча його значення все ще перевіряється).

source: *flags* is deprecated and completely ignored. However, when supplied, its value must be ``0`` or ``select.EPOLL_CLOEXEC``, otherwise ``OSError`` is raised.
uk: *flags* застаріло та повністю ігнорується. Однак, коли надається, його значення має бути ``0`` або ``select.EPOLL_CLOEXEC``, інакше ``OSError`` викликається.

source: See the :ref:`epoll-objects` section below for the methods supported by epolling objects.
uk: Перегляньте розділ :ref:`epoll-objects` нижче, щоб дізнатися про методи, які підтримуються об’єктами електронного опитування.

source: ``epoll`` objects support the context management protocol: when used in a :keyword:`with` statement, the new file descriptor is automatically closed at the end of the block.
uk: Об’єкти ``epoll`` підтримують протокол керування контекстом: при використанні в операторі :keyword:`with` новий дескриптор файлу автоматично закривається в кінці блоку.

source: Added the *flags* parameter.
uk: Додано параметр *flags*.

source: Support for the :keyword:`with` statement was added. The new file descriptor is now non-inheritable.
uk: Додано підтримку оператора :keyword:`with`. Новий файловий дескриптор тепер не успадковується.

source: The *flags* parameter. ``select.EPOLL_CLOEXEC`` is used by default now. Use :func:`os.set_inheritable` to make the file descriptor inheritable.
uk: Параметр *flags*. ``select.EPOLL_CLOEXEC`` зараз використовується за умовчанням. Використовуйте :func:`os.set_inheritable`, щоб зробити дескриптор файлу спадковим.

source: (Not supported by all operating systems.) Returns a polling object, which supports registering and unregistering file descriptors, and then polling them for I/O events; see section :ref:`poll-objects` below for the methods supported by polling objects.
uk: (Підтримується не всіма операційними системами.) Повертає об’єкт опитування, який підтримує реєстрацію та скасування реєстрації дескрипторів файлів, а потім опитування їх для подій введення/виведення; дивіться розділ :ref:`poll-objects` нижче щодо методів, які підтримуються об’єктами опитування.

source: (Only supported on BSD.) Returns a kernel queue object; see section :ref:`kqueue-objects` below for the methods supported by kqueue objects.
uk: (Підтримується лише в BSD.) Повертає об’єкт черги ядра; перегляньте розділ :ref:`kqueue-objects` нижче, щоб дізнатися про методи, які підтримуються об’єктами kqueue.

source: (Only supported on BSD.) Returns a kernel event object; see section :ref:`kevent-objects` below for the methods supported by kevent objects.
uk: (Підтримується лише в BSD.) Повертає об’єкт події ядра; дивіться розділ :ref:`kevent-objects` нижче щодо методів, які підтримуються об’єктами kevent.

source: This is a straightforward interface to the Unix :c:func:`select` system call. The first three arguments are iterables of 'waitable objects': either integers representing file descriptors or objects with a parameterless method named :meth:`~io.IOBase.fileno` returning such an integer:
uk: Це простий інтерфейс для системного виклику Unix :c:func:`select`. Перші три аргументи є ітераціями "об’єктів, які можна очікувати": або цілих чисел, що представляють дескриптори файлів, або об’єктів із методом без параметрів під назвою :meth:`~io.IOBase.fileno`, який повертає таке ціле число:

source: *rlist*: wait until ready for reading
uk: *rlist*: дочекатися готовності до читання

source: *wlist*: wait until ready for writing
uk: *wlist*: дочекатися готовності до запису

source: *xlist*: wait for an "exceptional condition" (see the manual page for what your system considers such a condition)
uk: *xlist*: зачекайте на "виняткову умову" (перегляньте сторінку посібника щодо того, що ваша система вважає такою умовою)

source: Empty iterables are allowed, but acceptance of three empty iterables is platform-dependent. (It is known to work on Unix but not on Windows.) The optional *timeout* argument specifies a time-out as a floating point number in seconds. When the *timeout* argument is omitted the function blocks until at least one file descriptor is ready. A time-out value of zero specifies a poll and never blocks.
uk: Допускаються порожні ітерації, але прийняття трьох порожніх ітерацій залежить від платформи. (Відомо, що він працює в Unix, але не в Windows.) Додатковий аргумент *timeout* визначає час очікування як число з плаваючою комою в секундах. Якщо аргумент *timeout* опущено, функція блокується, доки не буде готовий принаймні один файловий дескриптор. Нульове значення тайм-ауту вказує на опитування та ніколи не блокується.

source: The return value is a triple of lists of objects that are ready: subsets of the first three arguments. When the time-out is reached without a file descriptor becoming ready, three empty lists are returned.
uk: Повернене значення — це трійка списків готових об’єктів: підмножини перших трьох аргументів. Коли час очікування досягнуто, а дескриптор файлу не готовий, повертаються три порожні списки.

source: Among the acceptable object types in the iterables are Python :term:`file objects <file object>` (e.g. ``sys.stdin``, or objects returned by :func:`open` or :func:`os.popen`), socket objects returned by :func:`socket.socket`. You may also define a :dfn:`wrapper` class yourself, as long as it has an appropriate :meth:`~io.IOBase.fileno` method (that really returns a file descriptor, not just a random integer).
uk: Серед прийнятних типів об’єктів у ітераціях є :term:`файлові об’єкти Python <file object>` (наприклад, ``sys.stdin`` або об’єкти, повернуті :func:`open` або :func:`os.popen`), сокет об’єкти, які повертає :func:`socket.socket`. Ви також можете визначити клас :dfn:`wrapper` самостійно, за умови, що він має відповідний метод :meth:`~io.IOBase.fileno` (який дійсно повертає дескриптор файлу, а не просто випадкове ціле число).

source: File objects on Windows are not acceptable, but sockets are. On Windows, the underlying :c:func:`select` function is provided by the WinSock library, and does not handle file descriptors that don't originate from WinSock.
uk: Файлові об’єкти в Windows неприйнятні, але сокети – прийнятні. У Windows основна функція :c:func:`select` надається бібліотекою WinSock і не обробляє дескриптори файлів, які не походять із WinSock.

source: The function is now retried with a recomputed timeout when interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale), instead of raising :exc:`InterruptedError`.
uk: Функція тепер виконується повторно з переобчисленим тайм-аутом, якщо її перериває сигнал, за винятком випадків, коли обробник сигналу викликає виняток (перегляньте :pep:`475` для обґрунтування), замість того, щоб викликати :exc:`InterruptedError`.

source: The minimum number of bytes which can be written without blocking to a pipe when the pipe has been reported as ready for writing by :func:`~select.select`, :func:`poll` or another interface in this module. This doesn't apply to other kind of file-like objects such as sockets.
uk: Мінімальна кількість байтів, яку можна записати без блокування в канал, якщо канал був повідомлений як готовий до запису :func:`~select.select`, :func:`poll` або іншим інтерфейсом цього модуля. Це не стосується інших видів файлоподібних об’єктів, таких як сокети.

source: This value is guaranteed by POSIX to be at least 512.
uk: POSIX гарантує, що це значення буде не менше 512.

source: :ref:`Availability <availability>`: Unix
uk: :ref:`Наявність <availability>`: Unix

source: ``/dev/poll`` Polling Objects
uk: ``/dev/poll`` Опитування об'єктів

source: Solaris and derivatives have ``/dev/poll``. While :c:func:`select` is O(highest file descriptor) and :c:func:`poll` is O(number of file descriptors), ``/dev/poll`` is O(active file descriptors).
uk: Solaris і похідні мають ``/dev/poll``. Тоді як :c:func:`select` — це O (найвищий дескриптор файлу), а :c:func:`poll` — це O (кількість дескрипторів файлу), ``/dev/poll`` — це O (активні дескриптори файлу).

source: ``/dev/poll`` behaviour is very close to the standard :c:func:`poll` object.
uk: Поведінка ``/dev/poll`` дуже близька до стандартного об'єкта :c:func:`poll`.

source: Close the file descriptor of the polling object.
uk: Закрийте файловий дескриптор об'єкта опитування.

source: ``True`` if the polling object is closed.
uk: ``True``, якщо об'єкт опитування закрито.

source: Return the file descriptor number of the polling object.
uk: Повертає номер дескриптора файлу об'єкта опитування.

source: Register a file descriptor with the polling object. Future calls to the :meth:`poll` method will then check whether the file descriptor has any pending I/O events. *fd* can be either an integer, or an object with a :meth:`~io.IOBase.fileno` method that returns an integer. File objects implement :meth:`!fileno`, so they can also be used as the argument.
uk: Зареєструйте дескриптор файлу з об'єктом опитування. Подальші виклики методу :meth:`poll` перевірятимуть, чи є в дескрипторі файлу будь-які незавершені події введення/виведення. *fd* може бути або цілим числом, або об’єктом із методом :meth:`~io.IOBase.fileno`, який повертає ціле число. Файлові об’єкти реалізують :meth:`!fileno`, тому їх також можна використовувати як аргумент.

source: *eventmask* is an optional bitmask describing the type of events you want to check for. The constants are the same that with :c:func:`poll` object. The default value is a combination of the constants :const:`POLLIN`, :const:`POLLPRI`, and :const:`POLLOUT`.
uk: *eventmask* — це необов’язкова бітова маска, яка описує тип подій, які ви хочете перевірити. Константи такі самі, як і з об’єктом :c:func:`poll`. Значення за замовчуванням є комбінацією констант :const:`POLLIN`, :const:`POLLPRI` і :const:`POLLOUT`.

source: Registering a file descriptor that's already registered is not an error, but the result is undefined. The appropriate action is to unregister or modify it first. This is an important difference compared with :c:func:`poll`.
uk: Реєстрація вже зареєстрованого файлового дескриптора не є помилкою, але результат невизначений. Відповідною дією є спочатку скасування реєстрації або змінення. Це важлива відмінність порівняно з :c:func:`poll`.

source: This method does an :meth:`unregister` followed by a :meth:`register`. It is (a bit) more efficient that doing the same explicitly.
uk: Цей метод виконує :meth:`unregister`, а потім :meth:`register`. Це (трохи) ефективніше, ніж робити те саме явно.

source: Remove a file descriptor being tracked by a polling object. Just like the :meth:`register` method, *fd* can be an integer or an object with a :meth:`~io.IOBase.fileno` method that returns an integer.
uk: Видаліть дескриптор файлу, який відстежується об'єктом опитування. Як і метод :meth:`register`, *fd* може бути цілим числом або об’єктом із методом :meth:`~io.IOBase.fileno`, який повертає ціле число.

source: Attempting to remove a file descriptor that was never registered is safely ignored.
uk: Спроба видалити дескриптор файлу, який ніколи не був зареєстрований, безпечно ігнорується.

source: Polls the set of registered file descriptors, and returns a possibly-empty list containing ``(fd, event)`` 2-tuples for the descriptors that have events or errors to report. *fd* is the file descriptor, and *event* is a bitmask with bits set for the reported events for that descriptor --- :const:`POLLIN` for waiting input, :const:`POLLOUT` to indicate that the descriptor can be written to, and so forth. An empty list indicates that the call timed out and no file descriptors had any events to report. If *timeout* is given, it specifies the length of time in milliseconds which the system will wait for events before returning. If *timeout* is omitted, -1, or :const:`None`, the call will block until there is an event for this poll object.
uk: Опитує набір зареєстрованих файлових дескрипторів і повертає, можливо, порожній список, що містить ``(fd, event)`` 2-кортежі для дескрипторів, які мають події або помилки для звіту. *fd* — це дескриптор файлу, а *event* — це бітова маска з бітами, установленими для повідомлених подій для цього дескриптора --- :const:`POLLIN` для очікування введення, :const:`POLLOUT`, щоб вказати, що дескриптор може написати, і так далі. Порожній список вказує на те, що виклик минув, а дескриптори файлів не мали жодних подій для звіту. Якщо задано *timeout*, воно вказує тривалість часу в мілісекундах, протягом якого система чекатиме на події перед поверненням. Якщо *timeout* пропущено, -1 або :const:`None`, виклик блокуватиметься, доки не відбудеться подія для цього об’єкта опитування.

source: Edge and Level Trigger Polling (epoll) Objects
uk: Опитування (epoll) об’єктів тригера краю та рівня

source: *eventmask*
uk: *маска події*

source: Constant
uk: Постійний

source: Meaning
uk: Значення

source: Available for read
uk: Доступний для читання

source: Available for write
uk: Доступний для запису

source: Urgent data for read
uk: Термінові дані для читання

source: Error condition happened on the assoc. fd
uk: Сталася помилка на доц. fd

source: Hang up happened on the assoc. fd
uk: Зависання сталося на доц. fd

source: Set Edge Trigger behavior, the default is Level Trigger behavior
uk: Встановіть поведінку Edge Trigger, за замовчуванням це Level Trigger

source: Set one-shot behavior. After one event is pulled out, the fd is internally disabled
uk: Встановіть одноразову поведінку. Після вилучення однієї події fd внутрішньо вимикається

source: Wake only one epoll object when the associated fd has an event. The default (if this flag is not set) is to wake all epoll objects polling on a fd.
uk: Розбудити лише один об’єкт epoll, якщо пов’язаний fd має подію. За замовчуванням (якщо цей прапорець не встановлено) всі об’єкти epoll запитуються на fd.

source: Stream socket peer closed connection or shut down writing half of connection.
uk: Потоковий сокет закрив однорангове з’єднання або завершив запис половини з’єднання.

source: Equivalent to :const:`EPOLLIN`
uk: Еквівалент :const:`EPOLLIN`

source: Priority data band can be read.
uk: Смугу пріоритетних даних можна зчитувати.

source: Equivalent to :const:`EPOLLOUT`
uk: Еквівалент :const:`EPOLLOUT`

source: Priority data may be written.
uk: Пріоритетні дані можуть бути записані.

source: Ignored.
uk: Ігнорується.

source: :const:`EPOLLEXCLUSIVE` was added. It's only supported by Linux Kernel 4.5 or later.
uk: :const:`EPOLLEXCLUSIVE` додано. Він підтримується лише ядром Linux 4.5 або новішої версії.

source: Close the control file descriptor of the epoll object.
uk: Закрийте дескриптор керуючого файлу об’єкта epoll.

source: ``True`` if the epoll object is closed.
uk: ``True``, якщо об’єкт epoll закрито.

source: Return the file descriptor number of the control fd.
uk: Повертає номер дескриптора файлу елемента керування fd.

source: Create an epoll object from a given file descriptor.
uk: Створіть об’єкт epoll із заданого файлового дескриптора.

source: Register a fd descriptor with the epoll object.
uk: Зареєструйте дескриптор fd з об’єктом epoll.

source: Modify a registered file descriptor.
uk: Змінити зареєстрований файловий дескриптор.

source: Remove a registered file descriptor from the epoll object.
uk: Видаліть зареєстрований дескриптор файлу з об’єкта epoll.

source: The method no longer ignores the :data:`~errno.EBADF` error.
uk: Метод більше не ігнорує помилку :data:`~errno.EBADF`.

source: Wait for events. timeout in seconds (float)
uk: Чекайте подій. тайм-аут у секундах (float)

source: Polling Objects
uk: Об'єкти опитування

source: The :c:func:`poll` system call, supported on most Unix systems, provides better scalability for network servers that service many, many clients at the same time. :c:func:`poll` scales better because the system call only requires listing the file descriptors of interest, while :c:func:`select` builds a bitmap, turns on bits for the fds of interest, and then afterward the whole bitmap has to be linearly scanned again. :c:func:`select` is O(highest file descriptor), while :c:func:`poll` is O(number of file descriptors).
uk: Системний виклик :c:func:`poll`, який підтримується більшістю систем Unix, забезпечує кращу масштабованість для мережевих серверів, які обслуговують багато, багато клієнтів одночасно. :c:func:`poll` масштабується краще, тому що системний виклик вимагає лише переліку дескрипторів файлів, що цікавлять, тоді як :c:func:`select` створює растрове зображення, вмикає біти для fds, що цікавить, а потім усе растрове зображення потрібно знову лінійно відсканувати. :c:func:`select` — це O (найвищий дескриптор файлу), тоді як :c:func:`poll` — це O (кількість дескрипторів файлу).

source: *eventmask* is an optional bitmask describing the type of events you want to check for, and can be a combination of the constants :const:`POLLIN`, :const:`POLLPRI`, and :const:`POLLOUT`, described in the table below. If not specified, the default value used will check for all 3 types of events.
uk: *eventmask* — це необов’язкова бітова маска, що описує тип подій, які ви хочете перевірити, і може бути комбінацією констант :const:`POLLIN`, :const:`POLLPRI` і :const:`POLLOUT`, описаних у таблицю нижче. Якщо не вказано, значення за умовчанням перевірятиме всі 3 типи подій.

source: There is data to read
uk: Є дані для читання

source: There is urgent data to read
uk: Є термінові дані для читання

source: Ready for output: writing will not block
uk: Готовий до виведення: запис не блокуватиметься

source: Error condition of some sort
uk: Якась помилка

source: Hung up
uk: Повісив

source: Stream socket peer closed connection, or shut down writing half of connection
uk: Закрите однорангове з’єднання потокового сокета або завершіть запис половини з’єднання

source: :const:`POLLNVAL`
uk: :const:`POLNVAL`

source: Invalid request: descriptor not open
uk: Недійсний запит: дескриптор не відкрито

source: Registering a file descriptor that's already registered is not an error, and has the same effect as registering the descriptor exactly once.
uk: Реєстрація дескриптора файлу, який уже зареєстровано, не є помилкою та має той самий ефект, що й одноразова реєстрація дескриптора.

source: Modifies an already registered fd. This has the same effect as ``register(fd, eventmask)``. Attempting to modify a file descriptor that was never registered causes an :exc:`OSError` exception with errno :const:`ENOENT` to be raised.
uk: Змінює вже зареєстрований fd. Це має той самий ефект, що й ``register(fd, eventmask)``. Спроба змінити дескриптор файлу, який ніколи не був зареєстрований, викликає виняток :exc:`OSError` з errno :const:`ENOENT`.

source: Attempting to remove a file descriptor that was never registered causes a :exc:`KeyError` exception to be raised.
uk: Спроба видалити дескриптор файлу, який ніколи не був зареєстрований, викликає виняток :exc:`KeyError`.
