Repository: python/python-docs-uk
Catalog: library/select.po
Languages: uk

source: Polls the set of registered file descriptors, and returns a possibly-empty list containing ``(fd, event)`` 2-tuples for the descriptors that have events or errors to report. *fd* is the file descriptor, and *event* is a bitmask with bits set for the reported events for that descriptor --- :const:`POLLIN` for waiting input, :const:`POLLOUT` to indicate that the descriptor can be written to, and so forth. An empty list indicates that the call timed out and no file descriptors had any events to report. If *timeout* is given, it specifies the length of time in milliseconds which the system will wait for events before returning. If *timeout* is omitted, negative, or :const:`None`, the call will block until there is an event for this poll object.
uk: Опитує набір зареєстрованих файлових дескрипторів і повертає, можливо, порожній список, що містить ``(fd, event)`` 2-кортежі для дескрипторів, які мають події або помилки для звіту. *fd* — це дескриптор файлу, а *event* — це бітова маска з бітами, встановленими для повідомлених подій для цього дескриптора --- :const:`POLLIN` для очікування введення, :const:`POLLOUT`, щоб вказати, що дескриптор може написати, і так далі. Порожній список вказує на те, що виклик минув, а дескриптори файлів не мали жодних подій для звіту. Якщо задано *timeout*, воно вказує тривалість часу в мілісекундах, протягом якого система чекатиме на події перед поверненням. Якщо *timeout* пропущений, негативний або :const:`None`, виклик блокуватиметься, доки не відбудеться подія для цього об’єкта опитування.

source: Kqueue Objects
uk: Об’єкти Kqueue

source: Close the control file descriptor of the kqueue object.
uk: Закрийте дескриптор керуючого файлу об’єкта kqueue.

source: ``True`` if the kqueue object is closed.
uk: ``True``, якщо об’єкт kqueue закрито.

source: Create a kqueue object from a given file descriptor.
uk: Створіть об’єкт kqueue із заданого файлового дескриптора.

source: Low level interface to kevent
uk: Низькорівневий інтерфейс для kevent

source: changelist must be an iterable of kevent objects or ``None``
uk: список змін має бути ітерованим об’єктами kevent або ``None``

source: max_events must be 0 or a positive integer
uk: max_events має бути 0 або додатним цілим числом

source: timeout in seconds (floats possible); the default is ``None``, to wait forever
uk: тайм-аут у секундах (можливі флоати); типовим є ``None``, чекати вічно

source: Kevent Objects
uk: Об'єкти Kevent

source: Value used to identify the event. The interpretation depends on the filter but it's usually the file descriptor. In the constructor ident can either be an int or an object with a :meth:`~io.IOBase.fileno` method. kevent stores the integer internally.
uk: Значення, що використовується для ідентифікації події. Інтерпретація залежить від фільтра, але зазвичай це дескриптор файлу. У конструкторі ident може бути або int, або об’єктом із методом :meth:`~io.IOBase.fileno`. kevent зберігає ціле число всередині.

source: Name of the kernel filter.
uk: Назва фільтра ядра.

source: Takes a descriptor and returns whenever there is data available to read
uk: Бере дескриптор і повертає, коли є дані, доступні для читання

source: Takes a descriptor and returns whenever there is data available to write
uk: Бере дескриптор і повертає щоразу, коли є дані для запису

source: AIO requests
uk: запити AIO

source: Returns when one or more of the requested events watched in *fflag* occurs
uk: Повертається, коли відбувається одна або кілька запитаних подій, які переглядаються в *fflag*

source: Watch for events on a process id
uk: Слідкуйте за подіями в ідентифікаторі процесу

source: Watch for events on a network device [not available on macOS]
uk: Стежити за подіями на мережевому пристрої [недоступно в macOS]

source: Returns whenever the watched signal is delivered to the process
uk: Повертається щоразу, коли спостережуваний сигнал надходить до процесу

source: Establishes an arbitrary timer
uk: Встановлює довільний таймер

source: Filter action.
uk: Дія фільтра.

source: Adds or modifies an event
uk: Додає або змінює подію

source: Removes an event from the queue
uk: Вилучає подію з черги

source: Permitscontrol() to returns the event
uk: Permitscontrol() to повертає подію

source: Disablesevent
uk: Вимкнути подію

source: Removes event after first occurrence
uk: Видаляє подію після першого входження

source: Reset the state after an event is retrieved
uk: Скинути стан після отримання події

source: internal event
uk: внутрішня подія

source: Filter specific EOF condition
uk: Фільтр певної умови EOF

source: See return values
uk: Перегляньте значення, що повертаються

source: Filter specific flags.
uk: Фільтрувати певні прапорці.

source: :const:`KQ_FILTER_READ` and :const:`KQ_FILTER_WRITE` filter flags:
uk: :const:`KQ_FILTER_READ` і :const:`KQ_FILTER_WRITE` позначки фільтрів:

source: low water mark of a socket buffer
uk: низька позначка буфера сокета

source: :const:`KQ_FILTER_VNODE` filter flags:
uk: :const:`KQ_FILTER_VNODE` позначки фільтра:

source: *unlink()* was called
uk: Викликано *unlink()*

source: a write occurred
uk: відбувся запис

source: the file was extended
uk: файл було розширено

source: an attribute was changed
uk: атрибут було змінено

source: the link count has changed
uk: кількість посилань змінилася

source: the file was renamed
uk: файл було перейменовано

source: access to the file was revoked
uk: доступ до файлу скасовано

source: :const:`KQ_FILTER_PROC` filter flags:
uk: :const:`KQ_FILTER_PROC` позначки фільтра:

source: the process has exited
uk: процес вийшов

source: the process has called *fork()*
uk: процес викликав *fork()*

source: the process has executed a new process
uk: процес виконав новий процес

source: internal filter flag
uk: прапор внутрішнього фільтра

source: follow a process across *fork()*
uk: виконайте процес через *fork()*

source: returned on the child process for *NOTE_TRACK*
uk: повернуто дочірнім процесом для *NOTE_TRACK*

source: unable to attach to a child
uk: не може прив'язатися до дитини

source: :const:`KQ_FILTER_NETDEV` filter flags (not available on macOS):
uk: :const:`KQ_FILTER_NETDEV` позначки фільтра (недоступні в macOS):

source: link is up
uk: посилання працює

source: link is down
uk: посилання не працює

source: link state is invalid
uk: стан посилання недійсний

source: Filter specific data.
uk: Фільтр конкретних даних.

source: User defined value.
uk: Визначене користувачем значення.
