Repository: python/python-docs-uk
Catalog: library/shutil.po
Languages: uk

source: **Source code:** :source:`Lib/shutil.py`
uk: **Вихідний код:** :source:`Lib/shutil.py`

source: The :mod:`shutil` module offers a number of high-level operations on files and collections of files. In particular, functions are provided which support file copying and removal. For operations on individual files, see also the :mod:`os` module.
uk: Модуль :mod:`shutil` пропонує низку високорівневих операцій над файлами та колекціями файлів. Зокрема, передбачені функції, які підтримують копіювання та видалення файлів. Для операцій з окремими файлами дивіться також модуль :mod:`os`.

source: Even the higher-level file copying functions (:func:`shutil.copy`, :func:`shutil.copy2`) cannot copy all file metadata.
uk: Навіть функції копіювання файлів вищого рівня (:func:`shutil.copy`, :func:`shutil.copy2`) не можуть скопіювати всі метадані файлу.

source: On POSIX platforms, this means that file owner and group are lost as well as ACLs. On Mac OS, the resource fork and other metadata are not used. This means that resources will be lost and file type and creator codes will not be correct. On Windows, file owners, ACLs and alternate data streams are not copied.
uk: На платформах POSIX це означає, що власник файлу та група втрачаються, а також ACL. У Mac OS форк ресурсів та інші метадані не використовуються. Це означає, що ресурси буде втрачено, а тип файлу та коди творця будуть неправильними. У Windows власники файлів, ACL та альтернативні потоки даних не копіюються.

source: Directory and files operations
uk: Операції з каталогами та файлами

source: *dst* must be the complete target file name; look at :func:`~shutil.copy` for a copy that accepts a target directory path. If *src* and *dst* specify the same file, :exc:`SameFileError` is raised.
uk: *dst* має бути повним ім’ям цільового файлу; подивіться на :func:`~shutil.copy` копію, яка приймає шлях цільового каталогу. Якщо *src* і *dst* вказують той самий файл, виникає :exc:`SameFileError`.

source: The destination location must be writable; otherwise, an :exc:`OSError` exception will be raised. If *dst* already exists, it will be replaced. Special files such as character or block devices and pipes cannot be copied with this function.
uk: Місце призначення має бути доступним для запису; інакше буде викликано виняток :exc:`OSError`. Якщо *dst* вже існує, його буде замінено. За допомогою цієї функції неможливо скопіювати спеціальні файли, такі як символьні або блокові пристрої та канали.

source: If *follow_symlinks* is false and *src* is a symbolic link, a new symbolic link will be created instead of copying the file *src* points to.
uk: Якщо *follow_symlinks* має значення false, а *src* є символічним посиланням, замість копіювання файлу, на який вказує *src*, буде створено нове символічне посилання.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copyfile`` with arguments ``src``, ``dst``.
uk: Викликає :ref:`подію аудиту <auditing>` ``shutil.copyfile`` з аргументами ``src``, ``dst``.

source: :exc:`IOError` used to be raised instead of :exc:`OSError`. Added *follow_symlinks* argument. Now returns *dst*.
uk: Раніше викликалося :exc:`IOError` замість :exc:`OSError`. Додано аргумент *follow_symlinks*. Тепер повертає *dst*.

source: Raise :exc:`SameFileError` instead of :exc:`Error`. Since the former is a subclass of the latter, this change is backward compatible.
uk: Викликати :exc:`SameFileError` замість :exc:`Error`. Оскільки перший є підкласом останнього, ця зміна є зворотно сумісною.

source: Platform-specific fast-copy syscalls may be used internally in order to copy the file more efficiently. See :ref:`shutil-platform-dependent-efficient-copy-operations` section.
uk: Спеціальні для платформи системні виклики швидкого копіювання можуть використовуватися внутрішньо для більш ефективного копіювання файлу. Перегляньте розділ :ref:`shutil-platform-dependent-efficient-copy-operations`.

source: This exception is raised if source and destination in :func:`copyfile` are the same file.
uk: Цей виняток виникає, якщо джерело та призначення у :func:`copyfile` є одним і тим самим файлом.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copymode`` with arguments ``src``, ``dst``.
uk: Викликає :ref:`подію аудиту <auditing>` ``shutil.copymode`` з аргументами ``src``, ``dst``.

source: Added *follow_symlinks* argument.
uk: Додано аргумент *follow_symlinks*.

source: If *follow_symlinks* is false, and *src* and *dst* both refer to symbolic links, :func:`copystat` will operate on the symbolic links themselves rather than the files the symbolic links refer to—reading the information from the *src* symbolic link, and writing the information to the *dst* symbolic link.
uk: Якщо *follow_symlinks* має значення false, а *src* і *dst* посилаються на символічні посилання, :func:`copystat` працюватиме з самими символьними посиланнями, а не з файлами, на які посилаються символічні посилання, зчитуючи інформацію з *символьне посилання src* і запис інформації до символічного посилання *dst*.

source: Not all platforms provide the ability to examine and modify symbolic links. Python itself can tell you what functionality is locally available.
uk: Не всі платформи надають можливість перевіряти та змінювати символічні посилання. Python сам може сказати вам, які функції доступні локально.

source: If ``os.chmod in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the permission bits of a symbolic link.
uk: Якщо ``os.chmod в os.supports_follow_symlinks`` має значення ``True``, :func:`copystat` може змінити біти дозволу символічного посилання.

source: If ``os.utime in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the last access and modification times of a symbolic link.
uk: Якщо ``os.utime в os.supports_follow_symlinks`` має значення ``True``, :func:`copystat` може змінити час останнього доступу та модифікації символічного посилання.

source: If ``os.chflags in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the flags of a symbolic link. (``os.chflags`` is not available on all platforms.)
uk: Якщо ``os.chflags в os.supports_follow_symlinks`` має значення ``True``, :func:`copystat` може змінювати прапорці символічного посилання. (``os.chflags`` доступний не на всіх платформах.)

source: On platforms where some or all of this functionality is unavailable, when asked to modify a symbolic link, :func:`copystat` will copy everything it can. :func:`copystat` never returns failure.
uk: На платформах, де деякі або всі ці функції недоступні, коли буде запропоновано змінити символічне посилання, :func:`copystat` скопіює все, що зможе. :func:`copystat` ніколи не повертає помилку.

source: Please see :data:`os.supports_follow_symlinks` for more information.
uk: Для отримання додаткової інформації перегляньте :data:`os.supports_follow_symlinks`.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copystat`` with arguments ``src``, ``dst``.
uk: Викликає :ref:`подію аудиту <auditing>` ``shutil.copystat`` з аргументами ``src``, ``dst``.

source: Added *follow_symlinks* argument and support for Linux extended attributes.
uk: Додано аргумент *follow_symlinks* і підтримку розширених атрибутів Linux.

source: Copies the file *src* to the file or directory *dst*. *src* and *dst* should be :term:`path-like objects <path-like object>` or strings. If *dst* specifies a directory, the file will be copied into *dst* using the base filename from *src*. If *dst* specifies a file that already exists, it will be replaced. Returns the path to the newly created file.
uk: Копіює файл *src* у файл або каталог *dst*. *src* і *dst* повинні бути :term:`шляховими об’єктами <path-like object>` або рядками. Якщо *dst* визначає каталог, файл буде скопійовано в *dst* з використанням базового імені файлу з *src*. Якщо *dst* вказує на файл, який уже існує, його буде замінено. Повертає шлях до щойно створеного файлу.

source: If *follow_symlinks* is false, and *src* is a symbolic link, *dst* will be created as a symbolic link. If *follow_symlinks* is true and *src* is a symbolic link, *dst* will be a copy of the file *src* refers to.
uk: Якщо *follow_symlinks* має значення false, а *src* є символічним посиланням, *dst* буде створено як символічне посилання. Якщо *follow_symlinks* має значення true і *src* є символічним посиланням, *dst* буде копією файлу, на який посилається *src*.

source: :func:`~shutil.copy` copies the file data and the file's permission mode (see :func:`os.chmod`). Other metadata, like the file's creation and modification times, is not preserved. To preserve all file metadata from the original, use :func:`~shutil.copy2` instead.
uk: :func:`~shutil.copy` копіює дані файлу та режим дозволу файлу (див. :func:`os.chmod`). Інші метадані, наприклад час створення та модифікації файлу, не зберігаються. Щоб зберегти всі метадані файлу з оригіналу, замість цього використовуйте :func:`~shutil.copy2`.

source: Added *follow_symlinks* argument. Now returns path to the newly created file.
uk: Додано аргумент *follow_symlinks*. Тепер повертає шлях до щойно створеного файлу.

source: Identical to :func:`~shutil.copy` except that :func:`copy2` also attempts to preserve file metadata.
uk: Ідентичний :func:`~shutil.copy` за винятком того, що :func:`copy2` також намагається зберегти метадані файлу.

source: :func:`copy2` uses :func:`copystat` to copy the file metadata. Please see :func:`copystat` for more information about platform support for modifying symbolic link metadata.
uk: :func:`copy2` використовує :func:`copystat` для копіювання метаданих файлу. Перегляньте :func:`copystat` для отримання додаткової інформації про підтримку платформи для зміни метаданих символічних посилань.

source: Added *follow_symlinks* argument, try to copy extended file system attributes too (currently Linux only). Now returns path to the newly created file.
uk: Додано аргумент *follow_symlinks*, також спробуйте скопіювати розширені атрибути файлової системи (наразі лише для Linux). Тепер повертає шлях до щойно створеного файлу.

source: This factory function creates a function that can be used as a callable for :func:`copytree`\'s *ignore* argument, ignoring files and directories that match one of the glob-style *patterns* provided. See the example below.
uk: Ця фабрична функція створює функцію, яку можна використовувати як виклик для аргументу *ignore* :func:`copytree`\, ігноруючи файли та каталоги, які відповідають одному з наданих *шаблонів* стилю glob. Дивіться приклад нижче.

source: Recursively copy an entire directory tree rooted at *src* to a directory named *dst* and return the destination directory. All intermediate directories needed to contain *dst* will also be created by default.
uk: Рекурсивно скопіюйте все дерево каталогів із коренем *src* до каталогу з назвою *dst* і поверніть каталог призначення. Усі проміжні каталоги, які повинні містити *dst*, також будуть створені за замовчуванням.

source: Permissions and times of directories are copied with :func:`copystat`, individual files are copied using :func:`~shutil.copy2`.
uk: Дозволи та час каталогів копіюються за допомогою :func:`copystat`, окремі файли копіюються за допомогою :func:`~shutil.copy2`.

source: If *symlinks* is true, symbolic links in the source tree are represented as symbolic links in the new tree and the metadata of the original links will be copied as far as the platform allows; if false or omitted, the contents and metadata of the linked files are copied to the new tree.
uk: Якщо *symlinks* має значення true, символічні посилання у вихідному дереві представлені як символічні посилання в новому дереві, а метадані оригінальних посилань буде скопійовано, наскільки це дозволяє платформа; якщо false або пропущено, вміст і метадані пов’язаних файлів копіюються до нового дерева.

source: If *ignore* is given, it must be a callable that will receive as its arguments the directory being visited by :func:`copytree`, and a list of its contents, as returned by :func:`os.listdir`. Since :func:`copytree` is called recursively, the *ignore* callable will be called once for each directory that is copied. The callable must return a sequence of directory and file names relative to the current directory (i.e. a subset of the items in its second argument); these names will then be ignored in the copy process. :func:`ignore_patterns` can be used to create such a callable that ignores names based on glob-style patterns.
uk: Якщо задано *ignore*, це має бути виклик, який отримає як аргументи каталог, який відвідує :func:`copytree`, і список його вмісту, який повертає :func:`os.listdir`. Оскільки :func:`copytree` викликається рекурсивно, *ignore* викликається один раз для кожного каталогу, який копіюється. Викликаний має повертати послідовність імен каталогу та файлу відносно поточного каталогу (тобто підмножину елементів у другому аргументі); ці імена будуть проігноровані в процесі копіювання. :func:`ignore_patterns` можна використати для створення такого виклику, який ігнорує імена на основі шаблонів у стилі glob.

source: If exception(s) occur, an :exc:`Error` is raised with a list of reasons.
uk: Якщо трапляються винятки, виникає повідомлення :exc:`Error` зі списком причин.

source: If *copy_function* is given, it must be a callable that will be used to copy each file. It will be called with the source path and the destination path as arguments. By default, :func:`~shutil.copy2` is used, but any function that supports the same signature (like :func:`~shutil.copy`) can be used.
uk: Якщо задано *copy_function*, це має бути виклик, який використовуватиметься для копіювання кожного файлу. Він буде викликаний із вихідним шляхом і цільовим шляхом як аргументами. За замовчуванням використовується :func:`~shutil.copy2`, але можна використовувати будь-яку функцію, яка підтримує такий самий підпис (наприклад, :func:`~shutil.copy`).

source: If *dirs_exist_ok* is false (the default) and *dst* already exists, a :exc:`FileExistsError` is raised. If *dirs_exist_ok* is true, the copying operation will continue if it encounters existing directories, and files within the *dst* tree will be overwritten by corresponding files from the *src* tree.
uk: Якщо *dirs_exist_ok* має значення false (за замовчуванням), а *dst* уже існує, виникає :exc:`FileExistsError`. Якщо *dirs_exist_ok* має значення true, операція копіювання продовжуватиметься, якщо буде виявлено існуючі каталоги, а файли в дереві *dst* будуть перезаписані відповідними файлами з дерева *src*.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copytree`` with arguments ``src``, ``dst``.
uk: Викликає :ref:`подію аудиту <auditing>` ``shutil.copytree`` з аргументами ``src``, ``dst``.

source: Added the *copy_function* argument to be able to provide a custom copy function. Added the *ignore_dangling_symlinks* argument to silence dangling symlinks errors when *symlinks* is false.
uk: Додано аргумент *copy_function*, щоб мати можливість надати спеціальну функцію копіювання. Додано аргумент *ignore_dangling_symlinks*, щоб вимкнути помилки висячих символьних посилань, коли *symlinks* має значення false.

source: Copy metadata when *symlinks* is false. Now returns *dst*.
uk: Копіювати метадані, якщо *symlinks* має значення false. Тепер повертає *dst*.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>`.
uk: Ця функція може підтримувати :ref:`шляхи відносно дескрипторів каталогу <dir_fd>`.

source: On platforms that support the necessary fd-based functions a symlink attack resistant version of :func:`rmtree` is used by default. On other platforms, the :func:`rmtree` implementation is susceptible to a symlink attack: given proper timing and circumstances, attackers can manipulate symlinks on the filesystem to delete files they wouldn't be able to access otherwise. Applications can use the :data:`rmtree.avoids_symlink_attacks` function attribute to determine which case applies.
uk: На платформах, які підтримують необхідні функції на основі fd, за замовчуванням використовується стійка до атак символічних посилань версія :func:`rmtree`. На інших платформах реалізація :func:`rmtree` чутлива до атаки через символічні посилання: за належного часу та обставин зловмисники можуть маніпулювати символічними посиланнями у файловій системі, щоб видалити файли, до яких вони не мали б доступу інакше. Програми можуть використовувати атрибут функції :data:`rmtree.avoids_symlink_attacks`, щоб визначити, який регістр застосовний.

source: Added a symlink attack resistant version that is used automatically if platform supports fd-based functions.
uk: Додано версію, стійку до атак символічних посилань, яка використовується автоматично, якщо платформа підтримує функції на основі fd.

source: On Windows, will no longer delete the contents of a directory junction before removing the junction.
uk: У Windows більше не буде видаляти вміст з’єднання каталогу перед видаленням з’єднання.

source: Added the *dir_fd* parameter.
uk: Додано параметр *dir_fd*.

source: Indicates whether the current platform and implementation provides a symlink attack resistant version of :func:`rmtree`. Currently this is only true for platforms supporting fd-based directory access functions.
uk: Вказує, чи поточна платформа та реалізація забезпечують стійку до атак символічних посилань версію :func:`rmtree`. Наразі це стосується лише платформ, які підтримують функції доступу до каталогу на основі fd.

source: Raises an :ref:`auditing event <auditing>` ``shutil.move`` with arguments ``src``, ``dst``.
uk: Викликає :ref:`подію аудиту <auditing>` ``shutil.move`` з аргументами ``src``, ``dst``.

source: Added explicit symlink handling for foreign filesystems, thus adapting it to the behavior of GNU's :program:`mv`. Now returns *dst*.
uk: Додано явну обробку символічних посилань для іноземних файлових систем, таким чином адаптуючи її до поведінки GNU :program:`mv`. Тепер повертає *dst*.

source: Added the *copy_function* keyword argument.
uk: Додано аргумент ключового слова *copy_function*.

source: Accepts a :term:`path-like object` for both *src* and *dst*.
uk: Приймає :term:`path-like object` для *src* і *dst*.

source: Return disk usage statistics about the given path as a :term:`named tuple` with the attributes *total*, *used* and *free*, which are the amount of total, used and free space, in bytes. *path* may be a file or a directory.
uk: Повертає статистику використання диска щодо заданого шляху як :term:`named tuple` з атрибутами *total*, *used* і *free*, які є обсягом загального, використаного та вільного простору в байтах. *шлях* може бути файлом або каталогом.

source: On Windows, *path* can now be a file or directory.
uk: У Windows *шлях* тепер може бути файлом або каталогом.

source: Change owner *user* and/or *group* of the given *path*.
uk: Змінити власника *користувача* та/або *групу* вказаного *шляху*.

source: *user* can be a system user name or a uid; the same applies to *group*. At least one argument is required.
uk: *user* може бути системним іменем користувача або uid; те саме стосується *групи*. Потрібен принаймні один аргумент.

source: See also :func:`os.chown`, the underlying function.
uk: Дивіться також :func:`os.chown`, базову функцію.

source: Raises an :ref:`auditing event <auditing>` ``shutil.chown`` with arguments ``path``, ``user``, ``group``.
uk: Викликає :ref:`подію аудиту <auditing>` ``shutil.chown`` з аргументами ``path``, ``user``, ``group``.

source: Return the path to an executable which would be run if the given *cmd* was called. If no *cmd* would be called, return ``None``.
uk: Повертає шлях до виконуваного файлу, який буде запущено, якщо буде викликано заданий *cmd*. Якщо *cmd* не буде викликано, поверніть ``None``.

source: The :class:`bytes` type is now accepted. If *cmd* type is :class:`bytes`, the result type is also :class:`bytes`.
uk: Тип :class:`bytes` тепер прийнятний. Якщо тип *cmd* :class:`bytes`, тип результату також :class:`bytes`.

source: This exception collects exceptions that are raised during a multi-file operation. For :func:`copytree`, the exception argument is a list of 3-tuples (*srcname*, *dstname*, *exception*).
uk: Цей виняток збирає винятки, які виникають під час операції з кількома файлами. Для :func:`copytree` аргумент винятку — це список із 3-х кортежів (*srcname*, *dstname*, *exception*).

source: Platform-dependent efficient copy operations
uk: Залежні від платформи ефективні операції копіювання

source: Starting from Python 3.8, all functions involving a file copy (:func:`copyfile`, :func:`~shutil.copy`, :func:`copy2`, :func:`copytree`, and :func:`move`) may use platform-specific "fast-copy" syscalls in order to copy the file more efficiently (see :issue:`33671`). "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``".
uk: Починаючи з Python 3.8, усі функції, пов’язані з копіюванням файлу (:func:`copyfile`, :func:`~shutil.copy`, :func:`copy2`, :func:`copytree` та :func:`move` ) може використовувати специфічні для платформи системні виклики "швидкого копіювання" для більш ефективного копіювання файлу (див. :issue:`33671`). "швидке копіювання" означає, що операція копіювання відбувається всередині ядра, уникаючи використання буферів простору користувача в Python, як у "``outfd.write(infd.read())``".

source: On macOS `fcopyfile`_ is used to copy the file content (not metadata).
uk: У macOS `fcopyfile`_ використовується для копіювання вмісту файлу (а не метаданих).

source: On Linux :func:`os.sendfile` is used.
uk: У Linux використовується :func:`os.sendfile`.

source: On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 64 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used.
uk: У Windows :func:`shutil.copyfile` використовує більший розмір буфера за замовчуванням (1 МіБ замість 64 КіБ) і використовується варіант :func:`memoryview` на основі :func:`shutil.copyfileobj`.

source: If the fast-copy operation fails and no data was written in the destination file then shutil will silently fallback on using less efficient :func:`copyfileobj` function internally.
uk: Якщо операція швидкого копіювання зазнала невдачі і дані не були записані в цільовий файл, програма shutil мовчки повернеться до використання менш ефективної внутрішньої функції :func:`copyfileobj`.

source: copytree example
uk: приклад копіювання

source: An example that uses the :func:`ignore_patterns` helper::
uk: Приклад, який використовує помічник :func:`ignore_patterns`::

source: This will copy everything except ``.pyc`` files and files or directories whose name starts with ``tmp``.
uk: Буде скопійовано все, крім файлів ``.pyc`` і файлів або каталогів, назва яких починається з ``tmp``.

source: Another example that uses the *ignore* argument to add a logging call::
uk: Інший приклад, який використовує аргумент *ignore* для додавання виклику журналювання::

source: rmtree example
uk: приклад rmtree

source: Archiving operations
uk: Архівні операції

source: Added support for the *xztar* format.
uk: Додано підтримку формату *xztar*.

source: High-level utilities to create and read compressed and archived files are also provided. They rely on the :mod:`zipfile` and :mod:`tarfile` modules.
uk: Також надаються утиліти високого рівня для створення та читання стиснених і архівованих файлів. Вони покладаються на модулі :mod:`zipfile` і :mod:`tarfile`.

source: Create an archive file (such as zip or tar) and return its name.
uk: Створіть архівний файл (наприклад, zip або tar) і поверніть його назву.
