Repository: python/python-docs-uk
Catalog: library/signal.po
Languages: uk

source: In the first approach, we read the data out of the fd's buffer, and the byte values give you the signal numbers. This is simple, but in rare cases it can run into a problem: generally the fd will have a limited amount of buffer space, and if too many signals arrive too quickly, then the buffer may become full, and some signals may be lost. If you use this approach, then you should set ``warn_on_full_buffer=True``, which will at least cause a warning to be printed to stderr when signals are lost.
uk: У першому підході ми зчитуємо дані з буфера fd, а значення байтів дають вам номери сигналів. Це просто, але в рідкісних випадках може виникнути проблема: зазвичай fd матиме обмежений обсяг буферного простору, і якщо забагато сигналів надходить надто швидко, буфер може переповнитися, а деякі сигнали можуть бути втрачені. Якщо ви використовуєте цей підхід, то вам слід встановити ``warn_on_full_buffer=True``, що принаймні призведе до друку попередження в stderr у разі втрати сигналів.

source: In the second approach, we use the wakeup fd *only* for wakeups, and ignore the actual byte values. In this case, all we care about is whether the fd's buffer is empty or non-empty; a full buffer doesn't indicate a problem at all. If you use this approach, then you should set ``warn_on_full_buffer=False``, so that your users are not confused by spurious warning messages.
uk: У другому підході ми використовуємо fd пробудження *лише* для пробудження та ігноруємо фактичні значення байтів. У цьому випадку все, що нас хвилює, це чи є буфер fd порожнім чи непорожнім; заповнений буфер взагалі не вказує на проблему. Якщо ви використовуєте цей підхід, вам слід встановити ``warn_on_full_buffer=False``, щоб ваші користувачі не були збентежені фальшивими попередженнями.

source: On Windows, the function now also supports socket handles.
uk: У Windows функція тепер також підтримує ручки сокетів.

source: Added ``warn_on_full_buffer`` parameter.
uk: Додано параметр ``warn_on_full_buffer``.

source: Change system call restart behaviour: if *flag* is :const:`False`, system calls will be restarted when interrupted by signal *signalnum*, otherwise system calls will be interrupted. Returns nothing.
uk: Змінити поведінку перезапуску системного виклику: якщо *flag* має значення :const:`False`, системні виклики буде перезапущено, коли їх перериватиме сигнал *signalnum*, інакше системні виклики буде перервано. Нічого не повертає.

source: Set the handler for signal *signalnum* to the function *handler*. *handler* can be a callable Python object taking two arguments (see below), or one of the special values :const:`signal.SIG_IGN` or :const:`signal.SIG_DFL`. The previous signal handler will be returned (see the description of :func:`getsignal` above). (See the Unix man page :manpage:`signal(2)` for further information.)
uk: Встановіть обробник для сигналу *signalnum* на функцію *handler*. *обробник* може бути викликаним об’єктом Python, який приймає два аргументи (див. нижче) або одне зі спеціальних значень :const:`signal.SIG_IGN` або :const:`signal.SIG_DFL`. Буде повернено попередній обробник сигналу (див. опис :func:`getsignal` вище). (Див. сторінку довідки Unix :manpage:`signal(2)` для отримання додаткової інформації.)

source: The *handler* is called with two arguments: the signal number and the current stack frame (``None`` or a frame object; for a description of frame objects, see the :ref:`description in the type hierarchy <frame-objects>` or see the attribute descriptions in the :mod:`inspect` module).
uk: *Обробник* викликається з двома аргументами: номером сигналу та поточним фреймом стека (``None`` або об’єкт фрейму; для опису об’єктів фрейму див. :ref:`опис в ієрархії типів <frame-objects>` або див. описи атрибутів у модулі :mod:`inspect`).

source: On Windows, :func:`signal` can only be called with :const:`SIGABRT`, :const:`SIGFPE`, :const:`SIGILL`, :const:`SIGINT`, :const:`SIGSEGV`, :const:`SIGTERM`, or :const:`SIGBREAK`. A :exc:`ValueError` will be raised in any other case. Note that not all systems define the same set of signal names; an :exc:`AttributeError` will be raised if a signal name is not defined as ``SIG*`` module level constant.
uk: У Windows :func:`signal` можна викликати лише за допомогою :const:`SIGABRT`, :const:`SIGFPE`, :const:`SIGILL`, :const:`SIGINT`, :const:`SIGSEGV`, :const:`SIGTERM` або :const:`SIGBREAK`. Помилка :exc:`ValueError` буде викликана в будь-якому іншому випадку. Зауважте, що не всі системи визначають однаковий набір назв сигналів; :exc:`AttributeError` буде викликано, якщо назва сигналу не визначена як константа рівня модуля ``SIG*``.

source: Examine the set of signals that are pending for delivery to the calling thread (i.e., the signals which have been raised while blocked). Return the set of the pending signals.
uk: Перевірте набір сигналів, які очікують на доставку до викликаючого потоку (тобто сигнали, які були підняті під час блокування). Повертає набір незавершених сигналів.

source: See also :func:`pause`, :func:`pthread_sigmask` and :func:`sigwait`.
uk: Дивіться також :func:`pause`, :func:`pthread_sigmask` і :func:`sigwait`.

source: Suspend execution of the calling thread until the delivery of one of the signals specified in the signal set *sigset*. The function accepts the signal (removes it from the pending list of signals), and returns the signal number.
uk: Призупинити виконання викликаючого потоку до доставки одного із сигналів, указаних у наборі сигналів *sigset*. Функція приймає сигнал (видаляє його зі списку очікуваних сигналів) і повертає номер сигналу.

source: See also :func:`pause`, :func:`pthread_sigmask`, :func:`sigpending`, :func:`sigwaitinfo` and :func:`sigtimedwait`.
uk: Дивіться також :func:`pause`, :func:`pthread_sigmask`, :func:`sigpending`, :func:`sigwaitinfo` і :func:`sigtimedwait`.

source: Suspend execution of the calling thread until the delivery of one of the signals specified in the signal set *sigset*. The function accepts the signal and removes it from the pending list of signals. If one of the signals in *sigset* is already pending for the calling thread, the function will return immediately with information about that signal. The signal handler is not called for the delivered signal. The function raises an :exc:`InterruptedError` if it is interrupted by a signal that is not in *sigset*.
uk: Призупинити виконання викликаючого потоку до доставки одного із сигналів, указаних у наборі сигналів *sigset*. Функція приймає сигнал і видаляє його зі списку очікуваних сигналів. Якщо один із сигналів у *sigset* вже очікує на виклик потоку, функція негайно повернеться з інформацією про цей сигнал. Обробник сигналу не викликається для надісланого сигналу. Функція викликає :exc:`InterruptedError`, якщо її перериває сигнал, якого немає в *sigset*.

source: The return value is an object representing the data contained in the :c:type:`siginfo_t` structure, namely: :attr:`si_signo`, :attr:`si_code`, :attr:`si_errno`, :attr:`si_pid`, :attr:`si_uid`, :attr:`si_status`, :attr:`si_band`.
uk: Повернене значення — це об’єкт, який представляє дані, що містяться в структурі :c:type:`siginfo_t`, а саме: :attr:`si_signo`, :attr:`si_code`, :attr:`si_errno`, :attr:`si_pid`, :attr:`si_uid`, :attr:`si_status`, :attr:`si_band`.

source: See also :func:`pause`, :func:`sigwait` and :func:`sigtimedwait`.
uk: Дивіться також :func:`pause`, :func:`sigwait` і :func:`sigtimedwait`.

source: The function is now retried if interrupted by a signal not in *sigset* and the signal handler does not raise an exception (see :pep:`475` for the rationale).
uk: Тепер функція виконується повторно, якщо її перериває сигнал не в *sigset*, і обробник сигналу не викликає винятку (див. :pep:`475` для обґрунтування).

source: See also :func:`pause`, :func:`sigwait` and :func:`sigwaitinfo`.
uk: Дивіться також :func:`pause`, :func:`sigwait` і :func:`sigwaitinfo`.

source: The function is now retried with the recomputed *timeout* if interrupted by a signal not in *sigset* and the signal handler does not raise an exception (see :pep:`475` for the rationale).
uk: Тепер функція виконується повторно з повторно обчисленим *тайм-аутом*, якщо її перериває сигнал не в *sigset*, і обробник сигналу не викликає виняткової ситуації (див. :pep:`475` для обґрунтування).

source: Examples
uk: Приклади

source: Here is a minimal example program. It uses the :func:`alarm` function to limit the time spent waiting to open a file; this is useful if the file is for a serial device that may not be turned on, which would normally cause the :func:`os.open` to hang indefinitely. The solution is to set a 5-second alarm before opening the file; if the operation takes too long, the alarm signal will be sent, and the handler raises an exception. ::
uk: Ось мінімальний приклад програми. Він використовує функцію :func:`alarm` для обмеження часу очікування відкриття файлу; це корисно, якщо файл призначений для послідовного пристрою, який може бути не ввімкнено, що зазвичай призведе до зависання :func:`os.open` на невизначений час. Рішення полягає в тому, щоб встановити 5-секундний будильник перед відкриттям файлу; якщо операція триває надто довго, буде надіслано сигнал тривоги, і обробник викличе виняток. ::

source: Note on SIGPIPE
uk: Примітка щодо SIGPIPE

source: Piping output of your program to tools like :manpage:`head(1)` will cause a :const:`SIGPIPE` signal to be sent to your process when the receiver of its standard output closes early. This results in an exception like :code:`BrokenPipeError: [Errno 32] Broken pipe`. To handle this case, wrap your entry point to catch this exception as follows::
uk: Передача виводу вашої програми до таких інструментів, як :manpage:`head(1)`, призведе до надсилання сигналу :const:`SIGPIPE` до вашого процесу, коли отримувач його стандартного виводу закривається раніше. Це призводить до виключення на зразок :code:`BrokenPipeError: [Errno 32] Broken pipe`. Щоб впоратися з цим випадком, оберніть свою точку входу, щоб перехопити цю виняток, наступним чином:

source: Do not set :const:`SIGPIPE`'s disposition to :const:`SIG_DFL` in order to avoid :exc:`BrokenPipeError`. Doing that would cause your program to exit unexpectedly whenever any socket connection is interrupted while your program is still writing to it.
uk: Не встановлюйте розташування :const:`SIGPIPE` як :const:`SIG_DFL`, щоб уникнути :exc:`BrokenPipeError`. Це спричинило б несподіваний вихід вашої програми щоразу, коли будь-яке з’єднання з сокетом переривається, поки ваша програма все ще записує в нього.

source: Note on Signal Handlers and Exceptions
uk: Примітка щодо обробників сигналів і винятків

source: If a signal handler raises an exception, the exception will be propagated to the main thread and may be raised after any :term:`bytecode` instruction. Most notably, a :exc:`KeyboardInterrupt` may appear at any point during execution. Most Python code, including the standard library, cannot be made robust against this, and so a :exc:`KeyboardInterrupt` (or any other exception resulting from a signal handler) may on rare occasions put the program in an unexpected state.
uk: Якщо обробник сигналу викликає виняток, виняток буде передано в основний потік і може бути викликано після будь-якої інструкції :term:`bytecode`. Зокрема, :exc:`KeyboardInterrupt` може з’явитися в будь-який момент під час виконання. Більшість коду Python, включаючи стандартну бібліотеку, не можна зробити стійкими до цього, і тому :exc:`KeyboardInterrupt` (або будь-який інший виняток, що є результатом обробки сигналу) може в рідкісних випадках переводити програму в неочікуваний стан.

source: To illustrate this issue, consider the following code::
uk: Щоб проілюструвати цю проблему, розглянемо такий код:

source: For many programs, especially those that merely want to exit on :exc:`KeyboardInterrupt`, this is not a problem, but applications that are complex or require high reliability should avoid raising exceptions from signal handlers. They should also avoid catching :exc:`KeyboardInterrupt` as a means of gracefully shutting down. Instead, they should install their own :const:`SIGINT` handler. Below is an example of an HTTP server that avoids :exc:`KeyboardInterrupt`::
uk: Для багатьох програм, особливо тих, які просто хочуть завершити роботу після :exc:`KeyboardInterrupt`, це не є проблемою, але програми, які є складними або потребують високої надійності, повинні уникати виклику винятків від обробників сигналів. Вони також повинні уникати перехоплення :exc:`KeyboardInterrupt` як засобу плавного завершення роботи. Натомість вони повинні встановити власний обробник :const:`SIGINT`. Нижче наведено приклад HTTP-сервера, який уникає :exc:`KeyboardInterrupt`::
