Repository: python/python-docs-uk
Catalog: library/smtpd.po
Languages: uk

source: :mod:`smtpd` --- SMTP Server
uk: :mod:`smtpd` --- Сервер SMTP

source: **Source code:** :source:`Lib/smtpd.py`
uk: **Вихідний код:** :source:`Lib/smtpd.py`

source: This module offers several classes to implement SMTP (email) servers.
uk: Цей модуль пропонує кілька класів для реалізації серверів SMTP (електронної пошти).

source: :mod:`smtpd` will be removed in Python 3.12 (see :pep:`PEP 594 <594#smtpd>` for details). The `aiosmtpd <https://aiosmtpd.readthedocs.io/>`_ package is a recommended replacement for this module. It is based on :mod:`asyncio` and provides a more straightforward API.
uk: :mod:`smtpd` буде видалено в Python 3.12 (див. :pep:`PEP 594 <594#smtpd>` для отримання додаткової інформації). Пакет `aiosmtpd <https://aiosmtpd.readthedocs.io/>`_ є рекомендованою заміною для цього модуля. Він заснований на :mod:`asyncio` і забезпечує більш простий API.

source: Several server implementations are present; one is a generic do-nothing implementation, which can be overridden, while the other two offer specific mail-sending strategies.
uk: Присутні кілька реалізацій сервера; один — це загальна реалізація нічого не робити, яку можна перевизначити, тоді як інші два пропонують спеціальні стратегії надсилання пошти.

source: Additionally the SMTPChannel may be extended to implement very specific interaction behaviour with SMTP clients.
uk: Крім того, SMTPChannel можна розширити, щоб реалізувати дуже специфічну поведінку взаємодії з клієнтами SMTP.

source: The code supports :RFC:`5321`, plus the :rfc:`1870` SIZE and :rfc:`6531` SMTPUTF8 extensions.
uk: Код підтримує :RFC:`5321`, а також розширення :rfc:`1870` SIZE і :rfc:`6531` SMTPUTF8.

source: SMTPServer Objects
uk: Об'єкти SMTPServer

source: Create a new :class:`SMTPServer` object, which binds to local address *localaddr*. It will treat *remoteaddr* as an upstream SMTP relayer. Both *localaddr* and *remoteaddr* should be a :ref:`(host, port) <host_port>` tuple. The object inherits from :class:`asyncore.dispatcher`, and so will insert itself into :mod:`asyncore`'s event loop on instantiation.
uk: Створіть новий об’єкт :class:`SMTPServer`, який прив’язується до локальної адреси *localaddr*. Він розглядатиме *remoteaddr* як вихідний ретранслятор SMTP. І *localaddr*, і *remoteaddr* мають бути кортежем :ref:`(хост, порт) <host_port>`. Об’єкт успадковується від :class:`asyncore.dispatcher`, тому вставлятиметься в цикл подій :mod:`asyncore` під час створення екземпляра.

source: *data_size_limit* specifies the maximum number of bytes that will be accepted in a ``DATA`` command. A value of ``None`` or ``0`` means no limit.
uk: *data_size_limit* вказує максимальну кількість байтів, яка буде прийнята в команді ``DATA``. Значення "Немає" або "0" означає відсутність обмежень.

source: *map* is the socket map to use for connections (an initially empty dictionary is a suitable value). If not specified the :mod:`asyncore` global socket map is used.
uk: *map* — це карта сокетів, яка використовується для підключення (спочатку порожній словник є відповідним значенням). Якщо не вказано, використовується глобальна карта сокетів :mod:`asyncore`.

source: *enable_SMTPUTF8* determines whether the ``SMTPUTF8`` extension (as defined in :RFC:`6531`) should be enabled. The default is ``False``. When ``True``, ``SMTPUTF8`` is accepted as a parameter to the ``MAIL`` command and when present is passed to :meth:`process_message` in the ``kwargs['mail_options']`` list. *decode_data* and *enable_SMTPUTF8* cannot be set to ``True`` at the same time.
uk: *enable_SMTPUTF8* визначає, чи слід увімкнути розширення ``SMTPUTF8`` (як визначено в :RFC:`6531`). Типовим значенням є ``False``. Якщо ``True``, ``SMTPUTF8`` приймається як параметр команди ``MAIL``, а якщо присутній, передається до :meth:`process_message` у списку ``kwargs['mail_options']`` . *decode_data* і *enable_SMTPUTF8* не можуть бути встановлені на ``True`` одночасно.

source: *decode_data* specifies whether the data portion of the SMTP transaction should be decoded using UTF-8. When *decode_data* is ``False`` (the default), the server advertises the ``8BITMIME`` extension (:rfc:`6152`), accepts the ``BODY=8BITMIME`` parameter to the ``MAIL`` command, and when present passes it to :meth:`process_message` in the ``kwargs['mail_options']`` list. *decode_data* and *enable_SMTPUTF8* cannot be set to ``True`` at the same time.
uk: *decode_data* вказує, чи слід декодувати частину даних транзакції SMTP за допомогою UTF-8. Коли *decode_data* має значення ``False`` (за замовчуванням), сервер повідомляє про розширення ``8BITMIME`` (:rfc:`6152`), приймає параметр ``BODY=8BITMIME`` до ``MAIL`` і за наявності передає її до :meth:`process_message` у списку ``kwargs['mail_options']``. *decode_data* і *enable_SMTPUTF8* не можуть бути встановлені на ``True`` одночасно.

source: Raise a :exc:`NotImplementedError` exception. Override this in subclasses to do something useful with this message. Whatever was passed in the constructor as *remoteaddr* will be available as the :attr:`_remoteaddr` attribute. *peer* is the remote host's address, *mailfrom* is the envelope originator, *rcpttos* are the envelope recipients and *data* is a string containing the contents of the e-mail (which should be in :rfc:`5321` format).
uk: Викликати виняток :exc:`NotImplementedError`. Перевизначте це в підкласах, щоб зробити щось корисне з цим повідомленням. Все, що було передано в конструктор як *remoteaddr*, буде доступним як атрибут :attr:`_remoteaddr`. *peer* — це адреса віддаленого хоста, *mailfrom* — джерело конверта, *rcpttos* — одержувачі конверта, а *data* — це рядок, що містить вміст електронного листа (який має бути в :rfc:`5321` формат).

source: If the *decode_data* constructor keyword is set to ``True``, the *data* argument will be a unicode string. If it is set to ``False``, it will be a bytes object.
uk: Якщо ключове слово конструктора *decode_data* має значення ``True``, аргумент *data* буде рядком Юнікод. Якщо для нього встановлено значення ``False``, це буде об’єкт bytes.

source: *kwargs* is a dictionary containing additional information. It is empty if ``decode_data=True`` was given as an init argument, otherwise it contains the following keys:
uk: *kwargs* — словник, що містить додаткову інформацію. Він порожній, якщо ``decode_data=True`` було задано як аргумент ініціалізації, інакше він містить такі ключі:

source: a list of all received parameters to the ``MAIL`` command (the elements are uppercase strings; example: ``['BODY=8BITMIME', 'SMTPUTF8']``).
uk: список усіх отриманих параметрів команди ``MAIL`` (елементи є рядками у верхньому регістрі; приклад: ``['BODY=8BITMIME', 'SMTPUTF8']``).

source: same as *mail_options* but for the ``RCPT`` command. Currently no ``RCPT TO`` options are supported, so for now this will always be an empty list.
uk: те саме, що *mail_options*, але для команди ``RCPT``. Наразі параметри ``RCPT TO`` не підтримуються, тому наразі це завжди буде порожній список.

source: Implementations of ``process_message`` should use the ``**kwargs`` signature to accept arbitrary keyword arguments, since future feature enhancements may add keys to the kwargs dictionary.
uk: Реалізації ``process_message`` мають використовувати підпис ``**kwargs`` для прийняття довільних аргументів ключових слів, оскільки майбутні покращення функцій можуть додавати ключі до словника kwargs.

source: Return ``None`` to request a normal ``250 Ok`` response; otherwise return the desired response string in :RFC:`5321` format.
uk: Поверніть ``None`` для запиту нормальної відповіді ``250 Ok``; інакше поверніть потрібний рядок відповіді у форматі :RFC:`5321`.

source: Override this in subclasses to use a custom :class:`SMTPChannel` for managing SMTP clients.
uk: Перевизначте це в підкласах, щоб використовувати спеціальний :class:`SMTPChannel` для керування клієнтами SMTP.

source: The *map* constructor argument.
uk: Аргумент конструктора *map*.

source: *localaddr* and *remoteaddr* may now contain IPv6 addresses.
uk: *localaddr* і *remoteaddr* тепер можуть містити адреси IPv6.

source: The *decode_data* and *enable_SMTPUTF8* constructor parameters, and the *kwargs* parameter to :meth:`process_message` when *decode_data* is ``False``.
uk: Параметри конструктора *decode_data* і *enable_SMTPUTF8*, а також параметр *kwargs* для :meth:`process_message`, коли *decode_data* має значення ``False``.

source: *decode_data* is now ``False`` by default.
uk: *decode_data* тепер має значення ``False`` за замовчуванням.

source: DebuggingServer Objects
uk: Об'єкти DebuggingServer

source: Create a new debugging server. Arguments are as per :class:`SMTPServer`. Messages will be discarded, and printed on stdout.
uk: Створіть новий сервер налагодження. Аргументи відповідають :class:`SMTPServer`. Повідомлення буде видалено та надруковано на стандартному виводі.

source: PureProxy Objects
uk: Об’єкти PureProxy

source: Create a new pure proxy server. Arguments are as per :class:`SMTPServer`. Everything will be relayed to *remoteaddr*. Note that running this has a good chance to make you into an open relay, so please be careful.
uk: Створіть новий чистий проксі-сервер. Аргументи відповідають :class:`SMTPServer`. Усе буде передано на *remoteaddr*. Зауважте, що це має хороші шанси зробити вас відкритим реле, тому будьте обережні.

source: MailmanProxy Objects
uk: Об'єкти MailmanProxy

source: SMTPChannel Objects
uk: Об’єкти SMTPChannel

source: Create a new :class:`SMTPChannel` object which manages the communication between the server and a single SMTP client.
uk: Створіть новий об’єкт :class:`SMTPChannel`, який керуватиме зв’язком між сервером і одним клієнтом SMTP.

source: *conn* and *addr* are as per the instance variables described below.
uk: *conn* і *addr* відповідають змінним екземпляра, описаним нижче.

source: *enable_SMTPUTF8* determines whether the ``SMTPUTF8`` extension (as defined in :RFC:`6531`) should be enabled. The default is ``False``. *decode_data* and *enable_SMTPUTF8* cannot be set to ``True`` at the same time.
uk: *enable_SMTPUTF8* визначає, чи слід увімкнути розширення ``SMTPUTF8`` (як визначено в :RFC:`6531`). Типовим значенням є ``False``. *decode_data* і *enable_SMTPUTF8* не можуть бути встановлені на ``True`` одночасно.

source: A dictionary can be specified in *map* to avoid using a global socket map.
uk: Словник можна вказати в *map*, щоб уникнути використання глобальної карти сокетів.

source: *decode_data* specifies whether the data portion of the SMTP transaction should be decoded using UTF-8. The default is ``False``. *decode_data* and *enable_SMTPUTF8* cannot be set to ``True`` at the same time.
uk: *decode_data* вказує, чи слід декодувати частину даних транзакції SMTP за допомогою UTF-8. Типовим значенням є ``False``. *decode_data* і *enable_SMTPUTF8* не можуть бути встановлені на ``True`` одночасно.

source: To use a custom SMTPChannel implementation you need to override the :attr:`SMTPServer.channel_class` of your :class:`SMTPServer`.
uk: Щоб використовувати спеціальну реалізацію SMTPChannel, вам потрібно перевизначити :attr:`SMTPServer.channel_class` вашого :class:`SMTPServer`.

source: The *decode_data* and *enable_SMTPUTF8* parameters were added.
uk: Додано параметри *decode_data* і *enable_SMTPUTF8*.

source: The :class:`SMTPChannel` has the following instance variables:
uk: :class:`SMTPChannel` має такі змінні екземпляра:

source: Holds the :class:`SMTPServer` that spawned this channel.
uk: Містить :class:`SMTPServer`, який породив цей канал.

source: Holds the socket object connecting to the client.
uk: Зберігає об'єкт сокета, який підключається до клієнта.

source: Holds the address of the client, the second value returned by :func:`socket.accept <socket.socket.accept>`
uk: Містить адресу клієнта, друге значення повертає :func:`socket.accept <socket.socket.accept>`

source: Holds a list of the line strings (decoded using UTF-8) received from the client. The lines have their ``"\r\n"`` line ending translated to ``"\n"``.
uk: Містить список рядків (декодованих за допомогою UTF-8), отриманих від клієнта. Закінчення рядків ``"\r\n"`` перекладено на ``"\n"``.

source: Holds the current state of the channel. This will be either :attr:`COMMAND` initially and then :attr:`DATA` after the client sends a "DATA" line.
uk: Зберігає поточний стан каналу. Спочатку це буде :attr:`COMMAND`, а потім :attr:`DATA` після того, як клієнт надішле рядок "DATA".

source: Holds a string containing the greeting sent by the client in its "HELO".
uk: Містить рядок, що містить привітання, надіслане клієнтом, у своєму "HELO".

source: Holds a string containing the address identified in the "MAIL FROM:" line from the client.
uk: Містить рядок, що містить адресу, визначену в рядку "MAIL FROM:" від клієнта.

source: Holds a list of strings containing the addresses identified in the "RCPT TO:" lines from the client.
uk: Містить список рядків, що містять адреси, визначені клієнтом у рядках "RCPT TO:".

source: Holds a string containing all of the data sent by the client during the DATA state, up to but not including the terminating ``"\r\n.\r\n"``.
uk: Містить рядок, що містить усі дані, надіслані клієнтом під час стану DATA, окрім кінцевого ``"\r\n.\r\n"``.

source: Holds the fully-qualified domain name of the server as returned by :func:`socket.getfqdn`.
uk: Містить повне доменне ім’я сервера, яке повертає :func:`socket.getfqdn`.

source: Holds the name of the client peer as returned by ``conn.getpeername()`` where ``conn`` is :attr:`conn`.
uk: Зберігає ім’я однорангового клієнта, яке повертає ``conn.getpeername()``, де ``conn`` є :attr:`conn`.

source: The :class:`SMTPChannel` operates by invoking methods named ``smtp_<command>`` upon reception of a command line from the client. Built into the base :class:`SMTPChannel` class are methods for handling the following commands (and responding to them appropriately):
uk: :class:`SMTPChannel` працює, викликаючи методи з назвою ``smtp_<command>`` після отримання командного рядка від клієнта. У базовий клас :class:`SMTPChannel` вбудовано методи обробки наступних команд (і відповідної відповіді на них):

source: Command
uk: Команда

source: Action taken
uk: Дії прийняті

source: HELO
uk: ПРИВІТ

source: Accepts the greeting from the client and stores it in :attr:`seen_greeting`. Sets server to base command mode.
uk: Приймає привітання від клієнта та зберігає його в :attr:`seen_greeting`. Перемикає сервер у базовий командний режим.

source: Accepts the greeting from the client and stores it in :attr:`seen_greeting`. Sets server to extended command mode.
uk: Приймає привітання від клієнта та зберігає його в :attr:`seen_greeting`. Встановлює сервер у режим розширених команд.

source: Takes no action.
uk: Не вживає жодних заходів.

source: QUIT
uk: ВИЙТИ

source: Closes the connection cleanly.
uk: Чисто закриває з'єднання.

source: MAIL
uk: ПОШТА

source: Accepts the "MAIL FROM:" syntax and stores the supplied address as :attr:`mailfrom`. In extended command mode, accepts the :rfc:`1870` SIZE attribute and responds appropriately based on the value of *data_size_limit*.
uk: Приймає синтаксис "MAIL FROM:" і зберігає надану адресу як :attr:`mailfrom`. У розширеному командному режимі приймає атрибут :rfc:`1870` SIZE і відповідає належним чином на основі значення *data_size_limit*.

source: Accepts the "RCPT TO:" syntax and stores the supplied addresses in the :attr:`rcpttos` list.
uk: Приймає синтаксис "RCPT TO:" і зберігає надані адреси в списку :attr:`rcpttos`.

source: RSET
uk: RESET

source: Resets the :attr:`mailfrom`, :attr:`rcpttos`, and :attr:`received_data`, but not the greeting.
uk: Скидає :attr:`mailfrom`, :attr:`rcpttos` і :attr:`received_data`, але не привітання.

source: DATA
uk: ДАНІ

source: Sets the internal state to :attr:`DATA` and stores remaining lines from the client in :attr:`received_data` until the terminator ``"\r\n.\r\n"`` is received.
uk: Встановлює внутрішній стан на :attr:`DATA` і зберігає решту рядків від клієнта в :attr:`received_data`, доки не буде отримано термінатор ``"\r\n.\r\n"``.

source: HELP
uk: ДОПОМОГА

source: Returns minimal information on command syntax
uk: Повертає мінімальну інформацію про синтаксис команди

source: Returns code 252 (the server doesn't know if the address is valid)
uk: Повертає код 252 (сервер не знає, чи адреса дійсна)

source: Reports that the command is not implemented.
uk: Повідомляє, що команда не реалізована.
