Repository: python/python-docs-uk
Catalog: library/socketserver.po
Languages: uk

source: **Source code:** :source:`Lib/socketserver.py`
uk: **Вихідний код:** :source:`Lib/socketserver.py`

source: The :mod:`socketserver` module simplifies the task of writing network servers.
uk: Модуль :mod:`socketserver` спрощує завдання написання мережевих серверів.

source: There are four basic concrete server classes:
uk: Існує чотири основних класи конкретних серверів:

source: This uses the internet TCP protocol, which provides for continuous streams of data between the client and server. If *bind_and_activate* is true, the constructor automatically attempts to invoke :meth:`~BaseServer.server_bind` and :meth:`~BaseServer.server_activate`. The other parameters are passed to the :class:`BaseServer` base class.
uk: Для цього використовується інтернет-протокол TCP, який забезпечує безперервні потоки даних між клієнтом і сервером. Якщо *bind_and_activate* має значення true, конструктор автоматично намагається викликати :meth:`~BaseServer.server_bind` і :meth:`~BaseServer.server_activate`. Інші параметри передаються до базового класу :class:`BaseServer`.

source: This uses datagrams, which are discrete packets of information that may arrive out of order or be lost while in transit. The parameters are the same as for :class:`TCPServer`.
uk: Для цього використовуються дейтаграми, які є окремими пакетами інформації, які можуть надійти не в порядку або бути втраченими під час передачі. Параметри такі самі, як і для :class:`TCPServer`.

source: These more infrequently used classes are similar to the TCP and UDP classes, but use Unix domain sockets; they're not available on non-Unix platforms. The parameters are the same as for :class:`TCPServer`.
uk: Ці менш часто використовувані класи подібні до класів TCP і UDP, але використовують доменні сокети Unix; вони недоступні на платформах, відмінних від Unix. Параметри такі самі, як і для :class:`TCPServer`.

source: These four classes process requests :dfn:`synchronously`; each request must be completed before the next request can be started. This isn't suitable if each request takes a long time to complete, because it requires a lot of computation, or because it returns a lot of data which the client is slow to process. The solution is to create a separate process or thread to handle each request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` mix-in classes can be used to support asynchronous behaviour.
uk: Ці чотири класи обробляють запити :dfn:`synchronously`; кожен запит має бути виконано перед початком наступного запиту. Це не підходить, якщо виконання кожного запиту займає багато часу, тому що він вимагає багато обчислень або тому, що він повертає багато даних, які клієнт повільно обробляє. Рішення полягає у створенні окремого процесу або потоку для обробки кожного запиту; змішані класи :class:`ForkingMixIn` і :class:`ThreadingMixIn` можна використовувати для підтримки асинхронної поведінки.

source: Creating a server requires several steps. First, you must create a request handler class by subclassing the :class:`BaseRequestHandler` class and overriding its :meth:`~BaseRequestHandler.handle` method; this method will process incoming requests. Second, you must instantiate one of the server classes, passing it the server's address and the request handler class. It is recommended to use the server in a :keyword:`with` statement. Then call the :meth:`~BaseServer.handle_request` or :meth:`~BaseServer.serve_forever` method of the server object to process one or many requests. Finally, call :meth:`~BaseServer.server_close` to close the socket (unless you used a :keyword:`!with` statement).
uk: Створення сервера вимагає кількох кроків. По-перше, ви повинні створити клас обробника запитів, створивши підклас класу :class:`BaseRequestHandler` і перевизначивши його метод :meth:`~BaseRequestHandler.handle`; цей метод оброблятиме вхідні запити. По-друге, ви повинні створити екземпляр одного з класів сервера, передавши йому адресу сервера та клас обробника запитів. Рекомендовано використовувати сервер у операторі :keyword:`with`. Потім викличте метод :meth:`~BaseServer.handle_request` або :meth:`~BaseServer.serve_forever` об’єкта сервера для обробки одного або кількох запитів. Нарешті, викличте :meth:`~BaseServer.server_close`, щоб закрити сокет (якщо ви не використали оператор :keyword:`!with`).

source: When inheriting from :class:`ThreadingMixIn` for threaded connection behavior, you should explicitly declare how you want your threads to behave on an abrupt shutdown. The :class:`ThreadingMixIn` class defines an attribute *daemon_threads*, which indicates whether or not the server should wait for thread termination. You should set the flag explicitly if you would like threads to behave autonomously; the default is :const:`False`, meaning that Python will not exit until all threads created by :class:`ThreadingMixIn` have exited.
uk: Успадковуючи від :class:`ThreadingMixIn` поведінку потокового з’єднання, ви повинні явно оголосити, як ви хочете, щоб ваші потоки поводилися під час раптового завершення роботи. Клас :class:`ThreadingMixIn` визначає атрибут *daemon_threads*, який вказує, чи повинен сервер чекати завершення потоку. Ви повинні встановити прапорець явно, якщо ви хочете, щоб потоки поводилися автономно; за замовчуванням :const:`False`, що означає, що Python не завершить роботу, доки не завершаться всі потоки, створені :class:`ThreadingMixIn`.

source: Server classes have the same external methods and attributes, no matter what network protocol they use.
uk: Класи серверів мають однакові зовнішні методи та атрибути, незалежно від того, який мережевий протокол вони використовують.

source: Server Creation Notes
uk: Примітки щодо створення сервера

source: There are five classes in an inheritance diagram, four of which represent synchronous servers of four types::
uk: У діаграмі успадкування є п’ять класів, чотири з яких представляють синхронні сервери чотирьох типів:

source: Forking and threading versions of each type of server can be created using these mix-in classes. For instance, :class:`ThreadingUDPServer` is created as follows::
uk: Розгалуження та версії потоків кожного типу сервера можна створити за допомогою цих змішаних класів. Наприклад, :class:`ThreadingUDPServer` створюється таким чином:

source: The mix-in class comes first, since it overrides a method defined in :class:`UDPServer`. Setting the various attributes also changes the behavior of the underlying server mechanism.
uk: Клас mix-in стоїть на першому місці, оскільки він замінює метод, визначений у :class:`UDPServer`. Налаштування різних атрибутів також змінює поведінку базового серверного механізму.

source: :class:`ForkingMixIn` and the Forking classes mentioned below are only available on POSIX platforms that support :func:`~os.fork`.
uk: :class:`ForkingMixIn` і згадані нижче класи Forking доступні лише на платформах POSIX, які підтримують :func:`~os.fork`.

source: These classes are pre-defined using the mix-in classes.
uk: Ці класи попередньо визначені за допомогою змішаних класів.

source: To implement a service, you must derive a class from :class:`BaseRequestHandler` and redefine its :meth:`~BaseRequestHandler.handle` method. You can then run various versions of the service by combining one of the server classes with your request handler class. The request handler class must be different for datagram or stream services. This can be hidden by using the handler subclasses :class:`StreamRequestHandler` or :class:`DatagramRequestHandler`.
uk: Щоб реалізувати службу, ви повинні отримати клас від :class:`BaseRequestHandler` і перевизначити його метод :meth:`~BaseRequestHandler.handle`. Потім ви можете запустити різні версії служби, поєднавши один із класів сервера з класом обробника запитів. Клас обробника запитів має відрізнятися для датаграм або потокових служб. Це можна приховати за допомогою підкласів обробників :class:`StreamRequestHandler` або :class:`DatagramRequestHandler`.

source: Of course, you still have to use your head! For instance, it makes no sense to use a forking server if the service contains state in memory that can be modified by different requests, since the modifications in the child process would never reach the initial state kept in the parent process and passed to each child. In this case, you can use a threading server, but you will probably have to use locks to protect the integrity of the shared data.
uk: Звичайно, вам все одно доведеться використовувати свою голову! Наприклад, немає сенсу використовувати сервер розгалуження, якщо служба містить стан у пам’яті, який можна змінювати різними запитами, оскільки зміни в дочірньому процесі ніколи не досягнуть початкового стану, який зберігається в батьківському процесі та передається кожному дочірньому. . У цьому випадку ви можете використовувати потоковий сервер, але вам, ймовірно, доведеться використовувати блокування для захисту цілісності спільних даних.

source: On the other hand, if you are building an HTTP server where all data is stored externally (for instance, in the file system), a synchronous class will essentially render the service "deaf" while one request is being handled -- which may be for a very long time if a client is slow to receive all the data it has requested. Here a threading or forking server is appropriate.
uk: З іншого боку, якщо ви створюєте HTTP-сервер, де всі дані зберігаються зовні (наприклад, у файловій системі), синхронний клас, по суті, надаватиме послугу "глухою", поки обробляється один запит, що може бути дуже довго, якщо клієнт повільно отримує всі запитувані дані. Тут підійде сервер потоків або розгалуження.

source: In some cases, it may be appropriate to process part of a request synchronously, but to finish processing in a forked child depending on the request data. This can be implemented by using a synchronous server and doing an explicit fork in the request handler class :meth:`~BaseRequestHandler.handle` method.
uk: У деяких випадках може бути доречним обробити частину запиту синхронно, але завершити обробку в розгалуженому дочірньому файлі залежно від даних запиту. Це можна реалізувати за допомогою синхронного сервера та виконання явного розгалуження в методі класу обробника запитів :meth:`~BaseRequestHandler.handle`.

source: Server Objects
uk: Серверні об’єкти

source: This is the superclass of all Server objects in the module. It defines the interface, given below, but does not implement most of the methods, which is done in subclasses. The two parameters are stored in the respective :attr:`server_address` and :attr:`RequestHandlerClass` attributes.
uk: Це суперклас усіх об’єктів сервера в модулі. Він визначає інтерфейс, наведений нижче, але не реалізує більшість методів, що робиться в підкласах. Два параметри зберігаються у відповідних атрибутах :attr:`server_address` і :attr:`RequestHandlerClass`.

source: Return an integer file descriptor for the socket on which the server is listening. This function is most commonly passed to :mod:`selectors`, to allow monitoring multiple servers in the same process.
uk: Повертає цілочисельний файловий дескриптор для сокета, який прослуховує сервер. Ця функція найчастіше передається :mod:`selectors`, щоб дозволити моніторинг кількох серверів в одному процесі.

source: Process a single request. This function calls the following methods in order: :meth:`get_request`, :meth:`verify_request`, and :meth:`process_request`. If the user-provided :meth:`~BaseRequestHandler.handle` method of the handler class raises an exception, the server's :meth:`handle_error` method will be called. If no request is received within :attr:`timeout` seconds, :meth:`handle_timeout` will be called and :meth:`handle_request` will return.
uk: Обробити один запит. Ця функція викликає наступні методи в порядку: :meth:`get_request`, :meth:`verify_request` і :meth:`process_request`. Якщо наданий користувачем метод :meth:`~BaseRequestHandler.handle` класу обробника викликає виняток, буде викликано метод :meth:`handle_error` сервера. Якщо протягом :attr:`timeout` секунд не буде отримано жодного запиту, буде викликано :meth:`handle_timeout` і :meth:`handle_request` повернеться.

source: Handle requests until an explicit :meth:`shutdown` request. Poll for shutdown every *poll_interval* seconds. Ignores the :attr:`timeout` attribute. It also calls :meth:`service_actions`, which may be used by a subclass or mixin to provide actions specific to a given service. For example, the :class:`ForkingMixIn` class uses :meth:`service_actions` to clean up zombie child processes.
uk: Обробляти запити до явного запиту :meth:`shutdown`. Опитування для вимкнення кожні *poll_interval* секунди. Ігнорує атрибут :attr:`timeout`. Він також викликає :meth:`service_actions`, який може використовуватися підкласом або міксином для виконання дій, специфічних для певної служби. Наприклад, клас :class:`ForkingMixIn` використовує :meth:`service_actions` для очищення дочірніх процесів-зомбі.

source: Added ``service_actions`` call to the ``serve_forever`` method.
uk: Додано виклик ``service_actions`` до методу ``serve_forever``.

source: This is called in the :meth:`serve_forever` loop. This method can be overridden by subclasses or mixin classes to perform actions specific to a given service, such as cleanup actions.
uk: Це викликається в циклі :meth:`serve_forever`. Цей метод може бути перевизначений підкласами або класами mixin для виконання дій, специфічних для певної служби, наприклад дій очищення.

source: Tell the :meth:`serve_forever` loop to stop and wait until it does. :meth:`shutdown` must be called while :meth:`serve_forever` is running in a different thread otherwise it will deadlock.
uk: Скажіть циклу :meth:`serve_forever` зупинитися та зачекайте, доки він зупиниться. :meth:`shutdown` потрібно викликати, поки :meth:`serve_forever` працює в іншому потоці, інакше він блокується.

source: Clean up the server. May be overridden.
uk: Очистити сервер. Може бути перевизначено.

source: The user-provided request handler class; an instance of this class is created for each request.
uk: Клас обробника запитів, наданий користувачем; екземпляр цього класу створюється для кожного запиту.

source: The address on which the server is listening. The format of addresses varies depending on the protocol family; see the documentation for the :mod:`socket` module for details. For internet protocols, this is a tuple containing a string giving the address, and an integer port number: ``('127.0.0.1', 80)``, for example.
uk: Адреса, на якій прослуховується сервер. Формат адреси змінюється в залежності від сімейства протоколів; подробиці дивіться в документації до модуля :mod:`socket`. Для інтернет-протоколів це кортеж, що містить рядок, що вказує адресу, і цілий номер порту: ``('127.0.0.1', 80)``, наприклад.

source: The socket object on which the server will listen for incoming requests.
uk: Об’єкт сокета, на якому сервер прослуховуватиме вхідні запити.

source: The server classes support the following class variables:
uk: Класи сервера підтримують наступні змінні класу:

source: Whether the server will allow the reuse of an address. This defaults to :const:`False`, and can be set in subclasses to change the policy.
uk: Чи дозволить сервер повторне використання адреси. За умовчанням це :const:`False`, і його можна встановити в підкласах, щоб змінити політику.

source: The size of the request queue. If it takes a long time to process a single request, any requests that arrive while the server is busy are placed into a queue, up to :attr:`request_queue_size` requests. Once the queue is full, further requests from clients will get a "Connection denied" error. The default value is usually 5, but this can be overridden by subclasses.
uk: Розмір черги запитів. Якщо обробка одного запиту займає багато часу, будь-які запити, які надходять, коли сервер зайнятий, розміщуються в черзі, до запитів :attr:`request_queue_size`. Після заповнення черги подальші запити від клієнтів отримуватимуть помилку "З’єднання відмовлено". Значення за замовчуванням зазвичай дорівнює 5, але це може бути замінено підкласами.

source: The type of socket used by the server; :const:`socket.SOCK_STREAM` and :const:`socket.SOCK_DGRAM` are two common values.
uk: Тип сокета, який використовує сервер; :const:`socket.SOCK_STREAM` і :const:`socket.SOCK_DGRAM` є двома загальними значеннями.

source: Timeout duration, measured in seconds, or :const:`None` if no timeout is desired. If :meth:`handle_request` receives no incoming requests within the timeout period, the :meth:`handle_timeout` method is called.
uk: Тривалість тайм-ауту, вимірюється в секундах, або :const:`None`, якщо тайм-аут не потрібний. Якщо :meth:`handle_request` не отримує вхідних запитів протягом періоду очікування, викликається метод :meth:`handle_timeout`.

source: There are various server methods that can be overridden by subclasses of base server classes like :class:`TCPServer`; these methods aren't useful to external users of the server object.
uk: Існують різні методи сервера, які можуть бути замінені підкласами базових класів серверів, наприклад :class:`TCPServer`; ці методи не корисні зовнішнім користувачам серверного об’єкта.

source: Actually processes the request by instantiating :attr:`RequestHandlerClass` and calling its :meth:`~BaseRequestHandler.handle` method.
uk: Фактично обробляє запит, створюючи екземпляр :attr:`RequestHandlerClass` і викликаючи його метод :meth:`~BaseRequestHandler.handle`.

source: Must accept a request from the socket, and return a 2-tuple containing the *new* socket object to be used to communicate with the client, and the client's address.
uk: Потрібно прийняти запит від сокета та повернути 2-кортеж, що містить *новий* об’єкт сокета, який буде використовуватися для зв’язку з клієнтом, і адресу клієнта.

source: This function is called if the :meth:`~BaseRequestHandler.handle` method of a :attr:`RequestHandlerClass` instance raises an exception. The default action is to print the traceback to standard error and continue handling further requests.
uk: Ця функція викликається, якщо метод :meth:`~BaseRequestHandler.handle` примірника :attr:`RequestHandlerClass` викликає виняткову ситуацію. Дія за замовчуванням полягає в тому, щоб надрукувати відстеження стандартної помилки та продовжити обробку подальших запитів.

source: Now only called for exceptions derived from the :exc:`Exception` class.
uk: Тепер викликаються лише винятки, похідні від класу :exc:`Exception`.

source: This function is called when the :attr:`timeout` attribute has been set to a value other than :const:`None` and the timeout period has passed with no requests being received. The default action for forking servers is to collect the status of any child processes that have exited, while in threading servers this method does nothing.
uk: Ця функція викликається, коли для атрибута :attr:`timeout` встановлено значення, відмінне від :const:`None`, і період очікування минув, а запити не надходили. Дія за замовчуванням для розгалужених серверів полягає в зборі статусу будь-яких дочірніх процесів, які вийшли, тоді як у потокових серверах цей метод не робить нічого.

source: Calls :meth:`finish_request` to create an instance of the :attr:`RequestHandlerClass`. If desired, this function can create a new process or thread to handle the request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` classes do this.
uk: Викликає :meth:`finish_request` для створення екземпляра :attr:`RequestHandlerClass`. За бажання ця функція може створити новий процес або потік для обробки запиту; це роблять класи :class:`ForkingMixIn` і :class:`ThreadingMixIn`.

source: Called by the server's constructor to activate the server. The default behavior for a TCP server just invokes :meth:`~socket.socket.listen` on the server's socket. May be overridden.
uk: Викликається конструктором сервера для активації сервера. Поведінка за замовчуванням для TCP-сервера просто викликає :meth:`~socket.socket.listen` у сокеті сервера. Може бути перевизначено.

source: Called by the server's constructor to bind the socket to the desired address. May be overridden.
uk: Викликається конструктором сервера, щоб прив’язати сокет до потрібної адреси. Може бути перевизначено.

source: Must return a Boolean value; if the value is :const:`True`, the request will be processed, and if it's :const:`False`, the request will be denied. This function can be overridden to implement access controls for a server. The default implementation always returns :const:`True`.
uk: Має повертати логічне значення; якщо значення :const:`True`, запит буде оброблено, а якщо значення :const:`False`, запит буде відхилено. Цю функцію можна замінити, щоб реалізувати контроль доступу до сервера. Стандартна реалізація завжди повертає :const:`True`.

source: Support for the :term:`context manager` protocol was added. Exiting the context manager is equivalent to calling :meth:`server_close`.
uk: Додано підтримку протоколу :term:`context manager`. Вихід із контекстного менеджера еквівалентний виклику :meth:`server_close`.

source: Request Handler Objects
uk: Об’єкти обробки запитів

source: This is the superclass of all request handler objects. It defines the interface, given below. A concrete request handler subclass must define a new :meth:`handle` method, and can override any of the other methods. A new instance of the subclass is created for each request.
uk: Це суперклас усіх об’єктів обробки запитів. Він визначає інтерфейс, наведений нижче. Конкретний підклас обробника запитів повинен визначати новий метод :meth:`handle` і може перевизначати будь-які інші методи. Для кожного запиту створюється новий екземпляр підкласу.

source: Called before the :meth:`handle` method to perform any initialization actions required. The default implementation does nothing.
uk: Викликається перед методом :meth:`handle` для виконання будь-яких необхідних дій ініціалізації. Стандартна реалізація нічого не робить.

source: Called after the :meth:`handle` method to perform any clean-up actions required. The default implementation does nothing. If :meth:`setup` raises an exception, this function will not be called.
uk: Викликається після методу :meth:`handle` для виконання будь-яких необхідних дій очищення. Стандартна реалізація нічого не робить. Якщо :meth:`setup` викликає виняток, ця функція не буде викликана.

source: Examples
uk: Приклади

source: :class:`socketserver.TCPServer` Example
uk: :class:`socketserver.TCPServer` Приклад

source: This is the server side::
uk: Це сторона сервера::

source: An alternative request handler class that makes use of streams (file-like objects that simplify communication by providing the standard file interface)::
uk: Альтернативний клас обробника запитів, який використовує потоки (файлоподібні об’єкти, які спрощують зв’язок, надаючи стандартний файловий інтерфейс):

source: This is the client side::
uk: Це сторона клієнта::

source: The output of the example should look something like this:
uk: Результат прикладу має виглядати приблизно так:

source: Server:
uk: сервер:

source: Client:
uk: Клієнт:

source: :class:`socketserver.UDPServer` Example
uk: :class:`socketserver.UDPServer` Приклад

source: The output of the example should look exactly like for the TCP server example.
uk: Вихідні дані прикладу мають виглядати точно так само, як для прикладу сервера TCP.

source: Asynchronous Mixins
uk: Асинхронні міксини

source: To build asynchronous handlers, use the :class:`ThreadingMixIn` and :class:`ForkingMixIn` classes.
uk: Для створення асинхронних обробників використовуйте класи :class:`ThreadingMixIn` і :class:`ForkingMixIn`.

source: An example for the :class:`ThreadingMixIn` class::
uk: Приклад класу :class:`ThreadingMixIn`::
