Repository: python/python-docs-uk
Catalog: library/socketserver.po
Languages: uk

source: The :class:`ForkingMixIn` class is used in the same way, except that the server will spawn a new process for each request. Available only on POSIX platforms that support :func:`~os.fork`.
uk: Клас :class:`ForkingMixIn` використовується так само, за винятком того, що сервер створюватиме новий процес для кожного запиту. Доступно лише на платформах POSIX, які підтримують :func:`~os.fork`.
