Repository: python/python-docs-uk
Catalog: library/socket.po
Languages: uk

source: Return a fully qualified domain name for *name*. If *name* is omitted or empty, it is interpreted as the local host. To find the fully qualified name, the hostname returned by :func:`gethostbyaddr` is checked, followed by aliases for the host, if available. The first name which includes a period is selected. In case no fully qualified domain name is available and *name* was provided, it is returned unchanged. If *name* was empty or equal to ``'0.0.0.0'``, the hostname from :func:`gethostname` is returned.
uk: Повернути повне доменне ім’я для *name*. Якщо *ім’я* опущене або порожнє, воно інтерпретується як локальний хост. Щоб знайти повне ім’я, перевіряється ім’я хоста, яке повертає :func:`gethostbyaddr`, а потім ідуть псевдоніми хоста, якщо вони доступні. Вибрано перше ім’я, яке містить крапку. Якщо повне доменне ім’я недоступне, а було вказано *ім’я*, воно повертається без змін. Якщо *name* було порожнім або дорівнює ``'0.0.0.0'``, повертається ім'я хоста з :func:`gethostname`.

source: Translate a host name to IPv4 address format. The IPv4 address is returned as a string, such as ``'100.50.200.5'``. If the host name is an IPv4 address itself it is returned unchanged. See :func:`gethostbyname_ex` for a more complete interface. :func:`gethostbyname` does not support IPv6 name resolution, and :func:`getaddrinfo` should be used instead for IPv4/v6 dual stack support.
uk: Перекладіть ім’я хоста у формат адреси IPv4. Адреса IPv4 повертається у вигляді рядка, наприклад ``'100.50.200.5``. Якщо ім’я хоста є адресою IPv4, воно повертається без змін. Дивіться :func:`gethostbyname_ex` для більш повного інтерфейсу. :func:`gethostbyname` не підтримує розпізнавання імен IPv6, а :func:`getaddrinfo` слід використовувати замість цього для підтримки подвійного стеку IPv4/v6.

source: Raises an :ref:`auditing event <auditing>` ``socket.gethostbyname`` with argument ``hostname``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.gethostbyname`` з аргументом ``hostname``.

source: Translate a host name to IPv4 address format, extended interface. Return a triple ``(hostname, aliaslist, ipaddrlist)`` where *hostname* is the host's primary host name, *aliaslist* is a (possibly empty) list of alternative host names for the same address, and *ipaddrlist* is a list of IPv4 addresses for the same interface on the same host (often but not always a single address). :func:`gethostbyname_ex` does not support IPv6 name resolution, and :func:`getaddrinfo` should be used instead for IPv4/v6 dual stack support.
uk: Переклад імені хоста у формат адреси IPv4, розширений інтерфейс. Повертає потрійний ``(hostname, aliaslist, ipaddrlist)``, де *hostname* — основне ім’я хоста, *aliaslist* — (можливо, порожній) список альтернативних імен хостів для тієї самої адреси, а *ipaddrlist* — список IPv4-адрес для одного інтерфейсу на одному хості (часто, але не завжди одна адреса). :func:`gethostbyname_ex` не підтримує розпізнавання імен IPv6, а :func:`getaddrinfo` слід використовувати замість цього для підтримки подвійного стеку IPv4/v6.

source: Return a string containing the hostname of the machine where the Python interpreter is currently executing.
uk: Повертає рядок, що містить ім’я хоста машини, на якій зараз виконується інтерпретатор Python.

source: Raises an :ref:`auditing event <auditing>` ``socket.gethostname`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.gethostname`` без аргументів.

source: Note: :func:`gethostname` doesn't always return the fully qualified domain name; use :func:`getfqdn` for that.
uk: Примітка: :func:`gethostname` не завжди повертає повне доменне ім’я; використовуйте для цього :func:`getfqdn`.

source: Return a triple ``(hostname, aliaslist, ipaddrlist)`` where *hostname* is the primary host name responding to the given *ip_address*, *aliaslist* is a (possibly empty) list of alternative host names for the same address, and *ipaddrlist* is a list of IPv4/v6 addresses for the same interface on the same host (most likely containing only a single address). To find the fully qualified domain name, use the function :func:`getfqdn`. :func:`gethostbyaddr` supports both IPv4 and IPv6.
uk: Повертає потрійний ``(hostname, aliaslist, ipaddrlist)``, де *hostname* — основне ім’я хоста, що відповідає заданій *ip_address*, *aliaslist* — (можливо, порожній) список альтернативних імен хостів для тієї самої адреси, а *ipaddrlist* — це список адрес IPv4/v6 для того самого інтерфейсу на тому самому хості (швидше за все, містить лише одну адресу). Щоб знайти повне доменне ім’я, скористайтеся функцією :func:`getfqdn`. :func:`gethostbyaddr` підтримує як IPv4, так і IPv6.

source: Raises an :ref:`auditing event <auditing>` ``socket.gethostbyaddr`` with argument ``ip_address``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.gethostbyaddr`` з аргументом ``ip_address``.

source: For IPv6 addresses, ``%scope_id`` is appended to the host part if *sockaddr* contains meaningful *scope_id*. Usually this happens for multicast addresses.
uk: Для адрес IPv6 ``%scope_id`` додається до частини хоста, якщо *sockaddr* містить значимий *scope_id*. Зазвичай це відбувається для багатоадресних адрес.

source: For more information about *flags* you can consult :manpage:`getnameinfo(3)`.
uk: Для отримання додаткової інформації про *прапори* ви можете звернутися до :manpage:`getnameinfo(3)`.

source: Raises an :ref:`auditing event <auditing>` ``socket.getnameinfo`` with argument ``sockaddr``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.getnameinfo`` з аргументом ``sockaddr``.

source: Translate an internet protocol name (for example, ``'icmp'``) to a constant suitable for passing as the (optional) third argument to the :func:`.socket` function. This is usually only needed for sockets opened in "raw" mode (:const:`SOCK_RAW`); for the normal socket modes, the correct protocol is chosen automatically if the protocol is omitted or zero.
uk: Перекладіть ім’я інтернет-протоколу (наприклад, ``'icmp'``) у константу, придатну для передачі як (необов’язковий) третій аргумент функції :func:`.socket`. Зазвичай це потрібно лише для сокетів, відкритих у режимі "raw" (:const:`SOCK_RAW`); для звичайних режимів сокетів правильний протокол вибирається автоматично, якщо протокол пропущений або нульовий.

source: Translate an internet service name and protocol name to a port number for that service. The optional protocol name, if given, should be ``'tcp'`` or ``'udp'``, otherwise any protocol will match.
uk: Перекладіть назву інтернет-сервісу та назву протоколу на номер порту для цієї служби. Додаткова назва протоколу, якщо її вказано, має бути ``'tcp'`` або ``'udp'``, інакше будь-який протокол збігатиметься.

source: Raises an :ref:`auditing event <auditing>` ``socket.getservbyname`` with arguments ``servicename``, ``protocolname``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.getservbyname`` з аргументами ``servicename``, ``protocolname``.

source: Translate an internet port number and protocol name to a service name for that service. The optional protocol name, if given, should be ``'tcp'`` or ``'udp'``, otherwise any protocol will match.
uk: Перекладіть номер інтернет-порту та назву протоколу на назву служби для цієї служби. Додаткова назва протоколу, якщо її вказано, має бути ``'tcp'`` або ``'udp'``, інакше будь-який протокол збігатиметься.

source: Raises an :ref:`auditing event <auditing>` ``socket.getservbyport`` with arguments ``port``, ``protocolname``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.getservbyport`` з аргументами ``port``, ``protocolname``.

source: Convert 32-bit positive integers from network to host byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 4-byte swap operation.
uk: Перетворення 32-розрядних додатних чисел із мережевого порядку байтів на хост. На машинах, де порядок байтів хоста збігається з порядком байтів у мережі, це заборонено; інакше він виконує 4-байтову операцію обміну.

source: Convert 16-bit positive integers from network to host byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 2-byte swap operation.
uk: Перетворення 16-розрядних додатних чисел із мережевого порядку байтів на хост. На машинах, де порядок байтів хоста збігається з порядком байтів у мережі, це заборонено; інакше він виконує 2-байтову операцію обміну.

source: Raises :exc:`OverflowError` if *x* does not fit in a 16-bit unsigned integer.
uk: Викликає :exc:`OverflowError`, якщо *x* не вміщується в 16-бітне ціле число без знаку.

source: Convert 32-bit positive integers from host to network byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 4-byte swap operation.
uk: Перетворюйте 32-розрядні додатні цілі числа з хоста на мережевий порядок байтів. На машинах, де порядок байтів хоста збігається з порядком байтів у мережі, це заборонено; інакше він виконує 4-байтову операцію обміну.

source: Convert 16-bit positive integers from host to network byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 2-byte swap operation.
uk: Перетворення 16-розрядних додатних чисел із хоста в мережевий порядок байтів. На машинах, де порядок байтів хоста збігається з порядком байтів у мережі, це заборонено; інакше він виконує 2-байтову операцію обміну.

source: :func:`inet_aton` also accepts strings with less than three dots; see the Unix manual page :manpage:`inet(3)` for details.
uk: :func:`inet_aton` також приймає рядки з менш ніж трьома крапками; подробиці див. на сторінці посібника Unix :manpage:`inet(3)`.

source: If the IPv4 address string passed to this function is invalid, :exc:`OSError` will be raised. Note that exactly what is valid depends on the underlying C implementation of :c:func:`inet_aton`.
uk: Якщо рядок адреси IPv4, переданий цій функції, недійсний, буде викликано :exc:`OSError`. Зауважте, що саме те, що є дійсним, залежить від базової реалізації C :c:func:`inet_aton`.

source: :func:`inet_aton` does not support IPv6, and :func:`inet_pton` should be used instead for IPv4/v6 dual stack support.
uk: :func:`inet_aton` не підтримує IPv6, а :func:`inet_pton` слід використовувати замість цього для підтримки подвійного стеку IPv4/v6.

source: If the byte sequence passed to this function is not exactly 4 bytes in length, :exc:`OSError` will be raised. :func:`inet_ntoa` does not support IPv6, and :func:`inet_ntop` should be used instead for IPv4/v6 dual stack support.
uk: Якщо послідовність байтів, передана цій функції, не має довжини точно 4 байти, виникне :exc:`OSError`. :func:`inet_ntoa` не підтримує IPv6, а :func:`inet_ntop` слід використовувати замість цього для підтримки подвійного стеку IPv4/v6.

source: Supported values for *address_family* are currently :const:`AF_INET` and :const:`AF_INET6`. If the IP address string *ip_string* is invalid, :exc:`OSError` will be raised. Note that exactly what is valid depends on both the value of *address_family* and the underlying implementation of :c:func:`inet_pton`.
uk: Підтримувані значення для *address_family* наразі: :const:`AF_INET` і :const:`AF_INET6`. Якщо рядок IP-адреси *ip_string* недійсний, виникне :exc:`OSError`. Зауважте, що саме те, що є дійсним, залежить як від значення *address_family*, так і від базової реалізації :c:func:`inet_pton`.

source: :ref:`Availability <availability>`: Unix, Windows.
uk: :ref:`Наявність <availability>`: Unix, Windows.

source: Windows support added
uk: Додано підтримку Windows

source: Supported values for *address_family* are currently :const:`AF_INET` and :const:`AF_INET6`. If the bytes object *packed_ip* is not the correct length for the specified address family, :exc:`ValueError` will be raised. :exc:`OSError` is raised for errors from the call to :func:`inet_ntop`.
uk: Підтримувані значення для *address_family* наразі: :const:`AF_INET` і :const:`AF_INET6`. Якщо об’єкт bytes *packed_ip* не має правильної довжини для вказаного сімейства адрес, буде викликано :exc:`ValueError`. :exc:`OSError` викликається для помилок виклику :func:`inet_ntop`.

source: Return the total length, without trailing padding, of an ancillary data item with associated data of the given *length*. This value can often be used as the buffer size for :meth:`~socket.recvmsg` to receive a single item of ancillary data, but :rfc:`3542` requires portable applications to use :func:`CMSG_SPACE` and thus include space for padding, even when the item will be the last in the buffer. Raises :exc:`OverflowError` if *length* is outside the permissible range of values.
uk: Повертає загальну довжину, без заповнення в кінці, елемента допоміжних даних із пов’язаними даними заданої *довжини*. Це значення часто можна використовувати як розмір буфера для :meth:`~socket.recvmsg` для отримання окремого елемента допоміжних даних, але :rfc:`3542` вимагає, щоб портативні програми використовували :func:`CMSG_SPACE` і таким чином включали простір для заповнення, навіть якщо елемент буде останнім у буфері. Викликає :exc:`OverflowError`, якщо *length* виходить за межі допустимого діапазону значень.

source: Return the buffer size needed for :meth:`~socket.recvmsg` to receive an ancillary data item with associated data of the given *length*, along with any trailing padding. The buffer space needed to receive multiple items is the sum of the :func:`CMSG_SPACE` values for their associated data lengths. Raises :exc:`OverflowError` if *length* is outside the permissible range of values.
uk: Повертає розмір буфера, необхідний для :meth:`~socket.recvmsg` для отримання елемента допоміжних даних із пов’язаними даними заданої *довжини* разом із будь-яким доповненням у кінці. Буферний простір, необхідний для отримання кількох елементів, є сумою значень :func:`CMSG_SPACE` для відповідної довжини даних. Викликає :exc:`OverflowError`, якщо *length* виходить за межі допустимого діапазону значень.

source: Note that some systems might support ancillary data without providing this function. Also note that setting the buffer size using the results of this function may not precisely limit the amount of ancillary data that can be received, since additional data may be able to fit into the padding area.
uk: Зауважте, що деякі системи можуть підтримувати допоміжні дані без надання цієї функції. Також зауважте, що встановлення розміру буфера за допомогою результатів цієї функції може не обмежувати точно кількість допоміжних даних, які можна отримати, оскільки додаткові дані можуть поміститися в область заповнення.

source: Return the default timeout in seconds (float) for new socket objects. A value of ``None`` indicates that new socket objects have no timeout. When the socket module is first imported, the default is ``None``.
uk: Повертає стандартний час очікування в секундах (float) для нових об’єктів сокета. Значення ``None`` вказує на те, що нові об’єкти сокета не мають часу очікування. Коли модуль сокета імпортовано вперше, за замовчуванням буде ``None``.

source: Set the default timeout in seconds (float) for new socket objects. When the socket module is first imported, the default is ``None``. See :meth:`~socket.settimeout` for possible values and their respective meanings.
uk: Встановіть стандартний час очікування в секундах (float) для нових об’єктів сокета. Коли модуль сокета імпортовано вперше, за замовчуванням буде ``None``. Перегляньте :meth:`~socket.settimeout` можливі значення та їх відповідні значення.

source: Set the machine's hostname to *name*. This will raise an :exc:`OSError` if you don't have enough rights.
uk: Встановіть ім’я хоста машини на *name*. Це викличе :exc:`OSError`, якщо у вас недостатньо прав.

source: Raises an :ref:`auditing event <auditing>` ``socket.sethostname`` with argument ``name``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.sethostname`` з аргументом ``name``.

source: :ref:`Availability <availability>`: Unix.
uk: :ref:`Наявність <availability>`: Unix.

source: Return a list of network interface information (index int, name string) tuples. :exc:`OSError` if the system call fails.
uk: Повертає список кортежів інформації про мережевий інтерфейс (index int, name string). :exc:`OSError`, якщо системний виклик не вдається.

source: Windows support was added.
uk: Додано підтримку Windows.

source: On Windows network interfaces have different names in different contexts (all names are examples):
uk: У Windows мережеві інтерфейси мають різні імена в різних контекстах (усі імена є прикладами):

source: name: ``ethernet_32770``
uk: назва: ``ethernet_32770``

source: friendly name: ``vEthernet (nat)``
uk: зрозуміла назва: ``vEthernet (nat)``

source: description: ``Hyper-V Virtual Ethernet Adapter``
uk: опис: ``Hyper-V Virtual Ethernet Adapter``

source: This function returns names of the second form from the list, ``ethernet_32770`` in this example case.
uk: Ця функція повертає імена другої форми зі списку, ``ethernet_32770`` у цьому прикладі.

source: Return a network interface index number corresponding to an interface name. :exc:`OSError` if no interface with the given name exists.
uk: Повертає номер індексу мережевого інтерфейсу, який відповідає імені інтерфейсу. :exc:`OSError`, якщо не існує інтерфейсу з вказаною назвою.

source: "Interface name" is a name as documented in :func:`if_nameindex`.
uk: "Назва інтерфейсу" — це назва, задокументована в :func:`if_nameindex`.

source: Return a network interface name corresponding to an interface index number. :exc:`OSError` if no interface with the given index exists.
uk: Повертає назву мережевого інтерфейсу, що відповідає номеру індексу інтерфейсу. :exc:`OSError`, якщо не існує інтерфейсу з даним індексом.

source: Send the list of file descriptors *fds* over an :const:`AF_UNIX` socket *sock*. The *fds* parameter is a sequence of file descriptors. Consult :meth:`sendmsg` for the documentation of these parameters.
uk: Надішліть список дескрипторів файлів *fds* через сокет :const:`AF_UNIX` *sock*. Параметр *fds* — це послідовність дескрипторів файлів. Зверніться до :meth:`sendmsg` для документації щодо цих параметрів.

source: Receive up to *maxfds* file descriptors from an :const:`AF_UNIX` socket *sock*. Return ``(msg, list(fds), flags, addr)``. Consult :meth:`recvmsg` for the documentation of these parameters.
uk: Отримайте до *maxfds* файлових дескрипторів із :const:`AF_UNIX` сокета *sock*. Повернути ``(msg, list(fds), flags, addr)``. Зверніться до :meth:`recvmsg` для документації цих параметрів.

source: Any truncated integers at the end of the list of file descriptors.
uk: Будь-які скорочені цілі числа в кінці списку дескрипторів файлів.

source: Socket Objects
uk: Об'єкти Socket

source: Socket objects have the following methods. Except for :meth:`~socket.makefile`, these correspond to Unix system calls applicable to sockets.
uk: Об’єкти Socket мають такі методи. За винятком :meth:`~socket.makefile`, вони відповідають системним викликам Unix, застосовним до сокетів.

source: Support for the :term:`context manager` protocol was added. Exiting the context manager is equivalent to calling :meth:`~socket.close`.
uk: Додано підтримку протоколу :term:`context manager`. Вихід із контекстного менеджера еквівалентний виклику :meth:`~socket.close`.

source: Accept a connection. The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
uk: Прийняти підключення. Сокет має бути прив’язаний до адреси та прослуховувати підключення. Поверненим значенням є пара ``(conn, address)``, де *conn* — це *новий* об’єкт сокета, який можна використовувати для надсилання та отримання даних під час з’єднання, а *address* — це адреса, прив’язана до сокета на іншому кінець з'єднання.

source: The socket is now non-inheritable.
uk: Тепер сокет не успадковується.

source: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
uk: Якщо системний виклик перервано, а обробник сигналу не викликає виключення, метод тепер повторює системний виклик замість того, щоб викликати виняток :exc:`InterruptedError` (перегляньте :pep:`475` для обґрунтування).

source: Bind the socket to *address*. The socket must not already be bound. (The format of *address* depends on the address family --- see above.)
uk: Прив’яжіть сокет до *адреси*. Розетка ще не повинна бути прив’язаною. (Формат *адреси* залежить від групи адрес --- див. вище.)

source: Raises an :ref:`auditing event <auditing>` ``socket.bind`` with arguments ``self``, ``address``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.bind`` з аргументами ``self``, ``address``.

source: Mark the socket closed. The underlying system resource (e.g. a file descriptor) is also closed when all file objects from :meth:`makefile()` are closed. Once that happens, all future operations on the socket object will fail. The remote end will receive no more data (after queued data is flushed).
uk: Позначте розетку закритою. Базовий системний ресурс (наприклад, дескриптор файлу) також закривається, коли закриваються всі файлові об’єкти з :meth:`makefile()`. Як тільки це станеться, усі подальші операції над об’єктом сокета не вдадуться. Віддалена сторона більше не отримуватиме даних (після видалення даних із черги).

source: Sockets are automatically closed when they are garbage-collected, but it is recommended to :meth:`close` them explicitly, or to use a :keyword:`with` statement around them.
uk: Сокети автоматично закриваються під час збирання сміття, але рекомендується :meth:`close` їх явно або використовувати оператор :keyword:`with` навколо них.

source: :exc:`OSError` is now raised if an error occurs when the underlying :c:func:`close` call is made.
uk: :exc:`OSError` тепер викликається, якщо виникає помилка під час основного виклику :c:func:`close`.

source: :meth:`close()` releases the resource associated with a connection but does not necessarily close the connection immediately. If you want to close the connection in a timely fashion, call :meth:`shutdown()` before :meth:`close()`.
uk: :meth:`close()` звільняє ресурс, пов’язаний із з’єднанням, але не обов’язково закриває з’єднання негайно. Якщо ви хочете своєчасно закрити з’єднання, викличте :meth:`shutdown()` перед :meth:`close()`.

source: Connect to a remote socket at *address*. (The format of *address* depends on the address family --- see above.)
uk: Підключіться до віддаленої розетки за *адресою*. (Формат *адреси* залежить від групи адрес --- див. вище.)

source: If the connection is interrupted by a signal, the method waits until the connection completes, or raise a :exc:`TimeoutError` on timeout, if the signal handler doesn't raise an exception and the socket is blocking or has a timeout. For non-blocking sockets, the method raises an :exc:`InterruptedError` exception if the connection is interrupted by a signal (or the exception raised by the signal handler).
uk: Якщо з’єднання перервано сигналом, метод чекає, доки з’єднання не завершиться, або викликає :exc:`TimeoutError` після тайм-ауту, якщо обробник сигналу не викликає виключення, а сокет блокується або має тайм-аут. Для неблокуючих сокетів метод викликає виняток :exc:`InterruptedError`, якщо з’єднання переривається сигналом (або винятком, викликаним обробником сигналу).
