Repository: python/python-docs-uk
Catalog: library/socket.po
Languages: uk

source: :mod:`socket` --- Low-level networking interface
uk: :mod:`socket` --- Мережевий інтерфейс низького рівня

source: **Source code:** :source:`Lib/socket.py`
uk: **Вихідний код:** :source:`Lib/socket.py`

source: This module provides access to the BSD *socket* interface. It is available on all modern Unix systems, Windows, MacOS, and probably additional platforms.
uk: Цей модуль забезпечує доступ до інтерфейсу BSD *socket*. Він доступний у всіх сучасних системах Unix, Windows, MacOS і, можливо, на додаткових платформах.

source: Some behavior may be platform dependent, since calls are made to the operating system socket APIs.
uk: Деяка поведінка може залежати від платформи, оскільки виклики здійснюються до API сокетів операційної системи.

source: The Python interface is a straightforward transliteration of the Unix system call and library interface for sockets to Python's object-oriented style: the :func:`.socket` function returns a :dfn:`socket object` whose methods implement the various socket system calls. Parameter types are somewhat higher-level than in the C interface: as with :meth:`read` and :meth:`write` operations on Python files, buffer allocation on receive operations is automatic, and buffer length is implicit on send operations.
uk: Інтерфейс Python є простою транслітерацією системного виклику Unix та інтерфейсу бібліотеки для сокетів у об’єктно-орієнтований стиль Python: функція :func:`.socket` повертає об’єкт :dfn:`socket`, методи якого реалізують різноманітні системні виклики сокетів. . Типи параметрів дещо вищого рівня, ніж в інтерфейсі C: як і з операціями :meth:`read` і :meth:`write` для файлів Python, розподіл буфера для операцій отримання є автоматичним, а довжина буфера неявна для операцій надсилання.

source: Module :mod:`socketserver`
uk: Модуль :mod:`socketserver`

source: Classes that simplify writing network servers.
uk: Класи, які спрощують написання мережевих серверів.

source: Module :mod:`ssl`
uk: Модуль :mod:`ssl`

source: A TLS/SSL wrapper for socket objects.
uk: Обгортка TLS/SSL для об’єктів сокета.

source: Socket families
uk: Сімейства розеток

source: Depending on the system and the build options, various socket families are supported by this module.
uk: Залежно від системи та параметрів збірки, цей модуль підтримує різні сімейства сокетів.

source: The address format required by a particular socket object is automatically selected based on the address family specified when the socket object was created. Socket addresses are represented as follows:
uk: Формат адреси, необхідний для певного об’єкта сокета, вибирається автоматично на основі сімейства адрес, указаного під час створення об’єкта сокета. Адреси сокетів представлені таким чином:

source: The address of an :const:`AF_UNIX` socket bound to a file system node is represented as a string, using the file system encoding and the ``'surrogateescape'`` error handler (see :pep:`383`). An address in Linux's abstract namespace is returned as a :term:`bytes-like object` with an initial null byte; note that sockets in this namespace can communicate with normal file system sockets, so programs intended to run on Linux may need to deal with both types of address. A string or bytes-like object can be used for either type of address when passing it as an argument.
uk: Адреса сокета :const:`AF_UNIX`, пов’язаного з вузлом файлової системи, представлена у вигляді рядка з використанням кодування файлової системи та обробника помилок ``'surrogateescape'`` (див. :pep:`383`). Адреса в абстрактному просторі імен Linux повертається як :term:`bytes-like object` з початковим нульовим байтом; зауважте, що сокети в цьому просторі імен можуть взаємодіяти зі звичайними сокетами файлової системи, тому програми, призначені для роботи в Linux, можуть мати справу з обома типами адрес. Рядок або байт-подібний об’єкт можна використовувати для будь-якого типу адреси, передаючи його як аргумент.

source: Previously, :const:`AF_UNIX` socket paths were assumed to use UTF-8 encoding.
uk: Раніше вважалося, що шляхи сокетів :const:`AF_UNIX` використовували кодування UTF-8.

source: Writable :term:`bytes-like object` is now accepted.
uk: Записуваний :term:`bytes-like object` тепер приймається.

source: A pair ``(host, port)`` is used for the :const:`AF_INET` address family, where *host* is a string representing either a hostname in internet domain notation like ``'daring.cwi.nl'`` or an IPv4 address like ``'100.50.200.5'``, and *port* is an integer.
uk: Пара ``(хост, порт)`` використовується для родини адрес :const:`AF_INET`, де *хост* — це рядок, який представляє або ім’я хоста в нотації домену Інтернету, як-от ``'daring.cwi.nl'`` або адреса IPv4, наприклад ``'100.50.200.5''``, і *порт* є цілим числом.

source: For IPv4 addresses, two special forms are accepted instead of a host address: ``''`` represents :const:`INADDR_ANY`, which is used to bind to all interfaces, and the string ``'<broadcast>'`` represents :const:`INADDR_BROADCAST`. This behavior is not compatible with IPv6, therefore, you may want to avoid these if you intend to support IPv6 with your Python programs.
uk: Для адрес IPv4 приймаються дві спеціальні форми замість адреси хоста: ``''`` представляє :const:`INADDR_ANY`, який використовується для прив’язки до всіх інтерфейсів, а рядок ``' <broadcast> ''`` представляє :const:`INADDR_BROADCAST`. Така поведінка несумісна з IPv6, тому ви можете уникнути цього, якщо ви маєте намір підтримувати IPv6 у своїх програмах на Python.

source: For :const:`AF_INET6` address family, a four-tuple ``(host, port, flowinfo, scope_id)`` is used, where *flowinfo* and *scope_id* represent the ``sin6_flowinfo`` and ``sin6_scope_id`` members in :const:`struct sockaddr_in6` in C. For :mod:`socket` module methods, *flowinfo* and *scope_id* can be omitted just for backward compatibility. Note, however, omission of *scope_id* can cause problems in manipulating scoped IPv6 addresses.
uk: Для родини адрес :const:`AF_INET6` використовується чотирикортеж ``(host, port, flowinfo, scope_id)``, де *flowinfo* та *scope_id* представляють ``sin6_flowinfo`` та ``sin6_scope_id`` члени в :const:`struct sockaddr_in6` в C. Для методів модуля :mod:`socket` *flowinfo* та *scope_id* можна опустити тільки для зворотної сумісності. Однак зауважте, що пропуск *scope_id* може спричинити проблеми під час маніпулювання адресами IPv6 із областю дії.

source: For multicast addresses (with *scope_id* meaningful) *address* may not contain ``%scope_id`` (or ``zone id``) part. This information is superfluous and may be safely omitted (recommended).
uk: Для багатоадресних адрес (зі значенням *scope_id*) *address* не може містити частину ``%scope_id`` (або ``zone id``). Ця інформація є зайвою, і її можна сміливо опустити (рекомендовано).

source: :const:`AF_NETLINK` sockets are represented as pairs ``(pid, groups)``.
uk: :const:`AF_NETLINK` сокети представлені як пари ``(pid, groups)``.

source: Linux-only support for TIPC is available using the :const:`AF_TIPC` address family. TIPC is an open, non-IP based networked protocol designed for use in clustered computer environments. Addresses are represented by a tuple, and the fields depend on the address type. The general tuple form is ``(addr_type, v1, v2, v3 [, scope])``, where:
uk: Підтримка TIPC лише для Linux доступна за допомогою родини адрес :const:`AF_TIPC`. TIPC — це відкритий мережевий протокол не на основі IP, призначений для використання в кластерних комп’ютерних середовищах. Адреси представлені кортежем, а поля залежать від типу адреси. Загальна форма кортежу ``(addr_type, v1, v2, v3 [, scope])``, де:

source: *addr_type* is one of :const:`TIPC_ADDR_NAMESEQ`, :const:`TIPC_ADDR_NAME`, or :const:`TIPC_ADDR_ID`.
uk: *addr_type* є одним із :const:`TIPC_ADDR_NAMESEQ`, :const:`TIPC_ADDR_NAME` або :const:`TIPC_ADDR_ID`.

source: *scope* is one of :const:`TIPC_ZONE_SCOPE`, :const:`TIPC_CLUSTER_SCOPE`, and :const:`TIPC_NODE_SCOPE`.
uk: *scope* є одним із :const:`TIPC_ZONE_SCOPE`, :const:`TIPC_CLUSTER_SCOPE` та :const:`TIPC_NODE_SCOPE`.

source: If *addr_type* is :const:`TIPC_ADDR_NAME`, then *v1* is the server type, *v2* is the port identifier, and *v3* should be 0.
uk: Якщо *addr_type* дорівнює :const:`TIPC_ADDR_NAME`, тоді *v1* — це тип сервера, *v2* — ідентифікатор порту, а *v3* має бути 0.

source: If *addr_type* is :const:`TIPC_ADDR_NAMESEQ`, then *v1* is the server type, *v2* is the lower port number, and *v3* is the upper port number.
uk: Якщо *addr_type* дорівнює :const:`TIPC_ADDR_NAMESEQ`, то *v1* — це тип сервера, *v2* — нижній номер порту, а *v3* — верхній номер порту.

source: If *addr_type* is :const:`TIPC_ADDR_ID`, then *v1* is the node, *v2* is the reference, and *v3* should be set to 0.
uk: Якщо *addr_type* дорівнює :const:`TIPC_ADDR_ID`, тоді *v1* є вузлом, *v2* є посиланням, а *v3* має бути встановлено на 0.

source: A tuple ``(interface, )`` is used for the :const:`AF_CAN` address family, where *interface* is a string representing a network interface name like ``'can0'``. The network interface name ``''`` can be used to receive packets from all network interfaces of this family.
uk: Кортеж ``(інтерфейс, )`` використовується для сімейства адрес :const:`AF_CAN`, де *інтерфейс* — це рядок, що представляє назву мережевого інтерфейсу, наприклад ``'can0'``. Ім'я мережевого інтерфейсу ``''`` можна використовувати для отримання пакетів від усіх мережевих інтерфейсів цього сімейства.

source: :const:`CAN_ISOTP` protocol require a tuple ``(interface, rx_addr, tx_addr)`` where both additional parameters are unsigned long integer that represent a CAN identifier (standard or extended).
uk: Протокол :const:`CAN_ISOTP` вимагає кортеж ``(interface, rx_addr, tx_addr)``, де обидва додаткові параметри є довгим цілим числом без знаку, що представляє ідентифікатор CAN (стандартний або розширений).

source: :const:`CAN_J1939` protocol require a tuple ``(interface, name, pgn, addr)`` where additional parameters are 64-bit unsigned integer representing the ECU name, a 32-bit unsigned integer representing the Parameter Group Number (PGN), and an 8-bit integer representing the address.
uk: :const:(інтерфейс, ім'я, pgn, адреса)``, де додаткові параметри є 64-розрядним цілим числом без знака, що представляє назву ECU, 32-розрядним цілим числом без знака, що представляє номер групи параметрів (PGN ) і 8-бітове ціле число, що представляє адресу.

source: :const:`AF_BLUETOOTH` supports the following protocols and address formats:
uk: :const:`AF_BLUETOOTH` підтримує наступні протоколи та формати адрес:

source: :const:`BTPROTO_L2CAP` accepts ``(bdaddr, psm)`` where ``bdaddr`` is the Bluetooth address as a string and ``psm`` is an integer.
uk: :const:`BTPROTO_L2CAP` приймає ``(bdaddr, psm)``, де ``bdaddr`` — адреса Bluetooth у вигляді рядка, а ``psm`` — ціле число.

source: :const:`BTPROTO_RFCOMM` accepts ``(bdaddr, channel)`` where ``bdaddr`` is the Bluetooth address as a string and ``channel`` is an integer.
uk: :const:`BTPROTO_RFCOMM` приймає ``(bdaddr, канал)``, де ``bdaddr`` — це адреса Bluetooth у вигляді рядка, а ``channel`` — ціле число.

source: :const:`BTPROTO_HCI` accepts ``(device_id,)`` where ``device_id`` is either an integer or a string with the Bluetooth address of the interface. (This depends on your OS; NetBSD and DragonFlyBSD expect a Bluetooth address while everything else expects an integer.)
uk: :const:`BTPROTO_HCI` приймає ``(device_id,)``, де ``device_id`` є або цілим числом, або рядком з адресою Bluetooth інтерфейсу. (Це залежить від вашої ОС; NetBSD і DragonFlyBSD очікують адресу Bluetooth, а всі інші очікують ціле число.)

source: NetBSD and DragonFlyBSD support added.
uk: Додано підтримку NetBSD і DragonFlyBSD.

source: :const:`BTPROTO_SCO` accepts ``bdaddr`` where ``bdaddr`` is a :class:`bytes` object containing the Bluetooth address in a string format. (ex. ``b'12:23:34:45:56:67'``) This protocol is not supported under FreeBSD.
uk: :const:`BTPROTO_SCO` приймає ``bdaddr``, де ``bdaddr`` є об'єктом :class:`bytes`, що містить адресу Bluetooth у форматі рядка. (наприклад, ``b'12:23:34:45:56:67''``) Цей протокол не підтримується FreeBSD.

source: :const:`AF_ALG` is a Linux-only socket based interface to Kernel cryptography. An algorithm socket is configured with a tuple of two to four elements ``(type, name [, feat [, mask]])``, where:
uk: :const:`AF_ALG` — це інтерфейс для криптографії ядра на основі сокетів лише для Linux. Сокет алгоритму налаштований за допомогою кортежу з двох-чотирьох елементів ``(type, name [, feat [, mask]])``, де:

source: *type* is the algorithm type as string, e.g. ``aead``, ``hash``, ``skcipher`` or ``rng``.
uk: *type* — це тип алгоритму як рядок, напр. ``aead``, ``hash``, ``skcipher`` або ``rng``.

source: *name* is the algorithm name and operation mode as string, e.g. ``sha256``, ``hmac(sha256)``, ``cbc(aes)`` or ``drbg_nopr_ctr_aes256``.
uk: *ім’я* — це назва алгоритму та режим роботи у вигляді рядка, напр. ``sha256``, ``hmac(sha256)``, ``cbc(aes)`` або ``drbg_nopr_ctr_aes256``.

source: *feat* and *mask* are unsigned 32bit integers.
uk: *feat* і *mask* — це 32-розрядні цілі числа без знаку.

source: :const:`AF_VSOCK` allows communication between virtual machines and their hosts. The sockets are represented as a ``(CID, port)`` tuple where the context ID or CID and port are integers.
uk: :const:`AF_VSOCK` дозволяє спілкуватися між віртуальними машинами та їх хостами. Сокети представлені як кортеж ``(CID, порт)``, де ідентифікатор контексту або CID і порт є цілими числами.

source: :const:`AF_PACKET` is a low-level interface directly to network devices. The packets are represented by the tuple ``(ifname, proto[, pkttype[, hatype[, addr]]])`` where:
uk: :const:`AF_PACKET` — це низькорівневий інтерфейс безпосередньо до мережевих пристроїв. Пакети представлені кортежем ``(ifname, proto[, pkttype[, hatype[, addr]]])``, де:

source: *ifname* - String specifying the device name.
uk: *ifname* - Рядок, що визначає назву пристрою.

source: *proto* - An in network-byte-order integer specifying the Ethernet protocol number.
uk: *proto* – ціле число в мережевому порядку байтів, що визначає номер протоколу Ethernet.

source: *pkttype* - Optional integer specifying the packet type:
uk: *pkttype* - додаткове ціле число, що вказує тип пакета:

source: ``PACKET_HOST`` (the default) - Packet addressed to the local host.
uk: ``PACKET_HOST`` (за замовчуванням) - пакет, адресований локальному хосту.

source: ``PACKET_BROADCAST`` - Physical-layer broadcast packet.
uk: ``PACKET_BROADCAST`` - широкомовний пакет фізичного рівня.

source: ``PACKET_OTHERHOST`` - Packet to some other host that has been caught by a device driver in promiscuous mode.
uk: ``PACKET_OTHERHOST`` - Пакет до іншого хосту, який був перехоплений драйвером пристрою в безладному режимі.

source: ``PACKET_OUTGOING`` - Packet originating from the local host that is looped back to a packet socket.
uk: ``PACKET_OUTGOING`` – Пакет, що надходить від локального хосту і повертається до сокета пакета.

source: *hatype* - Optional integer specifying the ARP hardware address type.
uk: *hatype* – додаткове ціле число, що визначає тип апаратної адреси ARP.

source: *addr* - Optional bytes-like object specifying the hardware physical address, whose interpretation depends on the device.
uk: *addr* – необов’язковий байтовий об’єкт, що вказує апаратну фізичну адресу, інтерпретація якої залежить від пристрою.

source: :const:`AF_QIPCRTR` is a Linux-only socket based interface for communicating with services running on co-processors in Qualcomm platforms. The address family is represented as a ``(node, port)`` tuple where the *node* and *port* are non-negative integers.
uk: :const:`AF_QIPCRTR` — це інтерфейс на основі сокетів лише для Linux для зв’язку зі службами, що працюють на співпроцесорах на платформах Qualcomm. Сімейство адрес представлено як кортеж ``(вузол, порт)``, де *вузол* і *порт* є невід’ємними цілими числами.

source: :const:`IPPROTO_UDPLITE` is a variant of UDP which allows you to specify what portion of a packet is covered with the checksum. It adds two socket options that you can change. ``self.setsockopt(IPPROTO_UDPLITE, UDPLITE_SEND_CSCOV, length)`` will change what portion of outgoing packets are covered by the checksum and ``self.setsockopt(IPPROTO_UDPLITE, UDPLITE_RECV_CSCOV, length)`` will filter out packets which cover too little of their data. In both cases ``length`` should be in ``range(8, 2**16, 8)``.
uk: :const:`IPPROTO_UDPLITE` — це варіант UDP, який дозволяє вказати, яку частину пакету охоплює контрольна сума. Він додає два варіанти розеток, які ви можете змінити. ``self.setsockopt(IPPROTO_UDPLITE, UDPLITE_SEND_CSCOV, length)`` змінить частину вихідних пакетів, охоплених контрольною сумою, а ``self.setsockopt(IPPROTO_UDPLITE, UDPLITE_RECV_CSCOV, length)`` відфільтровує пакети, які покривають занадто мало їхні дані. В обох випадках ``довжина`` має бути в ``діапазоні (8, 2**16, 8)``.

source: Such a socket should be constructed with ``socket(AF_INET, SOCK_DGRAM, IPPROTO_UDPLITE)`` for IPv4 or ``socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDPLITE)`` for IPv6.
uk: Такий сокет має бути створений за допомогою ``socket(AF_INET, SOCK_DGRAM, IPPROTO_UDPLITE)`` для IPv4 або ``socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDPLITE)`` для IPv6.

source: If you use a hostname in the *host* portion of IPv4/v6 socket address, the program may show a nondeterministic behavior, as Python uses the first address returned from the DNS resolution. The socket address will be resolved differently into an actual IPv4/v6 address, depending on the results from DNS resolution and/or the host configuration. For deterministic behavior use a numeric address in *host* portion.
uk: Якщо ви використовуєте ім’я хоста в частині *host* адреси сокета IPv4/v6, програма може продемонструвати недетерміновану поведінку, оскільки Python використовує першу адресу, повернуту з вирішення DNS. Адреса сокета буде перетворена по-іншому в фактичну адресу IPv4/v6, залежно від результатів розв’язання DNS та/або конфігурації хоста. Для детермінованої поведінки використовуйте числову адресу в частині *host*.

source: All errors raise exceptions. The normal exceptions for invalid argument types and out-of-memory conditions can be raised. Errors related to socket or address semantics raise :exc:`OSError` or one of its subclasses.
uk: Усі помилки викликають винятки. Можна викликати звичайні винятки для недійсних типів аргументів і умов браку пам’яті. Помилки, пов’язані із семантикою сокета чи адреси, викликають :exc:`OSError` або один із його підкласів.

source: Non-blocking mode is supported through :meth:`~socket.setblocking`. A generalization of this based on timeouts is supported through :meth:`~socket.settimeout`.
uk: Неблокуючий режим підтримується через :meth:`~socket.setblocking`. Узагальнення цього на основі тайм-аутів підтримується через :meth:`~socket.settimeout`.

source: Module contents
uk: Зміст модуля

source: The module :mod:`socket` exports the following elements.
uk: Модуль :mod:`socket` експортує такі елементи.

source: Exceptions
uk: Винятки

source: A deprecated alias of :exc:`OSError`.
uk: Застарілий псевдонім :exc:`OSError`.

source: Following :pep:`3151`, this class was made an alias of :exc:`OSError`.
uk: Після :pep:`3151` цей клас отримав псевдонім :exc:`OSError`.

source: A subclass of :exc:`OSError`, this exception is raised for address-related errors, i.e. for functions that use *h_errno* in the POSIX C API, including :func:`gethostbyname_ex` and :func:`gethostbyaddr`. The accompanying value is a pair ``(h_errno, string)`` representing an error returned by a library call. *h_errno* is a numeric value, while *string* represents the description of *h_errno*, as returned by the :c:func:`hstrerror` C function.
uk: Підклас :exc:`OSError`, цей виняток виникає для помилок, пов’язаних з адресою, тобто для функцій, які використовують *h_errno* в POSIX C API, включаючи :func:`gethostbyname_ex` і :func:`gethostbyaddr`. Супровідним значенням є пара ``(h_errno, string)``, яка представляє помилку, яку повертає виклик бібліотеки. *h_errno* — це числове значення, тоді як *string* представляє опис *h_errno*, який повертає функція :c:func:`hstrerror` C.

source: This class was made a subclass of :exc:`OSError`.
uk: Цей клас було створено підкласом :exc:`OSError`.

source: A subclass of :exc:`OSError`, this exception is raised for address-related errors by :func:`getaddrinfo` and :func:`getnameinfo`. The accompanying value is a pair ``(error, string)`` representing an error returned by a library call. *string* represents the description of *error*, as returned by the :c:func:`gai_strerror` C function. The numeric *error* value will match one of the :const:`EAI_\*` constants defined in this module.
uk: Підклас :exc:`OSError`, цей виняток створюється для помилок, пов’язаних з адресою, :func:`getaddrinfo` і :func:`getnameinfo`. Супровідним значенням є пара ``(помилка, рядок)``, яка представляє помилку, яку повертає виклик бібліотеки. *рядок* представляє опис *помилки*, яку повертає функція C :c:func:`gai_strerror`. Числове значення *помилки* відповідатиме одній із констант :const:`EAI_\*`, визначених у цьому модулі.

source: A deprecated alias of :exc:`TimeoutError`.
uk: Застарілий псевдонім :exc:`TimeoutError`.

source: A subclass of :exc:`OSError`, this exception is raised when a timeout occurs on a socket which has had timeouts enabled via a prior call to :meth:`~socket.settimeout` (or implicitly through :func:`~socket.setdefaulttimeout`). The accompanying value is a string whose value is currently always "timed out".
uk: Підклас :exc:`OSError`, цей виняток виникає, коли тайм-аут виникає в сокеті, для якого було ввімкнено тайм-аути через попередній виклик :meth:`~socket.settimeout` (або неявно через :func:`~socket .setdefaulttimeout`). Супровідне значення - це рядок, значення якого наразі завжди "закінчено".

source: This class was made an alias of :exc:`TimeoutError`.
uk: Цей клас отримав псевдонім :exc:`TimeoutError`.

source: Constants
uk: Константи

source: The AF_* and SOCK_* constants are now :class:`AddressFamily` and :class:`SocketKind` :class:`.IntEnum` collections.
uk: Константи AF_* і SOCK_* тепер є колекціями :class:`AddressFamily` і :class:`SocketKind` :class:`.IntEnum`.

source: These constants represent the address (and protocol) families, used for the first argument to :func:`.socket`. If the :const:`AF_UNIX` constant is not defined then this protocol is unsupported. More constants may be available depending on the system.
uk: Ці константи представляють родини адрес (і протоколів), які використовуються для першого аргументу :func:`.socket`. Якщо константа :const:`AF_UNIX` не визначена, цей протокол не підтримується. Залежно від системи можуть бути доступні інші константи.

source: These constants represent the socket types, used for the second argument to :func:`.socket`. More constants may be available depending on the system. (Only :const:`SOCK_STREAM` and :const:`SOCK_DGRAM` appear to be generally useful.)
uk: Ці константи представляють типи сокетів, які використовуються для другого аргументу :func:`.socket`. Залежно від системи можуть бути доступні інші константи. (Лише :const:`SOCK_STREAM` і :const:`SOCK_DGRAM` здаються загалом корисними.)

source: These two constants, if defined, can be combined with the socket types and allow you to set some flags atomically (thus avoiding possible race conditions and the need for separate calls).
uk: Ці дві константи, якщо їх визначено, можна комбінувати з типами сокетів і дозволити вам встановлювати деякі прапори атомарно (таким чином уникаючи можливих умов змагання та потреби в окремих викликах).

source: :ref:`Availability <availability>`: Linux >= 2.6.27.
uk: :ref:`Доступність <availability>`: Linux >= 2.6.27.
