Repository: python/python-docs-uk
Catalog: library/socket.po
Languages: uk

source: Send normal and ancillary data to the socket, gathering the non-ancillary data from a series of buffers and concatenating it into a single message. The *buffers* argument specifies the non-ancillary data as an iterable of :term:`bytes-like objects <bytes-like object>` (e.g. :class:`bytes` objects); the operating system may set a limit (:func:`~os.sysconf` value ``SC_IOV_MAX``) on the number of buffers that can be used. The *ancdata* argument specifies the ancillary data (control messages) as an iterable of zero or more tuples ``(cmsg_level, cmsg_type, cmsg_data)``, where *cmsg_level* and *cmsg_type* are integers specifying the protocol level and protocol-specific type respectively, and *cmsg_data* is a bytes-like object holding the associated data. Note that some systems (in particular, systems without :func:`CMSG_SPACE`) might support sending only one control message per call. The *flags* argument defaults to 0 and has the same meaning as for :meth:`send`. If *address* is supplied and not ``None``, it sets a destination address for the message. The return value is the number of bytes of non-ancillary data sent.
uk: Надсилайте звичайні та допоміжні дані в сокет, збираючи недопоміжні дані з ряду буферів і об’єднуючи їх в одне повідомлення. Аргумент *buffers* вказує на не допоміжні дані як ітерацію :term:`bytes-подібних об’єктів <bytes-like object>` (наприклад, :class:`bytes` об’єктів); операційна система може встановити обмеження (:func:`~os.sysconf` значення ``SC_IOV_MAX``) на кількість буферів, які можна використовувати. Аргумент *ancdata* визначає допоміжні дані (керуючі повідомлення) як ітерацію з нуля або більше кортежів ``(cmsg_level, cmsg_type, cmsg_data)``, де *cmsg_level* і *cmsg_type* є цілими числами, що визначають рівень протоколу та протокол- певного типу відповідно, а *cmsg_data* — це байтиподібний об’єкт, що містить пов’язані дані. Зверніть увагу, що деякі системи (зокрема, системи без :func:`CMSG_SPACE`) можуть підтримувати надсилання лише одного керуючого повідомлення на виклик. Аргумент *flags* за умовчанням дорівнює 0 і має те саме значення, що й для :meth:`send`. Якщо вказано *address*, а не ``None``, це встановлює адресу призначення для повідомлення. Повернене значення — це кількість байтів надісланих непоміжних даних.

source: The following function sends the list of file descriptors *fds* over an :const:`AF_UNIX` socket, on systems which support the :const:`SCM_RIGHTS` mechanism. See also :meth:`recvmsg`. ::
uk: Наступна функція надсилає список дескрипторів файлів *fds* через сокет :const:`AF_UNIX` у системах, які підтримують механізм :const:`SCM_RIGHTS`. Дивіться також :meth:`recvmsg`. ::

source: Raises an :ref:`auditing event <auditing>` ``socket.sendmsg`` with arguments ``self``, ``address``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.sendmsg`` з аргументами ``self``, ``address``.

source: Specialized version of :meth:`~socket.sendmsg` for :const:`AF_ALG` socket. Set mode, IV, AEAD associated data length and flags for :const:`AF_ALG` socket.
uk: Спеціалізована версія :meth:`~socket.sendmsg` для :const:`AF_ALG` сокета. Установіть довжину пов’язаних даних режиму, IV, AEAD і прапорці для сокета :const:`AF_ALG`.

source: Send a file until EOF is reached by using high-performance :mod:`os.sendfile` and return the total number of bytes which were sent. *file* must be a regular file object opened in binary mode. If :mod:`os.sendfile` is not available (e.g. Windows) or *file* is not a regular file :meth:`send` will be used instead. *offset* tells from where to start reading the file. If specified, *count* is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is updated on return or also in case of error in which case :meth:`file.tell() <io.IOBase.tell>` can be used to figure out the number of bytes which were sent. The socket must be of :const:`SOCK_STREAM` type. Non-blocking sockets are not supported.
uk: Надсилайте файл до досягнення EOF за допомогою високопродуктивного :mod:`os.sendfile` і повертайте загальну кількість надісланих байтів. *file* має бути звичайним файловим об’єктом, відкритим у двійковому режимі. Якщо :mod:`os.sendfile` недоступний (наприклад, Windows) або *file* не є звичайним файлом, замість нього буде використано :meth:`send`. *offset* вказує, звідки почати читання файлу. Якщо вказано, *count* — це загальна кількість байтів для передачі, а не надсилання файлу до досягнення EOF. Позиція файлу оновлюється при поверненні або також у разі помилки, у цьому випадку :meth:`file.tell() <io.IOBase.tell>` можна використовувати для визначення кількості надісланих байтів. Сокет має бути типу :const:`SOCK_STREAM`. Неблокуючі сокети не підтримуються.

source: Set the :ref:`inheritable flag <fd_inheritance>` of the socket's file descriptor or socket's handle.
uk: Установіть :ref:`inheritable flag <fd_inheritance>` дескриптора файлу сокета або дескриптора сокета.

source: Set blocking or non-blocking mode of the socket: if *flag* is false, the socket is set to non-blocking, else to blocking mode.
uk: Встановіть блокуючий або неблокуючий режим сокета: якщо *flag* має значення false, сокет встановлено в неблокуючий режим, інакше в режим блокування.

source: This method is a shorthand for certain :meth:`~socket.settimeout` calls:
uk: Цей метод є скороченням певних викликів :meth:`~socket.settimeout`:

source: ``sock.setblocking(True)`` is equivalent to ``sock.settimeout(None)``
uk: ``sock.setblocking(True)`` еквівалентно ``sock.settimeout(None)``

source: ``sock.setblocking(False)`` is equivalent to ``sock.settimeout(0.0)``
uk: ``sock.setblocking(False)`` еквівалентний ``sock.settimeout(0.0)``

source: The method no longer applies :const:`SOCK_NONBLOCK` flag on :attr:`socket.type`.
uk: Метод більше не застосовує прапор :const:`SOCK_NONBLOCK` до :attr:`socket.type`.

source: Set a timeout on blocking socket operations. The *value* argument can be a nonnegative floating point number expressing seconds, or ``None``. If a non-zero value is given, subsequent socket operations will raise a :exc:`timeout` exception if the timeout period *value* has elapsed before the operation has completed. If zero is given, the socket is put in non-blocking mode. If ``None`` is given, the socket is put in blocking mode.
uk: Встановіть тайм-аут для блокування операцій сокетів. Аргументом *value* може бути невід’ємне число з плаваючою комою, що виражає секунди, або ``None``. Якщо задано ненульове значення, наступні операції з сокетом викличуть виняток :exc:`timeout`, якщо період очікування *значення* минув до завершення операції. Якщо вказано нуль, сокет переходить у неблокуючий режим. Якщо задано ``None``, сокет переходить у режим блокування.

source: For further information, please consult the :ref:`notes on socket timeouts <socket-timeouts>`.
uk: Щоб отримати додаткову інформацію, зверніться до :ref:`приміток щодо тайм-аутів сокетів <socket-timeouts>`.

source: The method no longer toggles :const:`SOCK_NONBLOCK` flag on :attr:`socket.type`.
uk: Метод більше не вмикає прапор :const:`SOCK_NONBLOCK` на :attr:`socket.type`.

source: Set the value of the given socket option (see the Unix manual page :manpage:`setsockopt(2)`). The needed symbolic constants are defined in the :mod:`socket` module (:const:`SO_\*` etc.). The value can be an integer, ``None`` or a :term:`bytes-like object` representing a buffer. In the later case it is up to the caller to ensure that the bytestring contains the proper bits (see the optional built-in module :mod:`struct` for a way to encode C structures as bytestrings). When *value* is set to ``None``, *optlen* argument is required. It's equivalent to call :c:func:`setsockopt` C function with ``optval=NULL`` and ``optlen=optlen``.
uk: Встановіть значення даного параметра сокета (дивіться сторінку посібника Unix :manpage:`setsockopt(2)`). Необхідні символічні константи визначені в модулі :mod:`socket` (:const:`SO_\*` тощо). Значення може бути цілим числом, ``None`` або :term:`bytes-like object`, що представляє буфер. У останньому випадку абонент повинен переконатися, що байтовий рядок містить правильні біти (дивіться необов’язковий вбудований модуль :mod:`struct` для того, щоб закодувати структури C як байтові рядки). Якщо *value* має значення ``None``, аргумент *optlen* є обов’язковим. Це еквівалентно виклику :c:func:`setsockopt` функції C з ``optval=NULL`` і ``optlen=optlen``.

source: setsockopt(level, optname, None, optlen: int) form added.
uk: Додано форму setsockopt(level, optname, None, optlen: int).

source: Shut down one or both halves of the connection. If *how* is :const:`SHUT_RD`, further receives are disallowed. If *how* is :const:`SHUT_WR`, further sends are disallowed. If *how* is :const:`SHUT_RDWR`, further sends and receives are disallowed.
uk: Вимкніть одну або обидві половини з’єднання. Якщо *how* :const:`SHUT_RD`, подальші прийоми заборонені. Якщо *how* :const:`SHUT_WR`, подальші надсилання заборонені. Якщо *how* :const:`SHUT_RDWR`, подальше надсилання та отримання заборонено.

source: Duplicate a socket and prepare it for sharing with a target process. The target process must be provided with *process_id*. The resulting bytes object can then be passed to the target process using some form of interprocess communication and the socket can be recreated there using :func:`fromshare`. Once this method has been called, it is safe to close the socket since the operating system has already duplicated it for the target process.
uk: Скопіюйте сокет і підготуйте його для спільного використання з цільовим процесом. Цільовому процесу має бути надано *process_id*. Отриманий об’єкт bytes потім можна передати цільовому процесу за допомогою певної форми міжпроцесного зв’язку, а сокет можна відтворити там за допомогою :func:`fromshare`. Після виклику цього методу можна безпечно закрити сокет, оскільки операційна система вже скопіювала його для цільового процесу.

source: Note that there are no methods :meth:`read` or :meth:`write`; use :meth:`~socket.recv` and :meth:`~socket.send` without *flags* argument instead.
uk: Зверніть увагу, що немає методів :meth:`read` або :meth:`write`; замість цього використовуйте :meth:`~socket.recv` і :meth:`~socket.send` без аргументу *flags*.

source: Socket objects also have these (read-only) attributes that correspond to the values given to the :class:`~socket.socket` constructor.
uk: Об’єкти Socket також мають ці атрибути (лише для читання), які відповідають значенням, наданим конструктору :class:`~socket.socket`.

source: The socket family.
uk: Сімейство розеток.

source: The socket type.
uk: Тип розетки.

source: The socket protocol.
uk: Протокол сокета.

source: Notes on socket timeouts
uk: Примітки щодо тайм-аутів сокетів

source: A socket object can be in one of three modes: blocking, non-blocking, or timeout. Sockets are by default always created in blocking mode, but this can be changed by calling :func:`setdefaulttimeout`.
uk: Об’єкт сокета може бути в одному з трьох режимів: блокування, неблокування або час очікування. За умовчанням сокети завжди створюються в режимі блокування, але це можна змінити, викликавши :func:`setdefaulttimeout`.

source: In *blocking mode*, operations block until complete or the system returns an error (such as connection timed out).
uk: У *режимі блокування* операції блокуються до завершення або доки система не поверне повідомлення про помилку (наприклад, час очікування підключення закінчився).

source: In *non-blocking mode*, operations fail (with an error that is unfortunately system-dependent) if they cannot be completed immediately: functions from the :mod:`select` can be used to know when and whether a socket is available for reading or writing.
uk: У *неблокуючому режимі* операції не вдаються (з помилкою, яка, на жаль, залежить від системи), якщо їх не можна завершити негайно: функції з :mod:`select` можна використовувати, щоб дізнатися, коли та чи доступний сокет для читання або письмо.

source: In *timeout mode*, operations fail if they cannot be completed within the timeout specified for the socket (they raise a :exc:`timeout` exception) or if the system returns an error.
uk: У *режимі тайм-ауту* операції завершуються невдало, якщо їх не можна завершити протягом тайм-ауту, указаного для сокета (вони викликають виняток :exc:`timeout`) або якщо система повертає помилку.

source: At the operating system level, sockets in *timeout mode* are internally set in non-blocking mode. Also, the blocking and timeout modes are shared between file descriptors and socket objects that refer to the same network endpoint. This implementation detail can have visible consequences if e.g. you decide to use the :meth:`~socket.fileno()` of a socket.
uk: На рівні операційної системи сокети в *режимі тайм-ауту* внутрішньо налаштовані на неблокуючий режим. Крім того, режими блокування та тайм-ауту розподіляються між файловими дескрипторами та об’єктами сокетів, які посилаються на ту саму кінцеву точку мережі. Ця деталь впровадження може мати видимі наслідки, якщо, напр. ви вирішили використовувати :meth:`~socket.fileno()` сокета.

source: Timeouts and the ``connect`` method
uk: Час очікування та метод ``connect``

source: The :meth:`~socket.connect` operation is also subject to the timeout setting, and in general it is recommended to call :meth:`~socket.settimeout` before calling :meth:`~socket.connect` or pass a timeout parameter to :meth:`create_connection`. However, the system network stack may also return a connection timeout error of its own regardless of any Python socket timeout setting.
uk: Операція :meth:`~socket.connect` також залежить від параметра тайм-ауту, і загалом рекомендується викликати :meth:`~socket.settimeout` перед викликом :meth:`~socket.connect` або передати параметр часу очікування для :meth:`create_connection`. Однак системний мережевий стек також може повертати власну помилку очікування підключення незалежно від будь-якого параметра часу очікування сокета Python.

source: Timeouts and the ``accept`` method
uk: Час очікування та метод ``accept``

source: If :func:`getdefaulttimeout` is not :const:`None`, sockets returned by the :meth:`~socket.accept` method inherit that timeout. Otherwise, the behaviour depends on settings of the listening socket:
uk: Якщо :func:`getdefaulttimeout` не :const:`None`, сокети, повернуті методом :meth:`~socket.accept`, успадковують цей час очікування. В іншому випадку поведінка залежить від налаштувань прослуховувального сокета:

source: if the listening socket is in *blocking mode* or in *timeout mode*, the socket returned by :meth:`~socket.accept` is in *blocking mode*;
uk: якщо прослуховувальний сокет знаходиться в *режимі блокування* або в *режимі очікування*, сокет, який повертає :meth:`~socket.accept`, знаходиться в *режимі блокування*;

source: if the listening socket is in *non-blocking mode*, whether the socket returned by :meth:`~socket.accept` is in blocking or non-blocking mode is operating system-dependent. If you want to ensure cross-platform behaviour, it is recommended you manually override this setting.
uk: якщо сокет, що прослуховує, знаходиться в *неблокуючому режимі*, чи є сокет, повернутий :meth:`~socket.accept` у блокуючому чи неблокуючому режимі, залежить від операційної системи. Якщо ви хочете забезпечити кросплатформну поведінку, радимо вручну змінити це налаштування.

source: Example
uk: приклад

source: Here are four minimal example programs using the TCP/IP protocol: a server that echoes all data that it receives back (servicing only one client), and a client using it. Note that a server must perform the sequence :func:`.socket`, :meth:`~socket.bind`, :meth:`~socket.listen`, :meth:`~socket.accept` (possibly repeating the :meth:`~socket.accept` to service more than one client), while a client only needs the sequence :func:`.socket`, :meth:`~socket.connect`. Also note that the server does not :meth:`~socket.sendall`/:meth:`~socket.recv` on the socket it is listening on but on the new socket returned by :meth:`~socket.accept`.
uk: Ось чотири мінімальні приклади програм, які використовують протокол TCP/IP: сервер, який відтворює всі отримані дані (обслуговуючи лише одного клієнта), і клієнт, який його використовує. Зауважте, що сервер повинен виконати послідовність :func:`.socket`, :meth:`~socket.bind`, :meth:`~socket.listen`, :meth:`~socket.accept` (можливо, повторюючи :meth:`~socket.accept` для обслуговування більш ніж одного клієнта), тоді як клієнту потрібна лише послідовність :func:`.socket`, :meth:`~socket.connect`. Також зауважте, що сервер не :meth:`~socket.sendall`/:meth:`~socket.recv` на сокет, який він прослуховує, а на новий сокет, повернутий :meth:`~socket.accept`.

source: The first two examples support IPv4 only. ::
uk: Перші два приклади підтримують лише IPv4. ::

source: The next two examples are identical to the above two, but support both IPv4 and IPv6. The server side will listen to the first address family available (it should listen to both instead). On most of IPv6-ready systems, IPv6 will take precedence and the server may not accept IPv4 traffic. The client side will try to connect to the all addresses returned as a result of the name resolution, and sends traffic to the first one connected successfully. ::
uk: Наступні два приклади ідентичні наведеним вище, але підтримують як IPv4, так і IPv6. Сторона сервера прослуховуватиме перше доступне сімейство адрес (замість цього вона має прослуховувати обидва). У більшості систем із підтримкою IPv6 IPv6 матиме пріоритет, і сервер може не приймати трафік IPv4. Клієнтська сторона спробує підключитися до всіх адрес, отриманих у результаті розпізнавання імен, і надсилає трафік на першу з успішно підключених адрес. ::

source: The next example shows how to write a very simple network sniffer with raw sockets on Windows. The example requires administrator privileges to modify the interface::
uk: У наступному прикладі показано, як написати дуже простий мережевий сніфер із необробленими сокетами у Windows. У прикладі потрібні права адміністратора, щоб змінити інтерфейс:

source: The next example shows how to use the socket interface to communicate to a CAN network using the raw socket protocol. To use CAN with the broadcast manager protocol instead, open a socket with::
uk: У наступному прикладі показано, як використовувати інтерфейс сокета для зв’язку з мережею CAN за допомогою необробленого протоколу сокета. Щоб замість цього використовувати CAN із протоколом диспетчера трансляції, відкрийте сокет за допомогою:

source: After binding (:const:`CAN_RAW`) or connecting (:const:`CAN_BCM`) the socket, you can use the :meth:`socket.send`, and the :meth:`socket.recv` operations (and their counterparts) on the socket object as usual.
uk: Після зв’язування (:const:`CAN_RAW`) або підключення (:const:`CAN_BCM`) сокета ви можете використовувати операції :meth:`socket.send` і :meth:`socket.recv` (та їх аналоги) на об’єкті сокета, як зазвичай.

source: This last example might require special privileges::
uk: Цей останній приклад може вимагати спеціальних привілеїв:

source: Running an example several times with too small delay between executions, could lead to this error::
uk: Запуск прикладу кілька разів із занадто малою затримкою між виконаннями може призвести до цієї помилки::

source: This is because the previous execution has left the socket in a ``TIME_WAIT`` state, and can't be immediately reused.
uk: Це пов’язано з тим, що попереднє виконання залишило сокет у стані ``TIME_WAIT`` і не може бути негайно повторно використано.

source: There is a :mod:`socket` flag to set, in order to prevent this, :data:`socket.SO_REUSEADDR`::
uk: Існує прапорець :mod:`socket`, щоб запобігти цьому, :data:`socket.SO_REUSEADDR`::

source: the :data:`SO_REUSEADDR` flag tells the kernel to reuse a local socket in ``TIME_WAIT`` state, without waiting for its natural timeout to expire.
uk: прапорець :data:`SO_REUSEADDR` повідомляє ядру повторно використовувати локальний сокет у стані ``TIME_WAIT``, не чекаючи закінчення його природного часу очікування.

source: For an introduction to socket programming (in C), see the following papers:
uk: Для ознайомлення з програмуванням сокетів (на C) перегляньте такі документи:

source: *An Introductory 4.3BSD Interprocess Communication Tutorial*, by Stuart Sechrest
uk: *Вступний навчальний посібник із взаємодії між процесами 4.3BSD*, Стюарт Сехрест

source: *An Advanced 4.3BSD Interprocess Communication Tutorial*, by Samuel J. Leffler et al,
uk: *Навчальний посібник із розширеного міжпроцесного зв’язку 4.3BSD*, Семюел Дж. Леффлер та інші,

source: both in the UNIX Programmer's Manual, Supplementary Documents 1 (sections PS1:7 and PS1:8). The platform-specific reference material for the various socket-related system calls are also a valuable source of information on the details of socket semantics. For Unix, refer to the manual pages; for Windows, see the WinSock (or Winsock 2) specification. For IPv6-ready APIs, readers may want to refer to :rfc:`3493` titled Basic Socket Interface Extensions for IPv6.
uk: обидва в Посібнику програміста UNIX, Додаткові документи 1 (розділи PS1:7 та PS1:8). Довідковий матеріал для певної платформи для різноманітних системних викликів, пов’язаних із сокетами, також є цінним джерелом інформації про деталі семантики сокетів. Для Unix зверніться до сторінок посібника; для Windows дивіться специфікацію WinSock (або Winsock 2). Щодо API, готових до IPv6, читачі можуть звернутися до :rfc:`3493` під назвою Basic Socket Interface Extensions for IPv6.
