Repository: python/python-docs-uk
Catalog: library/socket.po
Languages: uk

source: Many constants of these forms, documented in the Unix documentation on sockets and/or the IP protocol, are also defined in the socket module. They are generally used in arguments to the :meth:`setsockopt` and :meth:`getsockopt` methods of socket objects. In most cases, only those symbols that are defined in the Unix header files are defined; for a few symbols, default values are provided.
uk: Багато констант цих форм, задокументованих у документації Unix щодо сокетів та/або протоколу IP, також визначені в модулі сокета. Зазвичай вони використовуються в аргументах методів :meth:`setsockopt` і :meth:`getsockopt` об'єктів сокета. У більшості випадків визначаються лише ті символи, які визначені у файлах заголовків Unix; для кількох символів надаються значення за замовчуванням.

source: ``SO_DOMAIN``, ``SO_PROTOCOL``, ``SO_PEERSEC``, ``SO_PASSSEC``, ``TCP_USER_TIMEOUT``, ``TCP_CONGESTION`` were added.
uk: Додано ``SO_DOMAIN``, ``SO_PROTOCOL``, ``SO_PEERSEC``, ``SO_PASSSEC``, ``TCP_USER_TIMEOUT``, ``TCP_CONGESTION``.

source: On Windows, ``TCP_FASTOPEN``, ``TCP_KEEPCNT`` appear if run-time Windows supports.
uk: У Windows відображаються ``TCP_FASTOPEN``, ``TCP_KEEPCNT``, якщо Windows підтримує режим виконання.

source: ``TCP_NOTSENT_LOWAT`` was added.
uk: ``TCP_NOTSENT_LOWAT`` було додано.

source: On Windows, ``TCP_KEEPIDLE``, ``TCP_KEEPINTVL`` appear if run-time Windows supports.
uk: У Windows відображаються ``TCP_KEEPIDLE``, ``TCP_KEEPINTVL``, якщо Windows підтримує режим виконання.

source: ``IP_RECVTOS`` was added. Added ``TCP_KEEPALIVE``. On MacOS this constant can be used in the same way that ``TCP_KEEPIDLE`` is used on Linux.
uk: ``IP_RECVTOS`` було додано. Додано ``TCP_KEEPALIVE``. У MacOS цю константу можна використовувати так само, як ``TCP_KEEPIDLE`` використовується в Linux.

source: Many constants of these forms, documented in the Linux documentation, are also defined in the socket module.
uk: Багато констант цих форм, задокументованих у документації Linux, також визначені в модулі сокета.

source: CAN_BCM, in the CAN protocol family, is the broadcast manager (BCM) protocol. Broadcast manager constants, documented in the Linux documentation, are also defined in the socket module.
uk: CAN_BCM, у сімействі протоколів CAN, є протоколом менеджера трансляції (BCM). Константи менеджера трансляції, задокументовані в документації Linux, також визначені в модулі сокета.

source: :ref:`Availability <availability>`: Linux >= 2.6.25.
uk: :ref:`Доступність <availability>`: Linux >= 2.6.25.

source: The :data:`CAN_BCM_CAN_FD_FRAME` flag is only available on Linux >= 4.8.
uk: Прапор :data:`CAN_BCM_CAN_FD_FRAME` доступний лише в Linux >= 4.8.

source: Enables CAN FD support in a CAN_RAW socket. This is disabled by default. This allows your application to send both CAN and CAN FD frames; however, you must accept both CAN and CAN FD frames when reading from the socket.
uk: Вмикає підтримку CAN FD у гнізді CAN_RAW. За замовчуванням це вимкнено. Це дозволяє вашій програмі надсилати кадри CAN і CAN FD; однак під час читання з роз’єму ви повинні приймати як CAN, так і CAN FD кадри.

source: This constant is documented in the Linux documentation.
uk: Ця константа задокументована в документації Linux.

source: :ref:`Availability <availability>`: Linux >= 3.6.
uk: :ref:`Доступність <availability>`: Linux >= 3.6.

source: Joins the applied CAN filters such that only CAN frames that match all given CAN filters are passed to user space.
uk: Об’єднує застосовані фільтри CAN, щоб у простір користувача передавалися лише кадри CAN, які відповідають усім наданим фільтрам CAN.

source: :ref:`Availability <availability>`: Linux >= 4.1.
uk: :ref:`Доступність <availability>`: Linux >= 4.1.

source: CAN_ISOTP, in the CAN protocol family, is the ISO-TP (ISO 15765-2) protocol. ISO-TP constants, documented in the Linux documentation.
uk: CAN_ISOTP у сімействі протоколів CAN є протоколом ISO-TP (ISO 15765-2). Константи ISO-TP, задокументовані в документації Linux.

source: CAN_J1939, in the CAN protocol family, is the SAE J1939 protocol. J1939 constants, documented in the Linux documentation.
uk: CAN_J1939 у сімействі протоколів CAN є протоколом SAE J1939. Константи J1939, задокументовані в документації Linux.

source: :ref:`Availability <availability>`: Linux >= 5.4.
uk: :ref:`Доступність <availability>`: Linux >= 5.4.

source: :ref:`Availability <availability>`: Linux >= 2.2.
uk: :ref:`Доступність <availability>`: Linux >= 2.2.

source: :ref:`Availability <availability>`: Linux >= 2.6.30.
uk: :ref:`Доступність <availability>`: Linux >= 2.6.30.

source: Constants for Windows' WSAIoctl(). The constants are used as arguments to the :meth:`~socket.socket.ioctl` method of socket objects.
uk: Константи для Windows WSAIoctl(). Константи використовуються як аргументи методу :meth:`~socket.socket.ioctl` об’єктів сокета.

source: ``SIO_LOOPBACK_FAST_PATH`` was added.
uk: ``SIO_LOOPBACK_FAST_PATH`` було додано.

source: TIPC related constants, matching the ones exported by the C socket API. See the TIPC documentation for more information.
uk: Константи, пов’язані з TIPC, що збігаються з тими, які експортує API сокета C. Додаткову інформацію див. у документації TIPC.

source: Constants for Linux Kernel cryptography.
uk: Константи для криптографії ядра Linux.

source: :ref:`Availability <availability>`: Linux >= 2.6.38.
uk: :ref:`Доступність <availability>`: Linux >= 2.6.38.

source: Constants for Linux host/guest communication.
uk: Константи для зв’язку хост/гость Linux.

source: :ref:`Availability <availability>`: Linux >= 4.8.
uk: :ref:`Доступність <availability>`: Linux >= 4.8.

source: :ref:`Availability <availability>`: BSD, macOS.
uk: :ref:`Наявність <availability>`: BSD, macOS.

source: This constant contains a boolean value which indicates if IPv6 is supported on this platform.
uk: Ця константа містить логічне значення, яке вказує, чи підтримується IPv6 на цій платформі.

source: These are string constants containing Bluetooth addresses with special meanings. For example, :const:`BDADDR_ANY` can be used to indicate any address when specifying the binding socket with :const:`BTPROTO_RFCOMM`.
uk: Це рядкові константи, що містять адреси Bluetooth зі спеціальними значеннями. Наприклад, :const:`BDADDR_ANY` можна використовувати для вказівки будь-якої адреси, коли вказується сокет прив’язки за допомогою :const:`BTPROTO_RFCOMM`.

source: For use with :const:`BTPROTO_HCI`. :const:`HCI_FILTER` is not available for NetBSD or DragonFlyBSD. :const:`HCI_TIME_STAMP` and :const:`HCI_DATA_DIR` are not available for FreeBSD, NetBSD, or DragonFlyBSD.
uk: Для використання з :const:`BTPROTO_HCI`. :const:`HCI_FILTER` недоступний для NetBSD або DragonFlyBSD. :const:`HCI_TIME_STAMP` і :const:`HCI_DATA_DIR` недоступні для FreeBSD, NetBSD або DragonFlyBSD.

source: Constant for Qualcomm's IPC router protocol, used to communicate with service providing remote processors.
uk: Константа для протоколу маршрутизатора IPC Qualcomm, який використовується для зв’язку з віддаленими процесорами, що надають послуги.

source: :ref:`Availability <availability>`: Linux >= 4.7.
uk: :ref:`Доступність <availability>`: Linux >= 4.7.

source: Functions
uk: Функції

source: Creating sockets
uk: Створення сокетів

source: The following functions all create :ref:`socket objects <socket-objects>`.
uk: Усі наступні функції створюють :ref:`об’єкти socket <socket-objects>`.

source: Create a new socket using the given address family, socket type and protocol number. The address family should be :const:`AF_INET` (the default), :const:`AF_INET6`, :const:`AF_UNIX`, :const:`AF_CAN`, :const:`AF_PACKET`, or :const:`AF_RDS`. The socket type should be :const:`SOCK_STREAM` (the default), :const:`SOCK_DGRAM`, :const:`SOCK_RAW` or perhaps one of the other ``SOCK_`` constants. The protocol number is usually zero and may be omitted or in the case where the address family is :const:`AF_CAN` the protocol should be one of :const:`CAN_RAW`, :const:`CAN_BCM`, :const:`CAN_ISOTP` or :const:`CAN_J1939`.
uk: Створіть новий сокет, використовуючи вказане сімейство адрес, тип сокета та номер протоколу. Сімейство адрес має бути :const:`AF_INET` (за замовчуванням), :const:`AF_INET6`, :const:`AF_UNIX`, :const:`AF_CAN`, :const:`AF_PACKET` або :const:`AF_RDS`. Тип сокета має бути :const:`SOCK_STREAM` (за замовчуванням), :const:`SOCK_DGRAM`, :const:`SOCK_RAW` або, можливо, одна з інших констант ``SOCK_``. Номер протоколу зазвичай дорівнює нулю і може бути пропущений або у випадку, коли сімейство адрес :const:`AF_CAN`, протокол має бути одним із :const:`CAN_RAW`, :const:`CAN_BCM`, :const:`CAN_ISOTP` або :const:`CAN_J1939`.

source: If *fileno* is specified, the values for *family*, *type*, and *proto* are auto-detected from the specified file descriptor. Auto-detection can be overruled by calling the function with explicit *family*, *type*, or *proto* arguments. This only affects how Python represents e.g. the return value of :meth:`socket.getpeername` but not the actual OS resource. Unlike :func:`socket.fromfd`, *fileno* will return the same socket and not a duplicate. This may help close a detached socket using :meth:`socket.close()`.
uk: Якщо вказано *fileno*, значення для *family*, *type* і *proto* автоматично визначаються з указаного дескриптора файлу. Автоматичне визначення можна скасувати, викликавши функцію з явними аргументами *family*, *type* або *proto*. Це впливає лише на те, як Python представляє, наприклад. повертається значення :meth:`socket.getpeername`, але не фактичний ресурс ОС. На відміну від :func:`socket.fromfd`, *fileno* поверне той самий сокет, а не дублікат. Це може допомогти закрити відокремлений сокет за допомогою :meth:`socket.close()`.

source: The newly created socket is :ref:`non-inheritable <fd_inheritance>`.
uk: Новостворений сокет :ref:`не успадковується <fd_inheritance>`.

source: Raises an :ref:`auditing event <auditing>` ``socket.__new__`` with arguments ``self``, ``family``, ``type``, ``protocol``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.__new__`` з аргументами ``self``, ``family``, ``type``, ``protocol``.

source: The AF_CAN family was added. The AF_RDS family was added.
uk: Додано сімейство AF_CAN. Додано сімейство AF_RDS.

source: The CAN_BCM protocol was added.
uk: Додано протокол CAN_BCM.

source: The returned socket is now non-inheritable.
uk: Повернений сокет тепер не успадковується.

source: The CAN_ISOTP protocol was added.
uk: Додано протокол CAN_ISOTP.

source: will still create a non-blocking socket on OSes that support ``SOCK_NONBLOCK``, but ``sock.type`` will be set to ``socket.SOCK_STREAM``.
uk: усе одно створить неблокуючий сокет в ОС, які підтримують ``SOCK_NONBLOCK``, але ``sock.type`` буде встановлено на ``socket.SOCK_STREAM``.

source: The CAN_J1939 protocol was added.
uk: Додано протокол CAN_J1939.

source: The IPPROTO_MPTCP protocol was added.
uk: Додано протокол IPPROTO_MPTCP.

source: Build a pair of connected socket objects using the given address family, socket type, and protocol number. Address family, socket type, and protocol number are as for the :func:`.socket` function above. The default family is :const:`AF_UNIX` if defined on the platform; otherwise, the default is :const:`AF_INET`.
uk: Створіть пару з’єднаних об’єктів сокета, використовуючи вказане сімейство адрес, тип сокета та номер протоколу. Родина адрес, тип сокета та номер протоколу такі ж, як для функції :func:`.socket` вище. Сімейство за замовчуванням :const:`AF_UNIX`, якщо визначено на платформі; інакше за замовчуванням :const:`AF_INET`.

source: The newly created sockets are :ref:`non-inheritable <fd_inheritance>`.
uk: Новостворені сокети :ref:`не успадковуються <fd_inheritance>`.

source: The returned socket objects now support the whole socket API, rather than a subset.
uk: Повернені об’єкти сокета тепер підтримують весь API сокета, а не його підмножину.

source: The returned sockets are now non-inheritable.
uk: Повернені сокети тепер не успадковуються.

source: Windows support added.
uk: Додано підтримку Windows.

source: Connect to a TCP service listening on the internet *address* (a 2-tuple ``(host, port)``), and return the socket object. This is a higher-level function than :meth:`socket.connect`: if *host* is a non-numeric hostname, it will try to resolve it for both :data:`AF_INET` and :data:`AF_INET6`, and then try to connect to all possible addresses in turn until a connection succeeds. This makes it easy to write clients that are compatible to both IPv4 and IPv6.
uk: Підключіться до служби TCP, яка прослуховує *адресу* в Інтернеті (2-кортеж ``(хост, порт)``) і поверніть об’єкт сокета. Це функція вищого рівня, ніж :meth:`socket.connect`: якщо *host* є нечисловим ім’ям хоста, вона намагатиметься вирішити його як для :data:`AF_INET`, так і для :data:`AF_INET6`, а потім спробуйте підключитися до всіх можливих адрес по черзі, доки підключення не вдасться. Це полегшує написання клієнтів, сумісних як з IPv4, так і з IPv6.

source: Passing the optional *timeout* parameter will set the timeout on the socket instance before attempting to connect. If no *timeout* is supplied, the global default timeout setting returned by :func:`getdefaulttimeout` is used.
uk: Передача додаткового параметра *timeout* встановить час очікування для екземпляра сокета перед спробою підключення. Якщо *тайм-аут* не вказано, використовується глобальне налаштування тайм-ауту за умовчанням, яке повертає :func:`getdefaulttimeout`.

source: If supplied, *source_address* must be a 2-tuple ``(host, port)`` for the socket to bind to as its source address before connecting. If host or port are '' or 0 respectively the OS default behavior will be used.
uk: Якщо надано, *source_address* має бути 2-кортежем ``(хост, порт)``, щоб сокет прив’язувався до своєї адреси джерела перед підключенням. Якщо хост або порт мають значення '' або 0 відповідно, буде використано типову поведінку ОС.

source: *source_address* was added.
uk: *вихідна_адреса* була додана.

source: Convenience function which creates a TCP socket bound to *address* (a 2-tuple ``(host, port)``) and return the socket object.
uk: Зручна функція, яка створює TCP-сокет, прив’язаний до *адреси* (2-кортеж ``(хост, порт)``) і повертає об’єкт сокета.

source: *family* should be either :data:`AF_INET` or :data:`AF_INET6`. *backlog* is the queue size passed to :meth:`socket.listen`; when ``0`` a default reasonable value is chosen. *reuse_port* dictates whether to set the :data:`SO_REUSEPORT` socket option.
uk: *family* має бути :data:`AF_INET` або :data:`AF_INET6`. *backlog* — це розмір черги, переданий до :meth:`socket.listen`; коли ``0`` вибрано розумне значення за умовчанням. *reuse_port* визначає, чи встановлювати параметр сокета :data:`SO_REUSEPORT`.

source: If *dualstack_ipv6* is true and the platform supports it the socket will be able to accept both IPv4 and IPv6 connections, else it will raise :exc:`ValueError`. Most POSIX platforms and Windows are supposed to support this functionality. When this functionality is enabled the address returned by :meth:`socket.getpeername` when an IPv4 connection occurs will be an IPv6 address represented as an IPv4-mapped IPv6 address. If *dualstack_ipv6* is false it will explicitly disable this functionality on platforms that enable it by default (e.g. Linux). This parameter can be used in conjunction with :func:`has_dualstack_ipv6`:
uk: Якщо *dualstack_ipv6* має значення true і платформа підтримує його, сокет зможе приймати як з’єднання IPv4, так і IPv6, інакше виникне :exc:`ValueError`. Більшість платформ POSIX і Windows повинні підтримувати цю функцію. Якщо цю функцію ввімкнено, адреса, яку повертає :meth:`socket.getpeername` під час встановлення з’єднання IPv4, буде адресою IPv6, представленою як адреса IPv6, відображена в IPv4. Якщо *dualstack_ipv6* має значення false, це явно вимикає цю функцію на платформах, які ввімкнули її за замовчуванням (наприклад, Linux). Цей параметр можна використовувати в поєднанні з :func:`has_dualstack_ipv6`:

source: On POSIX platforms the :data:`SO_REUSEADDR` socket option is set in order to immediately reuse previous sockets which were bound on the same *address* and remained in TIME_WAIT state.
uk: На платформах POSIX параметр сокета :data:`SO_REUSEADDR` встановлено для негайного повторного використання попередніх сокетів, які були прив’язані до тієї самої *адреси* та залишалися в стані TIME_WAIT.

source: Return ``True`` if the platform supports creating a TCP socket which can handle both IPv4 and IPv6 connections.
uk: Повертає ``True``, якщо платформа підтримує створення TCP-сокета, який може обробляти з’єднання IPv4 і IPv6.

source: Duplicate the file descriptor *fd* (an integer as returned by a file object's :meth:`fileno` method) and build a socket object from the result. Address family, socket type and protocol number are as for the :func:`.socket` function above. The file descriptor should refer to a socket, but this is not checked --- subsequent operations on the object may fail if the file descriptor is invalid. This function is rarely needed, but can be used to get or set socket options on a socket passed to a program as standard input or output (such as a server started by the Unix inet daemon). The socket is assumed to be in blocking mode.
uk: Скопіюйте файловий дескриптор *fd* (ціле число, яке повертає метод :meth:`fileno` файлового об’єкта) і створіть об’єкт сокета з результату. Родина адрес, тип сокета та номер протоколу такі ж, як для функції :func:`.socket` вище. Дескриптор файлу має посилатися на сокет, але це не перевірено --- подальші операції з об’єктом можуть завершитися помилкою, якщо дескриптор файлу недійсний. Ця функція рідко потрібна, але її можна використовувати для отримання або встановлення параметрів сокета для сокета, який передається програмі як стандартний ввід або вихід (наприклад, сервер, запущений демоном Unix inet). Передбачається, що розетка знаходиться в режимі блокування.

source: Instantiate a socket from data obtained from the :meth:`socket.share` method. The socket is assumed to be in blocking mode.
uk: Створіть екземпляр сокета з даних, отриманих з методу :meth:`socket.share`. Передбачається, що розетка знаходиться в режимі блокування.

source: :ref:`Availability <availability>`: Windows.
uk: :ref:`Наявність <availability>`: Windows.

source: This is a Python type object that represents the socket object type. It is the same as ``type(socket(...))``.
uk: Це об’єкт типу Python, який представляє тип об’єкта сокета. Це те саме, що ``type(socket(...))``.

source: Other functions
uk: Інші функції

source: The :mod:`socket` module also offers various network-related services:
uk: Модуль :mod:`socket` також пропонує різноманітні мережеві служби:

source: Close a socket file descriptor. This is like :func:`os.close`, but for sockets. On some platforms (most noticeable Windows) :func:`os.close` does not work for socket file descriptors.
uk: Закрийте дескриптор файлу сокета. Це як :func:`os.close`, але для сокетів. На деяких платформах (найбільш помітна Windows) :func:`os.close` не працює для дескрипторів файлів сокетів.

source: Translate the *host*/*port* argument into a sequence of 5-tuples that contain all the necessary arguments for creating a socket connected to that service. *host* is a domain name, a string representation of an IPv4/v6 address or ``None``. *port* is a string service name such as ``'http'``, a numeric port number or ``None``. By passing ``None`` as the value of *host* and *port*, you can pass ``NULL`` to the underlying C API.
uk: Переведіть аргумент *host*/*port* у послідовність із 5 кортежів, які містять усі необхідні аргументи для створення сокета, підключеного до цієї служби. *host* – це доменне ім’я, рядкове представлення адреси IPv4/v6 або ``None``. *порт* — це рядкова назва служби, наприклад ``'http'``, числовий номер порту або ``None``. Передаючи ``None`` як значення *host* і *port*, ви можете передати ``NULL`` базовому C API.

source: The *family*, *type* and *proto* arguments can be optionally specified in order to narrow the list of addresses returned. Passing zero as a value for each of these arguments selects the full range of results. The *flags* argument can be one or several of the ``AI_*`` constants, and will influence how results are computed and returned. For example, :const:`AI_NUMERICHOST` will disable domain name resolution and will raise an error if *host* is a domain name.
uk: Аргументи *сімейство*, *тип* і *прото* можна додатково вказати, щоб звузити список адрес, що повертаються. Передача нуля як значення для кожного з цих аргументів вибирає повний діапазон результатів. Аргумент *flags* може бути однією або декількома константами ``AI_*`` і впливатиме на спосіб обчислення та повернення результатів. Наприклад, :const:`AI_NUMERICHOST` вимкне розпізнавання доменного імені та викличе помилку, якщо *host* є доменним іменем.

source: The function returns a list of 5-tuples with the following structure:
uk: Функція повертає список із 5-ти кортежів із такою структурою:

source: ``(family, type, proto, canonname, sockaddr)``
uk: ``(сімейство, тип, прото, canonname, sockaddr)``

source: In these tuples, *family*, *type*, *proto* are all integers and are meant to be passed to the :func:`.socket` function. *canonname* will be a string representing the canonical name of the *host* if :const:`AI_CANONNAME` is part of the *flags* argument; else *canonname* will be empty. *sockaddr* is a tuple describing a socket address, whose format depends on the returned *family* (a ``(address, port)`` 2-tuple for :const:`AF_INET`, a ``(address, port, flowinfo, scope_id)`` 4-tuple for :const:`AF_INET6`), and is meant to be passed to the :meth:`socket.connect` method.
uk: У цих кортежах усі *family*, *type*, *proto* є цілими числами, і вони призначені для передачі у функцію :func:`.socket`. *canonname* буде рядком, що представлятиме канонічне ім’я *хосту*, якщо :const:`AI_CANONNAME` є частиною аргументу *flags*; інакше *canonname* буде порожнім. *sockaddr* — це кортеж, що описує адресу сокета, формат якого залежить від повернутого *сімейства* (2-кортеж ``(адреса, порт)`` для :const:`AF_INET`, ``(адреса, порт, flowinfo, scope_id)`` 4-кортеж для :const:`AF_INET6`), і призначений для передачі в метод :meth:`socket.connect`.

source: Raises an :ref:`auditing event <auditing>` ``socket.getaddrinfo`` with arguments ``host``, ``port``, ``family``, ``type``, ``protocol``.
uk: Викликає :ref:`подію аудиту <auditing>` ``socket.getaddrinfo`` з аргументами ``хост``, ``порт``, ``сімейство``, ``тип``, ``протокол``.

source: The following example fetches address information for a hypothetical TCP connection to ``example.org`` on port 80 (results may differ on your system if IPv6 isn't enabled)::
uk: У наступному прикладі отримується інформація про адресу для гіпотетичного TCP-з’єднання з ``example.org`` на порту 80 (результати можуть відрізнятися у вашій системі, якщо IPv6 не ввімкнено):

source: parameters can now be passed using keyword arguments.
uk: параметри тепер можна передавати за допомогою аргументів ключових слів.

source: for IPv6 multicast addresses, string representing an address will not contain ``%scope_id`` part.
uk: для багатоадресних адрес IPv6 рядок, що представляє адресу, не міститиме частину ``%scope_id``.
