Repository: python/python-docs-uk
Catalog: library/sqlite3.po
Languages: uk

source: Passing :const:`None` as *trace_callback* will disable the trace callback.
uk: Передача :const:`None` як *trace_callback* вимкне зворотний виклик трасування.

source: Exceptions raised in the trace callback are not propagated. As a development and debugging aid, use :meth:`~sqlite3.enable_callback_tracebacks` to enable printing tracebacks from exceptions raised in the trace callback.
uk: Винятки, викликані зворотним викликом трасування, не поширюються. Як допомога при розробці та налагодженні використовуйте :meth:`~sqlite3.enable_callback_tracebacks`, щоб увімкнути друк трасування з винятків, викликаних у зворотному виклику трасування.

source: This routine allows/disallows the SQLite engine to load SQLite extensions from shared libraries. SQLite extensions can define new functions, aggregates or whole new virtual table implementations. One well-known extension is the fulltext-search extension distributed with SQLite.
uk: Ця процедура дозволяє/забороняє механізму SQLite завантажувати розширення SQLite зі спільних бібліотек. Розширення SQLite можуть визначати нові функції, агрегати або зовсім нові реалізації віртуальних таблиць. Одним із відомих розширень є розширення повнотекстового пошуку, що поширюється разом із SQLite.

source: Loadable extensions are disabled by default. See [#f1]_.
uk: Завантажувані розширення вимкнено за умовчанням. Див. [#f1]_.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.enable_load_extension`` with arguments ``connection``, ``enabled``.
uk: Викликає :ref:`подію аудиту <auditing>` ``sqlite3.enable_load_extension`` з аргументами ``connection``, ``enabled``.

source: Added the ``sqlite3.enable_load_extension`` auditing event.
uk: Додано подію аудиту sqlite3.enable_load_extension.

source: This routine loads an SQLite extension from a shared library. You have to enable extension loading with :meth:`enable_load_extension` before you can use this routine.
uk: Ця процедура завантажує розширення SQLite із спільної бібліотеки. Ви повинні ввімкнути завантаження розширення за допомогою :meth:`enable_load_extension`, перш ніж ви зможете використовувати цю процедуру.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.load_extension`` with arguments ``connection``, ``path``.
uk: Викликає :ref:`подію аудиту <auditing>` ``sqlite3.load_extension`` з аргументами ``connection``, ``path``.

source: Added the ``sqlite3.load_extension`` auditing event.
uk: Додано подію аудиту ``sqlite3.load_extension``.

source: You can change this attribute to a callable that accepts the cursor and the original row as a tuple and will return the real result row. This way, you can implement more advanced ways of returning results, such as returning an object that can also access columns by name.
uk: Ви можете змінити цей атрибут на виклик, який приймає курсор і оригінальний рядок як кортеж і повертатиме справжній рядок результату. Таким чином ви можете реалізувати більш просунуті способи повернення результатів, наприклад повернення об’єкта, який також може отримати доступ до стовпців за назвою.

source: If returning a tuple doesn't suffice and you want name-based access to columns, you should consider setting :attr:`row_factory` to the highly-optimized :class:`sqlite3.Row` type. :class:`Row` provides both index-based and case-insensitive name-based access to columns with almost no memory overhead. It will probably be better than your own custom dictionary-based approach or even a db_row based solution.
uk: Якщо повернення кортежу недостатньо, і ви бажаєте отримати доступ до стовпців на основі імен, вам слід розглянути можливість налаштування :attr:`row_factory` високооптимізованого типу :class:`sqlite3.Row`. :class:`Row` забезпечує доступ до стовпців як на основі індексу, так і на основі імен без урахування регістру майже без витрат пам’яті. Ймовірно, це буде краще, ніж ваш власний підхід на основі словника або навіть рішення на основі db_row.

source: Using this attribute you can control what objects are returned for the ``TEXT`` data type. By default, this attribute is set to :class:`str` and the :mod:`sqlite3` module will return :class:`str` objects for ``TEXT``. If you want to return :class:`bytes` instead, you can set it to :class:`bytes`.
uk: Використовуючи цей атрибут, ви можете контролювати, які об’єкти повертаються для типу даних ``ТЕКСТ``. За замовчуванням цей атрибут має значення :class:`str`, а модуль :mod:`sqlite3` повертатиме об’єкти :class:`str` для ``TEXT``. Якщо замість цього ви хочете повернути :class:`bytes`, ви можете встановити значення :class:`bytes`.

source: You can also set it to any other callable that accepts a single bytestring parameter and returns the resulting object.
uk: Ви також можете встановити для нього будь-який інший виклик, який приймає один параметр bytestring і повертає результуючий об’єкт.

source: See the following example code for illustration:
uk: Перегляньте наведений нижче приклад коду для ілюстрації:

source: Returns the total number of database rows that have been modified, inserted, or deleted since the database connection was opened.
uk: Повертає загальну кількість рядків бази даних, які було змінено, вставлено або видалено з моменту відкриття підключення до бази даних.

source: Returns an iterator to dump the database in an SQL text format. Useful when saving an in-memory database for later restoration. This function provides the same capabilities as the :kbd:`.dump` command in the :program:`sqlite3` shell.
uk: Повертає ітератор для створення дампу бази даних у текстовому форматі SQL. Корисно під час збереження бази даних у пам’яті для подальшого відновлення. Ця функція надає ті самі можливості, що й команда :kbd:`.dump` в оболонці :program:`sqlite3`.

source: Example::
uk: Приклад::

source: This method makes a backup of an SQLite database even while it's being accessed by other clients, or concurrently by the same connection. The copy will be written into the mandatory argument *target*, that must be another :class:`Connection` instance.
uk: Цей метод створює резервну копію бази даних SQLite, навіть коли до неї звертаються інші клієнти або одночасно через те саме з’єднання. Копія буде записана в обов’язковий аргумент *target*, який має бути іншим екземпляром :class:`Connection`.

source: By default, or when *pages* is either ``0`` or a negative integer, the entire database is copied in a single step; otherwise the method performs a loop copying up to *pages* pages at a time.
uk: За замовчуванням або коли *pages* має значення ``0`` або ціле від’ємне число, вся база даних копіюється за один крок; інакше метод виконує цикл, копіюючи до *pages* сторінок за раз.

source: If *progress* is specified, it must either be ``None`` or a callable object that will be executed at each iteration with three integer arguments, respectively the *status* of the last iteration, the *remaining* number of pages still to be copied and the *total* number of pages.
uk: Якщо вказано *прогрес*, він має бути ``None`` або об’єктом, що викликається, який виконуватиметься на кожній ітерації з трьома цілими аргументами, відповідно *статусом* останньої ітерації, *кількістю сторінок, що залишилася* для копіювання та *загальна* кількість сторінок.

source: The *name* argument specifies the database name that will be copied: it must be a string containing either ``"main"``, the default, to indicate the main database, ``"temp"`` to indicate the temporary database or the name specified after the ``AS`` keyword in an ``ATTACH DATABASE`` statement for an attached database.
uk: Аргумент *name* визначає назву бази даних, яку буде скопійовано: це має бути рядок, що містить або ``"main"``, за замовчуванням, для позначення основної бази даних, ``"temp"`` для позначення тимчасової бази даних або ім’я, указане після ключового слова ``AS`` в операторі ``ATTACH DATABASE`` для приєднаної бази даних.

source: The *sleep* argument specifies the number of seconds to sleep by between successive attempts to backup remaining pages, can be specified either as an integer or a floating point value.
uk: Аргумент *sleep* визначає кількість секунд для сну між послідовними спробами резервного копіювання сторінок, що залишилися, і може бути вказаний у вигляді цілого числа або значення з плаваючою комою.

source: Example 1, copy an existing database into another::
uk: Приклад 1, копіювання існуючої бази даних в іншу::

source: Example 2, copy an existing database into a transient copy::
uk: Приклад 2, копіювання існуючої бази даних у тимчасову копію::

source: Cursor Objects
uk: Об'єкти курсора

source: A :class:`Cursor` instance has the following attributes and methods.
uk: Екземпляр :class:`Cursor` має такі атрибути та методи.

source: Executes an SQL statement. Values may be bound to the statement using :ref:`placeholders <sqlite3-placeholders>`.
uk: Виконує оператор SQL. Значення можуть бути прив’язані до оператора за допомогою :ref:`placeholders <sqlite3-placeholders>`.

source: Executes a :ref:`parameterized <sqlite3-placeholders>` SQL command against all parameter sequences or mappings found in the sequence *seq_of_parameters*. The :mod:`sqlite3` module also allows using an :term:`iterator` yielding parameters instead of a sequence.
uk: Виконує :ref:`параметризовану <sqlite3-placeholders>` команду SQL проти всіх послідовностей параметрів або зіставлень, знайдених у послідовності *seq_of_parameters*. Модуль :mod:`sqlite3` також дозволяє використовувати :term:`iterator` вихідні параметри замість послідовності.

source: Here's a shorter example using a :term:`generator`:
uk: Ось коротший приклад використання :term:`generator`:

source: This is a nonstandard convenience method for executing multiple SQL statements at once. It issues a ``COMMIT`` statement first, then executes the SQL script it gets as a parameter. This method disregards :attr:`isolation_level`; any transaction control must be added to *sql_script*.
uk: Це нестандартний зручний метод для одночасного виконання кількох операторів SQL. Спочатку він видає оператор ``COMMIT``, а потім виконує сценарій SQL, який отримує як параметр. Цей метод ігнорує :attr:`isolation_level`; будь-який контроль транзакцій має бути доданий до *sql_script*.

source: *sql_script* can be an instance of :class:`str`.
uk: *sql_script* може бути екземпляром :class:`str`.

source: Fetches the next row of a query result set, returning a single sequence, or :const:`None` when no more data is available.
uk: Отримує наступний рядок із набору результатів запиту, повертаючи одну послідовність або :const:`None`, якщо більше немає даних.

source: Fetches the next set of rows of a query result, returning a list. An empty list is returned when no more rows are available.
uk: Отримує наступний набір рядків результату запиту, повертаючи список. Порожній список повертається, якщо більше немає рядків.

source: The number of rows to fetch per call is specified by the *size* parameter. If it is not given, the cursor's arraysize determines the number of rows to be fetched. The method should try to fetch as many rows as indicated by the size parameter. If this is not possible due to the specified number of rows not being available, fewer rows may be returned.
uk: Кількість рядків, які потрібно отримати за виклик, визначається параметром *size*. Якщо його не вказано, розмір масиву курсору визначає кількість рядків, які потрібно отримати. Метод повинен спробувати отримати стільки рядків, скільки вказано параметром size. Якщо це неможливо через відсутність зазначеної кількості рядків, може бути повернуто менше рядків.

source: Note there are performance considerations involved with the *size* parameter. For optimal performance, it is usually best to use the arraysize attribute. If the *size* parameter is used, then it is best for it to retain the same value from one :meth:`fetchmany` call to the next.
uk: Зауважте, що з параметром *size* пов’язані міркування щодо продуктивності. Для оптимальної продуктивності зазвичай найкраще використовувати атрибут arraysize. Якщо використовується параметр *size*, то найкраще, щоб він зберігав те саме значення від одного виклику :meth:`fetchmany` до наступного.

source: Fetches all (remaining) rows of a query result, returning a list. Note that the cursor's arraysize attribute can affect the performance of this operation. An empty list is returned when no rows are available.
uk: Отримує всі (решту) рядки результату запиту, повертаючи список. Зауважте, що атрибут arraysize курсора може вплинути на продуктивність цієї операції. Якщо немає доступних рядків, повертається порожній список.

source: Close the cursor now (rather than whenever ``__del__`` is called).
uk: Закрийте курсор зараз (а не під час кожного виклику ``__del__``).

source: The cursor will be unusable from this point forward; a :exc:`ProgrammingError` exception will be raised if any operation is attempted with the cursor.
uk: Курсор стане непридатним для використання з цього моменту; виняток :exc:`ProgrammingError` буде викликано, якщо будь-яка операція буде виконана з курсором.

source: Required by the DB-API. Does nothing in :mod:`sqlite3`.
uk: Потрібний для DB-API. Нічого не робить у :mod:`sqlite3`.

source: Although the :class:`Cursor` class of the :mod:`sqlite3` module implements this attribute, the database engine's own support for the determination of "rows affected"/"rows selected" is quirky.
uk: Незважаючи на те, що клас :class:`Cursor` модуля :mod:`sqlite3` реалізує цей атрибут, власна підтримка механізмом бази даних для визначення "рядків, які постраждали"/"рядків, які вибрано", є дивною.

source: For :meth:`executemany` statements, the number of modifications are summed up into :attr:`rowcount`.
uk: Для операторів :meth:`executemany` кількість модифікацій підсумовується в :attr:`rowcount`.

source: As required by the Python DB API Spec, the :attr:`rowcount` attribute "is -1 in case no ``executeXX()`` has been performed on the cursor or the rowcount of the last operation is not determinable by the interface". This includes ``SELECT`` statements because we cannot determine the number of rows a query produced until all rows were fetched.
uk: Згідно зі специфікацією Python DB API, атрибут :attr:`rowcount` дорівнює -1, якщо над курсором не було виконано ``executeXX()`` або кількість рядків останньої операції не визначається інтерфейсом ". Це включає оператори ``SELECT``, оскільки ми не можемо визначити кількість рядків, створених запитом, доки не буде вилучено всі рядки.

source: This read-only attribute provides the row id of the last inserted row. It is only updated after successful ``INSERT`` or ``REPLACE`` statements using the :meth:`execute` method. For other statements, after :meth:`executemany` or :meth:`executescript`, or if the insertion failed, the value of ``lastrowid`` is left unchanged. The initial value of ``lastrowid`` is :const:`None`.
uk: Цей атрибут лише для читання надає ідентифікатор останнього вставленого рядка. Він оновлюється лише після успішних операторів ``INSERT`` або ``REPLACE`` за допомогою методу :meth:`execute`. Для інших операторів після :meth:`executemany` або :meth:`executescript`, або якщо вставка не вдалася, значення ``lastrowid`` залишається незмінним. Початкове значення ``lastrowid``: :const:`None`.

source: Inserts into ``WITHOUT ROWID`` tables are not recorded.
uk: Вставки в таблиці ``БЕЗ ROWID`` не записуються.

source: Added support for the ``REPLACE`` statement.
uk: Додано підтримку оператора REPLACE.

source: Read/write attribute that controls the number of rows returned by :meth:`fetchmany`. The default value is 1 which means a single row would be fetched per call.
uk: Атрибут читання/запису, який контролює кількість рядків, які повертає :meth:`fetchmany`. Значення за замовчуванням дорівнює 1, що означає, що за виклик буде отримано один рядок.

source: This read-only attribute provides the column names of the last query. To remain compatible with the Python DB API, it returns a 7-tuple for each column where the last six items of each tuple are :const:`None`.
uk: Цей атрибут лише для читання надає назви стовпців останнього запиту. Щоб залишатися сумісним з API Python DB, він повертає 7-кортеж для кожного стовпця, де останні шість елементів кожного кортежу є :const:`None`.

source: It is set for ``SELECT`` statements without any matching rows as well.
uk: Він також встановлений для операторів ``SELECT`` без будь-яких відповідних рядків.

source: This read-only attribute provides the SQLite database :class:`Connection` used by the :class:`Cursor` object. A :class:`Cursor` object created by calling :meth:`con.cursor() <Connection.cursor>` will have a :attr:`connection` attribute that refers to *con*::
uk: Цей атрибут лише для читання надає базу даних SQLite :class:`Connection`, яку використовує об’єкт :class:`Cursor`. Об’єкт :class:`Cursor`, створений викликом :meth:`con.cursor() <Connection.cursor>`, матиме атрибут :attr:`connection`, який посилається на *con*::

source: Row Objects
uk: Об'єкти рядка

source: A :class:`Row` instance serves as a highly optimized :attr:`~Connection.row_factory` for :class:`Connection` objects. It tries to mimic a tuple in most of its features.
uk: Екземпляр :class:`Row` служить високооптимізованою :attr:`~Connection.row_factory` для об’єктів :class:`Connection`. Він намагається імітувати кортеж у більшості своїх функцій.

source: It supports mapping access by column name and index, iteration, representation, equality testing and :func:`len`.
uk: Він підтримує відображення доступу за назвою та індексом стовпця, ітерацією, представленням, перевіркою рівності та :func:`len`.

source: If two :class:`Row` objects have exactly the same columns and their members are equal, they compare equal.
uk: Якщо два об’єкти :class:`Row` мають однакові стовпці, а їхні члени рівні, вони порівнюються.

source: This method returns a list of column names. Immediately after a query, it is the first member of each tuple in :attr:`Cursor.description`.
uk: Цей метод повертає список імен стовпців. Одразу після запиту він є першим членом кожного кортежу в :attr:`Cursor.description`.

source: Added support of slicing.
uk: Додана підтримка нарізки.

source: Let's assume we initialize a table as in the example given above::
uk: Припустімо, що ми ініціалізуємо таблицю, як у наведеному вище прикладі:

source: Now we plug :class:`Row` in::
uk: Тепер ми підключаємо :class:`Row` до::

source: Exceptions
uk: Винятки

source: The exception hierarchy is defined by the DB-API 2.0 (:pep:`249`).
uk: Ієрархія винятків визначається DB-API 2.0 (:pep:`249`).

source: The base class of the other exceptions in this module. Use this to catch all errors with one single :keyword:`except` statement. ``Error`` is a subclass of :exc:`Exception`.
uk: Базовий клас інших винятків у цьому модулі. Використовуйте це, щоб перехопити всі помилки за допомогою одного оператора :keyword:`except`. ``Error`` є підкласом :exc:`Exception`.

source: Exception raised for errors that are related to the database. This serves as the base exception for several types of database errors. It is only raised implicitly through the specialised subclasses. ``DatabaseError`` is a subclass of :exc:`Error`.
uk: Виняток створено для помилок, пов’язаних із базою даних. Це служить базовим винятком для кількох типів помилок бази даних. Він виникає лише неявно через спеціалізовані підкласи. ``DatabaseError`` є підкласом :exc:`Error`.

source: Exception raised for errors caused by problems with the processed data, like numeric values out of range, and strings which are too long. ``DataError`` is a subclass of :exc:`DatabaseError`.
uk: Виняток створено для помилок, спричинених проблемами з обробленими даними, як-от числові значення поза межами діапазону та надто довгі рядки. ``DataError`` є підкласом :exc:`DatabaseError`.

source: Exception raised for errors that are related to the database's operation, and not necessarily under the control of the programmer. For example, the database path is not found, or a transaction could not be processed. ``OperationalError`` is a subclass of :exc:`DatabaseError`.
uk: Виняток створено для помилок, які пов’язані з роботою бази даних і не обов’язково знаходяться під контролем програміста. Наприклад, шлях до бази даних не знайдено або транзакцію не вдалося обробити. ``OperationalError`` є підкласом :exc:`DatabaseError`.

source: Exception raised when the relational integrity of the database is affected, e.g. a foreign key check fails. It is a subclass of :exc:`DatabaseError`.
uk: Виняток виникає, коли порушується реляційна цілісність бази даних, наприклад. не вдається перевірити зовнішній ключ. Це підклас :exc:`DatabaseError`.

source: Exception raised when SQLite encounters an internal error. If this is raised, it may indicate that there is a problem with the runtime SQLite library. ``InternalError`` is a subclass of :exc:`DatabaseError`.
uk: Виняток виникає, коли SQLite стикається з внутрішньою помилкою. Якщо це виникає, це може означати, що існує проблема з бібліотекою SQLite під час виконання. ``InternalError`` є підкласом :exc:`DatabaseError`.

source: Exception raised in case a method or database API is not supported by the underlying SQLite library. For example, setting *deterministic* to :const:`True` in :meth:`~Connection.create_function`, if the underlying SQLite library does not support deterministic functions. ``NotSupportedError`` is a subclass of :exc:`DatabaseError`.
uk: Виняток виникає, якщо метод або API бази даних не підтримується базовою бібліотекою SQLite. Наприклад, встановлення *deterministic* на :const:`True` у :meth:`~Connection.create_function`, якщо базова бібліотека SQLite не підтримує детерміновані функції. ``NotSupportedError`` є підкласом :exc:`DatabaseError`.

source: SQLite and Python types
uk: Типи SQLite і Python

source: Introduction
uk: вступ

source: SQLite natively supports the following types: ``NULL``, ``INTEGER``, ``REAL``, ``TEXT``, ``BLOB``.
uk: SQLite спочатку підтримує такі типи: ``NULL``, ``INTEGER``, ``REAL``, ``TEXT``, ``BLOB``.

source: The following Python types can thus be sent to SQLite without any problem:
uk: Таким чином, такі типи Python можна без будь-яких проблем надсилати до SQLite:

source: Python type
uk: Тип Python

source: SQLite type
uk: Тип SQLite

source: ``INTEGER``
uk: ``ЦІЛЕ ЧИСЛО``

source: ``REAL``
uk: ``РЕАЛЬНИЙ``

source: ``TEXT``
uk: ``ТЕКСТ``

source: This is how SQLite types are converted to Python types by default:
uk: Ось як типи SQLite перетворюються на типи Python за замовчуванням:

source: depends on :attr:`~Connection.text_factory`, :class:`str` by default
uk: залежить від :attr:`~Connection.text_factory`, :class:`str` за замовчуванням

source: The type system of the :mod:`sqlite3` module is extensible in two ways: you can store additional Python types in an SQLite database via object adaptation, and you can let the :mod:`sqlite3` module convert SQLite types to different Python types via converters.
uk: Система типів модуля :mod:`sqlite3` розширюється двома способами: ви можете зберігати додаткові типи Python у базі даних SQLite за допомогою адаптації об’єктів, і ви можете дозволити модулю :mod:`sqlite3` перетворювати типи SQLite на інший Python. типів через конвертери.

source: Letting your object adapt itself
uk: Дозвольте своєму об’єкту адаптуватися

source: Registering an adapter callable
uk: Реєстрація адаптера, що викликається

source: Converting SQLite values to custom Python types
uk: Перетворення значень SQLite на спеціальні типи Python

source: Let's go back to the :class:`Point` class. We stored the x and y coordinates separated via semicolons as strings in SQLite.
uk: Повернемося до класу :class:`Point`. Ми зберігали координати x і y, розділені крапкою з комою, як рядки в SQLite.
