Repository: python/python-docs-uk
Catalog: library/sqlite3.po
Languages: uk

source: First, we'll define a converter function that accepts the string as a parameter and constructs a :class:`Point` object from it.
uk: Спочатку ми визначимо функцію конвертера, яка приймає рядок як параметр і створює з нього об’єкт :class:`Point`.

source: Default adapters and converters
uk: Стандартні адаптери та конвертери

source: There are default adapters for the date and datetime types in the datetime module. They will be sent as ISO dates/ISO timestamps to SQLite.
uk: У модулі datetime є стандартні адаптери для типів date і datetime. Вони будуть надіслані як дати ISO/мітки часу ISO до SQLite.

source: The default converters are registered under the name "date" for :class:`datetime.date` and under the name "timestamp" for :class:`datetime.datetime`.
uk: Перетворювачі за замовчуванням зареєстровані під назвою "date" для :class:`datetime.date` і під назвою "timestamp" для :class:`datetime.datetime`.

source: This way, you can use date/timestamps from Python without any additional fiddling in most cases. The format of the adapters is also compatible with the experimental SQLite date/time functions.
uk: Таким чином, у більшості випадків ви можете використовувати мітки дати/часу з Python без будь-яких додаткових маніпуляцій. Формат адаптерів також сумісний з експериментальними функціями дати/часу SQLite.

source: The following example demonstrates this.
uk: Наступний приклад демонструє це.

source: If a timestamp stored in SQLite has a fractional part longer than 6 numbers, its value will be truncated to microsecond precision by the timestamp converter.
uk: Якщо мітка часу, що зберігається в SQLite, має дробову частину, яка перевищує 6 чисел, її значення буде скорочено до мікросекундної точності конвертером міток часу.

source: The default "timestamp" converter ignores UTC offsets in the database and always returns a naive :class:`datetime.datetime` object. To preserve UTC offsets in timestamps, either leave converters disabled, or register an offset-aware converter with :func:`register_converter`.
uk: Конвертер "міток часу" за замовчуванням ігнорує зміщення UTC у базі даних і завжди повертає простий об’єкт :class:`datetime.datetime`. Щоб зберегти зміщення UTC у мітках часу, залиште конвертери вимкненими або зареєструйте конвертер із зсувом за допомогою :func:`register_converter`.

source: Controlling Transactions
uk: Контроль транзакцій

source: The underlying ``sqlite3`` library operates in ``autocommit`` mode by default, but the Python :mod:`sqlite3` module by default does not.
uk: Базова бібліотека ``sqlite3`` працює в режимі ``autocommit`` за замовчуванням, але модуль Python :mod:`sqlite3` за замовчуванням не працює.

source: ``autocommit`` mode means that statements that modify the database take effect immediately. A ``BEGIN`` or ``SAVEPOINT`` statement disables ``autocommit`` mode, and a ``COMMIT``, a ``ROLLBACK``, or a ``RELEASE`` that ends the outermost transaction, turns ``autocommit`` mode back on.
uk: Режим ``autocommit`` означає, що оператори, які змінюють базу даних, набувають чинності негайно. Оператор ``BEGIN`` або ``SAVEPOINT`` вимикає режим ``autocommit``, а ``COMMIT``, ``ROLLBACK`` або ``RELEASE``, які завершують крайню транзакцію, повертає режим ``автокомітату`` знову ввімкнено.

source: The Python :mod:`sqlite3` module by default issues a ``BEGIN`` statement implicitly before a Data Modification Language (DML) statement (i.e. ``INSERT``/``UPDATE``/``DELETE``/``REPLACE``).
uk: Модуль Python :mod:`sqlite3` за замовчуванням видає оператор ``BEGIN`` неявно перед оператором мови модифікації даних (DML) (тобто ``INSERT``/``UPDATE``/``DELETE``/``REPLACE``).

source: You can control which kind of ``BEGIN`` statements :mod:`sqlite3` implicitly executes via the *isolation_level* parameter to the :func:`connect` call, or via the :attr:`isolation_level` property of connections. If you specify no *isolation_level*, a plain ``BEGIN`` is used, which is equivalent to specifying ``DEFERRED``. Other possible values are ``IMMEDIATE`` and ``EXCLUSIVE``.
uk: Ви можете керувати тим, який тип операторів ``BEGIN`` :mod:`sqlite3` неявно виконується через параметр *isolation_level* виклику :func:`connect` або через властивість :attr:`isolation_level` підключень. Якщо ви не вкажете *рівень_ізоляції*, використовується звичайний ``BEGIN``, що еквівалентно вказуванню ``DEFERRED``. Інші можливі значення: ``IMMEDIATE`` і ``EXCLUSIVE``.

source: You can disable the :mod:`sqlite3` module's implicit transaction management by setting :attr:`isolation_level` to ``None``. This will leave the underlying ``sqlite3`` library operating in ``autocommit`` mode. You can then completely control the transaction state by explicitly issuing ``BEGIN``, ``ROLLBACK``, ``SAVEPOINT``, and ``RELEASE`` statements in your code.
uk: Ви можете вимкнути неявне керування транзакціями модуля :mod:`sqlite3`, встановивши для :attr:`isolation_level` значення ``None``. Це залишить базову бібліотеку ``sqlite3`` працювати в режимі ``autocommit``. Потім ви можете повністю контролювати стан транзакції, явно видаючи оператори ``BEGIN``, ``ROLLBACK``, ``SAVEPOINT`` і ``RELEASE`` у вашому коді.

source: Note that :meth:`~Cursor.executescript` disregards :attr:`isolation_level`; any transaction control must be added explicitly.
uk: Зауважте, що :meth:`~Cursor.executescript` не враховує :attr:`isolation_level`; будь-який контроль транзакцій має бути доданий явно.

source: :mod:`sqlite3` used to implicitly commit an open transaction before DDL statements. This is no longer the case.
uk: :mod:`sqlite3` використовується для неявної фіксації відкритої транзакції перед операторами DDL. Це вже не так.

source: Using :mod:`sqlite3` efficiently
uk: Ефективне використання :mod:`sqlite3`

source: Using shortcut methods
uk: Використання методів швидкого доступу

source: Using the nonstandard :meth:`execute`, :meth:`executemany` and :meth:`executescript` methods of the :class:`Connection` object, your code can be written more concisely because you don't have to create the (often superfluous) :class:`Cursor` objects explicitly. Instead, the :class:`Cursor` objects are created implicitly and these shortcut methods return the cursor objects. This way, you can execute a ``SELECT`` statement and iterate over it directly using only a single call on the :class:`Connection` object.
uk: Використовуючи нестандартні методи :meth:`execute`, :meth:`executemany` і :meth:`executescript` об’єкта :class:`Connection`, ваш код можна написати стисло, оскільки вам не потрібно створювати (часто зайве) :class:`Cursor` об’єкти явно. Натомість об’єкти :class:`Cursor` створюються неявно, і ці методи швидкого доступу повертають об’єкти курсору. Таким чином, ви можете виконати оператор ``SELECT`` і перейти до нього безпосередньо, використовуючи лише один виклик об’єкта :class:`Connection`.

source: Accessing columns by name instead of by index
uk: Доступ до стовпців за назвою, а не за індексом

source: One useful feature of the :mod:`sqlite3` module is the built-in :class:`sqlite3.Row` class designed to be used as a row factory.
uk: Однією з корисних функцій модуля :mod:`sqlite3` є вбудований клас :class:`sqlite3.Row`, призначений для використання як фабрики рядків.

source: Rows wrapped with this class can be accessed both by index (like tuples) and case-insensitively by name:
uk: Доступ до рядків, обернутих цим класом, можна отримати як за індексом (як кортежі), так і за назвою без урахування регістру:

source: Using the connection as a context manager
uk: Використання підключення як контекстного менеджера

source: Footnotes
uk: Виноски

source: The sqlite3 module is not built with loadable extension support by default, because some platforms (notably macOS) have SQLite libraries which are compiled without this feature. To get loadable extension support, you must pass the :option:`--enable-loadable-sqlite-extensions` option to configure.
uk: Модуль sqlite3 не створено з підтримкою завантажуваних розширень за замовчуванням, оскільки деякі платформи (зокрема macOS) мають бібліотеки SQLite, які скомпільовані без цієї функції. Щоб отримати підтримку завантажуваних розширень, ви повинні передати параметр :option:`--enable-loadable-sqlite-extensions` для налаштування.
