Repository: python/python-docs-uk
Catalog: library/sqlite3.po
Languages: uk

source: :mod:`sqlite3` --- DB-API 2.0 interface for SQLite databases
uk: :mod:`sqlite3` --- інтерфейс DB-API 2.0 для баз даних SQLite

source: **Source code:** :source:`Lib/sqlite3/`
uk: **Вихідний код:** :source:`Lib/sqlite3/`

source: SQLite is a C library that provides a lightweight disk-based database that doesn't require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It's also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.
uk: SQLite — це бібліотека C, яка надає легку дискову базу даних, яка не потребує окремого серверного процесу та дозволяє отримувати доступ до бази даних за допомогою нестандартного варіанту мови запитів SQL. Деякі програми можуть використовувати SQLite для внутрішнього зберігання даних. Також можна створити прототип програми за допомогою SQLite, а потім перенести код у більшу базу даних, таку як PostgreSQL або Oracle.

source: The sqlite3 module was written by Gerhard Häring. It provides an SQL interface compliant with the DB-API 2.0 specification described by :pep:`249`, and requires SQLite 3.7.15 or newer.
uk: Модуль sqlite3 був написаний Герхардом Херінгом. Він забезпечує інтерфейс SQL, сумісний зі специфікацією DB-API 2.0, описаною :pep:`249`, і вимагає SQLite 3.7.15 або новішої версії.

source: To use the module, start by creating a :class:`Connection` object that represents the database. Here the data will be stored in the :file:`example.db` file::
uk: Щоб використовувати модуль, почніть із створення об’єкта :class:`Connection`, який представлятиме базу даних. Тут дані зберігатимуться у файлі :file:`example.db`::

source: The special path name ``:memory:`` can be provided to create a temporary database in RAM.
uk: Для створення тимчасової бази даних у оперативній пам’яті можна вказати спеціальне ім’я шляху ``:memory:``.

source: Once a :class:`Connection` has been established, create a :class:`Cursor` object and call its :meth:`~Cursor.execute` method to perform SQL commands::
uk: Після встановлення :class:`Connection` створіть об’єкт :class:`Cursor` і викличте його метод :meth:`~Cursor.execute` для виконання команд SQL::

source: The saved data is persistent: it can be reloaded in a subsequent session even after restarting the Python interpreter::
uk: Збережені дані є постійними: їх можна перезавантажити в наступному сеансі навіть після перезапуску інтерпретатора Python::

source: To retrieve data after executing a SELECT statement, either treat the cursor as an :term:`iterator`, call the cursor's :meth:`~Cursor.fetchone` method to retrieve a single matching row, or call :meth:`~Cursor.fetchall` to get a list of the matching rows.
uk: Щоб отримати дані після виконання оператора SELECT, обробляйте курсор як :term:`iterator`, викличте метод курсора :meth:`~Cursor.fetchone`, щоб отримати один відповідний рядок, або викликайте :meth:`~Cursor .fetchall`, щоб отримати список відповідних рядків.

source: This example uses the iterator form::
uk: У цьому прикладі використовується форма ітератора::

source: SQL operations usually need to use values from Python variables. However, beware of using Python's string operations to assemble queries, as they are vulnerable to SQL injection attacks (see the `xkcd webcomic <https://xkcd.com/327/>`_ for a humorous example of what can go wrong)::
uk: Для операцій SQL зазвичай потрібно використовувати значення зі змінних Python. Однак остерігайтеся використання рядкових операцій Python для збирання запитів, оскільки вони вразливі до атак SQL-ін’єкцій (дивіться `xkcd webcomic <https://xkcd.com/327/>`_ для жартівливого прикладу того, що може піти не так):

source: Instead, use the DB-API's parameter substitution. To insert a variable into a query string, use a placeholder in the string, and substitute the actual values into the query by providing them as a :class:`tuple` of values to the second argument of the cursor's :meth:`~Cursor.execute` method. An SQL statement may use one of two kinds of placeholders: question marks (qmark style) or named placeholders (named style). For the qmark style, ``parameters`` must be a :term:`sequence <sequence>`. For the named style, it can be either a :term:`sequence <sequence>` or :class:`dict` instance. The length of the :term:`sequence <sequence>` must match the number of placeholders, or a :exc:`ProgrammingError` is raised. If a :class:`dict` is given, it must contain keys for all named parameters. Any extra items are ignored. Here's an example of both styles:
uk: Замість цього використовуйте підстановку параметрів DB-API. Щоб вставити змінну в рядок запиту, використовуйте заповнювач у рядку та підставте фактичні значення в запит, надавши їх як :class:`tuple` значень у другому аргументі :meth:`~курсора курсора .execute` метод. Інструкція SQL може використовувати один із двох видів заповнювачів: знаки питання (стиль qmark) або іменовані заповнювачі (іменований стиль). Для стилю qmark ``параметри`` мають бути :term:`послідовністю <sequence>`. Для названого стилю це може бути екземпляр :term:`sequence <sequence>` або :class:`dict`. Довжина :term:`послідовності <sequence>` має збігатися з кількістю заповнювачів, інакше виникне :exc:`ProgrammingError`. Якщо вказано :class:`dict`, він повинен містити ключі для всіх названих параметрів. Будь-які додаткові елементи ігноруються. Ось приклад обох стилів:

source: The SQLite web page; the documentation describes the syntax and the available data types for the supported SQL dialect.
uk: Веб-сторінка SQLite; документація описує синтаксис і доступні типи даних для підтримуваного діалекту SQL.

source: Tutorial, reference and examples for learning SQL syntax.
uk: Підручник, довідник і приклади для вивчення синтаксису SQL.

source: :pep:`249` - Database API Specification 2.0
uk: :pep:`249` - Специфікація API бази даних 2.0

source: PEP written by Marc-André Lemburg.
uk: PEP, написаний Марком-Андре Лембургом.

source: Module functions and constants
uk: Функції модуля та константи

source: String constant stating the supported DB-API level. Required by the DB-API. Hard-coded to ``"2.0"``.
uk: Рядкова константа, що вказує підтримуваний рівень DB-API. Потрібний для DB-API. Жорстко закодований на ``"2.0"``.

source: String constant stating the type of parameter marker formatting expected by the :mod:`sqlite3` module. Required by the DB-API. Hard-coded to ``"qmark"``.
uk: Рядкова константа, що вказує тип форматування маркера параметра, який очікує модуль :mod:`sqlite3`. Потрібний для DB-API. Жорстко закодований на ``"qmark"``.

source: The :mod:`sqlite3` module supports both ``qmark`` and ``numeric`` DB-API parameter styles, because that is what the underlying SQLite library supports. However, the DB-API does not allow multiple values for the ``paramstyle`` attribute.
uk: Модуль :mod:`sqlite3` підтримує як стилі параметрів ``qmark``, так і ``numeric`` DB-API, тому що це те, що підтримує базова бібліотека SQLite. Однак DB-API не допускає кількох значень для атрибута ``paramstyle``.

source: The version number of this module, as a string. This is not the version of the SQLite library.
uk: Номер версії цього модуля у вигляді рядка. Це не версія бібліотеки SQLite.

source: The version number of this module, as a tuple of integers. This is not the version of the SQLite library.
uk: Номер версії цього модуля у вигляді кортежу цілих чисел. Це не версія бібліотеки SQLite.

source: The version number of the run-time SQLite library, as a string.
uk: Номер версії бібліотеки SQLite під час виконання у вигляді рядка.

source: The version number of the run-time SQLite library, as a tuple of integers.
uk: Номер версії бібліотеки SQLite під час виконання у вигляді кортежу цілих чисел.

source: Opens a connection to the SQLite database file *database*. By default returns a :class:`Connection` object, unless a custom *factory* is given.
uk: Відкриває підключення до файлу бази даних SQLite *database*. За замовчуванням повертає об’єкт :class:`Connection`, якщо не вказано спеціальну *фабрику*.

source: *database* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the database file to be opened. You can use ``":memory:"`` to open a database connection to a database that resides in RAM instead of on disk.
uk: *database* — це :term:`path-like object`, який надає шлях (абсолютний або відносний до поточного робочого каталогу) до файлу бази даних, який потрібно відкрити. Ви можете використовувати ``":memory:"``, щоб відкрити підключення до бази даних, яка знаходиться в оперативній пам’яті, а не на диску.

source: When a database is accessed by multiple connections, and one of the processes modifies the database, the SQLite database is locked until that transaction is committed. The *timeout* parameter specifies how long the connection should wait for the lock to go away until raising an exception. The default for the timeout parameter is 5.0 (five seconds).
uk: Коли доступ до бази даних здійснюється через кілька з’єднань, і один із процесів змінює базу даних, база даних SQLite блокується, доки ця транзакція не буде зафіксована. Параметр *timeout* визначає, як довго з’єднання має чекати, поки блокування зникне, доки не буде створено виняток. За замовчуванням параметр часу очікування становить 5,0 (п’ять секунд).

source: For the *isolation_level* parameter, please see the :attr:`~Connection.isolation_level` property of :class:`Connection` objects.
uk: Для параметра *isolation_level* див. властивість :attr:`~Connection.isolation_level` об’єктів :class:`Connection`.

source: By default, *check_same_thread* is :const:`True` and only the creating thread may use the connection. If set :const:`False`, the returned connection may be shared across multiple threads. When using multiple threads with the same connection writing operations should be serialized by the user to avoid data corruption.
uk: За замовчуванням *check_same_thread* має значення :const:`True`, і лише потік, який створює, може використовувати з’єднання. Якщо встановлено :const:`False`, повернуте з’єднання може використовуватися кількома потоками. У разі використання кількох потоків з однаковим з’єднанням операції запису повинні бути серіалізовані користувачем, щоб уникнути пошкодження даних.

source: By default, the :mod:`sqlite3` module uses its :class:`Connection` class for the connect call. You can, however, subclass the :class:`Connection` class and make :func:`connect` use your class instead by providing your class for the *factory* parameter.
uk: За замовчуванням модуль :mod:`sqlite3` використовує свій клас :class:`Connection` для виклику підключення. Однак ви можете створити підклас класу :class:`Connection` і змусити :func:`connect` використовувати ваш клас замість цього, надавши ваш клас для параметра *factory*.

source: Consult the section :ref:`sqlite3-types` of this manual for details.
uk: Зверніться до розділу :ref:`sqlite3-types` цього посібника, щоб дізнатися більше.

source: If *uri* is :const:`True`, *database* is interpreted as a :abbr:`URI (Uniform Resource Identifier)` with a file path and an optional query string. The scheme part *must* be ``"file:"``. The path can be a relative or absolute file path. The query string allows us to pass parameters to SQLite. Some useful URI tricks include::
uk: Якщо *uri* має значення :const:`True`, *база даних* інтерпретується як :abbr:`URI (уніфікований ідентифікатор ресурсу)` із шляхом до файлу та необов’язковим рядком запиту. Частина схеми *має* бути ``"file:"``. Шлях може бути відносним або абсолютним шляхом до файлу. Рядок запиту дозволяє нам передавати параметри в SQLite. Деякі корисні прийоми URI включають:

source: More information about this feature, including a list of recognized parameters, can be found in the `SQLite URI documentation <https://www.sqlite.org/uri.html>`_.
uk: Додаткову інформацію про цю функцію, включаючи список розпізнаних параметрів, можна знайти в `документації SQLite URI <https://www.sqlite.org/uri.html>`_.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.connect`` with argument ``database``.
uk: Викликає :ref:`подію аудиту <auditing>` ``sqlite3.connect`` з аргументом ``база даних``.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.connect/handle`` with argument ``connection_handle``.
uk: Викликає :ref:`подію аудиту <auditing>` ``sqlite3.connect/handle`` з аргументом ``connection_handle``.

source: Added the *uri* parameter.
uk: Додано параметр *uri*.

source: *database* can now also be a :term:`path-like object`, not only a string.
uk: *database* тепер також може бути :term:`path-like object`, а не лише рядком.

source: Added the ``sqlite3.connect/handle`` auditing event.
uk: Додано подію аудиту ``sqlite3.connect/handle``.

source: Returns :const:`True` if the string *statement* contains one or more complete SQL statements terminated by semicolons. It does not verify that the SQL is syntactically correct, only that there are no unclosed string literals and the statement is terminated by a semicolon.
uk: Повертає :const:`True`, якщо рядок *оператор* містить один або кілька повних операторів SQL, закінчених крапкою з комою. Він не перевіряє, що SQL є синтаксично правильним, лише те, що немає незакритих рядкових літералів і оператор завершується крапкою з комою.

source: This can be used to build a shell for SQLite, as in the following example:
uk: Це можна використовувати для створення оболонки для SQLite, як у наступному прикладі:

source: Connection Objects
uk: Об'єкти підключення

source: An SQLite database connection has the following attributes and methods:
uk: Підключення до бази даних SQLite має такі атрибути та методи:

source: Get or set the current default isolation level. :const:`None` for autocommit mode or one of "DEFERRED", "IMMEDIATE" or "EXCLUSIVE". See section :ref:`sqlite3-controlling-transactions` for a more detailed explanation.
uk: Отримати або встановити поточний рівень ізоляції за замовчуванням. :const:`None` для режиму автозакріплення або одного з "ВІДкладено", "НЕГАЙНО" чи "ВИКЛЮЧНО". Перегляньте розділ :ref:`sqlite3-controlling-transactions` для більш детального пояснення.

source: :const:`True` if a transaction is active (there are uncommitted changes), :const:`False` otherwise. Read-only attribute.
uk: :const:`True`, якщо транзакція активна (є незафіксовані зміни), :const:`False` інакше. Атрибут лише для читання.

source: The cursor method accepts a single optional parameter *factory*. If supplied, this must be a callable returning an instance of :class:`Cursor` or its subclasses.
uk: Метод cursor приймає один необов’язковий параметр *factory*. Якщо вказано, це має бути виклик, що повертає екземпляр :class:`Cursor` або його підкласів.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.execute` on it with the given *sql* and *parameters*. Return the new cursor object.
uk: Створіть новий об’єкт :class:`Cursor` і викличте :meth:`~Cursor.execute` для нього з заданими *sql* і *параметрами*. Повернути новий об’єкт курсору.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.executemany` on it with the given *sql* and *parameters*. Return the new cursor object.
uk: Створіть новий об’єкт :class:`Cursor` і викличте :meth:`~Cursor.executemany` для нього з заданими *sql* і *параметрами*. Повернути новий об’єкт курсору.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.executescript` on it with the given *sql_script*. Return the new cursor object.
uk: Створіть новий об’єкт :class:`Cursor` і викличте :meth:`~Cursor.executescript` для нього за допомогою заданого *sql_script*. Повернути новий об’єкт курсору.

source: Creates a user-defined function that you can later use from within SQL statements under the function name *name*. *narg* is the number of parameters the function accepts (if *narg* is -1, the function may take any number of arguments), and *func* is a Python callable that is called as the SQL function. If *deterministic* is true, the created function is marked as `deterministic <https://sqlite.org/deterministic.html>`_, which allows SQLite to perform additional optimizations. This flag is supported by SQLite 3.8.3 or higher, :exc:`NotSupportedError` will be raised if used with older versions.
uk: Створює визначену користувачем функцію, яку можна пізніше використовувати в інструкціях SQL під назвою функції *name*. *narg* — це кількість параметрів, які приймає функція (якщо *narg* дорівнює -1, функція може приймати будь-яку кількість аргументів), а *func* — це функція Python, яка викликається як функція SQL. Якщо *deterministic* має значення true, створена функція позначається як `deterministic <https://sqlite.org/deterministic.html>`_, що дозволяє SQLite виконувати додаткові оптимізації. Цей прапорець підтримується SQLite 3.8.3 або новішою версією, :exc:`NotSupportedError` буде піднято, якщо використовується зі старішими версіями.

source: The function can return any of the types supported by SQLite: bytes, str, int, float and ``None``.
uk: Функція може повертати будь-які типи, які підтримує SQLite: bytes, str, int, float і ``None``.

source: The *deterministic* parameter was added.
uk: Додано параметр *детермінований*.

source: Example:
uk: приклад:

source: Creates a user-defined aggregate function.
uk: Створює визначену користувачем агрегатну функцію.

source: The aggregate class must implement a ``step`` method, which accepts the number of parameters *n_arg* (if *n_arg* is -1, the function may take any number of arguments), and a ``finalize`` method which will return the final result of the aggregate.
uk: Агрегатний клас повинен реалізовувати метод "step", який приймає кількість параметрів *n_arg* (якщо *n_arg* дорівнює -1, функція може приймати будь-яку кількість аргументів), і метод "finalize", який поверне кінцевий результат агрегату.

source: The ``finalize`` method can return any of the types supported by SQLite: bytes, str, int, float and ``None``.
uk: Метод ``finalize`` може повертати будь-які типи, які підтримує SQLite: bytes, str, int, float і ``None``.

source: Create a collation named *name* using the collating function *callable*. *callable* is passed two :class:`string <str>` arguments, and it should return an :class:`integer <int>`:
uk: Створіть зіставлення під назвою *name* за допомогою функції зіставлення *callable*. *callable* передається два аргументи :class:`string <str>`, і він має повернути :class:`ціле число <int>`:

source: ``1`` if the first is ordered higher than the second
uk: ``1``, якщо перший впорядкований вище за другий

source: ``-1`` if the first is ordered lower than the second
uk: ``-1``, якщо перший впорядкований нижче другого

source: ``0`` if they are ordered equal
uk: ``0``, якщо вони в порядку рівності

source: The following example shows a reverse sorting collation:
uk: У наступному прикладі показано порівняння зворотного сортування:

source: Remove a collation function by setting *callable* to :const:`None`.
uk: Видаліть функцію порівняння, встановивши для *callable* значення :const:`None`.

source: You can call this method from a different thread to abort any queries that might be executing on the connection. The query will then abort and the caller will get an exception.
uk: Ви можете викликати цей метод з іншого потоку, щоб скасувати будь-які запити, які можуть виконуватися на з’єднанні. Після цього запит буде перервано, а абонент отримає виняток.

source: This routine registers a callback. The callback is invoked for each attempt to access a column of a table in the database. The callback should return :const:`SQLITE_OK` if access is allowed, :const:`SQLITE_DENY` if the entire SQL statement should be aborted with an error and :const:`SQLITE_IGNORE` if the column should be treated as a NULL value. These constants are available in the :mod:`sqlite3` module.
uk: Ця процедура реєструє зворотний виклик. Зворотний виклик викликається для кожної спроби отримати доступ до стовпця таблиці в базі даних. Зворотний виклик має повернути :const:`SQLITE_OK`, якщо доступ дозволено, :const:`SQLITE_DENY`, якщо весь оператор SQL має бути перервано з помилкою, і :const:`SQLITE_IGNORE`, якщо стовпець має розглядатися як значення NULL. Ці константи доступні в модулі :mod:`sqlite3`.

source: The first argument to the callback signifies what kind of operation is to be authorized. The second and third argument will be arguments or :const:`None` depending on the first argument. The 4th argument is the name of the database ("main", "temp", etc.) if applicable. The 5th argument is the name of the inner-most trigger or view that is responsible for the access attempt or :const:`None` if this access attempt is directly from input SQL code.
uk: Перший аргумент зворотного виклику вказує, яку операцію потрібно авторизувати. Другий і третій аргументи будуть аргументами або :const:`None` залежно від першого аргументу. Четвертий аргумент — це ім’я бази даних ("main", "temp" тощо), якщо це можливо. 5-й аргумент — це ім’я самого внутрішнього тригера або перегляду, який відповідає за спробу доступу, або :const:`None`, якщо ця спроба доступу здійснюється безпосередньо з вхідного коду SQL.

source: Please consult the SQLite documentation about the possible values for the first argument and the meaning of the second and third argument depending on the first one. All necessary constants are available in the :mod:`sqlite3` module.
uk: Зверніться до документації SQLite щодо можливих значень для першого аргументу та значення другого та третього аргументів залежно від першого. Усі необхідні константи доступні в модулі :mod:`sqlite3`.

source: This routine registers a callback. The callback is invoked for every *n* instructions of the SQLite virtual machine. This is useful if you want to get called from SQLite during long-running operations, for example to update a GUI.
uk: Ця процедура реєструє зворотний виклик. Зворотний виклик викликається для кожних *n* інструкцій віртуальної машини SQLite. Це корисно, якщо ви хочете отримати виклик із SQLite під час тривалих операцій, наприклад, щоб оновити графічний інтерфейс.

source: If you want to clear any previously installed progress handler, call the method with :const:`None` for *progress_handler*.
uk: Якщо ви хочете очистити будь-який раніше встановлений обробник прогресу, викличте метод за допомогою :const:`None` для *progress_handler*.

source: Returning a non-zero value from the handler function will terminate the currently executing query and cause it to raise an :exc:`OperationalError` exception.
uk: Повернення ненульового значення з функції обробника призведе до завершення запиту, що виконується, і викликання виключення :exc:`OperationalError`.

source: Registers *trace_callback* to be called for each SQL statement that is actually executed by the SQLite backend.
uk: Реєструє *trace_callback* для кожного оператора SQL, який фактично виконується серверною частиною SQLite.

source: The only argument passed to the callback is the statement (as :class:`str`) that is being executed. The return value of the callback is ignored. Note that the backend does not only run statements passed to the :meth:`Cursor.execute` methods. Other sources include the :ref:`transaction management <sqlite3-controlling-transactions>` of the sqlite3 module and the execution of triggers defined in the current database.
uk: Єдиним аргументом, який передається зворотному виклику, є оператор (як :class:`str`), який виконується. Повернене значення зворотного виклику ігнорується. Зауважте, що бекенд виконує не лише оператори, передані методам :meth:`Cursor.execute`. Інші джерела включають :ref:`керування транзакціями <sqlite3-controlling-transactions>` модуля sqlite3 і виконання тригерів, визначених у поточній базі даних.
