Repository: python/python-docs-uk
Catalog: library/ssl.po
Languages: uk

source: Prevents re-use of the same DH key for distinct SSL sessions. This improves forward secrecy but requires more computational resources. This option only applies to server sockets.
uk: Запобігає повторному використанню того самого ключа DH для різних сеансів SSL. Це покращує пряму секретність, але вимагає більше обчислювальних ресурсів. Цей параметр стосується лише серверних сокетів.

source: Prevents re-use of the same ECDH key for distinct SSL sessions. This improves forward secrecy but requires more computational resources. This option only applies to server sockets.
uk: Запобігає повторному використанню того самого ключа ECDH для різних сеансів SSL. Це покращує пряму секретність, але вимагає більше обчислювальних ресурсів. Цей параметр стосується лише серверних сокетів.

source: Send dummy Change Cipher Spec (CCS) messages in TLS 1.3 handshake to make a TLS 1.3 connection look more like a TLS 1.2 connection.
uk: Надсилайте фіктивні повідомлення про зміну шифру (CCS) у рукостисканні TLS 1.3, щоб зробити з’єднання TLS 1.3 більш схожим на з’єднання TLS 1.2.

source: This option is only available with OpenSSL 1.1.1 and later.
uk: Ця опція доступна лише з OpenSSL 1.1.1 і новіших версій.

source: Disable compression on the SSL channel. This is useful if the application protocol supports its own compression scheme.
uk: Вимкніть стиснення на каналі SSL. Це корисно, якщо протокол програми підтримує власну схему стиснення.

source: :class:`enum.IntFlag` collection of OP_* constants.
uk: :class:`enum.IntFlag` колекція констант OP_*.

source: Prevent client side from requesting a session ticket.
uk: Заборонити стороні клієнта запитувати квиток сеансу.

source: Ignore unexpected shutdown of TLS connections.
uk: Ігноруйте несподіване завершення з’єднань TLS.

source: This option is only available with OpenSSL 3.0.0 and later.
uk: Цей параметр доступний лише з OpenSSL 3.0.0 і пізніших версій.

source: Whether the OpenSSL library has built-in support for the *Application-Layer Protocol Negotiation* TLS extension as described in :rfc:`7301`.
uk: Чи має бібліотека OpenSSL вбудовану підтримку розширення TLS *Application-Layer Protocol Negotiation*, як описано в :rfc:`7301`.

source: Whether the OpenSSL library has built-in support not checking subject common name and :attr:`SSLContext.hostname_checks_common_name` is writeable.
uk: Чи має бібліотека OpenSSL вбудовану підтримку, яка не перевіряє загальне ім’я суб’єкта та :attr:`SSLContext.hostname_checks_common_name`, доступний для запису.

source: Whether the OpenSSL library has built-in support for the Elliptic Curve-based Diffie-Hellman key exchange. This should be true unless the feature was explicitly disabled by the distributor.
uk: Чи має бібліотека OpenSSL вбудовану підтримку для обміну ключами Діффі-Хеллмана на основі еліптичної кривої. Це має бути правдою, якщо цю функцію явно не вимкнув розповсюджувач.

source: Whether the OpenSSL library has built-in support for the *Server Name Indication* extension (as defined in :rfc:`6066`).
uk: Чи має бібліотека OpenSSL вбудовану підтримку розширення *Індикація імені сервера* (як визначено в :rfc:`6066`).

source: Whether the OpenSSL library has built-in support for the *Next Protocol Negotiation* as described in the `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. When true, you can use the :meth:`SSLContext.set_npn_protocols` method to advertise which protocols you want to support.
uk: Чи має бібліотека OpenSSL вбудовану підтримку *Узгодження наступного протоколу*, як описано в розділі `Узгодження протоколу прикладного рівня <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. Якщо значення true, ви можете використовувати метод :meth:`SSLContext.set_npn_protocols`, щоб повідомити, які протоколи ви хочете підтримувати.

source: Whether the OpenSSL library has built-in support for the SSL 2.0 protocol.
uk: Чи бібліотека OpenSSL має вбудовану підтримку протоколу SSL 2.0.

source: Whether the OpenSSL library has built-in support for the SSL 3.0 protocol.
uk: Чи має бібліотека OpenSSL вбудовану підтримку протоколу SSL 3.0.

source: Whether the OpenSSL library has built-in support for the TLS 1.0 protocol.
uk: Чи бібліотека OpenSSL має вбудовану підтримку протоколу TLS 1.0.

source: Whether the OpenSSL library has built-in support for the TLS 1.1 protocol.
uk: Чи має бібліотека OpenSSL вбудовану підтримку протоколу TLS 1.1.

source: Whether the OpenSSL library has built-in support for the TLS 1.2 protocol.
uk: Чи бібліотека OpenSSL має вбудовану підтримку протоколу TLS 1.2.

source: Whether the OpenSSL library has built-in support for the TLS 1.3 protocol.
uk: Чи має бібліотека OpenSSL вбудовану підтримку протоколу TLS 1.3.

source: List of supported TLS channel binding types. Strings in this list can be used as arguments to :meth:`SSLSocket.get_channel_binding`.
uk: Список підтримуваних типів прив’язки каналу TLS. Рядки в цьому списку можна використовувати як аргументи для :meth:`SSLSocket.get_channel_binding`.

source: The version string of the OpenSSL library loaded by the interpreter::
uk: Рядок версії бібліотеки OpenSSL, завантажений інтерпретатором::

source: A tuple of five integers representing version information about the OpenSSL library::
uk: Кортеж із п’яти цілих чисел, що представляє інформацію про версію бібліотеки OpenSSL::

source: The raw version number of the OpenSSL library, as a single integer::
uk: Необроблений номер версії бібліотеки OpenSSL у вигляді одного цілого числа::

source: Alert Descriptions from :rfc:`5246` and others. The `IANA TLS Alert Registry <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml#tls-parameters-6>`_ contains this list and references to the RFCs where their meaning is defined.
uk: Описи сповіщень від :rfc:`5246` та інших. `Реєстр сповіщень IANA TLS <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml#tls-parameters-6>`_ містить цей список і посилання на RFC, де визначено їх значення.

source: Used as the return value of the callback function in :meth:`SSLContext.set_servername_callback`.
uk: Використовується як значення, що повертається функцією зворотного виклику в :meth:`SSLContext.set_servername_callback`.

source: :class:`enum.IntEnum` collection of ALERT_DESCRIPTION_* constants.
uk: :class:`enum.IntEnum` колекція констант ALERT_DESCRIPTION_*.

source: Option for :func:`create_default_context` and :meth:`SSLContext.load_default_certs`. This value indicates that the context may be used to authenticate web servers (therefore, it will be used to create client-side sockets).
uk: Опція для :func:`create_default_context` і :meth:`SSLContext.load_default_certs`. Це значення вказує на те, що контекст можна використовувати для автентифікації веб-серверів (отже, він використовуватиметься для створення сокетів на стороні клієнта).

source: Option for :func:`create_default_context` and :meth:`SSLContext.load_default_certs`. This value indicates that the context may be used to authenticate web clients (therefore, it will be used to create server-side sockets).
uk: Опція для :func:`create_default_context` і :meth:`SSLContext.load_default_certs`. Це значення вказує на те, що контекст можна використовувати для автентифікації веб-клієнтів (отже, він використовуватиметься для створення сокетів на стороні сервера).

source: :class:`enum.IntEnum` collection of SSL_ERROR_* constants.
uk: :class:`enum.IntEnum` колекція констант SSL_ERROR_*.

source: :class:`enum.IntEnum` collection of SSL and TLS versions for :attr:`SSLContext.maximum_version` and :attr:`SSLContext.minimum_version`.
uk: :class:`enum.IntEnum` колекція версій SSL і TLS для :attr:`SSLContext.maximum_version` і :attr:`SSLContext.minimum_version`.

source: The minimum or maximum supported SSL or TLS version. These are magic constants. Their values don't reflect the lowest and highest available TLS/SSL versions.
uk: Мінімальна або максимальна підтримувана версія SSL або TLS. Це магічні константи. Їх значення не відображають найнижчу та найвищу доступні версії TLS/SSL.

source: SSL 3.0 to TLS 1.3.
uk: SSL 3.0 до TLS 1.3.

source: All :class:`TLSVersion` members except :attr:`TLSVersion.TLSv1_2` and :attr:`TLSVersion.TLSv1_3` are deprecated.
uk: Усі члени :class:`TLSVersion`, крім :attr:`TLSVersion.TLSv1_2` і :attr:`TLSVersion.TLSv1_3`, застаріли.

source: SSL Sockets
uk: SSL-сокети

source: SSL sockets provide the following methods of :ref:`socket-objects`:
uk: SSL-сокети надають такі методи :ref:`socket-objects`:

source: :meth:`~socket.socket.recv()`, :meth:`~socket.socket.recv_into()` (but passing a non-zero ``flags`` argument is not allowed)
uk: :meth:`~socket.socket.recv()`, :meth:`~socket.socket.recv_into()` (але передача ненульового аргументу ``flags`` заборонена)

source: :meth:`~socket.socket.send()`, :meth:`~socket.socket.sendall()` (with the same limitation)
uk: :meth:`~socket.socket.send()`, :meth:`~socket.socket.sendall()` (з тим самим обмеженням)

source: :meth:`~socket.socket.sendfile()` (but :mod:`os.sendfile` will be used for plain-text sockets only, else :meth:`~socket.socket.send()` will be used)
uk: :meth:`~socket.socket.sendfile()` (але :mod:`os.sendfile` використовуватиметься лише для простих текстових сокетів, інакше використовуватиметься :meth:`~socket.socket.send()` )

source: However, since the SSL (and TLS) protocol has its own framing atop of TCP, the SSL sockets abstraction can, in certain respects, diverge from the specification of normal, OS-level sockets. See especially the :ref:`notes on non-blocking sockets <ssl-nonblocking>`.
uk: Однак, оскільки протокол SSL (і TLS) має власне фреймування поверх TCP, абстракція сокетів SSL може в певних аспектах відрізнятися від специфікації звичайних сокетів рівня ОС. Особливо дивіться :ref:`примітки щодо неблокуючих сокетів <ssl-nonblocking>`.

source: Instances of :class:`SSLSocket` must be created using the :meth:`SSLContext.wrap_socket` method.
uk: Примірники :class:`SSLSocket` повинні бути створені за допомогою методу :meth:`SSSLContext.wrap_socket`.

source: The :meth:`sendfile` method was added.
uk: Додано метод :meth:`sendfile`.

source: The :meth:`shutdown` does not reset the socket timeout each time bytes are received or sent. The socket timeout is now to maximum total duration of the shutdown.
uk: :meth:`shutdown` не скидає тайм-аут сокета кожного разу, коли байти надходять або надсилаються. Час очікування сокета тепер становить максимальну загальну тривалість вимкнення.

source: It is deprecated to create a :class:`SSLSocket` instance directly, use :meth:`SSLContext.wrap_socket` to wrap a socket.
uk: Безпосереднє створення екземпляра :class:`SSLSocket` є застарілим, використовуйте :meth:`SSSLContext.wrap_socket` для упаковки сокета.

source: :class:`SSLSocket` instances must to created with :meth:`~SSLContext.wrap_socket`. In earlier versions, it was possible to create instances directly. This was never documented or officially supported.
uk: :class:`SSLSocket` екземпляри повинні бути створені за допомогою :meth:`~SSSLContext.wrap_socket`. У попередніх версіях можна було створювати екземпляри безпосередньо. Це ніколи не було задокументовано чи офіційно підтверджено.

source: Python now uses ``SSL_read_ex`` and ``SSL_write_ex`` internally. The functions support reading and writing of data larger than 2 GB. Writing zero-length data no longer fails with a protocol violation error.
uk: Тепер Python внутрішньо використовує ``SSL_read_ex`` і ``SSL_write_ex``. Функції підтримують читання та запис даних розміром понад 2 ГБ. Запис даних нульової довжини більше не завершується помилкою порушення протоколу.

source: SSL sockets also have the following additional methods and attributes:
uk: SSL-сокети також мають такі додаткові методи та атрибути:

source: Read up to *len* bytes of data from the SSL socket and return the result as a ``bytes`` instance. If *buffer* is specified, then read into the buffer instead, and return the number of bytes read.
uk: Читайте до *len* байтів даних із SSL-сокета та повертайте результат як екземпляр ``bytes``. Якщо вказано *buffer*, то замість цього зчитується в буфер і повертається кількість прочитаних байтів.

source: Raise :exc:`SSLWantReadError` or :exc:`SSLWantWriteError` if the socket is :ref:`non-blocking <ssl-nonblocking>` and the read would block.
uk: Викликайте :exc:`SSLWantReadError` або :exc:`SSLWantWriteError`, якщо сокет :ref:`неблокує <ssl-nonblocking>`, і читання буде заблоковано.

source: As at any time a re-negotiation is possible, a call to :meth:`read` can also cause write operations.
uk: Оскільки в будь-який час можливе повторне узгодження, виклик :meth:`read` також може викликати операції запису.

source: The socket timeout is no more reset each time bytes are received or sent. The socket timeout is now to maximum total duration to read up to *len* bytes.
uk: Тайм-аут сокета більше не скидається щоразу, коли байти надходять або надсилаються. Час очікування сокета тепер становить максимальну загальну тривалість для читання до *len* байтів.

source: Use :meth:`~SSLSocket.recv` instead of :meth:`~SSLSocket.read`.
uk: Використовуйте :meth:`~SSLSocket.recv` замість :meth:`~SSLSocket.read`.

source: Write *buf* to the SSL socket and return the number of bytes written. The *buf* argument must be an object supporting the buffer interface.
uk: Запишіть *buf* у SSL-сокет і поверніть кількість записаних байтів. Аргумент *buf* має бути об’єктом, що підтримує інтерфейс буфера.

source: Raise :exc:`SSLWantReadError` or :exc:`SSLWantWriteError` if the socket is :ref:`non-blocking <ssl-nonblocking>` and the write would block.
uk: Викликайте :exc:`SSLWantReadError` або :exc:`SSLWantWriteError`, якщо сокет :ref:`неблокує <ssl-nonblocking>`, і запис буде заблоковано.

source: As at any time a re-negotiation is possible, a call to :meth:`write` can also cause read operations.
uk: Оскільки в будь-який час можливе повторне узгодження, виклик :meth:`write` також може викликати операції читання.

source: The socket timeout is no more reset each time bytes are received or sent. The socket timeout is now to maximum total duration to write *buf*.
uk: Тайм-аут сокета більше не скидається щоразу, коли байти надходять або надсилаються. Час очікування сокета тепер досяг максимальної загальної тривалості для запису *buf*.

source: Use :meth:`~SSLSocket.send` instead of :meth:`~SSLSocket.write`.
uk: Використовуйте :meth:`~SSLSocket.send` замість :meth:`~SSLSocket.write`.

source: The :meth:`~SSLSocket.read` and :meth:`~SSLSocket.write` methods are the low-level methods that read and write unencrypted, application-level data and decrypt/encrypt it to encrypted, wire-level data. These methods require an active SSL connection, i.e. the handshake was completed and :meth:`SSLSocket.unwrap` was not called.
uk: Методи :meth:`~SSLSocket.read` і :meth:`~SSLSocket.write` є низькорівневими методами, які читають і записують незашифровані дані на рівні програми та розшифровують/шифрують їх у зашифровані дані на рівні проводів. Для цих методів потрібне активне з’єднання SSL, тобто рукостискання завершено і :meth:`SSLSocket.unwrap` не викликано.

source: Normally you should use the socket API methods like :meth:`~socket.socket.recv` and :meth:`~socket.socket.send` instead of these methods.
uk: Зазвичай замість цих методів слід використовувати такі методи API сокетів, як :meth:`~socket.socket.recv` і :meth:`~socket.socket.send`.

source: Perform the SSL setup handshake.
uk: Виконайте рукостискання налаштування SSL.

source: The handshake method also performs :func:`match_hostname` when the :attr:`~SSLContext.check_hostname` attribute of the socket's :attr:`~SSLSocket.context` is true.
uk: Метод рукостискання також виконує :func:`match_hostname`, якщо атрибут :attr:`~SSLContext.check_hostname` :attr:`~SSLSocket.context` сокета має значення true.

source: The socket timeout is no more reset each time bytes are received or sent. The socket timeout is now to maximum total duration of the handshake.
uk: Тайм-аут сокета більше не скидається щоразу, коли байти надходять або надсилаються. Час очікування сокета тепер становить максимальну загальну тривалість рукостискання.

source: Hostname or IP address is matched by OpenSSL during handshake. The function :func:`match_hostname` is no longer used. In case OpenSSL refuses a hostname or IP address, the handshake is aborted early and a TLS alert message is send to the peer.
uk: Ім’я хоста або IP-адреса збігається з OpenSSL під час рукостискання. Функція :func:`match_hostname` більше не використовується. Якщо OpenSSL відмовляється надати ім’я хоста чи IP-адресу, рукостискання припиняється достроково, а однорангові надсилається попереджувальне повідомлення TLS.

source: If there is no certificate for the peer on the other end of the connection, return ``None``. If the SSL handshake hasn't been done yet, raise :exc:`ValueError`.
uk: Якщо немає сертифіката для вузла на іншому кінці з’єднання, поверніть ``None``. Якщо SSL-рукостискання ще не виконано, підніміть :exc:`ValueError`.

source: If the ``binary_form`` parameter is :const:`False`, and a certificate was received from the peer, this method returns a :class:`dict` instance. If the certificate was not validated, the dict is empty. If the certificate was validated, it returns a dict with several keys, amongst them ``subject`` (the principal for which the certificate was issued) and ``issuer`` (the principal issuing the certificate). If a certificate contains an instance of the *Subject Alternative Name* extension (see :rfc:`3280`), there will also be a ``subjectAltName`` key in the dictionary.
uk: Якщо параметр ``binary_form`` має значення :const:`False`, а сертифікат отримано від однорангового пристрою, цей метод повертає екземпляр :class:`dict`. Якщо сертифікат не підтверджено, dict порожній. Якщо сертифікат перевірено, він повертає dict із кількома ключами, серед яких ``subject`` (принципал, для якого видано сертифікат) і ``issuer`` (принципал, який видає сертифікат). Якщо сертифікат містить примірник розширення *Subject Alternative Name* (див. :rfc:`3280`), у словнику також буде ключ ``subjectAltName``.

source: The ``subject`` and ``issuer`` fields are tuples containing the sequence of relative distinguished names (RDNs) given in the certificate's data structure for the respective fields, and each RDN is a sequence of name-value pairs. Here is a real-world example::
uk: Поля ``subject`` і ``issuer`` — це кортежі, що містять послідовність відносних розрізняючих імен (RDN), наведених у структурі даних сертифіката для відповідних полів, і кожен RDN є послідовністю пар ім’я-значення. Ось реальний приклад:

source: To validate a certificate for a particular service, you can use the :func:`match_hostname` function.
uk: Щоб перевірити сертифікат для певної служби, ви можете скористатися функцією :func:`match_hostname`.

source: If the ``binary_form`` parameter is :const:`True`, and a certificate was provided, this method returns the DER-encoded form of the entire certificate as a sequence of bytes, or :const:`None` if the peer did not provide a certificate. Whether the peer provides a certificate depends on the SSL socket's role:
uk: Якщо параметр ``binary_form`` має значення :const:`True` і надано сертифікат, цей метод повертає закодовану DER форму всього сертифіката у вигляді послідовності байтів або :const:`None`, якщо одноранговий сертифікат не надав. Чи надає партнер сертифікат, залежить від ролі SSL-сокета:

source: for a client SSL socket, the server will always provide a certificate, regardless of whether validation was required;
uk: для клієнтського SSL-сокета сервер завжди надаватиме сертифікат, незалежно від того, чи була потрібна перевірка;

source: for a server SSL socket, the client will only provide a certificate when requested by the server; therefore :meth:`getpeercert` will return :const:`None` if you used :const:`CERT_NONE` (rather than :const:`CERT_OPTIONAL` or :const:`CERT_REQUIRED`).
uk: для серверного SSL-сокета клієнт надасть сертифікат лише за запитом сервера; тому :meth:`getpeercert` поверне :const:`None`, якщо ви використали :const:`CERT_NONE` (а не :const:`CERT_OPTIONAL` або :const:`CERT_REQUIRED`).

source: The returned dictionary includes additional items such as ``issuer`` and ``notBefore``.
uk: Повернений словник містить додаткові елементи, такі як ``issuer`` і ``notBefore``.

source: :exc:`ValueError` is raised when the handshake isn't done. The returned dictionary includes additional X509v3 extension items such as ``crlDistributionPoints``, ``caIssuers`` and ``OCSP`` URIs.
uk: :exc:`ValueError` виникає, коли рукостискання не виконано. Повернений словник містить додаткові елементи розширення X509v3, такі як ``crlDistributionPoints``, ``caIssuers`` і ``OCSP`` URI.

source: IPv6 address strings no longer have a trailing new line.
uk: Рядки адрес IPv6 більше не мають кінцевого нового рядка.

source: Returns a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used. If no connection has been established, returns ``None``.
uk: Повертає кортеж із трьох значень, що містить назву шифру, який використовується, версію протоколу SSL, яка визначає його використання, і кількість секретних бітів, які використовуються. Якщо з’єднання не встановлено, повертає ``None``.

source: Return the list of ciphers shared by the client during the handshake. Each entry of the returned list is a three-value tuple containing the name of the cipher, the version of the SSL protocol that defines its use, and the number of secret bits the cipher uses. :meth:`~SSLSocket.shared_ciphers` returns ``None`` if no connection has been established or the socket is a client socket.
uk: Повертає список шифрів, наданих клієнтом під час рукостискання. Кожен запис повернутого списку є кортежем із трьох значень, що містить назву шифру, версію протоколу SSL, яка визначає його використання, і кількість секретних бітів, які використовує шифр. :meth:`~SSLSocket.shared_ciphers` повертає ``None``, якщо з’єднання не встановлено або сокет є клієнтським.

source: Return the compression algorithm being used as a string, or ``None`` if the connection isn't compressed.
uk: Повертає використаний алгоритм стиснення у вигляді рядка або ``None``, якщо з'єднання не стиснуте.

source: If the higher-level protocol supports its own compression mechanism, you can use :data:`OP_NO_COMPRESSION` to disable SSL-level compression.
uk: Якщо протокол вищого рівня підтримує власний механізм стиснення, ви можете використовувати :data:`OP_NO_COMPRESSION`, щоб вимкнути стиснення на рівні SSL.

source: Get channel binding data for current connection, as a bytes object. Returns ``None`` if not connected or the handshake has not been completed.
uk: Отримайте дані прив’язки каналу для поточного з’єднання як об’єкт bytes. Повертає ``None``, якщо немає підключення або рукостискання не було завершено.

source: The *cb_type* parameter allow selection of the desired channel binding type. Valid channel binding types are listed in the :data:`CHANNEL_BINDING_TYPES` list. Currently only the 'tls-unique' channel binding, defined by :rfc:`5929`, is supported. :exc:`ValueError` will be raised if an unsupported channel binding type is requested.
uk: Параметр *cb_type* дозволяє вибрати потрібний тип прив’язки каналу. Дійсні типи зв’язування каналів наведено в списку :data:`CHANNEL_BINDING_TYPES`. Наразі підтримується лише прив’язка каналу "tls-unique", визначена :rfc:`5929`. :exc:`ValueError` буде викликано, якщо запитується непідтримуваний тип прив’язки каналу.
