Repository: python/python-docs-uk
Catalog: library/ssl.po
Languages: uk

source: Given the address ``addr`` of an SSL-protected server, as a (*hostname*, *port-number*) pair, fetches the server's certificate, and returns it as a PEM-encoded string. If ``ssl_version`` is specified, uses that version of the SSL protocol to attempt to connect to the server. If ``ca_certs`` is specified, it should be a file containing a list of root certificates, the same format as used for the same parameter in :meth:`SSLContext.wrap_socket`. The call will attempt to validate the server certificate against that set of root certificates, and will fail if the validation attempt fails. A timeout can be specified with the ``timeout`` parameter.
uk: Враховуючи адресу ``addr`` сервера, захищеного SSL, у вигляді пари (*ім’я хоста*, *номер порту*) отримує сертифікат сервера та повертає його як рядок, закодований PEM. Якщо вказано ``ssl_version``, використовується ця версія протоколу SSL для спроби підключитися до сервера. Якщо вказано ``ca_certs``, це має бути файл, що містить список кореневих сертифікатів, у тому самому форматі, який використовується для того самого параметра в :meth:`SSLContext.wrap_socket`. Виклик спробує перевірити сертифікат сервера на відповідність цьому набору кореневих сертифікатів і завершиться невдачею, якщо спроба перевірки не вдасться. Тайм-аут можна вказати за допомогою параметра ``timeout``.

source: This function is now IPv6-compatible.
uk: Тепер ця функція сумісна з IPv6.

source: The default *ssl_version* is changed from :data:`PROTOCOL_SSLv3` to :data:`PROTOCOL_TLS` for maximum compatibility with modern servers.
uk: Стандартну *ssl_version* змінено з :data:`PROTOCOL_SSLv3` на :data:`PROTOCOL_TLS` для максимальної сумісності з сучасними серверами.

source: The *timeout* parameter was added.
uk: Додано параметр *timeout*.

source: Given a certificate as a DER-encoded blob of bytes, returns a PEM-encoded string version of the same certificate.
uk: Надано сертифікат як DER-кодований блок байтів, повертає PEM-кодовану рядкову версію того самого сертифіката.

source: Given a certificate as an ASCII PEM string, returns a DER-encoded sequence of bytes for that same certificate.
uk: Надано сертифікат як рядок ASCII PEM, повертає закодовану DER послідовність байтів для того самого сертифіката.

source: Returns a named tuple with paths to OpenSSL's default cafile and capath. The paths are the same as used by :meth:`SSLContext.set_default_verify_paths`. The return value is a :term:`named tuple` ``DefaultVerifyPaths``:
uk: Повертає іменований кортеж із шляхами до cafile і capath OpenSSL за замовчуванням. Шляхи такі самі, як і :meth:`SSLContext.set_default_verify_paths`. Поверненим значенням є :term:`named tuple` ``DefaultVerifyPaths``:

source: :attr:`cafile` - resolved path to cafile or ``None`` if the file doesn't exist,
uk: :attr:`cafile` - визначений шлях до cafile або ``None``, якщо файл не існує,

source: :attr:`capath` - resolved path to capath or ``None`` if the directory doesn't exist,
uk: :attr:`capath` - дозволений шлях до capath або ``None``, якщо каталог не існує,

source: :attr:`openssl_cafile_env` - OpenSSL's environment key that points to a cafile,
uk: :attr:`openssl_cafile_env` - ключ середовища OpenSSL, який вказує на cafile,

source: :attr:`openssl_cafile` - hard coded path to a cafile,
uk: :attr:`openssl_cafile` - жорстко закодований шлях до cafile,

source: :attr:`openssl_capath_env` - OpenSSL's environment key that points to a capath,
uk: :attr:`openssl_capath_env` - ключ середовища OpenSSL, який вказує на capath,

source: :attr:`openssl_capath` - hard coded path to a capath directory
uk: :attr:`openssl_capath` - жорстко закодований шлях до каталогу capath

source: :ref:`Availability <availability>`: LibreSSL ignores the environment vars :attr:`openssl_cafile_env` and :attr:`openssl_capath_env`.
uk: :ref:`Доступність <availability>`: LibreSSL ігнорує змінні середовища :attr:`openssl_cafile_env` і :attr:`openssl_capath_env`.

source: Retrieve certificates from Windows' system cert store. *store_name* may be one of ``CA``, ``ROOT`` or ``MY``. Windows may provide additional cert stores, too.
uk: Отримати сертифікати зі сховища сертифікатів системи Windows. *store_name* може бути одним із ``CA``, ``ROOT`` або ``MY``. Windows також може надавати додаткові сховища сертифікатів.

source: The function returns a list of (cert_bytes, encoding_type, trust) tuples. The encoding_type specifies the encoding of cert_bytes. It is either :const:`x509_asn` for X.509 ASN.1 data or :const:`pkcs_7_asn` for PKCS#7 ASN.1 data. Trust specifies the purpose of the certificate as a set of OIDS or exactly ``True`` if the certificate is trustworthy for all purposes.
uk: Функція повертає список кортежів (cert_bytes, encoding_type, trust). Encoding_type визначає кодування cert_bytes. Це або :const:`x509_asn` для даних X.509 ASN.1, або :const:`pkcs_7_asn` для даних PKCS#7 ASN.1. Trust визначає призначення сертифіката як набір OIDS або точно ``True``, якщо сертифікат є надійним для всіх цілей.

source: Example::
uk: Приклад::

source: :ref:`Availability <availability>`: Windows.
uk: :ref:`Наявність <availability>`: Windows.

source: Retrieve CRLs from Windows' system cert store. *store_name* may be one of ``CA``, ``ROOT`` or ``MY``. Windows may provide additional cert stores, too.
uk: Отримати CRL із сховища системних сертифікатів Windows. *store_name* може бути одним із ``CA``, ``ROOT`` або ``MY``. Windows також може надавати додаткові сховища сертифікатів.

source: The function returns a list of (cert_bytes, encoding_type, trust) tuples. The encoding_type specifies the encoding of cert_bytes. It is either :const:`x509_asn` for X.509 ASN.1 data or :const:`pkcs_7_asn` for PKCS#7 ASN.1 data.
uk: Функція повертає список кортежів (cert_bytes, encoding_type, trust). Encoding_type визначає кодування cert_bytes. Це або :const:`x509_asn` для даних X.509 ASN.1, або :const:`pkcs_7_asn` для даних PKCS#7 ASN.1.

source: Takes an instance ``sock`` of :class:`socket.socket`, and returns an instance of :class:`ssl.SSLSocket`, a subtype of :class:`socket.socket`, which wraps the underlying socket in an SSL context. ``sock`` must be a :data:`~socket.SOCK_STREAM` socket; other socket types are unsupported.
uk: Бере екземпляр ``sock`` :class:`socket.socket` і повертає екземпляр :class:`ssl.SSLSocket`, підтип :class:`socket.socket`, який обертає основний сокет у контекст SSL. ``sock`` має бути :data:`~socket.SOCK_STREAM` сокетом; інші типи сокетів не підтримуються.

source: Internally, function creates a :class:`SSLContext` with protocol *ssl_version* and :attr:`SSLContext.options` set to *cert_reqs*. If parameters *keyfile*, *certfile*, *ca_certs* or *ciphers* are set, then the values are passed to :meth:`SSLContext.load_cert_chain`, :meth:`SSLContext.load_verify_locations`, and :meth:`SSLContext.set_ciphers`.
uk: Внутрішньо функція створює :class:`SSLContext` із протоколом *ssl_version* і :attr:`SSSLContext.options` зі значенням *cert_reqs*. Якщо встановлено параметри *keyfile*, *certfile*, *ca_certs* або *ciphers*, тоді значення передаються до :meth:`SSLContext.load_cert_chain`, :meth:`SSLContext.load_verify_locations` і :meth:`SSLContext .set_ciphers`.

source: The arguments *server_side*, *do_handshake_on_connect*, and *suppress_ragged_eofs* have the same meaning as :meth:`SSLContext.wrap_socket`.
uk: Аргументи *server_side*, *do_handshake_on_connect* і *suppress_ragged_eofs* мають те саме значення, що й :meth:`SSLContext.wrap_socket`.

source: Since Python 3.2 and 2.7.9, it is recommended to use the :meth:`SSLContext.wrap_socket` instead of :func:`wrap_socket`. The top-level function is limited and creates an insecure client socket without server name indication or hostname matching.
uk: Починаючи з Python 3.2 і 2.7.9, рекомендується використовувати :meth:`SSLContext.wrap_socket` замість :func:`wrap_socket`. Функція верхнього рівня обмежена та створює незахищений клієнтський сокет без індикації імені сервера або відповідності імені хоста.

source: Constants
uk: Константи

source: All constants are now :class:`enum.IntEnum` or :class:`enum.IntFlag` collections.
uk: Усі константи тепер є колекціями :class:`enum.IntEnum` або :class:`enum.IntFlag`.

source: Possible value for :attr:`SSLContext.verify_mode`, or the ``cert_reqs`` parameter to :func:`wrap_socket`. Except for :const:`PROTOCOL_TLS_CLIENT`, it is the default mode. With client-side sockets, just about any cert is accepted. Validation errors, such as untrusted or expired cert, are ignored and do not abort the TLS/SSL handshake.
uk: Можливе значення для :attr:`SSLContext.verify_mode` або параметра ``cert_reqs`` для :func:`wrap_socket`. За винятком :const:`PROTOCOL_TLS_CLIENT`, це режим за замовчуванням. З сокетами на стороні клієнта приймаються майже будь-які сертифікати. Помилки перевірки, такі як ненадійний або прострочений сертифікат, ігноруються та не переривають рукостискання TLS/SSL.

source: In server mode, no certificate is requested from the client, so the client does not send any for client cert authentication.
uk: У режимі сервера від клієнта не запитується сертифікат, тому клієнт не надсилає жодного сертифіката для автентифікації клієнта.

source: See the discussion of :ref:`ssl-security` below.
uk: Дивіться обговорення :ref:`ssl-security` нижче.

source: Possible value for :attr:`SSLContext.verify_mode`, or the ``cert_reqs`` parameter to :func:`wrap_socket`. In client mode, :const:`CERT_OPTIONAL` has the same meaning as :const:`CERT_REQUIRED`. It is recommended to use :const:`CERT_REQUIRED` for client-side sockets instead.
uk: Можливе значення для :attr:`SSLContext.verify_mode` або параметра ``cert_reqs`` для :func:`wrap_socket`. У режимі клієнта :const:`CERT_OPTIONAL` має те саме значення, що і :const:`CERT_REQUIRED`. Рекомендується використовувати :const:`CERT_REQUIRED` для клієнтських сокетів.

source: In server mode, a client certificate request is sent to the client. The client may either ignore the request or send a certificate in order perform TLS client cert authentication. If the client chooses to send a certificate, it is verified. Any verification error immediately aborts the TLS handshake.
uk: У режимі сервера клієнту надсилається запит на сертифікат клієнта. Клієнт може або проігнорувати запит, або надіслати сертифікат, щоб виконати автентифікацію клієнта за допомогою TLS. Якщо клієнт вирішує надіслати сертифікат, він перевіряється. Будь-яка помилка перевірки негайно перериває рукостискання TLS.

source: Use of this setting requires a valid set of CA certificates to be passed, either to :meth:`SSLContext.load_verify_locations` or as a value of the ``ca_certs`` parameter to :func:`wrap_socket`.
uk: Для використання цього параметра потрібен дійсний набір сертифікатів ЦС у :meth:`SSLContext.load_verify_locations` або як значення параметра ``ca_certs`` у :func:`wrap_socket`.

source: Possible value for :attr:`SSLContext.verify_mode`, or the ``cert_reqs`` parameter to :func:`wrap_socket`. In this mode, certificates are required from the other side of the socket connection; an :class:`SSLError` will be raised if no certificate is provided, or if its validation fails. This mode is **not** sufficient to verify a certificate in client mode as it does not match hostnames. :attr:`~SSLContext.check_hostname` must be enabled as well to verify the authenticity of a cert. :const:`PROTOCOL_TLS_CLIENT` uses :const:`CERT_REQUIRED` and enables :attr:`~SSLContext.check_hostname` by default.
uk: Можливе значення для :attr:`SSLContext.verify_mode` або параметра ``cert_reqs`` для :func:`wrap_socket`. У цьому режимі потрібні сертифікати з іншого боку сокет-з’єднання; :class:`SSLError` буде викликано, якщо сертифікат не надано, або якщо його перевірка не вдається. Цього режиму **не** достатньо для перевірки сертифіката в режимі клієнта, оскільки він не відповідає іменам хостів. :attr:`~SSLContext.check_hostname` також має бути ввімкнено, щоб перевірити автентичність сертифіката. :const:`PROTOCOL_TLS_CLIENT` використовує :const:`CERT_REQUIRED` і вмикає :attr:`~SSLContext.check_hostname` за умовчанням.

source: With server socket, this mode provides mandatory TLS client cert authentication. A client certificate request is sent to the client and the client must provide a valid and trusted certificate.
uk: З серверним сокетом цей режим забезпечує обов’язкову автентифікацію клієнта за допомогою TLS. Запит на сертифікат клієнта надсилається клієнту, і клієнт повинен надати дійсний і надійний сертифікат.

source: :class:`enum.IntEnum` collection of CERT_* constants.
uk: :class:`enum.IntEnum` колекція констант CERT_*.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, certificate revocation lists (CRLs) are not checked. By default OpenSSL does neither require nor verify CRLs.
uk: Можливе значення для :attr:`SSLContext.verify_flags`. У цьому режимі списки відкликаних сертифікатів (CRL) не перевіряються. За замовчуванням OpenSSL не вимагає і не перевіряє CRL.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, only the peer cert is checked but none of the intermediate CA certificates. The mode requires a valid CRL that is signed by the peer cert's issuer (its direct ancestor CA). If no proper CRL has been loaded with :attr:`SSLContext.load_verify_locations`, validation will fail.
uk: Можливе значення для :attr:`SSLContext.verify_flags`. У цьому режимі перевіряється лише одноранговий сертифікат, але не перевіряються проміжні сертифікати ЦС. Для режиму потрібен дійсний CRL, підписаний видавцем однорангового сертифіката (його прямим предком CA). Якщо не було завантажено відповідний CRL з :attr:`SSLContext.load_verify_locations`, перевірка не вдасться.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, CRLs of all certificates in the peer cert chain are checked.
uk: Можливе значення для :attr:`SSLContext.verify_flags`. У цьому режимі перевіряються CRL усіх сертифікатів у ланцюжку однорангових сертифікатів.

source: Possible value for :attr:`SSLContext.verify_flags` to disable workarounds for broken X.509 certificates.
uk: Можливе значення для :attr:`SSLContext.verify_flags` для вимкнення обхідних шляхів для пошкоджених сертифікатів X.509.

source: Possible value for :attr:`SSLContext.verify_flags` to enables proxy certificate verification.
uk: Можливе значення для :attr:`SSLContext.verify_flags` для ввімкнення перевірки сертифіката проксі.

source: Possible value for :attr:`SSLContext.verify_flags`. It instructs OpenSSL to prefer trusted certificates when building the trust chain to validate a certificate. This flag is enabled by default.
uk: Можливе значення для :attr:`SSLContext.verify_flags`. Він наказує OpenSSL віддавати перевагу надійним сертифікатам під час побудови ланцюжка довіри для перевірки сертифіката. Цей прапорець увімкнено за замовчуванням.

source: Possible value for :attr:`SSLContext.verify_flags`. It instructs OpenSSL to accept intermediate CAs in the trust store to be treated as trust-anchors, in the same way as the self-signed root CA certificates. This makes it possible to trust certificates issued by an intermediate CA without having to trust its ancestor root CA.
uk: Можливе значення для :attr:`SSLContext.verify_flags`. Він наказує OpenSSL приймати проміжні ЦС у довірчому сховищі, щоб вони розглядалися як прив’язки довіри, так само, як і самопідписані кореневі сертифікати ЦС. Це дає змогу довіряти сертифікатам, виданим проміжним ЦС, не довіряючи кореневому ЦС предка.

source: :class:`enum.IntFlag` collection of VERIFY_* constants.
uk: :class:`enum.IntFlag` колекція констант VERIFY_*.

source: Selects the highest protocol version that both the client and server support. Despite the name, this option can select both "SSL" and "TLS" protocols.
uk: Вибирає найвищу версію протоколу, яку підтримують як клієнт, так і сервер. Незважаючи на назву, ця опція може вибрати як протоколи "SSL", так і "TLS".

source: TLS clients and servers require different default settings for secure communication. The generic TLS protocol constant is deprecated in favor of :data:`PROTOCOL_TLS_CLIENT` and :data:`PROTOCOL_TLS_SERVER`.
uk: Клієнтам і серверам TLS потрібні різні параметри за замовчуванням для безпечного зв’язку. Загальна константа протоколу TLS застаріла на користь :data:`PROTOCOL_TLS_CLIENT` і :data:`PROTOCOL_TLS_SERVER`.

source: Auto-negotiate the highest protocol version that both the client and server support, and configure the context client-side connections. The protocol enables :data:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` by default.
uk: Автоматичне узгодження найвищої версії протоколу, яку підтримують як клієнт, так і сервер, і налаштування контекстних підключень на стороні клієнта. Протокол вмикає :data:`CERT_REQUIRED` і :attr:`~SSSLContext.check_hostname` за умовчанням.

source: Auto-negotiate the highest protocol version that both the client and server support, and configure the context server-side connections.
uk: Автоматичне узгодження найвищої версії протоколу, яку підтримують як клієнт, так і сервер, і налаштування контекстних підключень на стороні сервера.

source: Alias for :data:`PROTOCOL_TLS`.
uk: Псевдонім для :data:`PROTOCOL_TLS`.

source: Use :data:`PROTOCOL_TLS` instead.
uk: Натомість використовуйте :data:`PROTOCOL_TLS`.

source: Selects SSL version 2 as the channel encryption protocol.
uk: Вибирає SSL версії 2 як протокол шифрування каналу.

source: This protocol is not available if OpenSSL is compiled with the ``no-ssl2`` option.
uk: Цей протокол недоступний, якщо OpenSSL скомпільовано з опцією ``no-ssl2``.

source: SSL version 2 is insecure. Its use is highly discouraged.
uk: SSL версії 2 небезпечний. Його використання вкрай не рекомендується.

source: OpenSSL has removed support for SSLv2.
uk: OpenSSL припиняє підтримку SSLv2.

source: Selects SSL version 3 as the channel encryption protocol.
uk: Вибирає SSL версії 3 як протокол шифрування каналу.

source: This protocol is not available if OpenSSL is compiled with the ``no-ssl3`` option.
uk: Цей протокол недоступний, якщо OpenSSL скомпільовано з опцією ``no-ssl3``.

source: SSL version 3 is insecure. Its use is highly discouraged.
uk: SSL версії 3 небезпечний. Його використання вкрай не рекомендується.

source: OpenSSL has deprecated all version specific protocols. Use the default protocol :data:`PROTOCOL_TLS_SERVER` or :data:`PROTOCOL_TLS_CLIENT` with :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
uk: OpenSSL не підтримує всі протоколи для окремих версій. Замість цього використовуйте протокол за замовчуванням :data:`PROTOCOL_TLS_SERVER` або :data:`PROTOCOL_TLS_CLIENT` з :attr:`SSLContext.minimum_version` і :attr:`SSLContext.maximum_version`.

source: Selects TLS version 1.0 as the channel encryption protocol.
uk: Вибирає TLS версії 1.0 як протокол шифрування каналу.

source: OpenSSL has deprecated all version specific protocols.
uk: OpenSSL не підтримує всі протоколи для окремих версій.

source: Selects TLS version 1.1 as the channel encryption protocol. Available only with openssl version 1.0.1+.
uk: Вибирає TLS версії 1.1 як протокол шифрування каналу. Доступно лише з openssl версії 1.0.1+.

source: Selects TLS version 1.2 as the channel encryption protocol. Available only with openssl version 1.0.1+.
uk: Вибирає TLS версії 1.2 як протокол шифрування каналу. Доступно лише з openssl версії 1.0.1+.

source: Enables workarounds for various bugs present in other SSL implementations. This option is set by default. It does not necessarily set the same flags as OpenSSL's ``SSL_OP_ALL`` constant.
uk: Дозволяє обійти різні помилки, наявні в інших реалізаціях SSL. Ця опція встановлена за замовчуванням. Він не обов’язково встановлює ті самі позначки, що й константа ``SSL_OP_ALL`` OpenSSL.

source: Prevents an SSLv2 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing SSLv2 as the protocol version.
uk: Запобігає підключенню SSLv2. Цей параметр застосовний лише в поєднанні з :const:`PROTOCOL_TLS`. Це запобігає вибору одноранговими вузлами SSLv2 як версії протоколу.

source: SSLv2 is deprecated
uk: SSLv2 застарів

source: Prevents an SSLv3 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing SSLv3 as the protocol version.
uk: Запобігає підключенню SSLv3. Цей параметр застосовний лише в поєднанні з :const:`PROTOCOL_TLS`. Це запобігає вибору одноранговими вузлами SSLv3 як версії протоколу.

source: SSLv3 is deprecated
uk: SSLv3 застарів

source: Prevents a TLSv1 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1 as the protocol version.
uk: Запобігає підключенню TLSv1. Цей параметр застосовний лише в поєднанні з :const:`PROTOCOL_TLS`. Це запобігає вибору партнерами TLSv1 як версії протоколу.

source: The option is deprecated since OpenSSL 1.1.0, use the new :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
uk: Опція застаріла з OpenSSL 1.1.0, замість неї використовуйте нові :attr:`SSLContext.minimum_version` і :attr:`SSSLContext.maximum_version`.

source: Prevents a TLSv1.1 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.1 as the protocol version. Available only with openssl version 1.0.1+.
uk: Запобігає підключенню TLSv1.1. Цей параметр застосовний лише в поєднанні з :const:`PROTOCOL_TLS`. Це запобігає вибору одноранговими вузлами TLSv1.1 як версії протоколу. Доступно лише з openssl версії 1.0.1+.

source: The option is deprecated since OpenSSL 1.1.0.
uk: Опція застаріла з OpenSSL 1.1.0.

source: Prevents a TLSv1.2 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.2 as the protocol version. Available only with openssl version 1.0.1+.
uk: Запобігає підключенню TLSv1.2. Цей параметр застосовний лише в поєднанні з :const:`PROTOCOL_TLS`. Це запобігає вибору одноранговими вузлами TLSv1.2 як версії протоколу. Доступно лише з openssl версії 1.0.1+.

source: Prevents a TLSv1.3 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.3 as the protocol version. TLS 1.3 is available with OpenSSL 1.1.1 or later. When Python has been compiled against an older version of OpenSSL, the flag defaults to *0*.
uk: Запобігає підключенню TLSv1.3. Цей параметр застосовний лише в поєднанні з :const:`PROTOCOL_TLS`. Це запобігає вибору одноранговими вузлами TLSv1.3 як версії протоколу. TLS 1.3 доступний з OpenSSL 1.1.1 або новішої версії. Якщо Python скомпільовано зі старішою версією OpenSSL, прапорець за замовчуванням має значення *0*.

source: The option is deprecated since OpenSSL 1.1.0. It was added to 2.7.15, 3.6.3 and 3.7.0 for backwards compatibility with OpenSSL 1.0.2.
uk: Опція застаріла з OpenSSL 1.1.0. Він був доданий до 2.7.15, 3.6.3 і 3.7.0 для зворотної сумісності з OpenSSL 1.0.2.

source: Disable all renegotiation in TLSv1.2 and earlier. Do not send HelloRequest messages, and ignore renegotiation requests via ClientHello.
uk: Вимкніть усі повторні узгодження в TLSv1.2 і попередніх версіях. Не надсилайте повідомлення HelloRequest і ігноруйте запити на повторне узгодження через ClientHello.

source: This option is only available with OpenSSL 1.1.0h and later.
uk: Ця опція доступна лише для OpenSSL 1.1.0h і пізніших версій.

source: Use the server's cipher ordering preference, rather than the client's. This option has no effect on client sockets and SSLv2 server sockets.
uk: Використовуйте параметри впорядкування шифрів сервера, а не клієнта. Цей параметр не впливає на клієнтські сокети та серверні сокети SSLv2.
