Repository: python/python-docs-uk
Catalog: library/ssl.po
Languages: uk

source: Return the protocol that was selected during the TLS handshake. If :meth:`SSLContext.set_alpn_protocols` was not called, if the other party does not support ALPN, if this socket does not support any of the client's proposed protocols, or if the handshake has not happened yet, ``None`` is returned.
uk: Повернути протокол, вибраний під час рукостискання TLS. Якщо :meth:`SSLContext.set_alpn_protocols` не було викликано, якщо інша сторона не підтримує ALPN, якщо цей сокет не підтримує жодного із запропонованих клієнтом протоколів або якщо рукостискання ще не відбулося, ``None`` буде повернувся.

source: Return the higher-level protocol that was selected during the TLS/SSL handshake. If :meth:`SSLContext.set_npn_protocols` was not called, or if the other party does not support NPN, or if the handshake has not yet happened, this will return ``None``.
uk: Повернути протокол вищого рівня, вибраний під час рукостискання TLS/SSL. Якщо :meth:`SSLContext.set_npn_protocols` не було викликано, або якщо інша сторона не підтримує NPN, або якщо рукостискання ще не відбулося, це поверне ``None``.

source: NPN has been superseded by ALPN
uk: NPN було замінено на ALPN

source: Performs the SSL shutdown handshake, which removes the TLS layer from the underlying socket, and returns the underlying socket object. This can be used to go from encrypted operation over a connection to unencrypted. The returned socket should always be used for further communication with the other side of the connection, rather than the original socket.
uk: Виконує рукостискання завершення роботи SSL, яке видаляє рівень TLS із базового сокета та повертає базовий об’єкт сокета. Це можна використовувати для переходу від зашифрованої операції через з’єднання до незашифрованої. Повернений сокет завжди слід використовувати для подальшого зв’язку з іншою стороною з’єднання, а не оригінальний сокет.

source: Requests post-handshake authentication (PHA) from a TLS 1.3 client. PHA can only be initiated for a TLS 1.3 connection from a server-side socket, after the initial TLS handshake and with PHA enabled on both sides, see :attr:`SSLContext.post_handshake_auth`.
uk: Запитує автентифікацію після рукостискання (PHA) від клієнта TLS 1.3. PHA можна ініціювати лише для з’єднання TLS 1.3 із сокета на стороні сервера після початкового рукостискання TLS і з увімкненим PHA з обох сторін, див. :attr:`SSLContext.post_handshake_auth`.

source: The method does not perform a cert exchange immediately. The server-side sends a CertificateRequest during the next write event and expects the client to respond with a certificate on the next read event.
uk: Метод не виконує обмін сертифікатами негайно. Сторона сервера надсилає CertificateRequest під час наступної події запису та очікує, що клієнт відповість сертифікатом під час наступної події читання.

source: If any precondition isn't met (e.g. not TLS 1.3, PHA not enabled), an :exc:`SSLError` is raised.
uk: Якщо будь-яка передумова не виконується (наприклад, не TLS 1.3, PHA не ввімкнено), виникає :exc:`SSLError`.

source: Only available with OpenSSL 1.1.1 and TLS 1.3 enabled. Without TLS 1.3 support, the method raises :exc:`NotImplementedError`.
uk: Доступно лише з увімкненими OpenSSL 1.1.1 і TLS 1.3. Без підтримки TLS 1.3 метод викликає :exc:`NotImplementedError`.

source: Return the actual SSL protocol version negotiated by the connection as a string, or ``None`` if no secure connection is established. As of this writing, possible return values include ``"SSLv2"``, ``"SSLv3"``, ``"TLSv1"``, ``"TLSv1.1"`` and ``"TLSv1.2"``. Recent OpenSSL versions may define more return values.
uk: Повертає фактичну версію протоколу SSL, узгоджену з’єднанням, у вигляді рядка або "Немає", якщо безпечне з’єднання не встановлено. На момент написання цієї статті можливі значення, що повертаються, включають ``"SSLv2"``, ``"SSLv3"``, ``"TLSv1"``, ``"TLSv1.1"`` і ``"TLSv1.2"``. Останні версії OpenSSL можуть визначати більше значень, що повертаються.

source: Returns the number of already decrypted bytes available for read, pending on the connection.
uk: Повертає кількість уже розшифрованих байтів, доступних для читання, які очікують підключення.

source: The :class:`SSLContext` object this SSL socket is tied to. If the SSL socket was created using the deprecated :func:`wrap_socket` function (rather than :meth:`SSLContext.wrap_socket`), this is a custom context object created for this SSL socket.
uk: Об’єкт :class:`SSLContext`, до якого прив’язаний цей SSL-сокет. Якщо SSL-сокет було створено за допомогою застарілої функції :func:`wrap_socket` (а не :meth:`SSSLContext.wrap_socket`), це спеціальний контекстний об’єкт, створений для цього SSL-сокета.

source: A boolean which is ``True`` for server-side sockets and ``False`` for client-side sockets.
uk: Логічне значення, яке має значення ``True`` для сокетів на стороні сервера та ``False`` для сокетів на стороні клієнта.

source: Hostname of the server: :class:`str` type, or ``None`` for server-side socket or if the hostname was not specified in the constructor.
uk: Ім’я хоста сервера: тип :class:`str` або ``None`` для серверного сокета або якщо ім’я хосту не було вказано в конструкторі.

source: The attribute is now always ASCII text. When ``server_hostname`` is an internationalized domain name (IDN), this attribute now stores the A-label form (``"xn--pythn-mua.org"``), rather than the U-label form (``"pythön.org"``).
uk: Тепер атрибут завжди є текстом ASCII. Якщо ``server_hostname`` є інтернаціоналізованим доменним іменем (IDN), цей атрибут тепер зберігає форму A-мітки (``"xn--pythn-mua.org"``), а не форму U-мітки (``"pythön.org"``).

source: The :class:`SSLSession` for this SSL connection. The session is available for client and server side sockets after the TLS handshake has been performed. For client sockets the session can be set before :meth:`~SSLSocket.do_handshake` has been called to reuse a session.
uk: :class:`SSLSession` для цього з’єднання SSL. Сеанс доступний для сокетів на стороні клієнта та сервера після того, як було виконано рукостискання TLS. Для клієнтських сокетів сеанс можна встановити до виклику :meth:`~SSLSocket.do_handshake` для повторного використання сеансу.

source: SSL Contexts
uk: Контексти SSL

source: An SSL context holds various data longer-lived than single SSL connections, such as SSL configuration options, certificate(s) and private key(s). It also manages a cache of SSL sessions for server-side sockets, in order to speed up repeated connections from the same clients.
uk: Контекст SSL зберігає різноманітні дані, які живуть довше, ніж окремі з’єднання SSL, наприклад параметри конфігурації SSL, сертифікат(и) і закритий ключ(и). Він також керує кеш-пам’яттю сеансів SSL для сокетів на стороні сервера, щоб пришвидшити повторювані підключення від тих самих клієнтів.

source: Create a new SSL context. You may pass *protocol* which must be one of the ``PROTOCOL_*`` constants defined in this module. The parameter specifies which version of the SSL protocol to use. Typically, the server chooses a particular protocol version, and the client must adapt to the server's choice. Most of the versions are not interoperable with the other versions. If not specified, the default is :data:`PROTOCOL_TLS`; it provides the most compatibility with other versions.
uk: Створіть новий контекст SSL. Ви можете передати *протокол*, який має бути однією з констант ``PROTOCOL_*``, визначених у цьому модулі. Параметр визначає, яку версію протоколу SSL використовувати. Як правило, сервер вибирає певну версію протоколу, а клієнт повинен адаптуватися до вибору сервера. Більшість версій не сумісні з іншими версіями. Якщо не вказано, типовим є :data:`PROTOCOL_TLS`; він забезпечує найбільшу сумісність з іншими версіями.

source: Here's a table showing which versions in a client (down the side) can connect to which versions in a server (along the top):
uk: Ось таблиця, яка показує, які версії клієнта (збоку) можуть підключатися до яких версій на сервері (вгорі):

source: *client* / **server**
uk: *клієнт* / **сервер**

source: yes
uk: так

source: no
uk: ні

source: no [1]_
uk: ні [1]_

source: no [2]_
uk: ні [2]_

source: Footnotes
uk: Виноски

source: :class:`SSLContext` disables SSLv2 with :data:`OP_NO_SSLv2` by default.
uk: :class:`SSLContext` вимикає SSLv2 за допомогою :data:`OP_NO_SSLv2` за замовчуванням.

source: :class:`SSLContext` disables SSLv3 with :data:`OP_NO_SSLv3` by default.
uk: :class:`SSLContext` вимикає SSLv3 за допомогою :data:`OP_NO_SSLv3` за замовчуванням.

source: TLS 1.3 protocol will be available with :data:`PROTOCOL_TLS` in OpenSSL >= 1.1.1. There is no dedicated PROTOCOL constant for just TLS 1.3.
uk: Протокол TLS 1.3 буде доступний із :data:`PROTOCOL_TLS` у OpenSSL >= 1.1.1. Немає виділеної константи PROTOCOL лише для TLS 1.3.

source: :func:`create_default_context` lets the :mod:`ssl` module choose security settings for a given purpose.
uk: :func:`create_default_context` дозволяє модулю :mod:`ssl` вибрати параметри безпеки для певної мети.

source: The context is created with secure default values. The options :data:`OP_NO_COMPRESSION`, :data:`OP_CIPHER_SERVER_PREFERENCE`, :data:`OP_SINGLE_DH_USE`, :data:`OP_SINGLE_ECDH_USE`, :data:`OP_NO_SSLv2` (except for :data:`PROTOCOL_SSLv2`), and :data:`OP_NO_SSLv3` (except for :data:`PROTOCOL_SSLv3`) are set by default. The initial cipher suite list contains only ``HIGH`` ciphers, no ``NULL`` ciphers and no ``MD5`` ciphers (except for :data:`PROTOCOL_SSLv2`).
uk: Контекст створюється із безпечними значеннями за замовчуванням. Параметри :data:`OP_NO_COMPRESSION`, :data:`OP_CIPHER_SERVER_PREFERENCE`, :data:`OP_SINGLE_DH_USE`, :data:`OP_SINGLE_ECDH_USE`, :data:`OP_NO_SSLv2` (крім :data:`PROTOCOL_SSLv2`) і :data:`OP_NO_SSLv3` (крім :data:`PROTOCOL_SSLv3`) встановлено за замовчуванням. Початковий список набору шифрів містить лише шифри ``HIGH``, шифри ``NULL`` і шифри ``MD5`` (крім :data:`PROTOCOL_SSLv2`).

source: :class:`SSLContext` without protocol argument is deprecated. The context class will either require :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER` protocol in the future.
uk: :class:`SSLContext` без аргументу протоколу застаріло. У майбутньому клас контексту потребуватиме протоколу :data:`PROTOCOL_TLS_CLIENT` або :data:`PROTOCOL_TLS_SERVER`.

source: The default cipher suites now include only secure AES and ChaCha20 ciphers with forward secrecy and security level 2. RSA and DH keys with less than 2048 bits and ECC keys with less than 224 bits are prohibited. :data:`PROTOCOL_TLS`, :data:`PROTOCOL_TLS_CLIENT`, and :data:`PROTOCOL_TLS_SERVER` use TLS 1.2 as minimum TLS version.
uk: Набір шифрів за замовчуванням тепер включає лише захищені шифри AES і ChaCha20 із прямою секретністю та рівнем безпеки 2. Ключі RSA та DH із менш ніж 2048 бітами та ключі ECC із менш ніж 224 бітами заборонені. :data:`PROTOCOL_TLS`, :data:`PROTOCOL_TLS_CLIENT` і :data:`PROTOCOL_TLS_SERVER` використовують TLS 1.2 як мінімальну версію TLS.

source: :class:`SSLContext` objects have the following methods and attributes:
uk: :class:`SSLContext` об’єкти мають такі методи та атрибути:

source: Get statistics about quantities of loaded X.509 certificates, count of X.509 certificates flagged as CA certificates and certificate revocation lists as dictionary.
uk: Отримайте статистичні дані про кількість завантажених сертифікатів X.509, кількість сертифікатів X.509, позначених як сертифікати ЦС, і списки відкликаних сертифікатів як словник.

source: Example for a context with one CA cert and one other cert::
uk: Приклад для контексту з одним сертифікатом CA та одним іншим сертифікатом::

source: Load a private key and the corresponding certificate. The *certfile* string must be the path to a single file in PEM format containing the certificate as well as any number of CA certificates needed to establish the certificate's authenticity. The *keyfile* string, if present, must point to a file containing the private key. Otherwise the private key will be taken from *certfile* as well. See the discussion of :ref:`ssl-certificates` for more information on how the certificate is stored in the *certfile*.
uk: Завантажте закритий ключ і відповідний сертифікат. Рядок *certfile* має бути шляхом до одного файлу у форматі PEM, що містить сертифікат, а також будь-яку кількість сертифікатів ЦС, необхідних для встановлення автентичності сертифіката. Рядок *keyfile*, якщо він присутній, має вказувати на файл, що містить закритий ключ. Інакше закритий ключ також буде взято з *certfile*. Перегляньте обговорення :ref:`ssl-certificates` для отримання додаткової інформації про те, як сертифікат зберігається у *certfile*.

source: The *password* argument may be a function to call to get the password for decrypting the private key. It will only be called if the private key is encrypted and a password is necessary. It will be called with no arguments, and it should return a string, bytes, or bytearray. If the return value is a string it will be encoded as UTF-8 before using it to decrypt the key. Alternatively a string, bytes, or bytearray value may be supplied directly as the *password* argument. It will be ignored if the private key is not encrypted and no password is needed.
uk: Аргумент *password* може бути функцією для виклику, щоб отримати пароль для розшифровки закритого ключа. Він буде викликаний, лише якщо закритий ключ зашифрований і потрібен пароль. Він буде викликаний без аргументів і повинен повернути рядок, байти або масив байтів. Якщо значення, що повертається, є рядком, воно буде закодовано як UTF-8 перед використанням для розшифровки ключа. Крім того, значення рядка, байтів або масиву байтів можна надати безпосередньо як аргумент *пароль*. Він буде проігнорований, якщо закритий ключ не зашифрований і пароль не потрібен.

source: If the *password* argument is not specified and a password is required, OpenSSL's built-in password prompting mechanism will be used to interactively prompt the user for a password.
uk: Якщо аргумент *password* не вказано, а пароль потрібен, вбудований механізм підказки пароля OpenSSL буде використано для інтерактивного запиту користувача пароля.

source: An :class:`SSLError` is raised if the private key doesn't match with the certificate.
uk: :class:`SSLError` виникає, якщо закритий ключ не збігається з сертифікатом.

source: New optional argument *password*.
uk: Новий необов'язковий аргумент *пароль*.

source: Load a set of default "certification authority" (CA) certificates from default locations. On Windows it loads CA certs from the ``CA`` and ``ROOT`` system stores. On all systems it calls :meth:`SSLContext.set_default_verify_paths`. In the future the method may load CA certificates from other locations, too.
uk: Завантажте набір стандартних сертифікатів "центру сертифікації" (CA) із стандартних розташувань. У Windows він завантажує сертифікати ЦС із системних сховищ ``CA`` і ``ROOT``. У всіх системах він викликає :meth:`SSLContext.set_default_verify_paths`. У майбутньому цей метод може також завантажувати сертифікати ЦС з інших місць.

source: The *purpose* flag specifies what kind of CA certificates are loaded. The default settings :data:`Purpose.SERVER_AUTH` loads certificates, that are flagged and trusted for TLS web server authentication (client side sockets). :data:`Purpose.CLIENT_AUTH` loads CA certificates for client certificate verification on the server side.
uk: Прапор *purpose* визначає тип сертифікатів ЦС, які завантажуються. Параметри за замовчуванням :data:`Purpose.SERVER_AUTH` завантажують сертифікати, які позначено та є довіреними для автентифікації веб-сервера TLS (сокети на стороні клієнта). :data:`Purpose.CLIENT_AUTH` завантажує сертифікати ЦС для перевірки сертифікатів клієнта на стороні сервера.

source: Load a set of "certification authority" (CA) certificates used to validate other peers' certificates when :data:`verify_mode` is other than :data:`CERT_NONE`. At least one of *cafile* or *capath* must be specified.
uk: Завантажте набір сертифікатів "центру сертифікації" (CA), які використовуються для перевірки сертифікатів інших вузлів, якщо :data:`verify_mode` відрізняється від :data:`CERT_NONE`. Потрібно вказати принаймні один із *cafile* або *capath*.

source: This method can also load certification revocation lists (CRLs) in PEM or DER format. In order to make use of CRLs, :attr:`SSLContext.verify_flags` must be configured properly.
uk: Цей метод також може завантажувати списки відкликаних сертифікатів (CRL) у форматі PEM або DER. Щоб використовувати CRL, :attr:`SSLContext.verify_flags` має бути правильно налаштовано.

source: The *cafile* string, if present, is the path to a file of concatenated CA certificates in PEM format. See the discussion of :ref:`ssl-certificates` for more information about how to arrange the certificates in this file.
uk: Рядок *cafile*, якщо він присутній, є шляхом до файлу об’єднаних сертифікатів ЦС у форматі PEM. Перегляньте обговорення :ref:`ssl-certificates` для отримання додаткової інформації про те, як упорядкувати сертифікати в цьому файлі.

source: The *capath* string, if present, is the path to a directory containing several CA certificates in PEM format, following an `OpenSSL specific layout <https://www.openssl.org/docs/manmaster/man3/SSL_CTX_load_verify_locations.html>`_.
uk: Рядок *capath*, якщо він присутній, є шляхом до каталогу, що містить кілька сертифікатів ЦС у форматі PEM, відповідно до `спеціального макета OpenSSL <https://www.openssl.org/docs/manmaster/man3/SSL_CTX_load_verify_locations.html>`_.

source: The *cadata* object, if present, is either an ASCII string of one or more PEM-encoded certificates or a :term:`bytes-like object` of DER-encoded certificates. Like with *capath* extra lines around PEM-encoded certificates are ignored but at least one certificate must be present.
uk: Об’єкт *cadata*, якщо він присутній, є рядком ASCII одного чи кількох сертифікатів у кодуванні PEM або :term:`bytes-like object` сертифікатів у кодуванні DER. Подібно до *capath* додаткові рядки навколо PEM-кодованих сертифікатів ігноруються, але принаймні один сертифікат має бути присутнім.

source: New optional argument *cadata*
uk: Новий необов'язковий аргумент *cadata*

source: Get a list of loaded "certification authority" (CA) certificates. If the ``binary_form`` parameter is :const:`False` each list entry is a dict like the output of :meth:`SSLSocket.getpeercert`. Otherwise the method returns a list of DER-encoded certificates. The returned list does not contain certificates from *capath* unless a certificate was requested and loaded by a SSL connection.
uk: Отримайте список завантажених сертифікатів "центру сертифікації" (CA). Якщо параметр ``binary_form`` має значення :const:`False`, кожен запис у списку є диктофоном, подібним до результату :meth:`SSLSocket.getpeercert`. В іншому випадку метод повертає список сертифікатів, закодованих DER. Повернений список не містить сертифікатів від *capath*, якщо тільки сертифікат не було запитано та завантажено через підключення SSL.

source: Certificates in a capath directory aren't loaded unless they have been used at least once.
uk: Сертифікати в каталозі capath не завантажуються, якщо вони не були використані принаймні один раз.

source: Get a list of enabled ciphers. The list is in order of cipher priority. See :meth:`SSLContext.set_ciphers`.
uk: Отримайте список увімкнених шифрів. Список розташований у порядку пріоритету шифру. Перегляньте :meth:`SSLContext.set_ciphers`.

source: Load a set of default "certification authority" (CA) certificates from a filesystem path defined when building the OpenSSL library. Unfortunately, there's no easy way to know whether this method succeeds: no error is returned if no certificates are to be found. When the OpenSSL library is provided as part of the operating system, though, it is likely to be configured properly.
uk: Завантажте набір стандартних сертифікатів "центру сертифікації" (CA) із шляху файлової системи, визначеного під час створення бібліотеки OpenSSL. На жаль, немає простого способу дізнатися, чи цей метод успішний: помилка не повертається, якщо сертифікати не знайдені. Однак, коли бібліотека OpenSSL надається як частина операційної системи, вона, швидше за все, буде налаштована належним чином.

source: Set the available ciphers for sockets created with this context. It should be a string in the `OpenSSL cipher list format <https://www.openssl.org/docs/manmaster/man1/ciphers.html>`_. If no cipher can be selected (because compile-time options or other configuration forbids use of all the specified ciphers), an :class:`SSLError` will be raised.
uk: Встановіть доступні шифри для сокетів, створених із цим контекстом. Це має бути рядок у `форматі списку шифрів OpenSSL <https://www.openssl.org/docs/manmaster/man1/ciphers.html>`_. Якщо жоден шифр не може бути обраний (оскільки параметри під час компіляції чи інша конфігурація забороняють використовувати всі вказані шифри), буде викликано :class:`SSLError`.

source: when connected, the :meth:`SSLSocket.cipher` method of SSL sockets will give the currently selected cipher.
uk: під час підключення метод :meth:`SSLSocket.cipher` для сокетів SSL дасть поточний вибраний шифр.

source: TLS 1.3 cipher suites cannot be disabled with :meth:`~SSLContext.set_ciphers`.
uk: Набори шифрів TLS 1.3 не можна вимкнути за допомогою :meth:`~SSLContext.set_ciphers`.

source: Specify which protocols the socket should advertise during the SSL/TLS handshake. It should be a list of ASCII strings, like ``['http/1.1', 'spdy/2']``, ordered by preference. The selection of a protocol will happen during the handshake, and will play out according to :rfc:`7301`. After a successful handshake, the :meth:`SSLSocket.selected_alpn_protocol` method will return the agreed-upon protocol.
uk: Укажіть, які протоколи має сповіщати сокет під час рукостискання SSL/TLS. Це має бути список рядків ASCII, наприклад ``['http/1.1', 'spdy/2']``, упорядкованих за перевагами. Вибір протоколу відбуватиметься під час рукостискання та відтворюватиметься відповідно до :rfc:`7301`. Після успішного рукостискання метод :meth:`SSLSocket.selected_alpn_protocol` поверне узгоджений протокол.

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_ALPN` is ``False``.
uk: Цей метод викличе :exc:`NotImplementedError`, якщо :data:`HAS_ALPN` має значення ``False``.

source: Specify which protocols the socket should advertise during the SSL/TLS handshake. It should be a list of strings, like ``['http/1.1', 'spdy/2']``, ordered by preference. The selection of a protocol will happen during the handshake, and will play out according to the `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. After a successful handshake, the :meth:`SSLSocket.selected_npn_protocol` method will return the agreed-upon protocol.
uk: Укажіть, які протоколи має сповіщати сокет під час рукостискання SSL/TLS. Це має бути список рядків, наприклад ``['http/1.1', 'spdy/2']``, упорядкованих за перевагами. Вибір протоколу відбуватиметься під час рукостискання та відтворюватиметься відповідно до `Узгодження протоколу прикладного рівня <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. Після успішного рукостискання метод :meth:`SSLSocket.selected_npn_protocol` поверне узгоджений протокол.

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_NPN` is ``False``.
uk: Цей метод викличе :exc:`NotImplementedError`, якщо :data:`HAS_NPN` має значення ``False``.
