Repository: python/python-docs-uk
Catalog: library/ssl.po
Languages: uk

source: A certificate contains information about two principals. It contains the name of a *subject*, and the subject's public key. It also contains a statement by a second principal, the *issuer*, that the subject is who they claim to be, and that this is indeed the subject's public key. The issuer's statement is signed with the issuer's private key, which only the issuer knows. However, anyone can verify the issuer's statement by finding the issuer's public key, decrypting the statement with it, and comparing it to the other information in the certificate. The certificate also contains information about the time period over which it is valid. This is expressed as two fields, called "notBefore" and "notAfter".
uk: Сертифікат містить інформацію про двох принципалів. Він містить назву *суб’єкта* та відкритий ключ суб’єкта. Він також містить заяву другого принципала, *емітента*, про те, що суб’єкт є тим, за кого себе видає, і що це справді відкритий ключ суб’єкта. Заява емітента підписується закритим ключем емітента, який відомий лише емітенту. Проте будь-хто може перевірити заяву емітента, знайшовши відкритий ключ емітента, розшифрувавши за його допомогою заяву та порівнявши її з іншою інформацією в сертифікаті. Сертифікат також містить інформацію про термін його дії. Це виражається двома полями, які називаються "notBefore" і "notAfter".

source: In the Python use of certificates, a client or server can use a certificate to prove who they are. The other side of a network connection can also be required to produce a certificate, and that certificate can be validated to the satisfaction of the client or server that requires such validation. The connection attempt can be set to raise an exception if the validation fails. Validation is done automatically, by the underlying OpenSSL framework; the application need not concern itself with its mechanics. But the application does usually need to provide sets of certificates to allow this process to take place.
uk: При використанні сертифікатів Python клієнт або сервер можуть використовувати сертифікат, щоб підтвердити, ким вони є. Інша сторона мережевого з’єднання також може вимагати створення сертифіката, і цей сертифікат може бути перевірений відповідно до вимог клієнта або сервера, які потребують такої перевірки. Спробу підключення можна налаштувати так, щоб викликати виняток, якщо перевірка не вдається. Перевірка виконується автоматично базовою структурою OpenSSL; програмі не потрібно займатися своєю механікою. Але програмі зазвичай потрібно надати набори сертифікатів, щоб дозволити цей процес.

source: Python uses files to contain certificates. They should be formatted as "PEM" (see :rfc:`1422`), which is a base-64 encoded form wrapped with a header line and a footer line::
uk: Python використовує файли для зберігання сертифікатів. Вони повинні бути відформатовані як "PEM" (див. :rfc:`1422`), який є формою, закодованою на базі 64, оберненою рядком верхнього та нижнього колонтитулів::

source: Certificate chains
uk: Ланцюжки сертифікатів

source: The Python files which contain certificates can contain a sequence of certificates, sometimes called a *certificate chain*. This chain should start with the specific certificate for the principal who "is" the client or server, and then the certificate for the issuer of that certificate, and then the certificate for the issuer of *that* certificate, and so on up the chain till you get to a certificate which is *self-signed*, that is, a certificate which has the same subject and issuer, sometimes called a *root certificate*. The certificates should just be concatenated together in the certificate file. For example, suppose we had a three certificate chain, from our server certificate to the certificate of the certification authority that signed our server certificate, to the root certificate of the agency which issued the certification authority's certificate::
uk: Файли Python, які містять сертифікати, можуть містити послідовність сертифікатів, яку іноді називають *ланцюжком сертифікатів*. Цей ланцюжок має починатися з конкретного сертифіката для принципала, який "є" клієнтом або сервером, а потім сертифіката для видавця цього сертифіката, а потім сертифіката для видавця *цього* сертифіката, і так далі вгору по ланцюжку доки ви не дійдете до *самопідписаного* сертифіката, тобто сертифіката з тим самим суб’єктом і видавцем, який іноді називають *кореневим сертифікатом*. Сертифікати потрібно просто об’єднати у файлі сертифікатів. Наприклад, припустімо, що ми маємо ланцюжок із трьох сертифікатів: від сертифіката нашого сервера до сертифіката центру сертифікації, який підписав наш сертифікат сервера, до кореневого сертифіката агентства, яке видало сертифікат центру сертифікації:

source: CA certificates
uk: сертифікати ЦС

source: If you are going to require validation of the other side of the connection's certificate, you need to provide a "CA certs" file, filled with the certificate chains for each issuer you are willing to trust. Again, this file just contains these chains concatenated together. For validation, Python will use the first chain it finds in the file which matches. The platform's certificates file can be used by calling :meth:`SSLContext.load_default_certs`, this is done automatically with :func:`.create_default_context`.
uk: Якщо ви збираєтеся вимагати підтвердження іншої сторони сертифіката з’єднання, вам потрібно надати файл "сертифікатів ЦС", заповнений ланцюжками сертифікатів для кожного видавця, якому ви готові довіряти. Знову ж таки, цей файл містить ці ланцюжки, об’єднані разом. Для перевірки Python використовуватиме перший ланцюжок, знайдений у файлі, який відповідає. Файл сертифікатів платформи можна використовувати, викликавши :meth:`SSLContext.load_default_certs`, це робиться автоматично за допомогою :func:`.create_default_context`.

source: Combined key and certificate
uk: Комбінований ключ і сертифікат

source: Often the private key is stored in the same file as the certificate; in this case, only the ``certfile`` parameter to :meth:`SSLContext.load_cert_chain` and :func:`wrap_socket` needs to be passed. If the private key is stored with the certificate, it should come before the first certificate in the certificate chain::
uk: Часто закритий ключ зберігається в тому ж файлі, що й сертифікат; у цьому випадку потрібно передати лише параметр ``certfile`` для :meth:`SSSLContext.load_cert_chain` і :func:`wrap_socket`. Якщо приватний ключ зберігається разом із сертифікатом, він має бути перед першим сертифікатом у ланцюжку сертифікатів:

source: Self-signed certificates
uk: Самопідписані сертифікати

source: If you are going to create a server that provides SSL-encrypted connection services, you will need to acquire a certificate for that service. There are many ways of acquiring appropriate certificates, such as buying one from a certification authority. Another common practice is to generate a self-signed certificate. The simplest way to do this is with the OpenSSL package, using something like the following::
uk: Якщо ви збираєтеся створити сервер, який надає послуги з’єднання з шифруванням SSL, вам потрібно буде отримати сертифікат для цієї послуги. Є багато способів отримати відповідні сертифікати, наприклад придбати сертифікат в центрі сертифікації. Іншою поширеною практикою є створення самопідписаного сертифіката. Найпростіший спосіб зробити це за допомогою пакета OpenSSL, використовуючи щось на зразок наступного:

source: The disadvantage of a self-signed certificate is that it is its own root certificate, and no one else will have it in their cache of known (and trusted) root certificates.
uk: Недоліком самопідписаного сертифіката є те, що це його власний кореневий сертифікат, і ніхто інший не матиме його в кеш-пам’яті відомих (і надійних) кореневих сертифікатів.

source: Examples
uk: Приклади

source: Testing for SSL support
uk: Тестування підтримки SSL

source: To test for the presence of SSL support in a Python installation, user code should use the following idiom::
uk: Щоб перевірити наявність підтримки SSL у встановленому Python, код користувача має використовувати таку ідіому:

source: Client-side operation
uk: Робота на стороні клієнта

source: This example creates a SSL context with the recommended security settings for client sockets, including automatic certificate verification::
uk: У цьому прикладі створюється контекст SSL із рекомендованими налаштуваннями безпеки для клієнтських сокетів, включаючи автоматичну перевірку сертифіката:

source: If you prefer to tune security settings yourself, you might create a context from scratch (but beware that you might not get the settings right)::
uk: Якщо ви бажаєте налаштувати параметри безпеки самостійно, ви можете створити контекст з нуля (але пам’ятайте, що ви можете неправильно встановити параметри):

source: (this snippet assumes your operating system places a bundle of all CA certificates in ``/etc/ssl/certs/ca-bundle.crt``; if not, you'll get an error and have to adjust the location)
uk: (цей фрагмент припускає, що ваша операційна система розміщує пакет усіх сертифікатів ЦС у ``/etc/ssl/certs/ca-bundle.crt``; якщо ні, ви отримаєте повідомлення про помилку, і вам доведеться змінити розташування)

source: The :data:`PROTOCOL_TLS_CLIENT` protocol configures the context for cert validation and hostname verification. :attr:`~SSLContext.verify_mode` is set to :data:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` is set to ``True``. All other protocols create SSL contexts with insecure defaults.
uk: Протокол :data:`PROTOCOL_TLS_CLIENT` налаштовує контекст для перевірки сертифіката та перевірки імені хоста. :attr:`~SSLContext.verify_mode` встановлено на :data:`CERT_REQUIRED`, а :attr:`~SSLContext.check_hostname` встановлено на ``True``. Усі інші протоколи створюють контексти SSL із незахищеними значеннями за умовчанням.

source: When you use the context to connect to a server, :const:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` validate the server certificate: it ensures that the server certificate was signed with one of the CA certificates, checks the signature for correctness, and verifies other properties like validity and identity of the hostname::
uk: Коли ви використовуєте контекст для підключення до сервера, :const:`CERT_REQUIRED` і :attr:`~SSSLContext.check_hostname` перевіряють сертифікат сервера: це гарантує, що сертифікат сервера було підписано одним із сертифікатів ЦС, перевіряє підпис на коректність і перевіряє інші властивості, такі як дійсність та ідентичність імені хоста::

source: You may then fetch the certificate::
uk: Потім ви можете отримати сертифікат:

source: Visual inspection shows that the certificate does identify the desired service (that is, the HTTPS host ``www.python.org``)::
uk: Візуальна перевірка показує, що сертифікат ідентифікує потрібну службу (тобто хост HTTPS ``www.python.org``):

source: Now the SSL channel is established and the certificate verified, you can proceed to talk with the server::
uk: Тепер SSL-канал встановлено та сертифікат перевірено, ви можете продовжити спілкування з сервером:

source: Server-side operation
uk: Робота на стороні сервера

source: For server operation, typically you'll need to have a server certificate, and private key, each in a file. You'll first create a context holding the key and the certificate, so that clients can check your authenticity. Then you'll open a socket, bind it to a port, call :meth:`listen` on it, and start waiting for clients to connect::
uk: Для роботи сервера зазвичай потрібно мати сертифікат сервера та закритий ключ, кожен у файлі. Спочатку ви створите контекст, що містить ключ і сертифікат, щоб клієнти могли перевірити вашу автентичність. Потім ви відкриєте сокет, прив’яжете його до порту, викличете на ньому :meth:`listen` і почнете чекати підключення клієнтів::

source: When a client connects, you'll call :meth:`accept` on the socket to get the new socket from the other end, and use the context's :meth:`SSLContext.wrap_socket` method to create a server-side SSL socket for the connection::
uk: Коли клієнт підключається, ви викличете :meth:`accept` для сокета, щоб отримати новий сокет з іншого боку, і використаєте контекстний метод :meth:`SSLContext.wrap_socket`, щоб створити серверний сокет SSL для зв'язок::

source: Then you'll read data from the ``connstream`` and do something with it till you are finished with the client (or the client is finished with you)::
uk: Потім ви будете читати дані з ``connstream`` і щось робити з ними, поки не закінчите роботу з клієнтом (або клієнт не закінчить роботу з вами):

source: And go back to listening for new client connections (of course, a real server would probably handle each client connection in a separate thread, or put the sockets in :ref:`non-blocking mode <ssl-nonblocking>` and use an event loop).
uk: І поверніться до прослуховування нових клієнтських з’єднань (звичайно, реальний сервер, ймовірно, оброблятиме кожне клієнтське з’єднання в окремому потоці або переведе сокети в :ref:`неблокуючий режим <ssl-nonblocking>` і використає цикл подій).

source: Notes on non-blocking sockets
uk: Примітки щодо неблокуючих розеток

source: SSL sockets behave slightly different than regular sockets in non-blocking mode. When working with non-blocking sockets, there are thus several things you need to be aware of:
uk: SSL-сокети поводяться дещо інакше, ніж звичайні сокети в неблокуючому режимі. Працюючи з неблокуючими сокетами, ви повинні знати про кілька речей:

source: Most :class:`SSLSocket` methods will raise either :exc:`SSLWantWriteError` or :exc:`SSLWantReadError` instead of :exc:`BlockingIOError` if an I/O operation would block. :exc:`SSLWantReadError` will be raised if a read operation on the underlying socket is necessary, and :exc:`SSLWantWriteError` for a write operation on the underlying socket. Note that attempts to *write* to an SSL socket may require *reading* from the underlying socket first, and attempts to *read* from the SSL socket may require a prior *write* to the underlying socket.
uk: Більшість методів :class:`SSLSocket` викликають або :exc:`SSLWantWriteError`, або :exc:`SSLWantReadError` замість :exc:`BlockingIOError`, якщо операція вводу/виводу буде заблокована. :exc:`SSLWantReadError` буде викликано, якщо операція читання базового сокета є необхідною, і :exc:`SSLWantWriteError` для операції запису базового сокета. Зауважте, що спроби *запису* в сокет SSL можуть вимагати спочатку *читання* з базового сокета, а спроби *читання* з сокета SSL можуть вимагати попереднього *запису* в базовий сокет.

source: In earlier Python versions, the :meth:`!SSLSocket.send` method returned zero instead of raising :exc:`SSLWantWriteError` or :exc:`SSLWantReadError`.
uk: У попередніх версіях Python метод :meth:`!SSLSocket.send` повертав нуль замість того, щоб викликати :exc:`SSLWantWriteError` або :exc:`SSLWantReadError`.

source: Calling :func:`~select.select` tells you that the OS-level socket can be read from (or written to), but it does not imply that there is sufficient data at the upper SSL layer. For example, only part of an SSL frame might have arrived. Therefore, you must be ready to handle :meth:`SSLSocket.recv` and :meth:`SSLSocket.send` failures, and retry after another call to :func:`~select.select`.
uk: Виклик :func:`~select.select` повідомляє вам, що сокет рівня ОС можна зчитувати (або записувати), але це не означає, що на верхньому рівні SSL достатньо даних. Наприклад, могла надійти лише частина кадру SSL. Таким чином, ви повинні бути готові впоратися з помилками :meth:`SSLSocket.recv` і :meth:`SSLSocket.send` і повторити спробу після іншого виклику :func:`~select.select`.

source: Conversely, since the SSL layer has its own framing, a SSL socket may still have data available for reading without :func:`~select.select` being aware of it. Therefore, you should first call :meth:`SSLSocket.recv` to drain any potentially available data, and then only block on a :func:`~select.select` call if still necessary.
uk: І навпаки, оскільки рівень SSL має власне фреймування, сокет SSL все ще може мати дані, доступні для читання, не знаючи про це :func:`~select.select`. Таким чином, ви повинні спочатку викликати :meth:`SSLSocket.recv`, щоб вичерпати будь-які потенційно доступні дані, а потім лише заблокувати виклик :func:`~select.select`, якщо все ще необхідно.

source: (of course, similar provisions apply when using other primitives such as :func:`~select.poll`, or those in the :mod:`selectors` module)
uk: (звичайно, подібні положення застосовуються при використанні інших примітивів, таких як :func:`~select.poll` або в модулі :mod:`selectors`)

source: The SSL handshake itself will be non-blocking: the :meth:`SSLSocket.do_handshake` method has to be retried until it returns successfully. Here is a synopsis using :func:`~select.select` to wait for the socket's readiness::
uk: Саме рукостискання SSL буде неблокуючим: метод :meth:`SSLSocket.do_handshake` потрібно повторити, поки він не повернеться успішно. Ось короткий опис використання :func:`~select.select` для очікування готовності сокета::

source: The :mod:`asyncio` module supports :ref:`non-blocking SSL sockets <ssl-nonblocking>` and provides a higher level API. It polls for events using the :mod:`selectors` module and handles :exc:`SSLWantWriteError`, :exc:`SSLWantReadError` and :exc:`BlockingIOError` exceptions. It runs the SSL handshake asynchronously as well.
uk: Модуль :mod:`asyncio` підтримує :ref:`неблокуючі сокети SSL <ssl-nonblocking>` і забезпечує API вищого рівня. Він опитує події за допомогою модуля :mod:`selectors` і обробляє винятки :exc:`SSLWantWriteError`, :exc:`SSLWantReadError` і :exc:`BlockingIOError`. Він також запускає рукостискання SSL асинхронно.

source: Memory BIO Support
uk: Підтримка BIO пам'яті

source: Ever since the SSL module was introduced in Python 2.6, the :class:`SSLSocket` class has provided two related but distinct areas of functionality:
uk: З тих пір, як модуль SSL було представлено в Python 2.6, клас :class:`SSLSocket` забезпечив дві пов’язані, але різні області функціональності:

source: SSL protocol handling
uk: Обробка протоколу SSL

source: Network IO
uk: Мережа IO

source: The network IO API is identical to that provided by :class:`socket.socket`, from which :class:`SSLSocket` also inherits. This allows an SSL socket to be used as a drop-in replacement for a regular socket, making it very easy to add SSL support to an existing application.
uk: Мережевий IO API ідентичний тому, який надає :class:`socket.socket`, від якого також успадковується :class:`SSLSocket`. Це дозволяє використовувати сокет SSL як додаткову заміну звичайного сокета, що дозволяє дуже легко додати підтримку SSL до існуючої програми.

source: Combining SSL protocol handling and network IO usually works well, but there are some cases where it doesn't. An example is async IO frameworks that want to use a different IO multiplexing model than the "select/poll on a file descriptor" (readiness based) model that is assumed by :class:`socket.socket` and by the internal OpenSSL socket IO routines. This is mostly relevant for platforms like Windows where this model is not efficient. For this purpose, a reduced scope variant of :class:`SSLSocket` called :class:`SSLObject` is provided.
uk: Поєднання обробки протоколу SSL і мережевого введення-виведення зазвичай працює добре, але в деяких випадках це не так. Прикладом є асинхронні структури вводу-виводу, які хочуть використовувати іншу модель мультиплексування вводу-виводу, ніж модель "вибір/опитування дескриптора файлу" (на основі готовності), яка передбачається :class:`socket.socket` і внутрішнім вводом-виводом сокета OpenSSL рутини. Це в основному актуально для таких платформ, як Windows, де ця модель не ефективна. Для цього надається зменшений варіант :class:`SSLSocket` під назвою :class:`SSLObject`.

source: A reduced-scope variant of :class:`SSLSocket` representing an SSL protocol instance that does not contain any network IO methods. This class is typically used by framework authors that want to implement asynchronous IO for SSL through memory buffers.
uk: Зменшений варіант :class:`SSLSocket`, що представляє екземпляр протоколу SSL, який не містить жодних мережевих методів введення-виведення. Цей клас зазвичай використовується авторами фреймворків, які хочуть реалізувати асинхронний IO для SSL через буфери пам’яті.

source: This class implements an interface on top of a low-level SSL object as implemented by OpenSSL. This object captures the state of an SSL connection but does not provide any network IO itself. IO needs to be performed through separate "BIO" objects which are OpenSSL's IO abstraction layer.
uk: Цей клас реалізує інтерфейс поверх об’єкта SSL низького рівня, реалізованого OpenSSL. Цей об’єкт фіксує стан SSL-з’єднання, але сам не надає мережевий IO. IO потрібно виконувати через окремі об’єкти "BIO", які є рівнем абстракції IO OpenSSL.

source: This class has no public constructor. An :class:`SSLObject` instance must be created using the :meth:`~SSLContext.wrap_bio` method. This method will create the :class:`SSLObject` instance and bind it to a pair of BIOs. The *incoming* BIO is used to pass data from Python to the SSL protocol instance, while the *outgoing* BIO is used to pass data the other way around.
uk: Цей клас не має публічного конструктора. Екземпляр :class:`SSLObject` має бути створений за допомогою методу :meth:`~SSLContext.wrap_bio`. Цей метод створить екземпляр :class:`SSLObject` і прив’яже його до пари BIO. *Вхідний* BIO використовується для передачі даних від Python до примірника протоколу SSL, тоді як *вихідний* BIO використовується для передачі даних навпаки.

source: The following methods are available:
uk: Доступні такі методи:

source: :attr:`~SSLSocket.server_side`
uk: :attr:`~SSLSocket.сторона_сервера`

source: :attr:`~SSLSocket.server_hostname`
uk: :attr:`~SSLSocket.сервер_hostname`

source: :meth:`~SSLSocket.pending`
uk: :meth:`~SSLSocket.очікує`

source: When compared to :class:`SSLSocket`, this object lacks the following features:
uk: У порівнянні з :class:`SSLSocket` цьому об’єкту бракує наступних функцій:

source: Any form of network IO; ``recv()`` and ``send()`` read and write only to the underlying :class:`MemoryBIO` buffers.
uk: Будь-яка форма мережевого вводу-виводу; ``recv()`` і ``send()`` читають і записують лише в базові буфери :class:`MemoryBIO`.

source: There is no *do_handshake_on_connect* machinery. You must always manually call :meth:`~SSLSocket.do_handshake` to start the handshake.
uk: Не існує механізму *do_handshake_on_connect*. Ви завжди повинні вручну викликати :meth:`~SSLSocket.do_handshake`, щоб почати рукостискання.

source: There is no handling of *suppress_ragged_eofs*. All end-of-file conditions that are in violation of the protocol are reported via the :exc:`SSLEOFError` exception.
uk: Немає обробки *suppress_ragged_eofs*. Усі умови кінця файлу, які порушують протокол, повідомляються через виняток :exc:`SSLEOFError`.

source: The method :meth:`~SSLSocket.unwrap` call does not return anything, unlike for an SSL socket where it returns the underlying socket.
uk: Виклик методу :meth:`~SSLSocket.unwrap` нічого не повертає, на відміну від сокета SSL, де він повертає основний сокет.

source: The *server_name_callback* callback passed to :meth:`SSLContext.set_servername_callback` will get an :class:`SSLObject` instance instead of a :class:`SSLSocket` instance as its first parameter.
uk: Зворотний виклик *server_name_callback*, переданий :meth:`SSLContext.set_servername_callback`, отримає екземпляр :class:`SSLObject` замість екземпляра :class:`SSLSocket` як перший параметр.

source: Some notes related to the use of :class:`SSLObject`:
uk: Деякі зауваження щодо використання :class:`SSLObject`:
