Repository: python/python-docs-uk
Catalog: library/ssl.po
Languages: uk

source: :mod:`ssl` --- TLS/SSL wrapper for socket objects
uk: :mod:`ssl` --- оболонка TLS/SSL для об'єктів сокета

source: **Source code:** :source:`Lib/ssl.py`
uk: **Вихідний код:** :source:`Lib/ssl.py`

source: This module provides access to Transport Layer Security (often known as "Secure Sockets Layer") encryption and peer authentication facilities for network sockets, both client-side and server-side. This module uses the OpenSSL library. It is available on all modern Unix systems, Windows, macOS, and probably additional platforms, as long as OpenSSL is installed on that platform.
uk: Цей модуль надає доступ до шифрування транспортного рівня безпеки (часто відомого як "рівень захищених сокетів") і засобів автентифікації однорангових мережевих сокетів як на стороні клієнта, так і на стороні сервера. Цей модуль використовує бібліотеку OpenSSL. Він доступний у всіх сучасних системах Unix, Windows, macOS і, ймовірно, на додаткових платформах, якщо на цій платформі встановлено OpenSSL.

source: Some behavior may be platform dependent, since calls are made to the operating system socket APIs. The installed version of OpenSSL may also cause variations in behavior. For example, TLSv1.3 with OpenSSL version 1.1.1.
uk: Деяка поведінка може залежати від платформи, оскільки виклики здійснюються до API сокетів операційної системи. Установлена версія OpenSSL також може спричиняти зміни в поведінці. Наприклад, TLSv1.3 з OpenSSL версії 1.1.1.

source: Don't use this module without reading the :ref:`ssl-security`. Doing so may lead to a false sense of security, as the default settings of the ssl module are not necessarily appropriate for your application.
uk: Не використовуйте цей модуль, не прочитавши :ref:`ssl-security`. Це може призвести до помилкового відчуття безпеки, оскільки стандартні параметри модуля ssl не обов’язково підходять для вашої програми.

source: This section documents the objects and functions in the ``ssl`` module; for more general information about TLS, SSL, and certificates, the reader is referred to the documents in the "See Also" section at the bottom.
uk: У цьому розділі описано об’єкти та функції модуля ``ssl``; для отримання більш загальної інформації про TLS, SSL і сертифікати, читач буде направлено до документів у розділі "Див. також" внизу.

source: This module provides a class, :class:`ssl.SSLSocket`, which is derived from the :class:`socket.socket` type, and provides a socket-like wrapper that also encrypts and decrypts the data going over the socket with SSL. It supports additional methods such as :meth:`getpeercert`, which retrieves the certificate of the other side of the connection, and :meth:`cipher`, which retrieves the cipher being used for the secure connection.
uk: Цей модуль надає клас :class:`ssl.SSLSocket`, який є похідним від типу :class:`socket.socket`, і забезпечує оболонку, схожу на сокет, яка також шифрує та розшифровує дані, що передаються через сокет за допомогою SSL. . Він підтримує додаткові методи, такі як :meth:`getpeercert`, який отримує сертифікат іншого боку з’єднання, і :meth:`cipher`, який отримує шифр, який використовується для безпечного з’єднання.

source: For more sophisticated applications, the :class:`ssl.SSLContext` class helps manage settings and certificates, which can then be inherited by SSL sockets created through the :meth:`SSLContext.wrap_socket` method.
uk: Для складніших програм клас :class:`ssl.SSLContext` допомагає керувати налаштуваннями та сертифікатами, які потім можуть бути успадковані сокетами SSL, створеними за допомогою методу :meth:`SSLContext.wrap_socket`.

source: Updated to support linking with OpenSSL 1.1.0
uk: Оновлено для підтримки зв’язування з OpenSSL 1.1.0

source: OpenSSL 0.9.8, 1.0.0 and 1.0.1 are deprecated and no longer supported. In the future the ssl module will require at least OpenSSL 1.0.2 or 1.1.0.
uk: OpenSSL 0.9.8, 1.0.0 і 1.0.1 застаріли та більше не підтримуються. У майбутньому модуль ssl потребуватиме принаймні OpenSSL 1.0.2 або 1.1.0.

source: :pep:`644` has been implemented. The ssl module requires OpenSSL 1.1.1 or newer.
uk: :pep:`644` реалізовано. Модуль ssl вимагає OpenSSL 1.1.1 або новішої версії.

source: Use of deprecated constants and functions result in deprecation warnings.
uk: Використання застарілих констант і функцій призводить до попереджень про застаріле.

source: Functions, Constants, and Exceptions
uk: Функції, константи та винятки

source: Socket creation
uk: Створення розетки

source: Since Python 3.2 and 2.7.9, it is recommended to use the :meth:`SSLContext.wrap_socket` of an :class:`SSLContext` instance to wrap sockets as :class:`SSLSocket` objects. The helper functions :func:`create_default_context` returns a new context with secure default settings. The old :func:`wrap_socket` function is deprecated since it is both inefficient and has no support for server name indication (SNI) and hostname matching.
uk: Починаючи з Python 3.2 і 2.7.9, рекомендується використовувати :meth:`SSLContext.wrap_socket` екземпляра :class:`SSLContext` для обгортання сокетів як об’єктів :class:`SSLSocket`. Допоміжні функції :func:`create_default_context` повертають новий контекст із безпечними параметрами за замовчуванням. Стара функція :func:`wrap_socket` є застарілою, оскільки вона є неефективною та не підтримує індикацію імені сервера (SNI) та відповідність імені хоста.

source: Client socket example with default context and IPv4/IPv6 dual stack::
uk: Приклад клієнтського сокета з контекстом за замовчуванням і подвійним стеком IPv4/IPv6::

source: Client socket example with custom context and IPv4::
uk: Приклад клієнтського сокета з власним контекстом і IPv4::

source: Server socket example listening on localhost IPv4::
uk: Приклад серверного сокета, який прослуховує локальний хост IPv4::

source: Context creation
uk: Створення контексту

source: A convenience function helps create :class:`SSLContext` objects for common purposes.
uk: Зручна функція допомагає створювати об’єкти :class:`SSLContext` для звичайних цілей.

source: Return a new :class:`SSLContext` object with default settings for the given *purpose*. The settings are chosen by the :mod:`ssl` module, and usually represent a higher security level than when calling the :class:`SSLContext` constructor directly.
uk: Повертає новий об’єкт :class:`SSLContext` із налаштуваннями за замовчуванням для заданої *цілі*. Параметри вибираються модулем :mod:`ssl` і зазвичай представляють вищий рівень безпеки, ніж під час безпосереднього виклику конструктора :class:`SSLContext`.

source: *cafile*, *capath*, *cadata* represent optional CA certificates to trust for certificate verification, as in :meth:`SSLContext.load_verify_locations`. If all three are :const:`None`, this function can choose to trust the system's default CA certificates instead.
uk: *cafile*, *capath*, *cadata* представляють додаткові сертифікати ЦС, яким можна довіряти для перевірки сертифікатів, як у :meth:`SSLContext.load_verify_locations`. Якщо всі три параметри :const:`None`, ця функція може натомість довіряти стандартним сертифікатам ЦС системи.

source: The settings are: :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER`, :data:`OP_NO_SSLv2`, and :data:`OP_NO_SSLv3` with high encryption cipher suites without RC4 and without unauthenticated cipher suites. Passing :data:`~Purpose.SERVER_AUTH` as *purpose* sets :data:`~SSLContext.verify_mode` to :data:`CERT_REQUIRED` and either loads CA certificates (when at least one of *cafile*, *capath* or *cadata* is given) or uses :meth:`SSLContext.load_default_certs` to load default CA certificates.
uk: Параметри такі: :data:`PROTOCOL_TLS_CLIENT` або :data:`PROTOCOL_TLS_SERVER`, :data:`OP_NO_SSLv2` і :data:`OP_NO_SSLv3` з наборами шифрів високого рівня шифрування без RC4 і без неавтентифікованих наборів шифрів. Передача :data:`~Purpose.SERVER_AUTH` як *purpose* встановлює :data:`~SSLContext.verify_mode` на :data:`CERT_REQUIRED` і або завантажує сертифікати ЦС (якщо принаймні один із *cafile*, *capath* або *cadata* задано) або використовує :meth:`SSLContext.load_default_certs` для завантаження стандартних сертифікатів ЦС.

source: When :attr:`~SSLContext.keylog_filename` is supported and the environment variable :envvar:`SSLKEYLOGFILE` is set, :func:`create_default_context` enables key logging.
uk: Якщо підтримується :attr:`~SSLContext.keylog_filename` і встановлено змінну середовища :envvar:`SSLKEYLOGFILE`, :func:`create_default_context` вмикає журналювання ключів.

source: The protocol, options, cipher and other settings may change to more restrictive values anytime without prior deprecation. The values represent a fair balance between compatibility and security.
uk: Протокол, параметри, шифр та інші параметри можуть будь-коли змінитися на більш обмежувальні значення без попереднього припинення. Значення представляють справедливий баланс між сумісністю та безпекою.

source: If your application needs specific settings, you should create a :class:`SSLContext` and apply the settings yourself.
uk: Якщо вашій програмі потрібні певні налаштування, ви повинні створити :class:`SSLContext` і застосувати налаштування самостійно.

source: If you find that when certain older clients or servers attempt to connect with a :class:`SSLContext` created by this function that they get an error stating "Protocol or cipher suite mismatch", it may be that they only support SSL3.0 which this function excludes using the :data:`OP_NO_SSLv3`. SSL3.0 is widely considered to be `completely broken <https://en.wikipedia.org/wiki/POODLE>`_. If you still wish to continue to use this function but still allow SSL 3.0 connections you can re-enable them using::
uk: Якщо ви виявите, що коли певні старіші клієнти чи сервери намагаються підключитися за допомогою :class:`SSLContext`, створеного цією функцією, вони отримують помилку "Невідповідність протоколу чи набору шифрів", можливо, вони підтримують лише SSL3.0, який ця функція виключає використання :data:`OP_NO_SSLv3`. SSL3.0 широко вважається `повністю зламаним <https://en.wikipedia.org/wiki/POODLE>`_. Якщо ви все ще бажаєте продовжувати використовувати цю функцію, але все ще дозволяєте підключення SSL 3.0, ви можете повторно ввімкнути їх за допомогою::

source: RC4 was dropped from the default cipher string.
uk: RC4 було видалено з рядка шифру за замовчуванням.

source: ChaCha20/Poly1305 was added to the default cipher string.
uk: ChaCha20/Poly1305 додано до рядка шифру за замовчуванням.

source: 3DES was dropped from the default cipher string.
uk: 3DES було видалено з рядка шифру за замовчуванням.

source: Support for key logging to :envvar:`SSLKEYLOGFILE` was added.
uk: Додано підтримку реєстрації ключів у :envvar:`SSLKEYLOGFILE`.

source: The context now uses :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER` protocol instead of generic :data:`PROTOCOL_TLS`.
uk: Контекст тепер використовує протокол :data:`PROTOCOL_TLS_CLIENT` або :data:`PROTOCOL_TLS_SERVER` замість загального :data:`PROTOCOL_TLS`.

source: Exceptions
uk: Винятки

source: Raised to signal an error from the underlying SSL implementation (currently provided by the OpenSSL library). This signifies some problem in the higher-level encryption and authentication layer that's superimposed on the underlying network connection. This error is a subtype of :exc:`OSError`. The error code and message of :exc:`SSLError` instances are provided by the OpenSSL library.
uk: Піднято, щоб повідомити про помилку базової реалізації SSL (наразі надається бібліотекою OpenSSL). Це означає певну проблему на рівні шифрування та автентифікації вищого рівня, який накладається на базове мережеве з’єднання. Ця помилка є підтипом :exc:`OSError`. Код помилки та повідомлення екземплярів :exc:`SSLError` надає бібліотека OpenSSL.

source: :exc:`SSLError` used to be a subtype of :exc:`socket.error`.
uk: :exc:`SSLError` раніше був підтипом :exc:`socket.error`.

source: A string mnemonic designating the OpenSSL submodule in which the error occurred, such as ``SSL``, ``PEM`` or ``X509``. The range of possible values depends on the OpenSSL version.
uk: Рядкова мнемоніка, що позначає субмодуль OpenSSL, у якому сталася помилка, наприклад ``SSL``, ``PEM`` або ``X509``. Діапазон можливих значень залежить від версії OpenSSL.

source: A string mnemonic designating the reason this error occurred, for example ``CERTIFICATE_VERIFY_FAILED``. The range of possible values depends on the OpenSSL version.
uk: Рядок мнемоніки, що вказує причину цієї помилки, наприклад ``CERTIFICATE_VERIFY_FAILED``. Діапазон можливих значень залежить від версії OpenSSL.

source: A subclass of :exc:`SSLError` raised when trying to read or write and the SSL connection has been closed cleanly. Note that this doesn't mean that the underlying transport (read TCP) has been closed.
uk: Підклас :exc:`SSLError` викликається під час спроби читання або запису, а SSL-з’єднання було закрито. Зауважте, що це не означає, що основний транспорт (читай TCP) закрито.

source: A subclass of :exc:`SSLError` raised by a :ref:`non-blocking SSL socket <ssl-nonblocking>` when trying to read or write data, but more data needs to be received on the underlying TCP transport before the request can be fulfilled.
uk: Підклас :exc:`SSLError`, викликаний :ref:`неблокуючим SSL-сокетом <ssl-nonblocking>` під час спроби прочитати або записати дані, але для виконання запиту потрібно отримати більше даних базовим транспортом TCP.

source: A subclass of :exc:`SSLError` raised by a :ref:`non-blocking SSL socket <ssl-nonblocking>` when trying to read or write data, but more data needs to be sent on the underlying TCP transport before the request can be fulfilled.
uk: Підклас :exc:`SSLError`, викликаний :ref:`неблокуючим SSL-сокетом <ssl-nonblocking>` під час спроби прочитати або записати дані, але більше даних потрібно надіслати базовим транспортом TCP, перш ніж запит буде виконано.

source: A subclass of :exc:`SSLError` raised when a system error was encountered while trying to fulfill an operation on a SSL socket. Unfortunately, there is no easy way to inspect the original errno number.
uk: Підклас :exc:`SSLError` викликається, коли виникла системна помилка під час спроби виконати операцію на SSL-сокеті. На жаль, немає простого способу перевірити оригінальний номер errno.

source: A subclass of :exc:`SSLError` raised when the SSL connection has been terminated abruptly. Generally, you shouldn't try to reuse the underlying transport when this error is encountered.
uk: Підклас :exc:`SSLError` викликається, коли з’єднання SSL було раптово розірвано. Як правило, ви не повинні намагатися повторно використовувати базовий транспорт, коли виникає ця помилка.

source: A subclass of :exc:`SSLError` raised when certificate validation has failed.
uk: Підклас :exc:`SSLError` викликається, коли не вдається перевірити сертифікат.

source: A numeric error number that denotes the verification error.
uk: Числовий номер помилки, який позначає помилку підтвердження.

source: A human readable string of the verification error.
uk: Зрозумілий для людини рядок помилки перевірки.

source: An alias for :exc:`SSLCertVerificationError`.
uk: Псевдонім для :exc:`SSLCertVerificationError`.

source: The exception is now an alias for :exc:`SSLCertVerificationError`.
uk: Винятком тепер є псевдонім для :exc:`SSLCertVerificationError`.

source: Random generation
uk: Випадкова генерація

source: Return *num* cryptographically strong pseudo-random bytes. Raises an :class:`SSLError` if the PRNG has not been seeded with enough data or if the operation is not supported by the current RAND method. :func:`RAND_status` can be used to check the status of the PRNG and :func:`RAND_add` can be used to seed the PRNG.
uk: Повертає *num* криптографічно надійних псевдовипадкових байтів. Викликає :class:`SSLError`, якщо PRNG не було заповнено достатньою кількістю даних або якщо операція не підтримується поточним методом RAND. :func:`RAND_status` можна використовувати для перевірки статусу PRNG, а :func:`RAND_add` можна використовувати для заповнення PRNG.

source: For almost all applications :func:`os.urandom` is preferable.
uk: Майже для всіх програм :func:`os.urandom` є кращим.

source: Read the Wikipedia article, `Cryptographically secure pseudorandom number generator (CSPRNG) <https://en.wikipedia.org/wiki/Cryptographically_secure_pseudorandom_number_generator>`_, to get the requirements of a cryptographically strong generator.
uk: Прочитайте статтю Вікіпедії `Криптографічно захищений генератор псевдовипадкових чисел (CSPRNG) <https://en.wikipedia.org/wiki/Cryptographically_secure_pseudorandom_number_generator>`_, щоб дізнатися про вимоги до криптографічно надійного генератора.

source: Return (bytes, is_cryptographic): bytes are *num* pseudo-random bytes, is_cryptographic is ``True`` if the bytes generated are cryptographically strong. Raises an :class:`SSLError` if the operation is not supported by the current RAND method.
uk: Повернення (байти, is_cryptographic): байти — це *кількість* псевдовипадкових байтів, is_cryptographic має значення ``True``, якщо згенеровані байти є криптографічно надійними. Викликає :class:`SSLError`, якщо операція не підтримується поточним методом RAND.

source: Generated pseudo-random byte sequences will be unique if they are of sufficient length, but are not necessarily unpredictable. They can be used for non-cryptographic purposes and for certain purposes in cryptographic protocols, but usually not for key generation etc.
uk: Згенеровані псевдовипадкові послідовності байтів будуть унікальними, якщо вони мають достатню довжину, але не обов’язково є непередбачуваними. Їх можна використовувати для некриптографічних цілей і для певних цілей у криптографічних протоколах, але зазвичай не для генерації ключів тощо.

source: OpenSSL has deprecated :func:`ssl.RAND_pseudo_bytes`, use :func:`ssl.RAND_bytes` instead.
uk: OpenSSL застарів :func:`ssl.RAND_pseudo_bytes`, замість нього використовуйте :func:`ssl.RAND_bytes`.

source: Return ``True`` if the SSL pseudo-random number generator has been seeded with 'enough' randomness, and ``False`` otherwise. You can use :func:`ssl.RAND_egd` and :func:`ssl.RAND_add` to increase the randomness of the pseudo-random number generator.
uk: Повертає ``True``, якщо генератор псевдовипадкових чисел SSL заповнено достатньою випадковістю, і ``False`` в іншому випадку. Ви можете використовувати :func:`ssl.RAND_egd` і :func:`ssl.RAND_add`, щоб збільшити випадковість генератора псевдовипадкових чисел.

source: Mix the given *bytes* into the SSL pseudo-random number generator. The parameter *entropy* (a float) is a lower bound on the entropy contained in string (so you can always use :const:`0.0`). See :rfc:`1750` for more information on sources of entropy.
uk: Змішайте надані *байти* в генераторі псевдовипадкових чисел SSL. Параметр *entropy* (float) є нижньою межею ентропії, яка міститься в рядку (тому ви завжди можете використовувати :const:`0.0`). Перегляньте :rfc:`1750` для отримання додаткової інформації про джерела ентропії.

source: Writable :term:`bytes-like object` is now accepted.
uk: Записуваний :term:`bytes-like object` тепер приймається.

source: Certificate handling
uk: Обробка сертифікатів

source: Verify that *cert* (in decoded format as returned by :meth:`SSLSocket.getpeercert`) matches the given *hostname*. The rules applied are those for checking the identity of HTTPS servers as outlined in :rfc:`2818`, :rfc:`5280` and :rfc:`6125`. In addition to HTTPS, this function should be suitable for checking the identity of servers in various SSL-based protocols such as FTPS, IMAPS, POPS and others.
uk: Переконайтеся, що *cert* (у декодованому форматі, який повертає :meth:`SSLSocket.getpeercert`) відповідає заданому *назві хосту*. Застосовуються правила для перевірки ідентичності серверів HTTPS, як описано в :rfc:`2818`, :rfc:`5280` та :rfc:`6125`. Окрім HTTPS, ця функція має бути придатною для перевірки ідентичності серверів у різних протоколах на основі SSL, таких як FTPS, IMAPS, POPS та інші.

source: :exc:`CertificateError` is raised on failure. On success, the function returns nothing::
uk: :exc:`CertificateError` виникає в разі помилки. У разі успіху функція нічого не повертає::

source: The function now follows :rfc:`6125`, section 6.4.3 and does neither match multiple wildcards (e.g. ``*.*.com`` or ``*a*.example.org``) nor a wildcard inside an internationalized domain names (IDN) fragment. IDN A-labels such as ``www*.xn--pthon-kva.org`` are still supported, but ``x*.python.org`` no longer matches ``xn--tda.python.org``.
uk: Функція тепер відповідає :rfc:`6125`, розділ 6.4.3, і не відповідає ні кільком символам підстановки (наприклад, ``*.*.com`` або ``*a*.example.org``), ні символу підстановки всередині фрагмент інтернаціоналізованих доменних імен (IDN). А-мітки IDN, такі як ``www*.xn--pthon-kva.org``, як і раніше підтримуються, але ``x*.python.org`` більше не відповідає ``xn--tda.python.org``.

source: Matching of IP addresses, when present in the subjectAltName field of the certificate, is now supported.
uk: Тепер підтримується зіставлення IP-адрес, якщо вони присутні в полі subjectAltName сертифіката.

source: The function is no longer used to TLS connections. Hostname matching is now performed by OpenSSL.
uk: Ця функція більше не використовується для підключень TLS. Зіставлення імен хостів тепер виконує OpenSSL.

source: Allow wildcard when it is the leftmost and the only character in that segment. Partial wildcards like ``www*.example.com`` are no longer supported.
uk: Дозволити підстановку, якщо це крайній лівий і єдиний символ у сегменті. Часткові символи узагальнення, наприклад ``www*.example.com`` більше не підтримуються.

source: Return the time in seconds since the Epoch, given the ``cert_time`` string representing the "notBefore" or "notAfter" date from a certificate in ``"%b %d %H:%M:%S %Y %Z"`` strptime format (C locale).
uk: Повертає час у секундах з епохи, враховуючи рядок ``cert_time``, що представляє дату "notBefore" або "notAfter" із сертифіката в ``"%b %d %H:%M:%S %Y %Z"`` формат strptime (C локаль).

source: Here's an example:
uk: Ось приклад:

source: "notBefore" or "notAfter" dates must use GMT (:rfc:`5280`).
uk: Дати "notBefore" або "notAfter" мають використовувати GMT (:rfc:`5280`).

source: Interpret the input time as a time in UTC as specified by 'GMT' timezone in the input string. Local timezone was used previously. Return an integer (no fractions of a second in the input format)
uk: Інтерпретуйте введений час як час у UTC, як зазначено часовим поясом "GMT" у вхідному рядку. Раніше використовувався місцевий часовий пояс. Повертає ціле число (без часток секунди у форматі введення)
