Repository: python/python-docs-uk
Catalog: library/ssl.po
Languages: uk

source: Register a callback function that will be called after the TLS Client Hello handshake message has been received by the SSL/TLS server when the TLS client specifies a server name indication. The server name indication mechanism is specified in :rfc:`6066` section 3 - Server Name Indication.
uk: Зареєструйте функцію зворотного виклику, яка буде викликана після отримання повідомлення рукостискання TLS Client Hello сервером SSL/TLS, коли клієнт TLS вказує вказівку імені сервера. Механізм індикації імені сервера вказано в :rfc:`6066` розділі 3 - Індикація імені сервера.

source: Only one callback can be set per ``SSLContext``. If *sni_callback* is set to ``None`` then the callback is disabled. Calling this function a subsequent time will disable the previously registered callback.
uk: Для кожного SSLContext можна встановити лише один зворотний виклик. Якщо *sni_callback* встановлено на ``None``, тоді зворотний виклик вимкнено. Наступний виклик цієї функції вимкне попередньо зареєстрований зворотний виклик.

source: The callback function will be called with three arguments; the first being the :class:`ssl.SSLSocket`, the second is a string that represents the server name that the client is intending to communicate (or :const:`None` if the TLS Client Hello does not contain a server name) and the third argument is the original :class:`SSLContext`. The server name argument is text. For internationalized domain name, the server name is an IDN A-label (``"xn--pythn-mua.org"``).
uk: Функція зворотного виклику буде викликана з трьома аргументами; перший — це :class:`ssl.SSLSocket`, другий — це рядок, який представляє ім’я сервера, з яким клієнт має намір зв’язатися (або :const:`None`, якщо TLS Client Hello не містить імені сервера) а третій аргумент — вихідний :class:`SSLContext`. Аргументом імені сервера є текст. Для інтернаціоналізованого доменного імені ім’я сервера є міткою IDN A (``"xn--pythn-mua.org"``).

source: A typical use of this callback is to change the :class:`ssl.SSLSocket`'s :attr:`SSLSocket.context` attribute to a new object of type :class:`SSLContext` representing a certificate chain that matches the server name.
uk: Типовим використанням цього зворотного виклику є зміна атрибута :attr:`SSLSocket.context` :class:`ssl.SSLSocket` на новий об’єкт типу :class:`SSLContext`, який представляє ланцюжок сертифікатів, який відповідає імені сервера .

source: Due to the early negotiation phase of the TLS connection, only limited methods and attributes are usable like :meth:`SSLSocket.selected_alpn_protocol` and :attr:`SSLSocket.context`. The :meth:`SSLSocket.getpeercert`, :meth:`SSLSocket.cipher` and :meth:`SSLSocket.compression` methods require that the TLS connection has progressed beyond the TLS Client Hello and therefore will not return meaningful values nor can they be called safely.
uk: Через ранню фазу узгодження TLS-з’єднання можна використовувати лише обмежені методи та атрибути, наприклад :meth:`SSLSocket.selected_alpn_protocol` і :attr:`SSLSocket.context`. Методи :meth:`SSLSocket.getpeercert`, :meth:`SSLSocket.cipher` і :meth:`SSLSocket.compression` вимагають, щоб TLS-з’єднання просунулося за межі TLS Client Hello, тому не повертають значущих значень і не можуть викликати безпечно.

source: The *sni_callback* function must return ``None`` to allow the TLS negotiation to continue. If a TLS failure is required, a constant :const:`ALERT_DESCRIPTION_* <ALERT_DESCRIPTION_INTERNAL_ERROR>` can be returned. Other return values will result in a TLS fatal error with :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.
uk: Функція *sni_callback* має повертати ``None``, щоб узгодження TLS продовжилося. Якщо потрібна помилка TLS, можна повернути константу :const:`ALERT_DESCRIPTION_* <ALERT_DESCRIPTION_INTERNAL_ERROR>`. Інші значення, що повертаються, призведуть до фатальної помилки TLS із :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.

source: If an exception is raised from the *sni_callback* function the TLS connection will terminate with a fatal TLS alert message :const:`ALERT_DESCRIPTION_HANDSHAKE_FAILURE`.
uk: Якщо функція *sni_callback* викликає виняток, TLS-з’єднання буде розірвано з небезпечним TLS-повідомленням :const:`ALERT_DESCRIPTION_HANDSHAKE_FAILURE`.

source: This method will raise :exc:`NotImplementedError` if the OpenSSL library had OPENSSL_NO_TLSEXT defined when it was built.
uk: Цей метод викличе :exc:`NotImplementedError`, якщо під час створення бібліотеки OpenSSL було визначено OPENSSL_NO_TLSEXT.

source: This is a legacy API retained for backwards compatibility. When possible, you should use :attr:`sni_callback` instead. The given *server_name_callback* is similar to *sni_callback*, except that when the server hostname is an IDN-encoded internationalized domain name, the *server_name_callback* receives a decoded U-label (``"pythön.org"``).
uk: Це застарілий API, збережений для зворотної сумісності. Якщо можливо, замість цього слід використовувати :attr:`sni_callback`. Наданий *server_name_callback* подібний до *sni_callback*, за винятком того, що коли ім’я хосту сервера є інтернаціоналізованим доменним ім’ям із кодуванням IDN, *server_name_callback* отримує декодовану U-мітку (``"pythön.org"``).

source: If there is an decoding error on the server name, the TLS connection will terminate with an :const:`ALERT_DESCRIPTION_INTERNAL_ERROR` fatal TLS alert message to the client.
uk: Якщо в імені сервера є помилка декодування, TLS-з’єднання буде розірвано з повідомленням TLS-сповіщення клієнта :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.

source: Load the key generation parameters for Diffie-Hellman (DH) key exchange. Using DH key exchange improves forward secrecy at the expense of computational resources (both on the server and on the client). The *dhfile* parameter should be the path to a file containing DH parameters in PEM format.
uk: Завантажте параметри генерації ключів для обміну ключами Діффі-Хеллмана (DH). Використання обміну ключами DH покращує пряму секретність за рахунок обчислювальних ресурсів (як на сервері, так і на клієнті). Параметр *dhfile* має бути шляхом до файлу, що містить параметри DH у форматі PEM.

source: This setting doesn't apply to client sockets. You can also use the :data:`OP_SINGLE_DH_USE` option to further improve security.
uk: Цей параметр не застосовується до клієнтських сокетів. Ви також можете використовувати параметр :data:`OP_SINGLE_DH_USE` для подальшого покращення безпеки.

source: Set the curve name for Elliptic Curve-based Diffie-Hellman (ECDH) key exchange. ECDH is significantly faster than regular DH while arguably as secure. The *curve_name* parameter should be a string describing a well-known elliptic curve, for example ``prime256v1`` for a widely supported curve.
uk: Встановіть назву кривої для обміну ключами Діффі-Хеллмана (ECDH) на основі еліптичної кривої. ECDH значно швидший, ніж звичайний DH, але, можливо, такий же безпечний. Параметр *curve_name* має бути рядком, що описує добре відому еліптичну криву, наприклад ``prime256v1`` для широко підтримуваної кривої.

source: This setting doesn't apply to client sockets. You can also use the :data:`OP_SINGLE_ECDH_USE` option to further improve security.
uk: Цей параметр не застосовується до клієнтських сокетів. Ви також можете використовувати опцію :data:`OP_SINGLE_ECDH_USE` для подальшого покращення безпеки.

source: This method is not available if :data:`HAS_ECDH` is ``False``.
uk: Цей метод недоступний, якщо :data:`HAS_ECDH` має значення ``False``.

source: Vincent Bernat.
uk: Вінсент Бернат.

source: Wrap an existing Python socket *sock* and return an instance of :attr:`SSLContext.sslsocket_class` (default :class:`SSLSocket`). The returned SSL socket is tied to the context, its settings and certificates. *sock* must be a :data:`~socket.SOCK_STREAM` socket; other socket types are unsupported.
uk: Оберніть існуючий сокет Python *sock* і поверніть екземпляр :attr:`SSSLContext.sslsocket_class` (за замовчуванням :class:`SSLSocket`). Повернений сокет SSL прив’язаний до контексту, його налаштувань і сертифікатів. *sock* має бути сокетом :data:`~socket.SOCK_STREAM`; інші типи сокетів не підтримуються.

source: The parameter ``server_side`` is a boolean which identifies whether server-side or client-side behavior is desired from this socket.
uk: Параметр ``server_side`` є логічним значенням, яке визначає, яка поведінка для цього сокета – серверна чи клієнтська.

source: For client-side sockets, the context construction is lazy; if the underlying socket isn't connected yet, the context construction will be performed after :meth:`connect` is called on the socket. For server-side sockets, if the socket has no remote peer, it is assumed to be a listening socket, and the server-side SSL wrapping is automatically performed on client connections accepted via the :meth:`accept` method. The method may raise :exc:`SSLError`.
uk: Для сокетів на стороні клієнта конструкція контексту є ледачою; якщо основний сокет ще не підключено, конструкція контексту буде виконана після виклику :meth:`connect` для сокета. Для сокетів на стороні сервера, якщо сокет не має віддаленого однорангового пристрою, він вважається сокетом, що прослуховує, і обернення SSL на стороні сервера автоматично виконується для підключень клієнта, прийнятих через метод :meth:`accept`. Метод може викликати :exc:`SSLError`.

source: On client connections, the optional parameter *server_hostname* specifies the hostname of the service which we are connecting to. This allows a single server to host multiple SSL-based services with distinct certificates, quite similarly to HTTP virtual hosts. Specifying *server_hostname* will raise a :exc:`ValueError` if *server_side* is true.
uk: У клієнтських з’єднаннях необов’язковий параметр *server_hostname* визначає ім’я хоста служби, до якої ми під’єднуємося. Це дозволяє одному серверу розміщувати кілька служб на основі SSL з окремими сертифікатами, подібно до віртуальних хостів HTTP. Якщо вказати *server_hostname*, виникне :exc:`ValueError`, якщо *server_side* має значення true.

source: The parameter ``do_handshake_on_connect`` specifies whether to do the SSL handshake automatically after doing a :meth:`socket.connect`, or whether the application program will call it explicitly, by invoking the :meth:`SSLSocket.do_handshake` method. Calling :meth:`SSLSocket.do_handshake` explicitly gives the program control over the blocking behavior of the socket I/O involved in the handshake.
uk: Параметр ``do_handshake_on_connect`` визначає, чи виконувати SSL-рукостискання автоматично після виконання :meth:`socket.connect`, чи прикладна програма викличе його явно, викликаючи метод :meth:`SSLSocket.do_handshake`. Виклик :meth:`SSLSocket.do_handshake` явно дає програмі контроль над поведінкою блокування вводу-виводу сокета, залученого до рукостискання.

source: The parameter ``suppress_ragged_eofs`` specifies how the :meth:`SSLSocket.recv` method should signal unexpected EOF from the other end of the connection. If specified as :const:`True` (the default), it returns a normal EOF (an empty bytes object) in response to unexpected EOF errors raised from the underlying socket; if :const:`False`, it will raise the exceptions back to the caller.
uk: Параметр ``suppress_ragged_eofs`` визначає, як метод :meth:`SSLSocket.recv` повинен сигналізувати про неочікуваний EOF з іншого боку з’єднання. Якщо вказано як :const:`True` (за замовчуванням), він повертає звичайний EOF (порожній об’єкт байтів) у відповідь на неочікувані помилки EOF, викликані базовим сокетом; якщо :const:`False`, винятки повертаються до абонента.

source: *session*, see :attr:`~SSLSocket.session`.
uk: *сеанс*, див. :attr:`~SSLSocket.session`.

source: Always allow a server_hostname to be passed, even if OpenSSL does not have SNI.
uk: Завжди дозволяйте передачу server_hostname, навіть якщо OpenSSL не має SNI.

source: *session* argument was added.
uk: Додано аргумент *сеанс*.

source: The return type of :meth:`SSLContext.wrap_socket`, defaults to :class:`SSLSocket`. The attribute can be overridden on instance of class in order to return a custom subclass of :class:`SSLSocket`.
uk: Тип повернення :meth:`SSLContext.wrap_socket` за замовчуванням :class:`SSLSocket`. Атрибут можна перевизначити в екземплярі класу, щоб повернути настроюваний підклас :class:`SSLSocket`.

source: Wrap the BIO objects *incoming* and *outgoing* and return an instance of :attr:`SSLContext.sslobject_class` (default :class:`SSLObject`). The SSL routines will read input data from the incoming BIO and write data to the outgoing BIO.
uk: Об’єднайте BIO-об’єкти *incoming* і *outgoing* і поверніть екземпляр :attr:`SSLContext.sslobject_class` (за замовчуванням :class:`SSLObject`). Підпрограми SSL читатимуть вхідні дані з вхідного BIO та записуватимуть дані у вихідний BIO.

source: The *server_side*, *server_hostname* and *session* parameters have the same meaning as in :meth:`SSLContext.wrap_socket`.
uk: Параметри *server_side*, *server_hostname* і *session* мають те саме значення, що й у :meth:`SSLContext.wrap_socket`.

source: The return type of :meth:`SSLContext.wrap_bio`, defaults to :class:`SSLObject`. The attribute can be overridden on instance of class in order to return a custom subclass of :class:`SSLObject`.
uk: Тип повернення :meth:`SSLContext.wrap_bio` за замовчуванням :class:`SSLObject`. Атрибут можна перевизначити в екземплярі класу, щоб повернути настроюваний підклас :class:`SSLObject`.

source: Whether to match the peer cert's hostname in :meth:`SSLSocket.do_handshake`. The context's :attr:`~SSLContext.verify_mode` must be set to :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`, and you must pass *server_hostname* to :meth:`~SSLContext.wrap_socket` in order to match the hostname. Enabling hostname checking automatically sets :attr:`~SSLContext.verify_mode` from :data:`CERT_NONE` to :data:`CERT_REQUIRED`. It cannot be set back to :data:`CERT_NONE` as long as hostname checking is enabled. The :data:`PROTOCOL_TLS_CLIENT` protocol enables hostname checking by default. With other protocols, hostname checking must be enabled explicitly.
uk: Чи відповідати імені хосту однорангового сертифіката в :meth:`SSLSocket.do_handshake`. :attr:`~SSLContext.verify_mode` контексту має бути встановлено на :data:`CERT_OPTIONAL` або :data:`CERT_REQUIRED`, і ви повинні передати *server_hostname* до :meth:`~SSLContext.wrap_socket` для відповідності ім'я хоста. Увімкнення перевірки імені хоста автоматично встановлює :attr:`~SSLContext.verify_mode` з :data:`CERT_NONE` на :data:`CERT_REQUIRED`. Його не можна повернути до :data:`CERT_NONE`, доки ввімкнено перевірку імені хоста. Протокол :data:`PROTOCOL_TLS_CLIENT` умикає перевірку імені хоста за умовчанням. Для інших протоколів перевірка імені хоста повинна бути включена явно.

source: :attr:`~SSLContext.verify_mode` is now automatically changed to :data:`CERT_REQUIRED` when hostname checking is enabled and :attr:`~SSLContext.verify_mode` is :data:`CERT_NONE`. Previously the same operation would have failed with a :exc:`ValueError`.
uk: :attr:`~SSSLContext.verify_mode` тепер автоматично змінюється на :data:`CERT_REQUIRED`, коли перевірку імені хоста ввімкнено, а :attr:`~SSSLContext.verify_mode` має значення :data:`CERT_NONE`. Раніше ця сама операція не виконувалася з помилкою :exc:`ValueError`.

source: Write TLS keys to a keylog file, whenever key material is generated or received. The keylog file is designed for debugging purposes only. The file format is specified by NSS and used by many traffic analyzers such as Wireshark. The log file is opened in append-only mode. Writes are synchronized between threads, but not between processes.
uk: Записуйте ключі TLS у файл клавіатурного журналу щоразу, коли створюється або отримується ключовий матеріал. Файл клавіатурного журналу створено лише для налагодження. Формат файлу визначається NSS і використовується багатьма аналізаторами трафіку, такими як Wireshark. Файл журналу відкривається в режимі лише додавання. Записи синхронізуються між потоками, але не між процесами.

source: A :class:`TLSVersion` enum member representing the highest supported TLS version. The value defaults to :attr:`TLSVersion.MAXIMUM_SUPPORTED`. The attribute is read-only for protocols other than :attr:`PROTOCOL_TLS`, :attr:`PROTOCOL_TLS_CLIENT`, and :attr:`PROTOCOL_TLS_SERVER`.
uk: Член переліку :class:`TLSVersion` представляє найвищу підтримувану версію TLS. Значенням за замовчуванням є :attr:`TLSVersion.MAXIMUM_SUPPORTED`. Атрибут доступний лише для читання для інших протоколів, ніж :attr:`PROTOCOL_TLS`, :attr:`PROTOCOL_TLS_CLIENT` і :attr:`PROTOCOL_TLS_SERVER`.

source: The attributes :attr:`~SSLContext.maximum_version`, :attr:`~SSLContext.minimum_version` and :attr:`SSLContext.options` all affect the supported SSL and TLS versions of the context. The implementation does not prevent invalid combination. For example a context with :attr:`OP_NO_TLSv1_2` in :attr:`~SSLContext.options` and :attr:`~SSLContext.maximum_version` set to :attr:`TLSVersion.TLSv1_2` will not be able to establish a TLS 1.2 connection.
uk: Атрибути :attr:`~SSLContext.maximum_version`, :attr:`~SSLContext.minimum_version` і :attr:`SSLContext.options` впливають на підтримувані версії контексту SSL і TLS. Реалізація не запобігає недійсній комбінації. Наприклад, контекст із :attr:`OP_NO_TLSv1_2` у :attr:`~SSLContext.options` і :attr:`~SSLContext.maximum_version` зі значенням :attr:`TLSVersion.TLSv1_2` не зможе встановити TLS 1.2 підключення.

source: Like :attr:`SSLContext.maximum_version` except it is the lowest supported version or :attr:`TLSVersion.MINIMUM_SUPPORTED`.
uk: Як :attr:`SSLContext.maximum_version`, за винятком того, що це найнижча підтримувана версія або :attr:`TLSVersion.MINIMUM_SUPPORTED`.

source: Control the number of TLS 1.3 session tickets of a :attr:`PROTOCOL_TLS_SERVER` context. The setting has no impact on TLS 1.0 to 1.2 connections.
uk: Контролюйте кількість квитків сесії TLS 1.3 контексту :attr:`PROTOCOL_TLS_SERVER`. Параметр не впливає на підключення TLS 1.0 до 1.2.

source: An integer representing the set of SSL options enabled on this context. The default value is :data:`OP_ALL`, but you can specify other options such as :data:`OP_NO_SSLv2` by ORing them together.
uk: Ціле число, що представляє набір параметрів SSL, увімкнених у цьому контексті. Стандартним значенням є :data:`OP_ALL`, але ви можете вказати інші параметри, наприклад :data:`OP_NO_SSLv2`, об’єднавши їх разом.

source: :attr:`SSLContext.options` returns :class:`Options` flags:
uk: :attr:`SSLContext.options` повертає прапорці :class:`Options`:

source: All ``OP_NO_SSL*`` and ``OP_NO_TLS*`` options have been deprecated since Python 3.7. Use :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
uk: Усі параметри ``OP_NO_SSL*`` і ``OP_NO_TLS*`` стали застарілими з Python 3.7. Замість цього використовуйте :attr:`SSLContext.minimum_version` і :attr:`SSLContext.maximum_version`.

source: Enable TLS 1.3 post-handshake client authentication. Post-handshake auth is disabled by default and a server can only request a TLS client certificate during the initial handshake. When enabled, a server may request a TLS client certificate at any time after the handshake.
uk: Увімкнути автентифікацію клієнта після рукостискання TLS 1.3. Автентифікація після рукостискання вимкнена за замовчуванням, і сервер може запитувати сертифікат клієнта TLS лише під час початкового рукостискання. Якщо ввімкнено, сервер може запитувати сертифікат клієнта TLS у будь-який час після рукостискання.

source: When enabled on client-side sockets, the client signals the server that it supports post-handshake authentication.
uk: Якщо ввімкнено на сокетах на стороні клієнта, клієнт сигналізує серверу, що він підтримує автентифікацію після рукостискання.

source: When enabled on server-side sockets, :attr:`SSLContext.verify_mode` must be set to :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`, too. The actual client cert exchange is delayed until :meth:`SSLSocket.verify_client_post_handshake` is called and some I/O is performed.
uk: Якщо ввімкнено на серверних сокетах, :attr:`SSLContext.verify_mode` також має бути встановлено на :data:`CERT_OPTIONAL` або :data:`CERT_REQUIRED`. Фактичний обмін сертифікатами клієнта відкладено, доки не буде викликано :meth:`SSLSocket.verify_client_post_handshake` і не буде виконано деякий ввід-вивід.

source: The protocol version chosen when constructing the context. This attribute is read-only.
uk: Версія протоколу, обрана під час побудови контексту. Цей атрибут доступний лише для читання.

source: Whether :attr:`~SSLContext.check_hostname` falls back to verify the cert's subject common name in the absence of a subject alternative name extension (default: true).
uk: Чи повертається :attr:`~SSLContext.check_hostname` для перевірки загальної назви суб’єкта сертифіката за відсутності альтернативного розширення імені суб’єкта (за умовчанням: істина).

source: The flag had no effect with OpenSSL before version 1.1.1k. Python 3.8.9, 3.9.3, and 3.10 include workarounds for previous versions.
uk: Прапор не мав ефекту з OpenSSL до версії 1.1.1k. Python 3.8.9, 3.9.3 і 3.10 містять обхідні шляхи для попередніх версій.

source: An integer representing the `security level <https://www.openssl.org/docs/manmaster/man3/SSL_CTX_get_security_level.html>`_ for the context. This attribute is read-only.
uk: Ціле число, що представляє `рівень безпеки <https://www.openssl.org/docs/manmaster/man3/SSL_CTX_get_security_level.html>`_ для контексту. Цей атрибут доступний лише для читання.

source: The flags for certificate verification operations. You can set flags like :data:`VERIFY_CRL_CHECK_LEAF` by ORing them together. By default OpenSSL does neither require nor verify certificate revocation lists (CRLs).
uk: Прапори для операцій перевірки сертифіката. Ви можете встановити такі прапорці, як :data:`VERIFY_CRL_CHECK_LEAF`, об’єднавши їх разом. За замовчуванням OpenSSL не вимагає і не перевіряє списки відкликаних сертифікатів (CRL).

source: :attr:`SSLContext.verify_flags` returns :class:`VerifyFlags` flags:
uk: :attr:`SSLContext.verify_flags` повертає :class:`VerifyFlags` прапорці:

source: Whether to try to verify other peers' certificates and how to behave if verification fails. This attribute must be one of :data:`CERT_NONE`, :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`.
uk: Чи намагатися перевірити сертифікати інших вузлів і як поводитися, якщо перевірка не вдається. Цей атрибут має бути одним із :data:`CERT_NONE`, :data:`CERT_OPTIONAL` або :data:`CERT_REQUIRED`.

source: :attr:`SSLContext.verify_mode` returns :class:`VerifyMode` enum:
uk: :attr:`SSLContext.verify_mode` повертає :class:`VerifyMode` enum:

source: Certificates
uk: Сертифікати

source: Certificates in general are part of a public-key / private-key system. In this system, each *principal*, (which may be a machine, or a person, or an organization) is assigned a unique two-part encryption key. One part of the key is public, and is called the *public key*; the other part is kept secret, and is called the *private key*. The two parts are related, in that if you encrypt a message with one of the parts, you can decrypt it with the other part, and **only** with the other part.
uk: Загалом сертифікати є частиною системи відкритого/приватного ключа. У цій системі кожному *принципалу* (яким може бути машина, або особа, або організація) призначається унікальний ключ шифрування, що складається з двох частин. Одна частина ключа є відкритою і називається *відкритим ключем*; інша частина зберігається в таємниці та називається *приватним ключем*. Ці дві частини пов’язані між собою, оскільки якщо ви зашифровуєте повідомлення за допомогою однієї з частин, ви можете розшифрувати його за допомогою іншої частини та **тільки** за допомогою іншої частини.
