Repository: python/python-docs-uk
Catalog: library/string.po
Languages: uk

source: Character. Converts the integer to the corresponding unicode character before printing.
uk: характер. Перетворює ціле число на відповідний символ Юнікоду перед друком.

source: Decimal Integer. Outputs the number in base 10.
uk: Десяткове ціле число. Виводить число за основою 10.

source: Octal format. Outputs the number in base 8.
uk: Вісімковий формат. Виводить число за основою 8.

source: Hex format. Outputs the number in base 16, using lower-case letters for the digits above 9.
uk: Шістнадцятковий формат. Виводить число за основою 16, використовуючи малі літери для цифр над 9.

source: Hex format. Outputs the number in base 16, using upper-case letters for the digits above 9. In case ``'#'`` is specified, the prefix ``'0x'`` will be upper-cased to ``'0X'`` as well.
uk: Шістнадцятковий формат. Виводить число за основою 16, використовуючи літери верхнього регістру для цифр над 9. Якщо вказано ``'#'``, префікс ``'0x'`` буде написаний у верхньому регістрі до ``'0X'`` також.

source: Number. This is the same as ``'d'``, except that it uses the current locale setting to insert the appropriate number separator characters.
uk: Номер. Це те саме, що ``'d''``, за винятком того, що він використовує поточні параметри мови для вставки відповідних символів-роздільників чисел.

source: The same as ``'d'``.
uk: Те саме, що ``'d'``.

source: The available presentation types for :class:`float` and :class:`~decimal.Decimal` values are:
uk: Доступні типи представлення значень :class:`float` і :class:`~decimal.Decimal`:

source: Scientific notation. Same as ``'e'`` except it uses an upper case 'E' as the separator character.
uk: Наукова нотація. Те саме, що ``'e'``, за винятком того, що він використовує верхній регістр 'E' як символ роздільника.

source: Fixed-point notation. Same as ``'f'``, but converts ``nan`` to ``NAN`` and ``inf`` to ``INF``.
uk: Позначення з фіксованою комою. Те саме, що ``'f``, але перетворює ``nan`` на ``NAN`` і ``inf`` на ``INF``.

source: General format. For a given precision ``p >= 1``, this rounds the number to ``p`` significant digits and then formats the result in either fixed-point format or in scientific notation, depending on its magnitude. A precision of ``0`` is treated as equivalent to a precision of ``1``.
uk: Загальний формат. Для заданої точності ``p >= 1`` це округлює число до ``p`` значущих цифр, а потім форматує результат або у форматі з фіксованою комою, або в науковому позначенні, залежно від його величини. Точність ``0`` розглядається як еквівалентна точності ``1``.

source: The precise rules are as follows: suppose that the result formatted with presentation type ``'e'`` and precision ``p-1`` would have exponent ``exp``. Then, if ``m <= exp < p``, where ``m`` is -4 for floats and -6 for :class:`Decimals <decimal.Decimal>`, the number is formatted with presentation type ``'f'`` and precision ``p-1-exp``. Otherwise, the number is formatted with presentation type ``'e'`` and precision ``p-1``. In both cases insignificant trailing zeros are removed from the significand, and the decimal point is also removed if there are no remaining digits following it, unless the ``'#'`` option is used.
uk: Точні правила такі: припустимо, що результат, відформатований із типом представлення ``'e'`` і точністю ``p-1``, матиме показник ``exp``. Тоді, якщо ``m <= exp < p``, where ``m`` is -4 for floats and -6 for :class:`Decimals <decimal.Decimal>`, число форматується з типом представлення ``'f'`` і точністю ``p-1-exp``. В іншому випадку число форматується з типом представлення ``'e`` і точністю ``p-1``. В обох випадках незначущі кінцеві нулі видаляються зі значущого, а десяткова кома також видаляється, якщо після неї не залишилося цифр, якщо не використовується опція ``'#'``.

source: With no precision given, uses a precision of ``6`` significant digits for :class:`float`. For :class:`~decimal.Decimal`, the coefficient of the result is formed from the coefficient digits of the value; scientific notation is used for values smaller than ``1e-6`` in absolute value and values where the place value of the least significant digit is larger than 1, and fixed-point notation is used otherwise.
uk: Без заданої точності, використовує точність ``6`` значущих цифр для :class:`float`. Для :class:`~decimal.Decimal` коефіцієнт результату формується з цифр коефіцієнта значення; наукова нотація використовується для значень, менших за ``1e-6`` в абсолютному значенні, і значень, де розрядне значення молодшої значущої цифри більше 1, а в інших випадках використовується нотація з фіксованою комою.

source: Positive and negative infinity, positive and negative zero, and nans, are formatted as ``inf``, ``-inf``, ``0``, ``-0`` and ``nan`` respectively, regardless of the precision.
uk: Позитивна і негативна нескінченність, позитивний і негативний нуль і nans форматуються як ``inf``, ``-inf``, ``0``, ``-0`` і ``nan`` відповідно, незалежно точності.

source: General format. Same as ``'g'`` except switches to ``'E'`` if the number gets too large. The representations of infinity and NaN are uppercased, too.
uk: Загальний формат. Те саме, що ``'g'``, за винятком переключення на ``'E'``, якщо число стає завеликим. Представлення нескінченності та NaN також написані у верхньому регістрі.

source: Number. This is the same as ``'g'``, except that it uses the current locale setting to insert the appropriate number separator characters.
uk: Номер. Це те саме, що ``'g''``, за винятком того, що він використовує поточні налаштування мови для вставки відповідних символів-роздільників чисел.

source: Percentage. Multiplies the number by 100 and displays in fixed (``'f'``) format, followed by a percent sign.
uk: Відсоток. Множить число на 100 і відображає у фіксованому форматі (``'f'``) із знаком відсотка.

source: For :class:`~decimal.Decimal`, this is the same as either ``'g'`` or ``'G'`` depending on the value of ``context.capitals`` for the current decimal context.
uk: Для :class:`~decimal.Decimal` це те саме, що ``'g'`` або ``'G'`` залежно від значення ``context.capitals`` для поточного десяткового контексту.

source: The overall effect is to match the output of :func:`str` as altered by the other format modifiers.
uk: Загальним ефектом є відповідність виводу :func:`str`, зміненого іншими модифікаторами формату.

source: Format examples
uk: Приклади форматування

source: This section contains examples of the :meth:`str.format` syntax and comparison with the old ``%``-formatting.
uk: Цей розділ містить приклади синтаксису :meth:`str.format` і порівняння зі старим ``%``-форматуванням.

source: In most of the cases the syntax is similar to the old ``%``-formatting, with the addition of the ``{}`` and with ``:`` used instead of ``%``. For example, ``'%03.2f'`` can be translated to ``'{:03.2f}'``.
uk: У більшості випадків синтаксис подібний до старого ``%``-форматування, з додаванням ``{}`` і використанням ``:`` замість ``%``. Наприклад, ``'%03.2f''`` можна перекласти на ``'{:03.2f}''``.

source: The new format syntax also supports new and different options, shown in the following examples.
uk: Новий синтаксис формату також підтримує нові та різні параметри, показані в наступних прикладах.

source: Accessing arguments by position::
uk: Доступ до аргументів за позицією::

source: Accessing arguments by name::
uk: Доступ до аргументів за назвою::

source: Accessing arguments' attributes::
uk: Доступ до атрибутів аргументів::

source: Accessing arguments' items::
uk: Доступ до елементів аргументів::

source: Replacing ``%s`` and ``%r``::
uk: Заміна ``%s`` та ``%r``::

source: Aligning the text and specifying a width::
uk: Вирівнювання тексту та визначення ширини::

source: Replacing ``%+f``, ``%-f``, and ``% f`` and specifying a sign::
uk: Заміна ``%+f``, ``%-f`` і ``% f`` та вказівка знака::

source: Replacing ``%x`` and ``%o`` and converting the value to different bases::
uk: Заміна ``%x`` і ``%o`` і перетворення значення на різні бази::

source: Using the comma as a thousands separator::
uk: Використання коми як роздільника тисяч::

source: Expressing a percentage::
uk: Вираз у відсотках::

source: Using type-specific formatting::
uk: Використання спеціального форматування::

source: Nesting arguments and more complex examples::
uk: Вкладені аргументи та більш складні приклади::

source: Template strings
uk: Рядки шаблону

source: Template strings support ``$``-based substitutions, using the following rules:
uk: Рядки шаблону підтримують заміни на основі ``$`` за такими правилами:

source: ``$$`` is an escape; it is replaced with a single ``$``.
uk: ``$$`` є екрануванням; він замінюється одним ``$``.

source: ``$identifier`` names a substitution placeholder matching a mapping key of ``"identifier"``. By default, ``"identifier"`` is restricted to any case-insensitive ASCII alphanumeric string (including underscores) that starts with an underscore or ASCII letter. The first non-identifier character after the ``$`` character terminates this placeholder specification.
uk: ``$identifier`` називає покажчик місця заповнення, що відповідає ключу відображення ``"identifier"``. За замовчуванням ``"ідентифікатор"`` обмежується будь-яким незалежним від регістру алфавітно-цифровим рядком ASCII (включаючи підкреслення), який починається з підкреслення або літери ASCII. Перший неідентифікаційний символ після символу ``$`` завершує цю специфікацію заповнювача.

source: ``${identifier}`` is equivalent to ``$identifier``. It is required when valid identifier characters follow the placeholder but are not part of the placeholder, such as ``"${noun}ification"``.
uk: ``${identifier}`` еквівалентний ``$identifier``. Він потрібен, якщо дійсні символи ідентифікатора слідують за заповнювачем, але не є частиною заповнювача, наприклад ``"${noun}ification"``.

source: Any other appearance of ``$`` in the string will result in a :exc:`ValueError` being raised.
uk: Будь-яка інша поява ``$`` у рядку призведе до появи :exc:`ValueError`.

source: The :mod:`string` module provides a :class:`Template` class that implements these rules. The methods of :class:`Template` are:
uk: Модуль :mod:`string` надає клас :class:`Template`, який реалізує ці правила. Методи :class:`Template`:

source: The constructor takes a single argument which is the template string.
uk: Конструктор приймає один аргумент, який є рядком шаблону.

source: Performs the template substitution, returning a new string. *mapping* is any dictionary-like object with keys that match the placeholders in the template. Alternatively, you can provide keyword arguments, where the keywords are the placeholders. When both *mapping* and *kwds* are given and there are duplicates, the placeholders from *kwds* take precedence.
uk: Виконує підстановку шаблону, повертаючи новий рядок. *mapping* — це будь-який словниковий об’єкт із ключами, які відповідають заповнювачам у шаблоні. Крім того, ви можете надати аргументи ключових слів, де ключові слова є заповнювачами. Якщо вказано як *mapping*, так і *kwds* і є дублікати, заповнювачі з *kwds* мають пріоритет.

source: Like :meth:`substitute`, except that if placeholders are missing from *mapping* and *kwds*, instead of raising a :exc:`KeyError` exception, the original placeholder will appear in the resulting string intact. Also, unlike with :meth:`substitute`, any other appearances of the ``$`` will simply return ``$`` instead of raising :exc:`ValueError`.
uk: Подібно до :meth:`substitute`, за винятком того, що якщо заповнювачі відсутні в *mapping* і *kwds*, замість виклику винятку :exc:`KeyError`, вихідний заповнювач відображатиметься в кінцевому рядку без змін. Крім того, на відміну від :meth:`substitute`, будь-яка інша поява ``$`` просто повертатиме ``$`` замість того, щоб викликати :exc:`ValueError`.

source: While other exceptions may still occur, this method is called "safe" because it always tries to return a usable string instead of raising an exception. In another sense, :meth:`safe_substitute` may be anything other than safe, since it will silently ignore malformed templates containing dangling delimiters, unmatched braces, or placeholders that are not valid Python identifiers.
uk: Хоча інші винятки все ще можуть виникати, цей метод називається "безпечним", оскільки він завжди намагається повернути придатний для використання рядок замість того, щоб викликати виняток. З іншого боку, :meth:`safe_substitute` може бути будь-чим іншим, ніж безпечним, оскільки він мовчки ігноруватиме неправильні шаблони, що містять висячі розділювачі, невідповідні фігурні дужки або заповнювачі, які не є дійсними ідентифікаторами Python.

source: :class:`Template` instances also provide one public data attribute:
uk: Екземпляри :class:`Template` також надають один публічний атрибут даних:

source: This is the object passed to the constructor's *template* argument. In general, you shouldn't change it, but read-only access is not enforced.
uk: Це об’єкт, переданий аргументу *template* конструктора. Загалом, вам не слід змінювати його, але доступ лише для читання не застосовується.

source: Here is an example of how to use a Template::
uk: Ось приклад використання шаблону::

source: Advanced usage: you can derive subclasses of :class:`Template` to customize the placeholder syntax, delimiter character, or the entire regular expression used to parse template strings. To do this, you can override these class attributes:
uk: Розширене використання: ви можете створити підкласи :class:`Template`, щоб налаштувати синтаксис заповнювача, символ роздільника або весь регулярний вираз, який використовується для аналізу рядків шаблону. Для цього ви можете змінити ці атрибути класу:

source: *delimiter* -- This is the literal string describing a placeholder introducing delimiter. The default value is ``$``. Note that this should *not* be a regular expression, as the implementation will call :meth:`re.escape` on this string as needed. Note further that you cannot change the delimiter after class creation (i.e. a different delimiter must be set in the subclass's class namespace).
uk: *розділювач* -- це літеральний рядок, що описує заповнювач, що вводить розділювач. Значення за замовчуванням – ``$``. Зауважте, що це *не* повинен бути регулярний вираз, оскільки реалізація викличе :meth:`re.escape` для цього рядка за потреби. Крім того, зауважте, що ви не можете змінити роздільник після створення класу (тобто інший роздільник має бути встановлено в просторі імен класу підкласу).

source: *idpattern* -- This is the regular expression describing the pattern for non-braced placeholders. The default value is the regular expression ``(?a:[_a-z][_a-z0-9]*)``. If this is given and *braceidpattern* is ``None`` this pattern will also apply to braced placeholders.
uk: *idpattern* – це регулярний вираз, що описує шаблон для заповнювачів без дужок. Стандартним значенням є регулярний вираз ``(?a:[_a-z][_a-z0-9]*)``. Якщо це задано і *braceidpattern* має значення ``None``, цей шаблон також застосовуватиметься до заповнювачів у дужках.

source: Since default *flags* is ``re.IGNORECASE``, pattern ``[a-z]`` can match with some non-ASCII characters. That's why we use the local ``a`` flag here.
uk: Оскільки типовими *прапорцями* є ``re.IGNORECASE``, шаблон ``[a-z]`` може збігатися з деякими символами, відмінними від ASCII. Ось чому ми використовуємо місцевий прапор ``a`` тут.

source: *braceidpattern* can be used to define separate patterns used inside and outside the braces.
uk: *braceidpattern* можна використовувати для визначення окремих шаблонів, що використовуються всередині та поза дужками.

source: *braceidpattern* -- This is like *idpattern* but describes the pattern for braced placeholders. Defaults to ``None`` which means to fall back to *idpattern* (i.e. the same pattern is used both inside and outside braces). If given, this allows you to define different patterns for braced and unbraced placeholders.
uk: *braceidpattern* -- Це схоже на *idpattern*, але описує шаблон для заповнювачів у дужках. За замовчуванням встановлено ``None``, що означає повернення до *idpattern* (тобто той самий шаблон використовується як усередині, так і ззовні дужок). Якщо дано, це дозволяє визначати різні шаблони для заповнювачів у дужках і без дужок.

source: *flags* -- The regular expression flags that will be applied when compiling the regular expression used for recognizing substitutions. The default value is ``re.IGNORECASE``. Note that ``re.VERBOSE`` will always be added to the flags, so custom *idpattern*\ s must follow conventions for verbose regular expressions.
uk: *flags* -- прапорці регулярного виразу, які будуть застосовані під час компіляції регулярного виразу, що використовується для розпізнавання підстановок. Значення за замовчуванням – ``re.IGNORECASE``. Зауважте, що ``re.VERBOSE`` завжди додаватиметься до прапорців, тому спеціальні *idpattern*\ мають відповідати угодам для докладних регулярних виразів.

source: Alternatively, you can provide the entire regular expression pattern by overriding the class attribute *pattern*. If you do this, the value must be a regular expression object with four named capturing groups. The capturing groups correspond to the rules given above, along with the invalid placeholder rule:
uk: Крім того, ви можете надати повний шаблон регулярного виразу, перевизначивши атрибут класу *pattern*. Якщо ви це зробите, значення має бути об’єктом регулярного виразу з чотирма іменованими групами захоплення. Групи захоплення відповідають правилам, наведеним вище, а також правилу недійсних заповнювачів:

source: *escaped* -- This group matches the escape sequence, e.g. ``$$``, in the default pattern.
uk: *escaped* -- ця група відповідає escape-послідовності, напр. ``$$``, у шаблоні за замовчуванням.

source: *named* -- This group matches the unbraced placeholder name; it should not include the delimiter in capturing group.
uk: *named* -- ця група відповідає імені заповнювача без дужок; він не повинен містити роздільник у групі захоплення.

source: *braced* -- This group matches the brace enclosed placeholder name; it should not include either the delimiter or braces in the capturing group.
uk: *в дужках* -- ця група відповідає імені заповнювача в дужках; він не повинен включати ні роздільник, ні дужки в групу захоплення.

source: *invalid* -- This group matches any other delimiter pattern (usually a single delimiter), and it should appear last in the regular expression.
uk: *invalid* -- ця група відповідає будь-якому іншому шаблону розділювача (зазвичай один роздільник), і вона має з’являтися останньою в регулярному виразі.

source: Helper functions
uk: Допоміжні функції

source: Split the argument into words using :meth:`str.split`, capitalize each word using :meth:`str.capitalize`, and join the capitalized words using :meth:`str.join`. If the optional second argument *sep* is absent or ``None``, runs of whitespace characters are replaced by a single space and leading and trailing whitespace are removed, otherwise *sep* is used to split and join the words.
uk: Розділіть аргумент на слова за допомогою :meth:`str.split`, кожне слово з великої літери за допомогою :meth:`str.capitalize` і об’єднайте слова з великої літери за допомогою :meth:`str.join`. Якщо необов’язковий другий аргумент *sep* відсутній або ``None``, ряди пробілів замінюються одним пробілом, а пробіли на початку та в кінці видаляються, інакше *sep* використовується для розділення та об’єднання слів.

source: [] (square brackets)
uk: [] (квадратні дужки)

source: ! (exclamation)
uk: ! (знак оклику)

source: - (minus)
uk: - (мінус)

source: # (hash)
uk: # (хеш)
