Repository: python/python-docs-uk
Catalog: library/stringprep.po
Languages: uk

source: **Source code:** :source:`Lib/stringprep.py`
uk: **Вихідний код:** :source:`Lib/stringprep.py`

source: When identifying things (such as host names) in the internet, it is often necessary to compare such identifications for "equality". Exactly how this comparison is executed may depend on the application domain, e.g. whether it should be case-insensitive or not. It may be also necessary to restrict the possible identifications, to allow only identifications consisting of "printable" characters.
uk: Під час ідентифікації речей (наприклад, імен хостів) в Інтернеті часто необхідно порівнювати такі ідентифікації на "рівність". Те, як саме виконується це порівняння, може залежати від домену програми, напр. чи має він бути нечутливим до регістру чи ні. Також може знадобитися обмежити можливі ідентифікації, щоб дозволити лише ідентифікації, що складаються з "друкованих" символів.

source: :rfc:`3454` defines a procedure for "preparing" Unicode strings in internet protocols. Before passing strings onto the wire, they are processed with the preparation procedure, after which they have a certain normalized form. The RFC defines a set of tables, which can be combined into profiles. Each profile must define which tables it uses, and what other optional parts of the ``stringprep`` procedure are part of the profile. One example of a ``stringprep`` profile is ``nameprep``, which is used for internationalized domain names.
uk: :rfc:`3454` визначає процедуру "підготовки" рядків Unicode в інтернет-протоколах. Перед пропусканням струн на дріт їх обробляють процедурою підготовки, після чого вони мають певну нормовану форму. RFC визначає набір таблиць, які можна об’єднати в профілі. Кожен профіль має визначати, які таблиці він використовує, і які інші додаткові частини процедури ``stringprep`` є частиною профілю. Одним із прикладів профілю ``stringprep`` є ``nameprep``, який використовується для інтернаціоналізованих доменних імен.

source: As a result, these tables are exposed as functions, not as data structures. There are two kinds of tables in the RFC: sets and mappings. For a set, :mod:`stringprep` provides the "characteristic function", i.e. a function that returns ``True`` if the parameter is part of the set. For mappings, it provides the mapping function: given the key, it returns the associated value. Below is a list of all functions available in the module.
uk: У результаті ці таблиці представлені як функції, а не як структури даних. У RFC існує два види таблиць: набори та відображення. Для набору :mod:`stringprep` надає "характеристичну функцію", тобто функцію, яка повертає ``True``, якщо параметр є частиною набору. Для відображень він надає функцію відображення: за допомогою ключа повертає відповідне значення. Нижче наведено список усіх функцій, доступних у модулі.

source: Determine whether *code* is in tableA.1 (Unassigned code points in Unicode 3.2).
uk: Визначте, чи є *код* у таблиці A.1 (непризначені кодові точки в Unicode 3.2).

source: Determine whether *code* is in tableB.1 (Commonly mapped to nothing).
uk: Визначте, чи міститься *код* у таблиці B.1 (зазвичай не відображається).

source: Return the mapped value for *code* according to tableB.2 (Mapping for case-folding used with NFKC).
uk: Повертає зіставлене значення для *коду* відповідно до таблиці B.2 (відповідність для згортання регістру, що використовується з NFKC).

source: Return the mapped value for *code* according to tableB.3 (Mapping for case-folding used with no normalization).
uk: Повертає відображене значення для *коду* відповідно до таблиці B.3 (відображення для згортання регістру використовується без нормалізації).

source: Determine whether *code* is in tableC.1.1 (ASCII space characters).
uk: Визначте, чи міститься *код* у таблиці C.1.1 (символи ASCII).

source: Determine whether *code* is in tableC.1.2 (Non-ASCII space characters).
uk: Визначте, чи є *код* у таблиці C.1.2 (символи, що не є ASCII).

source: Determine whether *code* is in tableC.1 (Space characters, union of C.1.1 and C.1.2).
uk: Визначте, чи є *код* у таблиці C.1 (пробіли, об’єднання C.1.1 і C.1.2).

source: Determine whether *code* is in tableC.2.1 (ASCII control characters).
uk: Визначте, чи є *код* у таблиці C.2.1 (контрольні символи ASCII).

source: Determine whether *code* is in tableC.2.2 (Non-ASCII control characters).
uk: Визначте, чи є *код* у таблиці C.2.2 (керуючі символи, що не є ASCII).

source: Determine whether *code* is in tableC.2 (Control characters, union of C.2.1 and C.2.2).
uk: Визначте, чи є *код* у таблиці C.2 (контрольні символи, об’єднання C.2.1 і C.2.2).

source: Determine whether *code* is in tableC.3 (Private use).
uk: Визначте, чи є *код* у таблиці C.3 (приватне використання).

source: Determine whether *code* is in tableC.4 (Non-character code points).
uk: Визначте, чи є *код* у таблиці C.4 (несимвольні кодові точки).

source: Determine whether *code* is in tableC.5 (Surrogate codes).
uk: Визначте, чи є *код* у таблиці C.5 (Сурогатні коди).

source: Determine whether *code* is in tableC.6 (Inappropriate for plain text).
uk: Визначте, чи міститься *код* у таблиці C.6 (неприйнятний для звичайного тексту).

source: Determine whether *code* is in tableC.7 (Inappropriate for canonical representation).
uk: Визначте, чи є *код* у таблиці C.7 (невідповідний для канонічного представлення).

source: Determine whether *code* is in tableC.8 (Change display properties or are deprecated).
uk: Визначте, чи є *код* у таблиці C.8 (змінити властивості відображення або застаріли).

source: Determine whether *code* is in tableC.9 (Tagging characters).
uk: Визначте, чи є *код* у таблиці C.9 (символи тегів).

source: Determine whether *code* is in tableD.1 (Characters with bidirectional property "R" or "AL").
uk: Визначте, чи є *код* у таблиці D.1 (символи з двонаправленою властивістю "R" або "AL").

source: Determine whether *code* is in tableD.2 (Characters with bidirectional property "L").
uk: Визначте, чи є *код* у таблиці D.2 (Символи з двонаправленою властивістю "L").
