Repository: python/python-docs-uk
Catalog: library/string.po
Languages: uk

source: **Source code:** :source:`Lib/string.py`
uk: **Вихідний код:** :source:`Lib/string.py`

source: String constants
uk: Рядкові константи

source: The constants defined in this module are:
uk: Константи, визначені в цьому модулі:

source: The concatenation of the :const:`ascii_lowercase` and :const:`ascii_uppercase` constants described below. This value is not locale-dependent.
uk: Конкатенація констант :const:`ascii_lowercase` і :const:`ascii_uppercase` описана нижче. Це значення не залежить від локалі.

source: The lowercase letters ``'abcdefghijklmnopqrstuvwxyz'``. This value is not locale-dependent and will not change.
uk: Малі літери ``'abcdefghijklmnopqrstuvwxyz''``. Це значення не залежить від локалі та не зміниться.

source: The uppercase letters ``'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. This value is not locale-dependent and will not change.
uk: Великі літери ``'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Це значення не залежить від локалі та не зміниться.

source: The string ``'0123456789'``.
uk: Рядок ``'0123456789''``.

source: The string ``'0123456789abcdefABCDEF'``.
uk: Рядок ``'0123456789abcdefABCDEF``.

source: The string ``'01234567'``.
uk: Рядок ``'01234567``.

source: String of ASCII characters which are considered punctuation characters in the ``C`` locale: ``!"#$%&'()*+,-./:;<=>?@[\]^_`{|}~``.
uk: Рядок символів ASCII, які вважаються знаками пунктуації в локалі ``C``:``!"#$%&'()*+,-./:;<=>?@[\]^_`{|}~``.

source: String of ASCII characters which are considered printable. This is a combination of :const:`digits`, :const:`ascii_letters`, :const:`punctuation`, and :const:`whitespace`.
uk: Рядок символів ASCII, які вважаються друкованими. Це комбінація :const:`digits`, :const:`ascii_letters`, :const:`punctuation` і :const:`whitespace`.

source: A string containing all ASCII characters that are considered whitespace. This includes the characters space, tab, linefeed, return, formfeed, and vertical tab.
uk: Рядок, що містить усі символи ASCII, які вважаються пробілами. Це включає символи пробілу, табуляції, переходу рядка, повернення, переходу форми та вертикальної табуляції.

source: Custom String Formatting
uk: Спеціальне форматування рядків

source: The built-in string class provides the ability to do complex variable substitutions and value formatting via the :meth:`~str.format` method described in :pep:`3101`. The :class:`Formatter` class in the :mod:`string` module allows you to create and customize your own string formatting behaviors using the same implementation as the built-in :meth:`~str.format` method.
uk: Вбудований клас рядків надає можливість робити складні заміни змінних і форматувати значення за допомогою методу :meth:`~str.format`, описаного в :pep:`3101`. Клас :class:`Formatter` в модулі :mod:`string` дозволяє вам створювати та налаштовувати власну поведінку форматування рядків, використовуючи ту саму реалізацію, що й вбудований метод :meth:`~str.format`.

source: The :class:`Formatter` class has the following public methods:
uk: Клас :class:`Formatter` має такі публічні методи:

source: The primary API method. It takes a format string and an arbitrary set of positional and keyword arguments. It is just a wrapper that calls :meth:`vformat`.
uk: Основний метод API. Він приймає рядок формату та довільний набір позиційних і ключових аргументів. Це просто оболонка, яка викликає :meth:`vformat`.

source: A format string argument is now :ref:`positional-only <positional-only_parameter>`.
uk: Аргумент формату рядка тепер :ref:`позиційний лише <positional-only_parameter>`.

source: This function does the actual work of formatting. It is exposed as a separate function for cases where you want to pass in a predefined dictionary of arguments, rather than unpacking and repacking the dictionary as individual arguments using the ``*args`` and ``**kwargs`` syntax. :meth:`vformat` does the work of breaking up the format string into character data and replacement fields. It calls the various methods described below.
uk: Ця функція виконує фактичну роботу з форматування. Вона представлена як окрема функція для випадків, коли ви хочете передати попередньо визначений словник аргументів, а не розпаковувати та перепаковувати словник як окремі аргументи за допомогою синтаксису ``*args`` і ``**kwargs``. :meth:`vformat` розбиває рядок формату на символьні дані та поля заміни. Він викликає різні методи, описані нижче.

source: In addition, the :class:`Formatter` defines a number of methods that are intended to be replaced by subclasses:
uk: Крім того, :class:`Formatter` визначає ряд методів, які мають бути замінені підкласами:

source: Loop over the format_string and return an iterable of tuples (*literal_text*, *field_name*, *format_spec*, *conversion*). This is used by :meth:`vformat` to break the string into either literal text, or replacement fields.
uk: Перейдіть до format_string і поверніть ітерацію кортежів (*literal_text*, *field_name*, *format_spec*, *conversion*). Це використовується :meth:`vformat`, щоб розбити рядок на буквальний текст або поля заміни.

source: The values in the tuple conceptually represent a span of literal text followed by a single replacement field. If there is no literal text (which can happen if two replacement fields occur consecutively), then *literal_text* will be a zero-length string. If there is no replacement field, then the values of *field_name*, *format_spec* and *conversion* will be ``None``.
uk: Значення в кортежі концептуально представляють проміжок літерального тексту, за яким слідує одне поле заміни. Якщо буквального тексту немає (що може статися, якщо два поля заміни зустрічаються поспіль), тоді *literal_text* буде рядком нульової довжини. Якщо поля заміни немає, значення *field_name*, *format_spec* і *conversion* будуть ``None``.

source: Given *field_name* as returned by :meth:`parse` (see above), convert it to an object to be formatted. Returns a tuple (obj, used_key). The default version takes strings of the form defined in :pep:`3101`, such as "0[name]" or "label.title". *args* and *kwargs* are as passed in to :meth:`vformat`. The return value *used_key* has the same meaning as the *key* parameter to :meth:`get_value`.
uk: Враховуючи *field_name*, яке повертає :meth:`parse` (див. вище), конвертуйте його в об’єкт для форматування. Повертає кортеж (obj, used_key). Версія за замовчуванням приймає рядки у формі, визначеній у :pep:`3101`, як-от "0[name]" або "label.title". *args* і *kwargs* передаються до :meth:`vformat`. Повернене значення *used_key* має те саме значення, що й параметр *key* для :meth:`get_value`.

source: Retrieve a given field value. The *key* argument will be either an integer or a string. If it is an integer, it represents the index of the positional argument in *args*; if it is a string, then it represents a named argument in *kwargs*.
uk: Отримати вказане значення поля. Аргумент *key* буде цілим числом або рядком. Якщо це ціле число, воно представляє індекс позиційного аргументу в *args*; якщо це рядок, то він представляє іменований аргумент у *kwargs*.

source: The *args* parameter is set to the list of positional arguments to :meth:`vformat`, and the *kwargs* parameter is set to the dictionary of keyword arguments.
uk: Параметр *args* встановлюється на список позиційних аргументів :meth:`vformat`, а параметр *kwargs* встановлюється на словник ключових аргументів.

source: For compound field names, these functions are only called for the first component of the field name; subsequent components are handled through normal attribute and indexing operations.
uk: Для складених імен полів ці функції викликаються лише для першого компонента імені поля; подальші компоненти обробляються через звичайні операції атрибутів та індексування.

source: So for example, the field expression '0.name' would cause :meth:`get_value` to be called with a *key* argument of 0. The ``name`` attribute will be looked up after :meth:`get_value` returns by calling the built-in :func:`getattr` function.
uk: Так, наприклад, вираз поля "0.name" призведе до виклику :meth:`get_value` з аргументом *key* 0. Атрибут ``name`` шукатиметься після :meth:`get_value` повертається шляхом виклику вбудованої функції :func:`getattr`.

source: If the index or keyword refers to an item that does not exist, then an :exc:`IndexError` or :exc:`KeyError` should be raised.
uk: Якщо індекс або ключове слово посилається на елемент, який не існує, тоді має бути викликана :exc:`IndexError` або :exc:`KeyError`.

source: Implement checking for unused arguments if desired. The arguments to this function is the set of all argument keys that were actually referred to in the format string (integers for positional arguments, and strings for named arguments), and a reference to the *args* and *kwargs* that was passed to vformat. The set of unused args can be calculated from these parameters. :meth:`check_unused_args` is assumed to raise an exception if the check fails.
uk: За потреби реалізуйте перевірку невикористаних аргументів. Аргументи цієї функції — це набір усіх ключів аргументів, на які фактично посилається рядок формату (цілі числа для позиційних аргументів і рядки для іменованих аргументів), а також посилання на *args* і *kwargs*, передане до vformat. Набір невикористаних аргументів можна обчислити за цими параметрами. Припускається, що :meth:`check_unused_args` викликає виключення, якщо перевірка не вдається.

source: :meth:`format_field` simply calls the global :func:`format` built-in. The method is provided so that subclasses can override it.
uk: :meth:`format_field` просто викликає глобальний вбудований :func:`format`. Метод надається для того, щоб підкласи могли його замінити.

source: Converts the value (returned by :meth:`get_field`) given a conversion type (as in the tuple returned by the :meth:`parse` method). The default version understands 's' (str), 'r' (repr) and 'a' (ascii) conversion types.
uk: Перетворює значення (повернуте :meth:`get_field`) із заданим типом перетворення (як у кортежі, поверненому методом :meth:`parse`). Версія за замовчуванням підтримує типи перетворення 's' (str), 'r' (repr) і 'a' (ascii).

source: Format String Syntax
uk: Синтаксис рядка формату

source: The :meth:`str.format` method and the :class:`Formatter` class share the same syntax for format strings (although in the case of :class:`Formatter`, subclasses can define their own format string syntax). The syntax is related to that of :ref:`formatted string literals <f-strings>`, but it is less sophisticated and, in particular, does not support arbitrary expressions.
uk: Метод :meth:`str.format` і клас :class:`Formatter` мають однаковий синтаксис для рядків форматування (хоча у випадку :class:`Formatter` підкласи можуть визначати власний синтаксис рядків форматування). Синтаксис подібний до синтаксису :ref:`форматованих рядкових літералів <f-strings>`, але він менш складний і, зокрема, не підтримує довільні вирази.

source: Format strings contain "replacement fields" surrounded by curly braces ``{}``. Anything that is not contained in braces is considered literal text, which is copied unchanged to the output. If you need to include a brace character in the literal text, it can be escaped by doubling: ``{{`` and ``}}``.
uk: Рядки формату містять "поля заміни", оточені фігурними дужками ``{}``. Все, що не міститься в фігурних дужках, вважається буквальним текстом, який копіюється без змін у вивід. Якщо вам потрібно включити фігурну дужку в буквальний текст, її можна екранувати подвоєнням: ``{{`` і ``}}``.

source: The grammar for a replacement field is as follows:
uk: Граматика поля заміни така:

source: In less formal terms, the replacement field can start with a *field_name* that specifies the object whose value is to be formatted and inserted into the output instead of the replacement field. The *field_name* is optionally followed by a *conversion* field, which is preceded by an exclamation point ``'!'``, and a *format_spec*, which is preceded by a colon ``':'``. These specify a non-default format for the replacement value.
uk: Якщо говорити менш формально, то поле заміни може починатися з *field_name*, яке визначає об’єкт, значення якого має бути відформатовано та вставлено у вихідні дані замість поля заміни. За *field_name* необов’язково йде поле *conversion*, якому передує знак оклику ``'!'``, і *format_spec*, якому передує двокрапка ``':''``. Вони вказують нестандартний формат для значення заміни.

source: See also the :ref:`formatspec` section.
uk: Дивіться також розділ :ref:`formatspec`.

source: The positional argument specifiers can be omitted for :meth:`str.format`, so ``'{} {}'.format(a, b)`` is equivalent to ``'{0} {1}'.format(a, b)``.
uk: Специфікатори позиційного аргументу можна опустити для :meth:`str.format`, тому ``'{} {}'.format(a, b)`` еквівалентний ``'{0} {1}'.format (а, б)``.

source: The positional argument specifiers can be omitted for :class:`Formatter`.
uk: Специфікатори позиційного аргументу можна опустити для :class:`Formatter`.

source: Some simple format string examples::
uk: Кілька простих прикладів рядків форматування::

source: Three conversion flags are currently supported: ``'!s'`` which calls :func:`str` on the value, ``'!r'`` which calls :func:`repr` and ``'!a'`` which calls :func:`ascii`.
uk: Наразі підтримуються три позначки перетворення: ``'!s'``, який викликає :func:`str` для значення, ``''!r'``, який викликає :func:`repr` та ``'!a'`` , який викликає :func:`ascii`.

source: Some examples::
uk: Деякі приклади::

source: The *format_spec* field contains a specification of how the value should be presented, including such details as field width, alignment, padding, decimal precision and so on. Each value type can define its own "formatting mini-language" or interpretation of the *format_spec*.
uk: Поле *format_spec* містить специфікацію того, як має бути представлене значення, включаючи такі деталі, як ширина поля, вирівнювання, відступ, десяткова точність тощо. Кожен тип значення може визначати власну "міні-мову форматування" або інтерпретацію *format_spec*.

source: Most built-in types support a common formatting mini-language, which is described in the next section.
uk: Більшість вбудованих типів підтримують загальну міні-мову форматування, яка описана в наступному розділі.

source: A *format_spec* field can also include nested replacement fields within it. These nested replacement fields may contain a field name, conversion flag and format specification, but deeper nesting is not allowed. The replacement fields within the format_spec are substituted before the *format_spec* string is interpreted. This allows the formatting of a value to be dynamically specified.
uk: Поле *format_spec* також може містити вкладені поля заміни. Ці вкладені поля заміни можуть містити назву поля, позначку перетворення та специфікацію формату, але глибше вкладення не допускається. Поля заміни в format_spec замінюються перед інтерпретацією рядка *format_spec*. Це дозволяє динамічно вказувати форматування значення.

source: See the :ref:`formatexamples` section for some examples.
uk: Перегляньте розділ :ref:`formatexamples` для деяких прикладів.

source: Format Specification Mini-Language
uk: Міні-мова специфікації формату

source: "Format specifications" are used within replacement fields contained within a format string to define how individual values are presented (see :ref:`formatstrings` and :ref:`f-strings`). They can also be passed directly to the built-in :func:`format` function. Each formattable type may define how the format specification is to be interpreted.
uk: "Специфікації формату" використовуються в полях заміни, що містяться в рядку формату, щоб визначити, як подаються окремі значення (див. :ref:`formatstrings` і :ref:`f-strings`). Їх також можна передати безпосередньо до вбудованої функції :func:`format`. Кожен форматований тип може визначати, як слід інтерпретувати специфікацію формату.

source: Most built-in types implement the following options for format specifications, although some of the formatting options are only supported by the numeric types.
uk: Більшість вбудованих типів реалізують такі параметри специфікацій формату, хоча деякі параметри форматування підтримуються лише числовими типами.

source: A general convention is that an empty format specification produces the same result as if you had called :func:`str` on the value. A non-empty format specification typically modifies the result.
uk: Загальна домовленість полягає в тому, що порожня специфікація формату дає такий самий результат, як якщо б ви викликали :func:`str` для значення. Непорожня специфікація формату зазвичай змінює результат.

source: The general form of a *standard format specifier* is:
uk: Загальна форма *специфікатора стандартного формату* така:

source: If a valid *align* value is specified, it can be preceded by a *fill* character that can be any character and defaults to a space if omitted. It is not possible to use a literal curly brace ("``{``" or "``}``") as the *fill* character in a :ref:`formatted string literal <f-strings>` or when using the :meth:`str.format` method. However, it is possible to insert a curly brace with a nested replacement field. This limitation doesn't affect the :func:`format` function.
uk: Якщо вказано дійсне значення *align*, йому може передувати символ *fill*, який може бути будь-яким символом і за замовчуванням є пробілом, якщо його опустити. Неможливо використовувати літеральну фігурну дужку ("``{``" або "``}``") як символ *fill* у :ref:`відформатованому рядковому літералі <f-strings>` або під час використання метод :meth:`str.format`. Однак можна вставити фігурну дужку з вкладеним полем заміни. Це обмеження не впливає на функцію :func:`format`.

source: The meaning of the various alignment options is as follows:
uk: Значення різних параметрів вирівнювання таке:

source: Option
uk: Варіант

source: Meaning
uk: Значення

source: Forces the field to be left-aligned within the available space (this is the default for most objects).
uk: Примусово вирівнює поле за лівим краєм у межах доступного простору (це типове значення для більшості об’єктів).

source: Forces the field to be right-aligned within the available space (this is the default for numbers).
uk: Примусово вирівнює поле за правим краєм у межах доступного простору (це типове значення для чисел).

source: Forces the field to be centered within the available space.
uk: Примусово центрує поле в межах доступного простору.

source: Note that unless a minimum field width is defined, the field width will always be the same size as the data to fill it, so that the alignment option has no meaning in this case.
uk: Зауважте, що якщо не визначено мінімальну ширину поля, ширина поля завжди матиме той самий розмір, що й дані для його заповнення, тому параметр вирівнювання не має значення в цьому випадку.

source: The *sign* option is only valid for number types, and can be one of the following:
uk: Параметр *знак* дійсний лише для типів чисел і може бути одним із таких:

source: indicates that a sign should be used for both positive as well as negative numbers.
uk: вказує на те, що знак слід використовувати як для додатних, так і для від’ємних чисел.

source: indicates that a sign should be used only for negative numbers (this is the default behavior).
uk: вказує, що знак слід використовувати лише для від’ємних чисел (це типова поведінка).

source: space
uk: простір

source: indicates that a leading space should be used on positive numbers, and a minus sign on negative numbers.
uk: вказує на те, що для додатних чисел слід використовувати пробіл, а для від’ємних – знак мінус.

source: The ``'#'`` option causes the "alternate form" to be used for the conversion. The alternate form is defined differently for different types. This option is only valid for integer, float and complex types. For integers, when binary, octal, or hexadecimal output is used, this option adds the respective prefix ``'0b'``, ``'0o'``, ``'0x'``, or ``'0X'`` to the output value. For float and complex the alternate form causes the result of the conversion to always contain a decimal-point character, even if no digits follow it. Normally, a decimal-point character appears in the result of these conversions only if a digit follows it. In addition, for ``'g'`` and ``'G'`` conversions, trailing zeros are not removed from the result.
uk: Опція ``'#'`` спричиняє використання "альтернативної форми" для перетворення. Альтернативна форма визначається по-різному для різних типів. Цей параметр дійсний лише для цілих чисел, типів із плаваючою точкою та складних типів. Для цілих чисел, коли використовується двійковий, вісімковий або шістнадцятковий вивід, цей параметр додає відповідний префікс ``'0b'``, ``'0o'``, ``'0x'`` або ``'0X'`` до вихідного значення. Для float і complex альтернативна форма призводить до того, що результат перетворення завжди міститиме символ десяткової коми, навіть якщо за ним не йде жодна цифра. Зазвичай символ десяткової коми з’являється в результаті цих перетворень, лише якщо за ним стоїть цифра. Крім того, для перетворень ``'g'`` і ``'G''`` кінцеві нулі не видаляються з результату.

source: The ``','`` option signals the use of a comma for a thousands separator. For a locale aware separator, use the ``'n'`` integer presentation type instead.
uk: Параметр ``',`` вказує на використання коми для роздільника тисяч. Для роздільника з урахуванням локалі використовуйте натомість цілочисельний тип представлення ``'n'``.

source: Added the ``','`` option (see also :pep:`378`).
uk: Додано параметр ``',''`` (див. також :pep:`378`).

source: Added the ``'_'`` option (see also :pep:`515`).
uk: Додано параметр ``'_'`` (див. також :pep:`515`).

source: *width* is a decimal integer defining the minimum total field width, including any prefixes, separators, and other formatting characters. If not specified, then the field width will be determined by the content.
uk: *ширина* — це десяткове ціле число, що визначає мінімальну загальну ширину поля, включаючи будь-які префікси, роздільники та інші символи форматування. Якщо не вказано, ширина поля визначатиметься вмістом.

source: Preceding the *width* field by ``'0'`` no longer affects the default alignment for strings.
uk: Попереднє поле *width* ``'0'`` більше не впливає на стандартне вирівнювання для рядків.

source: The *precision* is a decimal integer indicating how many digits should be displayed after the decimal point for presentation types ``'f'`` and ``'F'``, or before and after the decimal point for presentation types ``'g'`` or ``'G'``. For string presentation types the field indicates the maximum field size - in other words, how many characters will be used from the field content. The *precision* is not allowed for integer presentation types.
uk: *Точність* — це десяткове ціле число, яке вказує, скільки цифр має відображатися після коми для типів подання ``'f'`` і ``'F'`` або перед і після десяткової коми для типів подання ``'g'`` або ``'G''``. Для типів представлення рядків поле вказує максимальний розмір поля - іншими словами, скільки символів буде використано з вмісту поля. *Точність* не допускається для цілочисельних типів подання.

source: Finally, the *type* determines how the data should be presented.
uk: Нарешті, *тип* визначає, як мають бути представлені дані.

source: The available string presentation types are:
uk: Доступні типи подання рядків:

source: Type
uk: Тип

source: String format. This is the default type for strings and may be omitted.
uk: Формат рядка. Це типовий тип для рядків, і його можна опустити.

source: None
uk: Жодного

source: The same as ``'s'``.
uk: Те саме, що ``'s``.

source: The available integer presentation types are:
uk: Доступні типи представлення цілих чисел:

source: Binary format. Outputs the number in base 2.
uk: Двійковий формат. Виводить число за основою 2.
