Repository: python/python-docs-uk
Catalog: library/struct.po
Languages: uk

source: :mod:`struct` --- Interpret bytes as packed binary data
uk: :mod:`struct` --- Інтерпретувати байти як упаковані двійкові дані

source: **Source code:** :source:`Lib/struct.py`
uk: **Вихідний код:** :source:`Lib/struct.py`

source: This module performs conversions between Python values and C structs represented as Python :class:`bytes` objects. This can be used in handling binary data stored in files or from network connections, among other sources. It uses :ref:`struct-format-strings` as compact descriptions of the layout of the C structs and the intended conversion to/from Python values.
uk: Цей модуль виконує перетворення між значеннями Python і структурами C, представленими як об’єкти Python :class:`bytes`. Це можна використовувати для обробки двійкових даних, що зберігаються у файлах або з мережевих з’єднань, серед інших джерел. Він використовує :ref:`struct-format-strings` як компактний опис компонування структур C і передбачуваного перетворення в/з значень Python.

source: By default, the result of packing a given C struct includes pad bytes in order to maintain proper alignment for the C types involved; similarly, alignment is taken into account when unpacking. This behavior is chosen so that the bytes of a packed struct correspond exactly to the layout in memory of the corresponding C struct. To handle platform-independent data formats or omit implicit pad bytes, use ``standard`` size and alignment instead of ``native`` size and alignment: see :ref:`struct-alignment` for details.
uk: За замовчуванням результат упаковки заданої структури C включає байти заповнення, щоб підтримувати належне вирівнювання для задіяних типів C; так само центрування враховується при розпакуванні. Ця поведінка вибирається так, щоб байти упакованої структури точно відповідали макету в пам’яті відповідної структури C. Щоб обробляти незалежні від платформи формати даних або пропускати неявні байти, використовуйте ``стандартний`` розмір і вирівнювання замість ``власного`` розміру та вирівнювання: подробиці див. :ref:`struct-alignment`.

source: Several :mod:`struct` functions (and methods of :class:`Struct`) take a *buffer* argument. This refers to objects that implement the :ref:`bufferobjects` and provide either a readable or read-writable buffer. The most common types used for that purpose are :class:`bytes` and :class:`bytearray`, but many other types that can be viewed as an array of bytes implement the buffer protocol, so that they can be read/filled without additional copying from a :class:`bytes` object.
uk: Кілька функцій :mod:`struct` (та методи :class:`Struct`) приймають аргумент *buffer*. Це відноситься до об’єктів, які реалізують :ref:`bufferobjects` і забезпечують доступний для читання чи запису буфер. Найпоширенішими типами, які використовуються для цієї мети, є :class:`bytes` і :class:`bytearray`, але багато інших типів, які можна розглядати як масив байтів, реалізують протокол буфера, тому їх можна читати/заповнювати без додаткове копіювання з об'єкта :class:`bytes`.

source: Functions and Exceptions
uk: Функції та винятки

source: The module defines the following exception and functions:
uk: Модуль визначає такі винятки та функції:

source: Exception raised on various occasions; argument is a string describing what is wrong.
uk: Виняток, що виникає з різних приводів; аргумент - це рядок, що описує те, що є неправильним.

source: Return a bytes object containing the values *v1*, *v2*, ... packed according to the format string *format*. The arguments must match the values required by the format exactly.
uk: Повертає об’єкт bytes, що містить значення *v1*, *v2*, ... упаковані відповідно до рядка формату *format*. Аргументи мають точно відповідати значенням, які вимагає формат.

source: Pack the values *v1*, *v2*, ... according to the format string *format* and write the packed bytes into the writable buffer *buffer* starting at position *offset*. Note that *offset* is a required argument.
uk: Упакуйте значення *v1*, *v2*, ... відповідно до рядка формату *format* і запишіть упаковані байти в записуваний буфер *buffer*, починаючи з позиції *offset*. Зауважте, що *offset* є обов’язковим аргументом.

source: Unpack from the buffer *buffer* (presumably packed by ``pack(format, ...)``) according to the format string *format*. The result is a tuple even if it contains exactly one item. The buffer's size in bytes must match the size required by the format, as reflected by :func:`calcsize`.
uk: Розпакуйте з буфера *buffer* (імовірно запакованого ``pack(format, ...)``) відповідно до рядка формату *format*. Результатом є кортеж, навіть якщо він містить рівно один елемент. Розмір буфера в байтах має відповідати розміру, який вимагає формат, як це відображається :func:`calcsize`.

source: Unpack from *buffer* starting at position *offset*, according to the format string *format*. The result is a tuple even if it contains exactly one item. The buffer's size in bytes, starting at position *offset*, must be at least the size required by the format, as reflected by :func:`calcsize`.
uk: Розпакуйте з *buffer*, починаючи з позиції *offset*, відповідно до рядка формату *format*. Результатом є кортеж, навіть якщо він містить рівно один елемент. Розмір буфера в байтах, починаючи з позиції *offset*, має бути принаймні розміром, який вимагається форматом, що відображається :func:`calcsize`.

source: Iteratively unpack from the buffer *buffer* according to the format string *format*. This function returns an iterator which will read equally-sized chunks from the buffer until all its contents have been consumed. The buffer's size in bytes must be a multiple of the size required by the format, as reflected by :func:`calcsize`.
uk: Ітеративно розпакуйте з буфера *buffer* відповідно до рядка формату *format*. Ця функція повертає ітератор, який читатиме фрагменти однакового розміру з буфера, доки весь його вміст не буде використано. Розмір буфера в байтах має бути кратним розміру, який вимагає формат, як це відображається :func:`calcsize`.

source: Each iteration yields a tuple as specified by the format string.
uk: Кожна ітерація дає кортеж, як зазначено в рядку формату.

source: Return the size of the struct (and hence of the bytes object produced by ``pack(format, ...)``) corresponding to the format string *format*.
uk: Повертає розмір структури (і, отже, об’єкта bytes, створеного ``pack(format, ...)``), що відповідає рядку формату *format*.

source: Format Strings
uk: Форматувати рядки

source: Format strings are the mechanism used to specify the expected layout when packing and unpacking data. They are built up from :ref:`format-characters`, which specify the type of data being packed/unpacked. In addition, there are special characters for controlling the :ref:`struct-alignment`.
uk: Рядки формату — це механізм, який використовується для визначення очікуваного макета під час пакування та розпакування даних. Вони складаються з :ref:`format-characters`, які вказують тип даних, що пакуються/розпаковуються. Крім того, існують спеціальні символи для керування :ref:`struct-alignment`.

source: Byte Order, Size, and Alignment
uk: Порядок байтів, розмір і вирівнювання

source: By default, C types are represented in the machine's native format and byte order, and properly aligned by skipping pad bytes if necessary (according to the rules used by the C compiler).
uk: За замовчуванням типи C представлені у власному форматі машини та порядку байтів і належним чином вирівняні шляхом пропуску байтів, якщо необхідно (відповідно до правил, які використовує компілятор C).

source: Alternatively, the first character of the format string can be used to indicate the byte order, size and alignment of the packed data, according to the following table:
uk: Крім того, перший символ рядка формату можна використовувати для вказівки порядку байтів, розміру та вирівнювання упакованих даних згідно з наведеною нижче таблицею:

source: Character
uk: характер

source: Byte order
uk: Порядок байтів

source: Size
uk: Розмір

source: Alignment
uk: Вирівнювання

source: native
uk: рідний

source: standard
uk: стандарт

source: none
uk: немає

source: little-endian
uk: маленький байт

source: big-endian
uk: великий байт

source: network (= big-endian)
uk: мережа (= порядок байтів)

source: If the first character is not one of these, ``'@'`` is assumed.
uk: Якщо перший символ не є одним із цих, передбачається ``'@'``.

source: Native byte order is big-endian or little-endian, depending on the host system. For example, Intel x86 and AMD64 (x86-64) are little-endian; IBM z and most legacy architectures are big-endian; and ARM, RISC-V and IBM Power feature switchable endianness (bi-endian, though the former two are nearly always little-endian in practice). Use ``sys.byteorder`` to check the endianness of your system.
uk: Власний порядок байтів — старший або маленький, залежно від хост-системи. Наприклад, Intel x86 і AMD64 (x86-64) мають порядок байтів; IBM z і більшість застарілих архітектур мають порядок байтів; а ARM, RISC-V і IBM Power мають можливість перемикання порядку байтів (bi-endian, хоча на практиці перші два майже завжди мають порядковий порядок байтів). Використовуйте ``sys.byteorder``, щоб перевірити байтовий порядок вашої системи.

source: Native size and alignment are determined using the C compiler's ``sizeof`` expression. This is always combined with native byte order.
uk: Власний розмір і вирівнювання визначаються за допомогою виразу ``sizeof`` компілятора C. Це завжди поєднується з рідним порядком байтів.

source: Standard size depends only on the format character; see the table in the :ref:`format-characters` section.
uk: Стандартний розмір залежить тільки від символу формату; див. таблицю в розділі :ref:`format-characters`.

source: Note the difference between ``'@'`` and ``'='``: both use native byte order, but the size and alignment of the latter is standardized.
uk: Зверніть увагу на різницю між ``'@'`` і ``'='``: обидва використовують власний порядок байтів, але розмір і вирівнювання останнього стандартизовані.

source: The form ``'!'`` represents the network byte order which is always big-endian as defined in `IETF RFC 1700 <IETF RFC 1700_>`_.
uk: Форма ``'!'`` представляє мережевий порядок байтів, який завжди є старшим байтом, як визначено в `IETF RFC 1700 <IETF RFC 1700_>`_.

source: There is no way to indicate non-native byte order (force byte-swapping); use the appropriate choice of ``'<'`` or ``'>'``.
uk: Немає способу вказати невласний порядок байтів (примусова заміна байтів); використовуйте відповідний вибір ``' <'`` or ``'> ''``.

source: Notes:
uk: Примітки:

source: Padding is only automatically added between successive structure members. No padding is added at the beginning or the end of the encoded struct.
uk: Відступи автоматично додаються лише між послідовними елементами структури. Заповнення не додається на початку або в кінці закодованої структури.

source: No padding is added when using non-native size and alignment, e.g. with '<', '>', '=', and '!'.
uk: Під час використання невласного розміру та вирівнювання відступи не додаються, напр. з "<', '>", "=" і "!".

source: To align the end of a structure to the alignment requirement of a particular type, end the format with the code for that type with a repeat count of zero. See :ref:`struct-examples`.
uk: Щоб вирівняти кінець структури відповідно до вимог вирівнювання певного типу, завершіть формат кодом для цього типу з нульовою кількістю повторів. Див. :ref:`struct-examples`.

source: Format Characters
uk: Формат символів

source: Format characters have the following meaning; the conversion between C and Python values should be obvious given their types. The 'Standard size' column refers to the size of the packed value in bytes when using standard size; that is, when the format string starts with one of ``'<'``, ``'>'``, ``'!'`` or ``'='``. When using native size, the size of the packed value is platform-dependent.
uk: Символи форматування мають таке значення; перетворення між значеннями C і Python повинно бути очевидним, враховуючи їхні типи. Стовпець "Стандартний розмір" стосується розміру упакованого значення в байтах при використанні стандартного розміру; тобто, коли форматний рядок починається з одного з ``' <'``, ``'> ''``, ``'!''`` або ``'='``. При використанні рідного розміру розмір упакованого значення залежить від платформи.

source: Format
uk: Формат

source: C Type
uk: C Тип

source: Python type
uk: Тип Python

source: Standard size
uk: Стандартний розмір

source: Notes
uk: Примітки

source: no value
uk: немає значення

source: bytes of length 1
uk: байти довжиною 1

source: integer
uk: ціле число

source: ``i``
uk: ``я``

source: ``I``
uk: ``Я``

source: float
uk: плавати

source: bytes
uk: байтів

source: Added support for the ``'n'`` and ``'N'`` formats.
uk: Додано підтримку форматів ``'n'`` і ``'N'``.

source: Added support for the ``'e'`` format.
uk: Додано підтримку формату ``'e''``.

source: The ``'?'`` conversion code corresponds to the :c:type:`_Bool` type defined by C99. If this type is not available, it is simulated using a :c:type:`char`. In standard mode, it is always represented by one byte.
uk: Код перетворення ``'?'`` відповідає типу :c:type:`_Bool`, визначеному C99. Якщо цей тип недоступний, він імітується за допомогою :c:type:`char`. У стандартному режимі він завжди представлений одним байтом.

source: When attempting to pack a non-integer using any of the integer conversion codes, if the non-integer has a :meth:`__index__` method then that method is called to convert the argument to an integer before packing.
uk: Під час спроби запакувати неціле число за допомогою будь-якого з кодів перетворення цілого числа, якщо неціле число має метод :meth:`__index__`, тоді цей метод викликається для перетворення аргументу в ціле перед пакуванням.

source: Added use of the :meth:`__index__` method for non-integers.
uk: Додано використання методу :meth:`__index__` для нецілих чисел.

source: The ``'n'`` and ``'N'`` conversion codes are only available for the native size (selected as the default or with the ``'@'`` byte order character). For the standard size, you can use whichever of the other integer formats fits your application.
uk: Коди перетворення ``'n'`` і ``'N'`` доступні лише для рідного розміру (вибрано як типовий або з символом порядку байтів ``'@''``). Для стандартного розміру ви можете використовувати будь-який з інших форматів цілих чисел, який підходить для вашої програми.

source: For the ``'f'``, ``'d'`` and ``'e'`` conversion codes, the packed representation uses the IEEE 754 binary32, binary64 or binary16 format (for ``'f'``, ``'d'`` or ``'e'`` respectively), regardless of the floating-point format used by the platform.
uk: Для кодів перетворення ``'f'``, ``'d'`` і ``'e'`` упаковане представлення використовує формат IEEE 754 binary32, binary64 або binary16 (для ``'f''`` , ``'d'`` або ``'e'`` відповідно), незалежно від формату з плаваючою комою, який використовується платформою.

source: The ``'P'`` format character is only available for the native byte ordering (selected as the default or with the ``'@'`` byte order character). The byte order character ``'='`` chooses to use little- or big-endian ordering based on the host system. The struct module does not interpret this as native ordering, so the ``'P'`` format is not available.
uk: Символ формату ``'P'`` доступний лише для власного порядку байтів (вибрано як типовий або з символом порядку байтів ``'@'``). Символ порядку байтів ``'='`` вибирає порядок використання малого або великого порядку байтів на основі головної системи. Модуль struct не інтерпретує це як рідне впорядкування, тому формат ``'P'`` недоступний.

source: The IEEE 754 binary16 "half precision" type was introduced in the 2008 revision of the `IEEE 754 standard <ieee 754 standard_>`_. It has a sign bit, a 5-bit exponent and 11-bit precision (with 10 bits explicitly stored), and can represent numbers between approximately ``6.1e-05`` and ``6.5e+04`` at full precision. This type is not widely supported by C compilers: on a typical machine, an unsigned short can be used for storage, but not for math operations. See the Wikipedia page on the `half-precision floating-point format <half precision format_>`_ for more information.
uk: Двійковий тип16 IEEE 754 із "половиною точності" було введено в редакції 2008 року `стандарту IEEE 754 <ieee 754 standard_>`_. Він має знаковий біт, 5-бітний експоненту та 11-бітну точність (з 10 бітами, збереженими явно), і може представляти числа приблизно від ``6.1e-05`` до ``6.5e+04`` з повною точністю. . Цей тип не широко підтримується компіляторами C: на типовій машині беззнаковий короткий можна використовувати для зберігання, але не для математичних операцій. Перегляньте сторінку Вікіпедії про `формат числа з плаваючою комою половинної точності <half precision format_>`_ для отримання додаткової інформації.

source: A format character may be preceded by an integral repeat count. For example, the format string ``'4h'`` means exactly the same as ``'hhhh'``.
uk: Символу форматування може передувати цілий підрахунок повторів. Наприклад, рядок формату ``'4h''`` означає те саме, що ``'hhhh'``.

source: Whitespace characters between formats are ignored; a count and its format must not contain whitespace though.
uk: Пробіли між форматами ігноруються; кількість і його формат не повинні містити пробіли.

source: For the ``'s'`` format character, the count is interpreted as the length of the bytes, not a repeat count like for the other format characters; for example, ``'10s'`` means a single 10-byte string, while ``'10c'`` means 10 characters. If a count is not given, it defaults to 1. For packing, the string is truncated or padded with null bytes as appropriate to make it fit. For unpacking, the resulting bytes object always has exactly the specified number of bytes. As a special case, ``'0s'`` means a single, empty string (while ``'0c'`` means 0 characters).
uk: Для символу формату ``'s`` кількість інтерпретується як довжина байтів, а не кількість повторів, як для інших символів формату; наприклад, ``'10s'`` означає один 10-байтовий рядок, тоді як ``'10c''`` означає 10 символів. Якщо підрахунок не вказано, за замовчуванням він дорівнює 1. Для упаковки рядок скорочується або доповнюється нульовими байтами відповідно до того, щоб зробити його відповідним. Для розпакування отриманий об’єкт bytes завжди має точно вказану кількість байтів. Як окремий випадок, "0s" означає один порожній рядок (тоді як "0c" означає 0 символів).

source: When packing a value ``x`` using one of the integer formats (``'b'``, ``'B'``, ``'h'``, ``'H'``, ``'i'``, ``'I'``, ``'l'``, ``'L'``, ``'q'``, ``'Q'``), if ``x`` is outside the valid range for that format then :exc:`struct.error` is raised.
uk: Під час пакування значення ``x`` з використанням одного з цілочисельних форматів (``'b'``, ``'B'``, ``'h'``, ``'H'``, ``'i'``, ``'I'``, ``'l'``, ``'L'``, ``'q'``, ``'Q'``), якщо ``x`` знаходиться за межами допустимого діапазону для цього формату, тоді виникає :exc:`struct.error`.

source: Previously, some of the integer formats wrapped out-of-range values and raised :exc:`DeprecationWarning` instead of :exc:`struct.error`.
uk: Раніше деякі цілочисельні формати обгортали значення поза діапазоном і викликали :exc:`DeprecationWarning` замість :exc:`struct.error`.

source: The ``'p'`` format character encodes a "Pascal string", meaning a short variable-length string stored in a *fixed number of bytes*, given by the count. The first byte stored is the length of the string, or 255, whichever is smaller. The bytes of the string follow. If the string passed in to :func:`pack` is too long (longer than the count minus 1), only the leading ``count-1`` bytes of the string are stored. If the string is shorter than ``count-1``, it is padded with null bytes so that exactly count bytes in all are used. Note that for :func:`unpack`, the ``'p'`` format character consumes ``count`` bytes, but that the string returned can never contain more than 255 bytes.
uk: Символ формату ``'p'`` кодує "рядок Pascal", що означає короткий рядок змінної довжини, що зберігається у *фіксованій кількості байтів*, визначеній підрахунком. Перший збережений байт — це довжина рядка або 255, залежно від того, що менше. Далі йдуть байти рядка. Якщо рядок, переданий у :func:`pack`, задовгий (довший за лічильник мінус 1), зберігаються лише перші байти ``count-1`` рядка. Якщо рядок коротший за ``count-1``, він доповнюється нульовими байтами, щоб використати рівно кількість байтів. Зверніть увагу, що для :func:`unpack` символ формату ``'p'`` споживає ``count`` байтів, але що повернутий рядок ніколи не може містити більше 255 байтів.

source: For the ``'?'`` format character, the return value is either :const:`True` or :const:`False`. When packing, the truth value of the argument object is used. Either 0 or 1 in the native or standard bool representation will be packed, and any non-zero value will be ``True`` when unpacking.
uk: Для символу формату ``'?'`` повертається значення :const:`True` або :const:`False`. При упаковці використовується значення істинності об'єкта аргументу. Буде запаковано 0 або 1 у нативному або стандартному логічному представленні, а будь-яке ненульове значення під час розпакування буде ``True``.

source: Examples
uk: Приклади

source: All examples assume a native byte order, size, and alignment with a big-endian machine.
uk: Усі приклади передбачають власний порядок байтів, розмір і вирівнювання з машиною старшого порядку.

source: A basic example of packing/unpacking three integers::
uk: Базовий приклад пакування/розпакування трьох цілих чисел::

source: Unpacked fields can be named by assigning them to variables or by wrapping the result in a named tuple::
uk: Розпаковані поля можна назвати, призначивши їх змінним або загорнувши результат у іменований кортеж::

source: The ordering of format characters may have an impact on size since the padding needed to satisfy alignment requirements is different::
uk: Порядок символів формату може впливати на розмір, оскільки відступи, необхідні для задоволення вимог вирівнювання, відрізняються:

source: The following format ``'llh0l'`` specifies two pad bytes at the end, assuming longs are aligned on 4-byte boundaries::
uk: Наступний формат ``'llh0l'`` вказує два байти заповнення в кінці, припускаючи, що longs вирівняно на 4-байтових границях::

source: This only works when native size and alignment are in effect; standard size and alignment does not enforce any alignment.
uk: Це працює лише тоді, коли діють оригінальний розмір і вирівнювання; стандартний розмір і вирівнювання не забезпечують жодного вирівнювання.

source: Module :mod:`array`
uk: Модуль :mod:`array`

source: Packed binary storage of homogeneous data.
uk: Упаковане двійкове сховище однорідних даних.

source: Module :mod:`xdrlib`
uk: Модуль :mod:`xdrlib`

source: Packing and unpacking of XDR data.
uk: Пакування та розпакування даних XDR.

source: Classes
uk: Класи

source: The :mod:`struct` module also defines the following type:
uk: Модуль :mod:`struct` також визначає наступний тип:

source: Return a new Struct object which writes and reads binary data according to the format string *format*. Creating a Struct object once and calling its methods is more efficient than calling the :mod:`struct` functions with the same format since the format string only needs to be compiled once.
uk: Повертає новий об’єкт Struct, який записує та читає двійкові дані відповідно до рядка формату *format*. Одноразове створення об’єкта Struct і виклик його методів є більш ефективним, ніж виклик функцій :mod:`struct` з тим самим форматом, оскільки рядок формату потрібно скомпілювати лише один раз.
