Repository: python/python-docs-uk
Catalog: library/struct.po
Languages: uk

source: The compiled versions of the most recent format strings passed to :class:`Struct` and the module-level functions are cached, so programs that use only a few format strings needn't worry about reusing a single :class:`Struct` instance.
uk: Зібрані версії найновіших рядків формату, переданих до :class:`Struct`, і функцій рівня модуля кешуються, тому програмам, які використовують лише кілька рядків формату, не потрібно турбуватися про повторне використання окремого екземпляра :class:`Struct` .

source: Compiled Struct objects support the following methods and attributes:
uk: Зкомпільовані об’єкти Struct підтримують наступні методи та атрибути:

source: Identical to the :func:`pack` function, using the compiled format. (``len(result)`` will equal :attr:`size`.)
uk: Ідентична функції :func:`pack`, використовуючи скомпільований формат. (``len(result)`` дорівнюватиме :attr:`size`.)

source: Identical to the :func:`pack_into` function, using the compiled format.
uk: Ідентична функції :func:`pack_into`, використовуючи скомпільований формат.

source: Identical to the :func:`unpack` function, using the compiled format. The buffer's size in bytes must equal :attr:`size`.
uk: Ідентична функції :func:`unpack`, використовуючи скомпільований формат. Розмір буфера в байтах має дорівнювати :attr:`size`.

source: Identical to the :func:`unpack_from` function, using the compiled format. The buffer's size in bytes, starting at position *offset*, must be at least :attr:`size`.
uk: Ідентична функції :func:`unpack_from`, використовуючи скомпільований формат. Розмір буфера в байтах, починаючи з позиції *offset*, має бути не менше :attr:`size`.

source: Identical to the :func:`iter_unpack` function, using the compiled format. The buffer's size in bytes must be a multiple of :attr:`size`.
uk: Ідентична функції :func:`iter_unpack`, використовуючи скомпільований формат. Розмір буфера в байтах має бути кратним :attr:`size`.

source: The format string used to construct this Struct object.
uk: Рядок формату, який використовується для створення цього об’єкта Struct.

source: The format string type is now :class:`str` instead of :class:`bytes`.
uk: Тип рядка формату тепер :class:`str` замість :class:`bytes`.

source: The calculated size of the struct (and hence of the bytes object produced by the :meth:`pack` method) corresponding to :attr:`format`.
uk: Розрахований розмір структури (і, отже, об’єкта bytes, створеного методом :meth:`pack`), що відповідає :attr:`format`.
