Repository: python/python-docs-uk
Catalog: library/subprocess.po
Languages: uk

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process group will be created. This flag is necessary for using :func:`os.kill` on the subprocess.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що буде створено нову групу процесів. Цей прапорець необхідний для використання :func:`os.kill` у підпроцесі.

source: This flag is ignored if :data:`CREATE_NEW_CONSOLE` is specified.
uk: Цей прапорець ігнорується, якщо вказано :data:`CREATE_NEW_CONSOLE`.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an above average priority.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме пріоритет вище середнього.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a below average priority.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме пріоритет нижче середнього.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a high priority.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме високий пріоритет.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an idle (lowest) priority.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме неактивний (найнижчий) пріоритет.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have realtime priority. You should almost never use REALTIME_PRIORITY_CLASS, because this interrupts system threads that manage mouse input, keyboard input, and background disk flushing. This class can be appropriate for applications that "talk" directly to hardware or that perform brief tasks that should have limited interruptions.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме пріоритет у реальному часі. Ви майже ніколи не повинні використовувати REALTIME_PRIORITY_CLASS, оскільки це перериває системні потоки, які керують введенням даних миші, введенням даних з клавіатури та фоновим очищенням диска. Цей клас може підійти для програм, які "спілкуються" безпосередньо з обладнанням або виконують короткі завдання, які повинні мати обмежені перерви.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not create a window.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес не створюватиме вікно.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not inherit its parent's console. This value cannot be used with CREATE_NEW_CONSOLE.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес не успадковуватиме батьківську консоль. Це значення не можна використовувати з CREATE_NEW_CONSOLE.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process does not inherit the error mode of the calling process. Instead, the new process gets the default error mode. This feature is particularly useful for multithreaded shell applications that run with hard errors disabled.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес не успадковує режим помилки процесу, що викликає. Натомість новий процес отримує стандартний режим помилки. Ця функція особливо корисна для багатопоточних програм оболонки, які працюють із вимкненими серйозними помилками.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process is not associated with the job.
uk: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес не пов’язаний із завданням.

source: Older high-level API
uk: Старіший API високого рівня

source: Prior to Python 3.5, these three functions comprised the high level API to subprocess. You can now use :func:`run` in many cases, but lots of existing code calls these functions.
uk: До Python 3.5 ці три функції містили API високого рівня для підпроцесу. Тепер ви можете використовувати :func:`run` у багатьох випадках, але багато існуючого коду викликають ці функції.

source: Run the command described by *args*. Wait for command to complete, then return the :attr:`~Popen.returncode` attribute.
uk: Виконайте команду, описану *args*. Зачекайте, поки команда завершиться, а потім поверніть атрибут :attr:`~Popen.returncode`.

source: Code needing to capture stdout or stderr should use :func:`run` instead::
uk: Код, який потребує захоплення stdout або stderr, повинен використовувати замість цього :func:`run`::

source: To suppress stdout or stderr, supply a value of :data:`DEVNULL`.
uk: Щоб придушити stdout або stderr, укажіть значення :data:`DEVNULL`.

source: The arguments shown above are merely some common ones. The full function signature is the same as that of the :class:`Popen` constructor - this function passes all supplied arguments other than *timeout* directly through to that interface.
uk: Аргументи, наведені вище, є лише поширеними. Повний підпис функції такий самий, як і у конструктора :class:`Popen` - ця функція передає всі надані аргументи, окрім *timeout*, безпосередньо до цього інтерфейсу.

source: Do not use ``stdout=PIPE`` or ``stderr=PIPE`` with this function. The child process will block if it generates enough output to a pipe to fill up the OS pipe buffer as the pipes are not being read from.
uk: Не використовуйте ``stdout=PIPE`` або ``stderr=PIPE`` з цією функцією. Дочірній процес буде заблоковано, якщо він генерує достатньо вихідних даних у канал, щоб заповнити буфер каналу ОС, оскільки канали не зчитуються.

source: Run command with arguments. Wait for command to complete. If the return code was zero then return, otherwise raise :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute. If :func:`check_call` was unable to start the process it will propagate the exception that was raised.
uk: Виконати команду з аргументами. Дочекайтеся виконання команди. Якщо код повернення дорівнює нулю, тоді повертається, інакше викликається :exc:`CalledProcessError`. Об’єкт :exc:`CalledProcessError` матиме код повернення в атрибуті :attr:`~CalledProcessError.returncode`. Якщо :func:`check_call` не вдалося запустити процес, він поширить викликану виняткову ситуацію.

source: Run command with arguments and return its output.
uk: Виконати команду з аргументами та повернути її результат.

source: If the return code was non-zero it raises a :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute and any output in the :attr:`~CalledProcessError.output` attribute.
uk: Якщо код повернення був ненульовим, це викликає :exc:`CalledProcessError`. Об’єкт :exc:`CalledProcessError` матиме код повернення в атрибуті :attr:`~CalledProcessError.returncode` і будь-який вивід в атрибуті :attr:`~CalledProcessError.output`.

source: This is equivalent to::
uk: Це еквівалентно::

source: The arguments shown above are merely some common ones. The full function signature is largely the same as that of :func:`run` - most arguments are passed directly through to that interface. One API deviation from :func:`run` behavior exists: passing ``input=None`` will behave the same as ``input=b''`` (or ``input=''``, depending on other arguments) rather than using the parent's standard input file handle.
uk: Аргументи, наведені вище, є лише поширеними. Повний підпис функції здебільшого такий самий, як і :func:`run` - більшість аргументів передаються безпосередньо до цього інтерфейсу. Існує одне відхилення API від поведінки :func:`run`: передача ``input=None`` поводитиметься так само, як ``input=b''`` (або ``input=''``, залежно від інших аргументів ), а не використовувати стандартний дескриптор файлу введення батьківського.

source: By default, this function will return the data as encoded bytes. The actual encoding of the output data may depend on the command being invoked, so the decoding to text will often need to be handled at the application level.
uk: За замовчуванням ця функція повертатиме дані у вигляді закодованих байтів. Фактичне кодування вихідних даних може залежати від викликаної команди, тому декодування в текст часто потрібно виконувати на рівні програми.

source: This behaviour may be overridden by setting *text*, *encoding*, *errors*, or *universal_newlines* to ``True`` as described in :ref:`frequently-used-arguments` and :func:`run`.
uk: Цю поведінку можна змінити, встановивши для *text*, *encoding*, *errors* або *universal_newlines* значення ``True``, як описано в :ref:`frequently-used-arguments` і :func:`run`.

source: To also capture standard error in the result, use ``stderr=subprocess.STDOUT``::
uk: Щоб також зафіксувати стандартну помилку в результаті, використовуйте ``stderr=subprocess.STDOUT``::

source: Support for the *input* keyword argument was added.
uk: Додано підтримку аргументу ключового слова *input*.

source: *encoding* and *errors* were added. See :func:`run` for details.
uk: Додано *кодування* та *помилки*. Перегляньте :func:`run` для деталей.

source: Replacing Older Functions with the :mod:`subprocess` Module
uk: Заміна старих функцій модулем :mod:`subprocess`

source: In this section, "a becomes b" means that b can be used as a replacement for a.
uk: У цьому розділі "a стає b" означає, що b можна використовувати як заміну a.

source: All "a" functions in this section fail (more or less) silently if the executed program cannot be found; the "b" replacements raise :exc:`OSError` instead.
uk: Усі функції "a" в цьому розділі виходять з ладу (більш-менш) тихо, якщо виконувану програму неможливо знайти; натомість заміни "b" викликають :exc:`OSError`.

source: In addition, the replacements using :func:`check_output` will fail with a :exc:`CalledProcessError` if the requested operation produces a non-zero return code. The output is still available as the :attr:`~CalledProcessError.output` attribute of the raised exception.
uk: Крім того, заміни за допомогою :func:`check_output` завершаться помилкою з :exc:`CalledProcessError`, якщо запитана операція створює ненульовий код повернення. Вихід все ще доступний як атрибут :attr:`~CalledProcessError.output` викликаного винятку.

source: In the following examples, we assume that the relevant functions have already been imported from the :mod:`subprocess` module.
uk: У наступних прикладах ми припускаємо, що відповідні функції вже імпортовано з модуля :mod:`subprocess`.

source: Replacing :program:`/bin/sh` shell command substitution
uk: Заміна команди оболонки :program:`/bin/sh`

source: becomes::
uk: стає::

source: Replacing shell pipeline
uk: Заміна оболонкового трубопроводу

source: The ``p1.stdout.close()`` call after starting the p2 is important in order for p1 to receive a SIGPIPE if p2 exits before p1.
uk: Виклик ``p1.stdout.close()`` після запуску p2 важливий для того, щоб p1 отримував SIGPIPE, якщо p2 завершується перед p1.

source: Alternatively, for trusted input, the shell's own pipeline support may still be used directly:
uk: Крім того, для довіреного введення власна підтримка конвеєра оболонки може використовуватися безпосередньо:

source: Replacing :func:`os.system`
uk: Заміна :func:`os.system`

source: Notes:
uk: Примітки:

source: Calling the program through the shell is usually not required.
uk: Виклик програми через оболонку зазвичай не потрібен.

source: The :func:`call` return value is encoded differently to that of :func:`os.system`.
uk: Повернене значення :func:`call` кодується інакше, ніж значення :func:`os.system`.

source: The :func:`os.system` function ignores SIGINT and SIGQUIT signals while the command is running, but the caller must do this separately when using the :mod:`subprocess` module.
uk: Функція :func:`os.system` ігнорує сигнали SIGINT і SIGQUIT під час виконання команди, але абонент, що викликає, повинен робити це окремо, коли використовується модуль :mod:`subprocess`.

source: A more realistic example would look like this::
uk: Більш реалістичний приклад виглядатиме так:

source: Replacing the :func:`os.spawn <os.spawnl>` family
uk: Заміна сімейства :func:`os.spawn <os.spawnl>`

source: P_NOWAIT example::
uk: Приклад P_NOWAIT::

source: P_WAIT example::
uk: Приклад P_WAIT::

source: Vector example::
uk: Векторний приклад::

source: Environment example::
uk: Приклад середовища::

source: Replacing :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3`
uk: Заміна :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3`

source: Return code handling translates as follows::
uk: Обробка коду повернення перекладається наступним чином:

source: If the cmd argument to popen2 functions is a string, the command is executed through /bin/sh. If it is a list, the command is directly executed.
uk: Якщо аргумент cmd для функцій popen2 є рядком, команда виконується через /bin/sh. Якщо це список, команда виконується безпосередньо.

source: :class:`popen2.Popen3` and :class:`popen2.Popen4` basically work as :class:`subprocess.Popen`, except that:
uk: :class:`popen2.Popen3` і :class:`popen2.Popen4` в основному працюють як :class:`subprocess.Popen`, за винятком того, що:

source: :class:`Popen` raises an exception if the execution fails.
uk: :class:`Popen` викликає виняток, якщо виконання не вдається.

source: The *capturestderr* argument is replaced with the *stderr* argument.
uk: Аргумент *capturestderr* замінюється на аргумент *stderr*.

source: ``stdin=PIPE`` and ``stdout=PIPE`` must be specified.
uk: Необхідно вказати ``stdin=PIPE`` і ``stdout=PIPE``.

source: popen2 closes all file descriptors by default, but you have to specify ``close_fds=True`` with :class:`Popen` to guarantee this behavior on all platforms or past Python versions.
uk: popen2 закриває всі дескриптори файлів за замовчуванням, але ви повинні вказати ``close_fds=True`` з :class:`Popen`, щоб гарантувати таку поведінку на всіх платформах або попередніх версіях Python.

source: Legacy Shell Invocation Functions
uk: Застарілі функції виклику оболонки

source: This module also provides the following legacy functions from the 2.x ``commands`` module. These operations implicitly invoke the system shell and none of the guarantees described above regarding security and exception handling consistency are valid for these functions.
uk: Цей модуль також надає такі застарілі функції з модуля ``команд`` 2.x. Ці операції неявно викликають системну оболонку, і жодна з описаних вище гарантій безпеки та узгодженості обробки винятків не діє для цих функцій.

source: Return ``(exitcode, output)`` of executing *cmd* in a shell.
uk: Повернення ``(код виходу, вихід)`` виконання *cmd* в оболонці.

source: A trailing newline is stripped from the output. The exit code for the command can be interpreted as the return code of subprocess. Example::
uk: Кінцевий символ нового рядка видаляється з результату. Код виходу для команди можна інтерпретувати як код повернення підпроцесу. Приклад::

source: Windows support was added.
uk: Додано підтримку Windows.

source: The function now returns (exitcode, output) instead of (status, output) as it did in Python 3.3.3 and earlier. exitcode has the same value as :attr:`~Popen.returncode`.
uk: Тепер функція повертає (код виходу, вихід) замість (статус, вихід), як це було в Python 3.3.3 і попередніх версіях. код виходу має те саме значення, що й :attr:`~Popen.returncode`.

source: Return output (stdout and stderr) of executing *cmd* in a shell.
uk: Вихідні дані (stdout і stderr) виконання *cmd* в оболонці.

source: Like :func:`getstatusoutput`, except the exit code is ignored and the return value is a string containing the command's output. Example::
uk: Як :func:`getstatusoutput`, за винятком того, що код виходу ігнорується, а значення, що повертається, є рядком, що містить вихідні дані команди. Приклад::

source: Windows support added
uk: Додано підтримку Windows

source: Notes
uk: Примітки

source: Converting an argument sequence to a string on Windows
uk: Перетворення послідовності аргументів на рядок у Windows

source: On Windows, an *args* sequence is converted to a string that can be parsed using the following rules (which correspond to the rules used by the MS C runtime):
uk: У Windows послідовність *args* перетворюється на рядок, який можна проаналізувати за такими правилами (які відповідають правилам, які використовує середовище виконання MS C):

source: Arguments are delimited by white space, which is either a space or a tab.
uk: Аргументи розділені пробілом, який є пробілом або табуляцією.

source: A string surrounded by double quotation marks is interpreted as a single argument, regardless of white space contained within. A quoted string can be embedded in an argument.
uk: Рядок, взятий у подвійні лапки, інтерпретується як один аргумент, незалежно від пробілу, що міститься в ньому. Рядок у лапках можна вставити в аргумент.

source: A double quotation mark preceded by a backslash is interpreted as a literal double quotation mark.
uk: Подвійні лапки, перед якими стоїть зворотна скісна риска, інтерпретуються як буквальні подвійні лапки.

source: Backslashes are interpreted literally, unless they immediately precede a double quotation mark.
uk: Зворотні косі риски інтерпретуються буквально, якщо вони не стоять безпосередньо перед подвійними лапками.

source: If backslashes immediately precede a double quotation mark, every pair of backslashes is interpreted as a literal backslash. If the number of backslashes is odd, the last backslash escapes the next double quotation mark as described in rule 3.
uk: Якщо зворотні похилі риски безпосередньо передують подвійним лапкам, кожна пара зворотних похилих рисок інтерпретується як буквальна зворотна похила риска. Якщо кількість зворотних скісних рисок непарна, остання зворотна скісна риска виходить із наступних подвійних лапок, як описано в правилі 3.

source: Module which provides function to parse and escape command lines.
uk: Модуль, який забезпечує функцію аналізу та екранування командних рядків.

source: universal newlines
uk: універсальні символи нового рядка
