Repository: python/python-docs-uk
Catalog: library/subprocess.po
Languages: uk

source: **Source code:** :source:`Lib/subprocess.py`
uk: **Вихідний код:** :source:`Lib/subprocess.py`

source: The :mod:`subprocess` module allows you to spawn new processes, connect to their input/output/error pipes, and obtain their return codes. This module intends to replace several older modules and functions::
uk: Модуль :mod:`subprocess` дозволяє створювати нові процеси, підключатися до їхніх каналів вводу/виводу/помилок і отримувати їхні коди повернення. Цей модуль призначений для заміни кількох старих модулів і функцій:

source: Information about how the :mod:`subprocess` module can be used to replace these modules and functions can be found in the following sections.
uk: Інформацію про те, як модуль :mod:`subprocess` можна використовувати для заміни цих модулів і функцій, можна знайти в наступних розділах.

source: :pep:`324` -- PEP proposing the subprocess module
uk: :pep:`324` -- PEP пропонує модуль підпроцесу

source: Using the :mod:`subprocess` Module
uk: Використання модуля :mod:`subprocess`

source: The recommended approach to invoking subprocesses is to use the :func:`run` function for all use cases it can handle. For more advanced use cases, the underlying :class:`Popen` interface can be used directly.
uk: Рекомендований підхід до виклику підпроцесів полягає у використанні функції :func:`run` для всіх випадків використання, які вона може обробляти. Для більш складних випадків використання базовий інтерфейс :class:`Popen` можна використовувати безпосередньо.

source: Run the command described by *args*. Wait for command to complete, then return a :class:`CompletedProcess` instance.
uk: Виконайте команду, описану *args*. Зачекайте, поки команда завершиться, а потім поверніть екземпляр :class:`CompletedProcess`.

source: The arguments shown above are merely the most common ones, described below in :ref:`frequently-used-arguments` (hence the use of keyword-only notation in the abbreviated signature). The full function signature is largely the same as that of the :class:`Popen` constructor - most of the arguments to this function are passed through to that interface. (*timeout*, *input*, *check*, and *capture_output* are not.)
uk: Наведені вище аргументи є лише найпоширенішими, описаними нижче в :ref:`frequently-used-arguments` (звідси використання лише нотації ключових слів у скороченому підписі). Повна сигнатура функції здебільшого така сама, як і у конструктора :class:`Popen` – більшість аргументів цієї функції передаються до цього інтерфейсу. (*timeout*, *input*, *check* і *capture_output* не є.)

source: If *check* is true, and the process exits with a non-zero exit code, a :exc:`CalledProcessError` exception will be raised. Attributes of that exception hold the arguments, the exit code, and stdout and stderr if they were captured.
uk: Якщо *check* має значення true, і процес завершується з ненульовим кодом виходу, буде викликано виняток :exc:`CalledProcessError`. Атрибути цього винятку містять аргументи, код виходу, а також stdout і stderr, якщо вони були захоплені.

source: If *encoding* or *errors* are specified, or *text* is true, file objects for stdin, stdout and stderr are opened in text mode using the specified *encoding* and *errors* or the :class:`io.TextIOWrapper` default. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
uk: Якщо вказано *кодування* або *помилки*, або *текст* має значення true, файлові об’єкти для stdin, stdout і stderr відкриваються в текстовому режимі з використанням указаного *кодування* та *помилок* або :class:`io.TextIOWrapper` за замовчуванням. Аргумент *universal_newlines* еквівалентний *text* і надається для зворотної сумісності. За замовчуванням файлові об’єкти відкриваються у двійковому режимі.

source: Examples::
uk: Приклади::

source: Added *encoding* and *errors* parameters
uk: Додано параметри *кодування* та *помилки*

source: Added the *text* parameter, as a more understandable alias of *universal_newlines*. Added the *capture_output* parameter.
uk: Додано параметр *text* як більш зрозумілий псевдонім *universal_newlines*. Додано параметр *capture_output*.

source: The return value from :func:`run`, representing a process that has finished.
uk: Повернене значення від :func:`run`, що представляє процес, який завершився.

source: The arguments used to launch the process. This may be a list or a string.
uk: Аргументи, які використовуються для запуску процесу. Це може бути список або рядок.

source: Exit status of the child process. Typically, an exit status of 0 indicates that it ran successfully.
uk: Статус виходу дочірнього процесу. Як правило, статус виходу 0 вказує на успішне виконання.

source: A negative value ``-N`` indicates that the child was terminated by signal ``N`` (POSIX only).
uk: Від’ємне значення ``-N`` вказує на те, що дочірній елемент було завершено сигналом ``N`` (лише POSIX).

source: Captured stdout from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stdout was not captured.
uk: Перехоплений stdout із дочірнього процесу. Послідовність байтів або рядок, якщо :func:`run` було викликано з кодуванням, помилками або text=True. ``None``, якщо stdout не було захоплено.

source: If you ran the process with ``stderr=subprocess.STDOUT``, stdout and stderr will be combined in this attribute, and :attr:`stderr` will be ``None``.
uk: Якщо ви запустили процес із ``stderr=subprocess.STDOUT``, stdout і stderr буде об’єднано в цьому атрибуті, а :attr:`stderr` буде ``None``.

source: Captured stderr from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stderr was not captured.
uk: Захоплений stderr із дочірнього процесу. Послідовність байтів або рядок, якщо :func:`run` було викликано з кодуванням, помилками або text=True. ``None``, якщо stderr не було захоплено.

source: If :attr:`returncode` is non-zero, raise a :exc:`CalledProcessError`.
uk: Якщо :attr:`returncode` не дорівнює нулю, викликається :exc:`CalledProcessError`.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that the special file :data:`os.devnull` will be used.
uk: Спеціальне значення, яке можна використовувати як аргумент *stdin*, *stdout* або *stderr* для :class:`Popen` і вказує, що використовуватиметься спеціальний файл :data:`os.devnull`.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that a pipe to the standard stream should be opened. Most useful with :meth:`Popen.communicate`.
uk: Спеціальне значення, яке можна використовувати як аргумент *stdin*, *stdout* або *stderr* для :class:`Popen` і вказує, що канал до стандартного потоку має бути відкритий. Найкорисніше з :meth:`Popen.communicate`.

source: Special value that can be used as the *stderr* argument to :class:`Popen` and indicates that standard error should go into the same handle as standard output.
uk: Спеціальне значення, яке можна використовувати як аргумент *stderr* для :class:`Popen` і вказує, що стандартна помилка має надходити в той самий дескриптор, що й стандартний вихід.

source: Base class for all other exceptions from this module.
uk: Базовий клас для всіх інших винятків із цього модуля.

source: Subclass of :exc:`SubprocessError`, raised when a timeout expires while waiting for a child process.
uk: Підклас :exc:`SubprocessError`, викликається, коли закінчується час очікування під час очікування дочірнього процесу.

source: Command that was used to spawn the child process.
uk: Команда, яка була використана для створення дочірнього процесу.

source: Timeout in seconds.
uk: Час очікування в секундах.

source: Alias for output, for symmetry with :attr:`stderr`.
uk: Псевдонім для виведення, для симетрії з :attr:`stderr`.

source: *stdout* and *stderr* attributes added
uk: Додано атрибути *stdout* і *stderr*

source: Subclass of :exc:`SubprocessError`, raised when a process run by :func:`check_call`, :func:`check_output`, or :func:`run` (with ``check=True``) returns a non-zero exit status.
uk: Підклас :exc:`SubprocessError`, який виникає, коли процес, запущений :func:`check_call`, :func:`check_output` або :func:`run` (із ``check=True``), повертає не- нульовий статус виходу.

source: Exit status of the child process. If the process exited due to a signal, this will be the negative signal number.
uk: Статус виходу дочірнього процесу. Якщо процес завершився через сигнал, це буде негативне число сигналу.

source: Output of the child process if it was captured by :func:`run` or :func:`check_output`. Otherwise, ``None``.
uk: Висновок дочірнього процесу, якщо він був захоплений :func:`run` або :func:`check_output`. В іншому випадку ``Жодного``.

source: Stderr output of the child process if it was captured by :func:`run`. Otherwise, ``None``.
uk: Висновок stderr дочірнього процесу, якщо він був захоплений :func:`run`. В іншому випадку ``Жодного``.

source: Frequently Used Arguments
uk: Часто використовувані аргументи

source: To support a wide variety of use cases, the :class:`Popen` constructor (and the convenience functions) accept a large number of optional arguments. For most typical use cases, many of these arguments can be safely left at their default values. The arguments that are most commonly needed are:
uk: Щоб підтримувати широкий спектр варіантів використання, конструктор :class:`Popen` (і зручні функції) приймають велику кількість необов’язкових аргументів. Для більшості типових випадків використання багато з цих аргументів можна безпечно залишити за умовчанням. Найчастіше потрібні такі аргументи:

source: *args* is required for all calls and should be a string, or a sequence of program arguments. Providing a sequence of arguments is generally preferred, as it allows the module to take care of any required escaping and quoting of arguments (e.g. to permit spaces in file names). If passing a single string, either *shell* must be :const:`True` (see below) or else the string must simply name the program to be executed without specifying any arguments.
uk: *args* є обов’язковим для всіх викликів і має бути рядком або послідовністю аргументів програми. Надання послідовності аргументів зазвичай є кращим, оскільки це дозволяє модулю подбати про будь-які необхідні екранування та цитування аргументів (наприклад, дозволити пробіли в іменах файлів). Якщо передається один рядок, або *shell* має бути :const:`True` (див. нижче), або в іншому випадку рядок має просто назвати програму, яку потрібно виконати, без вказівки жодних аргументів.

source: If *encoding* or *errors* are specified, or *text* (also known as *universal_newlines*) is true, the file objects *stdin*, *stdout* and *stderr* will be opened in text mode using the *encoding* and *errors* specified in the call or the defaults for :class:`io.TextIOWrapper`.
uk: Якщо вказано *кодування* або *помилки*, або *текст* (також відомий як *universal_newlines*) має значення true, файлові об’єкти *stdin*, *stdout* і *stderr* буде відкрито в текстовому режимі за допомогою *кодування* і *помилки*, указані у виклику або за замовчуванням для :class:`io.TextIOWrapper`.

source: For *stdin*, line ending characters ``'\n'`` in the input will be converted to the default line separator :data:`os.linesep`. For *stdout* and *stderr*, all line endings in the output will be converted to ``'\n'``. For more information see the documentation of the :class:`io.TextIOWrapper` class when the *newline* argument to its constructor is ``None``.
uk: Для *stdin* символи закінчення рядків ``'\n'`` у вхідних даних буде перетворено на роздільник рядків за замовчуванням :data:`os.linesep`. Для *stdout* і *stderr* усі закінчення рядків у виводі буде перетворено на ``'\n'``. Для отримання додаткової інформації дивіться документацію класу :class:`io.TextIOWrapper`, якщо аргумент *нового рядка* його конструктора має значення ``None``.

source: If text mode is not used, *stdin*, *stdout* and *stderr* will be opened as binary streams. No encoding or line ending conversion is performed.
uk: Якщо текстовий режим не використовується, *stdin*, *stdout* і *stderr* будуть відкриті як бінарні потоки. Кодування або перетворення закінчення рядка не виконується.

source: Added the *text* parameter as an alias for *universal_newlines*.
uk: Додано параметр *text* як псевдонім для *universal_newlines*.

source: The newlines attribute of the file objects :attr:`Popen.stdin`, :attr:`Popen.stdout` and :attr:`Popen.stderr` are not updated by the :meth:`Popen.communicate` method.
uk: Атрибут нового рядка об’єктів файлу :attr:`Popen.stdin`, :attr:`Popen.stdout` і :attr:`Popen.stderr` не оновлюється методом :meth:`Popen.communicate`.

source: If *shell* is ``True``, the specified command will be executed through the shell. This can be useful if you are using Python primarily for the enhanced control flow it offers over most system shells and still want convenient access to other shell features such as shell pipes, filename wildcards, environment variable expansion, and expansion of ``~`` to a user's home directory. However, note that Python itself offers implementations of many shell-like features (in particular, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser`, and :mod:`shutil`).
uk: Якщо *shell* має значення ``True``, зазначена команда буде виконана через оболонку. Це може бути корисним, якщо ви використовуєте Python насамперед для розширеного потоку керування, який він пропонує для більшості системних оболонок, і все ще бажаєте зручний доступ до інших функцій оболонки, таких як канали оболонки, символи підстановки імен файлів, розширення змінних середовища та розширення ``~`` до домашнього каталогу користувача. Однак зауважте, що сам Python пропонує реалізацію багатьох функцій, подібних до оболонки (зокрема, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser` і :mod:`shutil`).

source: When *universal_newlines* is ``True``, the class uses the encoding :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` instead of ``locale.getpreferredencoding()``. See the :class:`io.TextIOWrapper` class for more information on this change.
uk: Якщо *universal_newlines* має значення ``True``, клас використовує кодування :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` замість ``locale.getpreferredencoding()``. Перегляньте клас :class:`io.TextIOWrapper` для отримання додаткової інформації про цю зміну.

source: Read the `Security Considerations`_ section before using ``shell=True``.
uk: Перед використанням shell=True прочитайте розділ `Security Considerations`_.

source: These options, along with all of the other options, are described in more detail in the :class:`Popen` constructor documentation.
uk: Ці параметри разом з усіма іншими опціями описані більш детально в документації конструктора :class:`Popen`.

source: Popen Constructor
uk: Конструктор Popen

source: The underlying process creation and management in this module is handled by the :class:`Popen` class. It offers a lot of flexibility so that developers are able to handle the less common cases not covered by the convenience functions.
uk: Створення основного процесу та керування ним у цьому модулі обробляється класом :class:`Popen`. Він пропонує велику гнучкість, щоб розробники могли обробляти менш поширені випадки, які не охоплюються функціями зручності.

source: Execute a child program in a new process. On POSIX, the class uses :meth:`os.execvpe`-like behavior to execute the child program. On Windows, the class uses the Windows ``CreateProcess()`` function. The arguments to :class:`Popen` are as follows.
uk: Виконати дочірню програму в новому процесі. У POSIX клас використовує :meth:`os.execvpe`-подібну поведінку для виконання дочірньої програми. У Windows цей клас використовує функцію ``CreateProcess()`` Windows. Аргументи :class:`Popen` такі.

source: *args* should be a sequence of program arguments or else a single string or :term:`path-like object`. By default, the program to execute is the first item in *args* if *args* is a sequence. If *args* is a string, the interpretation is platform-dependent and described below. See the *shell* and *executable* arguments for additional differences from the default behavior. Unless otherwise stated, it is recommended to pass *args* as a sequence.
uk: *args* має бути послідовністю аргументів програми або одним рядком або :term:`path-like object`. За замовчуванням програма для виконання є першим елементом у *args*, якщо *args* є послідовністю. Якщо *args* є рядком, інтерпретація залежить від платформи та описана нижче. Перегляньте аргументи *shell* і *executable*, щоб дізнатися про додаткові відмінності від поведінки за замовчуванням. Якщо не вказано інше, рекомендується передавати *args* як послідовність.

source: Resolving the path of *executable* (or the first item of *args*) is platform dependent. For POSIX, see :meth:`os.execvpe`, and note that when resolving or searching for the executable path, *cwd* overrides the current working directory and *env* can override the ``PATH`` environment variable. For Windows, see the documentation of the ``lpApplicationName`` and ``lpCommandLine`` parameters of WinAPI ``CreateProcess``, and note that when resolving or searching for the executable path with ``shell=False``, *cwd* does not override the current working directory and *env* cannot override the ``PATH`` environment variable. Using a full path avoids all of these variations.
uk: Визначення шляху *виконуваного файлу* (або першого елемента *args*) залежить від платформи. Для POSIX перегляньте :meth:`os.execvpe` і зауважте, що під час визначення або пошуку шляху до виконуваного файлу *cwd* замінює поточний робочий каталог, а *env* може замінювати змінну середовища ``PATH``. Для Windows перегляньте документацію щодо параметрів ``lpApplicationName`` і ``lpCommandLine`` WinAPI ``CreateProcess`` і зауважте, що під час визначення або пошуку шляху до виконуваного файлу за допомогою ``shell=False`` *cwd* не перевизначає поточний робочий каталог, а *env* не може перевизначати змінну середовища ``PATH``. Використання повного шляху дозволяє уникнути всіх цих варіантів.

source: An example of passing some arguments to an external program as a sequence is::
uk: Приклад передачі деяких аргументів зовнішній програмі у вигляді послідовності:

source: On POSIX, if *args* is a string, the string is interpreted as the name or path of the program to execute. However, this can only be done if not passing arguments to the program.
uk: У POSIX, якщо *args* є рядком, рядок інтерпретується як ім’я або шлях до програми для виконання. Однак це можна зробити, лише якщо не передати аргументи програмі.

source: It may not be obvious how to break a shell command into a sequence of arguments, especially in complex cases. :meth:`shlex.split` can illustrate how to determine the correct tokenization for *args*::
uk: Може бути неочевидним, як розбити команду оболонки на послідовність аргументів, особливо у складних випадках. :meth:`shlex.split` може проілюструвати, як визначити правильну токенізацію для *args*::

source: Note in particular that options (such as *-input*) and arguments (such as *eggs.txt*) that are separated by whitespace in the shell go in separate list elements, while arguments that need quoting or backslash escaping when used in the shell (such as filenames containing spaces or the *echo* command shown above) are single list elements.
uk: Зокрема, зауважте, що параметри (такі як *-input*) і аргументи (такі як *eggs.txt*), відокремлені пробілами в оболонці, розміщуються в окремих елементах списку, тоді як аргументи, які потребують лапок або екранування зворотної скісної риски, коли використовуються в shell (наприклад, імена файлів, що містять пробіли, або команда *echo*, показана вище) є одними елементами списку.

source: On Windows, if *args* is a sequence, it will be converted to a string in a manner described in :ref:`converting-argument-sequence`. This is because the underlying ``CreateProcess()`` operates on strings.
uk: У Windows, якщо *args* є послідовністю, вона буде перетворена на рядок у спосіб, описаний у :ref:`converting-argument-sequence`. Це тому, що базовий ``CreateProcess()`` працює з рядками.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing path-like objects on POSIX.
uk: Параметр *args* приймає :term:`path-like object`, якщо *shell* має значення ``False``, і послідовність, що містить шляхові об’єкти на POSIX.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing bytes and path-like objects on Windows.
uk: Параметр *args* приймає :term:`path-like object`, якщо *shell* має значення ``False``, а також послідовність, що містить байти та шляхоподібні об’єкти у Windows.

source: The *shell* argument (which defaults to ``False``) specifies whether to use the shell as the program to execute. If *shell* is ``True``, it is recommended to pass *args* as a string rather than as a sequence.
uk: Аргумент *shell* (який за замовчуванням має значення ``False``) визначає, чи використовувати оболонку як програму для виконання. Якщо *shell* має значення ``True``, рекомендується передавати *args* як рядок, а не як послідовність.

source: On POSIX with ``shell=True``, the shell defaults to :file:`/bin/sh`. If *args* is a string, the string specifies the command to execute through the shell. This means that the string must be formatted exactly as it would be when typed at the shell prompt. This includes, for example, quoting or backslash escaping filenames with spaces in them. If *args* is a sequence, the first item specifies the command string, and any additional items will be treated as additional arguments to the shell itself. That is to say, :class:`Popen` does the equivalent of::
uk: У POSIX із ``shell=True`` оболонкою за замовчуванням є :file:`/bin/sh`. Якщо *args* є рядком, цей рядок визначає команду для виконання через оболонку. Це означає, що рядок має бути відформатований точно так, як він був би під час введення в команду оболонки. Це включає, наприклад, лапки або екранування назв файлів із пробілами. Якщо *args* є послідовністю, перший елемент визначає командний рядок, а будь-які додаткові елементи розглядатимуться як додаткові аргументи самої оболонки. Тобто :class:`Popen` виконує еквівалент::

source: On Windows with ``shell=True``, the :envvar:`COMSPEC` environment variable specifies the default shell. The only time you need to specify ``shell=True`` on Windows is when the command you wish to execute is built into the shell (e.g. :command:`dir` or :command:`copy`). You do not need ``shell=True`` to run a batch file or console-based executable.
uk: У Windows із ``shell=True`` змінна середовища :envvar:`COMSPEC` визначає оболонку за замовчуванням. Єдиний раз, коли вам потрібно вказати ``shell=True`` у Windows, це коли команда, яку ви хочете виконати, вбудована в оболонку (наприклад, :command:`dir` або :command:`copy`). Вам не потрібен ``shell=True`` для запуску пакетного файлу або виконуваного файлу на консолі.

source: *bufsize* will be supplied as the corresponding argument to the :func:`open` function when creating the stdin/stdout/stderr pipe file objects:
uk: *bufsize* буде надано як відповідний аргумент функції :func:`open` під час створення об’єктів файлу каналу stdin/stdout/stderr:

source: any other positive value means use a buffer of approximately that size
uk: будь-яке інше позитивне значення означає використання буфера приблизно такого розміру
