Repository: python/python-docs-uk
Catalog: library/subprocess.po
Languages: uk

source: negative bufsize (the default) means the system default of io.DEFAULT_BUFFER_SIZE will be used.
uk: negative bufsize (за замовчуванням) означає, що буде використано системне значення io.DEFAULT_BUFFER_SIZE.

source: The *executable* argument specifies a replacement program to execute. It is very seldom needed. When ``shell=False``, *executable* replaces the program to execute specified by *args*. However, the original *args* is still passed to the program. Most programs treat the program specified by *args* as the command name, which can then be different from the program actually executed. On POSIX, the *args* name becomes the display name for the executable in utilities such as :program:`ps`. If ``shell=True``, on POSIX the *executable* argument specifies a replacement shell for the default :file:`/bin/sh`.
uk: Аргумент *executable* визначає програму заміни для виконання. Це дуже рідко потрібно. Коли ``shell=False``, *executable* замінює програму для виконання, указану *args*. Однак оригінальні *args* усе ще передаються програмі. Більшість програм розглядають програму, визначену *args*, як назву команди, яка потім може відрізнятися від фактично виконаної програми. У POSIX ім’я *args* стає відображуваним ім’ям для виконуваного файлу в таких утилітах, як :program:`ps`. Якщо ``shell=True``, у POSIX *виконуваний* аргумент вказує на заміну оболонки для типового :file:`/bin/sh`.

source: *executable* parameter accepts a :term:`path-like object` on POSIX.
uk: Параметр *executable* приймає :term:`path-like object` на POSIX.

source: *executable* parameter accepts a bytes and :term:`path-like object` on Windows.
uk: Параметр *executable* приймає байти та :term:`path-like object` у Windows.

source: If *preexec_fn* is set to a callable object, this object will be called in the child process just before the child is executed. (POSIX only)
uk: Якщо *preexec_fn* встановлено на об’єкт, який можна викликати, цей об’єкт буде викликано в дочірньому процесі безпосередньо перед виконанням дочірнього процесу. (лише POSIX)

source: The *preexec_fn* parameter is no longer supported in subinterpreters. The use of the parameter in a subinterpreter raises :exc:`RuntimeError`. The new restriction may affect applications that are deployed in mod_wsgi, uWSGI, and other embedded environments.
uk: Параметр *preexec_fn* більше не підтримується субінтерпретаторами. Використання параметра у субінтерпретаторі викликає :exc:`RuntimeError`. Нове обмеження може вплинути на програми, які розгортаються в mod_wsgi, uWSGI та інших вбудованих середовищах.

source: On Windows, if *close_fds* is true then no handles will be inherited by the child process unless explicitly passed in the ``handle_list`` element of :attr:`STARTUPINFO.lpAttributeList`, or by standard handle redirection.
uk: У Windows, якщо *close_fds* має значення true, дочірній процес не успадкує жодних дескрипторів, якщо вони явно не передані в елементі ``handle_list`` :attr:`STARTUPINFO.lpAttributeList` або за допомогою стандартного переспрямування дескриптора.

source: The default for *close_fds* was changed from :const:`False` to what is described above.
uk: Типове значення для *close_fds* було змінено з :const:`False` на описане вище.

source: On Windows the default for *close_fds* was changed from :const:`False` to :const:`True` when redirecting the standard handles. It's now possible to set *close_fds* to :const:`True` when redirecting the standard handles.
uk: У Windows типове значення для *close_fds* було змінено з :const:`False` на :const:`True` під час переспрямування стандартних дескрипторів. Тепер можна встановити *close_fds* на :const:`True` під час перенаправлення стандартних дескрипторів.

source: *pass_fds* is an optional sequence of file descriptors to keep open between the parent and child. Providing any *pass_fds* forces *close_fds* to be :const:`True`. (POSIX only)
uk: *pass_fds* — це необов’язкова послідовність файлових дескрипторів, які залишаються відкритими між батьківським і дочірнім. Надання будь-якого *pass_fds* змушує *close_fds* мати значення :const:`True`. (лише POSIX)

source: The *pass_fds* parameter was added.
uk: Додано параметр *pass_fds*.

source: If *cwd* is not ``None``, the function changes the working directory to *cwd* before executing the child. *cwd* can be a string, bytes or :term:`path-like <path-like object>` object. On POSIX, the function looks for *executable* (or for the first item in *args*) relative to *cwd* if the executable path is a relative path.
uk: Якщо *cwd* не є ``None``, функція змінює робочий каталог на *cwd* перед виконанням дочірнього елемента. *cwd* може бути рядком, байтами або об’єктом :term:`path-like <path-like object>`. У POSIX функція шукає *виконуваний файл* (або перший елемент у *args*) відносно *cwd*, якщо шлях до виконуваного файлу є відносним.

source: *cwd* parameter accepts a :term:`path-like object` on POSIX.
uk: Параметр *cwd* приймає :term:`path-like object` на POSIX.

source: *cwd* parameter accepts a :term:`path-like object` on Windows.
uk: Параметр *cwd* приймає :term:`path-like object` у Windows.

source: *cwd* parameter accepts a bytes object on Windows.
uk: Параметр *cwd* приймає об’єкт bytes у Windows.

source: If *restore_signals* is true (the default) all signals that Python has set to SIG_IGN are restored to SIG_DFL in the child process before the exec. Currently this includes the SIGPIPE, SIGXFZ and SIGXFSZ signals. (POSIX only)
uk: Якщо *restore_signals* має значення true (за замовчуванням), усі сигнали, які Python встановив як SIG_IGN, відновлюються до SIG_DFL у дочірньому процесі перед виконанням. Наразі це включає сигнали SIGPIPE, SIGXFZ і SIGXFSZ. (лише POSIX)

source: *restore_signals* was added.
uk: Додано *restore_signals*.

source: *start_new_session* was added.
uk: Додано *start_new_session*.

source: If *umask* is not negative, the umask() system call will be made in the child process prior to the execution of the subprocess.
uk: Якщо *umask* не є негативним, системний виклик umask() буде здійснено в дочірньому процесі перед виконанням підпроцесу.

source: If specified, *env* must provide any variables required for the program to execute. On Windows, in order to run a `side-by-side assembly`_ the specified *env* **must** include a valid :envvar:`SystemRoot`.
uk: Якщо вказано, *env* має надавати будь-які змінні, необхідні для виконання програми. У Windows, щоб запустити паралельну збірку (`side-by-side assembly`_), указаний *env* **має** містити дійсний :envvar:`SystemRoot`.

source: *encoding* and *errors* were added.
uk: Додано *кодування* та *помилки*.

source: *text* was added as a more readable alias for *universal_newlines*.
uk: *текст* додано як більш читабельний псевдонім для *universal_newlines*.

source: :data:`ABOVE_NORMAL_PRIORITY_CLASS`
uk: :data:`ВИЩЕ_ЗВИЧАЙНОГО_ПРІОРИТЕТНОГО_КЛАСУ`

source: *pipesize* can be used to change the size of the pipe when :data:`PIPE` is used for *stdin*, *stdout* or *stderr*. The size of the pipe is only changed on platforms that support this (only Linux at this time of writing). Other platforms will ignore this parameter.
uk: *pipesize* можна використовувати для зміни розміру каналу, коли :data:`PIPE` використовується для *stdin*, *stdout* або *stderr*. Розмір каналу змінюється лише на платформах, які підтримують це (лише Linux на даний момент). Інші платформи ігноруватимуть цей параметр.

source: Popen objects are supported as context managers via the :keyword:`with` statement: on exit, standard file descriptors are closed, and the process is waited for. ::
uk: Об’єкти Popen підтримуються як контекстні менеджери через оператор :keyword:`with`: під час виходу стандартні дескриптори файлів закриваються, і процес очікується. ::

source: Popen and the other functions in this module that use it raise an :ref:`auditing event <auditing>` ``subprocess.Popen`` with arguments ``executable``, ``args``, ``cwd``, and ``env``. The value for ``args`` may be a single string or a list of strings, depending on platform.
uk: Popen та інші функції в цьому модулі, які його використовують, викликають :ref:`подію аудиту <auditing>` ``subprocess.Popen`` з аргументами ``executable``, ``args``, ``cwd`` і ``env``. Значення для ``args`` може бути одним рядком або списком рядків, залежно від платформи.

source: Added context manager support.
uk: Додано підтримку менеджера контексту.

source: Popen destructor now emits a :exc:`ResourceWarning` warning if the child process is still running.
uk: Деструктор Popen тепер видає попередження :exc:`ResourceWarning`, якщо дочірній процес все ще виконується.

source: Popen can use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, Popen constructor using :func:`os.posix_spawn` no longer raise an exception on errors like missing program, but the child process fails with a non-zero :attr:`~Popen.returncode`.
uk: Popen може використовувати :func:`os.posix_spawn` у деяких випадках для кращої продуктивності. У підсистемі Windows для Linux і емуляції користувача QEMU конструктор Popen, що використовує :func:`os.posix_spawn`, більше не створює виняток у разі помилки, як-от відсутня програма, але дочірній процес завершується помилкою з ненульовим :attr:`~Popen.returncode`.

source: Exceptions
uk: Винятки

source: Exceptions raised in the child process, before the new program has started to execute, will be re-raised in the parent.
uk: Винятки, створені в дочірньому процесі, перш ніж нова програма почне виконуватися, будуть повторно викликані в батьківському.

source: The most common exception raised is :exc:`OSError`. This occurs, for example, when trying to execute a non-existent file. Applications should prepare for :exc:`OSError` exceptions. Note that, when ``shell=True``, :exc:`OSError` will be raised by the child only if the selected shell itself was not found. To determine if the shell failed to find the requested application, it is necessary to check the return code or output from the subprocess.
uk: Найпоширенішим винятком є :exc:`OSError`. Це відбувається, наприклад, при спробі запустити неіснуючий файл. Програми повинні підготуватися до винятків :exc:`OSError`. Зауважте, що коли ``shell=True``, :exc:`OSError` буде викликано дочірнім елементом, лише якщо саму вибрану оболонку не знайдено. Щоб визначити, чи не вдалося командній оболонці знайти запитану програму, необхідно перевірити код повернення або вихідні дані підпроцесу.

source: A :exc:`ValueError` will be raised if :class:`Popen` is called with invalid arguments.
uk: Помилка :exc:`ValueError` буде викликана, якщо :class:`Popen` викликається з недійсними аргументами.

source: :func:`check_call` and :func:`check_output` will raise :exc:`CalledProcessError` if the called process returns a non-zero return code.
uk: :func:`check_call` і :func:`check_output` викличуть :exc:`CalledProcessError`, якщо викликаний процес повертає ненульовий код повернення.

source: Exceptions defined in this module all inherit from :exc:`SubprocessError`.
uk: Усі винятки, визначені в цьому модулі, успадковуються від :exc:`SubprocessError`.

source: The :exc:`SubprocessError` base class was added.
uk: Додано базовий клас :exc:`SubprocessError`.

source: Security Considerations
uk: Міркування безпеки

source: Popen Objects
uk: Відкрити об'єкти

source: Instances of the :class:`Popen` class have the following methods:
uk: Екземпляри класу :class:`Popen` мають такі методи:

source: Check if child process has terminated. Set and return :attr:`~Popen.returncode` attribute. Otherwise, returns ``None``.
uk: Перевірте, чи завершився дочірній процес. Встановити та повернути атрибут :attr:`~Popen.returncode`. В іншому випадку повертає ``None``.

source: Wait for child process to terminate. Set and return :attr:`~Popen.returncode` attribute.
uk: Дочекайтеся завершення дочірнього процесу. Встановити та повернути атрибут :attr:`~Popen.returncode`.

source: If the process does not terminate after *timeout* seconds, raise a :exc:`TimeoutExpired` exception. It is safe to catch this exception and retry the wait.
uk: Якщо процес не завершується після *тайм-ауту* секунд, викличте виняток :exc:`TimeoutExpired`. Можна безпечно перехопити цей виняток і повторити очікування.

source: This will deadlock when using ``stdout=PIPE`` or ``stderr=PIPE`` and the child process generates enough output to a pipe such that it blocks waiting for the OS pipe buffer to accept more data. Use :meth:`Popen.communicate` when using pipes to avoid that.
uk: Це призведе до взаємоблокування під час використання ``stdout=PIPE`` або ``stderr=PIPE``, і дочірній процес генерує достатню кількість виводу в канал, щоб блокувати очікування, поки буфер каналу ОС прийме більше даних. Використовуйте :meth:`Popen.communicate` під час використання каналів, щоб уникнути цього.

source: *timeout* was added.
uk: Додано *тайм-аут*.

source: Interact with process: Send data to stdin. Read data from stdout and stderr, until end-of-file is reached. Wait for process to terminate and set the :attr:`~Popen.returncode` attribute. The optional *input* argument should be data to be sent to the child process, or ``None``, if no data should be sent to the child. If streams were opened in text mode, *input* must be a string. Otherwise, it must be bytes.
uk: Взаємодія з процесом: надсилання даних на stdin. Читання даних із stdout і stderr, доки не буде досягнуто кінця файлу. Зачекайте, поки процес завершиться, і встановіть атрибут :attr:`~Popen.returncode`. Додатковий аргумент *input* має бути даними, які надсилаються дочірньому процесу, або ``None``, якщо дані не повинні надсилатися дочірньому процесу. Якщо потоки були відкриті в текстовому режимі, *введення* має бути рядком. В іншому випадку це повинні бути байти.

source: :meth:`communicate` returns a tuple ``(stdout_data, stderr_data)``. The data will be strings if streams were opened in text mode; otherwise, bytes.
uk: :meth:`communicate` повертає кортеж ``(stdout_data, stderr_data)``. Дані будуть рядками, якщо потоки були відкриті в текстовому режимі; інакше, байти.

source: Note that if you want to send data to the process's stdin, you need to create the Popen object with ``stdin=PIPE``. Similarly, to get anything other than ``None`` in the result tuple, you need to give ``stdout=PIPE`` and/or ``stderr=PIPE`` too.
uk: Зауважте, що якщо ви хочете надіслати дані на стандартний вхід процесу, вам потрібно створити об’єкт Popen за допомогою ``stdin=PIPE``. Подібним чином, щоб отримати щось інше, окрім ``None`` у кортежі результатів, вам також потрібно вказати ``stdout=PIPE`` та/або ``stderr=PIPE``.

source: If the process does not terminate after *timeout* seconds, a :exc:`TimeoutExpired` exception will be raised. Catching this exception and retrying communication will not lose any output.
uk: Якщо процес не завершиться після *тайм-ауту* секунд, буде викликано виняток :exc:`TimeoutExpired`. Перехоплення цього винятку та повторна спроба зв’язку не призведуть до втрати вихідних даних.

source: The child process is not killed if the timeout expires, so in order to cleanup properly a well-behaved application should kill the child process and finish communication::
uk: Дочірній процес не вимикається, якщо закінчується час очікування, тому, щоб правильно очистити програму, яка добре працює, слід вбити дочірній процес і завершити зв’язок::

source: The data read is buffered in memory, so do not use this method if the data size is large or unlimited.
uk: Зчитані дані буферизуються в пам’яті, тому не використовуйте цей метод, якщо розмір даних великий або необмежений.

source: Sends the signal *signal* to the child.
uk: Посилає сигнал *сигнал* дитині.

source: Do nothing if the process completed.
uk: Нічого не робити, якщо процес завершено.

source: Kills the child. On POSIX OSs the function sends SIGKILL to the child. On Windows :meth:`kill` is an alias for :meth:`terminate`.
uk: Вбиває дитину. В ОС POSIX функція надсилає SIGKILL дочірньому. У Windows :meth:`kill` є псевдонімом для :meth:`terminate`.

source: The *args* argument as it was passed to :class:`Popen` -- a sequence of program arguments or else a single string.
uk: Аргумент *args*, як його було передано до :class:`Popen` -- послідовність аргументів програми або один рядок.

source: Use :meth:`~Popen.communicate` rather than :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` or :attr:`.stderr.read <Popen.stderr>` to avoid deadlocks due to any of the other OS pipe buffers filling up and blocking the child process.
uk: Використовуйте :meth:`~Popen.communicate` замість :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` або :attr:`.stderr.read <Popen.stderr>`, щоб уникнути взаємоблокувань через будь-які інших буферів каналів ОС, які заповнюються та блокують дочірній процес.

source: The process ID of the child process.
uk: Ідентифікатор дочірнього процесу.

source: Note that if you set the *shell* argument to ``True``, this is the process ID of the spawned shell.
uk: Зауважте, що якщо ви встановите для аргументу *shell* значення ``True``, це буде ідентифікатор процесу створеної оболонки.

source: Windows Popen Helpers
uk: Windows Open Helpers

source: The :class:`STARTUPINFO` class and following constants are only available on Windows.
uk: Клас :class:`STARTUPINFO` і наступні константи доступні лише в Windows.

source: Partial support of the Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ structure is used for :class:`Popen` creation. The following attributes can be set by passing them as keyword-only arguments.
uk: Часткова підтримка структури Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ використовується для створення :class:`Popen`. Наступні атрибути можна встановити, передавши їх як аргументи лише для ключових слів.

source: Keyword-only argument support was added.
uk: Додано підтримку аргументів лише за ключовими словами.

source: A bit field that determines whether certain :class:`STARTUPINFO` attributes are used when the process creates a window. ::
uk: Бітове поле, яке визначає, чи використовуються певні атрибути :class:`STARTUPINFO`, коли процес створює вікно. ::

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard input handle for the process. If :data:`STARTF_USESTDHANDLES` is not specified, the default for standard input is the keyboard buffer.
uk: Якщо :attr:`dwFlags` визначає :data:`STARTF_USESTDHANDLES`, цей атрибут є стандартним дескриптором введення для процесу. Якщо :data:`STARTF_USESTDHANDLES` не вказано, за умовчанням для стандартного введення є буфер клавіатури.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard output handle for the process. Otherwise, this attribute is ignored and the default for standard output is the console window's buffer.
uk: Якщо :attr:`dwFlags` визначає :data:`STARTF_USESTDHANDLES`, цей атрибут є стандартним дескриптором виводу для процесу. В іншому випадку цей атрибут ігнорується, а за замовчуванням для стандартного виведення буде буфер вікна консолі.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard error handle for the process. Otherwise, this attribute is ignored and the default for standard error is the console window's buffer.
uk: Якщо :attr:`dwFlags` визначає :data:`STARTF_USESTDHANDLES`, цей атрибут є стандартним описом помилки для процесу. В іншому випадку цей атрибут ігнорується, а стандартною помилкою за замовчуванням є буфер вікна консолі.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESHOWWINDOW`, this attribute can be any of the values that can be specified in the ``nCmdShow`` parameter for the `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__ function, except for ``SW_SHOWDEFAULT``. Otherwise, this attribute is ignored.
uk: Якщо :attr:`dwFlags` визначає :data:`STARTF_USESHOWWINDOW`, цей атрибут може бути будь-яким із значень, які можна вказати в параметрі ``nCmdShow`` для функції `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__, за винятком ``SW_SHOWDEFAULT``. В іншому випадку цей атрибут ігнорується.

source: :data:`SW_HIDE` is provided for this attribute. It is used when :class:`Popen` is called with ``shell=True``.
uk: :data:`SW_HIDE` передбачено для цього атрибута. Він використовується, коли :class:`Popen` викликається з ``shell=True``.

source: A dictionary of additional attributes for process creation as given in ``STARTUPINFOEX``, see `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.
uk: Словник додаткових атрибутів для створення процесу, наведений у ``STARTUPINFOEX``, див. `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.

source: Supported attributes:
uk: Підтримувані атрибути:

source: Sequence of handles that will be inherited. *close_fds* must be true if non-empty.
uk: Послідовність дескрипторів, які будуть успадковані. *close_fds* має бути істинним, якщо воно не порожнє.

source: The handles must be temporarily made inheritable by :func:`os.set_handle_inheritable` when passed to the :class:`Popen` constructor, else :class:`OSError` will be raised with Windows error ``ERROR_INVALID_PARAMETER`` (87).
uk: :func:`os.set_handle_inheritable` під час передачі в конструктор :class:`Popen` дескрипторів має бути тимчасово успадкованим, інакше :class:`OSError` буде викликано помилкою Windows ``ERROR_INVALID_PARAMETER`` (87).

source: In a multithreaded process, use caution to avoid leaking handles that are marked inheritable when combining this feature with concurrent calls to other process creation functions that inherit all handles such as :func:`os.system`. This also applies to standard handle redirection, which temporarily creates inheritable handles.
uk: У багатопотоковому процесі будьте обережні, щоб уникнути витоку дескрипторів, позначених як успадковані, коли поєднуєте цю функцію з одночасними викликами інших функцій створення процесу, які успадковують усі дескриптори, наприклад :func:`os.system`. Це також стосується стандартного перенаправлення дескрипторів, яке тимчасово створює успадковані дескриптори.

source: Windows Constants
uk: Константи Windows

source: The :mod:`subprocess` module exposes the following constants.
uk: Модуль :mod:`subprocess` надає такі константи.

source: The standard input device. Initially, this is the console input buffer, ``CONIN$``.
uk: Стандартний пристрій введення. Спочатку це буфер введення консолі, ``CONIN$``.

source: The standard output device. Initially, this is the active console screen buffer, ``CONOUT$``.
uk: Стандартний пристрій виведення. Спочатку це активний буфер екрана консолі, ``CONOUT$``.

source: The standard error device. Initially, this is the active console screen buffer, ``CONOUT$``.
uk: Пристрій стандартної помилки. Спочатку це активний буфер екрана консолі, ``CONOUT$``.

source: Hides the window. Another window will be activated.
uk: Приховує вікно. Буде активовано інше вікно.

source: Specifies that the :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput`, and :attr:`STARTUPINFO.hStdError` attributes contain additional information.
uk: Вказує, що атрибути :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput` і :attr:`STARTUPINFO.hStdError` містять додаткову інформацію.

source: Specifies that the :attr:`STARTUPINFO.wShowWindow` attribute contains additional information.
uk: Вказує, що атрибут :attr:`STARTUPINFO.wShowWindow` містить додаткову інформацію.

source: The new process has a new console, instead of inheriting its parent's console (the default).
uk: Новий процес має нову консоль замість успадкування батьківської консолі (за замовчуванням).
