Repository: python/python-docs-uk
Catalog: library/sunau.po
Languages: uk

source: :mod:`sunau` --- Read and write Sun AU files
uk: :mod:`sunau` --- Читання та запис файлів Sun AU

source: **Source code:** :source:`Lib/sunau.py`
uk: **Вихідний код:** :source:`Lib/sunau.py`

source: The :mod:`sunau` module is deprecated (see :pep:`PEP 594 <594#sunau>` for details).
uk: Модуль :mod:`sunau` є застарілим (докладніше див. :pep:`PEP 594 <594#sunau>`).

source: The :mod:`sunau` module provides a convenient interface to the Sun AU sound format. Note that this module is interface-compatible with the modules :mod:`aifc` and :mod:`wave`.
uk: Модуль :mod:`sunau` забезпечує зручний інтерфейс для звукового формату Sun AU. Зауважте, що цей модуль інтерфейсно сумісний із модулями :mod:`aifc` і :mod:`wave`.

source: An audio file consists of a header followed by the data. The fields of the header are:
uk: Аудіофайл складається із заголовка, за яким слідують дані. Поля заголовка:

source: Field
uk: Поле

source: Contents
uk: Зміст

source: magic word
uk: чарівне слово

source: The four bytes ``.snd``.
uk: Чотири байти ``.snd``.

source: header size
uk: розмір заголовка

source: Size of the header, including info, in bytes.
uk: Розмір заголовка, включаючи інформацію, у байтах.

source: data size
uk: розмір даних

source: Physical size of the data, in bytes.
uk: Фізичний розмір даних, у байтах.

source: encoding
uk: кодування

source: Indicates how the audio samples are encoded.
uk: Вказує, як закодовано аудіо зразки.

source: sample rate
uk: частота дискретизації

source: The sampling rate.
uk: Частота дискретизації.

source: # of channels
uk: # каналів

source: The number of channels in the samples.
uk: Кількість каналів у вибірках.

source: info
uk: інформація

source: ASCII string giving a description of the audio file (padded with null bytes).
uk: Рядок ASCII, що містить опис аудіофайлу (доповнений нульовими байтами).

source: Apart from the info field, all header fields are 4 bytes in size. They are all 32-bit unsigned integers encoded in big-endian byte order.
uk: Окрім інформаційного поля, усі поля заголовка мають розмір 4 байти. Усі вони являють собою 32-розрядні цілі числа без знаку, закодовані в порядку байтів у порядку байтів.

source: The :mod:`sunau` module defines the following functions:
uk: Модуль :mod:`sunau` визначає такі функції:

source: If *file* is a string, open the file by that name, otherwise treat it as a seekable file-like object. *mode* can be any of
uk: Якщо *file* є рядком, відкрийте файл із таким іменем, інакше розглядайте його як файлоподібний об’єкт, який можна шукати. *режим* може бути будь-яким із

source: Read only mode.
uk: Режим тільки читання.

source: Write only mode.
uk: Режим лише запису.

source: Note that it does not allow read/write files.
uk: Зверніть увагу, що він не дозволяє читати/записувати файли.

source: A *mode* of ``'r'`` returns an :class:`AU_read` object, while a *mode* of ``'w'`` or ``'wb'`` returns an :class:`AU_write` object.
uk: *Режим* ``'r'`` повертає об'єкт :class:`AU_read`, тоді як *режим* ``'w'`` або ``'wb'`` повертає :class:`AU_write` об'єкт.

source: The :mod:`sunau` module defines the following exception:
uk: Модуль :mod:`sunau` визначає такий виняток:

source: An error raised when something is impossible because of Sun AU specs or implementation deficiency.
uk: Помилка виникає, коли щось неможливо через специфікації Sun AU або недолік реалізації.

source: The :mod:`sunau` module defines the following data items:
uk: Модуль :mod:`sunau` визначає такі елементи даних:

source: An integer every valid Sun AU file begins with, stored in big-endian form. This is the string ``.snd`` interpreted as an integer.
uk: Ціле число, з якого починається кожен дійсний файл Sun AU, зберігається у формі старшого порядку. Це рядок ``.snd``, який інтерпретується як ціле число.

source: Values of the encoding field from the AU header which are supported by this module.
uk: Значення поля кодування із заголовка AU, які підтримуються цим модулем.

source: Additional known values of the encoding field from the AU header, but which are not supported by this module.
uk: Додаткові відомі значення поля кодування із заголовка AU, які не підтримуються цим модулем.

source: AU_read Objects
uk: Об’єкти AU_read

source: AU_read objects, as returned by :func:`.open` above, have the following methods:
uk: Об’єкти AU_read, які повертає :func:`.open` вище, мають такі методи:

source: Close the stream, and make the instance unusable. (This is called automatically on deletion.)
uk: Закрийте потік і зробіть екземпляр непридатним для використання. (Це викликається автоматично під час видалення.)

source: Returns number of audio channels (1 for mono, 2 for stereo).
uk: Повертає кількість аудіоканалів (1 для моно, 2 для стерео).

source: Returns sample width in bytes.
uk: Повертає ширину вибірки в байтах.

source: Returns sampling frequency.
uk: Повертає частоту вибірки.

source: Returns number of audio frames.
uk: Повертає кількість звукових кадрів.

source: Returns compression type. Supported compression types are ``'ULAW'``, ``'ALAW'`` and ``'NONE'``.
uk: Повертає тип стиснення. Підтримувані типи стиснення: ULAW, ALAW і NONE.

source: Human-readable version of :meth:`getcomptype`. The supported types have the respective names ``'CCITT G.711 u-law'``, ``'CCITT G.711 A-law'`` and ``'not compressed'``.
uk: Зрозуміла для людини версія :meth:`getcomptype`. Підтримувані типи мають відповідні назви "CCITT G.711 u-law", "CCITT G.711 A-law" і "not compressed".

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the :meth:`get\*` methods.
uk: Повертає :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, еквівалентний виводу методів :meth:`get\*`.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object. The data will be returned in linear format. If the original data is in u-LAW format, it will be converted.
uk: Читає та повертає щонайбільше *n* кадрів аудіо як об’єкт :class:`bytes`. Дані будуть повернуті в лінійному форматі. Якщо вихідні дані мають формат u-LAW, їх буде перетворено.

source: Rewind the file pointer to the beginning of the audio stream.
uk: Перемотайте покажчик файлу на початок аудіопотоку.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
uk: Наступні два методи визначають термін "позиція", який є сумісним між ними, а в інших випадках залежить від реалізації.

source: Set the file pointer to the specified position. Only values returned from :meth:`tell` should be used for *pos*.
uk: Встановіть покажчик файлу у вказане положення. Для *pos* слід використовувати лише значення, які повертає :meth:`tell`.

source: Return current file pointer position. Note that the returned value has nothing to do with the actual position in the file.
uk: Повернути поточне положення покажчика файлу. Зверніть увагу, що повернуте значення не має нічого спільного з фактичною позицією у файлі.

source: The following two functions are defined for compatibility with the :mod:`aifc`, and don't do anything interesting.
uk: Наступні дві функції визначені для сумісності з :mod:`aifc` і не роблять нічого цікавого.

source: Returns ``None``.
uk: Повертає ``None``.

source: Raise an error.
uk: Викликати помилку.

source: AU_write Objects
uk: Об’єкти AU_write

source: AU_write objects, as returned by :func:`.open` above, have the following methods:
uk: Об’єкти AU_write, які повертає :func:`.open` вище, мають такі методи:

source: Set the number of channels.
uk: Встановіть кількість каналів.

source: Set the sample width (in bytes.)
uk: Встановіть ширину вибірки (у байтах).

source: Added support for 24-bit samples.
uk: Додано підтримку 24-розрядних зразків.

source: Set the frame rate.
uk: Встановіть частоту кадрів.

source: Set the number of frames. This can be later changed, when and if more frames are written.
uk: Встановіть кількість кадрів. Це можна змінити пізніше, коли і якщо буде записано більше кадрів.

source: Set the compression type and description. Only ``'NONE'`` and ``'ULAW'`` are supported on output.
uk: Встановіть тип стиснення та опис. На виводі підтримуються лише ``'NONE'`` і ``'ULAW'``.

source: The *tuple* should be ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, with values valid for the :meth:`set\*` methods. Set all parameters.
uk: Кортеж має бути ``(nchannels, sampwidth, framerate, nframes, comptype, compname)`` зі значеннями, дійсними для методів :meth:`set\*`. Встановити всі параметри.

source: Return current position in the file, with the same disclaimer for the :meth:`AU_read.tell` and :meth:`AU_read.setpos` methods.
uk: Повертає поточну позицію у файлі з тим самим застереженням для методів :meth:`AU_read.tell` і :meth:`AU_read.setpos`.

source: Write audio frames, without correcting *nframes*.
uk: Записуйте аудіокадри, не виправляючи *nframes*.

source: Any :term:`bytes-like object` is now accepted.
uk: Тепер приймається будь-який :term:`bytes-like object`.

source: Write audio frames and make sure *nframes* is correct.
uk: Напишіть звукові кадри та переконайтеся, що *nframes* правильний.

source: Make sure *nframes* is correct, and close the file.
uk: Переконайтеся, що *nframes* правильний, і закрийте файл.

source: This method is called upon deletion.
uk: Цей метод викликається при видаленні.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`.
uk: Зауважте, що не можна встановлювати будь-які параметри після виклику :meth:`writeframes` або :meth:`writeframesraw`.
