Repository: python/python-docs-uk
Catalog: library/tabnanny.po
Languages: uk

source: :mod:`!tabnanny` --- Detection of ambiguous indentation
uk: :mod:`!tabnanny` --- Виявлення неоднозначних відступів

source: **Source code:** :source:`Lib/tabnanny.py`
uk: **Вихідний код:** :source:`Lib/tabnanny.py`

source: For the time being this module is intended to be called as a script. However it is possible to import it into an IDE and use the function :func:`check` described below.
uk: На даний момент цей модуль призначений для виклику як скрипт. Однак його можна імпортувати в IDE та використовувати функцію :func:`check`, описану нижче.

source: The API provided by this module is likely to change in future releases; such changes may not be backward compatible.
uk: API, наданий цим модулем, імовірно, зміниться в наступних версіях; такі зміни можуть не бути зворотно сумісними.

source: If *file_or_dir* is a directory and not a symbolic link, then recursively descend the directory tree named by *file_or_dir*, checking all :file:`.py` files along the way. If *file_or_dir* is an ordinary Python source file, it is checked for whitespace related problems. The diagnostic messages are written to standard output using the :func:`print` function.
uk: Якщо *file_or_dir* є каталогом, а не символічним посиланням, тоді рекурсивно перейдіть за деревом каталогів, названим *file_or_dir*, перевіряючи всі файли :file:`.py`. Якщо *file_or_dir* є звичайним вихідним файлом Python, він перевіряється на наявність проблем, пов’язаних з пробілами. Діагностичні повідомлення записуються до стандартного виводу за допомогою функції :func:`print`.

source: Flag indicating whether to print verbose messages. This is incremented by the ``-v`` option if called as a script.
uk: Прапорець, що вказує, чи друкувати докладні повідомлення. Це збільшується опцією ``-v``, якщо викликається як сценарій.

source: Flag indicating whether to print only the filenames of files containing whitespace related problems. This is set to true by the ``-q`` option if called as a script.
uk: Прапорець, що вказує, чи потрібно друкувати лише назви файлів, які містять проблеми, пов’язані з пробілами. Параметр ``-q`` встановлює значення true, якщо викликається як сценарій.

source: Raised by :func:`process_tokens` if detecting an ambiguous indent. Captured and handled in :func:`check`.
uk: Викликається :func:`process_tokens`, якщо виявлено неоднозначний відступ. Зберігається та обробляється в :func:`check`.

source: This function is used by :func:`check` to process tokens generated by the :mod:`tokenize` module.
uk: Ця функція використовується :func:`check` для обробки токенів, згенерованих модулем :mod:`tokenize`.

source: Module :mod:`tokenize`
uk: Модуль :mod:`tokenize`

source: Lexical scanner for Python source code.
uk: Лексичний сканер вихідного коду Python.
