Repository: python/python-docs-uk
Catalog: library/tarfile.po
Languages: uk

source: :mod:`tarfile` --- Read and write tar archive files
uk: :mod:`tarfile` --- Читання та запис архівних файлів tar

source: **Source code:** :source:`Lib/tarfile.py`
uk: **Вихідний код:** :source:`Lib/tarfile.py`

source: The :mod:`tarfile` module makes it possible to read and write tar archives, including those using gzip, bz2 and lzma compression. Use the :mod:`zipfile` module to read or write :file:`.zip` files, or the higher-level functions in :ref:`shutil <archiving-operations>`.
uk: Модуль :mod:`tarfile` дає змогу читати та записувати архіви tar, у тому числі ті, що використовують стиснення gzip, bz2 та lzma. Використовуйте модуль :mod:`zipfile` для читання або запису файлів :file:`.zip` або функції вищого рівня в :ref:`shutil <archiving-operations>`.

source: Some facts and figures:
uk: Деякі факти та цифри:

source: reads and writes :mod:`gzip`, :mod:`bz2` and :mod:`lzma` compressed archives if the respective modules are available.
uk: читає та записує стислі архіви :mod:`gzip`, :mod:`bz2` і :mod:`lzma`, якщо доступні відповідні модулі.

source: read/write support for the POSIX.1-1988 (ustar) format.
uk: підтримка читання/запису для формату POSIX.1-1988 (ustar).

source: read/write support for the GNU tar format including *longname* and *longlink* extensions, read-only support for all variants of the *sparse* extension including restoration of sparse files.
uk: підтримка читання/запису для формату GNU tar, включаючи розширення *longname* і *longlink*, підтримка лише читання для всіх варіантів розширення *sparse*, включаючи відновлення розріджених файлів.

source: read/write support for the POSIX.1-2001 (pax) format.
uk: підтримка читання/запису для формату POSIX.1-2001 (pax).

source: handles directories, regular files, hardlinks, symbolic links, fifos, character devices and block devices and is able to acquire and restore file information like timestamp, access permissions and owner.
uk: обробляє каталоги, звичайні файли, жорсткі посилання, символічні посилання, FIFO, символьні пристрої та блокові пристрої, а також може отримувати та відновлювати інформацію про файл, як-от мітку часу, права доступу та власника.

source: Added support for :mod:`lzma` compression.
uk: Додано підтримку стиснення :mod:`lzma`.

source: Return a :class:`TarFile` object for the pathname *name*. For detailed information on :class:`TarFile` objects and the keyword arguments that are allowed, see :ref:`tarfile-objects`.
uk: Повертає об’єкт :class:`TarFile` для шляху *name*. Для отримання детальної інформації про об’єкти :class:`TarFile` та дозволені ключові аргументи дивіться :ref:`tarfile-objects`.

source: *mode* has to be a string of the form ``'filemode[:compression]'``, it defaults to ``'r'``. Here is a full list of mode combinations:
uk: *mode* має бути рядком у формі ``'filemode[:compression]'``, за замовчуванням це ``'r'``. Ось повний список комбінацій режимів:

source: mode
uk: режим

source: action
uk: дію

source: ``'r' or 'r:*'``
uk: ``'r' або 'r:*'``

source: Open for reading with transparent compression (recommended).
uk: Відкрити для читання з прозорим стисненням (рекомендовано).

source: Open for reading exclusively without compression.
uk: Відкритий виключно для читання без стиснення.

source: Open for reading with gzip compression.
uk: Відкрити для читання зі стисненням gzip.

source: Open for reading with bzip2 compression.
uk: Відкрити для читання зі стисненням bzip2.

source: Open for reading with lzma compression.
uk: Відкритий для читання зі стисненням lzma.

source: ``'x'`` or ``'x:'``
uk: ``'x''`` або ``'x:''``

source: ``'a' or 'a:'``
uk: ``'a' або 'a:'``

source: Open for appending with no compression. The file is created if it does not exist.
uk: Відкритий для додавання без стиснення. Файл створюється, якщо він не існує.

source: ``'w' or 'w:'``
uk: ``'w' або 'w:'``

source: Open for uncompressed writing.
uk: Відкритий для запису без стиснення.

source: Open for gzip compressed writing.
uk: Відкритий для стисненого запису gzip.

source: Open for bzip2 compressed writing.
uk: Відкритий для стисненого запису bzip2.

source: Open for lzma compressed writing.
uk: Відкритий для стисненого запису lzma.

source: Note that ``'a:gz'``, ``'a:bz2'`` or ``'a:xz'`` is not possible. If *mode* is not suitable to open a certain (compressed) file for reading, :exc:`ReadError` is raised. Use *mode* ``'r'`` to avoid this. If a compression method is not supported, :exc:`CompressionError` is raised.
uk: Зауважте, що ``'a:gz'``, ``'a:bz2'`` або ``'a:xz'`` неможливі. Якщо *режим* не підходить для відкриття певного (стислого) файлу для читання, виникає :exc:`ReadError`. Щоб уникнути цього, використовуйте *mode* ``'r'``. Якщо метод стиснення не підтримується, виникає :exc:`CompressionError`.

source: If *fileobj* is specified, it is used as an alternative to a :term:`file object` opened in binary mode for *name*. It is supposed to be at position 0.
uk: Якщо вказано *fileobj*, він використовується як альтернатива :term:`file object`, відкритому в двійковому режимі для *name*. Він має бути в позиції 0.

source: For modes ``'w:gz'``, ``'r:gz'``, ``'w:bz2'``, ``'r:bz2'``, ``'x:gz'``, ``'x:bz2'``, :func:`tarfile.open` accepts the keyword argument *compresslevel* (default ``9``) to specify the compression level of the file.
uk: Для режимів ``'w:gz'``, ``'r:gz'``, ``'w:bz2'``, ``'r:bz2'``, ``'x:gz'``, ``'x:bz2'``, :func:`tarfile.open` приймає аргумент ключового слова *compresslevel* (за замовчуванням ``9``), щоб визначити рівень стиснення файлу.

source: For modes ``'w:xz'`` and ``'x:xz'``, :func:`tarfile.open` accepts the keyword argument *preset* to specify the compression level of the file.
uk: Для режимів ``'w:xz'`` і ``'x:xz'`` :func:`tarfile.open` приймає аргумент ключового слова *preset* для визначення рівня стиснення файлу.

source: For special purposes, there is a second format for *mode*: ``'filemode|[compression]'``. :func:`tarfile.open` will return a :class:`TarFile` object that processes its data as a stream of blocks. No random seeking will be done on the file. If given, *fileobj* may be any object that has a :meth:`read` or :meth:`write` method (depending on the *mode*). *bufsize* specifies the blocksize and defaults to ``20 * 512`` bytes. Use this variant in combination with e.g. ``sys.stdin``, a socket :term:`file object` or a tape device. However, such a :class:`TarFile` object is limited in that it does not allow random access, see :ref:`tar-examples`. The currently possible modes:
uk: Для спеціальних цілей існує другий формат для *mode*: ``'filemode|[стиснення]'``. :func:`tarfile.open` поверне об’єкт :class:`TarFile`, який обробляє свої дані як потік блоків. Довільний пошук файлу не виконуватиметься. Якщо вказано, *fileobj* може бути будь-яким об’єктом, який має метод :meth:`read` або :meth:`write` (залежно від *mode*). *bufsize* вказує розмір блоку та за замовчуванням ``20 * 512`` байт. Використовуйте цей варіант у поєднанні з напр. ``sys.stdin``, сокет :term:`file object` або стрічковий пристрій. Однак такий об’єкт :class:`TarFile` обмежений тим, що він не дозволяє довільний доступ, див. :ref:`tar-examples`. Наразі можливі режими:

source: Mode
uk: Режим

source: Action
uk: Дія

source: Open a *stream* of tar blocks for reading with transparent compression.
uk: Відкрийте *потік* блоків tar для читання з прозорим стисненням.

source: Open a *stream* of uncompressed tar blocks for reading.
uk: Відкрийте *потік* нестиснутих блоків tar для читання.

source: Open a gzip compressed *stream* for reading.
uk: Відкрийте *потік*, стиснутий gzip, для читання.

source: Open a bzip2 compressed *stream* for reading.
uk: Відкрийте *потік*, стиснений bzip2, для читання.

source: Open an lzma compressed *stream* for reading.
uk: Відкрийте стислий *потік* lzma для читання.

source: Open an uncompressed *stream* for writing.
uk: Відкрийте нестиснений *потік* для запису.

source: Open a gzip compressed *stream* for writing.
uk: Відкрийте стиснутий *потік* gzip для запису.

source: Open a bzip2 compressed *stream* for writing.
uk: Відкрийте *потік*, стиснений bzip2, для запису.

source: Open an lzma compressed *stream* for writing.
uk: Відкрийте стислий *потік* lzma для запису.

source: The ``'x'`` (exclusive creation) mode was added.
uk: Додано режим ``'x`` (ексклюзивне створення).

source: The *name* parameter accepts a :term:`path-like object`.
uk: Параметр *name* приймає :term:`path-like object`.

source: Class for reading and writing tar archives. Do not use this class directly: use :func:`tarfile.open` instead. See :ref:`tarfile-objects`.
uk: Клас для читання та запису архівів tar. Не використовуйте цей клас безпосередньо: використовуйте замість нього :func:`tarfile.open`. Див. :ref:`tarfile-objects`.

source: Return :const:`True` if *name* is a tar archive file, that the :mod:`tarfile` module can read. *name* may be a :class:`str`, file, or file-like object.
uk: Повертає :const:`True`, якщо *name* є архівним файлом tar, який може прочитати модуль :mod:`tarfile`. *name* може бути :class:`str`, файлом або файлоподібним об’єктом.

source: Support for file and file-like objects.
uk: Підтримка файлів і файлоподібних об'єктів.

source: The :mod:`tarfile` module defines the following exceptions:
uk: Модуль :mod:`tarfile` визначає такі винятки:

source: Base class for all :mod:`tarfile` exceptions.
uk: Базовий клас для всіх винятків :mod:`tarfile`.

source: Is raised when a tar archive is opened, that either cannot be handled by the :mod:`tarfile` module or is somehow invalid.
uk: Виникає, коли відкривається архів tar, який або не може бути оброблений модулем :mod:`tarfile`, або якимось чином недійсний.

source: Is raised when a compression method is not supported or when the data cannot be decoded properly.
uk: Виникає, коли метод стиснення не підтримується або дані не можуть бути правильно декодовані.

source: Is raised for the limitations that are typical for stream-like :class:`TarFile` objects.
uk: Викликається через обмеження, типові для потокових об’єктів :class:`TarFile`.

source: Is raised for *non-fatal* errors when using :meth:`TarFile.extract`, but only if :attr:`TarFile.errorlevel`\ ``== 2``.
uk: Викликається для *нефатальних* помилок під час використання :meth:`TarFile.extract`, але лише якщо :attr:`TarFile.errorlevel`\ ``== 2``.

source: Is raised by :meth:`TarInfo.frombuf` if the buffer it gets is invalid.
uk: Викликається :meth:`TarInfo.frombuf`, якщо отриманий буфер недійсний.

source: The following constants are available at the module level:
uk: Наступні константи доступні на рівні модуля:

source: The default character encoding: ``'utf-8'`` on Windows, the value returned by :func:`sys.getfilesystemencoding` otherwise.
uk: Кодування символів за замовчуванням: ``'utf-8'`` у Windows, значення повертає :func:`sys.getfilesystemencoding` в інших випадках.

source: Each of the following constants defines a tar archive format that the :mod:`tarfile` module is able to create. See section :ref:`tar-formats` for details.
uk: Кожна з наступних констант визначає формат архіву tar, який може створити модуль :mod:`tarfile`. Перегляньте розділ :ref:`tar-formats` для деталей.

source: POSIX.1-1988 (ustar) format.
uk: Формат POSIX.1-1988 (ustar).

source: GNU tar format.
uk: Формат GNU tar.

source: POSIX.1-2001 (pax) format.
uk: Формат POSIX.1-2001 (pax).

source: The default format for creating archives. This is currently :const:`PAX_FORMAT`.
uk: Стандартний формат для створення архівів. Зараз це :const:`PAX_FORMAT`.

source: The default format for new archives was changed to :const:`PAX_FORMAT` from :const:`GNU_FORMAT`.
uk: Стандартний формат для нових архівів було змінено на :const:`PAX_FORMAT` з :const:`GNU_FORMAT`.

source: Module :mod:`zipfile`
uk: Модуль :mod:`zipfile`

source: Documentation of the :mod:`zipfile` standard module.
uk: Документація стандартного модуля :mod:`zipfile`.

source: Documentation of the higher-level archiving facilities provided by the standard :mod:`shutil` module.
uk: Документація засобів архівування вищого рівня, які надає стандартний модуль :mod:`shutil`.

source: `GNU tar manual, Basic Tar Format <https://www.gnu.org/software/tar/manual/html_node/Standard.html>`_
uk: `Посібник GNU tar, базовий формат Tar <https://www.gnu.org/software/tar/manual/html_node/Standard.html>`_

source: Documentation for tar archive files, including GNU tar extensions.
uk: Документація для архівних файлів tar, включаючи розширення GNU tar.

source: TarFile Objects
uk: Об’єкти TarFile

source: The :class:`TarFile` object provides an interface to a tar archive. A tar archive is a sequence of blocks. An archive member (a stored file) is made up of a header block followed by data blocks. It is possible to store a file in a tar archive several times. Each archive member is represented by a :class:`TarInfo` object, see :ref:`tarinfo-objects` for details.
uk: Об’єкт :class:`TarFile` надає інтерфейс до архіву tar. Архів tar — це послідовність блоків. Член архіву (збережений файл) складається з блоку заголовка, за яким слідують блоки даних. Можна зберігати файл в архіві tar кілька разів. Кожен член архіву представлений об’єктом :class:`TarInfo`, подробиці див. у :ref:`tarinfo-objects`.

source: A :class:`TarFile` object can be used as a context manager in a :keyword:`with` statement. It will automatically be closed when the block is completed. Please note that in the event of an exception an archive opened for writing will not be finalized; only the internally used file object will be closed. See the :ref:`tar-examples` section for a use case.
uk: Об’єкт :class:`TarFile` можна використовувати як менеджер контексту в операторі :keyword:`with`. Він автоматично закриється, коли блок буде завершено. Зверніть увагу, що у випадку винятку архів, відкритий для запису, не буде завершено; буде закрито лише внутрішньо використовуваний файловий об’єкт. Перегляньте розділ :ref:`tar-examples` для прикладу використання.

source: Added support for the context management protocol.
uk: Додано підтримку протоколу керування контекстом.

source: All following arguments are optional and can be accessed as instance attributes as well.
uk: Усі наступні аргументи є необов’язковими, і до них також можна отримати доступ як до атрибутів екземпляра.

source: *name* is the pathname of the archive. *name* may be a :term:`path-like object`. It can be omitted if *fileobj* is given. In this case, the file object's :attr:`name` attribute is used if it exists.
uk: *ім’я* — шлях до архіву. *name* може бути :term:`path-like object`. Його можна опустити, якщо вказано *fileobj*. У цьому випадку використовується атрибут :attr:`name` об’єкта файлу, якщо він існує.

source: *mode* is either ``'r'`` to read from an existing archive, ``'a'`` to append data to an existing file, ``'w'`` to create a new file overwriting an existing one, or ``'x'`` to create a new file only if it does not already exist.
uk: *режим* — це або ``'r'`` для читання з існуючого архіву, ``'a'`` для додавання даних до існуючого файлу, ``'w'`` для створення нового файлу, перезаписуючого існуючий , або ``'x''``, щоб створити новий файл, лише якщо він ще не існує.

source: If *fileobj* is given, it is used for reading or writing data. If it can be determined, *mode* is overridden by *fileobj*'s mode. *fileobj* will be used from position 0.
uk: Якщо вказано *fileobj*, він використовується для читання або запису даних. Якщо це можна визначити, *mode* замінюється режимом *fileobj*. *fileobj* використовуватиметься з позиції 0.

source: *fileobj* is not closed, when :class:`TarFile` is closed.
uk: *fileobj* не закривається, коли :class:`TarFile` закрито.

source: *format* controls the archive format for writing. It must be one of the constants :const:`USTAR_FORMAT`, :const:`GNU_FORMAT` or :const:`PAX_FORMAT` that are defined at module level. When reading, format will be automatically detected, even if different formats are present in a single archive.
uk: *format* контролює формат архіву для запису. Це має бути одна з констант :const:`USTAR_FORMAT`, :const:`GNU_FORMAT` або :const:`PAX_FORMAT`, визначених на рівні модуля. Під час читання формат буде автоматично визначено, навіть якщо в одному архіві присутні різні формати.

source: The *tarinfo* argument can be used to replace the default :class:`TarInfo` class with a different one.
uk: Аргумент *tarinfo* можна використати для заміни стандартного класу :class:`TarInfo` на інший.

source: If *dereference* is :const:`False`, add symbolic and hard links to the archive. If it is :const:`True`, add the content of the target files to the archive. This has no effect on systems that do not support symbolic links.
uk: Якщо *розіменування* має значення :const:`False`, додайте символічні та жорсткі посилання до архіву. Якщо це :const:`True`, додайте вміст цільових файлів до архіву. Це не впливає на системи, які не підтримують символічні посилання.

source: If *ignore_zeros* is :const:`False`, treat an empty block as the end of the archive. If it is :const:`True`, skip empty (and invalid) blocks and try to get as many members as possible. This is only useful for reading concatenated or damaged archives.
uk: Якщо *ignore_zeros* дорівнює :const:`False`, розглядайте порожній блок як кінець архіву. Якщо це :const:`True`, пропускайте порожні (і недійсні) блоки та намагайтеся отримати якомога більше учасників. Це корисно лише для читання об’єднаних або пошкоджених архівів.

source: *debug* can be set from ``0`` (no debug messages) up to ``3`` (all debug messages). The messages are written to ``sys.stderr``.
uk: *debug* можна встановити від ``0`` (без повідомлень налагодження) до ``3`` (усі повідомлення налагодження). Повідомлення записуються в ``sys.stderr``.

source: If *errorlevel* is ``0``, all errors are ignored when using :meth:`TarFile.extract`. Nevertheless, they appear as error messages in the debug output, when debugging is enabled. If ``1``, all *fatal* errors are raised as :exc:`OSError` exceptions. If ``2``, all *non-fatal* errors are raised as :exc:`TarError` exceptions as well.
uk: Якщо *errorlevel* дорівнює ``0``, усі помилки ігноруються під час використання :meth:`TarFile.extract`. Незважаючи на це, вони відображаються як повідомлення про помилку у вихідних даних налагодження, коли налагодження ввімкнено. Якщо ``1``, усі *фатальні* помилки викликаються як винятки :exc:`OSError`. Якщо ``2``, усі *нефатальні* помилки також викликаються як винятки :exc:`TarError`.

source: The *encoding* and *errors* arguments define the character encoding to be used for reading or writing the archive and how conversion errors are going to be handled. The default settings will work for most users. See section :ref:`tar-unicode` for in-depth information.
uk: Аргументи *encoding* і *errors* визначають кодування символів, яке буде використовуватися для читання або запису архіву, і спосіб обробки помилок перетворення. Налаштування за замовчуванням працюватимуть для більшості користувачів. Дивіться розділ :ref:`tar-unicode` для отримання детальної інформації.

source: The *pax_headers* argument is an optional dictionary of strings which will be added as a pax global header if *format* is :const:`PAX_FORMAT`.
uk: Аргумент *pax_headers* — це необов’язковий словник рядків, який буде додано як глобальний заголовок pax, якщо *format* має значення :const:`PAX_FORMAT`.

source: Use ``'surrogateescape'`` as the default for the *errors* argument.
uk: Використовуйте ``'surrogateescape'`` як типове значення для аргументу *errors*.

source: Alternative constructor. The :func:`tarfile.open` function is actually a shortcut to this classmethod.
uk: Альтернативний конструктор. Функція :func:`tarfile.open` насправді є ярликом цього методу класу.

source: Return a :class:`TarInfo` object for member *name*. If *name* can not be found in the archive, :exc:`KeyError` is raised.
uk: Повертає об’єкт :class:`TarInfo` для *ім’я* члена. Якщо *name* не вдається знайти в архіві, виникає :exc:`KeyError`.

source: If a member occurs more than once in the archive, its last occurrence is assumed to be the most up-to-date version.
uk: Якщо член зустрічається в архіві більше одного разу, вважається, що його остання зустріч є найновішою версією.

source: Return the members of the archive as a list of :class:`TarInfo` objects. The list has the same order as the members in the archive.
uk: Повернути членів архіву як список об’єктів :class:`TarInfo`. Список має той самий порядок, що й учасники в архіві.

source: Return the members as a list of their names. It has the same order as the list returned by :meth:`getmembers`.
uk: Повернути учасників у вигляді списку їхніх імен. Він має той самий порядок, що й список, який повертає :meth:`getmembers`.

source: Print a table of contents to ``sys.stdout``. If *verbose* is :const:`False`, only the names of the members are printed. If it is :const:`True`, output similar to that of :program:`ls -l` is produced. If optional *members* is given, it must be a subset of the list returned by :meth:`getmembers`.
uk: Надрукуйте зміст у ``sys.stdout``. Якщо *verbose* має значення :const:`False`, друкуються лише імена учасників. Якщо це :const:`True`, буде створено вихід, схожий на той, який виконує :program:`ls -l`. Якщо вказано необов’язковий *members*, він має бути підмножиною списку, який повертає :meth:`getmembers`.

source: Added the *members* parameter.
uk: Додано параметр *члени*.

source: Return the next member of the archive as a :class:`TarInfo` object, when :class:`TarFile` is opened for reading. Return :const:`None` if there is no more available.
uk: Повертає наступний елемент архіву як об’єкт :class:`TarInfo`, коли :class:`TarFile` відкрито для читання. Повернути :const:`None`, якщо більше немає доступних.

source: Extract all members from the archive to the current working directory or directory *path*. If optional *members* is given, it must be a subset of the list returned by :meth:`getmembers`. Directory information like owner, modification time and permissions are set after all members have been extracted. This is done to work around two problems: A directory's modification time is reset each time a file is created in it. And, if a directory's permissions do not allow writing, extracting files to it will fail.
uk: Витягніть усі члени з архіву в поточний робочий каталог або *шлях* до каталогу. Якщо вказано необов’язковий *members*, він має бути підмножиною списку, який повертає :meth:`getmembers`. Інформація про каталог, як-от власник, час зміни та дозволи, встановлюється після вилучення всіх учасників. Це зроблено, щоб вирішити дві проблеми: Час модифікації каталогу скидається кожного разу, коли в ньому створюється файл. І якщо дозволи каталогу не дозволяють записувати, видобути файли в нього не вдасться.

source: If *numeric_owner* is :const:`True`, the uid and gid numbers from the tarfile are used to set the owner/group for the extracted files. Otherwise, the named values from the tarfile are used.
uk: Якщо *numeric_owner* має значення :const:`True`, номери uid і gid з tar-файлу використовуються для встановлення власника/групи для вилучених файлів. В іншому випадку використовуються іменовані значення з tarfile.

source: Never extract archives from untrusted sources without prior inspection. It is possible that files are created outside of *path*, e.g. members that have absolute filenames starting with ``"/"`` or filenames with two dots ``".."``.
uk: Ніколи не витягуйте архіви з ненадійних джерел без попередньої перевірки. Цілком можливо, що файли створюються поза *шляхом*, напр. члени, які мають абсолютні імена файлів, що починаються з ``"/"`` або імена файлів з двома крапками ``".."``.

source: Added the *numeric_owner* parameter.
uk: Додано параметр *numeric_owner*.

source: The *path* parameter accepts a :term:`path-like object`.
uk: Параметр *path* приймає :term:`path-like object`.
