Repository: python/python-docs-uk
Catalog: library/tarfile.po
Languages: uk

source: Extract a member from the archive to the current working directory, using its full name. Its file information is extracted as accurately as possible. *member* may be a filename or a :class:`TarInfo` object. You can specify a different directory using *path*. *path* may be a :term:`path-like object`. File attributes (owner, mtime, mode) are set unless *set_attrs* is false.
uk: Розпакуйте учасника з архіву в поточний робочий каталог, використовуючи його повне ім’я. Інформація про його файл витягується якомога точніше. *member* може бути назвою файлу або об’єктом :class:`TarInfo`. Ви можете вказати інший каталог за допомогою *шляху*. *path* може бути :term:`path-like object`. Атрибути файлу (власник, mtime, режим) встановлено, якщо *set_attrs* не має значення false.

source: The :meth:`extract` method does not take care of several extraction issues. In most cases you should consider using the :meth:`extractall` method.
uk: Метод :meth:`extract` не вирішує деякі проблеми вилучення. У більшості випадків вам слід розглянути можливість використання методу :meth:`extractall`.

source: See the warning for :meth:`extractall`.
uk: Перегляньте попередження для :meth:`extractall`.

source: Added the *set_attrs* parameter.
uk: Додано параметр *set_attrs*.

source: Extract a member from the archive as a file object. *member* may be a filename or a :class:`TarInfo` object. If *member* is a regular file or a link, an :class:`io.BufferedReader` object is returned. For all other existing members, :const:`None` is returned. If *member* does not appear in the archive, :exc:`KeyError` is raised.
uk: Витягти член з архіву як файловий об’єкт. *member* може бути назвою файлу або об’єктом :class:`TarInfo`. Якщо *member* є звичайним файлом або посиланням, повертається об’єкт :class:`io.BufferedReader`. Для всіх інших існуючих учасників повертається :const:`None`. Якщо *member* не відображається в архіві, виникає :exc:`KeyError`.

source: Return an :class:`io.BufferedReader` object.
uk: Повертає об’єкт :class:`io.BufferedReader`.

source: Add the file *name* to the archive. *name* may be any type of file (directory, fifo, symbolic link, etc.). If given, *arcname* specifies an alternative name for the file in the archive. Directories are added recursively by default. This can be avoided by setting *recursive* to :const:`False`. Recursion adds entries in sorted order. If *filter* is given, it should be a function that takes a :class:`TarInfo` object argument and returns the changed :class:`TarInfo` object. If it instead returns :const:`None` the :class:`TarInfo` object will be excluded from the archive. See :ref:`tar-examples` for an example.
uk: Додайте *ім'я* файлу в архів. *ім’я* може бути будь-яким типом файлу (каталог, FIFO, символьне посилання тощо). Якщо задано, *arcname* визначає альтернативне ім’я для файлу в архіві. За замовчуванням каталоги додаються рекурсивно. Цього можна уникнути, встановивши *recursive* на :const:`False`. Рекурсія додає записи у відсортованому порядку. Якщо вказано *фільтр*, це має бути функція, яка приймає аргумент об’єкта :class:`TarInfo` і повертає змінений об’єкт :class:`TarInfo`. Якщо замість цього він повертає :const:`None`, об’єкт :class:`TarInfo` буде виключено з архіву. Перегляньте :ref:`tar-examples` для прикладу.

source: Added the *filter* parameter.
uk: Додано параметр *фільтр*.

source: Recursion adds entries in sorted order.
uk: Рекурсія додає записи у відсортованому порядку.

source: Add the :class:`TarInfo` object *tarinfo* to the archive. If *fileobj* is given, it should be a :term:`binary file`, and ``tarinfo.size`` bytes are read from it and added to the archive. You can create :class:`TarInfo` objects directly, or by using :meth:`gettarinfo`.
uk: Додайте об'єкт :class:`TarInfo` *tarinfo* до архіву. Якщо вказано *fileobj*, це має бути :term:`binary file`, а байти ``tarinfo.size`` зчитуються з нього та додаються до архіву. Ви можете створювати об’єкти :class:`TarInfo` безпосередньо або за допомогою :meth:`gettarinfo`.

source: Create a :class:`TarInfo` object from the result of :func:`os.stat` or equivalent on an existing file. The file is either named by *name*, or specified as a :term:`file object` *fileobj* with a file descriptor. *name* may be a :term:`path-like object`. If given, *arcname* specifies an alternative name for the file in the archive, otherwise, the name is taken from *fileobj*’s :attr:`~io.FileIO.name` attribute, or the *name* argument. The name should be a text string.
uk: Створіть об’єкт :class:`TarInfo` з результату :func:`os.stat` або еквівалентного в існуючому файлі. Файл або має назву *name*, або вказується як :term:`file object` *fileobj* з дескриптором файлу. *name* може бути :term:`path-like object`. Якщо задано, *arcname* визначає альтернативне ім’я для файлу в архіві, інакше ім’я береться з атрибута *fileobj* :attr:`~io.FileIO.name` або аргументу *name*. Назва має бути текстовим рядком.

source: You can modify some of the :class:`TarInfo`’s attributes before you add it using :meth:`addfile`. If the file object is not an ordinary file object positioned at the beginning of the file, attributes such as :attr:`~TarInfo.size` may need modifying. This is the case for objects such as :class:`~gzip.GzipFile`. The :attr:`~TarInfo.name` may also be modified, in which case *arcname* could be a dummy string.
uk: Ви можете змінити деякі атрибути :class:`TarInfo` перед тим, як додати його за допомогою :meth:`addfile`. Якщо файловий об’єкт не є звичайним файловим об’єктом, розміщеним на початку файлу, можливо, потрібно буде змінити атрибути, такі як :attr:`~TarInfo.size`. Це стосується таких об’єктів, як :class:`~gzip.GzipFile`. :attr:`~TarInfo.name` також можна змінити, у цьому випадку *arcname* може бути фіктивним рядком.

source: Close the :class:`TarFile`. In write mode, two finishing zero blocks are appended to the archive.
uk: Закрийте :class:`TarFile`. У режимі запису до архіву додаються два завершальних нульових блоки.

source: A dictionary containing key-value pairs of pax global headers.
uk: Словник, що містить пари ключ-значення глобальних заголовків pax.

source: TarInfo Objects
uk: Об'єкти TarInfo

source: A :class:`TarInfo` object represents one member in a :class:`TarFile`. Aside from storing all required attributes of a file (like file type, size, time, permissions, owner etc.), it provides some useful methods to determine its type. It does *not* contain the file's data itself.
uk: Об’єкт :class:`TarInfo` представляє один член у :class:`TarFile`. Окрім зберігання всіх необхідних атрибутів файлу (наприклад, типу файлу, розміру, часу, дозволів, власника тощо), він надає деякі корисні методи визначення його типу. Він *не* містить дані самого файлу.

source: :class:`TarInfo` objects are returned by :class:`TarFile`'s methods :meth:`getmember`, :meth:`getmembers` and :meth:`gettarinfo`.
uk: Об’єкти :class:`TarInfo` повертаються методами :class:`TarFile` :meth:`getmember`, :meth:`getmembers` і :meth:`gettarinfo`.

source: Create a :class:`TarInfo` object.
uk: Створіть об’єкт :class:`TarInfo`.

source: Create and return a :class:`TarInfo` object from string buffer *buf*.
uk: Створіть і поверніть об’єкт :class:`TarInfo` із рядкового буфера *buf*.

source: Raises :exc:`HeaderError` if the buffer is invalid.
uk: Викликає :exc:`HeaderError`, якщо буфер недійсний.

source: Read the next member from the :class:`TarFile` object *tarfile* and return it as a :class:`TarInfo` object.
uk: Прочитайте наступний елемент з об’єкта :class:`TarFile` *tarfile* і поверніть його як об’єкт :class:`TarInfo`.

source: Create a string buffer from a :class:`TarInfo` object. For information on the arguments see the constructor of the :class:`TarFile` class.
uk: Створіть рядковий буфер із об’єкта :class:`TarInfo`. Щоб отримати інформацію про аргументи, перегляньте конструктор класу :class:`TarFile`.

source: A ``TarInfo`` object has the following public data attributes:
uk: Об’єкт ``TarInfo`` має такі загальнодоступні атрибути даних:

source: Name of the archive member.
uk: ПІБ учасника архіву.

source: Size in bytes.
uk: Розмір у байтах.

source: Time of last modification.
uk: Час останньої модифікації.

source: Permission bits.
uk: Біти дозволу.

source: File type. *type* is usually one of these constants: :const:`REGTYPE`, :const:`AREGTYPE`, :const:`LNKTYPE`, :const:`SYMTYPE`, :const:`DIRTYPE`, :const:`FIFOTYPE`, :const:`CONTTYPE`, :const:`CHRTYPE`, :const:`BLKTYPE`, :const:`GNUTYPE_SPARSE`. To determine the type of a :class:`TarInfo` object more conveniently, use the ``is*()`` methods below.
uk: Тип файлу. *type* зазвичай є однією з таких констант: :const:`REGTYPE`, :const:`AREGTYPE`, :const:`LNKTYPE`, :const:`SYMTYPE`, :const:`DIRTYPE`, :const:`FIFOTYPE`, :const:`CONTTYPE`, :const:`CHRTYPE`, :const:`BLKTYPE`, :const:`GNUTYPE_SPARSE`. Щоб зручніше визначити тип об’єкта :class:`TarInfo`, скористайтеся наведеними нижче методами ``is*()``.

source: Name of the target file name, which is only present in :class:`TarInfo` objects of type :const:`LNKTYPE` and :const:`SYMTYPE`.
uk: Ім’я імені цільового файлу, яке присутнє лише в об’єктах :class:`TarInfo` типу :const:`LNKTYPE` і :const:`SYMTYPE`.

source: User ID of the user who originally stored this member.
uk: Ідентифікатор користувача, який спочатку зберіг цього учасника.

source: Group ID of the user who originally stored this member.
uk: Ідентифікатор групи користувача, який спочатку зберіг цього учасника.

source: User name.
uk: Ім'я користувача.

source: Group name.
uk: Назва групи.

source: A dictionary containing key-value pairs of an associated pax extended header.
uk: Словник, що містить пари ключ-значення пов’язаного розширеного заголовка pax.

source: A :class:`TarInfo` object also provides some convenient query methods:
uk: Об’єкт :class:`TarInfo` також надає деякі зручні методи запиту:

source: Return :const:`True` if the :class:`Tarinfo` object is a regular file.
uk: Повертає :const:`True`, якщо об’єкт :class:`Tarinfo` є звичайним файлом.

source: Same as :meth:`isfile`.
uk: Те саме, що :meth:`isfile`.

source: Return :const:`True` if it is a directory.
uk: Повертає :const:`True`, якщо це каталог.

source: Return :const:`True` if it is a symbolic link.
uk: Повертає :const:`True`, якщо це символічне посилання.

source: Return :const:`True` if it is a hard link.
uk: Повертає :const:`True`, якщо це жорстке посилання.

source: Return :const:`True` if it is a character device.
uk: Повертає :const:`True`, якщо це символьний пристрій.

source: Return :const:`True` if it is a block device.
uk: Повертає :const:`True`, якщо це блоковий пристрій.

source: Return :const:`True` if it is a FIFO.
uk: Повертає :const:`True`, якщо це FIFO.

source: Return :const:`True` if it is one of character device, block device or FIFO.
uk: Повертає :const:`True`, якщо це символьний пристрій, блоковий пристрій або FIFO.

source: Command-Line Interface
uk: Інтерфейс командного рядка

source: The :mod:`tarfile` module provides a simple command-line interface to interact with tar archives.
uk: Модуль :mod:`tarfile` забезпечує простий інтерфейс командного рядка для взаємодії з архівами tar.

source: If you want to create a new tar archive, specify its name after the :option:`-c` option and then list the filename(s) that should be included:
uk: Якщо ви хочете створити новий архів tar, вкажіть його назву після параметра :option:`-c`, а потім перелічіть імена файлів, які потрібно включити:

source: Passing a directory is also acceptable:
uk: Передача каталогу також прийнятна:

source: If you want to extract a tar archive into the current directory, use the :option:`-e` option:
uk: Якщо ви хочете розпакувати архів tar у поточний каталог, скористайтеся параметром :option:`-e`:

source: You can also extract a tar archive into a different directory by passing the directory's name:
uk: Ви також можете розпакувати архів tar в інший каталог, передавши назву каталогу:

source: For a list of the files in a tar archive, use the :option:`-l` option:
uk: Щоб отримати список файлів у архіві tar, використовуйте параметр :option:`-l`:

source: Command-line options
uk: Параметри командного рядка

source: List files in a tarfile.
uk: Список файлів у tar-файлі.

source: Create tarfile from source files.
uk: Створення tarfile з вихідних файлів.

source: Extract tarfile into the current directory if *output_dir* is not specified.
uk: Розпакуйте tarfile у поточний каталог, якщо *output_dir* не вказано.

source: Test whether the tarfile is valid or not.
uk: Перевірте, чи дійсний tarfile чи ні.

source: Verbose output.
uk: Детальний висновок.

source: Examples
uk: Приклади

source: How to extract an entire tar archive to the current working directory::
uk: Як розпакувати цілий архів tar до поточного робочого каталогу::

source: How to extract a subset of a tar archive with :meth:`TarFile.extractall` using a generator function instead of a list::
uk: Як розпакувати підмножину архіву tar за допомогою :meth:`TarFile.extractall` за допомогою функції генератора замість списку::

source: How to create an uncompressed tar archive from a list of filenames::
uk: Як створити нестиснений архів tar зі списку імен файлів::

source: The same example using the :keyword:`with` statement::
uk: Той самий приклад із використанням оператора :keyword:`with`::

source: How to read a gzip compressed tar archive and display some member information::
uk: Як прочитати архів tar, стиснений gzip, і відобразити інформацію про учасників:

source: How to create an archive and reset the user information using the *filter* parameter in :meth:`TarFile.add`::
uk: Як створити архів і скинути інформацію про користувача за допомогою параметра *filter* у :meth:`TarFile.add`::

source: Supported tar formats
uk: Підтримувані формати tar

source: There are three tar formats that can be created with the :mod:`tarfile` module:
uk: Існує три формати tar, які можна створити за допомогою модуля :mod:`tarfile`:

source: The POSIX.1-1988 ustar format (:const:`USTAR_FORMAT`). It supports filenames up to a length of at best 256 characters and linknames up to 100 characters. The maximum file size is 8 GiB. This is an old and limited but widely supported format.
uk: Формат POSIX.1-1988 ustar (:const:`USTAR_FORMAT`). Він підтримує назви файлів довжиною щонайбільше 256 символів і назви посилань довжиною до 100 символів. Максимальний розмір файлу становить 8 ГіБ. Це старий і обмежений, але широко підтримуваний формат.

source: The GNU tar format (:const:`GNU_FORMAT`). It supports long filenames and linknames, files bigger than 8 GiB and sparse files. It is the de facto standard on GNU/Linux systems. :mod:`tarfile` fully supports the GNU tar extensions for long names, sparse file support is read-only.
uk: Формат GNU tar (:const:`GNU_FORMAT`). Він підтримує довгі імена файлів та імена посилань, файли розміром понад 8 ГіБ і розріджені файли. Це стандарт де-факто для систем GNU/Linux. :mod:`tarfile` повністю підтримує розширення GNU tar для довгих імен, підтримка розріджених файлів доступна лише для читання.

source: The POSIX.1-2001 pax format (:const:`PAX_FORMAT`). It is the most flexible format with virtually no limits. It supports long filenames and linknames, large files and stores pathnames in a portable way. Modern tar implementations, including GNU tar, bsdtar/libarchive and star, fully support extended *pax* features; some old or unmaintained libraries may not, but should treat *pax* archives as if they were in the universally-supported *ustar* format. It is the current default format for new archives.
uk: Формат POSIX.1-2001 pax (:const:`PAX_FORMAT`). Це найбільш гнучкий формат, який практично не має обмежень. Він підтримує довгі імена файлів та імена посилань, великі файли та зберігає імена шляхів у переносний спосіб. Сучасні реалізації tar, включаючи GNU tar, bsdtar/libarchive і star, повністю підтримують розширені функції *pax*; деякі старі або непідтримувані бібліотеки можуть і не працювати, але мають обробляти архіви *pax* так, ніби вони були в універсально підтримуваному форматі *ustar*. Це поточний формат за замовчуванням для нових архівів.

source: It extends the existing *ustar* format with extra headers for information that cannot be stored otherwise. There are two flavours of pax headers: Extended headers only affect the subsequent file header, global headers are valid for the complete archive and affect all following files. All the data in a pax header is encoded in *UTF-8* for portability reasons.
uk: Він розширює існуючий формат *ustar* додатковими заголовками для інформації, яку неможливо зберегти іншим способом. Є два варіанти заголовків pax: розширені заголовки впливають лише на наступний заголовок файлу, глобальні заголовки дійсні для всього архіву та впливають на всі наступні файли. Усі дані в заголовку pax закодовано в *UTF-8* з міркувань переносимості.

source: There are some more variants of the tar format which can be read, but not created:
uk: Є ще кілька варіантів формату tar, які можна читати, але не створювати:

source: The ancient V7 format. This is the first tar format from Unix Seventh Edition, storing only regular files and directories. Names must not be longer than 100 characters, there is no user/group name information. Some archives have miscalculated header checksums in case of fields with non-ASCII characters.
uk: Старовинний формат V7. Це перший формат tar із Unix Seventh Edition, який зберігає лише звичайні файли та каталоги. Імена не повинні бути довшими за 100 символів, інформація про ім’я користувача/групи відсутня. Деякі архіви мають неправильно обчислені контрольні суми заголовків у випадку полів із символами, відмінними від ASCII.

source: The SunOS tar extended format. This format is a variant of the POSIX.1-2001 pax format, but is not compatible.
uk: Розширений формат SunOS tar. Цей формат є варіантом формату POSIX.1-2001 pax, але він не сумісний.

source: Unicode issues
uk: Проблеми з Unicode

source: The tar format was originally conceived to make backups on tape drives with the main focus on preserving file system information. Nowadays tar archives are commonly used for file distribution and exchanging archives over networks. One problem of the original format (which is the basis of all other formats) is that there is no concept of supporting different character encodings. For example, an ordinary tar archive created on a *UTF-8* system cannot be read correctly on a *Latin-1* system if it contains non-*ASCII* characters. Textual metadata (like filenames, linknames, user/group names) will appear damaged. Unfortunately, there is no way to autodetect the encoding of an archive. The pax format was designed to solve this problem. It stores non-ASCII metadata using the universal character encoding *UTF-8*.
uk: Формат tar спочатку був задуманий для створення резервних копій на стрічкових накопичувачах з основним фокусом на збереженні інформації про файлову систему. Зараз архіви tar широко використовуються для розповсюдження файлів та обміну архівами в мережах. Однією з проблем вихідного формату (який є основою всіх інших форматів) є відсутність концепції підтримки різних кодувань символів. Наприклад, звичайний архів tar, створений у системі *UTF-8*, не може бути правильно прочитаний у системі *Latin-1*, якщо він містить символи, відмінні від *ASCII*. Текстові метадані (як-от імена файлів, імена посилань, імена користувачів/груп) відображатимуться пошкодженими. На жаль, немає способу автоматичного визначення кодування архіву. Формат pax був розроблений для вирішення цієї проблеми. Він зберігає метадані, відмінні від ASCII, використовуючи універсальне кодування символів *UTF-8*.

source: The details of character conversion in :mod:`tarfile` are controlled by the *encoding* and *errors* keyword arguments of the :class:`TarFile` class.
uk: Деталі перетворення символів у :mod:`tarfile` контролюються ключовими аргументами *encoding* і *errors* класу :class:`TarFile`.

source: *encoding* defines the character encoding to use for the metadata in the archive. The default value is :func:`sys.getfilesystemencoding` or ``'ascii'`` as a fallback. Depending on whether the archive is read or written, the metadata must be either decoded or encoded. If *encoding* is not set appropriately, this conversion may fail.
uk: *encoding* визначає кодування символів для метаданих в архіві. Значення за замовчуванням — :func:`sys.getfilesystemencoding` або ``'ascii'`` як запасний варіант. Залежно від того, читається чи записується архів, метадані повинні бути або декодовані, або закодовані. Якщо *кодування* не встановлено належним чином, це перетворення може не вдатися.

source: The *errors* argument defines how characters are treated that cannot be converted. Possible values are listed in section :ref:`error-handlers`. The default scheme is ``'surrogateescape'`` which Python also uses for its file system calls, see :ref:`os-filenames`.
uk: Аргумент *errors* визначає, як обробляються символи, які не можна перетворити. Можливі значення перераховані в розділі :ref:`error-handlers`. Типовою схемою є ``'surrogateescape'``, яку Python також використовує для викликів своєї файлової системи, див. :ref:`os-filenames`.

source: For :const:`PAX_FORMAT` archives (the default), *encoding* is generally not needed because all the metadata is stored using *UTF-8*. *encoding* is only used in the rare cases when binary pax headers are decoded or when strings with surrogate characters are stored.
uk: Для архівів :const:`PAX_FORMAT` (за замовчуванням) *кодування* зазвичай не потрібне, оскільки всі метадані зберігаються за допомогою *UTF-8*. *кодування* використовується лише в рідкісних випадках, коли двійкові заголовки pax декодуються або коли зберігаються рядки із сурогатними символами.
