Repository: python/python-docs-uk
Catalog: library/threading.po
Languages: uk

source: **Source code:** :source:`Lib/threading.py`
uk: **Вихідний код:** :source:`Lib/threading.py`

source: This module used to be optional, it is now always available.
uk: Раніше цей модуль був необов’язковим, тепер він доступний завжди.

source: In the Python 2.x series, this module contained ``camelCase`` names for some methods and functions. These are deprecated as of Python 3.10, but they are still supported for compatibility with Python 2.5 and lower.
uk: У серії Python 2.x цей модуль містив назви ``camelCase`` для деяких методів і функцій. Вони застаріли з Python 3.10, але вони все ще підтримуються для сумісності з Python 2.5 і старішими.

source: In CPython, due to the :term:`Global Interpreter Lock <global interpreter lock>`, only one thread can execute Python code at once (even though certain performance-oriented libraries might overcome this limitation). If you want your application to make better use of the computational resources of multi-core machines, you are advised to use :mod:`multiprocessing` or :class:`concurrent.futures.ProcessPoolExecutor`. However, threading is still an appropriate model if you want to run multiple I/O-bound tasks simultaneously.
uk: У CPython, завдяки :term:`Global Interpreter Lock <global interpreter lock>`, лише один потік може виконувати код Python одночасно (навіть якщо певні бібліотеки, орієнтовані на продуктивність, можуть подолати це обмеження). Якщо ви хочете, щоб ваша програма краще використовувала обчислювальні ресурси багатоядерних машин, радимо використовувати :mod:`multiprocessing` або :class:`concurrent.futures.ProcessPoolExecutor`. Однак потокова розв’язка все ще є відповідною моделлю, якщо ви хочете одночасно запускати кілька завдань, пов’язаних із вводом-виводом.

source: This module defines the following functions:
uk: Цей модуль визначає такі функції:

source: Return the number of :class:`Thread` objects currently alive. The returned count is equal to the length of the list returned by :func:`.enumerate`.
uk: Повертає кількість активних об’єктів :class:`Thread`. Повернена кількість дорівнює довжині списку, повернутого :func:`.enumerate`.

source: The function ``activeCount`` is a deprecated alias for this function.
uk: Функція ``activeCount`` є застарілим псевдонімом для цієї функції.

source: Return the current :class:`Thread` object, corresponding to the caller's thread of control. If the caller's thread of control was not created through the :mod:`threading` module, a dummy thread object with limited functionality is returned.
uk: Повертає поточний об’єкт :class:`Thread`, що відповідає потоку керування абонента. Якщо потік керування викликаючого не було створено за допомогою модуля :mod:`threading`, повертається фіктивний об’єкт потоку з обмеженою функціональністю.

source: The function ``currentThread`` is a deprecated alias for this function.
uk: Функція ``currentThread`` є застарілим псевдонімом для цієї функції.

source: Handle uncaught exception raised by :func:`Thread.run`.
uk: Обробляти неперехоплений виняток, викликаний :func:`Thread.run`.

source: The *args* argument has the following attributes:
uk: Аргумент *args* має такі атрибути:

source: *exc_type*: Exception type.
uk: *exc_type*: Тип винятку.

source: *exc_value*: Exception value, can be ``None``.
uk: *exc_value*: значення винятку, може бути ``None``.

source: *exc_traceback*: Exception traceback, can be ``None``.
uk: *exc_traceback*: Зворотне відстеження винятків, може бути ``None``.

source: *thread*: Thread which raised the exception, can be ``None``.
uk: *потік*: Потік, який викликав виняток, може бути ``None``.

source: If *exc_type* is :exc:`SystemExit`, the exception is silently ignored. Otherwise, the exception is printed out on :data:`sys.stderr`.
uk: Якщо *exc_type* дорівнює :exc:`SystemExit`, виняток мовчки ігнорується. В іншому випадку виняток друкується на :data:`sys.stderr`.

source: If this function raises an exception, :func:`sys.excepthook` is called to handle it.
uk: Якщо ця функція викликає виняткову ситуацію, для її обробки викликається :func:`sys.excepthook`.

source: :func:`threading.excepthook` can be overridden to control how uncaught exceptions raised by :func:`Thread.run` are handled.
uk: :func:`threading.excepthook` можна перевизначити, щоб контролювати, як обробляються неперехоплені винятки, викликані :func:`Thread.run`.

source: Storing *exc_value* using a custom hook can create a reference cycle. It should be cleared explicitly to break the reference cycle when the exception is no longer needed.
uk: Зберігання *exc_value* за допомогою спеціального хука може створити еталонний цикл. Його слід явно очистити, щоб розірвати цикл посилання, коли виняток більше не потрібен.

source: Storing *thread* using a custom hook can resurrect it if it is set to an object which is being finalized. Avoid storing *thread* after the custom hook completes to avoid resurrecting objects.
uk: Зберігання *потоку* за допомогою спеціального хука може відновити його, якщо він встановлений для об’єкта, який завершується. Уникайте зберігання *thread* після завершення власного хука, щоб уникнути відновлення об’єктів.

source: :func:`sys.excepthook` handles uncaught exceptions.
uk: :func:`sys.excepthook` обробляє неперехоплені винятки.

source: Holds the original value of :func:`threading.excepthook`. It is saved so that the original value can be restored in case they happen to get replaced with broken or alternative objects.
uk: Зберігає вихідне значення :func:`threading.excepthook`. Він зберігається, щоб можна було відновити початкове значення у випадку, якщо вони заміняться зламаними або альтернативними об’єктами.

source: Return the 'thread identifier' of the current thread. This is a nonzero integer. Its value has no direct meaning; it is intended as a magic cookie to be used e.g. to index a dictionary of thread-specific data. Thread identifiers may be recycled when a thread exits and another thread is created.
uk: Повертає "ідентифікатор потоку" поточного потоку. Це ненульове ціле число. Його значення не має прямого значення; воно призначене як магічне печиво, яке можна використовувати, наприклад. щоб індексувати словник даних, що стосуються потоку. Ідентифікатори потоку можуть бути перероблені, коли потік завершується та створюється інший.

source: Return the native integral Thread ID of the current thread assigned by the kernel. This is a non-negative integer. Its value may be used to uniquely identify this particular thread system-wide (until the thread terminates, after which the value may be recycled by the OS).
uk: Повертає власний інтегральний ідентифікатор потоку поточного потоку, призначеного ядром. Це невід’ємне ціле число. Його значення може використовуватися для однозначної ідентифікації цього конкретного потоку в системі (до завершення роботи потоку, після чого значення може бути повторно використано ОС).

source: Return a list of all :class:`Thread` objects currently active. The list includes daemonic threads and dummy thread objects created by :func:`current_thread`. It excludes terminated threads and threads that have not yet been started. However, the main thread is always part of the result, even when terminated.
uk: Повертає список усіх активних наразі об’єктів :class:`Thread`. Список включає демонічні потоки та об’єкти-фіктивні потоки, створені :func:`current_thread`. Він виключає завершені потоки та потоки, які ще не розпочато. Однак основний потік завжди є частиною результату, навіть якщо він завершується.

source: Return the main :class:`Thread` object. In normal conditions, the main thread is the thread from which the Python interpreter was started.
uk: Повертає головний об’єкт :class:`Thread`. У нормальних умовах основний потік — це потік, з якого було запущено інтерпретатор Python.

source: Set a trace function for all threads started from the :mod:`threading` module. The *func* will be passed to :func:`sys.settrace` for each thread, before its :meth:`~Thread.run` method is called.
uk: Встановити функцію трасування для всіх потоків, запущених з модуля :mod:`threading`. *func* буде передано до :func:`sys.settrace` для кожного потоку перед викликом його методу :meth:`~Thread.run`.

source: Get the trace function as set by :func:`settrace`.
uk: Отримайте функцію трасування, встановлену :func:`settrace`.

source: Set a profile function for all threads started from the :mod:`threading` module. The *func* will be passed to :func:`sys.setprofile` for each thread, before its :meth:`~Thread.run` method is called.
uk: Встановіть функцію профілю для всіх потоків, запущених із модуля :mod:`threading`. *func* буде передано до :func:`sys.setprofile` для кожного потоку перед викликом його методу :meth:`~Thread.run`.

source: Get the profiler function as set by :func:`setprofile`.
uk: Отримайте функцію профайлера, встановлену :func:`setprofile`.

source: Return the thread stack size used when creating new threads. The optional *size* argument specifies the stack size to be used for subsequently created threads, and must be 0 (use platform or configured default) or a positive integer value of at least 32,768 (32 KiB). If *size* is not specified, 0 is used. If changing the thread stack size is unsupported, a :exc:`RuntimeError` is raised. If the specified stack size is invalid, a :exc:`ValueError` is raised and the stack size is unmodified. 32 KiB is currently the minimum supported stack size value to guarantee sufficient stack space for the interpreter itself. Note that some platforms may have particular restrictions on values for the stack size, such as requiring a minimum stack size > 32 KiB or requiring allocation in multiples of the system memory page size - platform documentation should be referred to for more information (4 KiB pages are common; using multiples of 4096 for the stack size is the suggested approach in the absence of more specific information).
uk: Повертає розмір стека потоків, який використовувався під час створення нових потоків. Необов’язковий аргумент *size* визначає розмір стека, який буде використовуватися для згодом створених потоків, і має дорівнювати 0 (використовувати платформу або налаштоване за замовчуванням) або додатне ціле значення принаймні 32 768 (32 КіБ). Якщо *size* не вказано, використовується 0. Якщо зміна розміру стека потоку не підтримується, виникає :exc:`RuntimeError`. Якщо вказаний розмір стека недійсний, виникає помилка :exc:`ValueError` і розмір стека не змінюється. 32 КіБ наразі є мінімальним підтримуваним значенням розміру стеку, щоб гарантувати достатній простір стеку для самого інтерпретатора. Зауважте, що деякі платформи можуть мати певні обмеження щодо значень розміру стека, як-от вимагати мінімальний розмір стека > 32 КБ або вимагати виділення кратного розміру сторінки системної пам’яті – для отримання додаткової інформації слід звернутися до документації платформи (сторінки 4 КБ є поширеними; використання кратних 4096 для розміру стека є запропонованим підходом за відсутності більш конкретної інформації).

source: This module also defines the following constant:
uk: Цей модуль також визначає таку константу:

source: The maximum value allowed for the *timeout* parameter of blocking functions (:meth:`Lock.acquire`, :meth:`RLock.acquire`, :meth:`Condition.wait`, etc.). Specifying a timeout greater than this value will raise an :exc:`OverflowError`.
uk: Максимально допустиме значення для параметра *timeout* функцій блокування (:meth:`Lock.acquire`, :meth:`RLock.acquire`, :meth:`Condition.wait` тощо). Якщо вказати час очікування, більший за це значення, виникне :exc:`OverflowError`.

source: This module defines a number of classes, which are detailed in the sections below.
uk: Цей модуль визначає ряд класів, які детально описані в розділах нижче.

source: The design of this module is loosely based on Java's threading model. However, where Java makes locks and condition variables basic behavior of every object, they are separate objects in Python. Python's :class:`Thread` class supports a subset of the behavior of Java's Thread class; currently, there are no priorities, no thread groups, and threads cannot be destroyed, stopped, suspended, resumed, or interrupted. The static methods of Java's Thread class, when implemented, are mapped to module-level functions.
uk: Конструкція цього модуля базується на моделі потоків Java. Однак, коли Java робить блокування та змінні умови базовою поведінкою кожного об’єкта, у Python вони є окремими об’єктами. Клас :class:`Thread` Python підтримує підмножину поведінки класу Thread Java; на даний момент немає пріоритетів, немає груп потоків, і потоки не можна знищити, зупинити, призупинити, відновити або перервати. Статичні методи класу Thread Java, коли вони реалізовані, відображаються на функції рівня модуля.

source: All of the methods described below are executed atomically.
uk: Усі методи, описані нижче, виконуються атомарно.

source: Thread-Local Data
uk: Локальні дані потоку

source: Thread-local data is data whose values are thread specific. To manage thread-local data, just create an instance of :class:`local` (or a subclass) and store attributes on it::
uk: Локальні дані потоку — це дані, значення яких залежать від потоку. Щоб керувати локальними даними потоку, просто створіть екземпляр :class:`local` (або підклас) і збережіть у ньому атрибути::

source: The instance's values will be different for separate threads.
uk: Значення екземпляра будуть різними для окремих потоків.

source: A class that represents thread-local data.
uk: Клас, який представляє дані локального потоку.

source: Thread Objects
uk: Об'єкти потоку

source: Once a thread object is created, its activity must be started by calling the thread's :meth:`~Thread.start` method. This invokes the :meth:`~Thread.run` method in a separate thread of control.
uk: Після створення об’єкта потоку його діяльність має бути запущена викликом методу потоку :meth:`~Thread.start`. Це викликає метод :meth:`~Thread.run` в окремому потоці керування.

source: Once the thread's activity is started, the thread is considered 'alive'. It stops being alive when its :meth:`~Thread.run` method terminates -- either normally, or by raising an unhandled exception. The :meth:`~Thread.is_alive` method tests whether the thread is alive.
uk: Коли активність потоку розпочато, він вважається "живим". Він перестає бути живим, коли його метод :meth:`~Thread.run` завершує роботу - або звичайним способом, або шляхом виклику необробленого винятку. Метод :meth:`~Thread.is_alive` перевіряє, чи живий потік.

source: Other threads can call a thread's :meth:`~Thread.join` method. This blocks the calling thread until the thread whose :meth:`~Thread.join` method is called is terminated.
uk: Інші потоки можуть викликати метод потоку :meth:`~Thread.join`. Це блокує потік, що викликає, доки не буде завершено потік, чий метод :meth:`~Thread.join` викликається.

source: A thread has a name. The name can be passed to the constructor, and read or changed through the :attr:`~Thread.name` attribute.
uk: Нитка має назву. Ім’я можна передати конструктору та прочитати або змінити за допомогою атрибута :attr:`~Thread.name`.

source: If the :meth:`~Thread.run` method raises an exception, :func:`threading.excepthook` is called to handle it. By default, :func:`threading.excepthook` ignores silently :exc:`SystemExit`.
uk: Якщо метод :meth:`~Thread.run` викликає виняток, для його обробки викликається :func:`threading.excepthook`. За замовчуванням :func:`threading.excepthook` мовчки ігнорує :exc:`SystemExit`.

source: A thread can be flagged as a "daemon thread". The significance of this flag is that the entire Python program exits when only daemon threads are left. The initial value is inherited from the creating thread. The flag can be set through the :attr:`~Thread.daemon` property or the *daemon* constructor argument.
uk: Потік можна позначити як "потік демона". Значення цього прапорця полягає в тому, що вся програма Python завершує роботу, коли залишаються лише потоки демона. Початкове значення успадковується від потоку створення. Прапор можна встановити через властивість :attr:`~Thread.daemon` або аргумент конструктора *daemon*.

source: Daemon threads are abruptly stopped at shutdown. Their resources (such as open files, database transactions, etc.) may not be released properly. If you want your threads to stop gracefully, make them non-daemonic and use a suitable signalling mechanism such as an :class:`Event`.
uk: Потоки демона раптово зупиняються під час завершення роботи. Їхні ресурси (такі як відкриті файли, транзакції бази даних тощо) можуть не вивільнятися належним чином. Якщо ви хочете, щоб ваші потоки зупинялися акуратно, зробіть їх недемонічними та використовуйте відповідний механізм сигналізації, такий як :class:`Event`.

source: There is a "main thread" object; this corresponds to the initial thread of control in the Python program. It is not a daemon thread.
uk: Є об’єкт "основний потік"; це відповідає початковому потоку керування в програмі Python. Це не потік демона.

source: This constructor should always be called with keyword arguments. Arguments are:
uk: Цей конструктор слід завжди викликати з ключовими аргументами. Аргументами є:

source: *target* is the callable object to be invoked by the :meth:`run` method. Defaults to ``None``, meaning nothing is called.
uk: *target* — об’єкт, який викликається методом :meth:`run`. За замовчуванням ``None``, тобто нічого не викликається.

source: *name* is the thread name. By default, a unique name is constructed of the form "Thread-*N*" where *N* is a small decimal number, or "Thread-*N* (target)" where "target" is ``target.__name__`` if the *target* argument is specified.
uk: *ім’я* – це ім’я потоку. За замовчуванням унікальне ім’я створюється у формі "Thread-*N*", де *N* — маленьке десяткове число, або "Thread-*N* (target)", де "target" — це ``target.__name__`` якщо вказано аргумент *target*.

source: *kwargs* is a dictionary of keyword arguments for the target invocation. Defaults to ``{}``.
uk: *kwargs* — це словник ключових аргументів для цільового виклику. За замовчуванням ``{}``.

source: If not ``None``, *daemon* explicitly sets whether the thread is daemonic. If ``None`` (the default), the daemonic property is inherited from the current thread.
uk: Якщо не ``None``, *daemon* явно встановлює, чи є потік демонічним. Якщо ``None`` (за замовчуванням), демонічна властивість успадковується з поточного потоку.

source: If the subclass overrides the constructor, it must make sure to invoke the base class constructor (``Thread.__init__()``) before doing anything else to the thread.
uk: Якщо підклас перевизначає конструктор, він повинен обов’язково викликати конструктор базового класу (``Thread.__init__()``), перш ніж робити щось інше з потоком.

source: Use the *target* name if *name* argument is omitted.
uk: Використовуйте назву *ціль*, якщо аргумент *ім’я* пропущено.

source: Start the thread's activity.
uk: Розпочати діяльність потоку.

source: It must be called at most once per thread object. It arranges for the object's :meth:`~Thread.run` method to be invoked in a separate thread of control.
uk: Він має бути викликаний щонайбільше один раз на об’єкт потоку. Він організовує виклик методу :meth:`~Thread.run` об’єкта в окремому потоці керування.

source: This method will raise a :exc:`RuntimeError` if called more than once on the same thread object.
uk: Цей метод викличе :exc:`RuntimeError`, якщо викликати кілька разів для того самого об’єкта потоку.

source: Method representing the thread's activity.
uk: Метод, що представляє діяльність потоку.

source: You may override this method in a subclass. The standard :meth:`run` method invokes the callable object passed to the object's constructor as the *target* argument, if any, with positional and keyword arguments taken from the *args* and *kwargs* arguments, respectively.
uk: Ви можете перевизначити цей метод у підкласі. Стандартний метод :meth:`run` викликає викликаний об’єкт, який передається конструктору об’єкта як аргумент *target*, якщо такий є, з позиційними аргументами та ключовими аргументами, взятими з аргументів *args* і *kwargs* відповідно.

source: Example::
uk: Приклад::

source: Wait until the thread terminates. This blocks the calling thread until the thread whose :meth:`~Thread.join` method is called terminates -- either normally or through an unhandled exception -- or until the optional timeout occurs.
uk: Зачекайте, поки потік завершиться. Це блокує потік, що викликає, доки потік, чий метод :meth:`~Thread.join` викликається, не завершиться (звичайно або через необроблений виняток), або доки не настане додатковий час очікування.

source: When the *timeout* argument is not present or ``None``, the operation will block until the thread terminates.
uk: Якщо аргумент *timeout* відсутній або ``None``, операція буде заблокована до завершення потоку.

source: :meth:`~Thread.join` raises a :exc:`RuntimeError` if an attempt is made to join the current thread as that would cause a deadlock. It is also an error to :meth:`~Thread.join` a thread before it has been started and attempts to do so raise the same exception.
uk: :meth:`~Thread.join` викликає :exc:`RuntimeError`, якщо робиться спроба приєднатися до поточного потоку, оскільки це призведе до взаємоблокування. Також є помилкою :meth:`~Thread.join` потоку до того, як він був запущений, і спроби зробити це викликають той самий виняток.

source: A string used for identification purposes only. It has no semantics. Multiple threads may be given the same name. The initial name is set by the constructor.
uk: Рядок, який використовується лише для ідентифікації. Він не має семантики. Декільком потокам можна присвоїти однакові назви. Початкове ім'я задається конструктором.

source: Deprecated getter/setter API for :attr:`~Thread.name`; use it directly as a property instead.
uk: Застарілий API отримання/налаштування для :attr:`~Thread.name`; використовуйте його безпосередньо як властивість.

source: The 'thread identifier' of this thread or ``None`` if the thread has not been started. This is a nonzero integer. See the :func:`get_ident` function. Thread identifiers may be recycled when a thread exits and another thread is created. The identifier is available even after the thread has exited.
uk: "Ідентифікатор потоку" цього потоку або "Немає", якщо потік не було запущено. Це ненульове ціле число. Перегляньте функцію :func:`get_ident`. Ідентифікатори потоку можуть бути перероблені, коли потік завершується та створюється інший. Ідентифікатор доступний навіть після завершення потоку.

source: The Thread ID (``TID``) of this thread, as assigned by the OS (kernel). This is a non-negative integer, or ``None`` if the thread has not been started. See the :func:`get_native_id` function. This value may be used to uniquely identify this particular thread system-wide (until the thread terminates, after which the value may be recycled by the OS).
uk: Ідентифікатор потоку (``TID``) цього потоку, призначений ОС (ядром). Це невід’ємне ціле число або ``None``, якщо потік не було запущено. Перегляньте функцію :func:`get_native_id`. Це значення може використовуватися для унікальної ідентифікації цього конкретного потоку в усій системі (доки потік не завершиться, після чого значення може бути повторно використано ОС).

source: Similar to Process IDs, Thread IDs are only valid (guaranteed unique system-wide) from the time the thread is created until the thread has been terminated.
uk: Подібно до ідентифікаторів процесів, ідентифікатори потоків дійсні (гарантовано унікальні для всієї системи) лише з моменту створення потоку до його завершення.

source: Return whether the thread is alive.
uk: Повернути, чи живий потік.
