Repository: python/python-docs-uk
Catalog: library/threading.po
Languages: uk

source: This is one of the oldest synchronization primitives in the history of computer science, invented by the early Dutch computer scientist Edsger W. Dijkstra (he used the names ``P()`` and ``V()`` instead of :meth:`~Semaphore.acquire` and :meth:`~Semaphore.release`).
uk: Це один із найстаріших примітивів синхронізації в історії інформатики, винайдений першим голландським комп’ютерним науковцем Едсгером В. Дейкстрою (він використовував імена ``P()`` і ``V()`` замість :meth:`~Semaphore.acquire` і :meth:`~Semaphore.release`).

source: A semaphore manages an internal counter which is decremented by each :meth:`~Semaphore.acquire` call and incremented by each :meth:`~Semaphore.release` call. The counter can never go below zero; when :meth:`~Semaphore.acquire` finds that it is zero, it blocks, waiting until some other thread calls :meth:`~Semaphore.release`.
uk: Семафор керує внутрішнім лічильником, який зменшується при кожному виклику :meth:`~Semaphore.acquire` і збільшується при кожному виклику :meth:`~Semaphore.release`. Лічильник ніколи не може опускатися нижче нуля; коли :meth:`~Semaphore.acquire` виявляє, що він дорівнює нулю, він блокується, чекаючи, поки інший потік викличе :meth:`~Semaphore.release`.

source: Semaphores also support the :ref:`context management protocol <with-locks>`.
uk: Семафори також підтримують :ref:`протокол управління контекстом <with-locks>`.

source: This class implements semaphore objects. A semaphore manages an atomic counter representing the number of :meth:`release` calls minus the number of :meth:`acquire` calls, plus an initial value. The :meth:`acquire` method blocks if necessary until it can return without making the counter negative. If not given, *value* defaults to 1.
uk: Цей клас реалізує семафорні об’єкти. Семафор керує атомарним лічильником, який представляє кількість викликів :meth:`release` мінус кількість викликів :meth:`acquire` плюс початкове значення. Метод :meth:`acquire` блокує, якщо необхідно, доки не зможе повернутися, не зробивши лічильник негативним. Якщо не вказано, *значення* за замовчуванням дорівнює 1.

source: The optional argument gives the initial *value* for the internal counter; it defaults to ``1``. If the *value* given is less than 0, :exc:`ValueError` is raised.
uk: Необов'язковий аргумент дає початкове *значення* для внутрішнього лічильника; за замовчуванням ``1``. Якщо задане *значення* менше 0, виникає :exc:`ValueError`.

source: Acquire a semaphore.
uk: Придбайте семафор.

source: When invoked without arguments:
uk: При виклику без аргументів:

source: If the internal counter is larger than zero on entry, decrement it by one and return ``True`` immediately.
uk: Якщо внутрішній лічильник більше нуля під час входу, зменште його на одиницю та негайно поверніть ``True``.

source: If the internal counter is zero on entry, block until awoken by a call to :meth:`~Semaphore.release`. Once awoken (and the counter is greater than 0), decrement the counter by 1 and return ``True``. Exactly one thread will be awoken by each call to :meth:`~Semaphore.release`. The order in which threads are awoken should not be relied on.
uk: Якщо внутрішній лічильник дорівнює нулю під час входу, блокуйте, доки не пробудите виклик :meth:`~Semaphore.release`. Після пробудження (і лічильник більше 0), зменшіть лічильник на 1 і поверніть ``True``. Кожен виклик :meth:`~Semaphore.release` пробуджуватиме рівно один потік. Не слід покладатися на порядок, у якому пробуджуються потоки.

source: When invoked with *blocking* set to ``False``, do not block. If a call without an argument would block, return ``False`` immediately; otherwise, do the same thing as when called without arguments, and return ``True``.
uk: При виклику з *blocking* встановленим на ``False`` не блокувати. Якщо виклик без аргументу буде заблокований, негайно поверніть ``False``; в іншому випадку виконайте те ж саме, що й під час виклику без аргументів, і поверніть ``True``.

source: When invoked with a *timeout* other than ``None``, it will block for at most *timeout* seconds. If acquire does not complete successfully in that interval, return ``False``. Return ``True`` otherwise.
uk: При виклику з *timeout*, відмінним від ``None``, він блокуватиметься щонайбільше на *timeout* секунд. Якщо отримання не завершується успішно протягом цього інтервалу, повертається ``False``. В іншому випадку поверніть ``True``.

source: Release a semaphore, incrementing the internal counter by *n*. When it was zero on entry and other threads are waiting for it to become larger than zero again, wake up *n* of those threads.
uk: Відпустіть семафор, збільшивши внутрішній лічильник на *n*. Коли він був нульовим під час входу, а інші потоки чекають, коли він знову стане більшим за нуль, розбудіть *n* з цих потоків.

source: Added the *n* parameter to release multiple waiting threads at once.
uk: Додано параметр *n*, щоб одночасно звільнити кілька потоків, що очікують.

source: Class implementing bounded semaphore objects. A bounded semaphore checks to make sure its current value doesn't exceed its initial value. If it does, :exc:`ValueError` is raised. In most situations semaphores are used to guard resources with limited capacity. If the semaphore is released too many times it's a sign of a bug. If not given, *value* defaults to 1.
uk: Клас, що реалізує обмежені семафорні об’єкти. Обмежений семафор перевіряє, чи його поточне значення не перевищує початкове значення. Якщо це так, виникає :exc:`ValueError`. У більшості ситуацій семафори використовуються для захисту ресурсів з обмеженою ємністю. Якщо семафор запускається занадто багато разів, це ознака помилки. Якщо не вказано, *значення* за замовчуванням дорівнює 1.

source: :class:`Semaphore` Example
uk: :class:`Semaphore` Приклад

source: Semaphores are often used to guard resources with limited capacity, for example, a database server. In any situation where the size of the resource is fixed, you should use a bounded semaphore. Before spawning any worker threads, your main thread would initialize the semaphore::
uk: Семафори часто використовуються для захисту ресурсів з обмеженою потужністю, наприклад, сервера бази даних. У будь-якій ситуації, коли розмір ресурсу фіксований, ви повинні використовувати обмежений семафор. Перед створенням будь-яких робочих потоків ваш головний потік ініціалізує семафор::

source: Once spawned, worker threads call the semaphore's acquire and release methods when they need to connect to the server::
uk: Після створення робочі потоки викликають методи отримання та випуску семафора, коли їм потрібно підключитися до сервера::

source: The use of a bounded semaphore reduces the chance that a programming error which causes the semaphore to be released more than it's acquired will go undetected.
uk: Використання обмеженого семафора зменшує ймовірність того, що програмна помилка, через яку семафор буде звільнено більше, ніж отримано, залишиться непоміченою.

source: Event Objects
uk: Об'єкти подій

source: This is one of the simplest mechanisms for communication between threads: one thread signals an event and other threads wait for it.
uk: Це один із найпростіших механізмів зв’язку між потоками: один потік сигналізує про подію, а інші потоки чекають її.

source: An event object manages an internal flag that can be set to true with the :meth:`~Event.set` method and reset to false with the :meth:`~Event.clear` method. The :meth:`~Event.wait` method blocks until the flag is true.
uk: Об’єкт події керує внутрішнім прапором, який можна встановити на true за допомогою методу :meth:`~Event.set` і скинути на false за допомогою методу :meth:`~Event.clear`. Метод :meth:`~Event.wait` блокує, доки прапор не стане істинним.

source: Class implementing event objects. An event manages a flag that can be set to true with the :meth:`~Event.set` method and reset to false with the :meth:`clear` method. The :meth:`wait` method blocks until the flag is true. The flag is initially false.
uk: Клас, що реалізує об'єкти подій. Подія керує прапором, який можна встановити на true за допомогою методу :meth:`~Event.set` і скинути на false за допомогою методу :meth:`clear`. Метод :meth:`wait` блокує, доки прапор не стане істинним. Прапор спочатку фальшивий.

source: Return ``True`` if and only if the internal flag is true.
uk: Повертає ``True`` тоді і тільки тоді, коли внутрішній прапор має значення true.

source: The method ``isSet`` is a deprecated alias for this method.
uk: Метод ``isSet`` є застарілим псевдонімом для цього методу.

source: Set the internal flag to true. All threads waiting for it to become true are awakened. Threads that call :meth:`wait` once the flag is true will not block at all.
uk: Встановіть для внутрішнього прапора значення true. Усі нитки, які чекають, коли це стане правдою, пробуджуються. Потоки, які викликають :meth:`wait`, коли прапор встановлено як true, взагалі не блокуватимуться.

source: Reset the internal flag to false. Subsequently, threads calling :meth:`wait` will block until :meth:`.set` is called to set the internal flag to true again.
uk: Скиньте внутрішній прапор на false. Згодом потоки, що викликають :meth:`wait`, блокуватимуться, доки не буде викликано :meth:`.set`, щоб знову встановити внутрішній прапор на true.

source: Timer Objects
uk: Об'єкти таймера

source: This class represents an action that should be run only after a certain amount of time has passed --- a timer. :class:`Timer` is a subclass of :class:`Thread` and as such also functions as an example of creating custom threads.
uk: Цей клас представляє дію, яку слід запускати лише після того, як мине певний час --- таймер. :class:`Timer` є підкласом :class:`Thread` і як такий також функціонує як приклад створення власних потоків.

source: For example::
uk: Наприклад::

source: Create a timer that will run *function* with arguments *args* and keyword arguments *kwargs*, after *interval* seconds have passed. If *args* is ``None`` (the default) then an empty list will be used. If *kwargs* is ``None`` (the default) then an empty dict will be used.
uk: Створіть таймер, який запускатиме *функцію* з аргументами *args* і аргументами ключового слова *kwargs* після закінчення *інтервалу* секунд. Якщо *args* має значення ``None`` (за замовчуванням), тоді використовуватиметься порожній список. Якщо *kwargs* має значення ``None`` (за замовчуванням), тоді використовуватиметься порожній dict.

source: Stop the timer, and cancel the execution of the timer's action. This will only work if the timer is still in its waiting stage.
uk: Зупиніть таймер і скасуйте виконання дії таймера. Це спрацює, лише якщо таймер все ще перебуває в стадії очікування.

source: Barrier Objects
uk: Загороджувальні об'єкти

source: This class provides a simple synchronization primitive for use by a fixed number of threads that need to wait for each other. Each of the threads tries to pass the barrier by calling the :meth:`~Barrier.wait` method and will block until all of the threads have made their :meth:`~Barrier.wait` calls. At this point, the threads are released simultaneously.
uk: Цей клас забезпечує простий примітив синхронізації для використання фіксованою кількістю потоків, які повинні чекати один одного. Кожен із потоків намагається подолати бар’єр, викликаючи метод :meth:`~Barrier.wait` і блокуватиметься, доки всі потоки не виконають свої виклики :meth:`~Barrier.wait`. У цей момент потоки звільняються одночасно.

source: The barrier can be reused any number of times for the same number of threads.
uk: Бар'єр можна повторно використовувати будь-яку кількість разів для однакової кількості потоків.

source: As an example, here is a simple way to synchronize a client and server thread::
uk: Як приклад, ось простий спосіб синхронізації потоку клієнта та сервера:

source: Create a barrier object for *parties* number of threads. An *action*, when provided, is a callable to be called by one of the threads when they are released. *timeout* is the default timeout value if none is specified for the :meth:`wait` method.
uk: Створіть бар'єрний об'єкт для *сторон* кількості потоків. *Action*, якщо надається, є викликом, який викликається одним із потоків, коли вони звільняються. *timeout* — це значення часу очікування за замовчуванням, якщо для методу :meth:`wait` його не вказано.

source: Pass the barrier. When all the threads party to the barrier have called this function, they are all released simultaneously. If a *timeout* is provided, it is used in preference to any that was supplied to the class constructor.
uk: Пройти шлагбаум. Коли всі потоки, які є стороною бар’єру, викличуть цю функцію, усі вони звільняються одночасно. Якщо надається *тайм-аут*, він використовується замість будь-якого, який було надано конструктору класу.

source: The return value is an integer in the range 0 to *parties* -- 1, different for each thread. This can be used to select a thread to do some special housekeeping, e.g.::
uk: Повернене значення є цілим числом у діапазоні від 0 до *parties* -- 1, різне для кожного потоку. Це можна використати для вибору потоку для виконання деяких спеціальних завдань, наприклад::

source: If an *action* was provided to the constructor, one of the threads will have called it prior to being released. Should this call raise an error, the barrier is put into the broken state.
uk: Якщо *дія* була надана конструктору, один із потоків викликатиме її до того, як буде звільнено. Якщо цей виклик викликає помилку, шлагбаум переходить у несправний стан.

source: If the call times out, the barrier is put into the broken state.
uk: Якщо виклик закінчився, шлагбаум переходить у несправний стан.

source: This method may raise a :class:`BrokenBarrierError` exception if the barrier is broken or reset while a thread is waiting.
uk: Цей метод може викликати виключення :class:`BrokenBarrierError`, якщо бар’єр зламано або скинуто під час очікування потоку.

source: Return the barrier to the default, empty state. Any threads waiting on it will receive the :class:`BrokenBarrierError` exception.
uk: Поверніть бар'єр до стандартного порожнього стану. Будь-які потоки, які очікують на нього, отримають виняток :class:`BrokenBarrierError`.

source: Note that using this function may require some external synchronization if there are other threads whose state is unknown. If a barrier is broken it may be better to just leave it and create a new one.
uk: Зауважте, що використання цієї функції може потребувати певної зовнішньої синхронізації, якщо існують інші потоки, стан яких невідомий. Якщо бар’єр зламано, можливо, краще залишити його та створити новий.

source: Put the barrier into a broken state. This causes any active or future calls to :meth:`wait` to fail with the :class:`BrokenBarrierError`. Use this for example if one of the threads needs to abort, to avoid deadlocking the application.
uk: Переведіть шлагбаум в зламаний стан. Це призводить до того, що будь-які активні або майбутні виклики :meth:`wait` завершуються помилкою з :class:`BrokenBarrierError`. Використовуйте це, наприклад, якщо один із потоків потрібно перервати, щоб уникнути блокування програми.

source: It may be preferable to simply create the barrier with a sensible *timeout* value to automatically guard against one of the threads going awry.
uk: Можливо, буде краще просто створити бар’єр із розумним значенням *timeout*, щоб автоматично захистити один із потоків від збою.

source: The number of threads required to pass the barrier.
uk: Кількість потоків, необхідних для проходження бар'єру.

source: The number of threads currently waiting in the barrier.
uk: Кількість потоків, які зараз очікують у бар'єрі.

source: A boolean that is ``True`` if the barrier is in the broken state.
uk: Логічне значення, яке має значення ``True``, якщо бар’єр знаходиться в зламаному стані.

source: This exception, a subclass of :exc:`RuntimeError`, is raised when the :class:`Barrier` object is reset or broken.
uk: Цей виняток, підклас :exc:`RuntimeError`, виникає, коли об’єкт :class:`Barrier` скидається або зламано.

source: Using locks, conditions, and semaphores in the :keyword:`!with` statement
uk: Використання блокувань, умов і семафорів у операторі :keyword:`!with`

source: is equivalent to::
uk: еквівалентно::

source: Currently, :class:`Lock`, :class:`RLock`, :class:`Condition`, :class:`Semaphore`, and :class:`BoundedSemaphore` objects may be used as :keyword:`with` statement context managers.
uk: Наразі об’єкти :class:`Lock`, :class:`RLock`, :class:`Condition`, :class:`Semaphore` і :class:`BoundedSemaphore` можна використовувати як контекст оператора :keyword:`with` менеджери.
