Repository: python/python-docs-uk
Catalog: library/threading.po
Languages: uk

source: This method returns ``True`` just before the :meth:`~Thread.run` method starts until just after the :meth:`~Thread.run` method terminates. The module function :func:`.enumerate` returns a list of all alive threads.
uk: Цей метод повертає ``True`` безпосередньо перед запуском методу :meth:`~Thread.run` до завершення роботи методу :meth:`~Thread.run`. Функція модуля :func:`.enumerate` повертає список усіх активних потоків.

source: A boolean value indicating whether this thread is a daemon thread (``True``) or not (``False``). This must be set before :meth:`~Thread.start` is called, otherwise :exc:`RuntimeError` is raised. Its initial value is inherited from the creating thread; the main thread is not a daemon thread and therefore all threads created in the main thread default to :attr:`~Thread.daemon` = ``False``.
uk: Логічне значення, яке вказує, чи є цей потік потоком демона (``True``) чи ні (``False``). Це має бути встановлено перед викликом :meth:`~Thread.start`, інакше виникає :exc:`RuntimeError`. Його початкове значення успадковується від потоку створення; основний потік не є потоком демона, тому всі потоки, створені в основному потоці, за замовчуванням мають :attr:`~Thread.daemon` = ``False``.

source: The entire Python program exits when no alive non-daemon threads are left.
uk: Уся програма Python завершує роботу, якщо не залишиться активних потоків, які не є демонами.

source: Deprecated getter/setter API for :attr:`~Thread.daemon`; use it directly as a property instead.
uk: Застарілий API отримання/налаштування для :attr:`~Thread.daemon`; використовуйте його безпосередньо як властивість.

source: Lock Objects
uk: Блокування об'єктів

source: A primitive lock is a synchronization primitive that is not owned by a particular thread when locked. In Python, it is currently the lowest level synchronization primitive available, implemented directly by the :mod:`_thread` extension module.
uk: Примітивне блокування — це примітив синхронізації, який не належить певному потоку, коли він заблокований. У Python наразі це найнижчий доступний примітив синхронізації рівня, реалізований безпосередньо модулем розширення :mod:`_thread`.

source: A primitive lock is in one of two states, "locked" or "unlocked". It is created in the unlocked state. It has two basic methods, :meth:`~Lock.acquire` and :meth:`~Lock.release`. When the state is unlocked, :meth:`~Lock.acquire` changes the state to locked and returns immediately. When the state is locked, :meth:`~Lock.acquire` blocks until a call to :meth:`~Lock.release` in another thread changes it to unlocked, then the :meth:`~Lock.acquire` call resets it to locked and returns. The :meth:`~Lock.release` method should only be called in the locked state; it changes the state to unlocked and returns immediately. If an attempt is made to release an unlocked lock, a :exc:`RuntimeError` will be raised.
uk: Примітивний замок знаходиться в одному з двох станів: "заблоковано" або "розблоковано". Створюється в розблокованому стані. Він має два основні методи: :meth:`~Lock.acquire` і :meth:`~Lock.release`. Коли стан розблоковано, :meth:`~Lock.acquire` змінює стан на заблокований і повертає негайно. Коли стан заблоковано, :meth:`~Lock.acquire` блокується, доки виклик :meth:`~Lock.release` в іншому потоці не змінить його на розблокований, після чого виклик :meth:`~Lock.acquire` скидається він блокується та повертається. Метод :meth:`~Lock.release` слід викликати лише в заблокованому стані; він змінює стан на розблокований і негайно повертається. Якщо буде зроблена спроба зняти розблоковане блокування, буде викликано :exc:`RuntimeError`.

source: Locks also support the :ref:`context management protocol <with-locks>`.
uk: Блокування також підтримують :ref:`протокол управління контекстом <with-locks>`.

source: When more than one thread is blocked in :meth:`~Lock.acquire` waiting for the state to turn to unlocked, only one thread proceeds when a :meth:`~Lock.release` call resets the state to unlocked; which one of the waiting threads proceeds is not defined, and may vary across implementations.
uk: Якщо в :meth:`~Lock.acquire` заблоковано більше одного потоку, який очікує, поки стан стане розблокованим, лише один потік продовжує роботу, коли виклик :meth:`~Lock.release` скидає стан до розблокованого; який із потоків, що очікують, продовжується, не визначено та може відрізнятися в різних реалізаціях.

source: All methods are executed atomically.
uk: Усі методи виконуються атомарно.

source: The class implementing primitive lock objects. Once a thread has acquired a lock, subsequent attempts to acquire it block, until it is released; any thread may release it.
uk: Клас, що реалізує примітивні об’єкти блокування. Після того, як потік отримав блокування, наступні спроби отримати його блокуються, доки він не буде звільнений; будь-який потік може його звільнити.

source: Acquire a lock, blocking or non-blocking.
uk: Отримайте блокування, блокування або неблокування.

source: When invoked with the *blocking* argument set to ``True`` (the default), block until the lock is unlocked, then set it to locked and return ``True``.
uk: При виклику з аргументом *blocking*, встановленим на ``True`` (за замовчуванням), блокувати, доки блокування не буде розблоковано, потім установіть його на locked і поверніть ``True``.

source: When invoked with the *blocking* argument set to ``False``, do not block. If a call with *blocking* set to ``True`` would block, return ``False`` immediately; otherwise, set the lock to locked and return ``True``.
uk: При виклику з аргументом *blocking*, встановленим на ``False``, не блокувати. Якщо виклик із *блокуванням*, встановленим на ``True``, заблокує, негайно поверніть ``False``; інакше встановіть блокування на locked і поверніть ``True``.

source: When invoked with the floating-point *timeout* argument set to a positive value, block for at most the number of seconds specified by *timeout* and as long as the lock cannot be acquired. A *timeout* argument of ``-1`` specifies an unbounded wait. It is forbidden to specify a *timeout* when *blocking* is ``False``.
uk: Під час виклику з плаваючою комою *timeout* аргументу встановлено додатне значення, блокувати щонайбільше на кількість секунд, визначену *timeout*, і до тих пір, поки блокування не може бути отримано. Аргумент *timeout*, рівний ``-1``, визначає необмежену очікування. Заборонено вказувати *тайм-аут*, якщо *блокування* має значення ``False``.

source: The return value is ``True`` if the lock is acquired successfully, ``False`` if not (for example if the *timeout* expired).
uk: Поверненим значенням є ``True``, якщо блокування отримано успішно, ``False``, якщо ні (наприклад, якщо минув *тайм-аут*).

source: The *timeout* parameter is new.
uk: Параметр *timeout* є новим.

source: Lock acquisition can now be interrupted by signals on POSIX if the underlying threading implementation supports it.
uk: Отримання блокування тепер може бути перервано сигналами на POSIX, якщо це підтримує базова реалізація потоків.

source: Release a lock. This can be called from any thread, not only the thread which has acquired the lock.
uk: Відпустіть блокування. Це можна викликати з будь-якого потоку, а не лише з потоку, який отримав блокування.

source: When the lock is locked, reset it to unlocked, and return. If any other threads are blocked waiting for the lock to become unlocked, allow exactly one of them to proceed.
uk: Коли замок заблоковано, скиньте його до розблокованого та поверніться. Якщо будь-які інші потоки заблоковано в очікуванні розблокування блокування, дозвольте рівно одному з них продовжити.

source: When invoked on an unlocked lock, a :exc:`RuntimeError` is raised.
uk: Під час виклику для розблокованого блокування виникає :exc:`RuntimeError`.

source: There is no return value.
uk: Поверненого значення немає.

source: Return ``True`` if the lock is acquired.
uk: Повертає ``True``, якщо блокування отримано.

source: RLock Objects
uk: Об'єкти RLock

source: A reentrant lock is a synchronization primitive that may be acquired multiple times by the same thread. Internally, it uses the concepts of "owning thread" and "recursion level" in addition to the locked/unlocked state used by primitive locks. In the locked state, some thread owns the lock; in the unlocked state, no thread owns it.
uk: Блокування повторного входу — це примітив синхронізації, який може бути отриманий кілька разів одним потоком. Внутрішньо він використовує поняття "володіння потоком" і "рівень рекурсії" на додаток до заблокованого/розблокованого стану, який використовується примітивними блокуваннями. У заблокованому стані деякий потік володіє блокуванням; у розблокованому стані жоден потік не володіє ним.

source: This class implements reentrant lock objects. A reentrant lock must be released by the thread that acquired it. Once a thread has acquired a reentrant lock, the same thread may acquire it again without blocking; the thread must release it once for each time it has acquired it.
uk: Цей клас реалізує об’єкти повторного входу. Блокування повторного входу має бути звільнено потоком, який його отримав. Як тільки потік отримав блокування повторного входу, той самий потік може отримати його знову без блокування; потік повинен звільнити його один раз за кожен раз, коли він його отримав.

source: Note that ``RLock`` is actually a factory function which returns an instance of the most efficient version of the concrete RLock class that is supported by the platform.
uk: Зауважте, що ``RLock`` насправді є фабричною функцією, яка повертає екземпляр найефективнішої версії конкретного класу RLock, який підтримується платформою.

source: Release a lock, decrementing the recursion level. If after the decrement it is zero, reset the lock to unlocked (not owned by any thread), and if any other threads are blocked waiting for the lock to become unlocked, allow exactly one of them to proceed. If after the decrement the recursion level is still nonzero, the lock remains locked and owned by the calling thread.
uk: Зніміть блокування, зменшивши рівень рекурсії. Якщо після декремента він дорівнює нулю, скиньте блокування до розблокованого (не належить жодному потоку), і якщо будь-які інші потоки заблоковані в очікуванні розблокування блокування, дозвольте рівно одному з них продовжити. Якщо після декременту рівень рекурсії все ще ненульовий, блокування залишається заблокованим і належить потоку, що викликає.

source: Condition Objects
uk: Об'єкти стану

source: A condition variable is always associated with some kind of lock; this can be passed in or one will be created by default. Passing one in is useful when several condition variables must share the same lock. The lock is part of the condition object: you don't have to track it separately.
uk: Змінна умови завжди асоціюється з якимось блокуванням; це можна передати, або він буде створений за замовчуванням. Передача одного корисна, коли кілька змінних умови повинні використовувати один і той же блокування. Блокування є частиною об’єкта умови: вам не потрібно відстежувати його окремо.

source: A condition variable obeys the :ref:`context management protocol <with-locks>`: using the ``with`` statement acquires the associated lock for the duration of the enclosed block. The :meth:`~Condition.acquire` and :meth:`~Condition.release` methods also call the corresponding methods of the associated lock.
uk: Змінна умови підпорядковується :ref:`протоколу керування контекстом <with-locks>`: використання оператора ``with`` отримує пов’язане блокування протягом тривалості включеного блоку. Методи :meth:`~Condition.acquire` і :meth:`~Condition.release` також викликають відповідні методи пов’язаного блокування.

source: Other methods must be called with the associated lock held. The :meth:`~Condition.wait` method releases the lock, and then blocks until another thread awakens it by calling :meth:`~Condition.notify` or :meth:`~Condition.notify_all`. Once awakened, :meth:`~Condition.wait` re-acquires the lock and returns. It is also possible to specify a timeout.
uk: Інші методи повинні викликатися з відповідним блокуванням. Метод :meth:`~Condition.wait` знімає блокування, а потім блокує, доки інший потік не розбудить його, викликавши :meth:`~Condition.notify` або :meth:`~Condition.notify_all`. Після пробудження :meth:`~Condition.wait` знову отримує блокування та повертається. Також можна вказати тайм-аут.

source: The :meth:`~Condition.notify` method wakes up one of the threads waiting for the condition variable, if any are waiting. The :meth:`~Condition.notify_all` method wakes up all threads waiting for the condition variable.
uk: Метод :meth:`~Condition.notify` активує один із потоків, які очікують на змінну умови, якщо такі очікують. Метод :meth:`~Condition.notify_all` активує всі потоки, які очікують на змінну умови.

source: Note: the :meth:`~Condition.notify` and :meth:`~Condition.notify_all` methods don't release the lock; this means that the thread or threads awakened will not return from their :meth:`~Condition.wait` call immediately, but only when the thread that called :meth:`~Condition.notify` or :meth:`~Condition.notify_all` finally relinquishes ownership of the lock.
uk: Примітка: методи :meth:`~Condition.notify` і :meth:`~Condition.notify_all` не знімають блокування; це означає, що активований потік або потоки не повернеться зі свого виклику :meth:`~Condition.wait` негайно, а лише тоді, коли потік, який викликав :meth:`~Condition.notify` або :meth:`~Condition.notify_all` остаточно відмовляється від власності на замок.

source: The typical programming style using condition variables uses the lock to synchronize access to some shared state; threads that are interested in a particular change of state call :meth:`~Condition.wait` repeatedly until they see the desired state, while threads that modify the state call :meth:`~Condition.notify` or :meth:`~Condition.notify_all` when they change the state in such a way that it could possibly be a desired state for one of the waiters. For example, the following code is a generic producer-consumer situation with unlimited buffer capacity::
uk: Типовий стиль програмування з використанням умовних змінних використовує блокування для синхронізації доступу до деякого спільного стану; потоки, які зацікавлені в певній зміні стану, викликають :meth:`~Condition.wait` неодноразово, доки не побачать бажаний стан, тоді як потоки, які змінюють стан, викликають :meth:`~Condition.notify` або :meth:`~Condition.notify_all`, коли вони змінюють стан таким чином, що це може бути бажаним станом для одного з офіціантів. Наприклад, наступний код є загальною ситуацією виробник-споживач з необмеженою ємністю буфера:

source: The ``while`` loop checking for the application's condition is necessary because :meth:`~Condition.wait` can return after an arbitrary long time, and the condition which prompted the :meth:`~Condition.notify` call may no longer hold true. This is inherent to multi-threaded programming. The :meth:`~Condition.wait_for` method can be used to automate the condition checking, and eases the computation of timeouts::
uk: Цикл ``while`` для перевірки умови програми необхідний, оскільки :meth:`~Condition.wait` може повернутися через довільний тривалий час, а умова, яка спонукала до виклику :meth:`~Condition.notify`, може не довше зберігаються. Це властиво багатопоточному програмуванню. Метод :meth:`~Condition.wait_for` можна використовувати для автоматизації перевірки умов і полегшує обчислення тайм-аутів::

source: To choose between :meth:`~Condition.notify` and :meth:`~Condition.notify_all`, consider whether one state change can be interesting for only one or several waiting threads. E.g. in a typical producer-consumer situation, adding one item to the buffer only needs to wake up one consumer thread.
uk: Щоб вибрати між :meth:`~Condition.notify` і :meth:`~Condition.notify_all`, подумайте, чи одна зміна стану може бути цікавою лише для одного чи кількох потоків, що очікують. наприклад у типовій ситуації виробник-споживач додавання одного елемента до буфера потребує лише пробудження одного потоку споживача.

source: This class implements condition variable objects. A condition variable allows one or more threads to wait until they are notified by another thread.
uk: Цей клас реалізує об’єкти умовної змінної. Змінна умови дозволяє одному або декільком потокам чекати, поки вони не будуть сповіщені іншим потоком.

source: If the *lock* argument is given and not ``None``, it must be a :class:`Lock` or :class:`RLock` object, and it is used as the underlying lock. Otherwise, a new :class:`RLock` object is created and used as the underlying lock.
uk: Якщо вказано аргумент *lock*, а не ``None``, це має бути об’єкт :class:`Lock` або :class:`RLock`, і він використовується як основний блокування. В іншому випадку створюється новий об’єкт :class:`RLock`, який використовується як основний блокування.

source: changed from a factory function to a class.
uk: змінено з функції фабрики на клас.

source: Acquire the underlying lock. This method calls the corresponding method on the underlying lock; the return value is whatever that method returns.
uk: Отримайте основний замок. Цей метод викликає відповідний метод основного блокування; значення, що повертається, є тим, що повертає цей метод.

source: Release the underlying lock. This method calls the corresponding method on the underlying lock; there is no return value.
uk: Звільніть базовий замок. Цей метод викликає відповідний метод основного блокування; немає зворотного значення.

source: Wait until notified or until a timeout occurs. If the calling thread has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
uk: Зачекайте, поки не буде сповіщено або поки не настане час очікування. Якщо потік, що викликає, не отримав блокування під час виклику цього методу, виникає :exc:`RuntimeError`.

source: This method releases the underlying lock, and then blocks until it is awakened by a :meth:`notify` or :meth:`notify_all` call for the same condition variable in another thread, or until the optional timeout occurs. Once awakened or timed out, it re-acquires the lock and returns.
uk: Цей метод знімає основне блокування, а потім блокує, доки його не розбудить виклик :meth:`notify` або :meth:`notify_all` для тієї самої змінної умови в іншому потоці, або доки не настане додатковий тайм-аут. Після пробудження або вичерпання часу блокування знову блокується та повертається.

source: When the underlying lock is an :class:`RLock`, it is not released using its :meth:`release` method, since this may not actually unlock the lock when it was acquired multiple times recursively. Instead, an internal interface of the :class:`RLock` class is used, which really unlocks it even when it has been recursively acquired several times. Another internal interface is then used to restore the recursion level when the lock is reacquired.
uk: Якщо основним блокуванням є :class:`RLock`, він не звільняється за допомогою свого методу :meth:`release`, оскільки це може не розблокувати блокування, якщо його було отримано кілька разів рекурсивно. Замість цього використовується внутрішній інтерфейс класу :class:`RLock`, який справді розблоковує його, навіть якщо він був рекурсивно отриманий кілька разів. Інший внутрішній інтерфейс потім використовується для відновлення рівня рекурсії, коли блокування знову отримано.

source: The return value is ``True`` unless a given *timeout* expired, in which case it is ``False``.
uk: Поверненим значенням є ``True``, якщо не минув заданий *тайм-аут*, у такому випадку воно має значення ``False``.

source: Previously, the method always returned ``None``.
uk: Раніше метод завжди повертав ``None``.

source: Wait until a condition evaluates to true. *predicate* should be a callable which result will be interpreted as a boolean value. A *timeout* may be provided giving the maximum time to wait.
uk: Зачекайте, поки умова оціниться як істинна. *предикат* має бути викликаним, результат якого буде інтерпретуватися як логічне значення. Може бути надано *тайм-аут*, що дає максимальний час очікування.

source: This utility method may call :meth:`wait` repeatedly until the predicate is satisfied, or until a timeout occurs. The return value is the last return value of the predicate and will evaluate to ``False`` if the method timed out.
uk: Цей допоміжний метод може викликати :meth:`wait` неодноразово, доки предикат не буде задоволено або поки не настане час очікування. Значення, що повертається, є останнім значенням, що повертається предикатом, і оцінюється як ``False``, якщо час очікування методу минув.

source: Ignoring the timeout feature, calling this method is roughly equivalent to writing::
uk: Ігноруючи функцію тайм-ауту, виклик цього методу приблизно еквівалентний написанню::

source: Therefore, the same rules apply as with :meth:`wait`: The lock must be held when called and is re-acquired on return. The predicate is evaluated with the lock held.
uk: Таким чином, застосовуються ті самі правила, що й для :meth:`wait`: блокування має бути утримано під час виклику та повторно отримане після повернення. Предикат обчислюється з утриманим блокуванням.

source: By default, wake up one thread waiting on this condition, if any. If the calling thread has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
uk: За замовчуванням активувати один потік, який очікує за цієї умови, якщо такий є. Якщо потік, що викликає, не отримав блокування під час виклику цього методу, виникає :exc:`RuntimeError`.

source: This method wakes up at most *n* of the threads waiting for the condition variable; it is a no-op if no threads are waiting.
uk: Цей метод активує щонайбільше *n* потоків, які очікують змінної умови; це безопераційний режим, якщо немає потоків, що очікують.

source: The current implementation wakes up exactly *n* threads, if at least *n* threads are waiting. However, it's not safe to rely on this behavior. A future, optimized implementation may occasionally wake up more than *n* threads.
uk: Поточна реалізація активує рівно *n* потоків, якщо принаймні *n* потоків очікують. Однак покладатися на таку поведінку небезпечно. Майбутня оптимізована реалізація може час від часу запускати більше ніж *n* потоків.

source: Note: an awakened thread does not actually return from its :meth:`wait` call until it can reacquire the lock. Since :meth:`notify` does not release the lock, its caller should.
uk: Примітка: пробуджений потік фактично не повертається після свого виклику :meth:`wait`, доки він не зможе повторно отримати блокування. Оскільки :meth:`notify` не знімає блокування, його виклик повинен це зробити.

source: Wake up all threads waiting on this condition. This method acts like :meth:`notify`, but wakes up all waiting threads instead of one. If the calling thread has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
uk: Розбудити всі потоки, що очікують за цією умовою. Цей метод діє як :meth:`notify`, але активує всі потоки, що очікують, а не один. Якщо потік, що викликає, не отримав блокування під час виклику цього методу, виникає :exc:`RuntimeError`.

source: The method ``notifyAll`` is a deprecated alias for this method.
uk: Метод ``notifyAll`` є застарілим псевдонімом для цього методу.

source: Semaphore Objects
uk: Об'єкти семафора
