Repository: python/python-docs-uk
Catalog: library/time.po
Languages: uk

source: :mod:`time` --- Time access and conversions
uk: :mod:`time` --- Час доступу та перетворення

source: This module provides various time-related functions. For related functionality, see also the :mod:`datetime` and :mod:`calendar` modules.
uk: Цей модуль забезпечує різні функції, пов’язані з часом. Для пов’язаних функцій перегляньте також модулі :mod:`datetime` і :mod:`calendar`.

source: Although this module is always available, not all functions are available on all platforms. Most of the functions defined in this module call platform C library functions with the same name. It may sometimes be helpful to consult the platform documentation, because the semantics of these functions varies among platforms.
uk: Хоча цей модуль завжди доступний, не всі функції доступні на всіх платформах. Більшість функцій, визначених у цьому модулі, викликають функції бібліотеки платформи C з однаковою назвою. Інколи може бути корисним ознайомитися з документацією платформи, оскільки семантика цих функцій відрізняється на різних платформах.

source: An explanation of some terminology and conventions is in order.
uk: Доречно пояснення деяких термінів і умовностей.

source: The term :dfn:`seconds since the epoch` refers to the total number of elapsed seconds since the epoch, typically excluding `leap seconds`_. Leap seconds are excluded from this total on all POSIX-compliant platforms.
uk: Термін :dfn:`seconds since the epoch` відноситься до загальної кількості секунд, що минули з епохи, як правило, за винятком високосних секунд (`leap seconds`_). Секунди високосного значення виключаються з цієї суми на всіх POSIX-сумісних платформах.

source: Function :func:`strptime` can parse 2-digit years when given ``%y`` format code. When 2-digit years are parsed, they are converted according to the POSIX and ISO C standards: values 69--99 are mapped to 1969--1999, and values 0--68 are mapped to 2000--2068.
uk: Функція :func:`strptime` може аналізувати 2-значні роки, якщо надається код формату ``%y``. Коли 2-значні роки аналізуються, вони перетворюються відповідно до стандартів POSIX та ISO C: значення 69--99 відображаються на 1969--1999, а значення 0--68 – у 2000--2068.

source: UTC is Coordinated Universal Time (formerly known as Greenwich Mean Time, or GMT). The acronym UTC is not a mistake but a compromise between English and French.
uk: UTC — всесвітній координований час (раніше відомий як час за Гринвічем або GMT). Акронім UTC — це не помилка, а компроміс між англійською та французькою мовами.

source: DST is Daylight Saving Time, an adjustment of the timezone by (usually) one hour during part of the year. DST rules are magic (determined by local law) and can change from year to year. The C library has a table containing the local rules (often it is read from a system file for flexibility) and is the only source of True Wisdom in this respect.
uk: DST – це літній час, зміна часового поясу (зазвичай) на одну годину протягом частини року. Правила літнього часу є чарівними (визначаються місцевим законодавством) і можуть змінюватися з року в рік. Бібліотека C має таблицю, що містить локальні правила (часто її зчитують із системного файлу для гнучкості) і є єдиним джерелом справжньої мудрості в цьому відношенні.

source: The precision of the various real-time functions may be less than suggested by the units in which their value or argument is expressed. E.g. on most Unix systems, the clock "ticks" only 50 or 100 times a second.
uk: Точність різних функцій реального часу може бути нижчою, ніж передбачається одиницями, у яких виражено їх значення або аргумент. наприклад у більшості систем Unix годинник "тикає" лише 50 або 100 разів на секунду.

source: On the other hand, the precision of :func:`.time` and :func:`sleep` is better than their Unix equivalents: times are expressed as floating point numbers, :func:`.time` returns the most accurate time available (using Unix :c:func:`gettimeofday` where available), and :func:`sleep` will accept a time with a nonzero fraction (Unix :c:func:`select` is used to implement this, where available).
uk: З іншого боку, точність :func:`.time` і :func:`sleep` краща, ніж їхні еквіваленти Unix: час виражається як числа з плаваючою комою, :func:`.time` повертає найточніший доступний час. (з використанням Unix :c:func:`gettimeofday`, де доступно), і :func:`sleep` прийматиме час із ненульовою часткою (Unix :c:func:`select` використовується для реалізації цього, де доступно).

source: The time value as returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`, and accepted by :func:`asctime`, :func:`mktime` and :func:`strftime`, is a sequence of 9 integers. The return values of :func:`gmtime`, :func:`localtime`, and :func:`strptime` also offer attribute names for individual fields.
uk: Значення часу, що повертається :func:`gmtime`, :func:`localtime` і :func:`strptime` і приймається :func:`asctime`, :func:`mktime` і :func:`strftime`, є послідовністю з 9 цілих чисел. Повернуті значення :func:`gmtime`, :func:`localtime` і :func:`strptime` також пропонують імена атрибутів для окремих полів.

source: See :class:`struct_time` for a description of these objects.
uk: Перегляньте :class:`struct_time` для опису цих об’єктів.

source: The :class:`struct_time` type was extended to provide the :attr:`tm_gmtoff` and :attr:`tm_zone` attributes when platform supports corresponding ``struct tm`` members.
uk: Тип :class:`struct_time` було розширено, щоб забезпечити атрибути :attr:`tm_gmtoff` і :attr:`tm_zone`, якщо платформа підтримує відповідні члени ``struct tm``.

source: The :class:`struct_time` attributes :attr:`tm_gmtoff` and :attr:`tm_zone` are now available on all platforms.
uk: Атрибути :class:`struct_time` :attr:`tm_gmtoff` і :attr:`tm_zone` тепер доступні на всіх платформах.

source: Use the following functions to convert between time representations:
uk: Використовуйте такі функції для перетворення між представленнями часу:

source: From
uk: Від

source: To
uk: до

source: Use
uk: використання

source: seconds since the epoch
uk: секунд від епохи

source: :class:`struct_time` in UTC
uk: :class:`struct_time` в UTC

source: :class:`struct_time` in local time
uk: :class:`struct_time` за місцевим часом

source: Functions
uk: Функції

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string of the following form: ``'Sun Jun 20 23:21:05 1993'``. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
uk: Перетворіть кортеж або :class:`struct_time`, який представляє час, повернутий :func:`gmtime` або :func:`localtime`, на рядок такої форми: ``'Sun Jun 20 23:21:05 1993'``. Поле дня складається з двох символів і доповнюється пробілом, якщо день складається з однієї цифри, наприклад: ``'Wed Jun 9 04:26:40 1993'``.

source: If *t* is not provided, the current time as returned by :func:`localtime` is used. Locale information is not used by :func:`asctime`.
uk: Якщо *t* не вказано, використовується поточний час, який повертає :func:`localtime`. Інформація про мову не використовується :func:`asctime`.

source: Unlike the C function of the same name, :func:`asctime` does not add a trailing newline.
uk: На відміну від однойменної функції C, :func:`asctime` не додає кінцевий новий рядок.

source: Return the *clk_id* of the thread-specific CPU-time clock for the specified *thread_id*.
uk: Повертає *clk_id* специфічного для потоку годинника ЦП для вказаного *thread_id*.

source: Use :func:`threading.get_ident` or the :attr:`~threading.Thread.ident` attribute of :class:`threading.Thread` objects to get a suitable value for *thread_id*.
uk: Використовуйте :func:`threading.get_ident` або атрибут :attr:`~threading.Thread.ident` об’єктів :class:`threading.Thread`, щоб отримати відповідне значення для *thread_id*.

source: Passing an invalid or expired *thread_id* may result in undefined behavior, such as segmentation fault.
uk: Передача недійсного або простроченого *thread_id* може призвести до невизначеної поведінки, наприклад до помилки сегментації.

source: :ref:`Availability <availability>`: Unix (see the man page for :manpage:`pthread_getcpuclockid(3)` for further information).
uk: :ref:`Доступність <availability>`: Unix (дивіться сторінку довідки для :manpage:`pthread_getcpuclockid(3)` для отримання додаткової інформації).

source: Return the resolution (precision) of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
uk: Повертає роздільну здатність (точність) указаного годинника *clk_id*. Перегляньте :ref:`time-clock-id-constants` список допустимих значень для *clk_id*.

source: :ref:`Availability <availability>`: Unix.
uk: :ref:`Наявність <availability>`: Unix.

source: Return the time of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
uk: Повертає час указаного годинника *clk_id*. Зверніться до :ref:`time-clock-id-constants` для списку прийнятних значень для *clk_id*.

source: Use :func:`clock_gettime_ns` to avoid the precision loss caused by the :class:`float` type.
uk: Використовуйте :func:`clock_gettime_ns`, щоб уникнути втрати точності, викликаної типом :class:`float`.

source: Similar to :func:`clock_gettime` but return time as nanoseconds.
uk: Подібно до :func:`clock_gettime`, але повертає час у наносекундах.

source: Set the time of the specified clock *clk_id*. Currently, :data:`CLOCK_REALTIME` is the only accepted value for *clk_id*.
uk: Встановіть час зазначеного годинника *clk_id*. Наразі :data:`CLOCK_REALTIME` є єдиним прийнятним значенням для *clk_id*.

source: Use :func:`clock_settime_ns` to avoid the precision loss caused by the :class:`float` type.
uk: Використовуйте :func:`clock_settime_ns`, щоб уникнути втрати точності, викликаної типом :class:`float`.

source: Similar to :func:`clock_settime` but set time with nanoseconds.
uk: Подібно до :func:`clock_settime`, але встановлює час у наносекундах.

source: If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. ``ctime(secs)`` is equivalent to ``asctime(localtime(secs))``. Locale information is not used by :func:`ctime`.
uk: Якщо *secs* не вказано або :const:`None`, використовується поточний час, який повертає :func:`.time`. ``ctime(secs)`` еквівалентний ``asctime(localtime(secs))``. Інформація про мову не використовується :func:`ctime`.

source: Get information on the specified clock as a namespace object. Supported clock names and the corresponding functions to read their value are:
uk: Отримати інформацію про вказаний годинник як об’єкт простору імен. Підтримувані назви годинника та відповідні функції для читання їх значення:

source: ``'monotonic'``: :func:`time.monotonic`
uk: ``'монотонний'``: :func:`time.monotonic`

source: ``'time'``: :func:`time.time`
uk: ``'час'``: :func:`time.time`

source: The result has the following attributes:
uk: Результат має такі атрибути:

source: *adjustable*: ``True`` if the clock can be changed automatically (e.g. by a NTP daemon) or manually by the system administrator, ``False`` otherwise
uk: *регульований*: ``True``, якщо годинник можна змінити автоматично (наприклад, демоном NTP) або вручну системним адміністратором, ``False`` інакше

source: *implementation*: The name of the underlying C function used to get the clock value. Refer to :ref:`time-clock-id-constants` for possible values.
uk: *реалізація*: назва основної функції C, яка використовується для отримання значення тактової частоти. Зверніться до :ref:`time-clock-id-constants` щодо можливих значень.

source: *monotonic*: ``True`` if the clock cannot go backward, ``False`` otherwise
uk: *монотонний*: ``True``, якщо годинник не може повернутися назад, ``False`` інакше

source: *resolution*: The resolution of the clock in seconds (:class:`float`)
uk: *resolution*: роздільна здатність годинника в секундах (:class:`float`)

source: Like :func:`gmtime` but converts to local time. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. The dst flag is set to ``1`` when DST applies to the given time.
uk: Як :func:`gmtime`, але перетворює на місцевий час. Якщо *secs* не вказано або :const:`None`, використовується поточний час, який повертає :func:`.time`. Прапор DST встановлюється на ``1``, коли літній час застосовується до даного часу.

source: :func:`localtime` may raise :exc:`OverflowError`, if the timestamp is outside the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions, and :exc:`OSError` on :c:func:`localtime` or :c:func:`gmtime` failure. It's common for this to be restricted to years between 1970 and 2038.
uk: :func:`localtime` може викликати :exc:`OverflowError`, якщо позначка часу виходить за межі діапазону значень, які підтримують функції :c:func:`localtime` або :c:func:`gmtime` платформи, і :exc:`OSError` під час помилки :c:func:`localtime` або :c:func:`gmtime`. Зазвичай це обмежується роками між 1970 і 2038 роками.

source: This is the inverse function of :func:`localtime`. Its argument is the :class:`struct_time` or full 9-tuple (since the dst flag is needed; use ``-1`` as the dst flag if it is unknown) which expresses the time in *local* time, not UTC. It returns a floating point number, for compatibility with :func:`.time`. If the input value cannot be represented as a valid time, either :exc:`OverflowError` or :exc:`ValueError` will be raised (which depends on whether the invalid value is caught by Python or the underlying C libraries). The earliest date for which it can generate a time is platform-dependent.
uk: Це обернена функція :func:`localtime`. Його аргументом є :class:`struct_time` або повний 9-кортеж (оскільки потрібен прапор dst; використовуйте ``-1`` як прапор dst, якщо він невідомий), який виражає час у *місцевому* часі, а не UTC. Він повертає число з плаваючою комою для сумісності з :func:`.time`. Якщо вхідне значення не може бути представлено як дійсний час, буде викликано :exc:`OverflowError` або :exc:`ValueError` (що залежить від того, чи недійсне значення перехоплено Python або базовими бібліотеками C). Найраніша дата, для якої він може згенерувати час, залежить від платформи.

source: Return the value (in fractional seconds) of a monotonic clock, i.e. a clock that cannot go backwards. The clock is not affected by system clock updates. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
uk: Повертає значення (у частках секунд) монотонного годинника, тобто годинника, який не може повертатися назад. Оновлення системного годинника не впливають на годинник. Точка відліку повернутого значення не визначена, тому дійсна лише різниця між результатами двох викликів.

source: Use :func:`monotonic_ns` to avoid the precision loss caused by the :class:`float` type.
uk: Використовуйте :func:`monotonic_ns`, щоб уникнути втрати точності, викликаної типом :class:`float`.

source: The function is now always available and always system-wide.
uk: Функція тепер доступна завжди і завжди для всієї системи.

source: On macOS, the function is now system-wide.
uk: У macOS ця функція тепер доступна для всієї системи.

source: Similar to :func:`monotonic`, but return time as nanoseconds.
uk: Подібно до :func:`monotonic`, але повертає час у наносекундах.

source: Return the value (in fractional seconds) of a performance counter, i.e. a clock with the highest available resolution to measure a short duration. It does include time elapsed during sleep and is system-wide. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
uk: Повертає значення (у частках секунд) лічильника продуктивності, тобто годинник із найвищою доступною роздільною здатністю для вимірювання короткої тривалості. Він включає час, що минув під час сну, і є загальносистемним. Точка відліку повернутого значення не визначена, тому дійсна лише різниця між результатами двох викликів.

source: Use :func:`perf_counter_ns` to avoid the precision loss caused by the :class:`float` type.
uk: Використовуйте :func:`perf_counter_ns`, щоб уникнути втрати точності, викликаної типом :class:`float`.

source: On Windows, the function is now system-wide.
uk: У Windows ця функція тепер доступна для всієї системи.

source: Similar to :func:`perf_counter`, but return time as nanoseconds.
uk: Подібно до :func:`perf_counter`, але повертає час у наносекундах.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current process. It does not include time elapsed during sleep. It is process-wide by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
uk: Повертає значення (у частках секунд) суми часу процесора системи та користувача поточного процесу. Він не включає час, що минув під час сну. За визначенням це стосується всього процесу. Точка відліку повернутого значення не визначена, тому дійсна лише різниця між результатами двох викликів.

source: Use :func:`process_time_ns` to avoid the precision loss caused by the :class:`float` type.
uk: Використовуйте :func:`process_time_ns`, щоб уникнути втрати точності, викликаної типом :class:`float`.

source: Similar to :func:`process_time` but return time as nanoseconds.
uk: Подібно до :func:`process_time`, але повертає час у наносекундах.

source: The function now sleeps at least *secs* even if the sleep is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale).
uk: Функція тепер перебуває в режимі сну принаймні *секунд*, навіть якщо сон переривається сигналом, за винятком випадків, коли обробник сигналу викликає виняток (перегляньте :pep:`475` для обґрунтування).

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string as specified by the *format* argument. If *t* is not provided, the current time as returned by :func:`localtime` is used. *format* must be a string. :exc:`ValueError` is raised if any field in *t* is outside of the allowed range.
uk: Перетворіть кортеж або :class:`struct_time`, що представляє час, який повертає :func:`gmtime` або :func:`localtime`, на рядок, як зазначено в аргументі *format*. Якщо *t* не вказано, використовується поточний час, який повертає :func:`localtime`. *format* має бути рядком. :exc:`ValueError` виникає, якщо будь-яке поле в *t* виходить за межі дозволеного діапазону.

source: 0 is a legal argument for any position in the time tuple; if it is normally illegal the value is forced to a correct one.
uk: 0 є допустимим аргументом для будь-якої позиції в часовому кортежі; якщо зазвичай це нелегально, значення примусово має бути правильним.

source: The following directives can be embedded in the *format* string. They are shown without the optional field width and precision specification, and are replaced by the indicated characters in the :func:`strftime` result:
uk: Наступні директиви можуть бути вбудовані в рядок *format*. Вони відображаються без додаткової специфікації ширини поля та точності та замінюються вказаними символами в результаті :func:`strftime`:

source: Directive
uk: Директива

source: Meaning
uk: Значення

source: Notes
uk: Примітки

source: Locale's abbreviated weekday name.
uk: Скорочена назва дня тижня в локалі.

source: Locale's full weekday name.
uk: Повна назва робочого дня локалі.

source: Locale's abbreviated month name.
uk: Скорочена назва місяця в локалі.

source: Locale's full month name.
uk: Повна назва місяця.

source: Locale's appropriate date and time representation.
uk: Відповідне представлення дати та часу локалі.

source: Day of the month as a decimal number [01,31].
uk: День місяця у вигляді десяткового числа [01,31].

source: Hour (24-hour clock) as a decimal number [00,23].
uk: Година (24-годинний формат) як десяткове число [00,23].

source: Hour (12-hour clock) as a decimal number [01,12].
uk: Година (12-годинний годинник) як десяткове число [01,12].

source: Day of the year as a decimal number [001,366].
uk: День року як десяткове число [001,366].

source: Month as a decimal number [01,12].
uk: Місяць як десяткове число [01,12].

source: Minute as a decimal number [00,59].
uk: Хвилина як десяткове число [00,59].

source: Locale's equivalent of either AM or PM.
uk: Локальний еквівалент AM або PM.

source: Second as a decimal number [00,61].
uk: Секунда як десяткове число [00,61].

source: Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.
uk: Номер тижня року (неділя як перший день тижня) у вигляді десяткового числа [00,53]. Усі дні в новому році, що передують першій неділі, вважаються нульовим тижнем.

source: Weekday as a decimal number [0(Sunday),6].
uk: День тижня як десяткове число [0(неділя),6].

source: Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0.
uk: Номер тижня року (понеділок як перший день тижня) у вигляді десяткового числа [00,53]. Усі дні в новому році, що передують першому понеділку, вважаються нульовим тижнем.

source: Locale's appropriate date representation.
uk: Відповідне представлення дати в локалі.

source: Locale's appropriate time representation.
uk: Відповідне представлення часу локалі.

source: Year without century as a decimal number [00,99].
uk: Рік без століття як десяткове число [00,99].

source: Year with century as a decimal number.
uk: Рік із століттям як десяткове число.

source: Time zone offset indicating a positive or negative time difference from UTC/GMT of the form +HHMM or -HHMM, where H represents decimal hour digits and M represents decimal minute digits [-23:59, +23:59]. [1]_
uk: Зміщення часового поясу, що вказує на додатну або від’ємну різницю в часі від UTC/GMT у формі +ГГММ або -ГГММ, де H означає десяткові цифри години, а M – десяткові цифри хвилин [-23:59, +23:59]. [1]_

source: Time zone name (no characters if no time zone exists). Deprecated. [1]_
uk: Назва часового поясу (без символів, якщо часовий пояс не існує). Застаріле. [1]_

source: A literal ``'%'`` character.
uk: Буквальний символ ``'%''``.

source: Notes:
uk: Примітки:

source: When used with the :func:`strptime` function, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
uk: При використанні з функцією :func:`strptime` директива ``%p`` впливає на поле вихідних годин, лише якщо директива ``%I`` використовується для аналізу години.

source: The range really is ``0`` to ``61``; value ``60`` is valid in timestamps representing `leap seconds`_ and value ``61`` is supported for historical reasons.
uk: Діапазон насправді становить від ``0`` до ``61``; значення ``60`` є дійсним у мітках часу, що представляють високосні секунди (`leap seconds`_), а значення ``61`` підтримується з історичних причин.

source: When used with the :func:`strptime` function, ``%U`` and ``%W`` are only used in calculations when the day of the week and the year are specified.
uk: При використанні з функцією :func:`strptime`, ``%U`` і ``%W`` використовуються в обчисленнях лише тоді, коли вказано день тижня та рік.

source: Here is an example, a format for dates compatible with that specified in the :rfc:`2822` Internet email standard. [1]_ ::
uk: Ось приклад формату дат, сумісного з указаним у стандарті електронної пошти Інтернету :rfc:`2822`. [1]_ ::
