Repository: python/python-docs-uk
Catalog: library/time.po
Languages: uk

source: Additional directives may be supported on certain platforms, but only the ones listed here have a meaning standardized by ANSI C. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation.
uk: Додаткові директиви можуть підтримуватися на певних платформах, але лише перелічені тут мають значення, стандартизовані ANSI C. Щоб побачити повний набір кодів формату, які підтримуються на вашій платформі, зверніться до документації :manpage:`strftime(3)`.

source: On some platforms, an optional field width and precision specification can immediately follow the initial ``'%'`` of a directive in the following order; this is also not portable. The field width is normally 2 except for ``%j`` where it is 3.
uk: На деяких платформах необов’язкова ширина поля та специфікація точності можуть відразу слідувати за початковим ``'%'`` директиви в наступному порядку; це також не портативно. Ширина поля зазвичай дорівнює 2, за винятком ``%j``, де вона дорівнює 3.

source: Parse a string representing a time according to a format. The return value is a :class:`struct_time` as returned by :func:`gmtime` or :func:`localtime`.
uk: Проаналізуйте рядок, що представляє час, відповідно до формату. Поверненим значенням є :class:`struct_time`, яке повертає :func:`gmtime` або :func:`localtime`.

source: The *format* parameter uses the same directives as those used by :func:`strftime`; it defaults to ``"%a %b %d %H:%M:%S %Y"`` which matches the formatting returned by :func:`ctime`. If *string* cannot be parsed according to *format*, or if it has excess data after parsing, :exc:`ValueError` is raised. The default values used to fill in any missing data when more accurate values cannot be inferred are ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. Both *string* and *format* must be strings.
uk: Параметр *format* використовує ті самі директиви, що й :func:`strftime`; за замовчуванням ``"%a %b %d %H:%M:%S %Y"``, що відповідає форматуванню, яке повертає :func:`ctime`. Якщо *рядок* не може бути розібраний відповідно до *формату*, або якщо він має зайві дані після аналізу, виникає :exc:`ValueError`. Значення за замовчуванням, які використовуються для заповнення будь-яких відсутніх даних, коли точніші значення неможливо отримати, це ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. І *string*, і *format* мають бути рядками.

source: For example:
uk: Наприклад:

source: Support for the ``%Z`` directive is based on the values contained in ``tzname`` and whether ``daylight`` is true. Because of this, it is platform-specific except for recognizing UTC and GMT which are always known (and are considered to be non-daylight savings timezones).
uk: Підтримка директиви ``%Z`` базується на значеннях, що містяться в ``tzname``, і тому, чи ``daylight`` є істинним. Через це він залежить від платформи, за винятком розпізнавання UTC і GMT, які завжди відомі (і вважаються не літніми часовими поясами).

source: Only the directives specified in the documentation are supported. Because ``strftime()`` is implemented per platform it can sometimes offer more directives than those listed. But ``strptime()`` is independent of any platform and thus does not necessarily support all directives available that are not documented as supported.
uk: Підтримуються лише директиви, зазначені в документації. Оскільки ``strftime()`` реалізовано на кожній платформі, іноді він може пропонувати більше директив, ніж перераховано. Але ``strptime()`` не залежить від будь-якої платформи і тому не обов’язково підтримує всі доступні директиви, які не задокументовані як підтримувані.

source: The type of the time value sequence returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`. It is an object with a :term:`named tuple` interface: values can be accessed by index and by attribute name. The following values are present:
uk: Тип послідовності значень часу, яку повертають :func:`gmtime`, :func:`localtime` і :func:`strptime`. Це об’єкт із інтерфейсом :term:`named tuple`: доступ до значень можна отримати за індексом та назвою атрибута. Присутні такі значення:

source: Index
uk: Індекс

source: Attribute
uk: Атрибут

source: Values
uk: Цінності

source: (for example, 1993)
uk: (наприклад, 1993 р.)

source: range [1, 12]
uk: діапазон [1, 12]

source: range [1, 31]
uk: діапазон [1, 31]

source: range [0, 23]
uk: діапазон [0, 23]

source: range [0, 59]
uk: діапазон [0, 59]

source: range [0, 61]; see **(2)** in :func:`strftime` description
uk: діапазон [0, 61]; див. **(2)** в описі :func:`strftime`

source: range [0, 6], Monday is 0
uk: діапазон [0, 6], понеділок дорівнює 0

source: range [1, 366]
uk: діапазон [1, 366]

source: 0, 1 or -1; see below
uk: 0, 1 або -1; Дивіться нижче

source: abbreviation of timezone name
uk: абревіатура назви часового поясу

source: offset east of UTC in seconds
uk: зміщення на схід від UTC у секундах

source: Note that unlike the C structure, the month value is a range of [1, 12], not [0, 11].
uk: Зверніть увагу, що на відміну від структури C, значення місяця є діапазоном [1, 12], а не [0, 11].

source: In calls to :func:`mktime`, :attr:`tm_isdst` may be set to 1 when daylight savings time is in effect, and 0 when it is not. A value of -1 indicates that this is not known, and will usually result in the correct state being filled in.
uk: У викликах :func:`mktime` :attr:`tm_isdst` може бути встановлено на 1, коли літній час діє, і на 0, коли він не діє. Значення -1 вказує на те, що це невідомо, і зазвичай призводить до заповнення правильного стану.

source: When a tuple with an incorrect length is passed to a function expecting a :class:`struct_time`, or having elements of the wrong type, a :exc:`TypeError` is raised.
uk: Коли кортеж із неправильною довжиною передається до функції, яка очікує :class:`struct_time`, або містить елементи неправильного типу, виникає :exc:`TypeError`.

source: Note that even though the time is always returned as a floating point number, not all systems provide time with a better precision than 1 second. While this function normally returns non-decreasing values, it can return a lower value than a previous call if the system clock has been set back between the two calls.
uk: Зауважте, що незважаючи на те, що час завжди повертається як число з плаваючою комою, не всі системи надають час із кращою точністю, ніж 1 секунда. Хоча ця функція зазвичай повертає значення, що не зменшуються, вона може повернути нижче значення, ніж попередній виклик, якщо системний годинник було встановлено назад між двома викликами.

source: The number returned by :func:`.time` may be converted into a more common time format (i.e. year, month, day, hour, etc...) in UTC by passing it to :func:`gmtime` function or in local time by passing it to the :func:`localtime` function. In both cases a :class:`struct_time` object is returned, from which the components of the calendar date may be accessed as attributes.
uk: Число, яке повертає :func:`.time`, можна перетворити на більш поширений формат часу (тобто рік, місяць, день, година тощо) у UTC, передавши його функції :func:`gmtime` або в місцевий час, передавши його функції :func:`localtime`. В обох випадках повертається об’єкт :class:`struct_time`, з якого можна отримати доступ до компонентів календарної дати як атрибутів.

source: Use :func:`time_ns` to avoid the precision loss caused by the :class:`float` type.
uk: Використовуйте :func:`time_ns`, щоб уникнути втрати точності, викликаної типом :class:`float`.

source: Similar to :func:`~time.time` but returns time as an integer number of nanoseconds since the epoch_.
uk: Подібно до :func:`~time.time`, але повертає час як ціле число наносекунд з епохи_.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current thread. It does not include time elapsed during sleep. It is thread-specific by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls in the same thread is valid.
uk: Повертає значення (у частках секунд) суми часу процесора системи та користувача поточного потоку. Він не включає час, що минув під час сну. За визначенням це залежить від потоку. Точка відліку поверненого значення не визначена, тому дійсна лише різниця між результатами двох викликів в одному потоці.

source: Use :func:`thread_time_ns` to avoid the precision loss caused by the :class:`float` type.
uk: Використовуйте :func:`thread_time_ns`, щоб уникнути втрати точності, викликаної типом :class:`float`.

source: :ref:`Availability <availability>`: Windows, Linux, Unix systems supporting ``CLOCK_THREAD_CPUTIME_ID``.
uk: :ref:`Наявність <availability>`: системи Windows, Linux, Unix підтримують ``CLOCK_THREAD_CPUTIME_ID``.

source: Similar to :func:`thread_time` but return time as nanoseconds.
uk: Подібно до :func:`thread_time`, але повертає час у наносекундах.

source: Reset the time conversion rules used by the library routines. The environment variable :envvar:`TZ` specifies how this is done. It will also set the variables ``tzname`` (from the :envvar:`TZ` environment variable), ``timezone`` (non-DST seconds West of UTC), ``altzone`` (DST seconds west of UTC) and ``daylight`` (to 0 if this timezone does not have any daylight saving time rules, or to nonzero if there is a time, past, present or future when daylight saving time applies).
uk: Скинути правила перетворення часу, які використовуються підпрограмами бібліотеки. Змінна середовища :envvar:`TZ` визначає, як це робиться. Він також встановить змінні ``tzname`` (зі змінної середовища :envvar:`TZ`), ``timezone`` (не літній час, секунди на захід від UTC), ``altzone`` (літній час, секунди на захід від UTC ) і ``daylight`` (до 0, якщо цей часовий пояс не має правил переходу на літній час, або до відмінного від нуля, якщо існує час, минулий, теперішній або майбутній, коли застосовується літній час).

source: Although in many cases, changing the :envvar:`TZ` environment variable may affect the output of functions like :func:`localtime` without calling :func:`tzset`, this behavior should not be relied on.
uk: Хоча в багатьох випадках зміна змінної середовища :envvar:`TZ` може вплинути на вихід таких функцій, як :func:`localtime` без виклику :func:`tzset`, не слід покладатися на таку поведінку.

source: The :envvar:`TZ` environment variable should contain no whitespace.
uk: Змінна середовища :envvar:`TZ` не повинна містити пробілів.

source: The standard format of the :envvar:`TZ` environment variable is (whitespace added for clarity)::
uk: Стандартний формат змінної середовища :envvar:`TZ` такий (для ясності додано пробіли):

source: Where the components are:
uk: Де компоненти:

source: ``std`` and ``dst``
uk: ``std`` і ``dst``

source: Three or more alphanumerics giving the timezone abbreviations. These will be propagated into time.tzname
uk: Три або більше алфавітно-цифрових абревіатур часового поясу. Вони будуть поширені у time.tzname

source: ``offset``
uk: ``зсув``

source: The offset has the form: ``± hh[:mm[:ss]]``. This indicates the value added the local time to arrive at UTC. If preceded by a '-', the timezone is east of the Prime Meridian; otherwise, it is west. If no offset follows dst, summer time is assumed to be one hour ahead of standard time.
uk: Зміщення має вигляд: ``± hh[:mm[:ss]]``. Це вказує на додане значення місцевого часу для прибуття до UTC. Якщо перед ним стоїть "-", часовий пояс розташований на схід від початкового меридіана; інакше це захід. Якщо після літнього часу немає зміщення, вважається, що літній час на одну годину випереджає стандартний час.

source: ``start[/time], end[/time]``
uk: ``початок[/час], кінець[/час]``

source: Indicates when to change to and back from DST. The format of the start and end dates are one of the following:
uk: Вказує, коли переходити на літній час і повертатися з нього. Початкова та кінцева дати мають один із наведених нижче форматів.

source: The Julian day *n* (1 <= *n* <= 365). Leap days are not counted, so in all years February 28 is day 59 and March 1 is day 60.
uk: Юліанський день *n* (1 <= *n* <= 365). Високосні дні не враховуються, тому в усіх роках 28 лютого — це 59 день, а 1 березня — 60 день.

source: The zero-based Julian day (0 <= *n* <= 365). Leap days are counted, and it is possible to refer to February 29.
uk: Юліанський день від нуля (0 <= *n* <= 365). Високосні дні враховуються, і можна відноситися до 29 лютого.

source: The *d*'th day (0 <= *d* <= 6) of week *n* of month *m* of the year (1 <= *n* <= 5, 1 <= *m* <= 12, where week 5 means "the last *d* day in month *m*" which may occur in either the fourth or the fifth week). Week 1 is the first week in which the *d*'th day occurs. Day zero is a Sunday.
uk: *d*'-й день (0 <= *d* <= 6) тижня *n* місяця *m* року (1 <= *n* <= 5, 1 <= *m* <= 12, де тиждень 5 означає "останній *d* день місяця *m*", який може відбуватися як на четвертому, так і на п’ятому тижні). Тиждень 1 – це перший тиждень, на якому настає *d*-й день. Нульовий день - неділя.

source: ``time`` has the same format as ``offset`` except that no leading sign ('-' or '+') is allowed. The default, if time is not given, is 02:00:00.
uk: ``час`` має той самий формат, що ``зсув``, за винятком того, що не допускається початок знака ('-' або '+'). За умовчанням, якщо час не вказано, це 02:00:00.

source: On many Unix systems (including \*BSD, Linux, Solaris, and Darwin), it is more convenient to use the system's zoneinfo (:manpage:`tzfile(5)`) database to specify the timezone rules. To do this, set the :envvar:`TZ` environment variable to the path of the required timezone datafile, relative to the root of the systems 'zoneinfo' timezone database, usually located at :file:`/usr/share/zoneinfo`. For example, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` or ``'Europe/Amsterdam'``. ::
uk: У багатьох системах Unix (включаючи \*BSD, Linux, Solaris і Darwin) зручніше використовувати системну базу даних zoneinfo (:manpage:`tzfile(5)`) для визначення правил часового поясу. Для цього встановіть змінну середовища :envvar:`TZ` на шлях необхідного файлу даних часового поясу відносно кореня системної бази даних часових поясів 'zoneinfo', яка зазвичай знаходиться в :file:`/usr/share/zoneinfo` . Наприклад, "США/Схід", "Австралія/Мельбурн", "Єгипет" або "Європа/Амстердам". ::

source: Clock ID Constants
uk: Константи ID годинника

source: These constants are used as parameters for :func:`clock_getres` and :func:`clock_gettime`.
uk: Ці константи використовуються як параметри для :func:`clock_getres` і :func:`clock_gettime`.

source: Identical to :data:`CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
uk: Ідентичний :data:`CLOCK_MONOTONIC`, за винятком того, що він також включає будь-який час призупинення системи.

source: This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of :data:`CLOCK_REALTIME`, which may have discontinuities if the time is changed using ``settimeofday()`` or similar.
uk: Це дозволяє програмам отримувати монотонний годинник з підтримкою призупинення без необхідності мати справу з ускладненнями :data:`CLOCK_REALTIME`, які можуть мати розриви, якщо час змінюється за допомогою ``settimeofday()`` або подібного.

source: :ref:`Availability <availability>`: Linux 2.6.39 or later.
uk: :ref:`Наявність <availability>`: Linux 2.6.39 або пізнішої версії.

source: The Solaris OS has a ``CLOCK_HIGHRES`` timer that attempts to use an optimal hardware source, and may give close to nanosecond resolution. ``CLOCK_HIGHRES`` is the nonadjustable, high-resolution clock.
uk: ОС Solaris має таймер ``CLOCK_HIGHRES``, який намагається використовувати оптимальне апаратне джерело та може давати роздільну здатність, близьку до наносекунд. ``CLOCK_HIGHRES`` - це нерегульований годинник з високою роздільною здатністю.

source: :ref:`Availability <availability>`: Solaris.
uk: :ref:`Наявність <availability>`: Solaris.

source: Clock that cannot be set and represents monotonic time since some unspecified starting point.
uk: Годинник, який не можна налаштувати та відображає монотонний час із деякої невизначеної початкової точки.

source: Similar to :data:`CLOCK_MONOTONIC`, but provides access to a raw hardware-based time that is not subject to NTP adjustments.
uk: Подібно до :data:`CLOCK_MONOTONIC`, але надає доступ до необробленого апаратного часу, який не підлягає коригуванням NTP.

source: :ref:`Availability <availability>`: Linux 2.6.28 and newer, macOS 10.12 and newer.
uk: :ref:`Наявність <availability>`: Linux 2.6.28 і новіші версії, macOS 10.12 і новіші версії.

source: High-resolution per-process timer from the CPU.
uk: Таймер високої роздільної здатності для кожного процесу від ЦП.

source: :ref:`Availability <availability>`: FreeBSD, NetBSD 7 or later, OpenBSD.
uk: :ref:`Наявність <availability>`: FreeBSD, NetBSD 7 або пізнішої версії, OpenBSD.

source: `International Atomic Time <https://www.nist.gov/pml/time-and-frequency-division/nist-time-frequently-asked-questions-faq#tai>`_
uk: `Міжнародний атомний час <https://www.nist.gov/pml/time-and-frequency-division/nist-time-frequently-asked-questions-faq#tai>`_

source: The system must have a current leap second table in order for this to give the correct answer. PTP or NTP software can maintain a leap second table.
uk: Система повинна мати поточну таблицю високосних секунд, щоб це дало правильну відповідь. Програмне забезпечення PTP або NTP може підтримувати таблицю високосної секунди.

source: :ref:`Availability <availability>`: Linux.
uk: :ref:`Наявність <availability>`: Linux.

source: Thread-specific CPU-time clock.
uk: Годинник процесорного часу, що залежить від потоку.

source: Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement, both absolute and interval.
uk: Час, абсолютне значення якого — це час роботи системи без призупинення, що забезпечує точне вимірювання часу безвідмовної роботи, як абсолютного, так і інтервального.

source: :ref:`Availability <availability>`: FreeBSD, OpenBSD 5.5 or later.
uk: :ref:`Наявність <availability>`: FreeBSD, OpenBSD 5.5 або пізнішої версії.

source: Clock that increments monotonically, tracking the time since an arbitrary point, unaffected by frequency or time adjustments and not incremented while the system is asleep.
uk: Годинник, який монотонно збільшується, відстежує час з довільної точки, не залежить від коригування частоти чи часу та не збільшується, коли система сплячої системи.

source: :ref:`Availability <availability>`: macOS 10.12 and newer.
uk: :ref:`Наявність <availability>`: macOS 10.12 і новіші версії.

source: The following constant is the only parameter that can be sent to :func:`clock_settime`.
uk: Наступна константа є єдиним параметром, який можна надіслати до :func:`clock_settime`.

source: System-wide real-time clock. Setting this clock requires appropriate privileges.
uk: Загальносистемний годинник реального часу. Щоб налаштувати цей годинник, потрібні відповідні привілеї.

source: Timezone Constants
uk: Константи часового поясу

source: The offset of the local DST timezone, in seconds west of UTC, if one is defined. This is negative if the local DST timezone is east of UTC (as in Western Europe, including the UK). Only use this if ``daylight`` is nonzero. See note below.
uk: Зсув місцевого часового поясу літнього часу в секундах на захід від UTC, якщо такий визначено. Це негативно, якщо місцевий часовий пояс на літній час знаходиться на схід від UTC (як у Західній Європі, включаючи Великобританію). Використовуйте це, лише якщо ``денне світло`` не дорівнює нулю. Див. примітку нижче.

source: Nonzero if a DST timezone is defined. See note below.
uk: Ненульове значення, якщо визначено часовий пояс літнього часу. Див. примітку нижче.

source: The offset of the local (non-DST) timezone, in seconds west of UTC (negative in most of Western Europe, positive in the US, zero in the UK). See note below.
uk: Зсув місцевого (не літнього) часового поясу в секундах на захід від UTC (негативний у більшості країн Західної Європи, додатний у США, нуль у Великобританії). Див. примітку нижче.

source: A tuple of two strings: the first is the name of the local non-DST timezone, the second is the name of the local DST timezone. If no DST timezone is defined, the second string should not be used. See note below.
uk: Кортеж із двох рядків: перший — це назва місцевого часового поясу, який не працює на літній час, а другий — це назва місцевого часового поясу. Якщо часовий пояс літнього часу не визначено, другий рядок не слід використовувати. Див. примітку нижче.

source: For the above Timezone constants (:data:`altzone`, :data:`daylight`, :data:`timezone`, and :data:`tzname`), the value is determined by the timezone rules in effect at module load time or the last time :func:`tzset` is called and may be incorrect for times in the past. It is recommended to use the :attr:`tm_gmtoff` and :attr:`tm_zone` results from :func:`localtime` to obtain timezone information.
uk: Для наведених вище констант часового поясу (:data:`altzone`, :data:`daylight`, :data:`timezone` і :data:`tzname`) значення визначається правилами часового поясу, що діють під час завантаження модуля або час останнього виклику :func:`tzset` і може бути неправильним для часів у минулому. Рекомендується використовувати результати :attr:`tm_gmtoff` і :attr:`tm_zone` з :func:`localtime` для отримання інформації про часовий пояс.

source: Module :mod:`datetime`
uk: Модуль :mod:`datetime`

source: More object-oriented interface to dates and times.
uk: Більш об’єктно-орієнтований інтерфейс для дат і часу.

source: Module :mod:`locale`
uk: Модуль :mod:`locale`

source: Internationalization services. The locale setting affects the interpretation of many format specifiers in :func:`strftime` and :func:`strptime`.
uk: Послуги інтернаціоналізації. Параметр локалі впливає на інтерпретацію багатьох специфікаторів формату в :func:`strftime` і :func:`strptime`.

source: Module :mod:`calendar`
uk: Модуль :mod:`calendar`

source: General calendar-related functions. :func:`~calendar.timegm` is the inverse of :func:`gmtime` from this module.
uk: Загальні функції, пов’язані з календарем. :func:`~calendar.timegm` є зворотним до :func:`gmtime` з цього модуля.

source: Footnotes
uk: Виноски

source: The use of ``%Z`` is now deprecated, but the ``%z`` escape that expands to the preferred hour/minute offset is not supported by all ANSI C libraries. Also, a strict reading of the original 1982 :rfc:`822` standard calls for a two-digit year (``%y`` rather than ``%Y``), but practice moved to 4-digit years long before the year 2000. After that, :rfc:`822` became obsolete and the 4-digit year has been first recommended by :rfc:`1123` and then mandated by :rfc:`2822`.
uk: Використання ``%Z`` тепер застаріле, але ``%z`` екранування, яке розширюється до бажаного зміщення годин/хвилин, підтримується не всіма бібліотеками ANSI C. Крім того, суворе читання оригінального стандарту 1982 :rfc:`822` вимагає двозначного року (``%y``, а не ``%Y``), але практика перейшла на 4-значний рік задовго до 2000 рік. Після цього :rfc:`822` став застарілим, і 4-значний рік був спочатку рекомендований :rfc:`1123`, а потім дозволений :rfc:`2822`.
