Repository: python/python-docs-uk
Catalog: library/tkinter_ttk.po
Languages: uk

source: Tag Options
uk: Параметри тегів

source: The following options may be specified on tags:
uk: На тегах можуть бути вказані такі параметри:

source: foreground
uk: передній план

source: Specifies the text foreground color.
uk: Визначає колір переднього плану тексту.

source: Specifies the cell or item background color.
uk: Визначає колір тла клітинки або елемента.

source: font
uk: шрифт

source: Specifies the font to use when drawing text.
uk: Визначає шрифт для малювання тексту.

source: Specifies the item image, in case the item's image option is empty.
uk: Визначає зображення елемента, якщо параметр зображення елемента порожній.

source: Column Identifiers
uk: Ідентифікатори стовпців

source: Column identifiers take any of the following forms:
uk: Ідентифікатори стовпців приймають будь-яку з таких форм:

source: A symbolic name from the list of columns option.
uk: Символічне ім'я зі списку параметрів стовпців.

source: An integer n, specifying the nth data column.
uk: Ціле число n, що визначає n-й стовпець даних.

source: A string of the form #n, where n is an integer, specifying the nth display column.
uk: Рядок у формі #n, де n — ціле число, що визначає n-й стовпець відображення.

source: Notes:
uk: Примітки:

source: Item's option values may be displayed in a different order than the order in which they are stored.
uk: Значення параметрів елемента можуть відображатися в іншому порядку, ніж порядок, у якому вони зберігаються.

source: Column #0 always refers to the tree column, even if show="tree" is not specified.
uk: Стовпець #0 завжди відноситься до стовпця дерева, навіть якщо show="tree" не вказано.

source: A data column number is an index into an item's option values list; a display column number is the column number in the tree where the values are displayed. Tree labels are displayed in column #0. If option displaycolumns is not set, then data column n is displayed in column #n+1. Again, **column #0 always refers to the tree column**.
uk: Номер стовпця даних є індексом у списку значень параметрів елемента; номер стовпця відображення — це номер стовпця в дереві, де відображаються значення. Мітки дерева відображаються у стовпці №0. Якщо параметр displaycolumns не встановлено, стовпець даних n відображається в стовпці #n+1. Знову ж таки, **стовпець №0 завжди відноситься до стовпця дерева**.

source: The Treeview widget generates the following virtual events.
uk: Віджет Treeview генерує такі віртуальні події.

source: Event
uk: Подія

source: Generated whenever the selection changes.
uk: Генерується кожного разу, коли вибір змінюється.

source: Generated just before settings the focus item to open=True.
uk: Створено безпосередньо перед налаштуванням елемента фокусу для відкриття=True.

source: Generated just after setting the focus item to open=False.
uk: Згенеровано одразу після встановлення для елемента фокусу значення open=False.

source: The :meth:`Treeview.focus` and :meth:`Treeview.selection` methods can be used to determine the affected item or items.
uk: Методи :meth:`Treeview.focus` і :meth:`Treeview.selection` можна використовувати для визначення постраждалого елемента або елементів.

source: Returns the bounding box (relative to the treeview widget's window) of the specified *item* in the form (x, y, width, height).
uk: Повертає обмежувальну рамку (відносно вікна віджета перегляду дерева) зазначеного *елемента* у формі (x, y, ширина, висота).

source: If *column* is specified, returns the bounding box of that cell. If the *item* is not visible (i.e., if it is a descendant of a closed item or is scrolled offscreen), returns an empty string.
uk: Якщо вказано *стовпець*, повертає обмежувальну рамку цієї клітинки. Якщо *елемент* невидимий (тобто якщо він є нащадком закритого елемента або прокручується поза екраном), повертає порожній рядок.

source: Returns the list of children belonging to *item*.
uk: Повертає список дітей, що належать до *item*.

source: If *item* is not specified, returns root children.
uk: Якщо *item* не вказано, повертає кореневих дітей.

source: Replaces *item*'s child with *newchildren*.
uk: Замінює дочірній елемент *item* на *newchildren*.

source: Children present in *item* that are not present in *newchildren* are detached from the tree. No items in *newchildren* may be an ancestor of *item*. Note that not specifying *newchildren* results in detaching *item*'s children.
uk: Діти, присутні в *item*, яких немає в *newchilders*, від’єднуються від дерева. Жоден елемент у *newchildren* не може бути предком *item*. Зауважте, що якщо не вказати *newchilders*, дочірні елементи *item* будуть від’єднані.

source: Query or modify the options for the specified *column*.
uk: Запитайте або змініть параметри для вказаного *стовпця*.

source: If *kw* is not given, returns a dict of the column option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
uk: Якщо *kw* не вказано, повертає dict значень параметрів стовпця. Якщо вказано *опцію*, повертається значення для цієї *опції*. В іншому випадку встановіть параметрам відповідні значення.

source: The valid options/values are:
uk: Допустимі параметри/значення:

source: Returns the column name. This is a read-only option.
uk: Повертає назву стовпця. Це опція лише для читання.

source: anchor: One of the standard Tk anchor values.
uk: anchor: одне зі стандартних значень прив’язки Tk.

source: Specifies how the text in this column should be aligned with respect to the cell.
uk: Визначає, як має бути вирівняний текст у цьому стовпці відносно клітинки.

source: minwidth: width
uk: minwidth: ширина

source: The minimum width of the column in pixels. The treeview widget will not make the column any smaller than specified by this option when the widget is resized or the user drags a column.
uk: Мінімальна ширина стовпця в пікселях. Віджет перегляду дерева не зробить стовпець меншим, ніж визначено цією опцією, коли розмір віджета змінюється або користувач перетягує стовпець.

source: Specifies whether the column's width should be adjusted when the widget is resized.
uk: Визначає, чи слід регулювати ширину стовпця під час зміни розміру віджета.

source: width: width
uk: ширина: ширина

source: The width of the column in pixels.
uk: Ширина стовпця в пікселях.

source: To configure the tree column, call this with column = "#0"
uk: Щоб налаштувати стовпець дерева, викличте його за допомогою column = "#0"

source: Delete all specified *items* and all their descendants.
uk: Видалити всі вказані *елементи* та всіх їхніх нащадків.

source: The root item may not be deleted.
uk: Кореневий елемент не можна видалити.

source: Unlinks all of the specified *items* from the tree.
uk: Від’єднує всі вказані *елементи* від дерева.

source: The items and all of their descendants are still present, and may be reinserted at another point in the tree, but will not be displayed.
uk: Елементи та всі їхні нащадки все ще присутні та можуть бути повторно вставлені в іншу точку дерева, але не відображатимуться.

source: The root item may not be detached.
uk: Кореневий елемент не можна від’єднувати.

source: Returns ``True`` if the specified *item* is present in the tree.
uk: Повертає ``True``, якщо вказаний *елемент* присутній у дереві.

source: If *item* is specified, sets the focus item to *item*. Otherwise, returns the current focus item, or '' if there is none.
uk: Якщо вказано *item*, встановлює елемент фокуса на *item*. В іншому випадку повертає поточний елемент фокусу або '', якщо його немає.

source: Query or modify the heading options for the specified *column*.
uk: Запитайте або змініть параметри заголовка для вказаного *стовпця*.

source: If *kw* is not given, returns a dict of the heading option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
uk: Якщо *kw* не вказано, повертає dict значень опції заголовка. Якщо вказано *параметр*, повертається значення для цього *параметра*. В іншому випадку встановіть параметрам відповідні значення.

source: text: text
uk: текст: текст

source: The text to display in the column heading.
uk: Текст для відображення в заголовку стовпця.

source: image: imageName
uk: зображення: ім'я зображення

source: Specifies an image to display to the right of the column heading.
uk: Визначає зображення, яке відображатиметься праворуч від заголовка стовпця.

source: anchor: anchor
uk: якір: якір

source: Specifies how the heading text should be aligned. One of the standard Tk anchor values.
uk: Визначає, як має бути вирівняний текст заголовка. Одне зі стандартних значень прив’язки Tk.

source: command: callback
uk: команда: зворотний виклик

source: A callback to be invoked when the heading label is pressed.
uk: Зворотний виклик, що викликається, коли натискається мітка заголовка.

source: To configure the tree column heading, call this with column = "#0".
uk: Щоб налаштувати заголовок стовпця дерева, викличте його за допомогою column = "#0".

source: Returns a description of the specified *component* under the point given by *x* and *y*, or the empty string if no such *component* is present at that position.
uk: Повертає опис зазначеного *компонента* під точкою, заданою *x* та *y*, або порожній рядок, якщо такого *компонента* немає в цій позиції.

source: Returns the item ID of the item at position *y*.
uk: Повертає ідентифікатор елемента в позиції *y*.

source: Returns the data column identifier of the cell at position *x*.
uk: Повертає ідентифікатор стовпця даних клітинки в позиції *x*.

source: The tree column has ID #0.
uk: Стовпець дерева має ID #0.

source: Returns one of:
uk: Повертає одне з:

source: region
uk: область

source: meaning
uk: значення

source: heading
uk: заголовок

source: Tree heading area.
uk: Область заголовка дерева.

source: separator
uk: сепаратор

source: Space between two columns headings.
uk: Пробіл між заголовками двох стовпців.

source: tree
uk: дерево

source: The tree area.
uk: Зона дерев.

source: cell
uk: клітина

source: A data cell.
uk: Комірка даних.

source: Availability: Tk 8.6.
uk: Наявність: Tk 8.6.

source: Returns the element at position *x*, *y*.
uk: Повертає елемент у позиції *x*, *y*.

source: Returns the integer index of *item* within its parent's list of children.
uk: Повертає цілочисельний індекс *item* у батьківському списку дочірніх елементів.

source: Creates a new item and returns the item identifier of the newly created item.
uk: Створює новий елемент і повертає ідентифікатор елемента щойно створеного елемента.

source: *parent* is the item ID of the parent item, or the empty string to create a new top-level item. *index* is an integer, or the value "end", specifying where in the list of parent's children to insert the new item. If *index* is less than or equal to zero, the new node is inserted at the beginning; if *index* is greater than or equal to the current number of children, it is inserted at the end. If *iid* is specified, it is used as the item identifier; *iid* must not already exist in the tree. Otherwise, a new unique identifier is generated.
uk: *parent* — це ідентифікатор елемента батьківського елемента або порожній рядок для створення нового елемента верхнього рівня. *index* — це ціле число або значення "end", що вказує, куди в списку дочірніх елементів потрібно вставити новий елемент. Якщо *index* менше або дорівнює нулю, новий вузол вставляється на початку; якщо *index* більше або дорівнює поточній кількості дітей, він вставляється в кінці. Якщо вказано *iid*, він використовується як ідентифікатор елемента; *iid* не повинен існувати в дереві. В іншому випадку генерується новий унікальний ідентифікатор.

source: See `Item Options`_ for the list of available points.
uk: Перегляньте Параметри предметів (`Item Options`_), щоб переглянути список доступних точок.

source: Query or modify the options for the specified *item*.
uk: Запитайте або змініть параметри для вказаного *елементу*.

source: If no options are given, a dict with options/values for the item is returned. If *option* is specified then the value for that option is returned. Otherwise, sets the options to the corresponding values as given by *kw*.
uk: Якщо параметри не задано, повертається dict із параметрами/значеннями для елемента. Якщо вказано *параметр*, повертається значення для цього параметра. В іншому випадку встановлює параметри на відповідні значення, задані *kw*.

source: Moves *item* to position *index* in *parent*'s list of children.
uk: Переміщує *item* на позицію *index* у списку дочірніх елементів *батька*.

source: It is illegal to move an item under one of its descendants. If *index* is less than or equal to zero, *item* is moved to the beginning; if greater than or equal to the number of children, it is moved to the end. If *item* was detached it is reattached.
uk: Незаконно переміщувати елемент під одним із його нащадків. Якщо *index* менше або дорівнює нулю, *item* переміщується на початок; якщо більше або дорівнює кількості дітей, воно переміщується в кінець. Якщо *елемент* був від’єднаний, він знову приєднується.

source: Returns the identifier of *item*'s next sibling, or '' if *item* is the last child of its parent.
uk: Повертає ідентифікатор наступного брата *item* або '', якщо *item* є останнім дочірнім елементом свого батька.

source: Returns the ID of the parent of *item*, or '' if *item* is at the top level of the hierarchy.
uk: Повертає ідентифікатор батьківського елемента *item* або '', якщо *item* знаходиться на верхньому рівні ієрархії.

source: Returns the identifier of *item*'s previous sibling, or '' if *item* is the first child of its parent.
uk: Повертає ідентифікатор попереднього брата *item* або '', якщо *item* є першим дочірнім елементом свого батька.

source: An alias for :meth:`Treeview.move`.
uk: Псевдонім для :meth:`Treeview.move`.

source: Ensure that *item* is visible.
uk: Переконайтеся, що *елемент* видно.

source: Sets all of *item*'s ancestors open option to ``True``, and scrolls the widget if necessary so that *item* is within the visible portion of the tree.
uk: Встановлює параметр відкриття всіх предків *item* на ``True`` і прокручує віджет, якщо необхідно, щоб *item* знаходився у видимій частині дерева.

source: Returns a tuple of selected items.
uk: Повертає кортеж вибраних елементів.

source: ``selection()`` no longer takes arguments. For changing the selection state use the following selection methods.
uk: ``selection()`` більше не приймає аргументи. Для зміни стану вибору використовуйте наступні методи вибору.

source: *items* becomes the new selection.
uk: *предмети* стають новим вибором.

source: *items* can be passed as separate arguments, not just as a single tuple.
uk: *items* можна передавати як окремі аргументи, а не просто як один кортеж.

source: Add *items* to the selection.
uk: Додайте *предмети* до вибору.

source: Remove *items* from the selection.
uk: Видалити *предмети* з вибору.

source: Toggle the selection state of each item in *items*.
uk: Перемикайте стан вибору кожного елемента в *items*.

source: With one argument, returns a dictionary of column/value pairs for the specified *item*. With two arguments, returns the current value of the specified *column*. With three arguments, sets the value of given *column* in given *item* to the specified *value*.
uk: З одним аргументом повертає словник пар стовпець/значення для вказаного *елемента*. З двома аргументами повертає поточне значення вказаного *стовпця*. З трьома аргументами встановлює значення заданого *стовпця* в заданому *елементі* на вказане *значення*.

source: Bind a callback for the given event *sequence* to the tag *tagname*. When an event is delivered to an item, the callbacks for each of the item's tags option are called.
uk: Прив’яжіть зворотний виклик для даної *послідовності* події до тегу *tagname*. Коли подія доставляється до елемента, викликаються зворотні виклики для кожного параметра тегів елемента.

source: Query or modify the options for the specified *tagname*.
uk: Запитайте або змініть параметри для вказаного *тегу*.

source: If *kw* is not given, returns a dict of the option settings for *tagname*. If *option* is specified, returns the value for that *option* for the specified *tagname*. Otherwise, sets the options to the corresponding values for the given *tagname*.
uk: Якщо *kw* не вказано, повертає dict налаштувань опції для *tagname*. Якщо вказано *опцію*, повертає значення цієї *опції* для вказаного *тегу*. В іншому випадку встановлює параметри на відповідні значення для даного *тегу*.

source: If *item* is specified, returns 1 or 0 depending on whether the specified *item* has the given *tagname*. Otherwise, returns a list of all items that have the specified tag.
uk: Якщо вказано *item*, повертає 1 або 0 залежно від того, чи має вказаний *item* заданий *тег*. В іншому випадку повертає список усіх елементів, які мають вказаний тег.

source: Availability: Tk 8.6
uk: Наявність: Tk 8.6

source: Query or modify horizontal position of the treeview.
uk: Запитайте або змініть горизонтальне положення дерева.

source: Query or modify vertical position of the treeview.
uk: Запитайте або змініть вертикальне положення дерева.

source: Ttk Styling
uk: Ttk Стайлінг

source: Each widget in :mod:`ttk` is assigned a style, which specifies the set of elements making up the widget and how they are arranged, along with dynamic and default settings for element options. By default the style name is the same as the widget's class name, but it may be overridden by the widget's style option. If you don't know the class name of a widget, use the method :meth:`Misc.winfo_class` (somewidget.winfo_class()).
uk: Кожному віджету в :mod:`ttk` призначається стиль, який визначає набір елементів, що входять до складу віджета, і те, як вони впорядковані, а також динамічні параметри та налаштування за замовчуванням для параметрів елемента. За замовчуванням ім’я стилю збігається з ім’ям класу віджета, але його може замінити параметр стилю віджета. Якщо ви не знаєте назву класу віджета, скористайтеся методом :meth:`Misc.winfo_class` (somewidget.winfo_class()).

source: `Tcl'2004 conference presentation <http://tktable.sourceforge.net/tile/tile-tcl2004.pdf>`_
uk: Презентація на конференції `Tcl'2004 <http://tktable.sourceforge.net/tile/tile-tcl2004.pdf>`_

source: This document explains how the theme engine works
uk: У цьому документі пояснюється, як працює тематичний механізм

source: This class is used to manipulate the style database.
uk: Цей клас використовується для роботи з базою даних стилів.

source: Query or set the default value of the specified option(s) in *style*.
uk: Запитайте або встановіть значення за замовчуванням для вказаних параметрів у *стилі*.

source: Each key in *kw* is an option and each value is a string identifying the value for that option.
uk: Кожен ключ у *kw* є опцією, а кожне значення є рядком, що визначає значення цієї опції.

source: For example, to change every default button to be a flat button with some padding and a different background color::
uk: Наприклад, щоб змінити кожну кнопку за замовчуванням на плоску кнопку з відступом і іншим кольором фону:

source: Query or sets dynamic values of the specified option(s) in *style*.
uk: Запит або встановлення динамічних значень указаних параметрів у *стилі*.

source: Each key in *kw* is an option and each value should be a list or a tuple (usually) containing statespecs grouped in tuples, lists, or some other preference. A statespec is a compound of one or more states and then a value.
uk: Кожен ключ у *kw* є опцією, і кожне значення має бути списком або кортежем (зазвичай), що містить специфікації станів, згруповані в кортежі, списки або інші параметри. Специфікація стану — це сукупність одного чи кількох станів, а потім значення.

source: An example may make it more understandable::
uk: Приклад може зробити це більш зрозумілим:

source: Note that the order of the (states, value) sequences for an option does matter, if the order is changed to ``[('active', 'blue'), ('pressed', 'red')]`` in the foreground option, for example, the result would be a blue foreground when the widget were in active or pressed states.
uk: Зауважте, що порядок послідовностей (станів, значень) для опції має значення, якщо порядок змінено на ``[('активний', 'синій'), ('натиснутий', 'червоний')]`` у опція переднього плану, наприклад, результатом буде синій передній план, коли віджет буде активним або натиснутим.

source: Returns the value specified for *option* in *style*.
uk: Повертає значення, указане для *option* у *style*.

source: If *state* is specified, it is expected to be a sequence of one or more states. If the *default* argument is set, it is used as a fallback value in case no specification for option is found.
uk: Якщо вказано *state*, очікується, що це буде послідовність з одного або кількох станів. Якщо встановлено аргумент *за замовчуванням*, він використовується як резервне значення, якщо не знайдено специфікації параметра.

source: To check what font a Button uses by default::
uk: Щоб перевірити, який шрифт кнопка використовує за замовчуванням:

source: Define the widget layout for given *style*. If *layoutspec* is omitted, return the layout specification for given style.
uk: Визначте макет віджета для даного *стилю*. Якщо *layoutspec* пропущено, повертається специфікація макета для заданого стилю.

source: *layoutspec*, if specified, is expected to be a list or some other sequence type (excluding strings), where each item should be a tuple and the first item is the layout name and the second item should have the format described in `Layouts`_.
uk: *layoutspec*, якщо вказано, має бути списком або іншим типом послідовності (за винятком рядків), де кожен елемент має бути кортежем, а перший елемент — це ім’я макета, а другий — мати формат, описаний у розділі `Layouts`_.

source: To understand the format, see the following example (it is not intended to do anything useful)::
uk: Щоб зрозуміти формат, перегляньте наведений нижче приклад (він не має на меті зробити щось корисне):

source: Create a new element in the current theme, of the given *etype* which is expected to be either "image", "from" or "vsapi". The latter is only available in Tk 8.6a for Windows XP and Vista and is not described here.
uk: Створіть новий елемент у поточній темі заданого *etype*, який має бути "image", "from" або "vsapi". Останній доступний лише в Tk 8.6a для Windows XP і Vista і тут не описаний.

source: If "image" is used, *args* should contain the default image name followed by statespec/value pairs (this is the imagespec), and *kw* may have the following options:
uk: Якщо використовується "image", *args* має містити назву зображення за замовчуванням, за якою слідують пари стану/значення (це специфікація зображення), а *kw* може мати такі параметри:

source: padding is a list of up to four integers, specifying the left, top, right, and bottom borders, respectively.
uk: padding — це список із чотирьох цілих чисел, які визначають ліву, верхню, праву та нижню межі відповідно.

source: height=height
uk: висота=висота

source: Specifies a minimum height for the element. If less than zero, the base image's height is used as a default.
uk: Визначає мінімальну висоту елемента. Якщо значення менше нуля, за замовчуванням використовується висота базового зображення.

source: padding=padding
uk: padding=заповнення

source: Specifies the element's interior padding. Defaults to border's value if not specified.
uk: Визначає внутрішнє доповнення елемента. За умовчанням використовується значення рамки, якщо не вказано.

source: sticky=spec
uk: sticky=спец
