Repository: python/python-docs-uk
Catalog: library/tkinter_ttk.po
Languages: uk

source: Boolean value. If ``True``, increment and decrement buttons will cycle from the ``to`` value to the ``from`` value or the ``from`` value to the ``to`` value, respectively.
uk: Логічне значення. Якщо ``True``, кнопки збільшення та зменшення циклічно переключатимуться від значення ``до`` до значення ``від`` або значення ``від`` до значення ``до`` відповідно.

source: format
uk: формат

source: String value. This specifies the format of numbers set by the increment/decrement buttons. It must be in the form "%W.Pf", where W is the padded width of the value, P is the precision, and '%' and 'f' are literal.
uk: Рядкове значення. Це визначає формат чисел, встановлений кнопками збільшення/зменшення. Він має бути у формі "%W.Pf", де W — доповнена ширина значення, P — точність, а "%" і "f" — літерали.

source: command
uk: команда

source: Python callable. Will be called with no arguments whenever either of the increment or decrement buttons are pressed.
uk: Можливість виклику Python. Викликатиметься без аргументів щоразу, коли натиснуто одну з кнопок збільшення чи зменшення.

source: The spinbox widget generates an **<<Increment>>** virtual event when the user presses <Up>, and a **<<Decrement>>** virtual event when the user presses <Down>.
uk: Віджет Spinbox генерує віртуальну подію **<<Increment>>**, коли користувач натискає <Up> , і віртуальну подію **<<Decrement>>**, коли користувач натискає <Down> .

source: Returns the current value of the spinbox.
uk: Повертає поточне значення поля обертання.

source: Sets the value of the spinbox to *value*.
uk: Встановлює для поля обертання значення *value*.

source: Notebook
uk: Ноутбук

source: Ttk Notebook widget manages a collection of windows and displays a single one at a time. Each child window is associated with a tab, which the user may select to change the currently-displayed window.
uk: Віджет Ttk Notebook керує набором вікон і відображає по одному. Кожне дочірнє вікно пов’язане з вкладкою, яку користувач може вибрати, щоб змінити вікно, яке зараз відображається.

source: If present and greater than zero, specifies the desired height of the pane area (not including internal padding or tabs). Otherwise, the maximum height of all panes is used.
uk: Якщо присутнє та більше нуля, визначає бажану висоту області панелі (не враховуючи внутрішні відступи чи вкладки). В іншому випадку використовується максимальна висота всіх панелей.

source: padding
uk: оббивка

source: Specifies the amount of extra space to add around the outside of the notebook. The padding is a list up to four length specifications left top right bottom. If fewer than four elements are specified, bottom defaults to top, right defaults to left, and top defaults to left.
uk: Визначає обсяг додаткового простору, який потрібно додати навколо зовнішньої сторони блокнота. Відступ — це список до чотирьох специфікацій довжини зліва зверху справа знизу. Якщо вказано менше чотирьох елементів, нижній за замовчуванням — верхній, правий — лівий, верхній — лівий.

source: If present and greater than zero, specified the desired width of the pane area (not including internal padding). Otherwise, the maximum width of all panes is used.
uk: Якщо присутня та більша за нуль, указується бажана ширина області панелі (не враховуючи внутрішні відступи). В іншому випадку використовується максимальна ширина всіх панелей.

source: Tab Options
uk: Параметри вкладки

source: There are also specific options for tabs:
uk: Існують також спеціальні параметри для вкладок:

source: Either "normal", "disabled" or "hidden". If "disabled", then the tab is not selectable. If "hidden", then the tab is not shown.
uk: Або "нормальний", "відключений" або "прихований". Якщо "вимкнуто", вкладка не доступна для вибору. Якщо "приховано", вкладка не відображається.

source: sticky
uk: липкий

source: Specifies how the child window is positioned within the pane area. Value is a string containing zero or more of the characters "n", "s", "e" or "w". Each letter refers to a side (north, south, east or west) that the child window will stick to, as per the :meth:`grid` geometry manager.
uk: Визначає, як дочірнє вікно розташовується в області панелі. Значення - це рядок, що містить нуль або більше символів "n", "s", "e" або "w". Кожна літера вказує на сторону (північ, південь, схід або захід), якої дочірнє вікно дотримуватиметься відповідно до менеджера геометрії :meth:`grid`.

source: Specifies the amount of extra space to add between the notebook and this pane. Syntax is the same as for the option padding used by this widget.
uk: Визначає обсяг додаткового простору, який потрібно додати між блокнотом і цією панеллю. Синтаксис такий самий, як і для параметра padding, який використовується цим віджетом.

source: Specifies a text to be displayed in the tab.
uk: Визначає текст для відображення на вкладці.

source: Specifies an image to display in the tab. See the option image described in :class:`Widget`.
uk: Визначає зображення для відображення на вкладці. Перегляньте зображення опції, описане у :class:`Widget`.

source: Specifies how to display the image relative to the text, in the case both options text and image are present. See `Label Options`_ for legal values.
uk: Визначає спосіб відображення зображення відносно тексту, якщо присутні обидва параметри – текст і зображення. Перегляньте `Label Options`_ для правових значень.

source: Specifies the index (0-based) of a character to underline in the text string. The underlined character is used for mnemonic activation if :meth:`Notebook.enable_traversal` is called.
uk: Визначає індекс (від нуля) символу, який потрібно підкреслити в текстовому рядку. Підкреслений символ використовується для мнемонічної активації, якщо викликається :meth:`Notebook.enable_traversal`.

source: Tab Identifiers
uk: Ідентифікатори вкладок

source: The tab_id present in several methods of :class:`ttk.Notebook` may take any of the following forms:
uk: Tab_id, присутній у кількох методах :class:`ttk.Notebook`, може мати будь-яку з наступних форм:

source: An integer between zero and the number of tabs
uk: Ціле число від нуля до кількості вкладок

source: The name of a child window
uk: Ім'я дочірнього вікна

source: A positional specification of the form "@x,y", which identifies the tab
uk: Позиційна специфікація у формі "@x,y", яка ідентифікує вкладку

source: The literal string "current", which identifies the currently-selected tab
uk: Рядок літералу "current", який ідентифікує поточну вибрану вкладку

source: The literal string "end", which returns the number of tabs (only valid for :meth:`Notebook.index`)
uk: Рядок літералу "end", який повертає кількість вкладок (дійсно лише для :meth:`Notebook.index`)

source: Virtual Events
uk: Віртуальні події

source: This widget generates a **<<NotebookTabChanged>>** virtual event after a new tab is selected.
uk: Цей віджет генерує віртуальну подію **<<NotebookTabChanged>>** після вибору нової вкладки.

source: ttk.Notebook
uk: ттк.Зошит

source: Adds a new tab to the notebook.
uk: Додає нову вкладку до блокнота.

source: If window is currently managed by the notebook but hidden, it is restored to its previous position.
uk: Якщо вікно наразі керується блокнотом, але приховано, воно повертається до попереднього положення.

source: See `Tab Options`_ for the list of available options.
uk: Перегляньте Параметри вкладки (`Tab Options`_), щоб переглянути список доступних параметрів.

source: Removes the tab specified by *tab_id*, unmaps and unmanages the associated window.
uk: Видаляє вкладку, визначену *tab_id*, скасовує відповідне вікно та скасовує керування ним.

source: Hides the tab specified by *tab_id*.
uk: Приховує вкладку, визначену *tab_id*.

source: The tab will not be displayed, but the associated window remains managed by the notebook and its configuration remembered. Hidden tabs may be restored with the :meth:`add` command.
uk: Вкладка не відображатиметься, але пов’язане вікно й надалі керуватиметься ноутбуком, а його конфігурація буде збережена. Приховані вкладки можна відновити за допомогою команди :meth:`add`.

source: Returns the name of the tab element at position *x*, *y*, or the empty string if none.
uk: Повертає назву елемента вкладки в позиції *x*, *y* або порожній рядок, якщо його немає.

source: Returns the numeric index of the tab specified by *tab_id*, or the total number of tabs if *tab_id* is the string "end".
uk: Повертає числовий індекс вкладки, визначеної *tab_id*, або загальну кількість вкладок, якщо *tab_id* є рядком "end".

source: Inserts a pane at the specified position.
uk: Вставляє панель у вказане місце.

source: *pos* is either the string "end", an integer index, or the name of a managed child. If *child* is already managed by the notebook, moves it to the specified position.
uk: *pos* — це рядок "end", цілочисельний індекс або ім’я керованого дочірнього елемента. Якщо *child* вже керується блокнотом, переміщує його у вказане положення.

source: Selects the specified *tab_id*.
uk: Вибирає вказаний *tab_id*.

source: The associated child window will be displayed, and the previously-selected window (if different) is unmapped. If *tab_id* is omitted, returns the widget name of the currently selected pane.
uk: Буде відображено пов’язане дочірнє вікно, а попередньо вибране вікно (якщо інше) не буде відображено. Якщо *tab_id* опущено, повертає назву віджета поточної вибраної панелі.

source: Query or modify the options of the specific *tab_id*.
uk: Запитайте або змініть параметри конкретного *tab_id*.

source: If *kw* is not given, returns a dictionary of the tab option values. If *option* is specified, returns the value of that *option*. Otherwise, sets the options to the corresponding values.
uk: Якщо *kw* не вказано, повертає словник значень параметрів вкладки. Якщо вказано *option*, повертає значення цього *option*. В іншому випадку встановіть параметрам відповідні значення.

source: Returns a list of windows managed by the notebook.
uk: Повертає список вікон, якими керує блокнот.

source: Enable keyboard traversal for a toplevel window containing this notebook.
uk: Увімкнути обхід клавіатури для вікна верхнього рівня, що містить цей блокнот.

source: This will extend the bindings for the toplevel window containing the notebook as follows:
uk: Це розширить прив’язки для вікна верхнього рівня, що містить блокнот, наступним чином:

source: :kbd:`Control-Tab`: selects the tab following the currently selected one.
uk: :kbd:`Control-Tab`: вибирає вкладку, наступну за поточною.

source: :kbd:`Shift-Control-Tab`: selects the tab preceding the currently selected one.
uk: :kbd:`Shift-Control-Tab`: вибирає вкладку, що передує поточній вибраній.

source: :kbd:`Alt-K`: where *K* is the mnemonic (underlined) character of any tab, will select that tab.
uk: :kbd:`Alt-K`: де *K* — мнемонічний (підкреслений) символ будь-якої вкладки, вибере цю вкладку.

source: Multiple notebooks in a single toplevel may be enabled for traversal, including nested notebooks. However, notebook traversal only works properly if all panes have the notebook they are in as master.
uk: Кілька блокнотів на одному верхньому рівні можуть бути активовані для обходу, включаючи вкладені блокноти. Однак обхід блокнота працює належним чином, лише якщо на всіх панелях є блокнот, у якому вони знаходяться, як головний.

source: Progressbar
uk: Індикатор виконання

source: The :class:`ttk.Progressbar` widget shows the status of a long-running operation. It can operate in two modes: 1) the determinate mode which shows the amount completed relative to the total amount of work to be done and 2) the indeterminate mode which provides an animated display to let the user know that work is progressing.
uk: Віджет :class:`ttk.Progressbar` показує статус тривалої операції. Він може працювати в двох режимах: 1) визначений режим, який показує обсяг виконаної роботи по відношенню до загального обсягу роботи, яку потрібно виконати, і 2) невизначений режим, який забезпечує анімований дисплей, щоб повідомити користувачеві, що робота просувається.

source: orient
uk: схід

source: One of "horizontal" or "vertical". Specifies the orientation of the progress bar.
uk: Один із "горизонтальних" або "вертикальних". Визначає орієнтацію індикатора виконання.

source: length
uk: довжина

source: Specifies the length of the long axis of the progress bar (width if horizontal, height if vertical).
uk: Визначає довжину довгої осі індикатора перебігу (ширина, якщо горизонтальна, висота, якщо вертикальна).

source: mode
uk: режим

source: One of "determinate" or "indeterminate".
uk: Один із "визначених" або "невизначених".

source: maximum
uk: максимум

source: A number specifying the maximum value. Defaults to 100.
uk: Число, що визначає максимальне значення. За замовчуванням 100.

source: value
uk: значення

source: The current value of the progress bar. In "determinate" mode, this represents the amount of work completed. In "indeterminate" mode, it is interpreted as modulo *maximum*; that is, the progress bar completes one "cycle" when its value increases by *maximum*.
uk: Поточне значення індикатора виконання. У "визначеному" режимі це означає обсяг виконаної роботи. У "невизначеному" режимі воно інтерпретується як *максимум* за модулем; тобто індикатор прогресу завершує один "цикл", коли його значення збільшується на *максимум*.

source: variable
uk: змінна

source: A name which is linked to the option value. If specified, the value of the progress bar is automatically set to the value of this name whenever the latter is modified.
uk: Ім'я, пов'язане зі значенням опції. Якщо вказано, значення індикатора виконання автоматично встановлюється на значення цього імені щоразу, коли останнє змінюється.

source: phase
uk: фаза

source: Read-only option. The widget periodically increments the value of this option whenever its value is greater than 0 and, in determinate mode, less than maximum. This option may be used by the current theme to provide additional animation effects.
uk: Опція лише для читання. Віджет періодично збільшує значення цього параметра щоразу, коли його значення перевищує 0, а в режимі визначення менше максимального. Цей параметр може використовуватися поточною темою для надання додаткових ефектів анімації.

source: ttk.Progressbar
uk: ttk.Прогрессбар

source: Begin autoincrement mode: schedules a recurring timer event that calls :meth:`Progressbar.step` every *interval* milliseconds. If omitted, *interval* defaults to 50 milliseconds.
uk: Почати режим автоінкременту: планує повторювану подію таймера, яка викликає :meth:`Progressbar.step` кожні *інтервал* мілісекунд. Якщо опущено, *інтервал* за замовчуванням становить 50 мілісекунд.

source: Increments the progress bar's value by *amount*.
uk: Збільшує значення індикатора виконання на *кількість*.

source: *amount* defaults to 1.0 if omitted.
uk: *кількість* за замовчуванням дорівнює 1,0, якщо опущено.

source: Stop autoincrement mode: cancels any recurring timer event initiated by :meth:`Progressbar.start` for this progress bar.
uk: Зупинити режим автозбільшення: скасовує будь-яку повторювану подію таймера, ініційовану :meth:`Progressbar.start` для цього рядка виконання.

source: Separator
uk: Роздільник

source: The :class:`ttk.Separator` widget displays a horizontal or vertical separator bar.
uk: Віджет :class:`ttk.Separator` відображає горизонтальну або вертикальну роздільну панель.

source: It has no other methods besides the ones inherited from :class:`ttk.Widget`.
uk: Він не має інших методів, крім успадкованих від :class:`ttk.Widget`.

source: This widget accepts the following specific option:
uk: Цей віджет підтримує такі конкретні параметри:

source: One of "horizontal" or "vertical". Specifies the orientation of the separator.
uk: Один із "горизонтальних" або "вертикальних". Визначає орієнтацію роздільника.

source: The :class:`ttk.Sizegrip` widget (also known as a grow box) allows the user to resize the containing toplevel window by pressing and dragging the grip.
uk: Віджет :class:`ttk.Sizegrip` (також відомий як вікно зростання) дозволяє користувачеві змінювати розмір вікна верхнього рівня, натискаючи та перетягуючи ручку.

source: This widget has neither specific options nor specific methods, besides the ones inherited from :class:`ttk.Widget`.
uk: Цей віджет не має ані спеціальних параметрів, ані спеціальних методів, окрім успадкованих від :class:`ttk.Widget`.

source: Platform-specific notes
uk: Примітки щодо платформи

source: On macOS, toplevel windows automatically include a built-in size grip by default. Adding a :class:`Sizegrip` is harmless, since the built-in grip will just mask the widget.
uk: У macOS вікна верхнього рівня автоматично містять вбудовану ручку розміру за замовчуванням. Додавання :class:`Sizegrip` нешкідливо, оскільки вбудована рукоятка лише маскує віджет.

source: Bugs
uk: помилки

source: If the containing toplevel's position was specified relative to the right or bottom of the screen (e.g. ....), the :class:`Sizegrip` widget will not resize the window.
uk: Якщо положення верхнього рівня вмісту було вказано відносно правого або нижнього краю екрана (наприклад, ...), віджет :class:`Sizegrip` не змінюватиме розмір вікна.

source: This widget supports only "southeast" resizing.
uk: Цей віджет підтримує зміну розміру лише на "південний схід".

source: The :class:`ttk.Treeview` widget displays a hierarchical collection of items. Each item has a textual label, an optional image, and an optional list of data values. The data values are displayed in successive columns after the tree label.
uk: Віджет :class:`ttk.Treeview` відображає ієрархічну колекцію елементів. Кожен елемент має текстову позначку, необов’язкове зображення та необов’язковий список значень даних. Значення даних відображаються в послідовних стовпцях після мітки дерева.

source: The order in which data values are displayed may be controlled by setting the widget option ``displaycolumns``. The tree widget can also display column headings. Columns may be accessed by number or symbolic names listed in the widget option columns. See `Column Identifiers`_.
uk: Порядок, у якому відображаються значення даних, можна контролювати за допомогою параметра віджета ``displaycolumns``. Віджет дерева також може відображати заголовки стовпців. Доступ до стовпців можна отримати за номерами або символьними іменами, указаними в стовпцях параметрів віджета. Перегляньте Ідентифікатори стовпців (`Column Identifiers`_).

source: Each item is identified by a unique name. The widget will generate item IDs if they are not supplied by the caller. There is a distinguished root item, named ``{}``. The root item itself is not displayed; its children appear at the top level of the hierarchy.
uk: Кожен елемент ідентифікується унікальною назвою. Віджет генеруватиме ідентифікатори елементів, якщо вони не надані абонентом. Існує виділений кореневий елемент під назвою ``{}``. Сам кореневий елемент не відображається; його діти з'являються на верхньому рівні ієрархії.

source: Each item also has a list of tags, which can be used to associate event bindings with individual items and control the appearance of the item.
uk: Кожен елемент також має список тегів, які можна використовувати для пов’язування прив’язок подій до окремих елементів і керування зовнішнім виглядом елемента.

source: The Treeview widget supports horizontal and vertical scrolling, according to the options described in `Scrollable Widget Options`_ and the methods :meth:`Treeview.xview` and :meth:`Treeview.yview`.
uk: Віджет Treeview підтримує горизонтальне та вертикальне прокручування відповідно до параметрів, описаних у розділі `Параметри прокручуваних віджетів`_, і методів :meth:`Treeview.xview` і :meth:`Treeview.yview`.

source: columns
uk: колонки

source: A list of column identifiers, specifying the number of columns and their names.
uk: Список ідентифікаторів стовпців із зазначенням кількості стовпців та їхніх імен.

source: displaycolumns
uk: відображення стовпців

source: A list of column identifiers (either symbolic or integer indices) specifying which data columns are displayed and the order in which they appear, or the string "#all".
uk: Список ідентифікаторів стовпців (символічних або цілочисельних індексів), що вказують, які стовпці даних відображаються та порядок, у якому вони з’являються, або рядок "#all".

source: Specifies the number of rows which should be visible. Note: the requested width is determined from the sum of the column widths.
uk: Визначає кількість рядків, які мають бути видимими. Примітка: необхідна ширина визначається із суми ширин стовпців.

source: Specifies the internal padding for the widget. The padding is a list of up to four length specifications.
uk: Визначає внутрішнє доповнення для віджета. Заповнення — це список із до чотирьох специфікацій довжини.

source: Controls how the built-in class bindings manage the selection. One of "extended", "browse" or "none". If set to "extended" (the default), multiple items may be selected. If "browse", only a single item will be selected at a time. If "none", the selection will not be changed.
uk: Керує тим, як вбудовані зв’язки класів керують виділенням. Один із варіантів: "розширений", "перегляд" або "немає". Якщо встановлено значення "розширений" (за замовчуванням), можна вибрати кілька елементів. Якщо вибрати "перегляд", одночасно буде вибрано лише один елемент. Якщо "немає", вибір не буде змінено.

source: Note that the application code and tag bindings can set the selection however they wish, regardless of the value of this option.
uk: Зауважте, що код програми та прив’язки тегів можуть налаштовувати вибір як завгодно, незалежно від значення цього параметра.

source: show
uk: шоу

source: A list containing zero or more of the following values, specifying which elements of the tree to display.
uk: Список, що містить нуль або більше з наведених нижче значень, що визначає, які елементи дерева відображати.

source: tree: display tree labels in column #0.
uk: дерево: відображати мітки дерева в стовпці №0.

source: headings: display the heading row.
uk: заголовки: відображення рядка заголовка.

source: The default is "tree headings", i.e., show all elements.
uk: Типовим є "заголовки дерева", тобто показувати всі елементи.

source: **Note**: Column #0 always refers to the tree column, even if show="tree" is not specified.
uk: **Примітка**: стовпець №0 завжди стосується стовпця дерева, навіть якщо show="tree" не вказано.

source: Item Options
uk: Параметри предмета

source: The following item options may be specified for items in the insert and item widget commands.
uk: Наведені нижче параметри можна вказати для елементів у командах віджета вставки та елемента.

source: The textual label to display for the item.
uk: Текстова мітка для відображення елемента.

source: A Tk Image, displayed to the left of the label.
uk: Зображення Tk, що відображається ліворуч від мітки.

source: The list of values associated with the item.
uk: Список значень, пов’язаних з елементом.

source: Each item should have the same number of values as the widget option columns. If there are fewer values than columns, the remaining values are assumed empty. If there are more values than columns, the extra values are ignored.
uk: Кожен елемент має мати таку ж кількість значень, як і стовпці параметрів віджета. Якщо значень менше, ніж стовпців, решта значень вважатиметься порожніми. Якщо значень більше, ніж стовпців, додаткові значення ігноруються.

source: open
uk: ВІДЧИНЕНО

source: ``True``/``False`` value indicating whether the item's children should be displayed or hidden.
uk: Значення ``True``/``False``, що вказує, чи потрібно відображати або приховувати дочірні елементи елемента.

source: tags
uk: теги

source: A list of tags associated with this item.
uk: Список тегів, пов’язаних із цим елементом.
