Repository: python/python-docs-uk
Catalog: library/tkinter_ttk.po
Languages: uk

source: Specifies how the image is placed within the final parcel. spec contains zero or more characters "n", "s", "w", or "e".
uk: Визначає, як зображення розміщується в кінцевій посилці. spec містить нуль або більше символів "n", "s", "w" або "e".

source: width=width
uk: ширина=ширина

source: Specifies a minimum width for the element. If less than zero, the base image's width is used as a default.
uk: Визначає мінімальну ширину для елемента. Якщо значення менше нуля, за замовчуванням використовується ширина базового зображення.

source: If "from" is used as the value of *etype*, :meth:`element_create` will clone an existing element. *args* is expected to contain a themename, from which the element will be cloned, and optionally an element to clone from. If this element to clone from is not specified, an empty element will be used. *kw* is discarded.
uk: Якщо "from" використовується як значення *etype*, :meth:`element_create` клонує існуючий елемент. Очікується, що *args* міститиме ім’я теми, з якої буде клоновано елемент, і, за бажанням, елемент для клонування. Якщо цей елемент для клонування не вказано, буде використано порожній елемент. *kw* відкидається.

source: Returns the list of elements defined in the current theme.
uk: Повертає список елементів, визначених у поточній темі.

source: Returns the list of *elementname*'s options.
uk: Повертає список параметрів *elementname*.

source: Create a new theme.
uk: Створіть нову тему.

source: It is an error if *themename* already exists. If *parent* is specified, the new theme will inherit styles, elements and layouts from the parent theme. If *settings* are present they are expected to have the same syntax used for :meth:`theme_settings`.
uk: Це помилка, якщо *themenaname* вже існує. Якщо вказано *parent*, нова тема успадкує стилі, елементи та макети від батьківської теми. Якщо присутні *параметри*, очікується, що вони матимуть той самий синтаксис, який використовується для :meth:`theme_settings`.

source: Temporarily sets the current theme to *themename*, apply specified *settings* and then restore the previous theme.
uk: Тимчасово встановлює поточну тему на *themenaname*, застосовує вказані *налаштування*, а потім відновлює попередню тему.

source: Each key in *settings* is a style and each value may contain the keys 'configure', 'map', 'layout' and 'element create' and they are expected to have the same format as specified by the methods :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` and :meth:`Style.element_create` respectively.
uk: Кожен ключ у *settings* є стилем, і кожне значення може містити ключі 'configure', 'map', 'layout' і 'element create', і очікується, що вони матимуть той самий формат, який визначено методами :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` і :meth:`Style.element_create` відповідно.

source: As an example, let's change the Combobox for the default theme a bit::
uk: Як приклад, давайте трохи змінимо Combobox для теми за замовчуванням::

source: Returns a list of all known themes.
uk: Повертає список усіх відомих тем.

source: If *themename* is not given, returns the theme in use. Otherwise, sets the current theme to *themename*, refreshes all widgets and emits a <<ThemeChanged>> event.
uk: Якщо *themename* не вказано, повертає тему, що використовується. В іншому випадку встановлює поточну тему на *themenaname*, оновлює всі віджети та видає подію <<ThemeChanged>>.

source: Layouts
uk: Макети

source: A layout can be just ``None``, if it takes no options, or a dict of options specifying how to arrange the element. The layout mechanism uses a simplified version of the pack geometry manager: given an initial cavity, each element is allocated a parcel. Valid options/values are:
uk: Макет може бути просто ``None``, якщо він не має параметрів, або набір параметрів, що вказує, як розташувати елемент. Механізм компонування використовує спрощену версію менеджера геометрії упаковки: з урахуванням початкової порожнини кожному елементу виділяється ділянка. Допустимі параметри/значення:

source: side: whichside
uk: сторона: з якого боку

source: Specifies which side of the cavity to place the element; one of top, right, bottom or left. If omitted, the element occupies the entire cavity.
uk: Визначає, з якого боку порожнини розмістити елемент; зверху, справа, знизу або зліва. Якщо опущено, елемент займає всю порожнину.

source: sticky: nswe
uk: липкий: nswe

source: Specifies where the element is placed inside its allocated parcel.
uk: Визначає місце розміщення елемента всередині його виділеної ділянки.

source: unit: 0 or 1
uk: одиниця: 0 або 1

source: If set to 1, causes the element and all of its descendants to be treated as a single element for the purposes of :meth:`Widget.identify` et al. It's used for things like scrollbar thumbs with grips.
uk: Якщо встановлено значення 1, елемент і всі його нащадки розглядатимуться як єдиний елемент для цілей :meth:`Widget.identify` та ін. Він використовується для таких речей, як смуги прокрутки з ручками.

source: children: [sublayout... ]
uk: діти: [підрозділ... ]

source: Specifies a list of elements to place inside the element. Each element is a tuple (or other sequence type) where the first item is the layout name, and the other is a `Layout`_.
uk: Визначає список елементів для розміщення всередині елемента. Кожен елемент — це кортеж (або інший тип послідовності), де перший елемент — це назва макета, а інший — `Layout`_.
