Repository: python/python-docs-uk
Catalog: library/tkinter_font.po
Languages: uk

source: :mod:`!tkinter.font` --- Tkinter font wrapper
uk: :mod:`!tkinter.font` --- Обгортка шрифтів Tkinter

source: **Source code:** :source:`Lib/tkinter/font.py`
uk: **Вихідний код:** :source:`Lib/tkinter/font.py`

source: The :mod:`tkinter.font` module provides the :class:`Font` class for creating and using named fonts.
uk: Модуль :mod:`tkinter.font` надає клас :class:`Font` для створення та використання іменованих шрифтів.

source: The different font weights and slants are:
uk: Різні щільність і нахил шрифту:

source: The :class:`Font` class represents a named font. *Font* instances are given unique names and can be specified by their family, size, and style configuration. Named fonts are Tk's method of creating and identifying fonts as a single object, rather than specifying a font by its attributes with each occurrence.
uk: Клас :class:`Font` представляє іменований шрифт. Екземплярам *Font* присвоюються унікальні імена, і їх можна вказати за їх сімейством, розміром і конфігурацією стилю. Іменовані шрифти — це метод Tk для створення та ідентифікації шрифтів як єдиного об’єкта, а не визначення шрифту за його атрибутами при кожному входженні.

source: arguments:
uk: аргументи:

source: *font* - font specifier tuple (family, size, options)
uk: *font* - кортеж специфікатора шрифту (сімейство, розмір, параметри)

source: *name* - unique font name
uk: *name* - унікальна назва шрифту

source: *exists* - self points to existing named font if true
uk: *exists* - сам вказує на існуючий іменований шрифт, якщо істинно

source: additional keyword options (ignored if *font* is specified):
uk: додаткові параметри ключового слова (ігноруються, якщо вказано *font*):

source: *family* - font family i.e. Courier, Times
uk: *сімейство* - сімейство шрифтів, наприклад Courier, Times

source: *size* - font size
uk: *size* - розмір шрифту

source: If *size* is positive it is interpreted as size in points.
uk: Якщо *size* є додатним, це інтерпретується як розмір у балах.

source: If *size* is a negative number its absolute value is treated
uk: Якщо *розмір* є від’ємним числом, обробляється його абсолютне значення

source: as size in pixels.
uk: як розмір у пікселях.

source: *weight* - font emphasis (NORMAL, BOLD)
uk: *вага* - виділення шрифту (NORMAL, BOLD)

source: *slant* - ROMAN, ITALIC
uk: *нахил* - РИМСЬКИЙ, КУРСИВ

source: *underline* - font underlining (0 - none, 1 - underline)
uk: *підкреслення* - підкреслення шрифту (0 - немає, 1 - підкреслення)

source: *overstrike* - font strikeout (0 - none, 1 - strikeout)
uk: *overstrike* - закреслення шрифту (0 - немає, 1 - закреслення)

source: Return the attributes of the font.
uk: Повертає атрибути шрифту.

source: Retrieve an attribute of the font.
uk: Отримати атрибут шрифту.

source: Modify attributes of the font.
uk: Змінити атрибути шрифту.

source: Return new instance of the current font.
uk: Повернути новий екземпляр поточного шрифту.

source: Return amount of space the text would occupy on the specified display when formatted in the current font. If no display is specified then the main application window is assumed.
uk: Повертає обсяг простору, який текст займав би на вказаному дисплеї за умови форматування поточним шрифтом. Якщо дисплей не вказано, передбачається, що головне вікно програми.

source: Return font-specific data. Options include:
uk: Повертає дані про шрифт. Опції включають:

source: *ascent* - distance between baseline and highest point that a
uk: *підйом* - відстань між базовою лінією та найвищою точкою, що a

source: character of the font can occupy
uk: символ шрифту може займати

source: *descent* - distance between baseline and lowest point that a
uk: *спуск* - відстань між базовою лінією та найнижчою точкою, що a

source: *linespace* - minimum vertical separation necessary between any two
uk: *linespace* - мінімальний вертикальний відрив, необхідний між будь-якими двома

source: characters of the font that ensures no vertical overlap between lines.
uk: символи шрифту, який забезпечує відсутність вертикального перекриття між рядками.

source: *fixed* - 1 if font is fixed-width else 0
uk: *фіксований* - 1, якщо шрифт має фіксовану ширину, інакше 0

source: Return the different font families.
uk: Повернути різні сімейства шрифтів.

source: Return the names of defined fonts.
uk: Повертає назви визначених шрифтів.

source: Return a :class:`Font` representation of a tk named font.
uk: Повертає :class:`Font` представлення tk названого шрифту.

source: The *root* parameter was added.
uk: Додано параметр *root*.
