Repository: python/python-docs-uk
Catalog: library/tkinter_ttk.po
Languages: uk

source: :mod:`tkinter.ttk` --- Tk themed widgets
uk: :mod:`tkinter.ttk` --- Тематичні віджети Tk

source: **Source code:** :source:`Lib/tkinter/ttk.py`
uk: **Вихідний код:** :source:`Lib/tkinter/ttk.py`

source: The :mod:`tkinter.ttk` module provides access to the Tk themed widget set, introduced in Tk 8.5. If Python has not been compiled against Tk 8.5, this module can still be accessed if *Tile* has been installed. The former method using Tk 8.5 provides additional benefits including anti-aliased font rendering under X11 and window transparency (requiring a composition window manager on X11).
uk: Модуль :mod:`tkinter.ttk` надає доступ до набору тематичних віджетів Tk, представленого в Tk 8.5. Якщо Python не було скомпільовано з Tk 8.5, до цього модуля можна отримати доступ, якщо встановлено *Tile*. Перший метод із використанням Tk 8.5 надає додаткові переваги, включаючи рендеринг шрифтів із згладжуванням у X11 і прозорість вікна (вимагає диспетчера вікон композиції на X11).

source: The basic idea for :mod:`tkinter.ttk` is to separate, to the extent possible, the code implementing a widget's behavior from the code implementing its appearance.
uk: Основна ідея :mod:`tkinter.ttk` полягає в тому, щоб відокремити, наскільки це можливо, код, що реалізує поведінку віджета, від коду, що реалізує його вигляд.

source: A document introducing theming support for Tk
uk: Документ, який представляє підтримку тем для Tk

source: Using Ttk
uk: Використання Ttk

source: To start using Ttk, import its module::
uk: Щоб почати використовувати Ttk, імпортуйте його модуль::

source: To override the basic Tk widgets, the import should follow the Tk import::
uk: Щоб замінити базові віджети Tk, імпорт має слідувати за імпортом Tk::

source: That code causes several :mod:`tkinter.ttk` widgets (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` and :class:`Scrollbar`) to automatically replace the Tk widgets.
uk: Цей код викликає кілька віджетів :mod:`tkinter.ttk` (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` і :class:`Scrollbar`) для автоматичної заміни віджетів Tk.

source: This has the direct benefit of using the new widgets which gives a better look and feel across platforms; however, the replacement widgets are not completely compatible. The main difference is that widget options such as "fg", "bg" and others related to widget styling are no longer present in Ttk widgets. Instead, use the :class:`ttk.Style` class for improved styling effects.
uk: Це має безпосередню користь від використання нових віджетів, які надають кращий вигляд і відчуття на різних платформах; однак замінні віджети не є повністю сумісними. Основна відмінність полягає в тому, що параметри віджетів, такі як "fg", "bg" та інші, пов'язані зі стилями віджетів, більше не присутні у віджетах Ttk. Замість цього використовуйте клас :class:`ttk.Style` для покращення ефектів стилю.

source: `Converting existing applications to use Tile widgets <http://tktable.sourceforge.net/tile/doc/converting.txt>`_
uk: `Перетворення існуючих програм на використання віджетів Tile <http://tktable.sourceforge.net/tile/doc/converting.txt>`_

source: A monograph (using Tcl terminology) about differences typically encountered when moving applications to use the new widgets.
uk: Монографія (з використанням термінології Tcl) про відмінності, які зазвичай виникають під час переміщення програм на використання нових віджетів.

source: Ttk Widgets
uk: Віджети Ttk

source: Ttk comes with 18 widgets, twelve of which already existed in tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar`, and :class:`Spinbox`. The other six are new: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` and :class:`Treeview`. And all them are subclasses of :class:`Widget`.
uk: Ttk поставляється з 18 віджетами, дванадцять із яких уже існували в tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar` і :class:`Spinbox`. Інші шість нові: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` і :class:`Treeview`. І всі вони є підкласами :class:`Widget`.

source: Using the Ttk widgets gives the application an improved look and feel. As discussed above, there are differences in how the styling is coded.
uk: Використання віджетів Ttk покращує зовнішній вигляд програми. Як обговорювалося вище, існують відмінності в тому, як кодується стиль.

source: Tk code::
uk: Tk код::

source: Ttk code::
uk: Код Ttk::

source: For more information about TtkStyling_, see the :class:`Style` class documentation.
uk: Щоб дізнатися більше про TtkStyling_, перегляньте документацію класу :class:`Style`.

source: Widget
uk: Віджет

source: :class:`ttk.Widget` defines standard options and methods supported by Tk themed widgets and is not supposed to be directly instantiated.
uk: :class:`ttk.Widget` визначає стандартні опції та методи, які підтримуються віджетами на тему Tk, і не передбачається безпосередньо створювати екземпляри.

source: Standard Options
uk: Стандартні параметри

source: All the :mod:`ttk` Widgets accepts the following options:
uk: Усі віджети :mod:`ttk` приймають такі параметри:

source: Option
uk: Варіант

source: Description
uk: опис

source: class
uk: клас

source: Specifies the window class. The class is used when querying the option database for the window's other options, to determine the default bindtags for the window, and to select the widget's default layout and style. This option is read-only, and may only be specified when the window is created.
uk: Визначає клас вікна. Клас використовується під час запиту бази даних параметрів щодо інших параметрів вікна, щоб визначити теги прив’язки за замовчуванням для вікна та вибрати типовий макет і стиль віджета. Цей параметр доступний лише для читання, і його можна вказати лише під час створення вікна.

source: cursor
uk: курсор

source: Specifies the mouse cursor to be used for the widget. If set to the empty string (the default), the cursor is inherited for the parent widget.
uk: Визначає курсор миші, який буде використовуватися для віджета. Якщо встановлено порожній рядок (за замовчуванням), курсор успадковується для батьківського віджета.

source: takefocus
uk: зосередитися

source: Determines whether the window accepts the focus during keyboard traversal. 0, 1 or an empty string is returned. If 0 is returned, it means that the window should be skipped entirely during keyboard traversal. If 1, it means that the window should receive the input focus as long as it is viewable. And an empty string means that the traversal scripts make the decision about whether or not to focus on the window.
uk: Визначає, чи вікно приймає фокус під час обходу клавіатури. Повертається 0, 1 або порожній рядок. Якщо повертається 0, це означає, що вікно слід повністю пропустити під час обходу клавіатури. Якщо 1, це означає, що вікно має отримувати фокус введення, поки воно доступне для перегляду. А порожній рядок означає, що сценарії обходу приймають рішення про те, фокусуватись на вікні чи ні.

source: style
uk: стиль

source: May be used to specify a custom widget style.
uk: Може використовуватися для визначення власного стилю віджета.

source: Scrollable Widget Options
uk: Параметри віджета з можливістю прокручування

source: The following options are supported by widgets that are controlled by a scrollbar.
uk: Наступні параметри підтримуються віджетами, якими керує смуга прокрутки.

source: Used to communicate with horizontal scrollbars.
uk: Використовується для зв’язку з горизонтальними смугами прокручування.

source: When the view in the widget's window change, the widget will generate a Tcl command based on the scrollcommand.
uk: Коли вид у вікні віджета змінюється, віджет генеруватиме команду Tcl на основі команди прокручування.

source: Usually this option consists of the method :meth:`Scrollbar.set` of some scrollbar. This will cause the scrollbar to be updated whenever the view in the window changes.
uk: Зазвичай цей параметр складається з методу :meth:`Scrollbar.set` деякої смуги прокрутки. Це призведе до того, що смуга прокрутки оновлюватиметься щоразу, коли змінюватиметься вікно.

source: Used to communicate with vertical scrollbars. For some more information, see above.
uk: Використовується для зв’язку з вертикальними смугами прокручування. Додаткову інформацію див. вище.

source: Label Options
uk: Параметри етикетки

source: The following options are supported by labels, buttons and other button-like widgets.
uk: Наступні параметри підтримуються мітками, кнопками та іншими кнопкоподібними віджетами.

source: text
uk: текст

source: Specifies a text string to be displayed inside the widget.
uk: Визначає текстовий рядок, який буде відображатися всередині віджета.

source: textvariable
uk: текстова змінна

source: Specifies a name whose value will be used in place of the text option resource.
uk: Визначає ім’я, значення якого використовуватиметься замість текстового параметра ресурсу.

source: underline
uk: підкреслити

source: If set, specifies the index (0-based) of a character to underline in the text string. The underline character is used for mnemonic activation.
uk: Якщо встановлено, вказує індекс (від 0) символу, який потрібно підкреслити в текстовому рядку. Символ підкреслення використовується для мнемонічної активації.

source: image
uk: зображення

source: Specifies an image to display. This is a list of 1 or more elements. The first element is the default image name. The rest of the list if a sequence of statespec/value pairs as defined by :meth:`Style.map`, specifying different images to use when the widget is in a particular state or a combination of states. All images in the list should have the same size.
uk: Визначає зображення для відображення. Це список з 1 або більше елементів. Першим елементом є назва зображення за замовчуванням. Решта списку — це послідовність пар станів/значення, як визначено :meth:`Style.map`, із зазначенням різних зображень для використання, коли віджет перебуває в певному стані або комбінації станів. Усі зображення в списку повинні мати однаковий розмір.

source: compound
uk: з'єднання

source: Specifies how to display the image relative to the text, in the case both text and images options are present. Valid values are:
uk: Визначає спосіб відображення зображення відносно тексту, якщо присутні параметри як тексту, так і зображень. Допустимі значення:

source: text: display text only
uk: текст: відображати лише текст

source: image: display image only
uk: зображення: відображати лише зображення

source: top, bottom, left, right: display image above, below, left of, or right of the text, respectively.
uk: зверху, знизу, зліва, справа: відображення зображення вище, нижче, ліворуч або праворуч від тексту відповідно.

source: none: the default. display the image if present, otherwise the text.
uk: немає: за замовчуванням. відобразити зображення, якщо воно є, інакше текст.

source: width
uk: ширина

source: If greater than zero, specifies how much space, in character widths, to allocate for the text label, if less than zero, specifies a minimum width. If zero or unspecified, the natural width of the text label is used.
uk: Якщо значення більше нуля, указує, скільки місця (у ширині символів) потрібно виділити для текстової мітки, якщо значення менше нуля, указує мінімальну ширину. Якщо дорівнює нулю або не вказано, використовується природна ширина текстової мітки.

source: Compatibility Options
uk: Параметри сумісності

source: state
uk: стан

source: May be set to "normal" or "disabled" to control the "disabled" state bit. This is a write-only option: setting it changes the widget state, but the :meth:`Widget.state` method does not affect this option.
uk: Може бути встановлено на "normal" або "disabled" для керування бітом стану "disabled". Це параметр лише для запису: його встановлення змінює стан віджета, але метод :meth:`Widget.state` не впливає на цей параметр.

source: Widget States
uk: Віджети держав

source: The widget state is a bitmap of independent state flags.
uk: Стан віджета - це растрова карта незалежних прапорів стану.

source: Flag
uk: Прапор

source: active
uk: активний

source: The mouse cursor is over the widget and pressing a mouse button will cause some action to occur
uk: Курсор миші знаходиться над віджетом, і натискання кнопки миші призведе до виконання певної дії

source: disabled
uk: вимкнено

source: Widget is disabled under program control
uk: Віджет вимкнено під керуванням програми

source: focus
uk: фокус

source: Widget has keyboard focus
uk: Віджет має фокус клавіатури

source: pressed
uk: натиснутий

source: Widget is being pressed
uk: Віджет натискається

source: selected
uk: вибрано

source: "On", "true", or "current" for things like Checkbuttons and radiobuttons
uk: "Увімкнено", "справжнє" або "поточне" для таких речей, як Checkbuttons і радіокнопки

source: background
uk: фон

source: Windows and Mac have a notion of an "active" or foreground window. The *background* state is set for widgets in a background window, and cleared for those in the foreground window
uk: Windows і Mac мають поняття "активного" або вікна переднього плану. *Фоновий* стан встановлено для віджетів у фоновому вікні та знято для віджетів у вікні переднього плану

source: readonly
uk: лише для читання

source: Widget should not allow user modification
uk: Віджет не повинен дозволяти змінювати користувач

source: alternate
uk: чергувати

source: A widget-specific alternate display format
uk: Альтернативний формат відображення для віджетів

source: invalid
uk: недійсний

source: The widget's value is invalid
uk: Значення віджета недійсне

source: A state specification is a sequence of state names, optionally prefixed with an exclamation point indicating that the bit is off.
uk: Специфікація стану — це послідовність назв станів, необов’язково із знаком оклику, який вказує, що біт вимкнено.

source: ttk.Widget
uk: ttk.Віджет

source: Besides the methods described below, the :class:`ttk.Widget` supports the methods :meth:`tkinter.Widget.cget` and :meth:`tkinter.Widget.configure`.
uk: Окрім методів, описаних нижче, :class:`ttk.Widget` підтримує методи :meth:`tkinter.Widget.cget` і :meth:`tkinter.Widget.configure`.

source: Returns the name of the element at position *x* *y*, or the empty string if the point does not lie within any element.
uk: Повертає назву елемента в позиції *x* *y* або порожній рядок, якщо точка не лежить у жодному елементі.

source: *x* and *y* are pixel coordinates relative to the widget.
uk: *x* і *y* — координати пікселів відносно віджета.

source: Test the widget's state. If a callback is not specified, returns ``True`` if the widget state matches *statespec* and ``False`` otherwise. If callback is specified then it is called with args if widget state matches *statespec*.
uk: Перевірте стан віджета. Якщо зворотний виклик не вказано, повертає ``True``, якщо стан віджета відповідає *statespec*, і ``False`` в іншому випадку. Якщо вказано зворотний виклик, він викликається з аргументами, якщо стан віджета відповідає *statespec*.

source: Modify or inquire widget state. If *statespec* is specified, sets the widget state according to it and return a new *statespec* indicating which flags were changed. If *statespec* is not specified, returns the currently-enabled state flags.
uk: Змінити або запитати стан віджета. Якщо вказано *statespec*, встановлює стан віджета відповідно до нього та повертає новий *statespec* із зазначенням того, які прапорці було змінено. Якщо *statespec* не вказано, повертає поточні активні позначки стану.

source: *statespec* will usually be a list or a tuple.
uk: *statespec* зазвичай буде списком або кортежем.

source: Combobox
uk: Комбінований список

source: The :class:`ttk.Combobox` widget combines a text field with a pop-down list of values. This widget is a subclass of :class:`Entry`.
uk: Віджет :class:`ttk.Combobox` поєднує в собі текстове поле з розкривним списком значень. Цей віджет є підкласом :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Combobox`.
uk: Окрім методів, успадкованих від :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` і :meth:`Widget.state`, а також наступне, успадковане від :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, він має деякі інші методи, описані в :class:`ttk.Combobox`.

source: Options
uk: Опції

source: This widget accepts the following specific options:
uk: Цей віджет підтримує такі конкретні параметри:

source: exportselection
uk: експортний вибір

source: Boolean value. If set, the widget selection is linked to the Window Manager selection (which can be returned by invoking Misc.selection_get, for example).
uk: Логічне значення. Якщо встановлено, вибір віджета пов’язується з диспетчером вікон (який можна повернути, наприклад, викликом Misc.selection_get).

source: justify
uk: виправдати

source: Specifies how the text is aligned within the widget. One of "left", "center", or "right".
uk: Визначає спосіб вирівнювання тексту у віджеті. Один із "лівих", "центральних" або "правих".

source: height
uk: висота

source: Specifies the height of the pop-down listbox, in rows.
uk: Визначає висоту розкривного списку в рядках.

source: postcommand
uk: посткоманд

source: A script (possibly registered with Misc.register) that is called immediately before displaying the values. It may specify which values to display.
uk: Сценарій (можливо, зареєстрований у Misc.register), який викликається безпосередньо перед відображенням значень. Він може вказувати, які значення відображати.

source: One of "normal", "readonly", or "disabled". In the "readonly" state, the value may not be edited directly, and the user can only selection of the values from the dropdown list. In the "normal" state, the text field is directly editable. In the "disabled" state, no interaction is possible.
uk: Один із варіантів: "звичайний", "лише для читання" або "відключений". У стані "лише читання" значення не можна редагувати безпосередньо, і користувач може лише вибрати значення зі спадного списку. У "нормальному" стані текстове поле можна редагувати безпосередньо. У стані "вимкнено" взаємодія неможлива.

source: Specifies a name whose value is linked to the widget value. Whenever the value associated with that name changes, the widget value is updated, and vice versa. See :class:`tkinter.StringVar`.
uk: Визначає ім’я, значення якого пов’язане зі значенням віджета. Щоразу, коли змінюється значення, пов’язане з цією назвою, значення віджета оновлюється, і навпаки. Див. :class:`tkinter.StringVar`.

source: values
uk: значення

source: Specifies the list of values to display in the drop-down listbox.
uk: Визначає список значень для відображення у розкривному списку.

source: Specifies an integer value indicating the desired width of the entry window, in average-size characters of the widget's font.
uk: Визначає ціле число, що вказує бажану ширину вікна введення, у середніх символах шрифту віджета.

source: Virtual events
uk: Віртуальні події

source: The combobox widgets generates a **<<ComboboxSelected>>** virtual event when the user selects an element from the list of values.
uk: Віджети зі списком генерують віртуальну подію **<<ComboboxSelected>>**, коли користувач вибирає елемент зі списку значень.

source: If *newindex* is specified, sets the combobox value to the element position *newindex*. Otherwise, returns the index of the current value or -1 if the current value is not in the values list.
uk: Якщо вказано *newindex*, встановлює значення поля зі списком на позицію елемента *newindex*. В іншому випадку повертає індекс поточного значення або -1, якщо поточного значення немає в списку значень.

source: Returns the current value of the combobox.
uk: Повертає поточне значення поля зі списком.

source: Sets the value of the combobox to *value*.
uk: Встановлює для поля зі списком значення *value*.

source: The :class:`ttk.Spinbox` widget is a :class:`ttk.Entry` enhanced with increment and decrement arrows. It can be used for numbers or lists of string values. This widget is a subclass of :class:`Entry`.
uk: Віджет :class:`ttk.Spinbox` — це :class:`ttk.Entry`, доповнений стрілками збільшення та зменшення. Його можна використовувати для чисел або списків рядкових значень. Цей віджет є підкласом :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Spinbox`.
uk: Окрім методів, успадкованих від :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` і :meth:`Widget.state` і наступне, успадковане від :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, він має деякі інші методи, описані в :class:`ttk.Spinbox`.

source: from
uk: від

source: Float value. If set, this is the minimum value to which the decrement button will decrement. Must be spelled as ``from_`` when used as an argument, since ``from`` is a Python keyword.
uk: Плаваюче значення. Якщо встановлено, це мінімальне значення, до якого зменшуватиметься кнопка зменшення. Має бути написано як ``from_``, коли використовується як аргумент, оскільки ``from`` є ключовим словом Python.

source: to
uk: до

source: Float value. If set, this is the maximum value to which the increment button will increment.
uk: Плаваюче значення. Якщо встановлено, це максимальне значення, до якого збільшиться кнопка збільшення.

source: increment
uk: приріст

source: Float value. Specifies the amount which the increment/decrement buttons change the value. Defaults to 1.0.
uk: Плаваюче значення. Визначає величину, на яку кнопки збільшення/зменшення змінюють значення. За замовчуванням 1.0.

source: Sequence of string or float values. If specified, the increment/decrement buttons will cycle through the items in this sequence rather than incrementing or decrementing numbers.
uk: Послідовність рядкових чи плаваючих значень. Якщо вказано, кнопки збільшення/зменшення перемикатимуть елементи в цій послідовності, а не збільшуватимуть чи зменшуватимуть числа.

source: wrap
uk: загорнути
