Repository: python/python-docs-uk
Catalog: library/tkinter_dnd.po
Languages: uk

source: **Source code:** :source:`Lib/tkinter/dnd.py`
uk: **Вихідний код:** :source:`Lib/tkinter/dnd.py`

source: This is experimental and due to be deprecated when it is replaced with the Tk DND.
uk: Це є експериментальним і має бути застарілим, коли його буде замінено на Tk DND.

source: The :mod:`tkinter.dnd` module provides drag-and-drop support for objects within a single application, within the same window or between windows. To enable an object to be dragged, you must create an event binding for it that starts the drag-and-drop process. Typically, you bind a ButtonPress event to a callback function that you write (see :ref:`Bindings-and-Events`). The function should call :func:`dnd_start`, where 'source' is the object to be dragged, and 'event' is the event that invoked the call (the argument to your callback function).
uk: Модуль :mod:`tkinter.dnd` забезпечує підтримку перетягування об’єктів в одній програмі, в одному вікні або між вікнами. Щоб увімкнути перетягування об’єкта, необхідно створити для нього прив’язку події, яка запускає процес перетягування. Як правило, ви прив’язуєте подію ButtonPress до функції зворотного виклику, яку ви пишете (див. :ref:`Bindings-and-Events`). Функція має викликати :func:`dnd_start`, де "source" — це об’єкт, який потрібно перетягнути, а "event" — це подія, яка викликала виклик (аргумент вашої функції зворотного виклику).

source: Selection of a target object occurs as follows:
uk: Вибір цільового об'єкта відбувається наступним чином:

source: Top-down search of area under mouse for target widget
uk: Пошук зверху вниз області під курсором миші для цільового віджета

source: Target widget should have a callable *dnd_accept* attribute
uk: Цільовий віджет повинен мати атрибут *dnd_accept*, який можна викликати

source: Call to *<old_target>.dnd_leave(source, event)*
uk: Виклик * <old_target> .dnd_leave(джерело, подія)*

source: Call to *<new_target>.dnd_enter(source, event)*
uk: Виклик * <new_target> .dnd_enter(джерело, подія)*

source: Call to *<target>.dnd_commit(source, event)* to notify of drop
uk: Зателефонуйте на номер * <target> .dnd_commit(джерело, подія)*, щоб повідомити про скидання

source: Call to *<source>.dnd_end(target, event)* to signal end of drag-and-drop
uk: Виклик * <source> .dnd_end(target, event)*, щоб повідомити про закінчення перетягування

source: The *DndHandler* class handles drag-and-drop events tracking Motion and ButtonRelease events on the root of the event widget.
uk: Клас *DndHandler* обробляє події перетягування та відстеження подій Motion і ButtonRelease у корені віджета події.

source: Cancel the drag-and-drop process.
uk: Скасуйте процес перетягування.

source: Execute end of drag-and-drop functions.
uk: Виконати кінець функцій перетягування.

source: Inspect area below mouse for target objects while drag is performed.
uk: Під час перетягування перевірте область під мишею на наявність цільових об’єктів.

source: Signal end of drag when the release pattern is triggered.
uk: Сигнал про кінець перетягування, коли спрацьовує схема випуску.

source: Factory function for drag-and-drop process.
uk: Заводська функція для процесу перетягування.
