Repository: python/python-docs-uk
Catalog: library/tracemalloc.po
Languages: uk

source: :mod:`tracemalloc` --- Trace memory allocations
uk: :mod:`tracemalloc` --- Трасування виділення пам'яті

source: **Source code:** :source:`Lib/tracemalloc.py`
uk: **Вихідний код:** :source:`Lib/tracemalloc.py`

source: The tracemalloc module is a debug tool to trace memory blocks allocated by Python. It provides the following information:
uk: Модуль tracemalloc — це інструмент налагодження для відстеження блоків пам’яті, виділених Python. Він надає таку інформацію:

source: Traceback where an object was allocated
uk: Зворотне відстеження місця розміщення об’єкта

source: Statistics on allocated memory blocks per filename and per line number: total size, number and average size of allocated memory blocks
uk: Статистика виділених блоків пам'яті на ім'я файлу та номер рядка: загальний розмір, кількість і середній розмір виділених блоків пам'яті

source: Compute the differences between two snapshots to detect memory leaks
uk: Обчисліть різницю між двома знімками, щоб виявити витоки пам’яті

source: To trace most memory blocks allocated by Python, the module should be started as early as possible by setting the :envvar:`PYTHONTRACEMALLOC` environment variable to ``1``, or by using :option:`-X` ``tracemalloc`` command line option. The :func:`tracemalloc.start` function can be called at runtime to start tracing Python memory allocations.
uk: Для відстеження більшості блоків пам’яті, виділених Python, модуль слід запускати якомога раніше, встановивши змінну середовища :envvar:`PYTHONTRACEMALLOC` на ``1`` або використовуючи :option:`-X` ``tracemalloc`` параметр командного рядка. Функцію :func:`tracemalloc.start` можна викликати під час виконання, щоб розпочати відстеження розподілу пам’яті Python.

source: By default, a trace of an allocated memory block only stores the most recent frame (1 frame). To store 25 frames at startup: set the :envvar:`PYTHONTRACEMALLOC` environment variable to ``25``, or use the :option:`-X` ``tracemalloc=25`` command line option.
uk: За замовчуванням трасування виділеного блоку пам’яті зберігає лише останній кадр (1 кадр). Щоб зберегти 25 кадрів під час запуску: установіть для змінної середовища :envvar:`PYTHONTRACEMALLOC` значення ``25`` або скористайтеся параметром командного рядка :option:`-X` ``tracemalloc=25``.

source: Examples
uk: Приклади

source: Display the top 10
uk: Покажіть 10 найкращих

source: Display the 10 files allocating the most memory::
uk: Відобразити 10 файлів, які виділяють найбільше пам'яті:

source: Example of output of the Python test suite::
uk: Приклад результату набору тестів Python::

source: We can see that Python loaded ``4855 KiB`` data (bytecode and constants) from modules and that the :mod:`collections` module allocated ``244 KiB`` to build :class:`~collections.namedtuple` types.
uk: Ми бачимо, що Python завантажив дані ``4855 KiB`` (байт-код і константи) з модулів і що модуль :mod:`collections` виділив ``244 KiB`` для створення типів :class:`~collections.namedtuple`.

source: See :meth:`Snapshot.statistics` for more options.
uk: Перегляньте :meth:`Snapshot.statistics` для отримання додаткових параметрів.

source: Compute differences
uk: Обчислити відмінності

source: Take two snapshots and display the differences::
uk: Зробіть два знімки та покажіть відмінності:

source: Example of output before/after running some tests of the Python test suite::
uk: Приклад результату до/після виконання деяких тестів набору тестів Python::

source: We can see that Python has loaded ``8173 KiB`` of module data (bytecode and constants), and that this is ``4428 KiB`` more than had been loaded before the tests, when the previous snapshot was taken. Similarly, the :mod:`linecache` module has cached ``940 KiB`` of Python source code to format tracebacks, all of it since the previous snapshot.
uk: Ми бачимо, що Python завантажив ``8173 KiB`` даних модуля (байт-код і константи), і що це на ``4428 KiB`` більше, ніж було завантажено до тестів, коли було зроблено попередній знімок. Подібним чином модуль :mod:`linecache` кешував ``940 КіБ`` вихідного коду Python для форматування відстеження, усе це з попереднього знімка.

source: If the system has little free memory, snapshots can be written on disk using the :meth:`Snapshot.dump` method to analyze the snapshot offline. Then use the :meth:`Snapshot.load` method reload the snapshot.
uk: Якщо в системі мало вільної пам’яті, знімки можна записати на диск за допомогою методу :meth:`Snapshot.dump` для аналізу знімка в автономному режимі. Потім скористайтеся методом :meth:`Snapshot.load`, перезавантажте знімок.

source: Get the traceback of a memory block
uk: Отримати відстеження блоку пам'яті

source: Code to display the traceback of the biggest memory block::
uk: Код для відображення зворотного відстеження найбільшого блоку пам'яті::

source: Example of output of the Python test suite (traceback limited to 25 frames)::
uk: Приклад результату набору тестів Python (зворотне відстеження обмежено 25 кадрами):

source: We can see that the most memory was allocated in the :mod:`importlib` module to load data (bytecode and constants) from modules: ``870.1 KiB``. The traceback is where the :mod:`importlib` loaded data most recently: on the ``import pdb`` line of the :mod:`doctest` module. The traceback may change if a new module is loaded.
uk: Ми бачимо, що найбільше пам’яті було виділено в модулі :mod:`importlib` для завантаження даних (байт-код і константи) з модулів: ``870.1 KiB``. Трасування – це місце, де :mod:`importlib` завантажував дані останнім часом: у рядку ``import pdb`` модуля :mod:`doctest`. Трасування може змінитися, якщо завантажується новий модуль.

source: Pretty top
uk: Досить топ

source: Code to display the 10 lines allocating the most memory with a pretty output, ignoring ``<frozen importlib._bootstrap>`` and ``<unknown>`` files::
uk: Код для відображення 10 рядків, які виділяють найбільшу кількість пам’яті, з гарним виведенням, ігноруючи файли ``<frozen importlib._bootstrap>`` і ``<unknown>``::

source: Record the current and peak size of all traced memory blocks
uk: Запис поточного та пікового розміру всіх відстежених блоків пам’яті

source: The following code computes two sums like ``0 + 1 + 2 + ...`` inefficiently, by creating a list of those numbers. This list consumes a lot of memory temporarily. We can use :func:`get_traced_memory` and :func:`reset_peak` to observe the small memory usage after the sum is computed as well as the peak memory usage during the computations::
uk: Наступний код неефективно обчислює дві суми, такі як ``0 + 1 + 2 + ...``, створюючи список цих чисел. Цей список тимчасово займає багато пам’яті. Ми можемо використовувати :func:`get_traced_memory` і :func:`reset_peak`, щоб спостерігати за малим використанням пам’яті після обчислення суми, а також за максимальним використанням пам’яті під час обчислень:

source: Output::
uk: Вихід::

source: Using :func:`reset_peak` ensured we could accurately record the peak during the computation of ``small_sum``, even though it is much smaller than the overall peak size of memory blocks since the :func:`start` call. Without the call to :func:`reset_peak`, ``second_peak`` would still be the peak from the computation ``large_sum`` (that is, equal to ``first_peak``). In this case, both peaks are much higher than the final memory usage, and which suggests we could optimise (by removing the unnecessary call to :class:`list`, and writing ``sum(range(...))``).
uk: Використання :func:`reset_peak` гарантувало, що ми можемо точно записати пік під час обчислення ``small_sum``, навіть якщо він набагато менший, ніж загальний піковий розмір блоків пам’яті після виклику :func:`start`. Без виклику :func:`reset_peak`, ``second_peak`` все одно буде піком з обчислення ``large_sum`` (тобто рівним ``first_peak``). У цьому випадку обидва піки значно перевищують остаточне використання пам’яті, і це означає, що ми могли б оптимізувати (вилучивши непотрібний виклик :class:`list` і написавши ``sum(range(...))`` ).

source: Functions
uk: Функції

source: Clear traces of memory blocks allocated by Python.
uk: Очистити сліди блоків пам'яті, виділених Python.

source: See also :func:`stop`.
uk: Дивіться також :func:`stop`.

source: Get the traceback where the Python object *obj* was allocated. Return a :class:`Traceback` instance, or ``None`` if the :mod:`tracemalloc` module is not tracing memory allocations or did not trace the allocation of the object.
uk: Отримати зворотне відстеження, де було виділено об’єкт Python *obj*. Повертає екземпляр :class:`Traceback` або ``None``, якщо модуль :mod:`tracemalloc` не відстежує виділення пам’яті або не відстежує виділення об’єкта.

source: See also :func:`gc.get_referrers` and :func:`sys.getsizeof` functions.
uk: Дивіться також функції :func:`gc.get_referrers` і :func:`sys.getsizeof`.

source: Get the maximum number of frames stored in the traceback of a trace.
uk: Отримайте максимальну кількість кадрів, що зберігаються в зворотній трасі.

source: The :mod:`tracemalloc` module must be tracing memory allocations to get the limit, otherwise an exception is raised.
uk: Модуль :mod:`tracemalloc` має відстежувати виділення пам’яті, щоб отримати обмеження, інакше виникає виняткова ситуація.

source: The limit is set by the :func:`start` function.
uk: Обмеження встановлюється функцією :func:`start`.

source: Get the current size and peak size of memory blocks traced by the :mod:`tracemalloc` module as a tuple: ``(current: int, peak: int)``.
uk: Отримайте поточний розмір і максимальний розмір блоків пам’яті, які відстежуються модулем :mod:`tracemalloc`, як кортеж: ``(current: int, peak: int)``.

source: Set the peak size of memory blocks traced by the :mod:`tracemalloc` module to the current size.
uk: Установіть максимальний розмір блоків пам’яті, які відстежуються модулем :mod:`tracemalloc`, на поточний розмір.

source: Do nothing if the :mod:`tracemalloc` module is not tracing memory allocations.
uk: Нічого не робити, якщо модуль :mod:`tracemalloc` не відстежує виділення пам’яті.

source: This function only modifies the recorded peak size, and does not modify or clear any traces, unlike :func:`clear_traces`. Snapshots taken with :func:`take_snapshot` before a call to :func:`reset_peak` can be meaningfully compared to snapshots taken after the call.
uk: Ця функція лише змінює розмір записаного піку, але не змінює та не очищає жодні траси, на відміну від :func:`clear_traces`. Знімки, зроблені за допомогою :func:`take_snapshot` перед викликом :func:`reset_peak`, можна змістовно порівняти зі знімками, зробленими після виклику.

source: See also :func:`get_traced_memory`.
uk: Дивіться також :func:`get_traced_memory`.

source: Get the memory usage in bytes of the :mod:`tracemalloc` module used to store traces of memory blocks. Return an :class:`int`.
uk: Отримати дані про використання пам’яті в байтах модуля :mod:`tracemalloc`, який використовується для зберігання слідів блоків пам’яті. Повертає :class:`int`.

source: ``True`` if the :mod:`tracemalloc` module is tracing Python memory allocations, ``False`` otherwise.
uk: ``True``, якщо модуль :mod:`tracemalloc` відстежує виділення пам’яті Python, ``False`` інакше.

source: See also :func:`start` and :func:`stop` functions.
uk: Дивіться також функції :func:`start` і :func:`stop`.

source: Start tracing Python memory allocations: install hooks on Python memory allocators. Collected tracebacks of traces will be limited to *nframe* frames. By default, a trace of a memory block only stores the most recent frame: the limit is ``1``. *nframe* must be greater or equal to ``1``.
uk: Почніть відстежувати виділення пам’яті Python: установіть перехоплювачі на розподільниках пам’яті Python. Зібрані зворотні трасування трасувань будуть обмежені кадрами *nframe*. За замовчуванням трасування блоку пам’яті зберігає лише останній кадр: обмеження становить ``1``. *nframe* має бути більше або дорівнювати ``1``.

source: You can still read the original number of total frames that composed the traceback by looking at the :attr:`Traceback.total_nframe` attribute.
uk: Ви все ще можете прочитати вихідну загальну кількість кадрів, які склали відстеження, переглянувши атрибут :attr:`Traceback.total_nframe`.

source: Storing more than ``1`` frame is only useful to compute statistics grouped by ``'traceback'`` or to compute cumulative statistics: see the :meth:`Snapshot.compare_to` and :meth:`Snapshot.statistics` methods.
uk: Зберігання більш ніж 1 кадру корисне лише для обчислення статистики, згрупованої за ``'traceback'`` або для обчислення сукупної статистики: перегляньте методи :meth:`Snapshot.compare_to` і :meth:`Snapshot.statistics` .

source: Storing more frames increases the memory and CPU overhead of the :mod:`tracemalloc` module. Use the :func:`get_tracemalloc_memory` function to measure how much memory is used by the :mod:`tracemalloc` module.
uk: Зберігання більшої кількості кадрів збільшує навантаження на пам’ять і ЦП модуля :mod:`tracemalloc`. Використовуйте функцію :func:`get_tracemalloc_memory`, щоб виміряти, скільки пам’яті використовується модулем :mod:`tracemalloc`.

source: The :envvar:`PYTHONTRACEMALLOC` environment variable (``PYTHONTRACEMALLOC=NFRAME``) and the :option:`-X` ``tracemalloc=NFRAME`` command line option can be used to start tracing at startup.
uk: Змінну середовища :envvar:`PYTHONTRACEMALLOC` (``PYTHONTRACEMALLOC=NFRAME``) і параметр командного рядка :option:`-X` ``tracemalloc=NFRAME`` можна використовувати для запуску трасування під час запуску.

source: See also :func:`stop`, :func:`is_tracing` and :func:`get_traceback_limit` functions.
uk: Дивіться також функції :func:`stop`, :func:`is_tracing` і :func:`get_traceback_limit`.

source: Stop tracing Python memory allocations: uninstall hooks on Python memory allocators. Also clears all previously collected traces of memory blocks allocated by Python.
uk: Зупиніть відстеження розподілу пам’яті Python: видаліть перехоплювачі розподільників пам’яті Python. Також очищає всі раніше зібрані сліди блоків пам’яті, виділених Python.

source: Call :func:`take_snapshot` function to take a snapshot of traces before clearing them.
uk: Викличте функцію :func:`take_snapshot`, щоб зробити знімок слідів перед їх очищенням.

source: See also :func:`start`, :func:`is_tracing` and :func:`clear_traces` functions.
uk: Дивіться також функції :func:`start`, :func:`is_tracing` і :func:`clear_traces`.

source: Take a snapshot of traces of memory blocks allocated by Python. Return a new :class:`Snapshot` instance.
uk: Зробіть знімок слідів блоків пам’яті, виділених Python. Повернути новий екземпляр :class:`Snapshot`.

source: The snapshot does not include memory blocks allocated before the :mod:`tracemalloc` module started to trace memory allocations.
uk: Знімок не включає блоки пам’яті, виділені до того, як модуль :mod:`tracemalloc` почав відстежувати виділення пам’яті.

source: Tracebacks of traces are limited to :func:`get_traceback_limit` frames. Use the *nframe* parameter of the :func:`start` function to store more frames.
uk: Відстеження трасування обмежено кадрами :func:`get_traceback_limit`. Щоб зберегти більше кадрів, використовуйте параметр *nframe* функції :func:`start`.

source: The :mod:`tracemalloc` module must be tracing memory allocations to take a snapshot, see the :func:`start` function.
uk: Модуль :mod:`tracemalloc` повинен відстежувати виділення пам’яті, щоб зробити знімок, дивіться функцію :func:`start`.

source: See also the :func:`get_object_traceback` function.
uk: Дивіться також функцію :func:`get_object_traceback`.

source: Filter traces of memory blocks by their address space (domain).
uk: Фільтрувати сліди блоків пам'яті за їх адресним простором (доменом).

source: If *inclusive* is ``True`` (include), match memory blocks allocated in the address space :attr:`domain`.
uk: Якщо *inclusive* має значення ``True`` (include), збігаються блоки пам’яті, виділені в адресному просторі :attr:`domain`.

source: If *inclusive* is ``False`` (exclude), match memory blocks not allocated in the address space :attr:`domain`.
uk: Якщо *inclusive* має значення ``False`` (виключити), збігаються блоки пам’яті, не виділені в адресному просторі :attr:`domain`.

source: Address space of a memory block (``int``). Read-only property.
uk: Адресний простір блоку пам'яті (``int``). Властивість лише для читання.

source: Filter
uk: фільтр

source: Filter on traces of memory blocks.
uk: Фільтрувати сліди блоків пам'яті.

source: See the :func:`fnmatch.fnmatch` function for the syntax of *filename_pattern*. The ``'.pyc'`` file extension is replaced with ``'.py'``.
uk: Перегляньте функцію :func:`fnmatch.fnmatch`, щоб дізнатися про синтаксис *шаблон_назви_файлу*. Розширення файлу ``'.pyc'`` замінено на ``'.py'``.

source: Examples:
uk: приклади:

source: ``Filter(True, subprocess.__file__)`` only includes traces of the :mod:`subprocess` module
uk: ``Filter(True, subprocess.__file__)`` містить лише сліди модуля :mod:`subprocess`

source: ``Filter(False, tracemalloc.__file__)`` excludes traces of the :mod:`tracemalloc` module
uk: ``Filter(False, tracemalloc.__file__)`` виключає сліди модуля :mod:`tracemalloc`

source: ``Filter(False, "<unknown>")`` excludes empty tracebacks
uk: ``Filter(False, "<unknown>")`` виключає порожні відстеження

source: The ``'.pyo'`` file extension is no longer replaced with ``'.py'``.
uk: Розширення файлу ``'.pyo'`` більше не замінюється на ``'.py'``.

source: Added the :attr:`domain` attribute.
uk: Додано атрибут :attr:`domain`.

source: Address space of a memory block (``int`` or ``None``).
uk: Адресний простір блоку пам'яті (``int`` або ``None``).

source: tracemalloc uses the domain ``0`` to trace memory allocations made by Python. C extensions can use other domains to trace other resources.
uk: tracemalloc використовує домен ``0`` для відстеження розподілу пам’яті, зробленого Python. Розширення C можуть використовувати інші домени для відстеження інших ресурсів.

source: If *inclusive* is ``True`` (include), only match memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
uk: Якщо *inclusive* має значення ``True`` (include), збігаються лише блоки пам’яті, виділені у файлі з іменем, яке відповідає :attr:`filename_pattern` у номері рядка :attr:`lineno`.

source: If *inclusive* is ``False`` (exclude), ignore memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
uk: Якщо *inclusive* має значення ``False`` (виключити), ігнорувати блоки пам’яті, виділені у файлі з іменем, яке відповідає :attr:`filename_pattern` у номері рядка :attr:`lineno`.

source: Line number (``int``) of the filter. If *lineno* is ``None``, the filter matches any line number.
uk: Номер рядка (``int``) фільтра. Якщо *lineno* має значення ``None``, фільтр відповідає будь-якому номеру рядка.

source: Filename pattern of the filter (``str``). Read-only property.
uk: Шаблон імені файлу фільтра (``str``). Властивість лише для читання.

source: If *all_frames* is ``True``, all frames of the traceback are checked. If *all_frames* is ``False``, only the most recent frame is checked.
uk: Якщо *all_frames* має значення ``True``, перевіряються всі кадри зворотного відстеження. Якщо *all_frames* має значення ``False``, перевіряється лише останній кадр.

source: This attribute has no effect if the traceback limit is ``1``. See the :func:`get_traceback_limit` function and :attr:`Snapshot.traceback_limit` attribute.
uk: Цей атрибут не діє, якщо обмеження зворотного відстеження дорівнює ``1``. Перегляньте функцію :func:`get_traceback_limit` і атрибут :attr:`Snapshot.traceback_limit`.

source: Frame
uk: рамка

source: Frame of a traceback.
uk: Рамка трасування.

source: The :class:`Traceback` class is a sequence of :class:`Frame` instances.
uk: Клас :class:`Traceback` — це послідовність екземплярів :class:`Frame`.

source: Filename (``str``).
uk: Ім'я файлу (``str``).

source: Line number (``int``).
uk: Номер рядка (``int``).

source: Snapshot
uk: знімок

source: Snapshot of traces of memory blocks allocated by Python.
uk: Знімок слідів блоків пам'яті, виділених Python.

source: The :func:`take_snapshot` function creates a snapshot instance.
uk: Функція :func:`take_snapshot` створює екземпляр знімка.

source: Compute the differences with an old snapshot. Get statistics as a sorted list of :class:`StatisticDiff` instances grouped by *key_type*.
uk: Обчисліть різницю за старим знімком. Отримати статистику як відсортований список екземплярів :class:`StatisticDiff`, згрупованих за *key_type*.

source: See the :meth:`Snapshot.statistics` method for *key_type* and *cumulative* parameters.
uk: Перегляньте метод :meth:`Snapshot.statistics` для параметрів *key_type* і *cumulative*.

source: The result is sorted from the biggest to the smallest by: absolute value of :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, absolute value of :attr:`StatisticDiff.count_diff`, :attr:`Statistic.count` and then by :attr:`StatisticDiff.traceback`.
uk: Результат сортується від найбільшого до найменшого за: абсолютним значенням :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, абсолютним значенням :attr:`StatisticDiff.count_diff`, :attr:`Statistic .count`, а потім :attr:`StatisticDiff.traceback`.

source: Write the snapshot into a file.
uk: Запишіть знімок у файл.

source: Use :meth:`load` to reload the snapshot.
uk: Використовуйте :meth:`load`, щоб перезавантажити знімок.

source: Create a new :class:`Snapshot` instance with a filtered :attr:`traces` sequence, *filters* is a list of :class:`DomainFilter` and :class:`Filter` instances. If *filters* is an empty list, return a new :class:`Snapshot` instance with a copy of the traces.
uk: Створіть новий екземпляр :class:`Snapshot` із відфільтрованою послідовністю :attr:`traces`, *filters* — це список екземплярів :class:`DomainFilter` і :class:`Filter`. Якщо *filters* є порожнім списком, поверніть новий екземпляр :class:`Snapshot` із копією трасувань.

source: All inclusive filters are applied at once, a trace is ignored if no inclusive filters match it. A trace is ignored if at least one exclusive filter matches it.
uk: Усі включені фільтри застосовуються одразу, трасування ігнорується, якщо жодні включені фільтри не відповідають йому. Трасування ігнорується, якщо йому відповідає хоча б один ексклюзивний фільтр.

source: :class:`DomainFilter` instances are now also accepted in *filters*.
uk: Екземпляри :class:`DomainFilter` тепер також приймаються в *filters*.

source: Load a snapshot from a file.
uk: Завантажте знімок із файлу.

source: See also :meth:`dump`.
uk: Дивіться також :meth:`dump`.

source: Get statistics as a sorted list of :class:`Statistic` instances grouped by *key_type*:
uk: Отримати статистику як відсортований список екземплярів :class:`Statistic`, згрупованих за *key_type*:

source: description
uk: опис

source: ``'filename'``
uk: ``'ім'я файлу'``

source: filename
uk: ім'я файлу

source: ``'lineno'``
uk: ``''лінено'``

source: filename and line number
uk: ім'я файлу та номер рядка

source: ``'traceback'``
uk: ``'відстеження''``

source: traceback
uk: простежити

source: If *cumulative* is ``True``, cumulate size and count of memory blocks of all frames of the traceback of a trace, not only the most recent frame. The cumulative mode can only be used with *key_type* equals to ``'filename'`` and ``'lineno'``.
uk: Якщо *cumulative* має значення ``True``, кумулювати розмір і кількість блоків пам’яті всіх кадрів зворотного відстеження трасування, а не лише останнього кадру. Кумулятивний режим можна використовувати лише з *key_type*, що дорівнює ``'filename'`` і ``'lineno'``.
