Repository: python/python-docs-uk
Catalog: library/trace.po
Languages: uk

source: **Source code:** :source:`Lib/trace.py`
uk: **Вихідний код:** :source:`Lib/trace.py`

source: The :mod:`trace` module allows you to trace program execution, generate annotated statement coverage listings, print caller/callee relationships and list functions executed during a program run. It can be used in another program or from the command line.
uk: Модуль :mod:`trace` дозволяє вам відстежувати виконання програми, генерувати списки охоплення анотованих інструкцій, друкувати зв’язки між викликами та функціями списку, що виконуються під час виконання програми. Його можна використовувати в іншій програмі або з командного рядка.

source: A popular third-party coverage tool that provides HTML output along with advanced features such as branch coverage.
uk: Популярний сторонній інструмент покриття, який забезпечує виведення HTML разом із розширеними функціями, такими як покриття гілок.

source: Command-Line Usage
uk: Використання командного рядка

source: The :mod:`trace` module can be invoked from the command line. It can be as simple as ::
uk: Модуль :mod:`trace` можна викликати з командного рядка. Це може бути так просто::

source: The above will execute :file:`somefile.py` and generate annotated listings of all Python modules imported during the execution into the current directory.
uk: Вищезазначене виконає :file:`somefile.py` і створить анотовані списки всіх модулів Python, імпортованих під час виконання в поточний каталог.

source: Display usage and exit.
uk: Показ використання та вихід.

source: Display the version of the module and exit.
uk: Відображення версії модуля та вихід.

source: Added ``--module`` option that allows to run an executable module.
uk: Додано параметр ``--module``, який дозволяє запускати виконуваний модуль.

source: Main options
uk: Основні параметри

source: At least one of the following options must be specified when invoking :mod:`trace`. The :option:`--listfuncs <-l>` option is mutually exclusive with the :option:`--trace <-t>` and :option:`--count <-c>` options. When :option:`--listfuncs <-l>` is provided, neither :option:`--count <-c>` nor :option:`--trace <-t>` are accepted, and vice versa.
uk: Під час виклику :mod:`trace` необхідно вказати принаймні одну з наступних опцій. Опція :option:`--listfuncs <-l>` є взаємовиключною з опціями :option:`--trace <-t>` і :option:`--count <-c>`. Коли надається :option:`--listfuncs <-l>`, ні :option:`--count <-c>`, ні :option:`--trace <-t>` не приймаються, і навпаки.

source: Produce a set of annotated listing files upon program completion that shows how many times each statement was executed. See also :option:`--coverdir <-C>`, :option:`--file <-f>` and :option:`--no-report <-R>` below.
uk: Після завершення програми створити набір анотованих файлів списку, який показує, скільки разів було виконано кожен оператор. Дивіться також :option:`--coverdir <-C>`, :option:`--file <-f>` і :option:`--no-report <-R>` нижче.

source: Display lines as they are executed.
uk: Відображення рядків у міру їх виконання.

source: Display the functions executed by running the program.
uk: Відображення функцій, які виконуються під час запуску програми.

source: Produce an annotated list from an earlier program run that used the :option:`--count <-c>` and :option:`--file <-f>` option. This does not execute any code.
uk: Створіть анотований список із попередньої програми, яка використовувала параметри :option:`--count <-c>` і :option:`--file <-f>`. Це не виконує жодного коду.

source: Display the calling relationships exposed by running the program.
uk: Відображення зв’язків викликів, відкритих під час запуску програми.

source: Modifiers
uk: Модифікатори

source: Name of a file to accumulate counts over several tracing runs. Should be used with the :option:`--count <-c>` option.
uk: Ім'я файлу для накопичення підрахунків протягом кількох трасування. Слід використовувати з параметром :option:`--count <-c>`.

source: Directory where the report files go. The coverage report for ``package.module`` is written to file :file:`{dir}/{package}/{module}.cover`.
uk: Каталог, куди зберігаються файли звіту. Звіт про покриття для ``package.module`` записується у файл :file:`{dir}/{package}/{module}.cover`.

source: When generating annotated listings, mark lines which were not executed with ``>>>>>>``.
uk: Під час створення анотованих списків позначайте рядки, які не були виконані, ``>>>>>>``.

source: When using :option:`--count <-c>` or :option:`--report <-r>`, write a brief summary to stdout for each file processed.
uk: Якщо використовується :option:`--count <-c>` або :option:`--report <-r>`, напишіть короткий підсумок у stdout для кожного обробленого файлу.

source: Do not generate annotated listings. This is useful if you intend to make several runs with :option:`--count <-c>`, and then produce a single set of annotated listings at the end.
uk: Не створюйте анотовані списки. Це корисно, якщо ви маєте намір зробити кілька запусків за допомогою :option:`--count <-c>`, а потім створити єдиний набір анотованих списків у кінці.

source: Prefix each line with the time since the program started. Only used while tracing.
uk: Перед кожним рядком додайте час із моменту запуску програми. Використовується лише під час трасування.

source: Filters
uk: Фільтри

source: These options may be repeated multiple times.
uk: Ці параметри можна повторювати кілька разів.

source: Ignore each of the given module names and its submodules (if it is a package). The argument can be a list of names separated by a comma.
uk: Ігноруйте кожне з указаних імен модулів і його підмодулів (якщо це пакет). Аргументом може бути список імен, розділених комою.

source: Ignore all modules and packages in the named directory and subdirectories. The argument can be a list of directories separated by :data:`os.pathsep`.
uk: Ігноруйте всі модулі та пакунки в названому каталозі та підкаталогах. Аргументом може бути список каталогів, розділених :data:`os.pathsep`.

source: Programmatic Interface
uk: Програмний інтерфейс

source: Create an object to trace execution of a single statement or expression. All parameters are optional. *count* enables counting of line numbers. *trace* enables line execution tracing. *countfuncs* enables listing of the functions called during the run. *countcallers* enables call relationship tracking. *ignoremods* is a list of modules or packages to ignore. *ignoredirs* is a list of directories whose modules or packages should be ignored. *infile* is the name of the file from which to read stored count information. *outfile* is the name of the file in which to write updated count information. *timing* enables a timestamp relative to when tracing was started to be displayed.
uk: Створіть об’єкт для відстеження виконання окремого оператора або виразу. Усі параметри є необов’язковими. *count* дозволяє підрахувати номери рядків. *trace* дозволяє відстежувати виконання рядків. *countfuncs* дозволяє відобразити список функцій, викликаних під час виконання. *countcallers* дає змогу відстежувати взаємозв’язок викликів. *ignoremods* — це список модулів або пакетів, які потрібно ігнорувати. *ignoredirs* — це список каталогів, модулі чи пакунки яких слід ігнорувати. *infile* — це ім’я файлу, з якого читається збережена інформація про кількість. *outfile* — це ім’я файлу, у який потрібно записати оновлену інформацію про кількість. *час* дозволяє відображати мітку часу щодо початку трасування.

source: Execute the command and gather statistics from the execution with the current tracing parameters. *cmd* must be a string or code object, suitable for passing into :func:`exec`.
uk: Виконайте команду та зберіть статистику виконання з поточними параметрами трасування. *cmd* має бути рядком або кодовим об’єктом, придатним для передачі в :func:`exec`.

source: Execute the command and gather statistics from the execution with the current tracing parameters, in the defined global and local environments. If not defined, *globals* and *locals* default to empty dictionaries.
uk: Виконайте команду та зберіть статистику виконання з поточними параметрами трасування у визначених глобальних і локальних середовищах. Якщо не визначено, *globals* і *locals* за замовчуванням порожні словники.

source: Call *func* with the given arguments under control of the :class:`Trace` object with the current tracing parameters.
uk: Викликати *func* із заданими аргументами під керуванням об’єкта :class:`Trace` із поточними параметрами трасування.

source: Return a :class:`CoverageResults` object that contains the cumulative results of all previous calls to ``run``, ``runctx`` and ``runfunc`` for the given :class:`Trace` instance. Does not reset the accumulated trace results.
uk: Повертає об’єкт :class:`CoverageResults`, який містить сукупні результати всіх попередніх викликів ``run``, ``runctx`` і ``runfunc`` для даного екземпляра :class:`Trace`. Не скидає накопичені результати трасування.

source: A container for coverage results, created by :meth:`Trace.results`. Should not be created directly by the user.
uk: Контейнер для результатів покриття, створений :meth:`Trace.results`. Не має створюватися безпосередньо користувачем.

source: Merge in data from another :class:`CoverageResults` object.
uk: Об’єднати дані з іншого об’єкта :class:`CoverageResults`.

source: Write coverage results. Set *show_missing* to show lines that had no hits. Set *summary* to include in the output the coverage summary per module. *coverdir* specifies the directory into which the coverage result files will be output. If ``None``, the results for each source file are placed in its directory.
uk: Напишіть результати покриття. Встановіть *show_missing*, щоб показувати рядки, які не мали збігів. Встановіть *summary*, щоб включити до вихідних даних підсумок покриття для кожного модуля. *coverdir* вказує каталог, у який будуть виведені файли результатів покриття. Якщо ``None``, результати для кожного вихідного файлу розміщуються в його каталозі.

source: A simple example demonstrating the use of the programmatic interface::
uk: Простий приклад, що демонструє використання програмного інтерфейсу:
