Repository: python/python-docs-uk
Catalog: library/types.po
Languages: uk

source: **Source code:** :source:`Lib/types.py`
uk: **Вихідний код:** :source:`Lib/types.py`

source: This module defines utility functions to assist in dynamic creation of new types.
uk: Цей модуль визначає службові функції, які допомагають у динамічному створенні нових типів.

source: It also defines names for some object types that are used by the standard Python interpreter, but not exposed as builtins like :class:`int` or :class:`str` are.
uk: Він також визначає імена для деяких типів об’єктів, які використовуються стандартним інтерпретатором Python, але не представлені у вигляді вбудованих елементів, таких як :class:`int` або :class:`str`.

source: Finally, it provides some additional type-related utility classes and functions that are not fundamental enough to be builtins.
uk: Нарешті, він надає деякі додаткові пов’язані з типами службові класи та функції, які недостатньо фундаментальні, щоб бути вбудованими.

source: Dynamic Type Creation
uk: Динамічне створення типів

source: Creates a class object dynamically using the appropriate metaclass.
uk: Динамічно створює об’єкт класу за допомогою відповідного метакласу.

source: The first three arguments are the components that make up a class definition header: the class name, the base classes (in order), the keyword arguments (such as ``metaclass``).
uk: Перші три аргументи є компонентами, які складають заголовок визначення класу: ім’я класу, базові класи (по порядку), ключові аргументи (такі як ``метаклас``).

source: The *exec_body* argument is a callback that is used to populate the freshly created class namespace. It should accept the class namespace as its sole argument and update the namespace directly with the class contents. If no callback is provided, it has the same effect as passing in ``lambda ns: None``.
uk: Аргумент *exec_body* є зворотним викликом, який використовується для заповнення щойно створеного простору імен класу. Він повинен приймати простір імен класу як єдиний аргумент і оновлювати простір імен безпосередньо вмістом класу. Якщо зворотний виклик не надано, це матиме той самий ефект, що й передача ``lambda ns: None``.

source: Calculates the appropriate metaclass and creates the class namespace.
uk: Обчислює відповідний метаклас і створює простір імен класу.

source: The arguments are the components that make up a class definition header: the class name, the base classes (in order) and the keyword arguments (such as ``metaclass``).
uk: Аргументи — це компоненти, які складають заголовок визначення класу: ім’я класу, базові класи (по порядку) і ключові аргументи (такі як ``метаклас``).

source: The return value is a 3-tuple: ``metaclass, namespace, kwds``
uk: Повернене значення є кортежем із трьох: ``metaclass, namespace, kwds``

source: *metaclass* is the appropriate metaclass, *namespace* is the prepared class namespace and *kwds* is an updated copy of the passed in *kwds* argument with any ``'metaclass'`` entry removed. If no *kwds* argument is passed in, this will be an empty dict.
uk: *metaclass* — відповідний метаклас, *namespace* — це підготовлений простір імен класу, а *kwds* — це оновлена копія переданого аргументу *kwds* із видаленням будь-якого запису ``'metaclass'``. Якщо аргумент *kwds* не передано, це буде порожній dict.

source: The default value for the ``namespace`` element of the returned tuple has changed. Now an insertion-order-preserving mapping is used when the metaclass does not have a ``__prepare__`` method.
uk: Значення за замовчуванням для елемента ``простір імен`` повернутого кортежу змінено. Тепер відображення збереження порядку вставки використовується, коли метаклас не має методу ``__prepare__``.

source: Full details of the class creation process supported by these functions
uk: Повні відомості про процес створення класу, який підтримує ці функції

source: :pep:`3115` - Metaclasses in Python 3000
uk: :pep:`3115` - Метакласи в Python 3000

source: Introduced the ``__prepare__`` namespace hook
uk: Представлено хук простору імен ``__prepare__``

source: Resolve MRO entries dynamically as specified by :pep:`560`.
uk: Динамічно вирішувати записи MRO, як зазначено :pep:`560`.

source: Examples::
uk: Приклади::

source: :pep:`560` - Core support for typing module and generic types
uk: :pep:`560` - Основна підтримка модуля введення та загальних типів

source: Standard Interpreter Types
uk: Типи стандартних інтерпретаторів

source: This module provides names for many of the types that are required to implement a Python interpreter. It deliberately avoids including some of the types that arise only incidentally during processing such as the ``listiterator`` type.
uk: Цей модуль надає назви для багатьох типів, необхідних для реалізації інтерпретатора Python. Він навмисно уникає включення деяких типів, які виникають лише випадково під час обробки, таких як тип ``listiterator``.

source: Typical use of these names is for :func:`isinstance` or :func:`issubclass` checks.
uk: Зазвичай ці імена використовуються для перевірок :func:`isinstance` або :func:`issubclass`.

source: If you instantiate any of these types, note that signatures may vary between Python versions.
uk: Якщо ви створюєте екземпляр будь-якого з цих типів, зауважте, що підписи можуть відрізнятися в різних версіях Python.

source: Standard names are defined for the following types:
uk: Стандартні імена визначені для таких типів:

source: The type of :data:`None`.
uk: Тип :data:`None`.

source: The type of user-defined functions and functions created by :keyword:`lambda` expressions.
uk: Тип визначених користувачем функцій і функцій, створених виразами :keyword:`lambda`.

source: Raises an :ref:`auditing event <auditing>` ``function.__new__`` with argument ``code``.
uk: Викликає :ref:`подію аудиту <auditing>` ``function.__new__`` з аргументом ``code``.

source: The audit event only occurs for direct instantiation of function objects, and is not raised for normal compilation.
uk: Подія аудиту виникає лише для прямого створення екземплярів функціональних об’єктів і не виникає для звичайної компіляції.

source: The type of :term:`generator`-iterator objects, created by generator functions.
uk: Тип об’єктів :term:`generator`-iterator, створених функціями генератора.

source: The type of :term:`coroutine` objects, created by :keyword:`async def` functions.
uk: Тип об’єктів :term:`coroutine`, створених функціями :keyword:`async def`.

source: The type of :term:`asynchronous generator`-iterator objects, created by asynchronous generator functions.
uk: Тип об’єктів :term:`asynchronous generator`-iterator, створених функціями асинхронного генератора.

source: Raises an :ref:`auditing event <auditing>` ``code.__new__`` with arguments ``code``, ``filename``, ``name``, ``argcount``, ``posonlyargcount``, ``kwonlyargcount``, ``nlocals``, ``stacksize``, ``flags``.
uk: Викликає :ref:`подію аудиту <auditing>` ``code.__new__`` з аргументами ``code``, ``filename``, ``name``, ``argcount``, ``posonlyargcount``,``kwonlyargcount``, ``nlocals``, ``stacksize``, ``flags``.

source: Note that the audited arguments may not match the names or positions required by the initializer. The audit event only occurs for direct instantiation of code objects, and is not raised for normal compilation.
uk: Зауважте, що перевірені аргументи можуть не відповідати іменам або позиціям, які вимагає ініціалізатор. Подія аудиту виникає лише для прямого створення екземпляра об’єктів коду та не виникає для звичайної компіляції.

source: The type of methods of user-defined class instances.
uk: Тип методів екземплярів класу, визначеного користувачем.

source: The type of built-in functions like :func:`len` or :func:`sys.exit`, and methods of built-in classes. (Here, the term "built-in" means "written in C".)
uk: Тип вбудованих функцій, таких як :func:`len` або :func:`sys.exit`, і методи вбудованих класів. (Тут термін "вбудований" означає "написаний на C".)

source: The type of methods of some built-in data types and base classes such as :meth:`object.__init__` or :meth:`object.__lt__`.
uk: Тип методів деяких вбудованих типів даних і базових класів, таких як :meth:`object.__init__` або :meth:`object.__lt__`.

source: The type of *bound* methods of some built-in data types and base classes. For example it is the type of :code:`object().__str__`.
uk: Тип *зв'язаних* методів деяких вбудованих типів даних і базових класів. Наприклад, це тип :code:`object().__str__`.

source: The type of :data:`NotImplemented`.
uk: Тип :data:`NotImplemented`.

source: The type of methods of some built-in data types such as :meth:`str.join`.
uk: Тип методів деяких вбудованих типів даних, таких як :meth:`str.join`.

source: The type of *unbound* class methods of some built-in data types such as ``dict.__dict__['fromkeys']``.
uk: Тип *незв’язаних* методів класу деяких вбудованих типів даних, таких як ``dict.__dict__['fromkeys']``.

source: The type of :term:`modules <module>`. The constructor takes the name of the module to be created and optionally its :term:`docstring`.
uk: Тип :term:`modules <module>`. Конструктор приймає назву модуля, який буде створено, і, за бажанням, його :term:`docstring`.

source: The type of :data:`Ellipsis`.
uk: Тип :data:`Ellipsis`.

source: The type of :ref:`parameterized generics <types-genericalias>` such as ``list[int]``.
uk: Тип :ref:`параметризованих генериків <types-genericalias>`, наприклад ``list[int]``.

source: ``t_origin`` should be a non-parameterized generic class, such as ``list``, ``tuple`` or ``dict``. ``t_args`` should be a :class:`tuple` (possibly of length 1) of types which parameterize ``t_origin``::
uk: ``t_origin`` має бути непараметризованим загальним класом, таким як ``list``, ``tuple`` або ``dict``. ``t_args`` має бути :class:`tuple` (можливо, довжиною 1) типів, які параметризують ``t_origin``::

source: This type can now be subclassed.
uk: Цей тип тепер може бути підкласом.

source: :ref:`Generic Alias Types<types-genericalias>`
uk: :ref:`Загальні типи псевдонімів <types-genericalias>`

source: :pep:`585` - Type Hinting Generics In Standard Collections
uk: :pep:`585` - Універсальні підказки типів у стандартних колекціях

source: The type of :ref:`union type expressions<types-union>`.
uk: Тип :ref:`виразів типу union <types-union>`.

source: See :ref:`the language reference <traceback-objects>` for details of the available attributes and operations, and guidance on creating tracebacks dynamically.
uk: Перегляньте :ref:`мовну довідку <traceback-objects>`, щоб отримати детальну інформацію про доступні атрибути та операції, а також вказівки щодо динамічного створення трасування.

source: The type of objects defined in extension modules with ``PyMemberDef``, such as ``datetime.timedelta.days``. This type is used as descriptor for simple C data members which use standard conversion functions; it has the same purpose as the :class:`property` type, but for classes defined in extension modules.
uk: Тип об’єктів, визначених у модулях розширення за допомогою ``PyMemberDef``, наприклад ``datetime.timedelta.days``. Цей тип використовується як дескриптор для простих елементів даних C, які використовують стандартні функції перетворення; він має те саме призначення, що й тип :class:`property`, але для класів, визначених у модулях розширення.

source: In other implementations of Python, this type may be identical to ``GetSetDescriptorType``.
uk: В інших реалізаціях Python цей тип може бути ідентичним ``GetSetDescriptorType``.

source: Read-only proxy of a mapping. It provides a dynamic view on the mapping's entries, which means that when the mapping changes, the view reflects these changes.
uk: Проксі зіставлення лише для читання. Він забезпечує динамічний перегляд записів відображення, що означає, що коли відображення змінюється, подання відображає ці зміни.

source: Updated to support the new union (``|``) operator from :pep:`584`, which simply delegates to the underlying mapping.
uk: Оновлено для підтримки нового оператора об’єднання (``|``) з :pep:`584`, який просто делегує базове відображення.

source: Return ``True`` if the underlying mapping has a key *key*, else ``False``.
uk: Повертає ``True``, якщо базове зіставлення має ключ *key*, інакше ``False``.

source: Return the item of the underlying mapping with key *key*. Raises a :exc:`KeyError` if *key* is not in the underlying mapping.
uk: Поверніть елемент основного відображення за допомогою ключа *key*. Викликає :exc:`KeyError`, якщо *key* не в базовому відображенні.

source: Return an iterator over the keys of the underlying mapping. This is a shortcut for ``iter(proxy.keys())``.
uk: Повертає ітератор над ключами основного відображення. Це ярлик для ``iter(proxy.keys())``.

source: Return the number of items in the underlying mapping.
uk: Повертає кількість елементів у базовому відображенні.

source: Return a shallow copy of the underlying mapping.
uk: Повернути поверхневу копію основного відображення.

source: Return the value for *key* if *key* is in the underlying mapping, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
uk: Повертає значення для *key*, якщо *key* є в базовому відображенні, інакше *за замовчуванням*. Якщо *default* не вказано, за замовчуванням буде ``None``, тому цей метод ніколи не викликає :exc:`KeyError`.

source: Return a new view of the underlying mapping's items (``(key, value)`` pairs).
uk: Повертає нове подання базових елементів зіставлення (пар "(ключ, значення)").

source: Return a new view of the underlying mapping's keys.
uk: Повернути нове подання ключів основного зіставлення.

source: Return a new view of the underlying mapping's values.
uk: Повернути нове подання значень основного зіставлення.

source: Return a reverse iterator over the keys of the underlying mapping.
uk: Повертає зворотний ітератор над ключами основного відображення.

source: Additional Utility Classes and Functions
uk: Додаткові корисні класи та функції

source: A simple :class:`object` subclass that provides attribute access to its namespace, as well as a meaningful repr.
uk: Простий підклас :class:`object`, який забезпечує доступ атрибутів до свого простору імен, а також значуще відображення.

source: The type is roughly equivalent to the following code::
uk: Тип приблизно еквівалентний такому коду::

source: ``SimpleNamespace`` may be useful as a replacement for ``class NS: pass``. However, for a structured record type use :func:`~collections.namedtuple` instead.
uk: ``SimpleNamespace`` може бути корисним як заміна ``class NS: pass``. Однак для структурованого типу запису замість цього використовуйте :func:`~collections.namedtuple`.

source: Attribute order in the repr changed from alphabetical to insertion (like ``dict``).
uk: Порядок атрибутів у відображенні змінено з алфавітного на вставлення (наприклад, ``dict``).

source: Route attribute access on a class to __getattr__.
uk: Направте доступ до атрибутів класу до __getattr__.

source: This is a descriptor, used to define attributes that act differently when accessed through an instance and through a class. Instance access remains normal, but access to an attribute through a class will be routed to the class's __getattr__ method; this is done by raising AttributeError.
uk: Це дескриптор, який використовується для визначення атрибутів, які діють по-різному при доступі через примірник і через клас. Доступ до екземпляра залишається звичайним, але доступ до атрибута через клас буде направлено до методу __getattr__ класу; це робиться шляхом виклику AttributeError.

source: This allows one to have properties active on an instance, and have virtual attributes on the class with the same name (see :class:`enum.Enum` for an example).
uk: Це дозволяє мати активні властивості в екземплярі та мати віртуальні атрибути в класі з таким же іменем (див. :class:`enum.Enum` для прикладу).

source: Coroutine Utility Functions
uk: Корисні функції співпрограми

source: If *gen_func* is a generator function, it will be modified in-place.
uk: Якщо *gen_func* є функцією генератора, її буде змінено на місці.

source: If *gen_func* is not a generator function, it will be wrapped. If it returns an instance of :class:`collections.abc.Generator`, the instance will be wrapped in an *awaitable* proxy object. All other types of objects will be returned as is.
uk: Якщо *gen_func* не є функцією генератора, її буде загорнуто. Якщо він повертає екземпляр :class:`collections.abc.Generator`, екземпляр буде загорнутий в *очікуваний* проксі-об’єкт. Усі інші типи об’єктів буде повернено як є.

source: built-in function
uk: вбудована функція
