Repository: python/python-docs-uk
Catalog: library/unicodedata.po
Languages: uk

source: :mod:`unicodedata` --- Unicode Database
uk: :mod:`unicodedata` --- База даних Unicode

source: The module uses the same names and symbols as defined by Unicode Standard Annex #44, `"Unicode Character Database" <https://www.unicode.org/reports/tr44/>`_. It defines the following functions:
uk: Модуль використовує ті самі назви та символи, як визначено в стандартному додатку Юнікод №44, `"База даних символів Юнікоду" <https://www.unicode.org/reports/tr44/>`_. Він визначає такі функції:

source: Look up character by name. If a character with the given name is found, return the corresponding character. If not found, :exc:`KeyError` is raised.
uk: Шукайте персонажа по імені. Якщо символ із заданим іменем знайдено, повертає відповідний символ. Якщо не знайдено, виникає :exc:`KeyError`.

source: Support for name aliases [#]_ and named sequences [#]_ has been added.
uk: Додано підтримку псевдонімів імен [#]_ та іменованих послідовностей [#]_.

source: Returns the name assigned to the character *chr* as a string. If no name is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
uk: Повертає ім’я, призначене символу *chr* у вигляді рядка. Якщо ім’я не визначено, повертається *default* або, якщо не вказано, виникає :exc:`ValueError`.

source: Returns the decimal value assigned to the character *chr* as integer. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
uk: Повертає десяткове значення, призначене символу *chr* як ціле число. Якщо таке значення не визначено, повертається *default* або, якщо не вказано, виникає :exc:`ValueError`.

source: Returns the digit value assigned to the character *chr* as integer. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
uk: Повертає цифрове значення, призначене символу *chr* як ціле число. Якщо таке значення не визначено, повертається *default* або, якщо не вказано, виникає :exc:`ValueError`.

source: Returns the numeric value assigned to the character *chr* as float. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
uk: Повертає числове значення, призначене символу *chr* як float. Якщо таке значення не визначено, повертається *default* або, якщо не вказано, виникає :exc:`ValueError`.

source: Returns the general category assigned to the character *chr* as string.
uk: Повертає загальну категорію, призначену символу *chr* як рядок.

source: Returns the bidirectional class assigned to the character *chr* as string. If no such value is defined, an empty string is returned.
uk: Повертає двонаправлений клас, призначений символу *chr* як рядок. Якщо таке значення не визначено, повертається порожній рядок.

source: Returns the canonical combining class assigned to the character *chr* as integer. Returns ``0`` if no combining class is defined.
uk: Повертає канонічний клас об’єднання, призначений символу *chr* як ціле число. Повертає ``0``, якщо клас об'єднання не визначено.

source: Returns the east asian width assigned to the character *chr* as string.
uk: Повертає східноазіатську ширину, призначену символу *chr* як рядку.

source: Returns the mirrored property assigned to the character *chr* as integer. Returns ``1`` if the character has been identified as a "mirrored" character in bidirectional text, ``0`` otherwise.
uk: Повертає віддзеркалену властивість, призначену символу *chr* як ціле число. Повертає ``1``, якщо символ було визначено як "віддзеркалений" символ у двонаправленому тексті, ``0`` інакше.

source: Returns the character decomposition mapping assigned to the character *chr* as string. An empty string is returned in case no such mapping is defined.
uk: Повертає відображення розкладання символів, призначене символу *chr* як рядок. Якщо таке відображення не визначено, повертається порожній рядок.

source: Return the normal form *form* for the Unicode string *unistr*. Valid values for *form* are 'NFC', 'NFKC', 'NFD', and 'NFKD'.
uk: Повертає звичайну форму *form* для рядка Unicode *unistr*. Дійсні значення для *форми*: "NFC", "NFKC", "NFD" і "NFKD".

source: The Unicode standard defines various normalization forms of a Unicode string, based on the definition of canonical equivalence and compatibility equivalence. In Unicode, several characters can be expressed in various way. For example, the character U+00C7 (LATIN CAPITAL LETTER C WITH CEDILLA) can also be expressed as the sequence U+0043 (LATIN CAPITAL LETTER C) U+0327 (COMBINING CEDILLA).
uk: Стандарт Unicode визначає різні форми нормалізації рядка Unicode на основі визначення канонічної еквівалентності та еквівалентності сумісності. У Unicode декілька символів можуть бути виражені різними способами. Наприклад, символ U+00C7 (ВЕЛИКА ЛАТИНСЬКА ЛІТЕРА C ІЗ СЕДІЛЛОЮ) також можна виразити як послідовність U+0043 (ВЕЛИКА ЛАТИНСЬКА ЛІТЕРА C) U+0327 (ПОЄДНАННЯ СЕДІЛЛИ).

source: For each character, there are two normal forms: normal form C and normal form D. Normal form D (NFD) is also known as canonical decomposition, and translates each character into its decomposed form. Normal form C (NFC) first applies a canonical decomposition, then composes pre-combined characters again.
uk: Для кожного символу є дві нормальні форми: нормальна форма C і нормальна форма D. Нормальна форма D (NFD) також відома як канонічна декомпозиція та переводить кожен символ у його розкладену форму. Нормальна форма C (NFC) спочатку застосовує канонічну декомпозицію, а потім знову створює попередньо об’єднані символи.

source: In addition to these two forms, there are two additional normal forms based on compatibility equivalence. In Unicode, certain characters are supported which normally would be unified with other characters. For example, U+2160 (ROMAN NUMERAL ONE) is really the same thing as U+0049 (LATIN CAPITAL LETTER I). However, it is supported in Unicode for compatibility with existing character sets (e.g. gb2312).
uk: На додаток до цих двох форм існують ще дві додаткові нормальні форми, засновані на еквівалентності сумісності. У Unicode підтримуються певні символи, які зазвичай уніфікуються з іншими символами. Наприклад, U+2160 (РИМСЬКА ЦИФРА ОДИН) насправді те саме, що U+0049 (ЛАТИНСЬКА ВЕЛИКА ЛІТЕРА I). Однак він підтримується в Unicode для сумісності з існуючими наборами символів (наприклад, gb2312).

source: The normal form KD (NFKD) will apply the compatibility decomposition, i.e. replace all compatibility characters with their equivalents. The normal form KC (NFKC) first applies the compatibility decomposition, followed by the canonical composition.
uk: Нормальна форма KD (NFKD) застосує декомпозицію сумісності, тобто замінить усі символи сумісності їхніми еквівалентами. Нормальна форма KC (NFKC) спочатку застосовує розкладання сумісності, а потім канонічний склад.

source: Even if two unicode strings are normalized and look the same to a human reader, if one has combining characters and the other doesn't, they may not compare equal.
uk: Навіть якщо два рядки Unicode нормалізовані та виглядають однаково для людини, яка читає, якщо в одному є символи комбінування, а в іншому немає, вони можуть не порівнюватися.

source: Return whether the Unicode string *unistr* is in the normal form *form*. Valid values for *form* are 'NFC', 'NFKC', 'NFD', and 'NFKD'.
uk: Повертає, чи рядок Unicode *unistr* має звичайну форму *form*. Дійсні значення для *форми*: "NFC", "NFKC", "NFD" і "NFKD".

source: In addition, the module exposes the following constant:
uk: Крім того, модуль надає таку константу:

source: The version of the Unicode database used in this module.
uk: Версія бази даних Unicode, що використовується в цьому модулі.

source: This is an object that has the same methods as the entire module, but uses the Unicode database version 3.2 instead, for applications that require this specific version of the Unicode database (such as IDNA).
uk: Це об’єкт, який має ті самі методи, що й увесь модуль, але замість цього використовує базу даних Unicode версії 3.2 для програм, які потребують цієї конкретної версії бази даних Unicode (наприклад, IDNA).

source: Examples:
uk: приклади:

source: Footnotes
uk: Виноски
