Repository: python/python-docs-uk
Catalog: library/unittest.po
Languages: uk

source: The context manager will store the caught exception object in its :attr:`exception` attribute. This can be useful if the intention is to perform additional checks on the exception raised::
uk: Менеджер контексту збереже спійманий об’єкт винятку в своєму атрибуті :attr:`exception`. Це може бути корисним, якщо планується виконати додаткові перевірки викликаного винятку:

source: Added the ability to use :meth:`assertRaises` as a context manager.
uk: Додано можливість використовувати :meth:`assertRaises` як контекстний менеджер.

source: Added the :attr:`exception` attribute.
uk: Додано атрибут :attr:`exception`.

source: Added the *msg* keyword argument when used as a context manager.
uk: Додано аргумент ключового слова *msg*, коли він використовується як менеджер контексту.

source: Like :meth:`assertRaises` but also tests that *regex* matches on the string representation of the raised exception. *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`. Examples::
uk: Подібно до :meth:`assertRaises`, але також перевіряє, що *regex* відповідає рядковому представленню викликаного винятку. *regex* може бути об’єктом регулярного виразу або рядком, що містить регулярний вираз, придатний для використання :func:`re.search`. Приклади::

source: or::
uk: або::

source: Added under the name ``assertRaisesRegexp``.
uk: Додано під назвою ``assertRaisesRegexp``.

source: Renamed to :meth:`assertRaisesRegex`.
uk: Перейменовано на :meth:`assertRaisesRegex`.

source: Test that a warning is triggered when *callable* is called with any positional or keyword arguments that are also passed to :meth:`assertWarns`. The test passes if *warning* is triggered and fails if it isn't. Any exception is an error. To catch any of a group of warnings, a tuple containing the warning classes may be passed as *warnings*.
uk: Перевірте, чи спрацьовує попередження, коли *callable* викликається з будь-якими позиційними або ключовими аргументами, які також передаються до :meth:`assertWarns`. Тест проходить, якщо спрацьовує *попередження*, і не виконується, якщо ні. Будь-який виняток є помилкою. Щоб перехопити будь-яку групу попереджень, кортеж, що містить класи попереджень, можна передати як *попередження*.

source: If only the *warning* and possibly the *msg* arguments are given, return a context manager so that the code under test can be written inline rather than as a function::
uk: Якщо надано лише аргументи *попередження* і, можливо, *повідомлення*, поверніть диспетчер контексту, щоб тестований код можна було записати вбудовано, а не як функцію::

source: When used as a context manager, :meth:`assertWarns` accepts the additional keyword argument *msg*.
uk: У разі використання як менеджера контексту :meth:`assertWarns` приймає додатковий аргумент ключового слова *msg*.

source: The context manager will store the caught warning object in its :attr:`warning` attribute, and the source line which triggered the warnings in the :attr:`filename` and :attr:`lineno` attributes. This can be useful if the intention is to perform additional checks on the warning caught::
uk: Менеджер контексту збереже спійманий об’єкт попередження в атрибуті :attr:`warning`, а вихідний рядок, який викликав попередження, в атрибутах :attr:`filename` і :attr:`lineno`. Це може бути корисним, якщо планується виконати додаткові перевірки виявленого попередження:

source: This method works regardless of the warning filters in place when it is called.
uk: Цей метод працює незалежно від фільтрів попереджень під час його виклику.

source: Like :meth:`assertWarns` but also tests that *regex* matches on the message of the triggered warning. *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`. Example::
uk: Подібно до :meth:`assertWarns`, але також перевіряє відповідність *regex* у повідомленні викликаного попередження. *regex* може бути об’єктом регулярного виразу або рядком, що містить регулярний вираз, придатний для використання :func:`re.search`. Приклад::

source: A context manager to test that at least one message is logged on the *logger* or one of its children, with at least the given *level*.
uk: Менеджер контексту для перевірки того, що принаймні одне повідомлення зареєстровано в *реєстраторі* або одному з його дочірніх елементів, принаймні з заданим *рівнем*.

source: If given, *logger* should be a :class:`logging.Logger` object or a :class:`str` giving the name of a logger. The default is the root logger, which will catch all messages that were not blocked by a non-propagating descendent logger.
uk: Якщо задано, *logger* має бути об’єктом :class:`logging.Logger` або :class:`str`, що вказує назву реєстратора. За замовчуванням використовується кореневий реєстратор, який фіксуватиме всі повідомлення, які не були заблоковані нащадковим реєстратором без розповсюдження.

source: The test passes if at least one message emitted inside the ``with`` block matches the *logger* and *level* conditions, otherwise it fails.
uk: Тест проходить, якщо принаймні одне повідомлення, видане всередині блоку ``with``, відповідає умовам *logger* і *level*, в іншому випадку він не виконується.

source: The object returned by the context manager is a recording helper which keeps tracks of the matching log messages. It has two attributes:
uk: Об’єкт, який повертає менеджер контексту, є помічником запису, який відстежує відповідні повідомлення журналу. Він має два атрибути:

source: A list of :class:`logging.LogRecord` objects of the matching log messages.
uk: Список об’єктів :class:`logging.LogRecord` відповідних повідомлень журналу.

source: A list of :class:`str` objects with the formatted output of matching messages.
uk: Список об’єктів :class:`str` із відформатованим виведенням відповідних повідомлень.

source: Example::
uk: Приклад::

source: A context manager to test that no messages are logged on the *logger* or one of its children, with at least the given *level*.
uk: Менеджер контексту для перевірки того, що жодні повідомлення не реєструються в *реєстраторі* або одному з його дочірніх елементів, принаймні з заданим *рівнем*.

source: If given, *logger* should be a :class:`logging.Logger` object or a :class:`str` giving the name of a logger. The default is the root logger, which will catch all messages.
uk: Якщо задано, *logger* має бути об’єктом :class:`logging.Logger` або :class:`str`, що вказує назву реєстратора. Типовим є кореневий реєстратор, який фіксуватиме всі повідомлення.

source: Unlike :meth:`assertLogs`, nothing will be returned by the context manager.
uk: На відміну від :meth:`assertLogs`, контекстний менеджер нічого не повертатиме.

source: There are also other methods used to perform more specific checks, such as:
uk: Існують також інші методи, які використовуються для виконання більш конкретних перевірок, наприклад:

source: ``round(a-b, 7) != 0``
uk: ``округлення(a-b, 7) != 0``

source: ``not r.search(s)``
uk: ``не r.search(s)``

source: *a* and *b* have the same elements in the same number, regardless of their order.
uk: *a* і *b* містять однакові елементи в однаковій кількості, незалежно від їх порядку.

source: Test that *first* and *second* are approximately (or not approximately) equal by computing the difference, rounding to the given number of decimal *places* (default 7), and comparing to zero. Note that these methods round the values to the given number of *decimal places* (i.e. like the :func:`round` function) and not *significant digits*.
uk: Перевірте, що *перший* і *другий* приблизно (чи не приблизно) рівні, обчислюючи різницю, округляючи до вказаної кількості десяткових *розрядів* (за замовчуванням 7) і порівнюючи з нулем. Зауважте, що ці методи округлюють значення до заданої кількості *десяткових знаків* (тобто як функція :func:`round`), а не до *значущих цифр*.

source: If *delta* is supplied instead of *places* then the difference between *first* and *second* must be less or equal to (or greater than) *delta*.
uk: Якщо замість *розрядів* вказано *delta*, тоді різниця між *першим* і *другим* має бути менше або дорівнювати (або більше) *delta*.

source: Supplying both *delta* and *places* raises a :exc:`TypeError`.
uk: Надання *delta* і *places* викликає :exc:`TypeError`.

source: :meth:`assertAlmostEqual` automatically considers almost equal objects that compare equal. :meth:`assertNotAlmostEqual` automatically fails if the objects compare equal. Added the *delta* keyword argument.
uk: :meth:`assertAlmostEqual` автоматично вважає майже рівні об’єкти, які порівнюються рівними. :meth:`assertNotAlmostEqual` автоматично не виконується, якщо об’єкти порівнюються. Додано аргумент ключового слова *дельта*.

source: Test that *first* is respectively >, >=, < or <= than *second* depending on the method name. If not, the test will fail::
uk: Перевірте, що *first* відповідно >, >=, < або <= ніж *second* залежно від назви методу. Якщо ні, тест не пройде:

source: Test that a *regex* search matches (or does not match) *text*. In case of failure, the error message will include the pattern and the *text* (or the pattern and the part of *text* that unexpectedly matched). *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`.
uk: Перевірте, чи *регулярний вираз* пошуку відповідає (або не відповідає) *тексту*. У разі помилки повідомлення про помилку міститиме шаблон і *текст* (або шаблон і частину *тексту*, які неочікувано збіглися). *regex* може бути об’єктом регулярного виразу або рядком, що містить регулярний вираз, придатний для використання :func:`re.search`.

source: Added under the name ``assertRegexpMatches``.
uk: Додано під назвою ``assertRegexpMatches``.

source: The method ``assertRegexpMatches()`` has been renamed to :meth:`.assertRegex`.
uk: Метод ``assertRegexpMatches()`` було перейменовано на :meth:`.assertRegex`.

source: Test that sequence *first* contains the same elements as *second*, regardless of their order. When they don't, an error message listing the differences between the sequences will be generated.
uk: Перевірте, чи послідовність *first* містить ті самі елементи, що й *second*, незалежно від їх порядку. Якщо цього не зробити, буде згенеровано повідомлення про помилку з переліком відмінностей між послідовностями.

source: Duplicate elements are *not* ignored when comparing *first* and *second*. It verifies whether each element has the same count in both sequences. Equivalent to: ``assertEqual(Counter(list(first)), Counter(list(second)))`` but works with sequences of unhashable objects as well.
uk: Повторювані елементи *не* ігноруються під час порівняння *першого* та *другого*. Він перевіряє, чи кожен елемент має однакову кількість в обох послідовностях. Еквівалент: ``assertEqual(Counter(list(first)), Counter(list(second)))``, але також працює з послідовностями нехешованих об’єктів.

source: The :meth:`assertEqual` method dispatches the equality check for objects of the same type to different type-specific methods. These methods are already implemented for most of the built-in types, but it's also possible to register new methods using :meth:`addTypeEqualityFunc`:
uk: Метод :meth:`assertEqual` надсилає перевірку рівності для об’єктів одного типу до різних методів, що залежать від типу. Ці методи вже реалізовано для більшості вбудованих типів, але також можна зареєструвати нові методи за допомогою :meth:`addTypeEqualityFunc`:

source: Registers a type-specific method called by :meth:`assertEqual` to check if two objects of exactly the same *typeobj* (not subclasses) compare equal. *function* must take two positional arguments and a third msg=None keyword argument just as :meth:`assertEqual` does. It must raise :data:`self.failureException(msg) <failureException>` when inequality between the first two parameters is detected -- possibly providing useful information and explaining the inequalities in details in the error message.
uk: Реєструє специфічний для типу метод, викликаний :meth:`assertEqual`, щоб перевірити, чи порівнюються два об’єкти абсолютно однакового *typeobj* (не підкласи). *функція* має приймати два позиційних аргументи та третій аргумент ключового слова msg=None так само, як це робить :meth:`assertEqual`. Він повинен викликати :data:`self.failureException(msg) <failureException>`, коли виявлено нерівність між першими двома параметрами — можливо, надаючи корисну інформацію та докладно пояснюючи нерівності в повідомленні про помилку.

source: The list of type-specific methods automatically used by :meth:`~TestCase.assertEqual` are summarized in the following table. Note that it's usually not necessary to invoke these methods directly.
uk: Список специфічних для типу методів, які автоматично використовує :meth:`~TestCase.assertEqual`, підсумовано в наступній таблиці. Зауважте, що зазвичай не потрібно безпосередньо викликати ці методи.

source: Used to compare
uk: Використовується для порівняння

source: strings
uk: рядки

source: sequences
uk: послідовності

source: lists
uk: списки

source: tuples
uk: кортежі

source: sets or frozensets
uk: набори або заморожені набори

source: dicts
uk: дикт

source: Test that the multiline string *first* is equal to the string *second*. When not equal a diff of the two strings highlighting the differences will be included in the error message. This method is used by default when comparing strings with :meth:`assertEqual`.
uk: Перевірте, чи багаторядковий рядок *перший* дорівнює рядку *другий*. Якщо відмінність двох рядків не дорівнює, у повідомленні про помилку буде включено виділення відмінностей. Цей метод використовується за замовчуванням під час порівняння рядків із :meth:`assertEqual`.

source: Tests that two sequences are equal. If a *seq_type* is supplied, both *first* and *second* must be instances of *seq_type* or a failure will be raised. If the sequences are different an error message is constructed that shows the difference between the two.
uk: Перевіряє рівність двох послідовностей. Якщо вказано *seq_type*, і *first*, і *second* мають бути екземплярами *seq_type*, інакше виникне помилка. Якщо послідовності відрізняються, створюється повідомлення про помилку, яке показує різницю між ними.

source: This method is not called directly by :meth:`assertEqual`, but it's used to implement :meth:`assertListEqual` and :meth:`assertTupleEqual`.
uk: Цей метод не викликається безпосередньо :meth:`assertEqual`, але він використовується для реалізації :meth:`assertListEqual` і :meth:`assertTupleEqual`.

source: Tests that two lists or tuples are equal. If not, an error message is constructed that shows only the differences between the two. An error is also raised if either of the parameters are of the wrong type. These methods are used by default when comparing lists or tuples with :meth:`assertEqual`.
uk: Перевіряє рівність двох списків або кортежів. Якщо ні, створюється повідомлення про помилку, яке показує лише відмінності між ними. Помилка також виникає, якщо один із параметрів має неправильний тип. Ці методи використовуються за замовчуванням під час порівняння списків або кортежів із :meth:`assertEqual`.

source: Tests that two sets are equal. If not, an error message is constructed that lists the differences between the sets. This method is used by default when comparing sets or frozensets with :meth:`assertEqual`.
uk: Перевіряє рівність двох наборів. Якщо ні, створюється повідомлення про помилку, яке містить перелік відмінностей між наборами. Цей метод використовується за замовчуванням під час порівняння наборів або заморожених наборів за допомогою :meth:`assertEqual`.

source: Fails if either of *first* or *second* does not have a :meth:`set.difference` method.
uk: Помилка, якщо *first* або *second* не має методу :meth:`set.difference`.

source: Test that two dictionaries are equal. If not, an error message is constructed that shows the differences in the dictionaries. This method will be used by default to compare dictionaries in calls to :meth:`assertEqual`.
uk: Перевірте рівність двох словників. Якщо ні, створюється повідомлення про помилку, яке показує відмінності в словниках. Цей метод використовуватиметься за умовчанням для порівняння словників у викликах :meth:`assertEqual`.

source: Finally the :class:`TestCase` provides the following methods and attributes:
uk: Нарешті, :class:`TestCase` надає такі методи та атрибути:

source: Signals a test failure unconditionally, with *msg* or ``None`` for the error message.
uk: Безумовно сигналізує про помилку тесту за допомогою *msg* або ``None`` для повідомлення про помилку.

source: This class attribute gives the exception raised by the test method. If a test framework needs to use a specialized exception, possibly to carry additional information, it must subclass this exception in order to "play fair" with the framework. The initial value of this attribute is :exc:`AssertionError`.
uk: Цей атрибут класу дає виняток, викликаний методом тестування. Якщо тестова структура потребує використання спеціалізованого винятку, можливо, для передачі додаткової інформації, вона повинна створити підклас цього винятку, щоб "грати чесно" з структурою. Початковим значенням цього атрибута є :exc:`AssertionError`.

source: This class attribute determines what happens when a custom failure message is passed as the msg argument to an assertXYY call that fails. ``True`` is the default value. In this case, the custom message is appended to the end of the standard failure message. When set to ``False``, the custom message replaces the standard message.
uk: Цей атрибут класу визначає, що відбувається, коли настроюване повідомлення про помилку передається як аргумент msg для виклику assertXYY, який завершується помилкою. ``True`` - значення за умовчанням. У цьому випадку спеціальне повідомлення додається в кінець стандартного повідомлення про помилку. Якщо встановлено значення ``False``, спеціальне повідомлення замінює стандартне повідомлення.

source: The class setting can be overridden in individual test methods by assigning an instance attribute, self.longMessage, to ``True`` or ``False`` before calling the assert methods.
uk: Налаштування класу можна перевизначити в окремих методах тестування, призначивши атрибуту екземпляра self.longMessage значення ``True`` або ``False`` перед викликом методів assert.

source: The class setting gets reset before each test call.
uk: Налаштування класу скидається перед кожним тестовим викликом.

source: This attribute controls the maximum length of diffs output by assert methods that report diffs on failure. It defaults to 80*8 characters. Assert methods affected by this attribute are :meth:`assertSequenceEqual` (including all the sequence comparison methods that delegate to it), :meth:`assertDictEqual` and :meth:`assertMultiLineEqual`.
uk: Цей атрибут контролює максимальну довжину виведення відмінностей методами assert, які повідомляють про відмінності у разі помилки. За замовчуванням 80*8 символів. Методи підтвердження, на які впливає цей атрибут: :meth:`assertSequenceEqual` (включно з усіма методами порівняння послідовностей, які йому делегують), :meth:`assertDictEqual` і :meth:`assertMultiLineEqual`.

source: Setting ``maxDiff`` to ``None`` means that there is no maximum length of diffs.
uk: Встановлення ``maxDiff`` на ``None`` означає, що не існує максимальної довжини відмінностей.

source: Testing frameworks can use the following methods to collect information on the test:
uk: Платформи тестування можуть використовувати такі методи для збору інформації про тест:

source: Return the number of tests represented by this test object. For :class:`TestCase` instances, this will always be ``1``.
uk: Повертає кількість тестів, представлених цим тестовим об’єктом. Для екземплярів :class:`TestCase` це завжди буде ``1``.

source: Return an instance of the test result class that should be used for this test case class (if no other result instance is provided to the :meth:`run` method).
uk: Повертає екземпляр класу результатів тесту, який слід використовувати для цього класу тестів (якщо для методу :meth:`run` не надано інший екземпляр результату).

source: For :class:`TestCase` instances, this will always be an instance of :class:`TestResult`; subclasses of :class:`TestCase` should override this as necessary.
uk: Для екземплярів :class:`TestCase` це завжди буде екземпляр :class:`TestResult`; підкласи :class:`TestCase` мають замінити це, якщо необхідно.

source: Return a string identifying the specific test case. This is usually the full name of the test method, including the module and class name.
uk: Повертає рядок, що ідентифікує конкретний тест. Зазвичай це повна назва тестового методу, включаючи назву модуля та класу.

source: Returns a description of the test, or ``None`` if no description has been provided. The default implementation of this method returns the first line of the test method's docstring, if available, or ``None``.
uk: Повертає опис тесту або ``None``, якщо опис не надано. Реалізація цього методу за замовчуванням повертає перший рядок документації тестового методу, якщо доступний, або ``None``.

source: In 3.1 this was changed to add the test name to the short description even in the presence of a docstring. This caused compatibility issues with unittest extensions and adding the test name was moved to the :class:`TextTestResult` in Python 3.2.
uk: У 3.1 це було змінено, щоб додати назву тесту до короткого опису навіть за наявності рядка документації. Це викликало проблеми сумісності з розширеннями unittest, і додавання назви тесту було перенесено до :class:`TextTestResult` у Python 3.2.

source: Add a function to be called after :meth:`tearDown` to cleanup resources used during the test. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addCleanup` when they are added.
uk: Додайте функцію, яка буде викликатися після :meth:`tearDown` для очищення ресурсів, використаних під час тесту. Функції будуть викликані в порядку, зворотному порядку їх додавання (:abbr:`LIFO (останній прийшов, перший вийшов)`). Вони викликаються з будь-якими аргументами та ключовими аргументами, які передаються в :meth:`addCleanup` під час їх додавання.

source: If :meth:`setUp` fails, meaning that :meth:`tearDown` is not called, then any cleanup functions added will still be called.
uk: Якщо :meth:`setUp` не вдається, тобто :meth:`tearDown` не викликається, тоді будь-які додані функції очищення все одно будуть викликані.

source: This method is called unconditionally after :meth:`tearDown`, or after :meth:`setUp` if :meth:`setUp` raises an exception.
uk: Цей метод викликається безумовно після :meth:`tearDown` або після :meth:`setUp`, якщо :meth:`setUp` викликає виняткову ситуацію.

source: It is responsible for calling all the cleanup functions added by :meth:`addCleanup`. If you need cleanup functions to be called *prior* to :meth:`tearDown` then you can call :meth:`doCleanups` yourself.
uk: Він відповідає за виклик усіх функцій очищення, доданих :meth:`addCleanup`. Якщо вам потрібно, щоб функції очищення викликалися *перед* :meth:`tearDown`, ви можете викликати :meth:`doCleanups` самостійно.

source: :meth:`doCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
uk: :meth:`doCleanups` витягує методи зі стеку функцій очищення по одному, тому їх можна викликати будь-коли.
