Repository: python/python-docs-uk
Catalog: library/unittest.po
Languages: uk

source: **Source code:** :source:`Lib/unittest/__init__.py`
uk: **Вихідний код:** :source:`Lib/unittest/__init__.py`

source: (If you are already familiar with the basic concepts of testing, you might want to skip to :ref:`the list of assert methods <assert-methods>`.)
uk: (Якщо ви вже знайомі з основними концепціями тестування, ви можете перейти до :ref:`списку методів assert <assert-methods>`.)

source: The :mod:`unittest` unit testing framework was originally inspired by JUnit and has a similar flavor as major unit testing frameworks in other languages. It supports test automation, sharing of setup and shutdown code for tests, aggregation of tests into collections, and independence of the tests from the reporting framework.
uk: Фреймворк модульного тестування :mod:`unittest` спочатку був натхненний JUnit і має подібний смак, як основні фреймворки модульного тестування іншими мовами. Він підтримує автоматизацію тестування, спільне використання коду налаштування та завершення тестів, об’єднання тестів у колекції та незалежність тестів від структури звітування.

source: To achieve this, :mod:`unittest` supports some important concepts in an object-oriented way:
uk: Щоб досягти цього, :mod:`unittest` підтримує деякі важливі концепції в об’єктно-орієнтований спосіб:

source: test fixture
uk: тестове пристосування

source: A :dfn:`test fixture` represents the preparation needed to perform one or more tests, and any associated cleanup actions. This may involve, for example, creating temporary or proxy databases, directories, or starting a server process.
uk: :dfn:`test fixture` представляє підготовку, необхідну для виконання одного або кількох тестів і будь-яких пов’язаних дій очищення. Це може включати, наприклад, створення тимчасових або проксі-баз даних, каталогів або запуск серверного процесу.

source: test case
uk: тестовий випадок

source: A :dfn:`test case` is the individual unit of testing. It checks for a specific response to a particular set of inputs. :mod:`unittest` provides a base class, :class:`TestCase`, which may be used to create new test cases.
uk: :dfn:`test case` — це окрема одиниця тестування. Він перевіряє конкретну відповідь на певний набір вхідних даних. :mod:`unittest` надає базовий клас, :class:`TestCase`, який можна використовувати для створення нових тестів.

source: test suite
uk: набір тестів

source: A :dfn:`test suite` is a collection of test cases, test suites, or both. It is used to aggregate tests that should be executed together.
uk: :dfn:`test suite` — це набір тестів, наборів тестів або обох. Він використовується для агрегування тестів, які слід виконувати разом.

source: test runner
uk: тестовий бігун

source: A :dfn:`test runner` is a component which orchestrates the execution of tests and provides the outcome to the user. The runner may use a graphical interface, a textual interface, or return a special value to indicate the results of executing the tests.
uk: :dfn:`test runner` — це компонент, який керує виконанням тестів і надає результат користувачеві. Виконувач може використовувати графічний інтерфейс, текстовий інтерфейс або повертати спеціальне значення для вказівки результатів виконання тестів.

source: Module :mod:`doctest`
uk: Модуль :mod:`doctest`

source: Another test-support module with a very different flavor.
uk: Ще один модуль підтримки тестування з зовсім іншим смаком.

source: `Simple Smalltalk Testing: With Patterns <https://web.archive.org/web/20150315073817/http://www.xprogramming.com/testfram.htm>`_
uk: `Просте тестування Smalltalk: із шаблонами <https://web.archive.org/web/20150315073817/http://www.xprogramming.com/testfram.htm>`_

source: Kent Beck's original paper on testing frameworks using the pattern shared by :mod:`unittest`.
uk: Оригінальна стаття Кента Бека про тестування фреймворків за шаблоном, яким поділився :mod:`unittest`.

source: Third-party unittest framework with a lighter-weight syntax for writing tests. For example, ``assert func(10) == 42``.
uk: Фреймворк модульного тестування третьої сторони зі спрощеним синтаксисом для написання тестів. Наприклад, ``assert func(10) == 42``.

source: `The Python Testing Tools Taxonomy <https://wiki.python.org/moin/PythonTestingToolsTaxonomy>`_
uk: `Таксономія інструментів тестування Python <https://wiki.python.org/moin/PythonTestingToolsTaxonomy>`_

source: An extensive list of Python testing tools including functional testing frameworks and mock object libraries.
uk: Широкий список інструментів тестування Python, включаючи фреймворки функціонального тестування та бібліотеки макетів об’єктів.

source: `Testing in Python Mailing List <http://lists.idyll.org/listinfo/testing-in-python>`_
uk: `Тестування в списку розсилки Python <http://lists.idyll.org/listinfo/testing-in-python>`_

source: A special-interest-group for discussion of testing, and testing tools, in Python.
uk: Група спеціальних інтересів для обговорення тестування та інструментів тестування на Python.

source: Basic example
uk: Базовий приклад

source: The :mod:`unittest` module provides a rich set of tools for constructing and running tests. This section demonstrates that a small subset of the tools suffice to meet the needs of most users.
uk: Модуль :mod:`unittest` надає багатий набір інструментів для побудови та виконання тестів. У цьому розділі показано, що невеликого набору інструментів достатньо для задоволення потреб більшості користувачів.

source: Here is a short script to test three string methods::
uk: Ось короткий скрипт для перевірки трьох методів рядків:

source: A testcase is created by subclassing :class:`unittest.TestCase`. The three individual tests are defined with methods whose names start with the letters ``test``. This naming convention informs the test runner about which methods represent tests.
uk: Тестовий приклад створюється підкласом :class:`unittest.TestCase`. Три окремі тести визначаються методами, назви яких починаються з літер ``test``. Ця домовленість про найменування інформує виконавця тестів про те, які методи представляють тести.

source: The crux of each test is a call to :meth:`~TestCase.assertEqual` to check for an expected result; :meth:`~TestCase.assertTrue` or :meth:`~TestCase.assertFalse` to verify a condition; or :meth:`~TestCase.assertRaises` to verify that a specific exception gets raised. These methods are used instead of the :keyword:`assert` statement so the test runner can accumulate all test results and produce a report.
uk: Суть кожного тесту полягає у виклику :meth:`~TestCase.assertEqual` для перевірки очікуваного результату; :meth:`~TestCase.assertTrue` або :meth:`~TestCase.assertFalse` для перевірки умови; або :meth:`~TestCase.assertRaises`, щоб перевірити, чи виникає певний виняток. Ці методи використовуються замість оператора :keyword:`assert`, щоб виконавець тесту міг накопичувати всі результати тестування та створювати звіт.

source: The :meth:`~TestCase.setUp` and :meth:`~TestCase.tearDown` methods allow you to define instructions that will be executed before and after each test method. They are covered in more detail in the section :ref:`organizing-tests`.
uk: Методи :meth:`~TestCase.setUp` і :meth:`~TestCase.tearDown` дозволяють визначати інструкції, які виконуватимуться до і після кожного методу тестування. Більш детально вони описані в розділі :ref:`organizing-tests`.

source: The final block shows a simple way to run the tests. :func:`unittest.main` provides a command-line interface to the test script. When run from the command line, the above script produces an output that looks like this::
uk: Останній блок показує простий спосіб виконання тестів. :func:`unittest.main` надає інтерфейс командного рядка для тестового сценарію. Під час запуску з командного рядка наведений вище сценарій створює вихідні дані, які виглядають так:

source: Passing the ``-v`` option to your test script will instruct :func:`unittest.main` to enable a higher level of verbosity, and produce the following output::
uk: Передача параметра ``-v`` у ваш тестовий сценарій вказує :func:`unittest.main` увімкнути вищий рівень докладності та створить такий вихід:

source: The above examples show the most commonly used :mod:`unittest` features which are sufficient to meet many everyday testing needs. The remainder of the documentation explores the full feature set from first principles.
uk: Наведені вище приклади показують найпоширеніші функції :mod:`unittest`, яких достатньо для задоволення багатьох щоденних потреб тестування. У решті документації розглядається повний набір функцій із перших принципів.

source: Command-Line Interface
uk: Інтерфейс командного рядка

source: The unittest module can be used from the command line to run tests from modules, classes or even individual test methods::
uk: Модуль unittest можна використовувати з командного рядка для запуску тестів із модулів, класів або навіть окремих методів тестування:

source: You can pass in a list with any combination of module names, and fully qualified class or method names.
uk: Ви можете передати список із будь-якою комбінацією імен модулів і повних імен класів або методів.

source: Test modules can be specified by file path as well::
uk: Тестові модулі також можна вказати шляхом до файлу:

source: This allows you to use the shell filename completion to specify the test module. The file specified must still be importable as a module. The path is converted to a module name by removing the '.py' and converting path separators into '.'. If you want to execute a test file that isn't importable as a module you should execute the file directly instead.
uk: Це дозволяє використовувати завершення назви файлу оболонки для визначення тестового модуля. Зазначений файл усе ще має бути імпортованим як модуль. Шлях перетворюється на назву модуля шляхом видалення ".py" та перетворення роздільників шляху на ".". Якщо ви хочете виконати тестовий файл, який не можна імпортувати як модуль, вам слід виконати цей файл безпосередньо.

source: You can run tests with more detail (higher verbosity) by passing in the -v flag::
uk: Ви можете запустити тести з більшою деталізацією (вищою детальністю), передавши прапор -v::

source: When executed without arguments :ref:`unittest-test-discovery` is started::
uk: При виконанні без аргументів :ref:`unittest-test-discovery` запускається::

source: For a list of all the command-line options::
uk: Список усіх параметрів командного рядка:

source: In earlier versions it was only possible to run individual test methods and not modules or classes.
uk: У попередніх версіях було можливо запускати лише окремі методи тестування, а не модулі чи класи.

source: Command-line options
uk: Параметри командного рядка

source: :program:`unittest` supports these command-line options:
uk: :program:`unittest` підтримує такі параметри командного рядка:

source: The standard output and standard error streams are buffered during the test run. Output during a passing test is discarded. Output is echoed normally on test fail or error and is added to the failure messages.
uk: Стандартний вихід і стандартні потоки помилок буферизуються під час виконання тесту. Вихідні дані під час проходження тесту відкидаються. Вихідні дані зазвичай відтворюються у разі невдачі тесту або помилки та додаються до повідомлень про помилки.

source: :kbd:`Control-C` during the test run waits for the current test to end and then reports all the results so far. A second :kbd:`Control-C` raises the normal :exc:`KeyboardInterrupt` exception.
uk: :kbd:`Control-C` під час тестового запуску чекає завершення поточного тесту, а потім повідомляє всі результати. Другий :kbd:`Control-C` викликає звичайний виняток :exc:`KeyboardInterrupt`.

source: See `Signal Handling`_ for the functions that provide this functionality.
uk: Перегляньте Обробка сигналів (`Signal Handling`_) для функцій, які забезпечують цю функціональність.

source: Stop the test run on the first error or failure.
uk: Зупиніть тестовий запуск при першій помилці або невдачі.

source: Only run test methods and classes that match the pattern or substring. This option may be used multiple times, in which case all test cases that match any of the given patterns are included.
uk: Запускайте лише тестові методи та класи, які відповідають шаблону або підрядку. Цю опцію можна використовувати кілька разів, і в цьому випадку будуть включені всі тестові випадки, які відповідають будь-якому із заданих шаблонів.

source: Patterns that contain a wildcard character (``*``) are matched against the test name using :meth:`fnmatch.fnmatchcase`; otherwise simple case-sensitive substring matching is used.
uk: Шаблони, які містять символ підстановки (``*``), зіставляються з назвою тесту за допомогою :meth:`fnmatch.fnmatchcase`; інакше використовується просте зіставлення підрядка з урахуванням регістру.

source: Patterns are matched against the fully qualified test method name as imported by the test loader.
uk: Шаблони зіставляються з повною назвою методу тестування, імпортованою завантажувачем тестів.

source: For example, ``-k foo`` matches ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``.
uk: Наприклад, ``-k foo`` відповідає ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_something``, але не ``bar_tests.FooTest.test_something``.

source: Show local variables in tracebacks.
uk: Показати локальні змінні в трасуваннях.

source: The command-line options ``-b``, ``-c`` and ``-f`` were added.
uk: Додано параметри командного рядка ``-b``, ``-c`` і ``-f``.

source: The command-line option ``--locals``.
uk: Параметр командного рядка ``--locals``.

source: The command-line option ``-k``.
uk: Параметр командного рядка ``-k``.

source: The command line can also be used for test discovery, for running all of the tests in a project or just a subset.
uk: Командний рядок також можна використовувати для виявлення тестів, для запуску всіх тестів у проекті або лише підмножини.

source: Test Discovery
uk: Тестове відкриття

source: Test discovery is implemented in :meth:`TestLoader.discover`, but can also be used from the command line. The basic command-line usage is::
uk: Виявлення тесту реалізовано в :meth:`TestLoader.discover`, але його також можна використовувати з командного рядка. Основне використання командного рядка:

source: As a shortcut, ``python -m unittest`` is the equivalent of ``python -m unittest discover``. If you want to pass arguments to test discovery the ``discover`` sub-command must be used explicitly.
uk: Як скорочення, ``python -m unittest`` є еквівалентом ``python -m unittest discover``. Якщо ви хочете передати аргументи для перевірки виявлення, підкоманду ``discover`` слід використовувати явно.

source: The ``discover`` sub-command has the following options:
uk: Підкоманда ``discover`` має такі параметри:

source: Verbose output
uk: Детальний висновок

source: Directory to start discovery (``.`` default)
uk: Каталог для початку виявлення (``.`` за замовчуванням)

source: Pattern to match test files (``test*.py`` default)
uk: Шаблон для відповідності тестовим файлам (``test*.py`` за замовчуванням)

source: Top level directory of project (defaults to start directory)
uk: Каталог верхнього рівня проекту (за замовчуванням це початковий каталог)

source: The :option:`-s`, :option:`-p`, and :option:`-t` options can be passed in as positional arguments in that order. The following two command lines are equivalent::
uk: Параметри :option:`-s`, :option:`-p` і :option:`-t` можна передати як позиційні аргументи в такому порядку. Наступні два командні рядки еквівалентні:

source: As well as being a path it is possible to pass a package name, for example ``myproject.subpackage.test``, as the start directory. The package name you supply will then be imported and its location on the filesystem will be used as the start directory.
uk: Окрім шляху, можна передати назву пакета, наприклад ``myproject.subpackage.test``, як початковий каталог. Указане вами ім’я пакета буде імпортовано, а його розташування у файловій системі використовуватиметься як початковий каталог.

source: Test discovery loads tests by importing them. Once test discovery has found all the test files from the start directory you specify it turns the paths into package names to import. For example :file:`foo/bar/baz.py` will be imported as ``foo.bar.baz``.
uk: Відкриття тестів завантажує тести, імпортуючи їх. Після того як тестове виявлення знайде всі тестові файли з початкового каталогу, який ви вкажете, воно перетворює шляхи на імена пакетів для імпорту. Наприклад, :file:`foo/bar/baz.py` буде імпортовано як ``foo.bar.baz``.

source: If you have a package installed globally and attempt test discovery on a different copy of the package then the import *could* happen from the wrong place. If this happens test discovery will warn you and exit.
uk: Якщо у вас глобально встановлено пакет, і ви намагаєтеся виявити тест на іншій копії пакета, то імпорт *може* відбутися не з того місця. Якщо це станеться, тестове виявлення попередить вас і вийде.

source: If you supply the start directory as a package name rather than a path to a directory then discover assumes that whichever location it imports from is the location you intended, so you will not get the warning.
uk: Якщо ви вказуєте початковий каталог як назву пакета, а не як шлях до каталогу, тоді виявлення припускає, що будь-яке місце, з якого він імпортує, є тим розташуванням, яке ви хотіли, тому ви не отримаєте попередження.

source: Test modules and packages can customize test loading and discovery by through the `load_tests protocol`_.
uk: Тестові модулі та пакети можуть налаштувати тестове завантаження та виявлення за допомогою `load_tests protocol`_.

source: Test discovery supports :term:`namespace packages <namespace package>` for the start directory. Note that you need to specify the top level directory too (e.g. ``python -m unittest discover -s root/namespace -t root``).
uk: Тестове виявлення підтримує :term:`пакети простору імен <namespace package>` для початкового каталогу. Зауважте, що вам також потрібно вказати каталог верхнього рівня (наприклад, ``python -m unittest discover -s root/namespace -t root``).

source: Organizing test code
uk: Організація тестового коду

source: The basic building blocks of unit testing are :dfn:`test cases` --- single scenarios that must be set up and checked for correctness. In :mod:`unittest`, test cases are represented by :class:`unittest.TestCase` instances. To make your own test cases you must write subclasses of :class:`TestCase` or use :class:`FunctionTestCase`.
uk: Основними будівельними блоками модульного тестування є :dfn:`test cases` --- окремі сценарії, які необхідно налаштувати та перевірити на правильність. У :mod:`unittest` тестові випадки представлені екземплярами :class:`unittest.TestCase`. Щоб створити власні тестові випадки, ви повинні написати підкласи :class:`TestCase` або використати :class:`FunctionTestCase`.

source: The testing code of a :class:`TestCase` instance should be entirely self contained, such that it can be run either in isolation or in arbitrary combination with any number of other test cases.
uk: Тестовий код екземпляра :class:`TestCase` має бути повністю самостійним, щоб його можна було запускати окремо або в довільній комбінації з будь-якою кількістю інших тестів.

source: The simplest :class:`TestCase` subclass will simply implement a test method (i.e. a method whose name starts with ``test``) in order to perform specific testing code::
uk: Найпростіший підклас :class:`TestCase` просто реалізує тестовий метод (тобто метод, назва якого починається з ``test``), щоб виконати певний код тестування:

source: Tests can be numerous, and their set-up can be repetitive. Luckily, we can factor out set-up code by implementing a method called :meth:`~TestCase.setUp`, which the testing framework will automatically call for every single test we run::
uk: Тестів може бути багато, а їх налаштування можуть повторюватися. На щастя, ми можемо виключити код налаштування, реалізувавши метод під назвою :meth:`~TestCase.setUp`, який система тестування автоматично викличе для кожного тесту, який ми виконуємо:

source: The order in which the various tests will be run is determined by sorting the test method names with respect to the built-in ordering for strings.
uk: Порядок, у якому виконуватимуться різні тести, визначається сортуванням назв методів тестування відповідно до вбудованого порядку для рядків.

source: If the :meth:`~TestCase.setUp` method raises an exception while the test is running, the framework will consider the test to have suffered an error, and the test method will not be executed.
uk: Якщо метод :meth:`~TestCase.setUp` викликає виняток під час виконання тесту, фреймворк вважатиме, що тест зазнав помилки, і метод тесту не буде виконано.

source: Similarly, we can provide a :meth:`~TestCase.tearDown` method that tidies up after the test method has been run::
uk: Подібним чином ми можемо надати метод :meth:`~TestCase.tearDown`, який наводить порядок після виконання тестового методу:

source: If :meth:`~TestCase.setUp` succeeded, :meth:`~TestCase.tearDown` will be run whether the test method succeeded or not.
uk: Якщо :meth:`~TestCase.setUp` виконано успішно, :meth:`~TestCase.tearDown` буде запущено незалежно від того, чи вдався метод тестування.

source: Such a working environment for the testing code is called a :dfn:`test fixture`. A new TestCase instance is created as a unique test fixture used to execute each individual test method. Thus :meth:`~TestCase.setUp`, :meth:`~TestCase.tearDown`, and :meth:`~TestCase.__init__` will be called once per test.
uk: Таке робоче середовище для коду тестування називається :dfn:`test fixture`. Новий екземпляр TestCase створюється як унікальний тестовий прилад, який використовується для виконання кожного окремого методу тестування. Таким чином, :meth:`~TestCase.setUp`, :meth:`~TestCase.tearDown` і :meth:`~TestCase.__init__` буде викликано один раз на тест.

source: It is recommended that you use TestCase implementations to group tests together according to the features they test. :mod:`unittest` provides a mechanism for this: the :dfn:`test suite`, represented by :mod:`unittest`'s :class:`TestSuite` class. In most cases, calling :func:`unittest.main` will do the right thing and collect all the module's test cases for you and execute them.
uk: Рекомендується використовувати реалізації TestCase для групування тестів відповідно до функцій, які вони тестують. :mod:`unittest` забезпечує механізм для цього: :dfn:`test suite`, представлений :mod:`unittest` класом :class:`TestSuite`. У більшості випадків виклик :func:`unittest.main` зробить правильну річ і збере для вас усі тестові приклади модуля та виконає їх.

source: However, should you want to customize the building of your test suite, you can do it yourself::
uk: Однак, якщо ви хочете налаштувати збірку свого набору тестів, ви можете зробити це самостійно:

source: You can place the definitions of test cases and test suites in the same modules as the code they are to test (such as :file:`widget.py`), but there are several advantages to placing the test code in a separate module, such as :file:`test_widget.py`:
uk: Ви можете розмістити визначення тестів і наборів тестів у тих самих модулях, що й код, який вони мають тестувати (наприклад, :file:`widget.py`), але є кілька переваг розміщення тестового коду в окремому модулі, наприклад :file:`test_widget.py`:

source: The test module can be run standalone from the command line.
uk: Тестовий модуль можна запускати автономно з командного рядка.

source: The test code can more easily be separated from shipped code.
uk: Тестовий код можна легше відокремити від надісланого коду.
