Repository: python/python-docs-uk
Catalog: library/unittest.po
Languages: uk

source: There is less temptation to change test code to fit the code it tests without a good reason.
uk: Менше спокуси змінити тестовий код, щоб відповідати коду, який він тестує, без вагомої причини.

source: Test code should be modified much less frequently than the code it tests.
uk: Тестовий код слід змінювати набагато рідше, ніж код, який він тестує.

source: Tested code can be refactored more easily.
uk: Перевірений код можна легше рефакторингувати.

source: Tests for modules written in C must be in separate modules anyway, so why not be consistent?
uk: Тести для модулів, написаних мовою C, у будь-якому разі повинні бути окремими модулями, то чому б не бути послідовними?

source: If the testing strategy changes, there is no need to change the source code.
uk: Якщо стратегія тестування змінюється, немає необхідності змінювати вихідний код.

source: Re-using old test code
uk: Повторне використання старого тестового коду

source: Some users will find that they have existing test code that they would like to run from :mod:`unittest`, without converting every old test function to a :class:`TestCase` subclass.
uk: Деякі користувачі виявлять, що у них є тестовий код, який вони хотіли б запустити з :mod:`unittest`, не перетворюючи кожну стару тестову функцію на підклас :class:`TestCase`.

source: For this reason, :mod:`unittest` provides a :class:`FunctionTestCase` class. This subclass of :class:`TestCase` can be used to wrap an existing test function. Set-up and tear-down functions can also be provided.
uk: З цієї причини :mod:`unittest` надає клас :class:`FunctionTestCase`. Цей підклас :class:`TestCase` можна використовувати для обгортання існуючої тестової функції. Також можуть бути передбачені функції налаштування та демонтажу.

source: Given the following test function::
uk: Дано таку тестову функцію:

source: one can create an equivalent test case instance as follows, with optional set-up and tear-down methods::
uk: можна створити еквівалентний екземпляр тестового сценарію наступним чином із додатковими методами налаштування та демонтажу:

source: Even though :class:`FunctionTestCase` can be used to quickly convert an existing test base over to a :mod:`unittest`\ -based system, this approach is not recommended. Taking the time to set up proper :class:`TestCase` subclasses will make future test refactorings infinitely easier.
uk: Незважаючи на те, що :class:`FunctionTestCase` можна використовувати для швидкого перетворення наявної тестової бази на систему на основі :mod:`unittest`\, цей підхід не рекомендується. Витративши час на налаштування належних підкласів :class:`TestCase`, ви значно спростите рефакторинг майбутніх тестів.

source: In some cases, the existing tests may have been written using the :mod:`doctest` module. If so, :mod:`doctest` provides a :class:`DocTestSuite` class that can automatically build :class:`unittest.TestSuite` instances from the existing :mod:`doctest`\ -based tests.
uk: У деяких випадках існуючі тести могли бути написані за допомогою модуля :mod:`doctest`. Якщо так, :mod:`doctest` надає клас :class:`DocTestSuite`, який може автоматично створювати екземпляри :class:`unittest.TestSuite` з існуючих тестів на основі :mod:`doctest`\.

source: Skipping tests and expected failures
uk: Пропуск тестів і очікувані невдачі

source: Unittest supports skipping individual test methods and even whole classes of tests. In addition, it supports marking a test as an "expected failure," a test that is broken and will fail, but shouldn't be counted as a failure on a :class:`TestResult`.
uk: Unittest підтримує пропуски окремих методів тестування і навіть цілих класів тестів. Крім того, він підтримує позначення тесту як "очікуваної помилки", тобто тесту, який зламано і буде невдалим, але його не слід вважати помилкою в :class:`TestResult`.

source: Skipping a test is simply a matter of using the :func:`skip` :term:`decorator` or one of its conditional variants, calling :meth:`TestCase.skipTest` within a :meth:`~TestCase.setUp` or test method, or raising :exc:`SkipTest` directly.
uk: Пропуск тесту – це просто використання :func:`skip` :term:`decorator` або одного з його умовних варіантів, виклик :meth:`TestCase.skipTest` у :meth:`~TestCase.setUp` або тестовий метод або безпосередньо підняти :exc:`SkipTest`.

source: Basic skipping looks like this::
uk: Базовий пропуск виглядає так::

source: This is the output of running the example above in verbose mode::
uk: Це результат виконання наведеного вище прикладу в докладному режимі:

source: Classes can be skipped just like methods::
uk: Класи можна пропускати, як і методи:

source: :meth:`TestCase.setUp` can also skip the test. This is useful when a resource that needs to be set up is not available.
uk: :meth:`TestCase.setUp` також може пропустити тест. Це корисно, коли ресурс, який потрібно налаштувати, недоступний.

source: Expected failures use the :func:`expectedFailure` decorator. ::
uk: Очікувані помилки використовують декоратор :func:`expectedFailure`. ::

source: It's easy to roll your own skipping decorators by making a decorator that calls :func:`skip` on the test when it wants it to be skipped. This decorator skips the test unless the passed object has a certain attribute::
uk: Легко запустити власні декоратори пропуску, створивши декоратор, який викликає :func:`skip` у тесті, коли хоче, щоб його було пропущено. Цей декоратор пропускає перевірку, якщо переданий об’єкт не має певного атрибута::

source: The following decorators and exception implement test skipping and expected failures:
uk: Наступні декоратори та винятки реалізують пропуск тесту та очікувані помилки:

source: Unconditionally skip the decorated test. *reason* should describe why the test is being skipped.
uk: Беззастережно пропустіть оформлений тест. *причина* має описувати, чому тест пропускається.

source: Skip the decorated test if *condition* is true.
uk: Пропустіть декорований тест, якщо *умова* істинна.

source: Skip the decorated test unless *condition* is true.
uk: Пропустіть оформлений тест, якщо *умова* не виконується.

source: Mark the test as an expected failure or error. If the test fails or errors in the test function itself (rather than in one of the :dfn:`test fixture` methods) then it will be considered a success. If the test passes, it will be considered a failure.
uk: Позначте тест як очікувану невдачу або помилку. Якщо тест зазнає невдачі або помилки в самій тестовій функції (а не в одному з методів :dfn:`test fixture`), тоді він вважатиметься успішним. Якщо тест буде пройдений, він буде вважатися невдалим.

source: This exception is raised to skip a test.
uk: Цей виняток створюється, щоб пропустити тест.

source: Usually you can use :meth:`TestCase.skipTest` or one of the skipping decorators instead of raising this directly.
uk: Зазвичай ви можете використовувати :meth:`TestCase.skipTest` або один із декораторів пропуску замість того, щоб піднімати це безпосередньо.

source: Skipped tests will not have :meth:`~TestCase.setUp` or :meth:`~TestCase.tearDown` run around them. Skipped classes will not have :meth:`~TestCase.setUpClass` or :meth:`~TestCase.tearDownClass` run. Skipped modules will not have :func:`setUpModule` or :func:`tearDownModule` run.
uk: Пропущені тести не запускатимуть :meth:`~TestCase.setUp` або :meth:`~TestCase.tearDown`. Пропущені класи не виконуватимуться :meth:`~TestCase.setUpClass` або :meth:`~TestCase.tearDownClass`. Пропущені модулі не запускатимуть :func:`setUpModule` або :func:`tearDownModule`.

source: Distinguishing test iterations using subtests
uk: Розрізнення тестових ітерацій за допомогою субтестів

source: When there are very small differences among your tests, for instance some parameters, unittest allows you to distinguish them inside the body of a test method using the :meth:`~TestCase.subTest` context manager.
uk: Якщо між вашими тестами є дуже невеликі відмінності, наприклад деякі параметри, unittest дозволяє розрізняти їх у тілі тестового методу за допомогою контекстного менеджера :meth:`~TestCase.subTest`.

source: For example, the following test::
uk: Наприклад, такий тест:

source: will produce the following output::
uk: виведе наступний вихід:

source: Without using a subtest, execution would stop after the first failure, and the error would be less easy to diagnose because the value of ``i`` wouldn't be displayed::
uk: Без використання підтесту виконання зупинилося б після першої помилки, а помилку було б важче діагностувати, оскільки значення ``i`` не відображалося б::

source: Classes and functions
uk: Класи та функції

source: This section describes in depth the API of :mod:`unittest`.
uk: У цьому розділі докладно описано API :mod:`unittest`.

source: Test cases
uk: Тестові випадки

source: Instances of the :class:`TestCase` class represent the logical test units in the :mod:`unittest` universe. This class is intended to be used as a base class, with specific tests being implemented by concrete subclasses. This class implements the interface needed by the test runner to allow it to drive the tests, and methods that the test code can use to check for and report various kinds of failure.
uk: Екземпляри класу :class:`TestCase` представляють логічні тестові одиниці у всесвіті :mod:`unittest`. Цей клас призначений для використання в якості базового класу з конкретними тестами, реалізованими конкретними підкласами. Цей клас реалізує інтерфейс, необхідний виконавцю тестів, щоб дозволити йому керувати тестами, і методи, які тестовий код може використовувати для перевірки та звітування про різні види помилок.

source: Each instance of :class:`TestCase` will run a single base method: the method named *methodName*. In most uses of :class:`TestCase`, you will neither change the *methodName* nor reimplement the default ``runTest()`` method.
uk: Кожен екземпляр :class:`TestCase` запускатиме один базовий метод: метод під назвою *methodName*. У більшості випадків використання :class:`TestCase` ви не змінюєте *methodName* і не реалізуєте метод за замовчуванням ``runTest()``.

source: :class:`TestCase` can be instantiated successfully without providing a *methodName*. This makes it easier to experiment with :class:`TestCase` from the interactive interpreter.
uk: :class:`TestCase` можна успішно створити без надання *methodName*. Це полегшує експерименти з :class:`TestCase` з інтерактивного інтерпретатора.

source: :class:`TestCase` instances provide three groups of methods: one group used to run the test, another used by the test implementation to check conditions and report failures, and some inquiry methods allowing information about the test itself to be gathered.
uk: Екземпляри :class:`TestCase` забезпечують три групи методів: одна група використовується для запуску тесту, інша використовується реалізацією тесту для перевірки умов і звітування про помилки, а також деякі методи запиту, які дозволяють збирати інформацію про сам тест.

source: Methods in the first group (running the test) are:
uk: Методи першої групи (проведення тесту) це:

source: Method called to prepare the test fixture. This is called immediately before calling the test method; other than :exc:`AssertionError` or :exc:`SkipTest`, any exception raised by this method will be considered an error rather than a test failure. The default implementation does nothing.
uk: Метод, який називається для підготовки випробувального матеріалу. Це викликається безпосередньо перед викликом тестового методу; крім :exc:`AssertionError` або :exc:`SkipTest`, будь-який виняток, викликаний цим методом, вважатиметься помилкою, а не помилкою тесту. Стандартна реалізація нічого не робить.

source: Method called immediately after the test method has been called and the result recorded. This is called even if the test method raised an exception, so the implementation in subclasses may need to be particularly careful about checking internal state. Any exception, other than :exc:`AssertionError` or :exc:`SkipTest`, raised by this method will be considered an additional error rather than a test failure (thus increasing the total number of reported errors). This method will only be called if the :meth:`setUp` succeeds, regardless of the outcome of the test method. The default implementation does nothing.
uk: Метод викликається відразу після виклику тестового методу та запису результату. Це викликається, навіть якщо метод тестування викликав виняток, тому реалізація в підкласах може потребувати особливої обережності щодо перевірки внутрішнього стану. Будь-які винятки, окрім :exc:`AssertionError` або :exc:`SkipTest`, викликані цим методом, вважатимуться додатковою помилкою, а не помилкою тесту (таким чином збільшуючи загальну кількість повідомлених помилок). Цей метод буде викликано, лише якщо :meth:`setUp` завершиться успішно, незалежно від результату тестового методу. Стандартна реалізація нічого не робить.

source: A class method called before tests in an individual class are run. ``setUpClass`` is called with the class as the only argument and must be decorated as a :func:`classmethod`::
uk: Метод класу, який викликається перед виконанням тестів в окремому класі. ``setUpClass`` викликається з класом як єдиним аргументом і має бути оформлений як :func:`classmethod`::

source: See `Class and Module Fixtures`_ for more details.
uk: Додаткову інформацію див. у розділі `Class and Module Fixtures`_.

source: A class method called after tests in an individual class have run. ``tearDownClass`` is called with the class as the only argument and must be decorated as a :meth:`classmethod`::
uk: Метод класу, який викликається після виконання тестів в окремому класі. ``tearDownClass`` викликається з класом як єдиним аргументом і має бути оформлений як :meth:`classmethod`::

source: Run the test, collecting the result into the :class:`TestResult` object passed as *result*. If *result* is omitted or ``None``, a temporary result object is created (by calling the :meth:`defaultTestResult` method) and used. The result object is returned to :meth:`run`'s caller.
uk: Запустіть тест, зібравши результат в об’єкт :class:`TestResult`, переданий як *result*. Якщо *результат* пропущено або ``None``, створюється та використовується тимчасовий об’єкт результату (викликом методу :meth:`defaultTestResult`). Об’єкт результату повертається до виклику :meth:`run`.

source: The same effect may be had by simply calling the :class:`TestCase` instance.
uk: Такого ж ефекту можна отримати, просто викликавши екземпляр :class:`TestCase`.

source: Previous versions of ``run`` did not return the result. Neither did calling an instance.
uk: Попередні версії ``run`` не повертали результат. Також не викликав інстанції.

source: Calling this during a test method or :meth:`setUp` skips the current test. See :ref:`unittest-skipping` for more information.
uk: Виклик цього під час тестового методу або :meth:`setUp` пропускає поточний тест. Перегляньте :ref:`unittest-skipping` для отримання додаткової інформації.

source: Return a context manager which executes the enclosed code block as a subtest. *msg* and *params* are optional, arbitrary values which are displayed whenever a subtest fails, allowing you to identify them clearly.
uk: Повертає контекстний менеджер, який виконує вкладений блок коду як підтест. *msg* і *params* є необов’язковими, довільними значеннями, які відображаються щоразу, коли субтест проходить невдало, що дозволяє їх чітко ідентифікувати.

source: A test case can contain any number of subtest declarations, and they can be arbitrarily nested.
uk: Тестовий приклад може містити будь-яку кількість оголошень субтесту, і вони можуть бути довільно вкладеними.

source: See :ref:`subtests` for more information.
uk: Перегляньте :ref:`subtests` для отримання додаткової інформації.

source: Run the test without collecting the result. This allows exceptions raised by the test to be propagated to the caller, and can be used to support running tests under a debugger.
uk: Виконайте тест без отримання результату. Це дозволяє поширювати винятки, викликані тестом, до викликаючого, і може бути використано для підтримки запуску тестів під налагоджувачем.

source: The :class:`TestCase` class provides several assert methods to check for and report failures. The following table lists the most commonly used methods (see the tables below for more assert methods):
uk: Клас :class:`TestCase` надає кілька методів підтвердження для перевірки помилок і звітування про них. У наведеній нижче таблиці перераховано найпоширеніші методи (перегляньте таблиці нижче, щоб отримати більше методів підтвердження):

source: Method
uk: метод

source: Checks that
uk: Перевіряє це

source: New in
uk: Нове в

source: ``bool(x) is True``
uk: ``bool(x) має значення True``

source: ``bool(x) is False``
uk: ``bool(x) є False``

source: ``a is b``
uk: ``a є b``

source: ``a is not b``
uk: ``a не є b``

source: ``x is None``
uk: ``x не має значення``

source: ``x is not None``
uk: ``x не є None``

source: ``a in b``
uk: ``a в b``

source: ``a not in b``
uk: ``a не в b``

source: ``not isinstance(a, b)``
uk: ``не екземпляр(a, b)``

source: All the assert methods accept a *msg* argument that, if specified, is used as the error message on failure (see also :data:`longMessage`). Note that the *msg* keyword argument can be passed to :meth:`assertRaises`, :meth:`assertRaisesRegex`, :meth:`assertWarns`, :meth:`assertWarnsRegex` only when they are used as a context manager.
uk: Усі методи assert приймають аргумент *msg*, який, якщо вказано, використовується як повідомлення про помилку у разі помилки (див. також :data:`longMessage`). Зауважте, що аргумент ключового слова *msg* можна передати до :meth:`assertRaises`, :meth:`assertRaisesRegex`, :meth:`assertWarns`, :meth:`assertWarnsRegex` лише тоді, коли вони використовуються як менеджер контексту.

source: Test that *first* and *second* are equal. If the values do not compare equal, the test will fail.
uk: Перевірте, що *перше* і *друге* рівні. Якщо порівняльні значення не однакові, тест буде невдалим.

source: In addition, if *first* and *second* are the exact same type and one of list, tuple, dict, set, frozenset or str or any type that a subclass registers with :meth:`addTypeEqualityFunc` the type-specific equality function will be called in order to generate a more useful default error message (see also the :ref:`list of type-specific methods <type-specific-methods>`).
uk: Крім того, якщо *first* і *second* мають той самий тип і один із list, tuple, dict, set, frozenset або str або будь-який тип, який підклас реєструє за допомогою :meth:`addTypeEqualityFunc`, специфічна для типу функція рівності буде викликано, щоб створити більш корисне повідомлення про помилку за замовчуванням (див. також :ref:`список специфічних для типу методів <type-specific-methods>`).

source: Added the automatic calling of type-specific equality function.
uk: Додано автоматичний виклик функції рівності для певного типу.

source: :meth:`assertMultiLineEqual` added as the default type equality function for comparing strings.
uk: :meth:`assertMultiLineEqual` додано як функцію рівності типів за умовчанням для порівняння рядків.

source: Test that *first* and *second* are not equal. If the values do compare equal, the test will fail.
uk: Перевірте, що *перше* і *друге* не рівні. Якщо порівняльні значення однакові, тест буде невдалим.

source: Test that *expr* is true (or false).
uk: Перевірте, що *expr* є істинним (або хибним).

source: Note that this is equivalent to ``bool(expr) is True`` and not to ``expr is True`` (use ``assertIs(expr, True)`` for the latter). This method should also be avoided when more specific methods are available (e.g. ``assertEqual(a, b)`` instead of ``assertTrue(a == b)``), because they provide a better error message in case of failure.
uk: Зауважте, що це еквівалентно ``bool(expr) is True``, а не ``expr is True`` (використовуйте ``assertIs(expr, True)`` для останнього). Також слід уникати цього методу, якщо доступні більш специфічні методи (наприклад, ``assertEqual(a, b)`` замість ``assertTrue(a == b)``), тому що вони надають краще повідомлення про помилку в разі невдачі .

source: Test that *first* and *second* are (or are not) the same object.
uk: Перевірте, чи *перший* і *другий* є (чи не є) одним і тим же об’єктом.

source: Test that *expr* is (or is not) ``None``.
uk: Перевірте, що *expr* є (чи не є) ``None``.

source: Test that *member* is (or is not) in *container*.
uk: Перевірте, чи *член* є (чи ні) у *контейнері*.

source: Test that *obj* is (or is not) an instance of *cls* (which can be a class or a tuple of classes, as supported by :func:`isinstance`). To check for the exact type, use :func:`assertIs(type(obj), cls) <assertIs>`.
uk: Перевірте, що *obj* є (або не є) екземпляром *cls* (який може бути класом або кортежем класів, як підтримується :func:`isinstance`). Щоб перевірити точний тип, використовуйте :func:`assertIs(type(obj), cls) <assertIs>`.

source: It is also possible to check the production of exceptions, warnings, and log messages using the following methods:
uk: Також можна перевірити створення винятків, попереджень і повідомлень журналу за допомогою таких методів:

source: ``fun(*args, **kwds)`` raises *exc*
uk: ``fun(*args, **kwds)`` підвищує *exc*

source: ``fun(*args, **kwds)`` raises *exc* and the message matches regex *r*
uk: ``fun(*args, **kwds)`` викликає *exc* і повідомлення відповідає регулярному виразу *r*

source: ``fun(*args, **kwds)`` raises *warn*
uk: ``fun(*args, **kwds)`` викликає *попередження*

source: ``fun(*args, **kwds)`` raises *warn* and the message matches regex *r*
uk: ``fun(*args, **kwds)`` викликає *warn* і повідомлення відповідає регулярному виразу *r*

source: :meth:`assertLogs(logger, level) <TestCase.assertLogs>`
uk: :meth:`assertLogs(реєстратор, рівень) <TestCase.assertLogs>`

source: The ``with`` block logs on *logger* with minimum *level*
uk: Блок ``with`` реєструє *реєстратор* з мінімальним *рівнем*

source: :meth:`assertNoLogs(logger, level) <TestCase.assertNoLogs>`
uk: :meth:`assertNoLogs(реєстратор, рівень) <TestCase.assertNoLogs>`

source: The ``with`` block does not log on
uk: Блок ``with`` не входить в систему

source: *logger* with minimum *level*
uk: *логгер* з мінімальним *рівнем*

source: Test that an exception is raised when *callable* is called with any positional or keyword arguments that are also passed to :meth:`assertRaises`. The test passes if *exception* is raised, is an error if another exception is raised, or fails if no exception is raised. To catch any of a group of exceptions, a tuple containing the exception classes may be passed as *exception*.
uk: Перевірте, чи виникає виняток, коли *callable* викликається з будь-якими позиційними або ключовими аргументами, які також передаються в :meth:`assertRaises`. Перевірка проходить, якщо виникає *виняток*, вважається помилкою, якщо викликається інший виняток, або не виконується, якщо винятку не виникає. Щоб перехопити будь-яку групу винятків, кортеж, що містить класи винятків, можна передати як *виняток*.

source: If only the *exception* and possibly the *msg* arguments are given, return a context manager so that the code under test can be written inline rather than as a function::
uk: Якщо подано лише аргументи *exception* і, можливо, *msg*, поверніть диспетчер контексту, щоб тестований код можна було записати вбудовано, а не як функцію::

source: When used as a context manager, :meth:`assertRaises` accepts the additional keyword argument *msg*.
uk: У разі використання як менеджера контексту :meth:`assertRaises` приймає додатковий аргумент ключового слова *msg*.
