Repository: python/python-docs-uk
Catalog: library/unittest.po
Languages: uk

source: If an exception is raised during a ``setUpClass`` then the tests in the class are not run and the ``tearDownClass`` is not run. Skipped classes will not have ``setUpClass`` or ``tearDownClass`` run. If the exception is a :exc:`SkipTest` exception then the class will be reported as having been skipped instead of as an error.
uk: Якщо під час ``setUpClass`` виникає виняток, то тести в класі не запускаються, а ``tearDownClass`` не запускається. Пропущені класи не запускатимуть ``setUpClass`` або ``tearDownClass``. Якщо виняток є винятком :exc:`SkipTest`, тоді клас буде повідомлено як пропущений, а не як помилку.

source: setUpModule and tearDownModule
uk: setUpModule і tearDownModule

source: These should be implemented as functions::
uk: Вони повинні бути реалізовані як функції:

source: If an exception is raised in a ``setUpModule`` then none of the tests in the module will be run and the ``tearDownModule`` will not be run. If the exception is a :exc:`SkipTest` exception then the module will be reported as having been skipped instead of as an error.
uk: Якщо в ``setUpModule`` виникає виняток, тоді жоден із тестів у модулі не буде запущено, а ``tearDownModule`` не буде запущено. Якщо виняток є винятком :exc:`SkipTest`, тоді модуль буде повідомлено як пропущений, а не як помилку.

source: To add cleanup code that must be run even in the case of an exception, use ``addModuleCleanup``:
uk: Щоб додати код очищення, який потрібно запускати навіть у випадку винятку, використовуйте ``addModuleCleanup``:

source: Add a function to be called after :func:`tearDownModule` to cleanup resources used during the test class. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addModuleCleanup` when they are added.
uk: Додайте функцію, яка буде викликатися після :func:`tearDownModule` для очищення ресурсів, використаних під час тестового класу. Функції будуть викликані в порядку, зворотному порядку їх додавання (:abbr:`LIFO (останній прийшов, перший вийшов)`). Вони викликаються з будь-якими аргументами та ключовими аргументами, які передаються в :meth:`addModuleCleanup` під час їх додавання.

source: If :meth:`setUpModule` fails, meaning that :func:`tearDownModule` is not called, then any cleanup functions added will still be called.
uk: Якщо :meth:`setUpModule` не вдається, тобто :func:`tearDownModule` не викликається, тоді будь-які додані функції очищення все одно будуть викликані.

source: This function is called unconditionally after :func:`tearDownModule`, or after :func:`setUpModule` if :func:`setUpModule` raises an exception.
uk: Ця функція викликається безумовно після :func:`tearDownModule` або після :func:`setUpModule`, якщо :func:`setUpModule` викликає виняткову ситуацію.

source: It is responsible for calling all the cleanup functions added by :func:`addModuleCleanup`. If you need cleanup functions to be called *prior* to :func:`tearDownModule` then you can call :func:`doModuleCleanups` yourself.
uk: Він відповідає за виклик усіх функцій очищення, доданих :func:`addModuleCleanup`. Якщо вам потрібно, щоб функції очищення викликалися *перед* :func:`tearDownModule`, ви можете викликати :func:`doModuleCleanups` самостійно.

source: :func:`doModuleCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
uk: :func:`doModuleCleanups` витягує методи зі стеку функцій очищення по одному, тому їх можна викликати будь-коли.

source: Signal Handling
uk: Обробка сигналів

source: The control-c handling signal handler attempts to remain compatible with code or tests that install their own :const:`signal.SIGINT` handler. If the ``unittest`` handler is called but *isn't* the installed :const:`signal.SIGINT` handler, i.e. it has been replaced by the system under test and delegated to, then it calls the default handler. This will normally be the expected behavior by code that replaces an installed handler and delegates to it. For individual tests that need ``unittest`` control-c handling disabled the :func:`removeHandler` decorator can be used.
uk: Обробник сигналів обробки control-c намагається залишатися сумісним із кодом або тестами, які встановлюють власний обробник :const:`signal.SIGINT`. Якщо обробник ``unittest`` викликається, але *не* встановлений обробник :const:`signal.SIGINT`, тобто він був замінений тестованою системою та делегований, тоді він викликає обробник за замовчуванням. Зазвичай це буде очікувана поведінка коду, який замінює встановлений обробник і делегує йому. Для окремих тестів, які потребують вимкнення обробки ``unittest`` control-c, можна використовувати декоратор :func:`removeHandler`.

source: There are a few utility functions for framework authors to enable control-c handling functionality within test frameworks.
uk: Існує кілька службових функцій для авторів фреймворків, щоб увімкнути функціональність обробки control-c у тестових фреймворках.

source: Install the control-c handler. When a :const:`signal.SIGINT` is received (usually in response to the user pressing control-c) all registered results have :meth:`~TestResult.stop` called.
uk: Встановіть обробник control-c. Коли отримано :const:`signal.SIGINT` (зазвичай у відповідь на натискання користувачем control-c), усі зареєстровані результати викликають :meth:`~TestResult.stop`.

source: Register a :class:`TestResult` object for control-c handling. Registering a result stores a weak reference to it, so it doesn't prevent the result from being garbage collected.
uk: Зареєструйте об’єкт :class:`TestResult` для обробки control-c. Реєстрація результату зберігає слабке посилання на нього, тому це не запобігає збиранню сміття результату.

source: Registering a :class:`TestResult` object has no side-effects if control-c handling is not enabled, so test frameworks can unconditionally register all results they create independently of whether or not handling is enabled.
uk: Реєстрація об’єкта :class:`TestResult` не має побічних ефектів, якщо обробку control-c не ввімкнено, тому тестові фреймворки можуть беззастережно реєструвати всі створені ними результати незалежно від того, увімкнено обробку чи ні.

source: Remove a registered result. Once a result has been removed then :meth:`~TestResult.stop` will no longer be called on that result object in response to a control-c.
uk: Видалити зареєстрований результат. Після видалення результату :meth:`~TestResult.stop` більше не викликатиметься для цього об’єкта результату у відповідь на control-c.

source: When called without arguments this function removes the control-c handler if it has been installed. This function can also be used as a test decorator to temporarily remove the handler while the test is being executed::
uk: При виклику без аргументів ця функція видаляє обробник control-c, якщо він був встановлений. Цю функцію також можна використовувати як декоратор тесту для тимчасового видалення обробника під час виконання тесту:
