Repository: python/python-docs-uk
Catalog: library/unittest.po
Languages: uk

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding the reason for skipping the test.
uk: Список, що містить 2 кортежі екземплярів :class:`TestCase` і рядки з причиною пропуску тесту.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents an expected failure or error of the test case.
uk: Список, що містить 2 кортежі екземплярів :class:`TestCase` і рядки, що містять відформатовані відстеження. Кожен кортеж представляє очікуваний збій або помилку тестового випадку.

source: A list containing :class:`TestCase` instances that were marked as expected failures, but succeeded.
uk: Список, що містить екземпляри :class:`TestCase`, які були позначені як очікувані помилки, але були успішними.

source: Set to ``True`` when the execution of tests should stop by :meth:`stop`.
uk: Установіть значення ``True``, коли виконання тестів має зупинятися на :meth:`stop`.

source: The total number of tests run so far.
uk: Загальна кількість проведених тестів.

source: If set to true, ``sys.stdout`` and ``sys.stderr`` will be buffered in between :meth:`startTest` and :meth:`stopTest` being called. Collected output will only be echoed onto the real ``sys.stdout`` and ``sys.stderr`` if the test fails or errors. Any output is also attached to the failure / error message.
uk: Якщо встановлено значення true, ``sys.stdout`` і ``sys.stderr`` будуть буферизовані між викликами :meth:`startTest` і :meth:`stopTest`. Зібраний вихід буде відображено на справжній ``sys.stdout`` і ``sys.stderr`` лише у разі невдачі тесту або помилок. Будь-який вихід також додається до повідомлення про збій/помилку.

source: If set to true :meth:`stop` will be called on the first failure or error, halting the test run.
uk: Якщо встановлено значення true, :meth:`stop` буде викликано при першій невдачі або помилці, зупиняючи тестовий запуск.

source: If set to true then local variables will be shown in tracebacks.
uk: Якщо встановлено значення true, то локальні змінні відображатимуться у відстеженнях.

source: Return ``True`` if all tests run so far have passed, otherwise returns ``False``.
uk: Повертає ``True``, якщо всі тести, запущені до цього моменту, пройдено, інакше повертає ``False``.

source: Returns ``False`` if there were any :attr:`unexpectedSuccesses` from tests marked with the :func:`expectedFailure` decorator.
uk: Повертає ``False``, якщо були будь-які :attr:`unexpectedSuccesses` від тестів, позначених декоратором :func:`expectedFailure`.

source: This method can be called to signal that the set of tests being run should be aborted by setting the :attr:`shouldStop` attribute to ``True``. :class:`TestRunner` objects should respect this flag and return without running any additional tests.
uk: Цей метод можна викликати, щоб повідомити про те, що набір запущених тестів має бути перервано, встановивши атрибут :attr:`shouldStop` на ``True``. Об’єкти :class:`TestRunner` мають поважати цей прапор і повертатися без виконання додаткових тестів.

source: For example, this feature is used by the :class:`TextTestRunner` class to stop the test framework when the user signals an interrupt from the keyboard. Interactive tools which provide :class:`TestRunner` implementations can use this in a similar manner.
uk: Наприклад, ця функція використовується класом :class:`TextTestRunner`, щоб зупинити тестову структуру, коли користувач сигналізує про переривання з клавіатури. Інтерактивні інструменти, які забезпечують реалізації :class:`TestRunner`, можуть використовувати це подібним чином.

source: The following methods of the :class:`TestResult` class are used to maintain the internal data structures, and may be extended in subclasses to support additional reporting requirements. This is particularly useful in building tools which support interactive reporting while tests are being run.
uk: Наступні методи класу :class:`TestResult` використовуються для підтримки внутрішніх структур даних і можуть бути розширені в підкласах для підтримки додаткових вимог до звітності. Це особливо корисно для створення інструментів, які підтримують інтерактивне звітування під час виконання тестів.

source: Called when the test case *test* is about to be run.
uk: Викликається, коли тестовий приклад *test* збирається запустити.

source: Called after the test case *test* has been executed, regardless of the outcome.
uk: Викликається після виконання тесту *test*, незалежно від результату.

source: Called once before any tests are executed.
uk: Викликається один раз перед виконанням будь-яких тестів.

source: Called once after all tests are executed.
uk: Викликається один раз після виконання всіх тестів.

source: Called when the test case *test* raises an unexpected exception. *err* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
uk: Викликається, коли тестовий приклад *test* викликає несподіваний виняток. *err* — це кортеж у формі, яку повертає :func:`sys.exc_info`: ``(тип, значення, відстеження)``.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`errors` attribute, where *formatted_err* is a formatted traceback derived from *err*.
uk: Реалізація за замовчуванням додає кортеж ``(test, formatted_err)`` до атрибута екземпляра :attr:`errors`, де *formatted_err* є відформатованим зворотним трасуванням, отриманим від *err*.

source: Called when the test case *test* signals a failure. *err* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
uk: Викликається, коли тестовий приклад *test* сигналізує про помилку. *err* — це кортеж у формі, яку повертає :func:`sys.exc_info`: ``(тип, значення, відстеження)``.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`failures` attribute, where *formatted_err* is a formatted traceback derived from *err*.
uk: Реалізація за замовчуванням додає кортеж ``(test, formatted_err)`` до атрибута екземпляра :attr:`failures`, де *formatted_err* є відформатованим зворотним трасуванням, отриманим від *err*.

source: Called when the test case *test* succeeds.
uk: Викликається, коли тестовий приклад *test* виконується успішно.

source: The default implementation does nothing.
uk: Стандартна реалізація нічого не робить.

source: Called when the test case *test* is skipped. *reason* is the reason the test gave for skipping.
uk: Викликається, коли тестовий приклад *test* пропускається. *причина* — причина пропуску тесту.

source: The default implementation appends a tuple ``(test, reason)`` to the instance's :attr:`skipped` attribute.
uk: Реалізація за замовчуванням додає кортеж ``(test, reason)`` до атрибута екземпляра :attr:`skipped`.

source: Called when the test case *test* fails or errors, but was marked with the :func:`expectedFailure` decorator.
uk: Викликається, коли тестовий приклад *test* зазнає невдачі або помилки, але його позначено декоратором :func:`expectedFailure`.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`expectedFailures` attribute, where *formatted_err* is a formatted traceback derived from *err*.
uk: Реалізація за замовчуванням додає кортеж ``(test, formatted_err)`` до атрибута екземпляра :attr:`expectedFailures`, де *formatted_err* є відформатованим зворотним трасуванням, отриманим від *err*.

source: Called when the test case *test* was marked with the :func:`expectedFailure` decorator, but succeeded.
uk: Викликається, коли тестовий приклад *test* був позначений декоратором :func:`expectedFailure`, але завершився успішно.

source: The default implementation appends the test to the instance's :attr:`unexpectedSuccesses` attribute.
uk: Стандартна реалізація додає тест до атрибута екземпляра :attr:`unexpectedSuccesses`.

source: Called when a subtest finishes. *test* is the test case corresponding to the test method. *subtest* is a custom :class:`TestCase` instance describing the subtest.
uk: Викликається після завершення підтесту. *test* — тестовий приклад, що відповідає методу тестування. *subtest* — це спеціальний екземпляр :class:`TestCase`, який описує субтест.

source: If *outcome* is :const:`None`, the subtest succeeded. Otherwise, it failed with an exception where *outcome* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
uk: Якщо *результат* :const:`None`, субтест пройшов успішно. В іншому випадку це не вдалося за винятком, коли *результат* є кортежем форми, яку повертає :func:`sys.exc_info`: ``(тип, значення, відстеження)``.

source: The default implementation does nothing when the outcome is a success, and records subtest failures as normal failures.
uk: Реалізація за замовчуванням не робить нічого, якщо результат є успішним, і записує помилки підтесту як звичайні помилки.

source: Instance of the :class:`TestLoader` class intended to be shared. If no customization of the :class:`TestLoader` is needed, this instance can be used instead of repeatedly creating new instances.
uk: Примірник класу :class:`TestLoader` призначений для спільного використання. Якщо налаштування :class:`TestLoader` не потрібні, цей екземпляр можна використовувати замість повторного створення нових екземплярів.

source: A basic test runner implementation that outputs results to a stream. If *stream* is ``None``, the default, :data:`sys.stderr` is used as the output stream. This class has a few configurable parameters, but is essentially very simple. Graphical applications which run test suites should provide alternate implementations. Such implementations should accept ``**kwargs`` as the interface to construct runners changes when features are added to unittest.
uk: Базова реалізація програми виконання тестів, яка виводить результати в потік. Якщо *stream* має значення ``None``, стандартний :data:`sys.stderr` використовується як вихідний потік. Цей клас має декілька настроюваних параметрів, але по суті дуже простий. Графічні програми, які запускають набори тестів, повинні надавати альтернативні реалізації. Такі реалізації повинні приймати ``**kwargs``, оскільки інтерфейс для створення бігунів змінюється, коли функції додаються до unittest.

source: The default stream is set to :data:`sys.stderr` at instantiation time rather than import time.
uk: Потік за замовчуванням встановлено на :data:`sys.stderr` під час створення екземпляра, а не під час імпорту.

source: This method returns the instance of ``TestResult`` used by :meth:`run`. It is not intended to be called directly, but can be overridden in subclasses to provide a custom ``TestResult``.
uk: Цей метод повертає екземпляр ``TestResult``, який використовується :meth:`run`. Він не призначений для безпосереднього виклику, але може бути замінений у підкласах, щоб надати спеціальний ``TestResult``.

source: ``_makeResult()`` instantiates the class or callable passed in the ``TextTestRunner`` constructor as the ``resultclass`` argument. It defaults to :class:`TextTestResult` if no ``resultclass`` is provided. The result class is instantiated with the following arguments::
uk: ``_makeResult()`` створює екземпляр класу або виклику, переданого в конструкторі ``TextTestRunner`` як аргумент ``resultclass``. За замовчуванням :class:`TextTestResult`, якщо не надано ``resultclass``. Клас результату створюється з такими аргументами:

source: This method is the main public interface to the ``TextTestRunner``. This method takes a :class:`TestSuite` or :class:`TestCase` instance. A :class:`TestResult` is created by calling :func:`_makeResult` and the test(s) are run and the results printed to stdout.
uk: Цей метод є основним публічним інтерфейсом для ``TextTestRunner``. Цей метод приймає екземпляр :class:`TestSuite` або :class:`TestCase`. :class:`TestResult` створюється шляхом виклику :func:`_makeResult`, і тест(и) запускаються, а результати виводяться на stdout.

source: A command-line program that loads a set of tests from *module* and runs them; this is primarily for making test modules conveniently executable. The simplest use for this function is to include the following line at the end of a test script::
uk: Програма командного рядка, яка завантажує набір тестів із *модуля* та запускає їх; це насамперед для того, щоб зробити тестові модулі зручними для виконання. Найпростішим використанням цієї функції є додавання такого рядка в кінці тестового сценарію::

source: You can run tests with more detailed information by passing in the verbosity argument::
uk: Ви можете запустити тести з більш детальною інформацією, передавши аргумент verbosity::

source: The *defaultTest* argument is either the name of a single test or an iterable of test names to run if no test names are specified via *argv*. If not specified or ``None`` and no test names are provided via *argv*, all tests found in *module* are run.
uk: Аргумент *defaultTest* — це або назва окремого тесту, або ітерація імен тестів для запуску, якщо жодні імена тестів не вказані через *argv*. Якщо не вказано або ``None``, а імена тестів не надаються через *argv*, запускаються всі тести, знайдені в *module*.

source: The *argv* argument can be a list of options passed to the program, with the first element being the program name. If not specified or ``None``, the values of :data:`sys.argv` are used.
uk: Аргумент *argv* може бути списком параметрів, переданих програмі, з першим елементом, який є назвою програми. Якщо не вказано або ``None``, використовуються значення :data:`sys.argv`.

source: The *testLoader* argument has to be a :class:`TestLoader` instance, and defaults to :data:`defaultTestLoader`.
uk: Аргумент *testLoader* має бути екземпляром :class:`TestLoader` і за умовчанням має значення :data:`defaultTestLoader`.

source: ``main`` supports being used from the interactive interpreter by passing in the argument ``exit=False``. This displays the result on standard output without calling :func:`sys.exit`::
uk: ``main`` підтримує використання з інтерактивного інтерпретатора шляхом передачі аргументу ``exit=False``. Це відображає результат у стандартному виводі без виклику :func:`sys.exit`::

source: The *failfast*, *catchbreak* and *buffer* parameters have the same effect as the same-name `command-line options`_.
uk: Параметри *failfast*, *catchbreak* і *buffer* мають той самий ефект, що й одноіменні параметри командного рядка (`command-line options`_).

source: The *warnings* argument specifies the :ref:`warning filter <warning-filter>` that should be used while running the tests. If it's not specified, it will remain ``None`` if a :option:`!-W` option is passed to :program:`python` (see :ref:`Warning control <using-on-warnings>`), otherwise it will be set to ``'default'``.
uk: Аргумент *попередження* вказує :ref:`фільтр попереджень <warning-filter>`, який слід використовувати під час виконання тестів. Якщо його не вказано, він залишатиметься ``None``, якщо параметр :option:`!-W` передано :program:`python` (див. :ref:`Контроль попередження <using-on-warnings>`), інакше він буде встановлений на ``'за замовчуванням``.

source: The *exit* parameter was added.
uk: Додано параметр *exit*.

source: The *verbosity*, *failfast*, *catchbreak*, *buffer* and *warnings* parameters were added.
uk: Додано параметри *verbosity*, *failfast*, *catchbreak*, *buffer* і *warnings*.

source: The *defaultTest* parameter was changed to also accept an iterable of test names.
uk: Параметр *defaultTest* було змінено, щоб також приймати ітерацію імен тестів.

source: load_tests Protocol
uk: протокол load_tests

source: Modules or packages can customize how tests are loaded from them during normal test runs or test discovery by implementing a function called ``load_tests``.
uk: Модулі або пакунки можуть налаштувати спосіб завантаження тестів з них під час звичайних тестових прогонів або виявлення тестів, реалізувавши функцію під назвою ``load_tests``.

source: If a test module defines ``load_tests`` it will be called by :meth:`TestLoader.loadTestsFromModule` with the following arguments::
uk: Якщо тестовий модуль визначає ``load_tests``, він буде викликаний :meth:`TestLoader.loadTestsFromModule` з такими аргументами::

source: where *pattern* is passed straight through from ``loadTestsFromModule``. It defaults to ``None``.
uk: де *шаблон* передається безпосередньо з ``loadTestsFromModule``. За замовчуванням ``None``.

source: It should return a :class:`TestSuite`.
uk: Він має повернути :class:`TestSuite`.

source: *loader* is the instance of :class:`TestLoader` doing the loading. *standard_tests* are the tests that would be loaded by default from the module. It is common for test modules to only want to add or remove tests from the standard set of tests. The third argument is used when loading packages as part of test discovery.
uk: *loader* — це екземпляр :class:`TestLoader`, який виконує завантаження. *standard_tests* — це тести, які за замовчуванням завантажуватимуться з модуля. Зазвичай тестові модулі хочуть лише додавати або видаляти тести зі стандартного набору тестів. Третій аргумент використовується під час завантаження пакетів у рамках виявлення тесту.

source: A typical ``load_tests`` function that loads tests from a specific set of :class:`TestCase` classes may look like::
uk: Типова функція ``load_tests``, яка завантажує тести з певного набору класів :class:`TestCase`, може виглядати так:

source: If discovery is started in a directory containing a package, either from the command line or by calling :meth:`TestLoader.discover`, then the package :file:`__init__.py` will be checked for ``load_tests``. If that function does not exist, discovery will recurse into the package as though it were just another directory. Otherwise, discovery of the package's tests will be left up to ``load_tests`` which is called with the following arguments::
uk: Якщо відкриття розпочато в каталозі, що містить пакет, або з командного рядка, або викликом :meth:`TestLoader.discover`, тоді пакет :file:`__init__.py` буде перевірено на ``load_tests``. Якщо ця функція не існує, виявлення повториться в пакунку так, ніби це просто інший каталог. В іншому випадку виявлення тестів пакета буде залишено до ``load_tests``, який викликається з такими аргументами::

source: This should return a :class:`TestSuite` representing all the tests from the package. (``standard_tests`` will only contain tests collected from :file:`__init__.py`.)
uk: Це має повернути :class:`TestSuite`, що представляє всі тести з пакета. (``standard_tests`` міститиме лише тести, зібрані з :file:`__init__.py`.)

source: Because the pattern is passed into ``load_tests`` the package is free to continue (and potentially modify) test discovery. A 'do nothing' ``load_tests`` function for a test package would look like::
uk: Оскільки шаблон передається в ``load_tests``, пакунок може продовжувати (і потенційно змінювати) пошук тестів. Функція ``load_tests`` 'нічого не робити' для тестового пакета виглядатиме так:

source: Discovery no longer checks package names for matching *pattern* due to the impossibility of package names matching the default pattern.
uk: Discovery більше не перевіряє назви пакетів на відповідність *шаблону* через те, що назви пакетів не відповідають шаблону за замовчуванням.

source: Class and Module Fixtures
uk: Фікстури класів і модулів

source: Class and module level fixtures are implemented in :class:`TestSuite`. When the test suite encounters a test from a new class then :meth:`tearDownClass` from the previous class (if there is one) is called, followed by :meth:`setUpClass` from the new class.
uk: Фікстури рівня класу та модуля реалізовано в :class:`TestSuite`. Коли набір тестів зустрічає тест з нового класу, викликається :meth:`tearDownClass` з попереднього класу (якщо він є), а потім :meth:`setUpClass` з нового класу.

source: Similarly if a test is from a different module from the previous test then ``tearDownModule`` from the previous module is run, followed by ``setUpModule`` from the new module.
uk: Подібним чином, якщо тест виконується з модуля, відмінного від попереднього, тоді запускається ``tearDownModule`` з попереднього модуля, а потім ``setUpModule`` з нового модуля.

source: After all the tests have run the final ``tearDownClass`` and ``tearDownModule`` are run.
uk: Після виконання всіх тестів запускаються остаточні ``tearDownClass`` і ``tearDownModule``.

source: Note that shared fixtures do not play well with [potential] features like test parallelization and they break test isolation. They should be used with care.
uk: Зауважте, що спільні прилади погано працюють із [потенційними] функціями, такими як розпаралелювання тестів, і вони порушують ізоляцію тестів. Їх слід використовувати обережно.

source: The default ordering of tests created by the unittest test loaders is to group all tests from the same modules and classes together. This will lead to ``setUpClass`` / ``setUpModule`` (etc) being called exactly once per class and module. If you randomize the order, so that tests from different modules and classes are adjacent to each other, then these shared fixture functions may be called multiple times in a single test run.
uk: Стандартний порядок тестів, створених завантажувачами тестів unittest, полягає в тому, щоб групувати всі тести з однакових модулів і класів разом. Це призведе до виклику ``setUpClass`` / ``setUpModule`` (і т.д.) рівно один раз для кожного класу та модуля. Якщо ви рандомізуєте порядок, щоб тести з різних модулів і класів були суміжними один з одним, тоді ці спільні функції фікстури можуть викликатися кілька разів під час одного запуску тесту.

source: Shared fixtures are not intended to work with suites with non-standard ordering. A ``BaseTestSuite`` still exists for frameworks that don't want to support shared fixtures.
uk: Спільні світильники не призначені для роботи з комплектами з нестандартним упорядкуванням. ``BaseTestSuite`` все ще існує для фреймворків, які не хочуть підтримувати спільні фікстури.

source: If there are any exceptions raised during one of the shared fixture functions the test is reported as an error. Because there is no corresponding test instance an ``_ErrorHolder`` object (that has the same interface as a :class:`TestCase`) is created to represent the error. If you are just using the standard unittest test runner then this detail doesn't matter, but if you are a framework author it may be relevant.
uk: Якщо є будь-які винятки, викликані під час однієї зі спільних функцій приладу, тест повідомляється як помилка. Оскільки немає відповідного екземпляра тесту, для представлення помилки створюється об’єкт ``_ErrorHolder`` (який має той самий інтерфейс, що й :class:`TestCase`). Якщо ви просто використовуєте стандартний модуль тестування, ця деталь не має значення, але якщо ви є автором фреймворку, вона може бути актуальною.

source: setUpClass and tearDownClass
uk: setUpClass і tearDownClass

source: These must be implemented as class methods::
uk: Вони повинні бути реалізовані як методи класу:

source: If you want the ``setUpClass`` and ``tearDownClass`` on base classes called then you must call up to them yourself. The implementations in :class:`TestCase` are empty.
uk: Якщо ви хочете викликати ``setUpClass`` і ``tearDownClass`` базових класів, ви повинні викликати їх самостійно. Реалізації в :class:`TestCase` порожні.
