Repository: python/python-docs-uk
Catalog: library/unittest.po
Languages: uk

source: Add a function to be called after :meth:`tearDownClass` to cleanup resources used during the test class. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addClassCleanup` when they are added.
uk: Додайте функцію, яка буде викликатися після :meth:`tearDownClass` до ресурсів очищення, використаних під час тестового класу. Функції будуть викликані в порядку, зворотному порядку їх додавання (:abbr:`LIFO (останній прийшов, перший вийшов)`). Вони викликаються з будь-якими аргументами та ключовими аргументами, які передаються в :meth:`addClassCleanup` під час їх додавання.

source: If :meth:`setUpClass` fails, meaning that :meth:`tearDownClass` is not called, then any cleanup functions added will still be called.
uk: Якщо :meth:`setUpClass` не вдається, тобто :meth:`tearDownClass` не викликається, тоді будь-які додані функції очищення все одно будуть викликані.

source: This method is called unconditionally after :meth:`tearDownClass`, or after :meth:`setUpClass` if :meth:`setUpClass` raises an exception.
uk: Цей метод викликається безумовно після :meth:`tearDownClass` або після :meth:`setUpClass`, якщо :meth:`setUpClass` викликає виняток.

source: It is responsible for calling all the cleanup functions added by :meth:`addClassCleanup`. If you need cleanup functions to be called *prior* to :meth:`tearDownClass` then you can call :meth:`doClassCleanups` yourself.
uk: Він відповідає за виклик усіх функцій очищення, доданих :meth:`addClassCleanup`. Якщо вам потрібно, щоб функції очищення викликалися *перед* :meth:`tearDownClass`, ви можете викликати :meth:`doClassCleanups` самостійно.

source: :meth:`doClassCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
uk: :meth:`doClassCleanups` витягує методи зі стеку функцій очищення по одному, тому їх можна викликати будь-коли.

source: This class provides an API similar to :class:`TestCase` and also accepts coroutines as test functions.
uk: Цей клас надає API, подібний до :class:`TestCase`, а також приймає співпрограми як тестові функції.

source: Method called to prepare the test fixture. This is called after :meth:`setUp`. This is called immediately before calling the test method; other than :exc:`AssertionError` or :exc:`SkipTest`, any exception raised by this method will be considered an error rather than a test failure. The default implementation does nothing.
uk: Метод, який називається для підготовки випробувального матеріалу. Це викликається після :meth:`setUp`. Це викликається безпосередньо перед викликом тестового методу; крім :exc:`AssertionError` або :exc:`SkipTest`, будь-який виняток, викликаний цим методом, вважатиметься помилкою, а не помилкою тесту. Стандартна реалізація нічого не робить.

source: Method called immediately after the test method has been called and the result recorded. This is called before :meth:`tearDown`. This is called even if the test method raised an exception, so the implementation in subclasses may need to be particularly careful about checking internal state. Any exception, other than :exc:`AssertionError` or :exc:`SkipTest`, raised by this method will be considered an additional error rather than a test failure (thus increasing the total number of reported errors). This method will only be called if the :meth:`asyncSetUp` succeeds, regardless of the outcome of the test method. The default implementation does nothing.
uk: Метод викликається відразу після виклику тестового методу та запису результату. Це викликається перед :meth:`tearDown`. Це викликається, навіть якщо метод тестування викликав виняток, тому реалізація в підкласах може потребувати особливої обережності щодо перевірки внутрішнього стану. Будь-які винятки, окрім :exc:`AssertionError` або :exc:`SkipTest`, викликані цим методом, вважатимуться додатковою помилкою, а не помилкою тесту (таким чином збільшуючи загальну кількість повідомлених помилок). Цей метод буде викликано, лише якщо :meth:`asyncSetUp` завершиться успішно, незалежно від результату тестового методу. Стандартна реалізація нічого не робить.

source: This method accepts a coroutine that can be used as a cleanup function.
uk: Цей метод приймає співпрограму, яку можна використовувати як функцію очищення.

source: Sets up a new event loop to run the test, collecting the result into the :class:`TestResult` object passed as *result*. If *result* is omitted or ``None``, a temporary result object is created (by calling the :meth:`defaultTestResult` method) and used. The result object is returned to :meth:`run`'s caller. At the end of the test all the tasks in the event loop are cancelled.
uk: Встановлює новий цикл подій для запуску тесту, збираючи результат в об’єкт :class:`TestResult`, переданий як *результат*. Якщо *результат* пропущено або ``None``, створюється та використовується тимчасовий об’єкт результату (викликом методу :meth:`defaultTestResult`). Об’єкт результату повертається до виклику :meth:`run`. Після закінчення тесту всі завдання в циклі подій скасовуються.

source: An example illustrating the order::
uk: Приклад, що ілюструє порядок::

source: After running the test, ``events`` would contain ``["setUp", "asyncSetUp", "test_response", "asyncTearDown", "tearDown", "cleanup"]``.
uk: Після виконання тесту ``події`` міститимуть ``["setUp", "asyncSetUp", "test_response", "asyncTearDown", "tearDown", "cleanup"]``.

source: This class implements the portion of the :class:`TestCase` interface which allows the test runner to drive the test, but does not provide the methods which test code can use to check and report errors. This is used to create test cases using legacy test code, allowing it to be integrated into a :mod:`unittest`-based test framework.
uk: Цей клас реалізує частину інтерфейсу :class:`TestCase`, яка дозволяє виконавцю тесту управляти тестом, але не надає методів, які тестовий код може використовувати для перевірки та звітування про помилки. Це використовується для створення тестів із використанням застарілого тестового коду, що дозволяє інтегрувати його в тестову структуру на основі :mod:`unittest`.

source: Grouping tests
uk: Групування тестів

source: This class represents an aggregation of individual test cases and test suites. The class presents the interface needed by the test runner to allow it to be run as any other test case. Running a :class:`TestSuite` instance is the same as iterating over the suite, running each test individually.
uk: Цей клас представляє сукупність окремих тестових випадків і наборів тестів. Клас представляє інтерфейс, необхідний виконавцю тесту, щоб дозволити йому запускатися як будь-який інший тестовий приклад. Запуск екземпляра :class:`TestSuite` — це те саме, що ітерація по набору, запускаючи кожен тест окремо.

source: If *tests* is given, it must be an iterable of individual test cases or other test suites that will be used to build the suite initially. Additional methods are provided to add test cases and suites to the collection later on.
uk: Якщо надано *тести*, це має бути ітерація окремих тестових випадків або інших наборів тестів, які будуть використані для створення набору спочатку. Додаткові методи надаються для додавання тестів і пакетів до колекції пізніше.

source: :class:`TestSuite` objects behave much like :class:`TestCase` objects, except they do not actually implement a test. Instead, they are used to aggregate tests into groups of tests that should be run together. Some additional methods are available to add tests to :class:`TestSuite` instances:
uk: Об’єкти :class:`TestSuite` поводяться так само, як об’єкти :class:`TestCase`, за винятком того, що вони насправді не реалізують тест. Натомість вони використовуються для агрегування тестів у групи тестів, які слід виконувати разом. Деякі додаткові методи доступні для додавання тестів до екземплярів :class:`TestSuite`:

source: Add a :class:`TestCase` or :class:`TestSuite` to the suite.
uk: Додайте :class:`TestCase` або :class:`TestSuite` до набору.

source: Add all the tests from an iterable of :class:`TestCase` and :class:`TestSuite` instances to this test suite.
uk: Додайте всі тести з ітерації екземплярів :class:`TestCase` і :class:`TestSuite` до цього набору тестів.

source: This is equivalent to iterating over *tests*, calling :meth:`addTest` for each element.
uk: Це еквівалентно повторенню *тестів*, виклику :meth:`addTest` для кожного елемента.

source: :class:`TestSuite` shares the following methods with :class:`TestCase`:
uk: :class:`TestSuite` використовує такі методи спільно з :class:`TestCase`:

source: Run the tests associated with this suite, collecting the result into the test result object passed as *result*. Note that unlike :meth:`TestCase.run`, :meth:`TestSuite.run` requires the result object to be passed in.
uk: Запустіть тести, пов’язані з цим набором, зібравши результат в об’єкт результату тесту, переданий як *результат*. Зауважте, що на відміну від :meth:`TestCase.run`, :meth:`TestSuite.run` вимагає передачі об’єкта результату.

source: Run the tests associated with this suite without collecting the result. This allows exceptions raised by the test to be propagated to the caller and can be used to support running tests under a debugger.
uk: Виконуйте тести, пов’язані з цим пакетом, без збору результатів. Це дозволяє поширювати винятки, викликані тестом, до абонента та може використовуватися для підтримки запуску тестів під налагоджувачем.

source: Return the number of tests represented by this test object, including all individual tests and sub-suites.
uk: Повертає кількість тестів, представлених цим тестовим об’єктом, включаючи всі окремі тести та піднабори.

source: In earlier versions the :class:`TestSuite` held references to each :class:`TestCase` after :meth:`TestSuite.run`. Subclasses can restore that behavior by overriding :meth:`TestSuite._removeTestAtIndex`.
uk: У попередніх версіях :class:`TestSuite` містив посилання на кожен :class:`TestCase` після :meth:`TestSuite.run`. Підкласи можуть відновити цю поведінку, замінивши :meth:`TestSuite._removeTestAtIndex`.

source: In the typical usage of a :class:`TestSuite` object, the :meth:`run` method is invoked by a :class:`TestRunner` rather than by the end-user test harness.
uk: У типовому використанні об’єкта :class:`TestSuite` метод :meth:`run` викликається :class:`TestRunner`, а не тестовим пакетом кінцевого користувача.

source: Loading and running tests
uk: Завантаження та виконання тестів

source: The :class:`TestLoader` class is used to create test suites from classes and modules. Normally, there is no need to create an instance of this class; the :mod:`unittest` module provides an instance that can be shared as :data:`unittest.defaultTestLoader`. Using a subclass or instance, however, allows customization of some configurable properties.
uk: Клас :class:`TestLoader` використовується для створення наборів тестів із класів і модулів. Зазвичай немає необхідності створювати екземпляр цього класу; модуль :mod:`unittest` надає екземпляр, який можна використовувати як :data:`unittest.defaultTestLoader`. Однак використання підкласу або екземпляра дозволяє налаштувати деякі настроювані властивості.

source: :class:`TestLoader` objects have the following attributes:
uk: :class:`TestLoader` об’єкти мають такі атрибути:

source: :class:`TestLoader` objects have the following methods:
uk: Об’єкти :class:`TestLoader` мають такі методи:

source: Return a suite of all test cases contained in the :class:`TestCase`\ -derived :class:`testCaseClass`.
uk: Повертає набір усіх тестів, що містяться в :class:`TestCase`\ -похідному :class:`testCaseClass`.

source: A test case instance is created for each method named by :meth:`getTestCaseNames`. By default these are the method names beginning with ``test``. If :meth:`getTestCaseNames` returns no methods, but the :meth:`runTest` method is implemented, a single test case is created for that method instead.
uk: Екземпляр тестового випадку створюється для кожного методу, названого :meth:`getTestCaseNames`. За замовчуванням це імена методів, які починаються з ``test``. Якщо :meth:`getTestCaseNames` не повертає жодних методів, але реалізовано метод :meth:`runTest`, натомість для цього методу створюється один тестовий приклад.

source: Return a suite of all test cases contained in the given module. This method searches *module* for classes derived from :class:`TestCase` and creates an instance of the class for each test method defined for the class.
uk: Повертає набір усіх тестів, що містяться в даному модулі. Цей метод шукає в *module* класи, похідні від :class:`TestCase`, і створює екземпляр класу для кожного тестового методу, визначеного для класу.

source: While using a hierarchy of :class:`TestCase`\ -derived classes can be convenient in sharing fixtures and helper functions, defining test methods on base classes that are not intended to be instantiated directly does not play well with this method. Doing so, however, can be useful when the fixtures are different and defined in subclasses.
uk: Хоча використання ієрархії похідних класів :class:`TestCase`\ може бути зручним для спільного використання фікстур і допоміжних функцій, визначення методів тестування на базових класах, які не призначені для безпосереднього створення екземплярів, не підходить для цього методу. Однак це може бути корисним, коли прилади різні та визначені в підкласах.

source: If a module provides a ``load_tests`` function it will be called to load the tests. This allows modules to customize test loading. This is the `load_tests protocol`_. The *pattern* argument is passed as the third argument to ``load_tests``.
uk: Якщо модуль надає функцію ``load_tests``, її буде викликано для завантаження тестів. Це дозволяє модулям налаштовувати тестове завантаження. Це протокол `load_tests`_. Аргумент *pattern* передається як третій аргумент у ``load_tests``.

source: Support for ``load_tests`` added.
uk: Додано підтримку ``load_tests``.

source: Return a suite of all test cases given a string specifier.
uk: Повертає набір усіх тестів із специфікатором рядка.

source: The specifier *name* is a "dotted name" that may resolve either to a module, a test case class, a test method within a test case class, a :class:`TestSuite` instance, or a callable object which returns a :class:`TestCase` or :class:`TestSuite` instance. These checks are applied in the order listed here; that is, a method on a possible test case class will be picked up as "a test method within a test case class", rather than "a callable object".
uk: Специфікатор *name* — це "ім’я з крапками", яке може перетворюватися на модуль, клас тестового прикладу, метод тестування в класі тестового випадку, екземпляр :class:`TestSuite` або викликаний об’єкт, який повертає: екземпляр :class:`TestCase` або :class:`TestSuite`. Ці перевірки застосовуються в зазначеному тут порядку; тобто метод у можливому класі тестового випадку буде вибрано як "метод тестування в класі тестового випадку", а не як "об'єкт, який можна викликати".

source: For example, if you have a module :mod:`SampleTests` containing a :class:`TestCase`\ -derived class :class:`SampleTestCase` with three test methods (:meth:`test_one`, :meth:`test_two`, and :meth:`test_three`), the specifier ``'SampleTests.SampleTestCase'`` would cause this method to return a suite which will run all three test methods. Using the specifier ``'SampleTests.SampleTestCase.test_two'`` would cause it to return a test suite which will run only the :meth:`test_two` test method. The specifier can refer to modules and packages which have not been imported; they will be imported as a side-effect.
uk: Наприклад, якщо у вас є модуль :mod:`SampleTests`, який містить :class:`TestCase`\ -похідний клас :class:`SampleTestCase` із трьома методами тестування (:meth:`test_one`, :meth:`test_two` і :meth:`test_three`), специфікатор ``'SampleTests.SampleTestCase'`` призведе до того, що цей метод повертатиме набір, який виконуватиме всі три методи тестування. Використання специфікатора ``'SampleTests.SampleTestCase.test_two`` призведе до повернення набору тестів, який запускатиме лише метод тестування :meth:`test_two`. Специфікатор може посилатися на модулі та пакунки, які не були імпортовані; вони будуть імпортовані як побічний ефект.

source: The method optionally resolves *name* relative to the given *module*.
uk: Метод необов’язково розпізнає *ім’я* відносно даного *модуля*.

source: If an :exc:`ImportError` or :exc:`AttributeError` occurs while traversing *name* then a synthetic test that raises that error when run will be returned. These errors are included in the errors accumulated by self.errors.
uk: Якщо :exc:`ImportError` або :exc:`AttributeError` виникає під час обходу *name*, тоді буде повернено синтетичний тест, який викликає цю помилку під час запуску. Ці помилки включено до помилок, накопичених self.errors.

source: Similar to :meth:`loadTestsFromName`, but takes a sequence of names rather than a single name. The return value is a test suite which supports all the tests defined for each name.
uk: Подібно до :meth:`loadTestsFromName`, але приймає послідовність імен, а не одне ім’я. Повернене значення — це набір тестів, який підтримує всі тести, визначені для кожного імені.

source: Return a sorted sequence of method names found within *testCaseClass*; this should be a subclass of :class:`TestCase`.
uk: Повертає відсортовану послідовність імен методів, знайдених у *testCaseClass*; це має бути підклас :class:`TestCase`.

source: Find all the test modules by recursing into subdirectories from the specified start directory, and return a TestSuite object containing them. Only test files that match *pattern* will be loaded. (Using shell style pattern matching.) Only module names that are importable (i.e. are valid Python identifiers) will be loaded.
uk: Знайдіть усі тестові модулі, перейшовши до підкаталогів із зазначеного початкового каталогу, і поверніть об’єкт TestSuite, що містить їх. Будуть завантажені лише тестові файли, які відповідають *шаблону*. (Використовуючи зіставлення шаблону стилю оболонки.) Завантажуватимуться лише імена модулів, які можна імпортувати (тобто є дійсними ідентифікаторами Python).

source: If importing a module fails, for example due to a syntax error, then this will be recorded as a single error and discovery will continue. If the import failure is due to :exc:`SkipTest` being raised, it will be recorded as a skip instead of an error.
uk: Якщо імпортувати модуль не вдалося, наприклад, через синтаксичну помилку, це буде записано як одну помилку, і виявлення продовжиться. Якщо помилка імпорту спричинена викликом :exc:`SkipTest`, це буде записано як пропуск замість помилки.

source: If a package (a directory containing a file named :file:`__init__.py`) is found, the package will be checked for a ``load_tests`` function. If this exists then it will be called ``package.load_tests(loader, tests, pattern)``. Test discovery takes care to ensure that a package is only checked for tests once during an invocation, even if the load_tests function itself calls ``loader.discover``.
uk: Якщо пакунок (каталог, що містить файл із назвою :file:`__init__.py`) знайдено, пакунок буде перевірено на наявність функції ``load_tests``. Якщо він існує, він називатиметься ``package.load_tests(loader, tests, pattern)``. Тестове виявлення піклується про те, щоб пакет перевірявся на наявність тестів лише один раз під час виклику, навіть якщо сама функція load_tests викликає ``loader.discover``.

source: If ``load_tests`` exists then discovery does *not* recurse into the package, ``load_tests`` is responsible for loading all tests in the package.
uk: Якщо ``load_tests`` існує, виявлення *не* рекурсує в пакунок, ``load_tests`` відповідає за завантаження всіх тестів у пакунок.

source: *start_dir* can be a dotted module name as well as a directory.
uk: *start_dir* може бути назвою модуля з крапками, а також каталогом.

source: Modules that raise :exc:`SkipTest` on import are recorded as skips, not errors.
uk: Модулі, які викликають :exc:`SkipTest` під час імпорту, записуються як пропуски, а не як помилки.

source: *start_dir* can be a :term:`namespace packages <namespace package>`.
uk: *start_dir* може бути :term:`пакети простору імен <namespace package>`.

source: Paths are sorted before being imported so that execution order is the same even if the underlying file system's ordering is not dependent on file name.
uk: Шляхи сортуються перед імпортом, щоб порядок виконання був однаковим, навіть якщо порядок базової файлової системи не залежить від імені файлу.

source: Found packages are now checked for ``load_tests`` regardless of whether their path matches *pattern*, because it is impossible for a package name to match the default pattern.
uk: Знайдені пакунки тепер перевіряються на ``load_tests`` незалежно від того, чи відповідає їхній шлях *шаблону*, оскільки назва пакета не може відповідати шаблону за замовчуванням.

source: The following attributes of a :class:`TestLoader` can be configured either by subclassing or assignment on an instance:
uk: Наступні атрибути :class:`TestLoader` можуть бути налаштовані за допомогою підкласу або призначення для екземпляра:

source: String giving the prefix of method names which will be interpreted as test methods. The default value is ``'test'``.
uk: Рядок із префіксом імен методів, які будуть інтерпретуватися як тестові методи. Значення за замовчуванням - ``'test'``.

source: Callable object that constructs a test suite from a list of tests. No methods on the resulting object are needed. The default value is the :class:`TestSuite` class.
uk: Викликаний об’єкт, який створює набір тестів зі списку тестів. Жодних методів для отриманого об’єкта не потрібно. Стандартним значенням є клас :class:`TestSuite`.

source: This class is used to compile information about which tests have succeeded and which have failed.
uk: Цей клас використовується для компіляції інформації про те, які тести були успішними, а які невдалими.

source: A :class:`TestResult` object stores the results of a set of tests. The :class:`TestCase` and :class:`TestSuite` classes ensure that results are properly recorded; test authors do not need to worry about recording the outcome of tests.
uk: Об’єкт :class:`TestResult` зберігає результати набору тестів. Класи :class:`TestCase` і :class:`TestSuite` забезпечують належний запис результатів; авторам тестів не потрібно турбуватися про запис результатів тестів.

source: Testing frameworks built on top of :mod:`unittest` may want access to the :class:`TestResult` object generated by running a set of tests for reporting purposes; a :class:`TestResult` instance is returned by the :meth:`TestRunner.run` method for this purpose.
uk: Фреймворки тестування, створені на основі :mod:`unittest`, можуть потребувати доступу до об’єкта :class:`TestResult`, згенерованого за допомогою виконання набору тестів для цілей звітування; екземпляр :class:`TestResult` повертається методом :meth:`TestRunner.run` для цієї мети.

source: :class:`TestResult` instances have the following attributes that will be of interest when inspecting the results of running a set of tests:
uk: Екземпляри :class:`TestResult` мають такі атрибути, які будуть цікавими під час перевірки результатів виконання набору тестів:

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents a test which raised an unexpected exception.
uk: Список, що містить 2 кортежі екземплярів :class:`TestCase` і рядки, що містять відформатовані відстеження. Кожен кортеж представляє тест, який викликав несподіваний виняток.
