Repository: python/python-docs-uk
Catalog: library/urllib_parse.po
Languages: uk

source: Concrete class for :func:`urlparse` results containing :class:`str` data. The :meth:`encode` method returns a :class:`ParseResultBytes` instance.
uk: Конкретний клас для результатів :func:`urlparse`, що містять дані :class:`str`. Метод :meth:`encode` повертає екземпляр :class:`ParseResultBytes`.

source: Concrete class for :func:`urlsplit` results containing :class:`str` data. The :meth:`encode` method returns a :class:`SplitResultBytes` instance.
uk: Конкретний клас для результатів :func:`urlsplit`, що містять дані :class:`str`. Метод :meth:`encode` повертає екземпляр :class:`SplitResultBytes`.

source: The following classes provide the implementations of the parse results when operating on :class:`bytes` or :class:`bytearray` objects:
uk: Наступні класи забезпечують реалізацію результатів аналізу під час роботи з об’єктами :class:`bytes` або :class:`bytearray`:

source: Concrete class for :func:`urldefrag` results containing :class:`bytes` data. The :meth:`decode` method returns a :class:`DefragResult` instance.
uk: Конкретний клас для результатів :func:`urldefrag`, що містять дані :class:`bytes`. Метод :meth:`decode` повертає екземпляр :class:`DefragResult`.

source: Concrete class for :func:`urlparse` results containing :class:`bytes` data. The :meth:`decode` method returns a :class:`ParseResult` instance.
uk: Конкретний клас для результатів :func:`urlparse`, що містять дані :class:`bytes`. Метод :meth:`decode` повертає екземпляр :class:`ParseResult`.

source: Concrete class for :func:`urlsplit` results containing :class:`bytes` data. The :meth:`decode` method returns a :class:`SplitResult` instance.
uk: Конкретний клас для результатів :func:`urlsplit`, що містять дані :class:`bytes`. Метод :meth:`decode` повертає екземпляр :class:`SplitResult`.

source: URL Quoting
uk: Цитування URL

source: The URL quoting functions focus on taking program data and making it safe for use as URL components by quoting special characters and appropriately encoding non-ASCII text. They also support reversing these operations to recreate the original data from the contents of a URL component if that task isn't already covered by the URL parsing functions above.
uk: Функції цитування URL-адреси зосереджені на тому, щоб отримати програмні дані та зробити їх безпечними для використання як компонентів URL-адреси шляхом цитування спеціальних символів і відповідного кодування тексту, відмінного від ASCII. Вони також підтримують реверсування цих операцій, щоб відтворити вихідні дані з вмісту компонента URL-адреси, якщо це завдання ще не охоплено функціями аналізу URL-адреси вище.

source: *string* may be either a :class:`str` or a :class:`bytes` object.
uk: *string* може бути об’єктом :class:`str` або :class:`bytes`.

source: Moved from :rfc:`2396` to :rfc:`3986` for quoting URL strings. "~" is now included in the set of unreserved characters.
uk: Переміщено з :rfc:`2396` до :rfc:`3986` для цитування рядків URL. "~" тепер включено до набору незарезервованих символів.

source: The optional *encoding* and *errors* parameters specify how to deal with non-ASCII characters, as accepted by the :meth:`str.encode` method. *encoding* defaults to ``'utf-8'``. *errors* defaults to ``'strict'``, meaning unsupported characters raise a :class:`UnicodeEncodeError`. *encoding* and *errors* must not be supplied if *string* is a :class:`bytes`, or a :class:`TypeError` is raised.
uk: Необов’язкові параметри *encoding* і *errors* вказують, як працювати з символами, відмінними від ASCII, як прийнято методом :meth:`str.encode`. *кодування* за замовчуванням ``'utf-8'``. *errors* за умовчанням має значення ``'strict'``, тобто непідтримувані символи викликають :class:`UnicodeEncodeError`. *кодування* та *помилки* не повинні надаватися, якщо *рядок* є :class:`bytes` або виникає :class:`TypeError`.

source: Note that ``quote(string, safe, encoding, errors)`` is equivalent to ``quote_from_bytes(string.encode(encoding, errors), safe)``.
uk: Зауважте, що ``quote(string, safe, encoding, errors)`` еквівалентно ``quote_from_bytes(string.encode(encoding, errors), safe)``.

source: Example: ``quote('/El Niño/')`` yields ``'/El%20Ni%C3%B1o/'``.
uk: Приклад: ``quote('/El Niño/')`` дає ``'/El%20Ni%C3%B1o/''``.

source: Like :func:`quote`, but also replace spaces with plus signs, as required for quoting HTML form values when building up a query string to go into a URL. Plus signs in the original string are escaped unless they are included in *safe*. It also does not have *safe* default to ``'/'``.
uk: Подібно до :func:`quote`, але також замініть пробіли знаками плюса, як це потрібно для цитування значень HTML-форми під час створення рядка запиту для переходу до URL-адреси. Знаки "плюс" у вихідному рядку екрануються, якщо вони не включені в *safe*. Він також не має *safe* типового значення ``'/'``.

source: Example: ``quote_plus('/El Niño/')`` yields ``'%2FEl+Ni%C3%B1o%2F'``.
uk: Приклад: ``quote_plus('/El Niño/')`` дає ``'%2FEl+Ni%C3%B1o%2F''``.

source: Like :func:`quote`, but accepts a :class:`bytes` object rather than a :class:`str`, and does not perform string-to-bytes encoding.
uk: Подібно до :func:`quote`, але приймає об’єкт :class:`bytes`, а не :class:`str`, і не виконує кодування рядок-байт.

source: Example: ``quote_from_bytes(b'a&\xef')`` yields ``'a%26%EF'``.
uk: Приклад: ``quote_from_bytes(b'a&\xef')`` дає ``'a%26%EF''``.

source: *encoding* defaults to ``'utf-8'``. *errors* defaults to ``'replace'``, meaning invalid sequences are replaced by a placeholder character.
uk: *кодування* за замовчуванням ``'utf-8'``. *errors* за умовчанням має значення ``'replace'``, тобто недійсні послідовності замінюються символом-заповнювачем.

source: Example: ``unquote('/El%20Ni%C3%B1o/')`` yields ``'/El Niño/'``.
uk: Приклад: ``unquote('/El%20Ni%C3%B1o/')`` дає ``'/El Niño/''``.

source: *string* parameter supports bytes and str objects (previously only str).
uk: Параметр *string* підтримує об’єкти bytes і str (раніше лише str).

source: Like :func:`unquote`, but also replace plus signs with spaces, as required for unquoting HTML form values.
uk: Подібно до :func:`unquote`, але також замініть знаки "плюс" пробілами, як це потрібно для зняття лапок значень форми HTML.

source: *string* must be a :class:`str`.
uk: *рядок* має бути :class:`str`.

source: Example: ``unquote_plus('/El+Ni%C3%B1o/')`` yields ``'/El Niño/'``.
uk: Приклад: ``unquote_plus('/El+Ni%C3%B1o/')`` дає ``'/El Niño/''``.

source: If it is a :class:`str`, unescaped non-ASCII characters in *string* are encoded into UTF-8 bytes.
uk: Якщо це :class:`str`, неекрановані не-ASCII символи в *string* кодуються в UTF-8 байтах.

source: Example: ``unquote_to_bytes('a%26%EF')`` yields ``b'a&\xef'``.
uk: Приклад: ``unquote_to_bytes('a%26%EF')`` дає ``b'a&\xef'``.

source: Convert a mapping object or a sequence of two-element tuples, which may contain :class:`str` or :class:`bytes` objects, to a percent-encoded ASCII text string. If the resultant string is to be used as a *data* for POST operation with the :func:`~urllib.request.urlopen` function, then it should be encoded to bytes, otherwise it would result in a :exc:`TypeError`.
uk: Перетворіть об’єкт зіставлення або послідовність двоелементних кортежів, які можуть містити об’єкти :class:`str` або :class:`bytes`, у текстовий рядок ASCII у відсотковому кодуванні. Якщо результуючий рядок має використовуватись як *дані* для операції POST із функцією :func:`~urllib.request.urlopen`, тоді його слід закодувати в байти, інакше це призведе до :exc:`TypeError`.

source: The resulting string is a series of ``key=value`` pairs separated by ``'&'`` characters, where both *key* and *value* are quoted using the *quote_via* function. By default, :func:`quote_plus` is used to quote the values, which means spaces are quoted as a ``'+'`` character and '/' characters are encoded as ``%2F``, which follows the standard for GET requests (``application/x-www-form-urlencoded``). An alternate function that can be passed as *quote_via* is :func:`quote`, which will encode spaces as ``%20`` and not encode '/' characters. For maximum control of what is quoted, use ``quote`` and specify a value for *safe*.
uk: Отриманий рядок є серією пар ``ключ=значення``, розділених символами ``'&''``, де *ключ* і *значення* взяті в лапки за допомогою функції *quote_via*. За замовчуванням :func:`quote_plus` використовується для взяття значень у лапки, що означає, що пробіли беруться в лапки як символ ``'+'``, а символи '/' кодуються як ``%2F``, що відповідає стандарту для Запити GET (``application/x-www-form-urlencoded``). Альтернативною функцією, яку можна передати як *quote_via*, є :func:`quote`, яка кодуватиме пробіли як ``%20`` і не кодуватиме символи '/'. Для максимального контролю над тим, що цитується, використовуйте ``quote`` і вкажіть значення для *safe*.

source: When a sequence of two-element tuples is used as the *query* argument, the first element of each tuple is a key and the second is a value. The value element in itself can be a sequence and in that case, if the optional parameter *doseq* evaluates to ``True``, individual ``key=value`` pairs separated by ``'&'`` are generated for each element of the value sequence for the key. The order of parameters in the encoded string will match the order of parameter tuples in the sequence.
uk: Коли послідовність двоелементних кортежів використовується як аргумент *запиту*, перший елемент кожного кортежу є ключем, а другий — значенням. Елемент значення сам по собі може бути послідовністю, і в такому випадку, якщо необов’язковий параметр *doseq* оцінюється як ``True``, окремі пари ``ключ=значення`` генеруються для кожен елемент послідовності значень для ключа. Порядок параметрів у закодованому рядку відповідатиме порядку кортежів параметрів у послідовності.

source: The *safe*, *encoding*, and *errors* parameters are passed down to *quote_via* (the *encoding* and *errors* parameters are only passed when a query element is a :class:`str`).
uk: Параметри *safe*, *encoding* і *errors* передаються до *quote_via* (параметри *encoding* і *errors* передаються лише тоді, коли елемент запиту є :class:`str`).

source: To reverse this encoding process, :func:`parse_qs` and :func:`parse_qsl` are provided in this module to parse query strings into Python data structures.
uk: Щоб змінити цей процес кодування, у цьому модулі передбачено :func:`parse_qs` і :func:`parse_qsl` для аналізу рядків запиту в структурах даних Python.

source: Refer to :ref:`urllib examples <urllib-examples>` to find out how the :func:`urllib.parse.urlencode` method can be used for generating the query string of a URL or data for a POST request.
uk: Зверніться до :ref:`urllib examples <urllib-examples>`, щоб дізнатися, як метод :func:`urllib.parse.urlencode` можна використовувати для генерації рядка запиту URL-адреси або даних для запиту POST.

source: *query* supports bytes and string objects.
uk: *query* підтримує байти та рядкові об’єкти.

source: `WHATWG`_ - URL Living standard
uk: `WHATWG`_ - URL Життєвий рівень

source: Working Group for the URL Standard that defines URLs, domains, IP addresses, the application/x-www-form-urlencoded format, and their API.
uk: Робоча група для стандарту URL-адрес, яка визначає URL-адреси, домени, IP-адреси, формат application/x-www-form-urlencoded та їх API.

source: :rfc:`3986` - Uniform Resource Identifiers
uk: :rfc:`3986` - Уніфіковані ідентифікатори ресурсів

source: This is the current standard (STD66). Any changes to urllib.parse module should conform to this. Certain deviations could be observed, which are mostly for backward compatibility purposes and for certain de-facto parsing requirements as commonly observed in major browsers.
uk: Це поточний стандарт (STD66). Будь-які зміни в модулі urllib.parse мають відповідати цьому. Можуть спостерігатися певні відхилення, які здебільшого пов’язані з цілями зворотної сумісності та певними де-факто вимогами до аналізу, які зазвичай спостерігаються в основних браузерах.

source: :rfc:`2732` - Format for Literal IPv6 Addresses in URL's.
uk: :rfc:`2732` - Формат буквальних IPv6-адрес в URL-адресах.

source: This specifies the parsing requirements of IPv6 URLs.
uk: Це визначає вимоги до аналізу URL-адрес IPv6.

source: :rfc:`2396` - Uniform Resource Identifiers (URI): Generic Syntax
uk: :rfc:`2396` - Уніфіковані ідентифікатори ресурсів (URI): загальний синтаксис

source: Document describing the generic syntactic requirements for both Uniform Resource Names (URNs) and Uniform Resource Locators (URLs).
uk: Документ, що описує загальні синтаксичні вимоги як для уніфікованих імен ресурсів (URN), так і для уніфікованих покажчиків ресурсів (URL).

source: :rfc:`2368` - The mailto URL scheme.
uk: :rfc:`2368` - Схема URL-адреси електронної пошти.

source: Parsing requirements for mailto URL schemes.
uk: Вимоги до розбору URL-схем mailto.

source: :rfc:`1808` - Relative Uniform Resource Locators
uk: :rfc:`1808` - Відносні уніфіковані локатори ресурсів

source: This Request For Comments includes the rules for joining an absolute and a relative URL, including a fair number of "Abnormal Examples" which govern the treatment of border cases.
uk: Цей Запит на коментарі містить правила об’єднання абсолютної та відносної URL-адрес, включаючи чималу кількість "ненормальних прикладів", які регулюють обробку прикордонних випадків.

source: :rfc:`1738` - Uniform Resource Locators (URL)
uk: :rfc:`1738` - Уніфіковані покажчики ресурсів (URL)

source: This specifies the formal syntax and semantics of absolute URLs.
uk: Це визначає формальний синтаксис і семантику абсолютних URL-адрес.
