Repository: python/python-docs-uk
Catalog: library/urllib_error.po
Languages: uk

source: :mod:`urllib.error` --- Exception classes raised by urllib.request
uk: :mod:`urllib.error` --- Класи винятків, створені urllib.request

source: **Source code:** :source:`Lib/urllib/error.py`
uk: **Вихідний код:** :source:`Lib/urllib/error.py`

source: The :mod:`urllib.error` module defines the exception classes for exceptions raised by :mod:`urllib.request`. The base exception class is :exc:`URLError`.
uk: Модуль :mod:`urllib.error` визначає класи винятків для винятків, викликаних :mod:`urllib.request`. Базовим класом винятків є :exc:`URLError`.

source: The following exceptions are raised by :mod:`urllib.error` as appropriate:
uk: Наступні винятки викликаються :mod:`urllib.error` відповідно:

source: The handlers raise this exception (or derived exceptions) when they run into a problem. It is a subclass of :exc:`OSError`.
uk: Обробники викликають цей виняток (або похідні виключення), коли стикаються з проблемою. Це підклас :exc:`OSError`.

source: The reason for this error. It can be a message string or another exception instance.
uk: Причина цієї помилки. Це може бути рядок повідомлення або інший виняток.

source: :exc:`URLError` has been made a subclass of :exc:`OSError` instead of :exc:`IOError`.
uk: :exc:`URLError` було зроблено підкласом :exc:`OSError` замість :exc:`IOError`.

source: Though being an exception (a subclass of :exc:`URLError`), an :exc:`HTTPError` can also function as a non-exceptional file-like return value (the same thing that :func:`~urllib.request.urlopen` returns). This is useful when handling exotic HTTP errors, such as requests for authentication.
uk: Хоча :exc:`HTTPError` і є винятком (підкласом :exc:`URLError`),він також може функціонувати як невиключне значення, схоже на файл (те саме, що :func:`~urllib.request. urlopen` повертає). Це корисно під час обробки екзотичних помилок HTTP, таких як запити на автентифікацію.

source: An HTTP status code as defined in :rfc:`2616`. This numeric value corresponds to a value found in the dictionary of codes as found in :attr:`http.server.BaseHTTPRequestHandler.responses`.
uk: Код статусу HTTP, як визначено в :rfc:`2616`. Це числове значення відповідає значенню, знайденому в словнику кодів у :attr:`http.server.BaseHTTPRequestHandler.responses`.

source: This is usually a string explaining the reason for this error.
uk: Зазвичай це рядок, що пояснює причину цієї помилки.

source: The HTTP response headers for the HTTP request that caused the :exc:`HTTPError`.
uk: Заголовки відповіді HTTP для запиту HTTP, який спричинив :exc:`HTTPError`.

source: This exception is raised when the :func:`~urllib.request.urlretrieve` function detects that the amount of the downloaded data is less than the expected amount (given by the *Content-Length* header). The :attr:`content` attribute stores the downloaded (and supposedly truncated) data.
uk: Цей виняток виникає, коли функція :func:`~urllib.request.urlretrieve` виявляє, що обсяг завантажених даних менший за очікуваний обсяг (вказаний у заголовку *Content-Length*). Атрибут :attr:`content` зберігає завантажені (і ймовірно скорочені) дані.
