Repository: python/python-docs-uk
Catalog: library/urllib_parse.po
Languages: uk

source: **Source code:** :source:`Lib/urllib/parse.py`
uk: **Вихідний код:** :source:`Lib/urllib/parse.py`

source: This module defines a standard interface to break Uniform Resource Locator (URL) strings up in components (addressing scheme, network location, path etc.), to combine the components back into a URL string, and to convert a "relative URL" to an absolute URL given a "base URL."
uk: Цей модуль визначає стандартний інтерфейс для розбиття рядків Uniform Resource Locator (URL) на компоненти (схема адресації, мережеве розташування, шлях тощо), щоб об’єднати компоненти назад у рядок URL-адреси та перетворити "відносну URL-адресу" на абсолютна URL-адреса з "базовою URL-адресою".

source: The :mod:`urllib.parse` module defines functions that fall into two broad categories: URL parsing and URL quoting. These are covered in detail in the following sections.
uk: Модуль :mod:`urllib.parse` визначає функції, які поділяються на дві широкі категорії: аналіз URL-адреси та цитування URL-адреси. Вони детально описані в наступних розділах.

source: URL Parsing
uk: Розбір URL-адрес

source: The URL parsing functions focus on splitting a URL string into its components, or on combining URL components into a URL string.
uk: Функції аналізу URL-адреси зосереджені на розділенні рядка URL-адреси на його компоненти або на об’єднанні компонентів URL-адреси в рядок URL-адреси.

source: Parse a URL into six components, returning a 6-item :term:`named tuple`. This corresponds to the general structure of a URL: ``scheme://netloc/path;parameters?query#fragment``. Each tuple item is a string, possibly empty. The components are not broken up into smaller parts (for example, the network location is a single string), and % escapes are not expanded. The delimiters as shown above are not part of the result, except for a leading slash in the *path* component, which is retained if present. For example:
uk: Розберіть URL-адресу на шість компонентів, повертаючи 6-елементний :term:`named tuple`. Це відповідає загальній структурі URL: ``scheme://netloc/path;parameters?query#fragment``. Кожен елемент кортежу є рядком, можливо порожнім. Компоненти не розбиваються на більш дрібні частини (наприклад, мережеве розташування є одним рядком), а % екранування не розгортається. Роздільники, як показано вище, не є частиною результату, за винятком початкової скісної риски в компоненті *path*, яка зберігається, якщо є. Наприклад:

source: Following the syntax specifications in :rfc:`1808`, urlparse recognizes a netloc only if it is properly introduced by '//'. Otherwise the input is presumed to be a relative URL and thus to start with a path component.
uk: Дотримуючись специфікації синтаксису в :rfc:`1808`, urlparse розпізнає netloc, лише якщо його правильно введено '//'. Інакше введення вважається відносною URL-адресою і, таким чином, починається з компонента шляху.

source: The *scheme* argument gives the default addressing scheme, to be used only if the URL does not specify one. It should be the same type (text or bytes) as *urlstring*, except that the default value ``''`` is always allowed, and is automatically converted to ``b''`` if appropriate.
uk: Аргумент *схема* дає схему адресації за замовчуванням, яка використовується, лише якщо її не вказано в URL-адресі. Він має бути того самого типу (текст або байти), що й *urlstring*, за винятком того, що значення за замовчуванням ``''`` завжди допускається та автоматично перетворюється на ``b''``, якщо це необхідно.

source: If the *allow_fragments* argument is false, fragment identifiers are not recognized. Instead, they are parsed as part of the path, parameters or query component, and :attr:`fragment` is set to the empty string in the return value.
uk: Якщо аргумент *allow_fragments* має значення false, ідентифікатори фрагментів не розпізнаються. Натомість вони аналізуються як частина шляху, параметрів або компонента запиту, а :attr:`fragment` встановлюється як порожній рядок у поверненому значенні.

source: The return value is a :term:`named tuple`, which means that its items can be accessed by index or as named attributes, which are:
uk: Поверненим значенням є :term:`named tuple`, що означає, що до його елементів можна отримати доступ за індексом або як іменовані атрибути, які:

source: Attribute
uk: Атрибут

source: Index
uk: Індекс

source: Value
uk: Значення

source: Value if not present
uk: Значення, якщо його немає

source: URL scheme specifier
uk: Специфікатор схеми URL

source: *scheme* parameter
uk: Параметр *схема*

source: Network location part
uk: Розташування мережі

source: empty string
uk: порожній рядок

source: Hierarchical path
uk: Ієрархічний шлях

source: Query component
uk: Компонент запиту

source: Fragment identifier
uk: Ідентифікатор фрагмента

source: :attr:`username`
uk: :attr:`ім’я користувача`

source: User name
uk: Ім'я користувача

source: Password
uk: Пароль

source: :attr:`hostname`
uk: :attr:`ім'я хоста`

source: Host name (lower case)
uk: Ім'я хоста (нижній регістр)

source: Port number as integer, if present
uk: Номер порту як ціле число, якщо є

source: Reading the :attr:`port` attribute will raise a :exc:`ValueError` if an invalid port is specified in the URL. See section :ref:`urlparse-result-object` for more information on the result object.
uk: Читання атрибута :attr:`port` викличе :exc:`ValueError`, якщо в URL-адресі вказано недійсний порт. Перегляньте розділ :ref:`urlparse-result-object` для отримання додаткової інформації про об’єкт результату.

source: Unmatched square brackets in the :attr:`netloc` attribute will raise a :exc:`ValueError`.
uk: Невідповідні квадратні дужки в атрибуті :attr:`netloc` викличуть :exc:`ValueError`.

source: Characters in the :attr:`netloc` attribute that decompose under NFKC normalization (as used by the IDNA encoding) into any of ``/``, ``?``, ``#``, ``@``, or ``:`` will raise a :exc:`ValueError`. If the URL is decomposed before parsing, no error will be raised.
uk: Символи в атрибуті :attr:`netloc`, які розкладаються за нормалізацією NFKC (як використовується кодуванням IDNA) на будь-який із ``/``, ``?``, ``#``, ``@``, або ``:`` викличе :exc:`ValueError`. Якщо перед синтаксичним аналізом URL-адресу розкладають, помилка не виникне.

source: As is the case with all named tuples, the subclass has a few additional methods and attributes that are particularly useful. One such method is :meth:`_replace`. The :meth:`_replace` method will return a new ParseResult object replacing specified fields with new values.
uk: Як і у випадку з усіма іменованими кортежами, підклас має кілька додаткових методів і атрибутів, які є особливо корисними. Одним із таких методів є :meth:`_replace`. Метод :meth:`_replace` поверне новий об’єкт ParseResult, замінюючи вказані поля новими значеннями.

source: Added IPv6 URL parsing capabilities.
uk: Додано можливості розбору URL-адрес IPv6.

source: Out-of-range port numbers now raise :exc:`ValueError`, instead of returning :const:`None`.
uk: Номери портів поза діапазоном тепер викликають :exc:`ValueError` замість повернення :const:`None`.

source: Characters that affect netloc parsing under NFKC normalization will now raise :exc:`ValueError`.
uk: Символи, які впливають на аналіз netloc під час нормалізації NFKC, тепер викликатимуть :exc:`ValueError`.

source: Parse a query string given as a string argument (data of type :mimetype:`application/x-www-form-urlencoded`). Data are returned as a dictionary. The dictionary keys are the unique query variable names and the values are lists of values for each name.
uk: Проаналізуйте рядок запиту, заданий як аргумент рядка (дані типу :mimetype:`application/x-www-form-urlencoded`). Дані повертаються як словник. Ключі словника — це унікальні імена змінних запиту, а значення — це списки значень для кожного імені.

source: The optional argument *keep_blank_values* is a flag indicating whether blank values in percent-encoded queries should be treated as blank strings. A true value indicates that blanks should be retained as blank strings. The default false value indicates that blank values are to be ignored and treated as if they were not included.
uk: Необов’язковий аргумент *keep_blank_values* — це позначка, яка вказує, чи слід порожні значення в запитах із відсотковим кодуванням розглядати як порожні рядки. Справжнє значення вказує на те, що пробіли слід зберігати як порожні рядки. Значення false за замовчуванням вказує на те, що порожні значення слід ігнорувати та розглядати їх так, ніби їх не було включено.

source: The optional argument *strict_parsing* is a flag indicating what to do with parsing errors. If false (the default), errors are silently ignored. If true, errors raise a :exc:`ValueError` exception.
uk: Необов’язковий аргумент *strict_parsing* — це позначка, яка вказує, що робити з помилками аналізу. Якщо false (за замовчуванням), помилки мовчки ігноруються. Якщо true, помилки викликають виняток :exc:`ValueError`.

source: The optional *encoding* and *errors* parameters specify how to decode percent-encoded sequences into Unicode characters, as accepted by the :meth:`bytes.decode` method.
uk: Необов’язкові параметри *encoding* і *errors* визначають, як декодувати послідовності, закодовані у відсотках, у символи Юнікоду, як це прийнято методом :meth:`bytes.decode`.

source: The optional argument *max_num_fields* is the maximum number of fields to read. If set, then throws a :exc:`ValueError` if there are more than *max_num_fields* fields read.
uk: Необов’язковий аргумент *max_num_fields* — це максимальна кількість полів для читання. Якщо встановлено, викидає :exc:`ValueError`, якщо прочитано більше ніж *max_num_fields* полів.

source: The optional argument *separator* is the symbol to use for separating the query arguments. It defaults to ``&``.
uk: Необов’язковий аргумент *роздільник* — це символ, який використовується для розділення аргументів запиту. За замовчуванням ``&``.

source: Use the :func:`urllib.parse.urlencode` function (with the ``doseq`` parameter set to ``True``) to convert such dictionaries into query strings.
uk: Використовуйте функцію :func:`urllib.parse.urlencode` (з параметром ``doseq``, встановленим на ``True``), щоб конвертувати такі словники в рядки запиту.

source: Add *encoding* and *errors* parameters.
uk: Додайте параметри *encoding* і *errors*.

source: Added *max_num_fields* parameter.
uk: Додано параметр *max_num_fields*.

source: Added *separator* parameter with the default value of ``&``. Python versions earlier than Python 3.10 allowed using both ``;`` and ``&`` as query parameter separator. This has been changed to allow only a single separator key, with ``&`` as the default separator.
uk: Додано параметр *роздільник* зі значенням за замовчуванням ``&``. Версії Python, раніші за Python 3.10, дозволяли використовувати як ``;``, так і ``&`` як роздільник параметрів запиту. Це було змінено, щоб дозволити лише один роздільний ключ із ``&`` як роздільником за умовчанням.

source: Parse a query string given as a string argument (data of type :mimetype:`application/x-www-form-urlencoded`). Data are returned as a list of name, value pairs.
uk: Проаналізуйте рядок запиту, заданий як аргумент рядка (дані типу :mimetype:`application/x-www-form-urlencoded`). Дані повертаються у вигляді списку пар імені та значення.

source: Use the :func:`urllib.parse.urlencode` function to convert such lists of pairs into query strings.
uk: Використовуйте функцію :func:`urllib.parse.urlencode`, щоб перетворити такі списки пар у рядки запиту.

source: Construct a URL from a tuple as returned by ``urlparse()``. The *parts* argument can be any six-item iterable. This may result in a slightly different, but equivalent URL, if the URL that was parsed originally had unnecessary delimiters (for example, a ``?`` with an empty query; the RFC states that these are equivalent).
uk: Створіть URL-адресу з кортежу, який повертає ``urlparse()``. Аргумент *parts* може бути будь-яким ітерованим із шести елементів. Це може призвести до дещо іншої, але еквівалентної URL-адреси, якщо спочатку проаналізована URL-адреса мала непотрібні розділювачі (наприклад, ``?`` із порожнім запитом; у RFC зазначено, що вони еквівалентні).

source: This is similar to :func:`urlparse`, but does not split the params from the URL. This should generally be used instead of :func:`urlparse` if the more recent URL syntax allowing parameters to be applied to each segment of the *path* portion of the URL (see :rfc:`2396`) is wanted. A separate function is needed to separate the path segments and parameters. This function returns a 5-item :term:`named tuple`::
uk: Це схоже на :func:`urlparse`, але не відокремлює параметри від URL-адреси. Загалом це слід використовувати замість :func:`urlparse`, якщо потрібний новіший синтаксис URL-адреси, який дозволяє застосовувати параметри до кожного сегменту частини *path* URL-адреси (див. :rfc:`2396`). Для розділення сегментів шляху та параметрів потрібна окрема функція. Ця функція повертає 5-елементний :term:`named tuple`::

source: The return value is a :term:`named tuple`, its items can be accessed by index or as named attributes:
uk: Поверненим значенням є :term:`named tuple`, до його елементів можна отримати доступ за індексом або як іменовані атрибути:

source: ASCII newline and tab characters are stripped from the URL.
uk: Символи нового рядка та табуляції ASCII видаляються з URL-адреси.

source: Combine the elements of a tuple as returned by :func:`urlsplit` into a complete URL as a string. The *parts* argument can be any five-item iterable. This may result in a slightly different, but equivalent URL, if the URL that was parsed originally had unnecessary delimiters (for example, a ? with an empty query; the RFC states that these are equivalent).
uk: Об’єднайте елементи кортежу, які повертає :func:`urlsplit`, у повну URL-адресу як рядок. Аргументом *parts* може бути будь-який ітерований з п’яти елементів. Це може призвести до дещо іншої, але еквівалентної URL-адреси, якщо спочатку проаналізована URL-адреса мала непотрібні розділювачі (наприклад, ? із порожнім запитом; у RFC зазначено, що вони еквівалентні).

source: Construct a full ("absolute") URL by combining a "base URL" (*base*) with another URL (*url*). Informally, this uses components of the base URL, in particular the addressing scheme, the network location and (part of) the path, to provide missing components in the relative URL. For example:
uk: Створіть повну ("абсолютну") URL-адресу, об’єднавши "базову URL-адресу" (*base*) з іншою URL-адресою (*url*). Неофіційно тут використовуються компоненти базової URL-адреси, зокрема схема адресації, мережеве розташування та (частина) шляху, щоб забезпечити відсутні компоненти у відносній URL-адресі. Наприклад:

source: The *allow_fragments* argument has the same meaning and default as for :func:`urlparse`.
uk: Аргумент *allow_fragments* має те саме значення та типове значення, що й для :func:`urlparse`.

source: If *url* is an absolute URL (that is, it starts with ``//`` or ``scheme://``), the *url*'s hostname and/or scheme will be present in the result. For example:
uk: Якщо *url* є абсолютною URL-адресою (тобто вона починається з ``//`` або ``scheme://``), ім'я хосту *url* та/або схема будуть присутні в результаті. Наприклад:

source: If you do not want that behavior, preprocess the *url* with :func:`urlsplit` and :func:`urlunsplit`, removing possible *scheme* and *netloc* parts.
uk: Якщо ви не хочете такої поведінки, попередньо обробіть *url* за допомогою :func:`urlsplit` і :func:`urlunsplit`, видаливши можливі частини *scheme* і *netloc*.

source: Behavior updated to match the semantics defined in :rfc:`3986`.
uk: Поведінку оновлено відповідно до семантики, визначеної в :rfc:`3986`.

source: If *url* contains a fragment identifier, return a modified version of *url* with no fragment identifier, and the fragment identifier as a separate string. If there is no fragment identifier in *url*, return *url* unmodified and an empty string.
uk: Якщо *url* містить ідентифікатор фрагмента, поверніть модифіковану версію *url* без ідентифікатора фрагмента та ідентифікатор фрагмента як окремий рядок. Якщо в *url* немає ідентифікатора фрагмента, поверніть *url* без змін і порожній рядок.

source: URL with no fragment
uk: URL без фрагмента

source: See section :ref:`urlparse-result-object` for more information on the result object.
uk: Перегляньте розділ :ref:`urlparse-result-object` для отримання додаткової інформації про об’єкт результату.

source: Result is a structured object rather than a simple 2-tuple.
uk: Результат – це структурований об’єкт, а не простий 2-кортеж.

source: Extract the url from a wrapped URL (that is, a string formatted as ``<URL:scheme://host/path>``, ``<scheme://host/path>``, ``URL:scheme://host/path`` or ``scheme://host/path``). If *url* is not a wrapped URL, it is returned without changes.
uk: Витягніть URL-адресу з упакованої URL-адреси (тобто рядка у форматі ``<URL:scheme://host/path>``, ``<scheme://host/path>``, ``URL:scheme://host/path`` або ``scheme://host/path``). Якщо *url* не є загорнутою URL-адресою, вона повертається без змін.

source: Parsing ASCII Encoded Bytes
uk: Розбір байтів, закодованих ASCII

source: The URL parsing functions were originally designed to operate on character strings only. In practice, it is useful to be able to manipulate properly quoted and encoded URLs as sequences of ASCII bytes. Accordingly, the URL parsing functions in this module all operate on :class:`bytes` and :class:`bytearray` objects in addition to :class:`str` objects.
uk: Функції аналізу URL спочатку були розроблені для роботи лише з рядками символів. На практиці корисно мати можливість маніпулювати правильно цитованими та закодованими URL-адресами як послідовностями байтів ASCII. Відповідно, усі функції аналізу URL-адрес у цьому модулі працюють з об’єктами :class:`bytes` і :class:`bytearray` на додаток до об’єктів :class:`str`.

source: If :class:`str` data is passed in, the result will also contain only :class:`str` data. If :class:`bytes` or :class:`bytearray` data is passed in, the result will contain only :class:`bytes` data.
uk: Якщо передано дані :class:`str`, результат також міститиме лише дані :class:`str`. Якщо передано дані :class:`bytes` або :class:`bytearray`, результат міститиме лише дані :class:`bytes`.

source: Attempting to mix :class:`str` data with :class:`bytes` or :class:`bytearray` in a single function call will result in a :exc:`TypeError` being raised, while attempting to pass in non-ASCII byte values will trigger :exc:`UnicodeDecodeError`.
uk: Спроба змішати дані :class:`str` із :class:`bytes` або :class:`bytearray` в одному виклику функції призведе до появи :exc:`TypeError` під час спроби передати не-ASCII значення байтів викликатимуть :exc:`UnicodeDecodeError`.

source: To support easier conversion of result objects between :class:`str` and :class:`bytes`, all return values from URL parsing functions provide either an :meth:`encode` method (when the result contains :class:`str` data) or a :meth:`decode` method (when the result contains :class:`bytes` data). The signatures of these methods match those of the corresponding :class:`str` and :class:`bytes` methods (except that the default encoding is ``'ascii'`` rather than ``'utf-8'``). Each produces a value of a corresponding type that contains either :class:`bytes` data (for :meth:`encode` methods) or :class:`str` data (for :meth:`decode` methods).
uk: Для підтримки легшого перетворення об’єктів результату між :class:`str` і :class:`bytes`, усі значення, що повертаються функціями парсингу URL-адреси, надають або метод :meth:`encode` (якщо результат містить :class:`str` data) або метод :meth:`decode` (якщо результат містить дані :class:`bytes`). Сигнатури цих методів збігаються з сигнатурами відповідних методів :class:`str` і :class:`bytes` (за винятком того, що стандартним кодуванням є ``'ascii'``, а не ``'utf-8'``) . Кожен створює значення відповідного типу, яке містить або дані :class:`bytes` (для методів :meth:`encode`), або дані :class:`str` (для методів :meth:`decode`).

source: Applications that need to operate on potentially improperly quoted URLs that may contain non-ASCII data will need to do their own decoding from bytes to characters before invoking the URL parsing methods.
uk: Програми, яким потрібно працювати з потенційно неправильно цитованими URL-адресами, які можуть містити дані, відмінні від ASCII, повинні будуть виконати власне декодування з байтів на символи перед тим, як викликати методи аналізу URL-адрес.

source: The behaviour described in this section applies only to the URL parsing functions. The URL quoting functions use their own rules when producing or consuming byte sequences as detailed in the documentation of the individual URL quoting functions.
uk: Поведінка, описана в цьому розділі, стосується лише функцій аналізу URL-адреси. Функції цитування URL-адрес використовують власні правила під час створення або споживання послідовностей байтів, як описано в документації окремих функцій цитування URL-адрес.

source: URL parsing functions now accept ASCII encoded byte sequences
uk: Функції аналізу URL-адрес тепер приймають послідовності байтів у кодуванні ASCII

source: Structured Parse Results
uk: Структуровані результати аналізу

source: The result objects from the :func:`urlparse`, :func:`urlsplit` and :func:`urldefrag` functions are subclasses of the :class:`tuple` type. These subclasses add the attributes listed in the documentation for those functions, the encoding and decoding support described in the previous section, as well as an additional method:
uk: Об’єкти результатів функцій :func:`urlparse`, :func:`urlsplit` і :func:`urldefrag` є підкласами типу :class:`tuple`. Ці підкласи додають атрибути, перелічені в документації для цих функцій, підтримку кодування та декодування, описану в попередньому розділі, а також додатковий метод:

source: Return the re-combined version of the original URL as a string. This may differ from the original URL in that the scheme may be normalized to lower case and empty components may be dropped. Specifically, empty parameters, queries, and fragment identifiers will be removed.
uk: Повертає повторно об’єднану версію вихідної URL-адреси у вигляді рядка. Це може відрізнятися від вихідної URL-адреси тим, що схема може бути нормалізована до нижнього регістру, а порожні компоненти можуть бути видалені. Зокрема, порожні параметри, запити та ідентифікатори фрагментів буде видалено.

source: For :func:`urldefrag` results, only empty fragment identifiers will be removed. For :func:`urlsplit` and :func:`urlparse` results, all noted changes will be made to the URL returned by this method.
uk: Для результатів :func:`urldefrag` буде видалено лише порожні ідентифікатори фрагментів. Для результатів :func:`urlsplit` і :func:`urlparse` усі зазначені зміни буде внесено до URL-адреси, яку повертає цей метод.

source: The result of this method remains unchanged if passed back through the original parsing function:
uk: Результат цього методу залишається незмінним, якщо передати його через вихідну функцію аналізу:

source: The following classes provide the implementations of the structured parse results when operating on :class:`str` objects:
uk: Наступні класи забезпечують реалізацію результатів структурованого аналізу під час роботи з об’єктами :class:`str`:

source: Concrete class for :func:`urldefrag` results containing :class:`str` data. The :meth:`encode` method returns a :class:`DefragResultBytes` instance.
uk: Конкретний клас для результатів :func:`urldefrag`, що містять дані :class:`str`. Метод :meth:`encode` повертає екземпляр :class:`DefragResultBytes`.
