Repository: python/python-docs-uk
Catalog: library/uuid.po
Languages: uk

source: **Source code:** :source:`Lib/uuid.py`
uk: **Вихідний код:** :source:`Lib/uuid.py`

source: This module provides immutable :class:`UUID` objects (the :class:`UUID` class) and the functions :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, :func:`uuid5` for generating version 1, 3, 4, and 5 UUIDs as specified in :rfc:`4122`.
uk: Цей модуль надає незмінні об’єкти :class:`UUID` (клас :class:`UUID`) і функції :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, :func:`uuid5` для генерації UUID версій 1, 3, 4 і 5, як зазначено в :rfc:`4122`.

source: If all you want is a unique ID, you should probably call :func:`uuid1` or :func:`uuid4`. Note that :func:`uuid1` may compromise privacy since it creates a UUID containing the computer's network address. :func:`uuid4` creates a random UUID.
uk: Якщо все, що вам потрібно, це унікальний ідентифікатор, ви, ймовірно, повинні викликати :func:`uuid1` або :func:`uuid4`. Зауважте, що :func:`uuid1` може порушувати конфіденційність, оскільки створює UUID, що містить мережеву адресу комп’ютера. :func:`uuid4` створює випадковий UUID.

source: The UUID was generated by the platform in a multiprocessing-safe way.
uk: UUID було створено платформою безпечним для багатьох процесів способом.

source: The UUID was not generated in a multiprocessing-safe way.
uk: UUID не було створено безпечним для багатопроцесорної обробки способом.

source: The platform does not provide information on whether the UUID was generated safely or not.
uk: Платформа не надає інформацію про те, чи UUID було створено безпечно чи ні.

source: Create a UUID from either a string of 32 hexadecimal digits, a string of 16 bytes in big-endian order as the *bytes* argument, a string of 16 bytes in little-endian order as the *bytes_le* argument, a tuple of six integers (32-bit *time_low*, 16-bit *time_mid*, 16-bit *time_hi_version*, 8-bit *clock_seq_hi_variant*, 8-bit *clock_seq_low*, 48-bit *node*) as the *fields* argument, or a single 128-bit integer as the *int* argument. When a string of hex digits is given, curly braces, hyphens, and a URN prefix are all optional. For example, these expressions all yield the same UUID::
uk: Створіть UUID із рядка з 32 шістнадцяткових цифр, рядка з 16 байтів у порядку старших як аргумент *bytes*, рядка з 16 байтів у порядку старших як аргумент *bytes_le* або кортежу з шести цілі числа (32-біт *time_low*, 16-біт *time_mid*, 16-біт *time_hi_version*, 8-біт *clock_seq_hi_variant*, 8-біт *clock_seq_low*, 48-біт *node*) як аргумент *fields* або одне 128-бітове ціле число як аргумент *int*. Коли вказано рядок шістнадцяткових цифр, фігурні дужки, дефіси та префікс URN є необов’язковими. Наприклад, усі ці вирази дають однаковий UUID::

source: Exactly one of *hex*, *bytes*, *bytes_le*, *fields*, or *int* must be given. The *version* argument is optional; if given, the resulting UUID will have its variant and version number set according to :rfc:`4122`, overriding bits in the given *hex*, *bytes*, *bytes_le*, *fields*, or *int*.
uk: Потрібно вказати точно одне з *hex*, *bytes*, *bytes_le*, *fields* або *int*. Аргумент *version* необов'язковий; якщо задано, кінцевий UUID матиме свій варіант і номер версії, встановлені відповідно до :rfc:`4122`, перекриваючи біти в заданих *hex*, *bytes*, *bytes_le*, *fields* або *int*.

source: Comparison of UUID objects are made by way of comparing their :attr:`UUID.int` attributes. Comparison with a non-UUID object raises a :exc:`TypeError`.
uk: Порівняння об’єктів UUID здійснюється шляхом порівняння їхніх атрибутів :attr:`UUID.int`. Порівняння з об’єктом, що не є UUID, викликає :exc:`TypeError`.

source: ``str(uuid)`` returns a string in the form ``12345678-1234-5678-1234-567812345678`` where the 32 hexadecimal digits represent the UUID.
uk: ``str(uuid)`` повертає рядок у формі ``12345678-1234-5678-1234-567812345678``, де 32 шістнадцяткові цифри представляють UUID.

source: :class:`UUID` instances have these read-only attributes:
uk: Екземпляри :class:`UUID` мають ці атрибути лише для читання:

source: The UUID as a 16-byte string (containing the six integer fields in big-endian byte order).
uk: UUID як 16-байтовий рядок (що містить шість цілих полів у порядку байтів у порядку байтів).

source: The UUID as a 16-byte string (with *time_low*, *time_mid*, and *time_hi_version* in little-endian byte order).
uk: UUID як 16-байтовий рядок (з *time_low*, *time_mid* і *time_hi_version* у порядку байтів у порядку байтів).

source: A tuple of the six integer fields of the UUID, which are also available as six individual attributes and two derived attributes:
uk: Кортеж із шести цілих полів UUID, які також доступні як шість окремих атрибутів і два похідних атрибути:

source: Field
uk: Поле

source: Meaning
uk: Значення

source: The UUID as a 32-character lowercase hexadecimal string.
uk: UUID як 32-символьний шістнадцятковий рядок у нижньому регістрі.

source: The UUID as a 128-bit integer.
uk: UUID як 128-бітне ціле число.

source: The UUID as a URN as specified in :rfc:`4122`.
uk: UUID як URN, як зазначено в :rfc:`4122`.

source: The UUID variant, which determines the internal layout of the UUID. This will be one of the constants :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT`, or :const:`RESERVED_FUTURE`.
uk: Варіант UUID, який визначає внутрішнє розташування UUID. Це буде одна з констант :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT` або :const:`RESERVED_FUTURE`.

source: The UUID version number (1 through 5, meaningful only when the variant is :const:`RFC_4122`).
uk: Номер версії UUID (від 1 до 5, має значення лише тоді, коли варіант :const:`RFC_4122`).

source: An enumeration of :class:`SafeUUID` which indicates whether the platform generated the UUID in a multiprocessing-safe way.
uk: Перелік :class:`SafeUUID`, який вказує, чи платформа згенерувала UUID безпечним для багатьох процесів способом.

source: The :mod:`uuid` module defines the following functions:
uk: Модуль :mod:`uuid` визначає такі функції:

source: Get the hardware address as a 48-bit positive integer. The first time this runs, it may launch a separate program, which could be quite slow. If all attempts to obtain the hardware address fail, we choose a random 48-bit number with the multicast bit (least significant bit of the first octet) set to 1 as recommended in :rfc:`4122`. "Hardware address" means the MAC address of a network interface. On a machine with multiple network interfaces, universally administered MAC addresses (i.e. where the second least significant bit of the first octet is *unset*) will be preferred over locally administered MAC addresses, but with no other ordering guarantees.
uk: Отримайте апаратну адресу як 48-розрядне позитивне ціле число. Під час першого запуску може запустити окрему програму, яка може працювати досить повільно. Якщо всі спроби отримати апаратну адресу зазнають невдачі, ми вибираємо випадкове 48-бітове число з бітом багатоадресної передачі (молодший значущий біт першого октету), встановленим на 1, як рекомендовано в :rfc:`4122`. "Апаратна адреса" означає MAC-адресу мережевого інтерфейсу. На машині з декількома мережевими інтерфейсами MAC-адреси з універсальним адмініструванням (тобто де другий молодший біт першого октету *не встановлено*) матимуть перевагу над MAC-адресами з локальним адмініструванням, але без інших гарантій порядку.

source: Universally administered MAC addresses are preferred over locally administered MAC addresses, since the former are guaranteed to be globally unique, while the latter are not.
uk: MAC-адреси з універсальним адмініструванням є кращими перед MAC-адресами з локальним адмініструванням, оскільки перші гарантовано є глобально унікальними, а другі – ні.

source: Generate a UUID from a host ID, sequence number, and the current time. If *node* is not given, :func:`getnode` is used to obtain the hardware address. If *clock_seq* is given, it is used as the sequence number; otherwise a random 14-bit sequence number is chosen.
uk: Згенеруйте UUID з ідентифікатора хоста, порядкового номера та поточного часу. Якщо *node* не вказано, :func:`getnode` використовується для отримання апаратної адреси. Якщо задано *clock_seq*, воно використовується як порядковий номер; інакше вибирається випадковий 14-бітний порядковий номер.

source: Generate a random UUID.
uk: Згенеруйте випадковий UUID.

source: The :mod:`uuid` module defines the following namespace identifiers for use with :func:`uuid3` or :func:`uuid5`.
uk: Модуль :mod:`uuid` визначає наступні ідентифікатори простору імен для використання з :func:`uuid3` або :func:`uuid5`.

source: When this namespace is specified, the *name* string is a URL.
uk: Якщо вказано цей простір імен, рядок *name* є URL-адресою.

source: When this namespace is specified, the *name* string is an ISO OID.
uk: Якщо вказано цей простір імен, рядок *name* є ідентифікатором ISO OID.

source: When this namespace is specified, the *name* string is an X.500 DN in DER or a text output format.
uk: Якщо вказано цей простір імен, рядок *name* є X.500 DN у DER або текстовому форматі виводу.

source: Reserved for NCS compatibility.
uk: Зарезервовано для сумісності з NCS.

source: Specifies the UUID layout given in :rfc:`4122`.
uk: Визначає макет UUID, указаний у :rfc:`4122`.

source: Reserved for Microsoft compatibility.
uk: Зарезервовано для сумісності з Microsoft.

source: Reserved for future definition.
uk: Зарезервовано для майбутнього визначення.

source: :rfc:`4122` - A Universally Unique IDentifier (UUID) URN Namespace
uk: :rfc:`4122` - простір імен URN універсального унікального ідентифікатора (UUID)

source: This specification defines a Uniform Resource Name namespace for UUIDs, the internal format of UUIDs, and methods of generating UUIDs.
uk: Ця специфікація визначає простір імен Uniform Resource Name для UUID, внутрішній формат UUID і методи генерації UUID.

source: Command-Line Usage
uk: Використання командного рядка

source: The following options are accepted:
uk: Приймаються такі варіанти:

source: Show the help message and exit.
uk: Показати довідкове повідомлення та вийти.

source: Example
uk: приклад

source: Here are some examples of typical usage of the :mod:`uuid` module::
uk: Ось декілька прикладів типового використання модуля :mod:`uuid`::
