Repository: python/python-docs-uk
Catalog: library/venv.po
Languages: uk

source: :mod:`venv` --- Creation of virtual environments
uk: :mod:`venv` --- Створення віртуальних середовищ

source: **Source code:** :source:`Lib/venv/`
uk: **Вихідний код:** :source:`Lib/venv/`

source: The :mod:`venv` module provides support for creating lightweight "virtual environments" with their own site directories, optionally isolated from system site directories. Each virtual environment has its own Python binary (which matches the version of the binary that was used to create this environment) and can have its own independent set of installed Python packages in its site directories.
uk: Модуль :mod:`venv` забезпечує підтримку створення легких "віртуальних середовищ" із власними каталогами сайтів, необов’язково ізольованими від системних каталогів сайтів. Кожне віртуальне середовище має власний двійковий файл Python (який відповідає версії двійкового файлу, який використовувався для створення цього середовища) і може мати власний незалежний набір встановлених пакетів Python у каталогах сайту.

source: See :pep:`405` for more information about Python virtual environments.
uk: Перегляньте :pep:`405` для отримання додаткової інформації про віртуальні середовища Python.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/guides/installing-using-pip-and-virtual-environments/#creating-a-virtual-environment>`__
uk: `Посібник користувача з пакування Python: Створення та використання віртуальних середовищ <https://packaging.python.org/guides/installing-using-pip-and-virtual-environments/#creating-a-virtual-environment>`__

source: Creating virtual environments
uk: Створення віртуальних середовищ

source: Creation of :ref:`virtual environments <venv-def>` is done by executing the command ``venv``::
uk: Створення :ref:`віртуальних середовищ <venv-def>` виконується за допомогою команди ``venv``::

source: Running this command creates the target directory (creating any parent directories that don't exist already) and places a ``pyvenv.cfg`` file in it with a ``home`` key pointing to the Python installation from which the command was run (a common name for the target directory is ``.venv``). It also creates a ``bin`` (or ``Scripts`` on Windows) subdirectory containing a copy/symlink of the Python binary/binaries (as appropriate for the platform or arguments used at environment creation time). It also creates an (initially empty) ``lib/pythonX.Y/site-packages`` subdirectory (on Windows, this is ``Lib\site-packages``). If an existing directory is specified, it will be re-used.
uk: Виконання цієї команди створює цільовий каталог (створюючи будь-які батьківські каталоги, які ще не існують) і розміщує в ньому файл ``pyvenv.cfg`` з ключем ``home``, що вказує на інсталяцію Python, з якої була команда запустити (загальною назвою цільового каталогу є ``.venv``). Він також створює підкаталог ``bin`` (або ``Scripts`` у Windows), що містить копію/символне посилання двійкового/бінарних файлів Python (відповідно до платформи або аргументів, що використовуються під час створення середовища). Він також створює (спочатку порожній) підкаталог ``lib/pythonX.Y/site-packages`` (у Windows це ``Lib\site-packages``). Якщо вказано існуючий каталог, він буде використаний повторно.

source: The use of ``venv`` is now recommended for creating virtual environments.
uk: Тепер для створення віртуальних середовищ рекомендується використовувати ``venv``.

source: On Windows, invoke the ``venv`` command as follows::
uk: У Windows викличте команду ``venv`` наступним чином:

source: Alternatively, if you configured the ``PATH`` and ``PATHEXT`` variables for your :ref:`Python installation <using-on-windows>`::
uk: Крім того, якщо ви налаштували змінні ``PATH`` і ``PATHEXT`` для вашої :ref:`інсталяції Python <using-on-windows>`::

source: The command, if run with ``-h``, will show the available options::
uk: Команда, запущена з ``-h``, покаже доступні параметри::

source: Add ``--upgrade-deps`` option to upgrade pip + setuptools to the latest on PyPI
uk: Додайте опцію ``--upgrade-deps``, щоб оновити pip + setuptools до останньої версії PyPI

source: Installs pip by default, added the ``--without-pip`` and ``--copies`` options
uk: Встановлює pip за замовчуванням, додано параметри ``--without-pip`` і ``--copies``

source: In earlier versions, if the target directory already existed, an error was raised, unless the ``--clear`` or ``--upgrade`` option was provided.
uk: У попередніх версіях, якщо цільовий каталог уже існував, виникала помилка, якщо не було надано опцію ``--clear`` або ``--upgrade``.

source: While symlinks are supported on Windows, they are not recommended. Of particular note is that double-clicking ``python.exe`` in File Explorer will resolve the symlink eagerly and ignore the virtual environment.
uk: Хоча символічні посилання підтримуються в Windows, їх не рекомендується використовувати. Особливо варто відзначити, що подвійне клацання ``python.exe`` у Провіднику файлів швидко розкриє символічне посилання та проігнорує віртуальне середовище.

source: On Microsoft Windows, it may be required to enable the ``Activate.ps1`` script by setting the execution policy for the user. You can do this by issuing the following PowerShell command:
uk: У Microsoft Windows може знадобитися ввімкнути сценарій ``Activate.ps1``, встановивши політику виконання для користувача. Ви можете зробити це, виконавши таку команду PowerShell:

source: See `About Execution Policies <https://go.microsoft.com/fwlink/?LinkID=135170>`_ for more information.
uk: Додаткову інформацію див. у розділі `"Про політику виконання <https://go.microsoft.com/fwlink/?LinkID=135170>`.

source: The created ``pyvenv.cfg`` file also includes the ``include-system-site-packages`` key, set to ``true`` if ``venv`` is run with the ``--system-site-packages`` option, ``false`` otherwise.
uk: Створений файл ``pyvenv.cfg`` також містить ключ ``include-system-site-packages``, встановлений на ``true``, якщо ``venv`` запускається з ``--system-site`` -packages`` параметр, ``false`` інакше.

source: Unless the ``--without-pip`` option is given, :mod:`ensurepip` will be invoked to bootstrap ``pip`` into the virtual environment.
uk: Якщо не вказано параметр ``--without-pip``, :mod:`ensurepip` буде викликано для завантаження ``pip`` у віртуальне середовище.

source: Multiple paths can be given to ``venv``, in which case an identical virtual environment will be created, according to the given options, at each provided path.
uk: Для ``venv`` можна надати кілька шляхів, і в цьому випадку буде створено ідентичне віртуальне середовище, відповідно до заданих параметрів, для кожного наданого шляху.

source: Once a virtual environment has been created, it can be "activated" using a script in the virtual environment's binary directory. The invocation of the script is platform-specific (`<venv>` must be replaced by the path of the directory containing the virtual environment):
uk: Після створення віртуального середовища його можна "активувати" за допомогою сценарію в бінарному каталозі віртуального середовища. Виклик сценарію залежить від платформи ("<venv>" має бути замінено шляхом до каталогу, що містить віртуальне середовище):

source: Platform
uk: Платформа

source: Shell
uk: оболонка

source: Command to activate virtual environment
uk: Команда для активації віртуального середовища

source: $ source <venv>/bin/activate
uk: $ джерело <venv> /bin/активувати

source: fish
uk: риба

source: $ source <venv>/bin/activate.fish
uk: $ джерело <venv> /bin/activate.fish

source: $ source <venv>/bin/activate.csh
uk: $ джерело <venv> /bin/activate.csh

source: PowerShell Core
uk: Ядро PowerShell

source: Windows
uk: вікна

source: C:\\> <venv>\\Scripts\\activate.bat
uk: C:\\> <venv> \\Сценарії\\activate.bat

source: When a virtual environment is active, the :envvar:`VIRTUAL_ENV` environment variable is set to the path of the virtual environment. This can be used to check if one is running inside a virtual environment.
uk: Коли віртуальне середовище активне, змінна середовища :envvar:`VIRTUAL_ENV` встановлюється на шлях до віртуального середовища. Це можна використовувати, щоб перевірити, чи працює він у віртуальному середовищі.

source: You don't specifically *need* to activate an environment; activation just prepends the virtual environment's binary directory to your path, so that "python" invokes the virtual environment's Python interpreter and you can run installed scripts without having to use their full path. However, all scripts installed in a virtual environment should be runnable without activating it, and run with the virtual environment's Python automatically.
uk: Вам не *потрібно* спеціально активувати середовище; активація просто додає двійковий каталог віртуального середовища до вашого шляху, так що "python" викликає інтерпретатор Python віртуального середовища, і ви можете запускати встановлені сценарії без використання повного шляху. Однак усі сценарії, встановлені у віртуальному середовищі, мають бути доступними для запуску без його активації та автоматично запускатися з Python віртуального середовища.

source: You can deactivate a virtual environment by typing "deactivate" in your shell. The exact mechanism is platform-specific and is an internal implementation detail (typically a script or shell function will be used).
uk: Ви можете вимкнути віртуальне середовище, ввівши "deactivate" у своїй оболонці. Точний механізм залежить від платформи та є деталлю внутрішньої реалізації (зазвичай використовується сценарій або функція оболонки).

source: ``fish`` and ``csh`` activation scripts.
uk: скрипти активації ``fish`` і ``csh``.

source: PowerShell activation scripts installed under POSIX for PowerShell Core support.
uk: Сценарії активації PowerShell, встановлені під POSIX для підтримки PowerShell Core.

source: A virtual environment is a Python environment such that the Python interpreter, libraries and scripts installed into it are isolated from those installed in other virtual environments, and (by default) any libraries installed in a "system" Python, i.e., one which is installed as part of your operating system.
uk: Віртуальне середовище — це середовище Python, у якому інтерпретатор Python, бібліотеки та сценарії, встановлені в ньому, ізольовані від тих, що встановлені в інших віртуальних середовищах, і (за замовчуванням) будь-які бібліотеки, встановлені в "системному" Python, тобто тій, яка встановлена як частину вашої операційної системи.

source: A virtual environment is a directory tree which contains Python executable files and other files which indicate that it is a virtual environment.
uk: Віртуальне середовище — це дерево каталогів, яке містить виконувані файли Python та інші файли, які вказують на те, що це віртуальне середовище.

source: Common installation tools such as setuptools_ and pip_ work as expected with virtual environments. In other words, when a virtual environment is active, they install Python packages into the virtual environment without needing to be told to do so explicitly.
uk: Звичайні інструменти встановлення, такі як setuptools_ і pip_, належним чином працюють із віртуальними середовищами. Іншими словами, коли віртуальне середовище активне, вони встановлюють пакети Python у віртуальне середовище, не потребуючи чітких вказівок зробити це.

source: When a virtual environment is active (i.e., the virtual environment's Python interpreter is running), the attributes :attr:`sys.prefix` and :attr:`sys.exec_prefix` point to the base directory of the virtual environment, whereas :attr:`sys.base_prefix` and :attr:`sys.base_exec_prefix` point to the non-virtual environment Python installation which was used to create the virtual environment. If a virtual environment is not active, then :attr:`sys.prefix` is the same as :attr:`sys.base_prefix` and :attr:`sys.exec_prefix` is the same as :attr:`sys.base_exec_prefix` (they all point to a non-virtual environment Python installation).
uk: Коли віртуальне середовище активне (тобто запущений інтерпретатор Python віртуального середовища), атрибути :attr:`sys.prefix` і :attr:`sys.exec_prefix` вказують на базовий каталог віртуального середовища, тоді як :attr:`sys.base_prefix` і :attr:`sys.base_exec_prefix` вказують на встановлення невіртуального середовища Python, яке було використано для створення віртуального середовища. Якщо віртуальне середовище неактивне, то :attr:`sys.prefix` те саме, що :attr:`sys.base_prefix`, а :attr:`sys.exec_prefix` те саме, що :attr:`sys.base_exec_prefix` (усі вони вказують на встановлення Python у невіртуальному середовищі).

source: When a virtual environment is active, any options that change the installation path will be ignored from all :mod:`distutils` configuration files to prevent projects being inadvertently installed outside of the virtual environment.
uk: Коли віртуальне середовище активне, будь-які параметри, які змінюють шлях інсталяції, ігноруватимуться в усіх конфігураційних файлах :mod:`distutils`, щоб запобігти випадковому встановленню проектів за межами віртуального середовища.

source: When working in a command shell, users can make a virtual environment active by running an ``activate`` script in the virtual environment's executables directory (the precise filename and command to use the file is shell-dependent), which prepends the virtual environment's directory for executables to the ``PATH`` environment variable for the running shell. There should be no need in other circumstances to activate a virtual environment; scripts installed into virtual environments have a "shebang" line which points to the virtual environment's Python interpreter. This means that the script will run with that interpreter regardless of the value of ``PATH``. On Windows, "shebang" line processing is supported if you have the Python Launcher for Windows installed (this was added to Python in 3.3 - see :pep:`397` for more details). Thus, double-clicking an installed script in a Windows Explorer window should run the script with the correct interpreter without there needing to be any reference to its virtual environment in ``PATH``.
uk: Працюючи в командній оболонці, користувачі можуть зробити віртуальне середовище активним, запустивши сценарій ``activate`` у каталозі виконуваних файлів віртуального середовища (точне ім’я файлу та команда для використання файлу залежить від оболонки), який додає до віртуального середовища каталог для виконуваних файлів до змінної середовища ``PATH`` для запущеної оболонки. За інших обставин не повинно бути необхідності активувати віртуальне середовище; сценарії, встановлені у віртуальних середовищах, мають рядок "shebang", який вказує на інтерпретатор Python віртуального середовища. Це означає, що сценарій виконуватиметься з цим інтерпретатором незалежно від значення ``PATH``. У Windows обробка рядка "shebang" підтримується, якщо у вас встановлено програму запуску Python для Windows (це було додано до Python у версії 3.3 - див. :pep:`397` для отримання додаткової інформації). Таким чином, подвійне клацання встановленого сценарію у вікні Провідника Windows має запустити сценарій із правильним інтерпретатором без необхідності мати будь-яке посилання на його віртуальне середовище в ``PATH``.

source: The high-level method described above makes use of a simple API which provides mechanisms for third-party virtual environment creators to customize environment creation according to their needs, the :class:`EnvBuilder` class.
uk: Метод високого рівня, описаний вище, використовує простий API, який надає механізми для сторонніх творців віртуального середовища для налаштування створення середовища відповідно до своїх потреб, клас :class:`EnvBuilder`.

source: The :class:`EnvBuilder` class accepts the following keyword arguments on instantiation:
uk: Клас :class:`EnvBuilder` приймає такі ключові аргументи під час створення екземпляра:

source: ``system_site_packages`` -- a Boolean value indicating that the system Python site-packages should be available to the environment (defaults to ``False``).
uk: ``system_site_packages`` -- логічне значення, яке вказує, що системні пакети сайтів Python мають бути доступними для середовища (за замовчуванням ``False``).

source: ``clear`` -- a Boolean value which, if true, will delete the contents of any existing target directory, before creating the environment.
uk: ``clear`` -- логічне значення, яке, якщо воно істинне, видалить вміст будь-якого існуючого цільового каталогу перед створенням середовища.

source: ``symlinks`` -- a Boolean value indicating whether to attempt to symlink the Python binary rather than copying.
uk: ``symlinks`` -- логічне значення, яке вказує, чи намагатися символічно посилати двійковий файл Python замість копіювання.

source: ``upgrade`` -- a Boolean value which, if true, will upgrade an existing environment with the running Python - for use when that Python has been upgraded in-place (defaults to ``False``).
uk: ``upgrade`` -- логічне значення, яке, якщо істинне, оновить існуюче середовище з запущеним Python - для використання, коли цей Python було оновлено на місці (за замовчуванням ``False``).

source: ``with_pip`` -- a Boolean value which, if true, ensures pip is installed in the virtual environment. This uses :mod:`ensurepip` with the ``--default-pip`` option.
uk: ``with_pip`` -- логічне значення, яке, якщо воно істинне, гарантує встановлення pip у віртуальному середовищі. Тут використовується :mod:`ensurepip` з опцією ``--default-pip``.

source: ``prompt`` -- a String to be used after virtual environment is activated (defaults to ``None`` which means directory name of the environment would be used). If the special string ``"."`` is provided, the basename of the current directory is used as the prompt.
uk: ``prompt`` -- Рядок, який буде використовуватися після активації віртуального середовища (за замовчуванням ``None``, що означає, що використовуватиметься назва каталогу середовища). Якщо вказано спеціальний рядок ``"."``, базова назва поточного каталогу використовується як підказка.

source: ``upgrade_deps`` -- Update the base venv modules to the latest on PyPI
uk: ``upgrade_deps`` -- Оновіть базові модулі venv до останньої версії на PyPI

source: Added the ``with_pip`` parameter
uk: Додано параметр ``with_pip``

source: Added the ``prompt`` parameter
uk: Додано параметр ``prompt``

source: Added the ``upgrade_deps`` parameter
uk: Додано параметр ``upgrade_deps``

source: Creators of third-party virtual environment tools will be free to use the provided :class:`EnvBuilder` class as a base class.
uk: Творці інструментів віртуального середовища сторонніх розробників зможуть вільно використовувати наданий клас :class:`EnvBuilder` як базовий клас.

source: The returned env-builder is an object which has a method, ``create``:
uk: Повернений env-builder є об’єктом, який має метод ``create``:

source: Create a virtual environment by specifying the target directory (absolute or relative to the current directory) which is to contain the virtual environment. The ``create`` method will either create the environment in the specified directory, or raise an appropriate exception.
uk: Створіть віртуальне середовище, вказавши цільовий каталог (абсолютний або відносний до поточного каталогу), який має містити віртуальне середовище. Метод ``create`` або створить середовище у вказаному каталозі, або викличе відповідний виняток.

source: The ``create`` method of the :class:`EnvBuilder` class illustrates the hooks available for subclass customization::
uk: Метод ``create`` класу :class:`EnvBuilder` ілюструє хуки, доступні для налаштування підкласу::

source: Each of the methods :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` and :meth:`post_setup` can be overridden.
uk: Кожен із методів :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` і :meth:`post_setup` можна замінити.

source: Creates the ``pyvenv.cfg`` configuration file in the environment.
uk: Створює файл конфігурації ``pyvenv.cfg`` у середовищі.

source: Creates a copy or symlink to the Python executable in the environment. On POSIX systems, if a specific executable ``python3.x`` was used, symlinks to ``python`` and ``python3`` will be created pointing to that executable, unless files with those names already exist.
uk: Створює копію або символічне посилання на виконуваний файл Python у середовищі. У системах POSIX, якщо використовувався певний виконуваний файл ``python3.x``, будуть створені символічні посилання на ``python`` і ``python3``, які вказуватимуть на цей виконуваний файл, якщо файли з такими назвами вже не існують.

source: Installs activation scripts appropriate to the platform into the virtual environment.
uk: Встановлює у віртуальне середовище сценарії активації, які відповідають платформі.

source: Upgrades the core venv dependency packages (currently ``pip`` and ``setuptools``) in the environment. This is done by shelling out to the ``pip`` executable in the environment.
uk: Оновлює основні пакети залежностей venv (наразі ``pip`` і ``setuptools``) у середовищі. Це робиться шляхом виділення виконуваного файлу ``pip`` у середовищі.

source: A placeholder method which can be overridden in third party implementations to pre-install packages in the virtual environment or perform other post-creation steps.
uk: Метод заповнювача, який можна замінити в реалізаціях сторонніх розробників, щоб попередньо встановити пакети у віртуальному середовищі або виконати інші кроки після створення.

source: Windows now uses redirector scripts for ``python[w].exe`` instead of copying the actual binaries. In 3.7.2 only :meth:`setup_python` does nothing unless running from a build in the source tree.
uk: Windows тепер використовує сценарії перенаправлення для ``python[w].exe`` замість копіювання фактичних двійкових файлів. У 3.7.2 лише :meth:`setup_python` нічого не робить, якщо не запускається зі збірки в дереві вихідних кодів.

source: Windows copies the redirector scripts as part of :meth:`setup_python` instead of :meth:`setup_scripts`. This was not the case in 3.7.2. When using symlinks, the original executables will be linked.
uk: Windows копіює сценарії перенаправлення як частину :meth:`setup_python` замість :meth:`setup_scripts`. У 3.7.2 цього не було. У разі використання символічних посилань оригінальні виконувані файли будуть зв’язані.

source: In addition, :class:`EnvBuilder` provides this utility method that can be called from :meth:`setup_scripts` or :meth:`post_setup` in subclasses to assist in installing custom scripts into the virtual environment.
uk: Крім того, :class:`EnvBuilder` надає цей метод утиліти, який можна викликати з :meth:`setup_scripts` або :meth:`post_setup` у підкласах, щоб допомогти в установці спеціальних сценаріїв у віртуальне середовище.

source: *path* is the path to a directory that should contain subdirectories "common", "posix", "nt", each containing scripts destined for the bin directory in the environment. The contents of "common" and the directory corresponding to :data:`os.name` are copied after some text replacement of placeholders:
uk: *шлях* — це шлях до каталогу, який має містити підкаталоги "common", "posix", "nt", кожен із яких містить сценарії, призначені для каталогу bin у середовищі. Вміст "common" і каталогу, що відповідає :data:`os.name`, копіюються після деякої заміни тексту заповнювачів:

source: ``__VENV_DIR__`` is replaced with the absolute path of the environment directory.
uk: ``__VENV_DIR__`` замінюється на абсолютний шлях до каталогу середовища.

source: ``__VENV_NAME__`` is replaced with the environment name (final path segment of environment directory).
uk: ``__VENV_NAME__`` замінюється назвою середовища (останній сегмент шляху каталогу середовища).
