Repository: python/python-docs-uk
Catalog: library/venv.po
Languages: uk

source: ``__VENV_PROMPT__`` is replaced with the prompt (the environment name surrounded by parentheses and with a following space)
uk: ``__VENV_PROMPT__`` замінюється підказкою (назва середовища в круглих дужках і пробіл після неї)

source: ``__VENV_BIN_NAME__`` is replaced with the name of the bin directory (either ``bin`` or ``Scripts``).
uk: ``__VENV_BIN_NAME__`` замінюється назвою каталогу bin (або ``bin``, або ``Scripts``).

source: ``__VENV_PYTHON__`` is replaced with the absolute path of the environment's executable.
uk: ``__VENV_PYTHON__`` замінюється абсолютним шляхом до виконуваного файлу середовища.

source: The directories are allowed to exist (for when an existing environment is being upgraded).
uk: Каталоги можуть існувати (під час оновлення існуючого середовища).

source: There is also a module-level convenience function:
uk: Також є функція зручності на рівні модуля:

source: Create an :class:`EnvBuilder` with the given keyword arguments, and call its :meth:`~EnvBuilder.create` method with the *env_dir* argument.
uk: Створіть :class:`EnvBuilder` із заданими ключовими аргументами та викличте його метод :meth:`~EnvBuilder.create` з аргументом *env_dir*.

source: An example of extending ``EnvBuilder``
uk: Приклад розширення ``EnvBuilder``

source: The following script shows how to extend :class:`EnvBuilder` by implementing a subclass which installs setuptools and pip into a created virtual environment::
uk: Наступний сценарій показує, як розширити :class:`EnvBuilder` шляхом впровадження підкласу, який встановлює setuptools і pip у створене віртуальне середовище::

source: This script is also available for download `online <https://gist.github.com/vsajip/4673395>`_.
uk: Цей скрипт також доступний для завантаження `online <https://gist.github.com/vsajip/4673395>`_.
