Repository: python/python-docs-uk
Catalog: library/warnings.po
Languages: uk

source: Warning categories that are primarily of interest to Python developers (rather than end users of applications written in Python) are ignored by default.
uk: Категорії попереджень, які в першу чергу цікавлять розробників Python (а не кінцевих користувачів програм, написаних на Python), ігноруються за умовчанням.

source: Notably, this "ignored by default" list includes :exc:`DeprecationWarning` (for every module except ``__main__``), which means developers should make sure to test their code with typically ignored warnings made visible in order to receive timely notifications of future breaking API changes (whether in the standard library or third party packages).
uk: Примітно, що цей список "ігнорується за замовчуванням" включає :exc:`DeprecationWarning` (для кожного модуля, крім ``__main__``), що означає, що розробники повинні обов’язково перевірити свій код із попередженнями, які зазвичай ігноруються, щоб отримати своєчасні сповіщення. майбутніх критичних змін API (у стандартній бібліотеці чи сторонніх пакетах).

source: In the ideal case, the code will have a suitable test suite, and the test runner will take care of implicitly enabling all warnings when running tests (the test runner provided by the :mod:`unittest` module does this).
uk: В ідеальному випадку код матиме відповідний набір тестів, а програма виконання тестів подбає про неявне ввімкнення всіх попереджень під час виконання тестів (це виконує програма виконання тестів, надана модулем :mod:`unittest`).

source: In less ideal cases, applications can be checked for use of deprecated interfaces by passing :option:`-Wd <-W>` to the Python interpreter (this is shorthand for :option:`!-W default`) or setting ``PYTHONWARNINGS=default`` in the environment. This enables default handling for all warnings, including those that are ignored by default. To change what action is taken for encountered warnings you can change what argument is passed to :option:`-W` (e.g. :option:`!-W error`). See the :option:`-W` flag for more details on what is possible.
uk: У менш ідеальних випадках програми можна перевірити на використання застарілих інтерфейсів, передавши :option:`-Wd <-W>` інтерпретатору Python (це скорочення :option:`!-W default`) або встановивши ``PYTHONWARNINGS=default`` в навколишньому середовищі. Це вмикає обробку за замовчуванням для всіх попереджень, включаючи ті, які ігноруються за замовчуванням. Щоб змінити дії, які виконуються для виявлених попереджень, ви можете змінити аргумент, який передається до :option:`-W` (наприклад, :option:`!-W error`). Перегляньте прапорець :option:`-W`, щоб дізнатися більше про те, що можливо.

source: Available Functions
uk: Доступні функції

source: Issue a warning, or maybe ignore it or raise an exception. The *category* argument, if given, must be a :ref:`warning category class <warning-categories>`; it defaults to :exc:`UserWarning`. Alternatively, *message* can be a :exc:`Warning` instance, in which case *category* will be ignored and ``message.__class__`` will be used. In this case, the message text will be ``str(message)``. This function raises an exception if the particular warning issued is changed into an error by the :ref:`warnings filter <warning-filter>`. The *stacklevel* argument can be used by wrapper functions written in Python, like this::
uk: Видайте попередження, або, можливо, проігноруйте його чи створіть виняток. Аргумент *category*, якщо він заданий, має бути :ref:`класом категорії попередження <warning-categories>`; за замовчуванням :exc:`UserWarning`. Крім того, *message* може бути екземпляром :exc:`Warning`, у цьому випадку *category* буде проігноровано та використовуватиметься ``message.__class__``. У цьому випадку текст повідомлення буде ``str(message)``. Ця функція викликає виняток, якщо :ref:`фільтр попереджень <warning-filter>` змінює конкретне видане попередження на помилку. Аргумент *stacklevel* може використовуватися функціями-обгортками, написаними на Python, наприклад:

source: This makes the warning refer to :func:`deprecation`'s caller, rather than to the source of :func:`deprecation` itself (since the latter would defeat the purpose of the warning message).
uk: Це змушує попередження посилатися на виклик :func:`deprecation`, а не на джерело самого :func:`deprecation` (оскільки останнє не відповідає меті повідомлення попередження).

source: *source*, if supplied, is the destroyed object which emitted a :exc:`ResourceWarning`.
uk: *джерело*, якщо вказано, це знищений об’єкт, який випустив :exc:`ResourceWarning`.

source: Added *source* parameter.
uk: Додано параметр *джерело*.

source: This is a low-level interface to the functionality of :func:`warn`, passing in explicitly the message, category, filename and line number, and optionally the module name and the registry (which should be the ``__warningregistry__`` dictionary of the module). The module name defaults to the filename with ``.py`` stripped; if no registry is passed, the warning is never suppressed. *message* must be a string and *category* a subclass of :exc:`Warning` or *message* may be a :exc:`Warning` instance, in which case *category* will be ignored.
uk: Це низькорівневий інтерфейс для функціональності :func:`warn`, який явно передає повідомлення, категорію, ім’я файлу та номер рядка, а також, за бажанням, назву модуля та реєстр (який має бути словником ``__warningregistry__`` модуля). Ім’я модуля за замовчуванням – це ім’я файлу з видаленим ``.py``; якщо реєстр не передано, попередження ніколи не пригнічується. *message* має бути рядком, а *category* — підкласом :exc:`Warning` або *message* може бути екземпляром :exc:`Warning`, у цьому випадку *category* ігноруватиметься.

source: *module_globals*, if supplied, should be the global namespace in use by the code for which the warning is issued. (This argument is used to support displaying source for modules found in zipfiles or other non-filesystem import sources).
uk: *module_globals*, якщо вказано, має бути глобальним простором імен, який використовується кодом, для якого видається попередження. (Цей аргумент використовується для підтримки відображення вихідного коду для модулів, знайдених у zip-файлах або інших джерелах імпорту, які не належать до файлової системи).

source: Add the *source* parameter.
uk: Додайте параметр *source*.

source: Write a warning to a file. The default implementation calls ``formatwarning(message, category, filename, lineno, line)`` and writes the resulting string to *file*, which defaults to :data:`sys.stderr`. You may replace this function with any callable by assigning to ``warnings.showwarning``. *line* is a line of source code to be included in the warning message; if *line* is not supplied, :func:`showwarning` will try to read the line specified by *filename* and *lineno*.
uk: Записати попередження у файл. Стандартна реалізація викликає ``formatwarning(message, category, filename, lineno, line)`` і записує результуючий рядок у *file*, який за замовчуванням має значення :data:`sys.stderr`. Ви можете замінити цю функцію будь-якою викликаною, призначивши ``warning.showwarning``. *рядок* — це рядок вихідного коду, який буде включено в повідомлення попередження; якщо *рядок* не надано, :func:`showwarning` спробує прочитати рядок, визначений *filename* і *lineno*.

source: Format a warning the standard way. This returns a string which may contain embedded newlines and ends in a newline. *line* is a line of source code to be included in the warning message; if *line* is not supplied, :func:`formatwarning` will try to read the line specified by *filename* and *lineno*.
uk: Відформатуйте попередження стандартним способом. Це повертає рядок, який може містити вбудовані символи нового рядка та закінчується символом нового рядка. *рядок* — це рядок вихідного коду, який буде включено в повідомлення попередження; якщо *рядок* не вказано, :func:`formatwarning` спробує прочитати рядок, визначений *filename* і *lineno*.

source: Insert an entry into the list of :ref:`warnings filter specifications <warning-filter>`. The entry is inserted at the front by default; if *append* is true, it is inserted at the end. This checks the types of the arguments, compiles the *message* and *module* regular expressions, and inserts them as a tuple in the list of warnings filters. Entries closer to the front of the list override entries later in the list, if both match a particular warning. Omitted arguments default to a value that matches everything.
uk: Вставте запис у список :ref:`специфікацій фільтра попереджень <warning-filter>`. Запис вставляється спереду за замовчуванням; якщо *append* має значення true, воно вставляється в кінці. Це перевіряє типи аргументів, компілює регулярні вирази *message* і *module* і вставляє їх як кортеж у список фільтрів попереджень. Записи, розташовані ближче до початку списку, замінюють записи, розташовані далі в списку, якщо обидва відповідають певному попередженню. Пропущені аргументи за умовчанням мають значення, яке відповідає всім.

source: Insert a simple entry into the list of :ref:`warnings filter specifications <warning-filter>`. The meaning of the function parameters is as for :func:`filterwarnings`, but regular expressions are not needed as the filter inserted always matches any message in any module as long as the category and line number match.
uk: Вставте простий запис у список специфікацій фільтра :ref:`попереджень <warning-filter>`. Значення параметрів функції таке ж, як і для :func:`filterwarnings`, але регулярні вирази не потрібні, оскільки вставлений фільтр завжди відповідає будь-якому повідомленню в будь-якому модулі, якщо збігаються категорія та номер рядка.

source: Reset the warnings filter. This discards the effect of all previous calls to :func:`filterwarnings`, including that of the :option:`-W` command line options and calls to :func:`simplefilter`.
uk: Скинути фільтр попереджень. Це скасовує дію всіх попередніх викликів :func:`filterwarnings`, включаючи параметри командного рядка :option:`-W` і виклики :func:`simplefilter`.

source: Available Context Managers
uk: Доступні менеджери контексту

source: A context manager that copies and, upon exit, restores the warnings filter and the :func:`showwarning` function. If the *record* argument is :const:`False` (the default) the context manager returns :class:`None` on entry. If *record* is :const:`True`, a list is returned that is progressively populated with objects as seen by a custom :func:`showwarning` function (which also suppresses output to ``sys.stdout``). Each object in the list has attributes with the same names as the arguments to :func:`showwarning`.
uk: Контекстний менеджер, який копіює та після виходу відновлює фільтр попереджень і функцію :func:`showwarning`. Якщо аргумент *record* має значення :const:`False` (за замовчуванням), менеджер контексту повертає :class:`None` під час входу. Якщо *record* дорівнює :const:`True`, повертається список, який поступово заповнюється об’єктами, як це бачить спеціальна функція :func:`showwarning` (яка також пригнічує виведення в ``sys.stdout``). Кожен об’єкт у списку має атрибути з тими самими іменами, що й аргументи :func:`showwarning`.

source: The *module* argument takes a module that will be used instead of the module returned when you import :mod:`warnings` whose filter will be protected. This argument exists primarily for testing the :mod:`warnings` module itself.
uk: Аргумент *module* приймає модуль, який використовуватиметься замість модуля, який повертається під час імпорту :mod:`warnings`, фільтр якого буде захищено. Цей аргумент існує насамперед для тестування самого модуля :mod:`warnings`.

source: The :class:`catch_warnings` manager works by replacing and then later restoring the module's :func:`showwarning` function and internal list of filter specifications. This means the context manager is modifying global state and therefore is not thread-safe.
uk: Менеджер :class:`catch_warnings` працює, замінюючи, а потім пізніше відновлюючи функцію :func:`showwarning` модуля та внутрішній список специфікацій фільтрів. Це означає, що менеджер контексту змінює глобальний стан і тому не є потоково-безпечним.
