Repository: python/python-docs-uk
Catalog: library/wave.po
Languages: uk

source: :mod:`wave` --- Read and write WAV files
uk: :mod:`wave` --- Читання та запис файлів WAV

source: **Source code:** :source:`Lib/wave.py`
uk: **Вихідний код:** :source:`Lib/wave.py`

source: The :mod:`wave` module provides a convenient interface to the WAV sound format. It does not support compression/decompression, but it does support mono/stereo.
uk: Модуль :mod:`wave` забезпечує зручний інтерфейс звукового формату WAV. Він не підтримує стиснення/декомпресію, але підтримує моно/стерео.

source: The :mod:`wave` module defines the following function and exception:
uk: Модуль :mod:`wave` визначає таку функцію та виняток:

source: If *file* is a string, open the file by that name, otherwise treat it as a file-like object. *mode* can be:
uk: Якщо *file* є рядком, відкрийте файл під таким іменем, інакше розглядайте його як файлоподібний об’єкт. *режим* може бути:

source: Read only mode.
uk: Режим тільки читання.

source: Write only mode.
uk: Режим лише запису.

source: Note that it does not allow read/write WAV files.
uk: Зауважте, що він не дозволяє читати/записувати файли WAV.

source: A *mode* of ``'rb'`` returns a :class:`Wave_read` object, while a *mode* of ``'wb'`` returns a :class:`Wave_write` object. If *mode* is omitted and a file-like object is passed as *file*, ``file.mode`` is used as the default value for *mode*.
uk: *Режим* ``'rb'`` повертає об’єкт :class:`Wave_read`, а *режим* ``'wb'`` повертає об’єкт :class:`Wave_write`. Якщо *mode* опущено, а файлоподібний об’єкт передається як *file*, ``file.mode`` використовується як значення за замовчуванням для *mode*.

source: If you pass in a file-like object, the wave object will not close it when its :meth:`close` method is called; it is the caller's responsibility to close the file object.
uk: Якщо ви передаєте файлоподібний об’єкт, об’єкт wave не закриє його під час виклику його методу :meth:`close`; закриття файлового об'єкта відповідає абоненту.

source: The :func:`.open` function may be used in a :keyword:`with` statement. When the :keyword:`!with` block completes, the :meth:`Wave_read.close() <wave.Wave_read.close>` or :meth:`Wave_write.close() <wave.Wave_write.close()>` method is called.
uk: Функцію :func:`.open` можна використовувати в операторі :keyword:`with`. Коли блок :keyword:`!with` завершується, викликається метод :meth:`Wave_read.close() <wave.Wave_read.close>` або :meth:`Wave_write.close() <wave.Wave_write.close()>`.

source: Added support for unseekable files.
uk: Додано підтримку файлів, які неможливо шукати.

source: An error raised when something is impossible because it violates the WAV specification or hits an implementation deficiency.
uk: Помилка виникає, коли щось неможливо, оскільки воно порушує специфікацію WAV або стикається з недоліком реалізації.

source: Wave_read Objects
uk: Об’єкти Wave_read

source: Wave_read objects, as returned by :func:`.open`, have the following methods:
uk: Об’єкти Wave_read, які повертає :func:`.open`, мають такі методи:

source: Close the stream if it was opened by :mod:`wave`, and make the instance unusable. This is called automatically on object collection.
uk: Закрийте потік, якщо його відкрив :mod:`wave`, і зробіть екземпляр непридатним для використання. Це викликається автоматично під час колекції об’єктів.

source: Returns number of audio channels (``1`` for mono, ``2`` for stereo).
uk: Повертає кількість аудіоканалів (``1`` для моно, ``2`` для стерео).

source: Returns sample width in bytes.
uk: Повертає ширину вибірки в байтах.

source: Returns sampling frequency.
uk: Повертає частоту вибірки.

source: Returns number of audio frames.
uk: Повертає кількість звукових кадрів.

source: Returns compression type (``'NONE'`` is the only supported type).
uk: Повертає тип стиснення (``'NONE'`` є єдиним підтримуваним типом).

source: Human-readable version of :meth:`getcomptype`. Usually ``'not compressed'`` parallels ``'NONE'``.
uk: Зрозуміла для людини версія :meth:`getcomptype`. Зазвичай ``'not compressed'`` паралелі ``'NONE'``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the :meth:`get\*` methods.
uk: Повертає :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, еквівалентний виводу методів :meth:`get\*`.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object.
uk: Читає та повертає щонайбільше *n* кадрів аудіо як об’єкт :class:`bytes`.

source: Rewind the file pointer to the beginning of the audio stream.
uk: Перемотайте покажчик файлу на початок аудіопотоку.

source: The following two methods are defined for compatibility with the :mod:`aifc` module, and don't do anything interesting.
uk: Наступні два методи визначені для сумісності з модулем :mod:`aifc` і не роблять нічого цікавого.

source: Returns ``None``.
uk: Повертає ``None``.

source: Raise an error.
uk: Викликати помилку.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
uk: Наступні два методи визначають термін "позиція", який є сумісним між ними, а в інших випадках залежить від реалізації.

source: Set the file pointer to the specified position.
uk: Встановити вказівник файлу у вказане положення.

source: Return current file pointer position.
uk: Повернути поточне положення покажчика файлу.

source: Wave_write Objects
uk: Об’єкти Wave_write

source: For seekable output streams, the ``wave`` header will automatically be updated to reflect the number of frames actually written. For unseekable streams, the *nframes* value must be accurate when the first frame data is written. An accurate *nframes* value can be achieved either by calling :meth:`~Wave_write.setnframes` or :meth:`~Wave_write.setparams` with the number of frames that will be written before :meth:`~Wave_write.close` is called and then using :meth:`~Wave_write.writeframesraw` to write the frame data, or by calling :meth:`~Wave_write.writeframes` with all of the frame data to be written. In the latter case :meth:`~Wave_write.writeframes` will calculate the number of frames in the data and set *nframes* accordingly before writing the frame data.
uk: Для доступних для пошуку вихідних потоків заголовок ``wave`` буде автоматично оновлено, щоб відобразити кількість фактично записаних кадрів. Для потоків, які неможливо шукати, значення *nframes* має бути точним під час запису даних першого кадру. Точне значення *nframes* можна отримати, викликавши :meth:`~Wave_write.setnframes` або :meth:`~Wave_write.setparams` із кількістю кадрів, які будуть записані перед :meth:`~Wave_write.close` викликається, а потім використовує :meth:`~Wave_write.writeframesraw` для запису даних кадру або викликає :meth:`~Wave_write.writeframes` з усіма даними кадру, які потрібно записати. В останньому випадку :meth:`~Wave_write.writeframes` обчислить кількість кадрів у даних і відповідно встановить *nframes* перед записом даних кадру.

source: Wave_write objects, as returned by :func:`.open`, have the following methods:
uk: Об’єкти Wave_write, які повертає :func:`.open`, мають такі методи:

source: Make sure *nframes* is correct, and close the file if it was opened by :mod:`wave`. This method is called upon object collection. It will raise an exception if the output stream is not seekable and *nframes* does not match the number of frames actually written.
uk: Переконайтеся, що *nframes* правильний, і закрийте файл, якщо його відкрив :mod:`wave`. Цей метод називається колекцією об’єктів. Це викличе виняток, якщо вихідний потік не доступний для пошуку та *nframes* не відповідає кількості фактично записаних кадрів.

source: Set the number of channels.
uk: Встановіть кількість каналів.

source: Set the sample width to *n* bytes.
uk: Встановіть ширину вибірки на *n* байтів.

source: Set the frame rate to *n*.
uk: Встановіть частоту кадрів на *n*.

source: A non-integral input to this method is rounded to the nearest integer.
uk: Неінтегральний вхід у цей метод округлюється до найближчого цілого числа.

source: Set the number of frames to *n*. This will be changed later if the number of frames actually written is different (this update attempt will raise an error if the output stream is not seekable).
uk: Встановіть кількість кадрів на *n*. Це буде змінено пізніше, якщо фактично записана кількість кадрів буде іншою (ця спроба оновлення викличе помилку, якщо вихідний потік не доступний для пошуку).

source: Set the compression type and description. At the moment, only compression type ``NONE`` is supported, meaning no compression.
uk: Встановіть тип стиснення та опис. На даний момент підтримується лише тип стиснення ``NONE``, що означає відсутність стиснення.

source: The *tuple* should be ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, with values valid for the :meth:`set\*` methods. Sets all parameters.
uk: Кортеж має бути ``(nchannels, sampwidth, framerate, nframes, comptype, compname)`` зі значеннями, дійсними для методів :meth:`set\*`. Встановлює всі параметри.

source: Return current position in the file, with the same disclaimer for the :meth:`Wave_read.tell` and :meth:`Wave_read.setpos` methods.
uk: Повертає поточну позицію у файлі з тим самим застереженням для методів :meth:`Wave_read.tell` і :meth:`Wave_read.setpos`.

source: Write audio frames, without correcting *nframes*.
uk: Записуйте аудіокадри, не виправляючи *nframes*.

source: Any :term:`bytes-like object` is now accepted.
uk: Тепер приймається будь-який :term:`bytes-like object`.

source: Write audio frames and make sure *nframes* is correct. It will raise an error if the output stream is not seekable and the total number of frames that have been written after *data* has been written does not match the previously set value for *nframes*.
uk: Напишіть звукові кадри та переконайтеся, що *nframes* правильний. Це викличе помилку, якщо вихідний потік недоступний для пошуку, а загальна кількість кадрів, які були записані після запису *data*, не збігається з попередньо встановленим значенням для *nframes*.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`, and any attempt to do so will raise :exc:`wave.Error`.
uk: Зауважте, що не можна встановлювати будь-які параметри після виклику :meth:`writeframes` або :meth:`writeframesraw`, і будь-яка спроба зробити це викличе :exc:`wave.Error`.
