Repository: python/python-docs-uk
Catalog: library/weakref.po
Languages: uk

source: :mod:`weakref` --- Weak references
uk: :mod:`weakref` --- Слабкі посилання

source: **Source code:** :source:`Lib/weakref.py`
uk: **Вихідний код:** :source:`Lib/weakref.py`

source: The :mod:`weakref` module allows the Python programmer to create :dfn:`weak references` to objects.
uk: Модуль :mod:`weakref` дозволяє програмісту Python створювати :dfn:`слабкі посилання` на об’єкти.

source: In the following, the term :dfn:`referent` means the object which is referred to by a weak reference.
uk: Далі термін :dfn:`referent` означає об’єкт, на який посилається слабке посилання.

source: A weak reference to an object is not enough to keep the object alive: when the only remaining references to a referent are weak references, :term:`garbage collection` is free to destroy the referent and reuse its memory for something else. However, until the object is actually destroyed the weak reference may return the object even if there are no strong references to it.
uk: Слабкого посилання на об’єкт недостатньо, щоб зберегти об’єкт живим: коли єдині посилання на референт є слабкими посиланнями, :term:`garbage collection` може знищити референт і використовувати його пам’ять для чогось іншого. Однак, поки об’єкт не буде фактично знищено, слабке посилання може повертати об’єкт, навіть якщо на нього немає сильних посилань.

source: A primary use for weak references is to implement caches or mappings holding large objects, where it's desired that a large object not be kept alive solely because it appears in a cache or mapping.
uk: Основним використанням слабких посилань є реалізація кешів або відображень, що містять великі об’єкти, де бажано, щоб великий об’єкт не зберігався живим лише тому, що він з’являється в кеші чи відображенні.

source: For example, if you have a number of large binary image objects, you may wish to associate a name with each. If you used a Python dictionary to map names to images, or images to names, the image objects would remain alive just because they appeared as values or keys in the dictionaries. The :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` classes supplied by the :mod:`weakref` module are an alternative, using weak references to construct mappings that don't keep objects alive solely because they appear in the mapping objects. If, for example, an image object is a value in a :class:`WeakValueDictionary`, then when the last remaining references to that image object are the weak references held by weak mappings, garbage collection can reclaim the object, and its corresponding entries in weak mappings are simply deleted.
uk: Наприклад, якщо у вас є кілька великих бінарних об’єктів зображення, ви можете призначити ім’я кожному. Якби ви використовували словник Python для зіставлення імен із зображеннями або зображень з іменами, об’єкти зображення залишалися б живими лише тому, що вони відображалися як значення або ключі в словниках. Класи :class:`WeakKeyDictionary` і :class:`WeakValueDictionary`, що надаються модулем :mod:`weakref`, є альтернативою, використовуючи слабкі посилання для створення відображень, які не зберігають об’єкти лише тому, що вони з’являються в об’єктах відображення . Якщо, наприклад, об’єкт зображення є значенням у :class:`WeakValueDictionary`, тоді, коли останні посилання на цей об’єкт зображення є слабкими посиланнями, утримуваними слабкими відображеннями, збір сміття може відновити об’єкт і його відповідні записи у слабких відображеннях просто видаляються.

source: :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` use weak references in their implementation, setting up callback functions on the weak references that notify the weak dictionaries when a key or value has been reclaimed by garbage collection. :class:`WeakSet` implements the :class:`set` interface, but keeps weak references to its elements, just like a :class:`WeakKeyDictionary` does.
uk: :class:`WeakKeyDictionary` і :class:`WeakValueDictionary` використовують слабкі посилання у своїй реалізації, встановлюючи функції зворотного виклику для слабких посилань, які сповіщають слабкі словники, коли ключ або значення було вилучено під час збирання сміття. :class:`WeakSet` реалізує інтерфейс :class:`set`, але зберігає слабкі посилання на його елементи, як це робить :class:`WeakKeyDictionary`.

source: :class:`finalize` provides a straight forward way to register a cleanup function to be called when an object is garbage collected. This is simpler to use than setting up a callback function on a raw weak reference, since the module automatically ensures that the finalizer remains alive until the object is collected.
uk: :class:`finalize` забезпечує прямий спосіб реєстрації функції очищення, яка буде викликатися під час збирання сміття об’єкта. Це простіше у використанні, ніж налаштування функції зворотного виклику для необробленого слабкого посилання, оскільки модуль автоматично гарантує, що фіналізатор залишається активним, доки об’єкт не буде зібрано.

source: Most programs should find that using one of these weak container types or :class:`finalize` is all they need -- it's not usually necessary to create your own weak references directly. The low-level machinery is exposed by the :mod:`weakref` module for the benefit of advanced uses.
uk: Більшість програм має виявити, що використання одного з цих слабких типів контейнерів або :class:`finalize` — це все, що їм потрібно - зазвичай не потрібно безпосередньо створювати власні слабкі посилання. Механізм низького рівня розкривається модулем :mod:`weakref` для розширеного використання.

source: Added support for thread.lock, threading.Lock, and code objects.
uk: Додано підтримку об’єктів thread.lock, threading.Lock і коду.

source: Several built-in types such as :class:`list` and :class:`dict` do not directly support weak references but can add support through subclassing::
uk: Кілька вбудованих типів, таких як :class:`list` і :class:`dict`, не підтримують безпосередньо слабкі посилання, але можуть додати підтримку через підкласи::

source: Other built-in types such as :class:`tuple` and :class:`int` do not support weak references even when subclassed.
uk: Інші вбудовані типи, такі як :class:`tuple` і :class:`int` не підтримують слабкі посилання, навіть якщо є підкласами.

source: Extension types can easily be made to support weak references; see :ref:`weakref-support`.
uk: Типи розширень можна легко створити для підтримки слабких посилань; див. :ref:`weakref-support`.

source: When ``__slots__`` are defined for a given type, weak reference support is disabled unless a ``'__weakref__'`` string is also present in the sequence of strings in the ``__slots__`` declaration. See :ref:`__slots__ documentation <slots>` for details.
uk: Коли для даного типу визначено ``__slots__``, підтримку слабких посилань вимкнено, якщо тільки рядок ``'__weakref__`` також не присутній у послідовності рядків у декларації ``__slots__``. Перегляньте :ref:`__slots__ документацію <slots>` для деталей.

source: Return a weak reference to *object*. The original object can be retrieved by calling the reference object if the referent is still alive; if the referent is no longer alive, calling the reference object will cause :const:`None` to be returned. If *callback* is provided and not :const:`None`, and the returned weakref object is still alive, the callback will be called when the object is about to be finalized; the weak reference object will be passed as the only parameter to the callback; the referent will no longer be available.
uk: Повернути слабке посилання на *об’єкт*. Вихідний об’єкт можна отримати, викликавши еталонний об’єкт, якщо референт ще живий; якщо референт більше не живий, виклик об’єкта посилання призведе до повернення :const:`None`. Якщо надано *callback*, а не :const:`None`, і повернутий об’єкт weakref все ще живий, зворотний виклик буде викликано, коли об’єкт буде завершено; об'єкт слабкого посилання буде передано як єдиний параметр зворотного виклику; референт більше не буде доступний.

source: It is allowable for many weak references to be constructed for the same object. Callbacks registered for each weak reference will be called from the most recently registered callback to the oldest registered callback.
uk: Для одного об’єкта допускається створення багатьох слабких посилань. Зворотні виклики, зареєстровані для кожного слабкого посилання, викликатимуться від останнього зареєстрованого зворотного виклику до найстарішого зареєстрованого зворотного виклику.

source: Weak references are :term:`hashable` if the *object* is hashable. They will maintain their hash value even after the *object* was deleted. If :func:`hash` is called the first time only after the *object* was deleted, the call will raise :exc:`TypeError`.
uk: Слабкі посилання є :term:`hashable`, якщо *об’єкт* є хешованим. Вони збережуть своє хеш-значення навіть після видалення *об’єкта*. Якщо :func:`hash` викликається вперше лише після того, як *об’єкт* було видалено, виклик викличе :exc:`TypeError`.

source: Weak references support tests for equality, but not ordering. If the referents are still alive, two references have the same equality relationship as their referents (regardless of the *callback*). If either referent has been deleted, the references are equal only if the reference objects are the same object.
uk: Слабкі посилання підтримують тести на рівність, але не впорядкування. Якщо референти ще живі, два посилання мають таке ж відношення рівності, що й їхні референти (незалежно від *зворотного виклику*). Якщо будь-який референт було видалено, посилання є рівними, лише якщо об’єкти еталонів є одним і тим же об’єктом.

source: This is a subclassable type rather than a factory function.
uk: Це тип підкласу, а не фабрична функція.

source: This read-only attribute returns the callback currently associated to the weakref. If there is no callback or if the referent of the weakref is no longer alive then this attribute will have value ``None``.
uk: Цей атрибут лише для читання повертає зворотний виклик, наразі пов’язаний зі слабким посиланням. Якщо зворотного виклику немає або референт слабкого посилання більше не живий, цей атрибут матиме значення ``None``.

source: Added the :attr:`__callback__` attribute.
uk: Додано атрибут :attr:`__callback__`.

source: Extended the operator support on proxy objects to include the matrix multiplication operators ``@`` and ``@=``.
uk: Розширено підтримку операторів на проксі-об’єктах, щоб включити оператори множення матриці ``@`` і ``@=``.

source: Return the number of weak references and proxies which refer to *object*.
uk: Повертає кількість слабких посилань і проксі, які посилаються на *об’єкт*.

source: Return a list of all weak reference and proxy objects which refer to *object*.
uk: Повертає список усіх слабких посилань і проксі-об’єктів, які посилаються на *об’єкт*.

source: Mapping class that references keys weakly. Entries in the dictionary will be discarded when there is no longer a strong reference to the key. This can be used to associate additional data with an object owned by other parts of an application without adding attributes to those objects. This can be especially useful with objects that override attribute accesses.
uk: Клас зіставлення, який слабко посилається на ключі. Записи в словнику буде відкинуто, коли більше немає сильного посилання на ключ. Це можна використовувати для зв’язування додаткових даних з об’єктом, що належить іншим частинам програми, без додавання атрибутів до цих об’єктів. Це може бути особливо корисним для об’єктів, які перевизначають доступ до атрибутів.

source: Added support for ``|`` and ``|=`` operators, as specified in :pep:`584`.
uk: Додано підтримку операторів ``|`` і ``|=``, як зазначено в :pep:`584`.

source: :class:`WeakKeyDictionary` objects have an additional method that exposes the internal references directly. The references are not guaranteed to be "live" at the time they are used, so the result of calling the references needs to be checked before being used. This can be used to avoid creating references that will cause the garbage collector to keep the keys around longer than needed.
uk: Об’єкти :class:`WeakKeyDictionary` мають додатковий метод, який безпосередньо відкриває внутрішні посилання. Не гарантується, що посилання будуть "живими" під час їх використання, тому результат виклику посилань потрібно перевірити перед використанням. Це можна використовувати, щоб уникнути створення посилань, через які збирач сміття зберігатиме ключі довше, ніж потрібно.

source: Return an iterable of the weak references to the keys.
uk: Повертає ітерацію слабких посилань на ключі.

source: Mapping class that references values weakly. Entries in the dictionary will be discarded when no strong reference to the value exists any more.
uk: Клас зіставлення, який слабко посилається на значення. Записи в словнику буде відкинуто, якщо більше не існує сильного посилання на значення.

source: Return an iterable of the weak references to the values.
uk: Повертає ітерацію слабких посилань на значення.

source: Set class that keeps weak references to its elements. An element will be discarded when no strong reference to it exists any more.
uk: Клас набору, який зберігає слабкі посилання на свої елементи. Елемент буде відкинуто, якщо на нього більше не буде сильних посилань.

source: A custom :class:`ref` subclass which simulates a weak reference to a bound method (i.e., a method defined on a class and looked up on an instance). Since a bound method is ephemeral, a standard weak reference cannot keep hold of it. :class:`WeakMethod` has special code to recreate the bound method until either the object or the original function dies::
uk: Спеціальний підклас :class:`ref`, який імітує слабке посилання на зв’язаний метод (тобто метод, визначений у класі та шуканий у екземплярі). Оскільки зв’язаний метод є ефемерним, стандартне слабке посилання не може втримати його. :class:`WeakMethod` має спеціальний код для відтворення зв’язаного методу, доки об’єкт або вихідна функція не помре::

source: Return a callable finalizer object which will be called when *obj* is garbage collected. Unlike an ordinary weak reference, a finalizer will always survive until the reference object is collected, greatly simplifying lifecycle management.
uk: Повертає викликаний об’єкт фіналізатора, який буде викликаний, коли *obj* буде зібрано сміття. На відміну від звичайного слабкого посилання, фіналізатор завжди житиме, доки не буде зібрано еталонний об’єкт, що значно спрощує керування життєвим циклом.

source: A finalizer is considered *alive* until it is called (either explicitly or at garbage collection), and after that it is *dead*. Calling a live finalizer returns the result of evaluating ``func(*arg, **kwargs)``, whereas calling a dead finalizer returns :const:`None`.
uk: Фіналізатор вважається *живим*, доки його не викликають (явним чином або під час збирання сміття), а після цього він *мертвий*. Виклик активного фіналізатора повертає результат обчислення ``func(*arg, **kwargs)``, тоді як виклик мертвого фіналізатора повертає :const:`None`.

source: When the program exits, each remaining live finalizer is called unless its :attr:`atexit` attribute has been set to false. They are called in reverse order of creation.
uk: Коли програма завершує роботу, викликається кожен живий фіналізатор, що залишився, якщо його атрибут :attr:`atexit` не має значення false. Вони називаються у зворотному порядку створення.

source: A finalizer will never invoke its callback during the later part of the :term:`interpreter shutdown` when module globals are liable to have been replaced by :const:`None`.
uk: Фіналізатор ніколи не викличе свій зворотний виклик протягом наступної частини :term:`interpreter shutdown`, коли глобальні елементи модуля можуть бути замінені на :const:`None`.

source: If *self* is alive then mark it as dead and return the result of calling ``func(*args, **kwargs)``. If *self* is dead then return :const:`None`.
uk: Якщо *self* живе, позначте його як мертве та поверніть результат виклику ``func(*args, **kwargs)``. Якщо *self* мертвий, поверніть :const:`None`.

source: If *self* is alive then mark it as dead and return the tuple ``(obj, func, args, kwargs)``. If *self* is dead then return :const:`None`.
uk: Якщо *self* живий, позначте його як мертвий і поверніть кортеж ``(obj, func, args, kwargs)``. Якщо *self* мертвий, поверніть :const:`None`.

source: If *self* is alive then return the tuple ``(obj, func, args, kwargs)``. If *self* is dead then return :const:`None`.
uk: Якщо *self* живе, повертає кортеж ``(obj, func, args, kwargs)``. Якщо *self* мертвий, поверніть :const:`None`.

source: Property which is true if the finalizer is alive, false otherwise.
uk: Властивість, яка є істинною, якщо фіналізатор активний, і хибною в іншому випадку.

source: A writable boolean property which by default is true. When the program exits, it calls all remaining live finalizers for which :attr:`.atexit` is true. They are called in reverse order of creation.
uk: Булева властивість, доступна для запису, яка за замовчуванням має значення true. Коли програма завершує роботу, вона викликає всі поточні фіналізатори, для яких :attr:`.atexit` має значення true. Вони називаються у зворотному порядку створення.

source: It is important to ensure that *func*, *args* and *kwargs* do not own any references to *obj*, either directly or indirectly, since otherwise *obj* will never be garbage collected. In particular, *func* should not be a bound method of *obj*.
uk: Важливо переконатися, що *func*, *args* і *kwargs* не мають жодних посилань на *obj*, прямо чи опосередковано, оскільки інакше *obj* ніколи не збиратиметься як сміття. Зокрема, *func* не має бути зв’язаним методом *obj*.

source: The type object for weak references objects.
uk: Об’єкт типу для об’єктів слабких посилань.

source: The type object for proxies of objects which are not callable.
uk: Об’єкт типу для проксі об’єктів, які не можна викликати.

source: The type object for proxies of callable objects.
uk: Об’єкт типу для проксі об’єктів, що викликаються.

source: Sequence containing all the type objects for proxies. This can make it simpler to test if an object is a proxy without being dependent on naming both proxy types.
uk: Послідовність, що містить усі об’єкти типу для проксі. Це може спростити перевірку того, чи є об’єкт проксі-сервером, не залежачи від іменування обох типів проксі.

source: :pep:`205` - Weak References
uk: :pep:`205` - Слабкі посилання

source: The proposal and rationale for this feature, including links to earlier implementations and information about similar features in other languages.
uk: Пропозиція та обґрунтування цієї функції, включаючи посилання на попередні реалізації та інформацію про подібні функції іншими мовами.

source: Weak Reference Objects
uk: Слабкі довідкові об’єкти

source: Weak reference objects have no methods and no attributes besides :attr:`ref.__callback__`. A weak reference object allows the referent to be obtained, if it still exists, by calling it:
uk: Слабкі посилальні об’єкти не мають методів і атрибутів, крім :attr:`ref.__callback__`. Слабкий посилальний об’єкт дозволяє отримати референт, якщо він все ще існує, викликаючи його:

source: If the referent no longer exists, calling the reference object returns :const:`None`:
uk: Якщо референт більше не існує, виклик об’єкта посилання повертає :const:`None`:

source: Testing that a weak reference object is still live should be done using the expression ``ref() is not None``. Normally, application code that needs to use a reference object should follow this pattern::
uk: Перевірку того, що слабкий еталонний об’єкт все ще живий, слід виконувати за допомогою виразу ``ref() is not None``. Зазвичай код програми, який потребує використання еталонного об’єкта, має відповідати такому шаблону:

source: Using a separate test for "liveness" creates race conditions in threaded applications; another thread can cause a weak reference to become invalidated before the weak reference is called; the idiom shown above is safe in threaded applications as well as single-threaded applications.
uk: Використання окремого тесту на "жвавість" створює умови гонки в потокових програмах; інший потік може призвести до того, що слабке посилання стане недійсним до виклику слабкого посилання; ідіома, показана вище, безпечна як у багатопотокових програмах, так і в однопотокових програмах.

source: Specialized versions of :class:`ref` objects can be created through subclassing. This is used in the implementation of the :class:`WeakValueDictionary` to reduce the memory overhead for each entry in the mapping. This may be most useful to associate additional information with a reference, but could also be used to insert additional processing on calls to retrieve the referent.
uk: Спеціалізовані версії об’єктів :class:`ref` можна створити за допомогою підкласів. Це використовується в реалізації :class:`WeakValueDictionary`, щоб зменшити витрати пам’яті для кожного запису у відображенні. Це може бути найбільш корисним для пов’язування додаткової інформації з посиланням, але також може використовуватися для вставки додаткової обробки викликів для отримання референту.

source: This example shows how a subclass of :class:`ref` can be used to store additional information about an object and affect the value that's returned when the referent is accessed::
uk: У цьому прикладі показано, як підклас :class:`ref` можна використовувати для зберігання додаткової інформації про об’єкт і впливу на значення, яке повертається під час звернення до референта::

source: Example
uk: приклад

source: This simple example shows how an application can use object IDs to retrieve objects that it has seen before. The IDs of the objects can then be used in other data structures without forcing the objects to remain alive, but the objects can still be retrieved by ID if they do.
uk: Цей простий приклад показує, як програма може використовувати ідентифікатори об’єктів для отримання об’єктів, які вона бачила раніше. Потім ідентифікатори об’єктів можна використовувати в інших структурах даних, не змушуючи об’єкти залишатися живими, але об’єкти все одно можна отримати за ідентифікатором, якщо вони це роблять.

source: Finalizer Objects
uk: Об’єкти фіналізатора

source: The main benefit of using :class:`finalize` is that it makes it simple to register a callback without needing to preserve the returned finalizer object. For instance
uk: Основна перевага використання :class:`finalize` полягає в тому, що це спрощує реєстрацію зворотного виклику без необхідності зберігати повернутий об’єкт фіналізатора. Наприклад

source: The finalizer can be called directly as well. However the finalizer will invoke the callback at most once.
uk: Фіналізатор також можна викликати безпосередньо. Однак фіналізатор викличе зворотний виклик щонайбільше один раз.

source: You can unregister a finalizer using its :meth:`~finalize.detach` method. This kills the finalizer and returns the arguments passed to the constructor when it was created.
uk: Ви можете скасувати реєстрацію фіналізатора за допомогою його методу :meth:`~finalize.detach`. Це вбиває фіналізатор і повертає аргументи, передані конструктору під час його створення.

source: Unless you set the :attr:`~finalize.atexit` attribute to :const:`False`, a finalizer will be called when the program exits if it is still alive. For instance
uk: Якщо ви не встановили для атрибута :attr:`~finalize.atexit` значення :const:`False`, фіналізатор буде викликаний під час завершення програми, якщо вона все ще жива. Наприклад
