Repository: python/python-docs-uk
Catalog: library/winsound.po
Languages: uk

source: The :mod:`winsound` module provides access to the basic sound-playing machinery provided by Windows platforms. It includes functions and several constants.
uk: Модуль :mod:`winsound` надає доступ до основного механізму відтворення звуку, що надається платформами Windows. Він включає функції та декілька констант.

source: Beep the PC's speaker. The *frequency* parameter specifies frequency, in hertz, of the sound, and must be in the range 37 through 32,767. The *duration* parameter specifies the number of milliseconds the sound should last. If the system is not able to beep the speaker, :exc:`RuntimeError` is raised.
uk: Подати звуковий сигнал у динамік ПК. Параметр *frequency* визначає частоту звуку в герцах і має бути в діапазоні від 37 до 32 767. Параметр *тривалість* визначає кількість мілісекунд, протягом якої має тривати звук. Якщо система не може подати звуковий сигнал у динамік, виникає :exc:`RuntimeError`.

source: The *sound* parameter is the name of a WAV file. Do not use with :const:`SND_ALIAS`.
uk: Параметр *sound* — це ім'я файлу WAV. Не використовуйте з :const:`SND_ALIAS`.

source: The *sound* parameter is a sound association name from the registry. If the registry contains no such name, play the system default sound unless :const:`SND_NODEFAULT` is also specified. If no default sound is registered, raise :exc:`RuntimeError`. Do not use with :const:`SND_FILENAME`.
uk: Параметр *sound* — це ім’я звукової асоціації з реєстру. Якщо реєстр не містить такої назви, відтворюйте системний звук за замовчуванням, якщо також не вказано :const:`SND_NODEFAULT`. Якщо стандартний звук не зареєстровано, викликайте :exc:`RuntimeError`. Не використовуйте з :const:`SND_FILENAME`.

source: All Win32 systems support at least the following; most systems support many more:
uk: Усі системи Win32 підтримують щонайменше наступне; більшість систем підтримують набагато більше:

source: :func:`PlaySound` *name*
uk: :func:`PlaySound` *назва*

source: Corresponding Control Panel Sound name
uk: Відповідна назва звуку панелі керування

source: Asterisk
uk: Зірочка

source: Exclamation
uk: Вигук

source: ``'SystemExit'``
uk: ``'Системний вихід'``

source: Exit Windows
uk: Вийдіть з Windows

source: Critical Stop
uk: Критична зупинка

source: Question
uk: Питання

source: For example::
uk: Наприклад::

source: Play the sound repeatedly. The :const:`SND_ASYNC` flag must also be used to avoid blocking. Cannot be used with :const:`SND_MEMORY`.
uk: Повторюйте звук. Прапорець :const:`SND_ASYNC` також слід використовувати, щоб уникнути блокування. Не можна використовувати з :const:`SND_MEMORY`.

source: The *sound* parameter to :func:`PlaySound` is a memory image of a WAV file, as a :term:`bytes-like object`.
uk: Параметр *sound* для :func:`PlaySound` — це образ пам’яті файлу WAV, як :term:`bytes-like object`.

source: This module does not support playing from a memory image asynchronously, so a combination of this flag and :const:`SND_ASYNC` will raise :exc:`RuntimeError`.
uk: Цей модуль не підтримує асинхронне відтворення з образу пам’яті, тому комбінація цього прапорця та :const:`SND_ASYNC` викличе :exc:`RuntimeError`.

source: Stop playing all instances of the specified sound.
uk: Зупинити відтворення всіх екземплярів зазначеного звуку.

source: This flag is not supported on modern Windows platforms.
uk: Цей прапорець не підтримується на сучасних платформах Windows.

source: Return immediately, allowing sounds to play asynchronously.
uk: Поверніться негайно, дозволяючи звукам відтворюватися асинхронно.

source: If the specified sound cannot be found, do not play the system default sound.
uk: Якщо вказаний звук не знайдено, не відтворюйте системний звук за замовчуванням.

source: Do not interrupt sounds currently playing.
uk: Не переривати звуки, які зараз відтворюються.

source: Return immediately if the sound driver is busy.
uk: Негайно поверніться, якщо звуковий драйвер зайнятий.

source: Play the ``SystemDefault`` sound.
uk: Відтворіть звук ``SystemDefault``.

source: Play the ``SystemExclamation`` sound.
uk: Відтворіть звук ``SystemExclamation``.

source: Play the ``SystemHand`` sound.
uk: Відтворіть звук ``SystemHand``.

source: Play the ``SystemQuestion`` sound.
uk: Відтворіть звук ``SystemQuestion``.
