Repository: python/python-docs-uk
Catalog: library/wsgiref.po
Languages: uk

source: The Web Server Gateway Interface (WSGI) is a standard interface between web server software and web applications written in Python. Having a standard interface makes it easy to use an application that supports WSGI with a number of different web servers.
uk: Інтерфейс шлюзу веб-сервера (WSGI) — це стандартний інтерфейс між програмним забезпеченням веб-сервера та веб-додатками, написаними на Python. Наявність стандартного інтерфейсу дозволяє легко використовувати програму, яка підтримує WSGI, з кількома різними веб-серверами.

source: Only authors of web servers and programming frameworks need to know every detail and corner case of the WSGI design. You don't need to understand every detail of WSGI just to install a WSGI application or to write a web application using an existing framework.
uk: Лише автори веб-серверів і фреймворків програмування повинні знати кожну деталь і наріжний випадок дизайну WSGI. Вам не потрібно розуміти кожну деталь WSGI, щоб просто встановити програму WSGI або написати веб-програму за допомогою існуючої структури.

source: See `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ for more information about WSGI, and links to tutorials and other resources.
uk: Перегляньте `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ для отримання додаткової інформації про WSGI, а також посилання на навчальні посібники та інші ресурси.

source: :mod:`wsgiref.util` -- WSGI environment utilities
uk: :mod:`wsgiref.util` -- утиліти середовища WSGI

source: Return a guess for whether ``wsgi.url_scheme`` should be "http" or "https", by checking for a ``HTTPS`` environment variable in the *environ* dictionary. The return value is a string.
uk: Поверніть припущення щодо того, чи має ``wsgi.url_scheme`` бути "http" чи "https", перевіривши наявність змінної середовища ``HTTPS`` у словнику *environ*. Поверненим значенням є рядок.

source: This function is useful when creating a gateway that wraps CGI or a CGI-like protocol such as FastCGI. Typically, servers providing such protocols will include a ``HTTPS`` variable with a value of "1", "yes", or "on" when a request is received via SSL. So, this function returns "https" if such a value is found, and "http" otherwise.
uk: Ця функція корисна під час створення шлюзу, який обгортає CGI або CGI-подібний протокол, наприклад FastCGI. Як правило, сервери, що надають такі протоколи, включатимуть змінну ``HTTPS`` зі значенням "1", "yes" або "on", коли запит надходить через SSL. Таким чином, ця функція повертає "https", якщо таке значення знайдено, і "http" в іншому випадку.

source: Return the full request URI, optionally including the query string, using the algorithm found in the "URL Reconstruction" section of :pep:`3333`. If *include_query* is false, the query string is not included in the resulting URI.
uk: Поверніть повний URI запиту, необов’язково включаючи рядок запиту, використовуючи алгоритм, знайдений у розділі "Реконструкція URL-адреси" :pep:`3333`. Якщо *include_query* має значення false, рядок запиту не включається в отриманий URI.

source: Similar to :func:`request_uri`, except that the ``PATH_INFO`` and ``QUERY_STRING`` variables are ignored. The result is the base URI of the application object addressed by the request.
uk: Подібно до :func:`request_uri`, за винятком того, що змінні ``PATH_INFO`` і ``QUERY_STRING`` ігноруються. Результатом є базовий URI об’єкта програми, адресованого запитом.

source: Shift a single name from ``PATH_INFO`` to ``SCRIPT_NAME`` and return the name. The *environ* dictionary is *modified* in-place; use a copy if you need to keep the original ``PATH_INFO`` or ``SCRIPT_NAME`` intact.
uk: Перемістіть одну назву з ``PATH_INFO`` на ``SCRIPT_NAME`` і поверніть назву. Словник *environ* *змінено* на місці; використовуйте копію, якщо вам потрібно зберегти оригінальний ``PATH_INFO`` або ``SCRIPT_NAME`` недоторканим.

source: If there are no remaining path segments in ``PATH_INFO``, ``None`` is returned.
uk: Якщо в ``PATH_INFO`` немає сегментів шляху, повертається ``None``.

source: Typically, this routine is used to process each portion of a request URI path, for example to treat the path as a series of dictionary keys. This routine modifies the passed-in environment to make it suitable for invoking another WSGI application that is located at the target URI. For example, if there is a WSGI application at ``/foo``, and the request URI path is ``/foo/bar/baz``, and the WSGI application at ``/foo`` calls :func:`shift_path_info`, it will receive the string "bar", and the environment will be updated to be suitable for passing to a WSGI application at ``/foo/bar``. That is, ``SCRIPT_NAME`` will change from ``/foo`` to ``/foo/bar``, and ``PATH_INFO`` will change from ``/bar/baz`` to ``/baz``.
uk: Як правило, ця підпрограма використовується для обробки кожної частини шляху URI запиту, наприклад, щоб трактувати шлях як серію ключів словника. Ця процедура змінює передане середовище, щоб зробити його придатним для виклику іншої програми WSGI, яка розташована за цільовим URI. Наприклад, якщо за адресою ``/foo`` є програма WSGI, а шлях URI запиту — ``/foo/bar/baz``, а програма WSGI за адресою ``/foo`` викликає :func:`shift_path_info`, він отримає рядок "bar", і середовище буде оновлено, щоб воно було придатним для передачі до програми WSGI за адресою ``/foo/bar``. Тобто ``SCRIPT_NAME`` зміниться з ``/foo`` на ``/foo/bar``, а ``PATH_INFO`` зміниться з ``/bar/baz`` на ``/baz``.

source: When ``PATH_INFO`` is just a "/", this routine returns an empty string and appends a trailing slash to ``SCRIPT_NAME``, even though empty path segments are normally ignored, and ``SCRIPT_NAME`` doesn't normally end in a slash. This is intentional behavior, to ensure that an application can tell the difference between URIs ending in ``/x`` from ones ending in ``/x/`` when using this routine to do object traversal.
uk: Коли ``PATH_INFO`` є просто "/", ця підпрограма повертає порожній рядок і додає кінцеву косу риску до ``SCRIPT_NAME``, навіть якщо порожні сегменти шляху зазвичай ігноруються, а ``SCRIPT_NAME`` зазвичай не закінчуються косою рискою. Це навмисна поведінка, щоб гарантувати, що програма може визначити різницю між URI, що закінчуються на ``/x``, від тих, що закінчуються на ``/x/`` під час використання цієї процедури для обходу об’єктів.

source: Update *environ* with trivial defaults for testing purposes.
uk: Оновіть *environ* з тривіальними параметрами за замовчуванням для цілей тестування.

source: This routine adds various parameters required for WSGI, including ``HTTP_HOST``, ``SERVER_NAME``, ``SERVER_PORT``, ``REQUEST_METHOD``, ``SCRIPT_NAME``, ``PATH_INFO``, and all of the :pep:`3333`\ -defined ``wsgi.*`` variables. It only supplies default values, and does not replace any existing settings for these variables.
uk: Ця процедура додає різноманітні параметри, необхідні для WSGI, зокрема ``HTTP_HOST``, ``SERVER_NAME``, ``SERVER_PORT``, ``REQUEST_METHOD``, ``SCRIPT_NAME``, ``PATH_INFO`` та всі :pep:`3333`\ -визначені змінні ``wsgi.*``. Він надає лише значення за замовчуванням і не замінює жодних існуючих параметрів для цих змінних.

source: This routine is intended to make it easier for unit tests of WSGI servers and applications to set up dummy environments. It should NOT be used by actual WSGI servers or applications, since the data is fake!
uk: Ця процедура призначена для полегшення модульних тестів серверів і програм WSGI для налаштування фіктивних середовищ. Його НЕ слід використовувати на справжніх серверах або програмах WSGI, оскільки дані підроблені!

source: In addition to the environment functions above, the :mod:`wsgiref.util` module also provides these miscellaneous utilities:
uk: На додаток до функцій середовища, наведених вище, модуль :mod:`wsgiref.util` також надає такі різноманітні утиліти:

source: Return ``True`` if 'header_name' is an HTTP/1.1 "Hop-by-Hop" header, as defined by :rfc:`2616`.
uk: Повертає ``True``, якщо 'header_name' є заголовком HTTP/1.1 "Hop-by-Hop", як визначено :rfc:`2616`.

source: If *filelike* has a :meth:`close` method, the returned object will also have a :meth:`close` method, and it will invoke the *filelike* object's :meth:`close` method when called.
uk: Якщо *filelike* має метод :meth:`close`, повернутий об’єкт також матиме метод :meth:`close`, і під час виклику він викличе метод :meth:`close` об’єкта *filelike*.

source: Example usage::
uk: Приклад використання::

source: :mod:`wsgiref.headers` -- WSGI response header tools
uk: :mod:`wsgiref.headers` -- інструменти заголовків відповідей WSGI

source: This module provides a single class, :class:`Headers`, for convenient manipulation of WSGI response headers using a mapping-like interface.
uk: Цей модуль надає єдиний клас, :class:`Headers`, для зручного керування заголовками відповідей WSGI за допомогою інтерфейсу, схожого на відображення.

source: Create a mapping-like object wrapping *headers*, which must be a list of header name/value tuples as described in :pep:`3333`. The default value of *headers* is an empty list.
uk: Створіть *headers* об’єкт, схожий на відображення, який має бути списком кортежів імені/значення заголовка, як описано в :pep:`3333`. Типовим значенням *headers* є порожній список.

source: Unlike a dictionary, :class:`Headers` objects do not raise an error when you try to get or delete a key that isn't in the wrapped header list. Getting a nonexistent header just returns ``None``, and deleting a nonexistent header does nothing.
uk: На відміну від словника, об’єкти :class:`Headers` не викликають помилки, коли ви намагаєтеся отримати або видалити ключ, якого немає в списку заголовків. Отримання неіснуючого заголовка просто повертає ``None``, а видалення неіснуючого заголовка нічого не робить.

source: :class:`Headers` objects also support :meth:`keys`, :meth:`values`, and :meth:`items` methods. The lists returned by :meth:`keys` and :meth:`items` can include the same key more than once if there is a multi-valued header. The ``len()`` of a :class:`Headers` object is the same as the length of its :meth:`items`, which is the same as the length of the wrapped header list. In fact, the :meth:`items` method just returns a copy of the wrapped header list.
uk: Об’єкти :class:`Headers` також підтримують методи :meth:`keys`, :meth:`values` і :meth:`items`. Списки, які повертаються :meth:`keys` і :meth:`items`, можуть містити той самий ключ більше одного разу, якщо є багатозначний заголовок. ``len()`` об’єкта :class:`Headers` дорівнює довжині його :meth:`items`, що дорівнює довжині оберненого списку заголовків. Насправді метод :meth:`items` просто повертає копію загорнутого списку заголовків.

source: Calling ``bytes()`` on a :class:`Headers` object returns a formatted bytestring suitable for transmission as HTTP response headers. Each header is placed on a line with its value, separated by a colon and a space. Each line is terminated by a carriage return and line feed, and the bytestring is terminated with a blank line.
uk: Виклик ``bytes()`` для об’єкта :class:`Headers` повертає відформатований байтовий рядок, придатний для передачі як заголовки відповіді HTTP. Кожен заголовок розміщується в рядку зі своїм значенням, розділеним двокрапкою та пробілом. Кожен рядок закінчується символом повернення каретки та переводом рядка, а байтовий рядок завершується порожнім рядком.

source: In addition to their mapping interface and formatting features, :class:`Headers` objects also have the following methods for querying and adding multi-valued headers, and for adding headers with MIME parameters:
uk: Окрім інтерфейсу відображення та функцій форматування, об’єкти :class:`Headers` також мають такі методи для запитів і додавання багатозначних заголовків, а також для додавання заголовків із параметрами MIME:

source: Return a list of all the values for the named header.
uk: Повертає список усіх значень для названого заголовка.

source: The returned list will be sorted in the order they appeared in the original header list or were added to this instance, and may contain duplicates. Any fields deleted and re-inserted are always appended to the header list. If no fields exist with the given name, returns an empty list.
uk: Повернений список буде відсортовано в тому порядку, у якому вони з’явилися у вихідному списку заголовків або були додані до цього екземпляра, і може містити дублікати. Будь-які видалені та повторно вставлені поля завжди додаються до списку заголовків. Якщо немає полів із заданим іменем, повертає порожній список.

source: Add a (possibly multi-valued) header, with optional MIME parameters specified via keyword arguments.
uk: Додайте (можливо, багатозначний) заголовок із необов’язковими параметрами MIME, указаними через аргументи ключового слова.

source: *name* is the header field to add. Keyword arguments can be used to set MIME parameters for the header field. Each parameter must be a string or ``None``. Underscores in parameter names are converted to dashes, since dashes are illegal in Python identifiers, but many MIME parameter names include dashes. If the parameter value is a string, it is added to the header value parameters in the form ``name="value"``. If it is ``None``, only the parameter name is added. (This is used for MIME parameters without a value.) Example usage::
uk: *name* – поле заголовка, яке потрібно додати. Аргументи ключового слова можна використовувати для встановлення параметрів MIME для поля заголовка. Кожен параметр має бути рядком або ``None``. Підкреслення в назвах параметрів перетворюються на тире, оскільки тире заборонені в ідентифікаторах Python, але багато імен параметрів MIME містять тире. Якщо значення параметра є рядком, воно додається до параметрів значення заголовка у формі ``name="value"``. Якщо вибрано ``None``, додається лише назва параметра. (Це використовується для параметрів MIME без значення.) Приклад використання::

source: The above will add a header that looks like this::
uk: Наведене вище додасть заголовок, який виглядає так::

source: *headers* parameter is optional.
uk: Параметр *headers* необов’язковий.

source: :mod:`wsgiref.simple_server` -- a simple WSGI HTTP server
uk: :mod:`wsgiref.simple_server` -- простий HTTP-сервер WSGI

source: This module implements a simple HTTP server (based on :mod:`http.server`) that serves WSGI applications. Each server instance serves a single WSGI application on a given host and port. If you want to serve multiple applications on a single host and port, you should create a WSGI application that parses ``PATH_INFO`` to select which application to invoke for each request. (E.g., using the :func:`shift_path_info` function from :mod:`wsgiref.util`.)
uk: Цей модуль реалізує простий HTTP-сервер (на основі :mod:`http.server`), який обслуговує програми WSGI. Кожен екземпляр сервера обслуговує одну програму WSGI на заданому хості та порту. Якщо ви хочете обслуговувати кілька програм на одному хості та порту, вам слід створити програму WSGI, яка аналізує ``PATH_INFO``, щоб вибрати, яку програму викликати для кожного запиту. (Наприклад, за допомогою функції :func:`shift_path_info` з :mod:`wsgiref.util`.)

source: Create a new WSGI server listening on *host* and *port*, accepting connections for *app*. The return value is an instance of the supplied *server_class*, and will process requests using the specified *handler_class*. *app* must be a WSGI application object, as defined by :pep:`3333`.
uk: Створіть новий сервер WSGI, який прослуховує *хост* і *порт*, приймаючи з’єднання для *програми*. Повернене значення є екземпляром наданого *server_class* і оброблятиме запити, використовуючи вказаний *handler_class*. *app* має бути об’єктом програми WSGI, як визначено :pep:`3333`.

source: This function is a small but complete WSGI application that returns a text page containing the message "Hello world!" and a list of the key/value pairs provided in the *environ* parameter. It's useful for verifying that a WSGI server (such as :mod:`wsgiref.simple_server`) is able to run a simple WSGI application correctly.
uk: Ця функція є невеликою, але повною програмою WSGI, яка повертає текстову сторінку, що містить повідомлення "Hello world!" і список пар ключ/значення, наданий у параметрі *environ*. Це корисно для перевірки того, що сервер WSGI (наприклад, :mod:`wsgiref.simple_server`) здатний правильно запускати просту програму WSGI.

source: Create a :class:`WSGIServer` instance. *server_address* should be a ``(host,port)`` tuple, and *RequestHandlerClass* should be the subclass of :class:`http.server.BaseHTTPRequestHandler` that will be used to process requests.
uk: Створіть екземпляр :class:`WSGIServer`. *server_address* має бути кортежем ``(host,port)``, а *RequestHandlerClass* має бути підкласом :class:`http.server.BaseHTTPRequestHandler`, який використовуватиметься для обробки запитів.

source: You do not normally need to call this constructor, as the :func:`make_server` function can handle all the details for you.
uk: Зазвичай вам не потрібно викликати цей конструктор, оскільки функція :func:`make_server` може обробити всі деталі за вас.

source: :class:`WSGIServer` is a subclass of :class:`http.server.HTTPServer`, so all of its methods (such as :meth:`serve_forever` and :meth:`handle_request`) are available. :class:`WSGIServer` also provides these WSGI-specific methods:
uk: :class:`WSGIServer` є підкласом :class:`http.server.HTTPServer`, тому всі його методи (такі як :meth:`serve_forever` і :meth:`handle_request`) доступні. :class:`WSGIServer` також надає ці спеціальні методи WSGI:

source: Sets the callable *application* as the WSGI application that will receive requests.
uk: Встановлює викликану *програму* як програму WSGI, яка отримуватиме запити.

source: Normally, however, you do not need to use these additional methods, as :meth:`set_app` is normally called by :func:`make_server`, and the :meth:`get_app` exists mainly for the benefit of request handler instances.
uk: Однак зазвичай вам не потрібно використовувати ці додаткові методи, оскільки :meth:`set_app` зазвичай викликається :func:`make_server`, а :meth:`get_app` існує в основному для вигоди екземплярів обробника запитів.

source: Create an HTTP handler for the given *request* (i.e. a socket), *client_address* (a ``(host,port)`` tuple), and *server* (:class:`WSGIServer` instance).
uk: Створіть обробник HTTP для вказаного *запиту* (тобто сокета), *client_address* (кортежу ``(host,port)`` і *server* (:class:`WSGIServer` екземпляр).

source: You do not need to create instances of this class directly; they are automatically created as needed by :class:`WSGIServer` objects. You can, however, subclass this class and supply it as a *handler_class* to the :func:`make_server` function. Some possibly relevant methods for overriding in subclasses:
uk: Вам не потрібно створювати екземпляри цього класу безпосередньо; вони автоматично створюються за потреби об’єктами :class:`WSGIServer`. Однак ви можете створити підклас цього класу та надати його як *handler_class* для функції :func:`make_server`. Деякі можливі релевантні методи перевизначення в підкласах:

source: Return the object that should be used as the ``wsgi.errors`` stream. The default implementation just returns ``sys.stderr``.
uk: Повертає об’єкт, який слід використовувати як потік ``wsgi.errors``. Реалізація за замовчуванням просто повертає ``sys.stderr``.

source: Process the HTTP request. The default implementation creates a handler instance using a :mod:`wsgiref.handlers` class to implement the actual WSGI application interface.
uk: Обробити HTTP-запит. Стандартна реалізація створює екземпляр обробника за допомогою класу :mod:`wsgiref.handlers` для реалізації фактичного інтерфейсу програми WSGI.

source: :mod:`wsgiref.validate` --- WSGI conformance checker
uk: :mod:`wsgiref.validate` --- Перевірка відповідності WSGI

source: When creating new WSGI application objects, frameworks, servers, or middleware, it can be useful to validate the new code's conformance using :mod:`wsgiref.validate`. This module provides a function that creates WSGI application objects that validate communications between a WSGI server or gateway and a WSGI application object, to check both sides for protocol conformance.
uk: Під час створення нових об’єктів програми WSGI, фреймворків, серверів або проміжного програмного забезпечення може бути корисно перевірити відповідність нового коду за допомогою :mod:`wsgiref.validate`. Цей модуль забезпечує функцію, яка створює об’єкти програми WSGI, які перевіряють зв’язок між сервером або шлюзом WSGI та об’єктом програми WSGI, щоб перевірити обидві сторони на відповідність протоколу.

source: Note that this utility does not guarantee complete :pep:`3333` compliance; an absence of errors from this module does not necessarily mean that errors do not exist. However, if this module does produce an error, then it is virtually certain that either the server or application is not 100% compliant.
uk: Зауважте, що ця утиліта не гарантує повної відповідності :pep:`3333`; відсутність помилок у цьому модулі не обов'язково означає, що помилок немає. Однак, якщо цей модуль видає помилку, тоді можна з упевненістю сказати, що або сервер, або програма не відповідають вимогам на 100%.

source: This module is based on the :mod:`paste.lint` module from Ian Bicking's "Python Paste" library.
uk: Цей модуль базується на модулі :mod:`paste.lint` з бібліотеки "Python Paste" Яна Бікінга.

source: Wrap *application* and return a new WSGI application object. The returned application will forward all requests to the original *application*, and will check that both the *application* and the server invoking it are conforming to the WSGI specification and to :rfc:`2616`.
uk: Оберніть *програму* та поверніть новий об’єкт програми WSGI. Повернена програма перенаправлятиме всі запити до оригінальної *програми* та перевірятиме, чи *програма* та сервер, який її викликає, відповідають специфікації WSGI та :rfc:`2616`.

source: Any detected nonconformance results in an :exc:`AssertionError` being raised; note, however, that how these errors are handled is server-dependent. For example, :mod:`wsgiref.simple_server` and other servers based on :mod:`wsgiref.handlers` (that don't override the error handling methods to do something else) will simply output a message that an error has occurred, and dump the traceback to ``sys.stderr`` or some other error stream.
uk: Будь-яка виявлена невідповідність призводить до появи :exc:`AssertionError`; однак зауважте, що спосіб обробки цих помилок залежить від сервера. Наприклад, :mod:`wsgiref.simple_server` та інші сервери, засновані на :mod:`wsgiref.handlers` (які не перевизначають методи обробки помилок, щоб зробити щось інше) просто виведуть повідомлення про те, що сталася помилка, і скиньте трасування до ``sys.stderr`` або іншого потоку помилок.

source: This wrapper may also generate output using the :mod:`warnings` module to indicate behaviors that are questionable but which may not actually be prohibited by :pep:`3333`. Unless they are suppressed using Python command-line options or the :mod:`warnings` API, any such warnings will be written to ``sys.stderr`` (*not* ``wsgi.errors``, unless they happen to be the same object).
uk: Ця обгортка також може генерувати вихідні дані за допомогою модуля :mod:`warnings` для вказівки поведінки, яка є сумнівною, але яка насправді не може бути заборонена :pep:`3333`. Якщо їх не придушено за допомогою параметрів командного рядка Python або API :mod:`warnings`, будь-які такі попередження будуть записані в ``sys.stderr`` (*не* ``wsgi.errors``, якщо вони не стаються з бути тим самим об'єктом).

source: :mod:`wsgiref.handlers` -- server/gateway base classes
uk: :mod:`wsgiref.handlers` -- базові класи сервера/шлюзу
