Repository: python/python-docs-uk
Catalog: library/wsgiref.po
Languages: uk

source: This module provides base handler classes for implementing WSGI servers and gateways. These base classes handle most of the work of communicating with a WSGI application, as long as they are given a CGI-like environment, along with input, output, and error streams.
uk: Цей модуль надає базові класи обробки для реалізації серверів і шлюзів WSGI. Ці базові класи виконують більшу частину роботи зі спілкування з додатком WSGI, якщо їм надано середовище, подібне до CGI, а також потоки введення, виведення та помилок.

source: CGI-based invocation via ``sys.stdin``, ``sys.stdout``, ``sys.stderr`` and ``os.environ``. This is useful when you have a WSGI application and want to run it as a CGI script. Simply invoke ``CGIHandler().run(app)``, where ``app`` is the WSGI application object you wish to invoke.
uk: Виклик на основі CGI через ``sys.stdin``, ``sys.stdout``, ``sys.stderr`` і ``os.environ``. Це корисно, якщо у вас є програма WSGI і ви хочете запустити її як сценарій CGI. Просто викличте ``CGIHandler().run(app)``, де ``app`` це об’єкт програми WSGI, який ви хочете викликати.

source: This class is a subclass of :class:`BaseCGIHandler` that sets ``wsgi.run_once`` to true, ``wsgi.multithread`` to false, and ``wsgi.multiprocess`` to true, and always uses :mod:`sys` and :mod:`os` to obtain the necessary CGI streams and environment.
uk: Цей клас є підкласом :class:`BaseCGIHandler`, який встановлює ``wsgi.run_once`` значення true, ``wsgi.multithread`` значення false і ``wsgi.multiprocess`` значення true, і завжди використовує :mod:`sys` і :mod:`os` для отримання необхідних потоків CGI та середовища.

source: A specialized alternative to :class:`CGIHandler`, for use when deploying on Microsoft's IIS web server, without having set the config allowPathInfo option (IIS>=7) or metabase allowPathInfoForScriptMappings (IIS<7).
uk: Спеціалізована альтернатива :class:`CGIHandler` для використання під час розгортання на веб-сервері Microsoft IIS без встановлення опції allowPathInfo конфігурації (IIS>=7) або дозволу метабази allowPathInfoForScriptMappings (IIS<7).

source: By default, IIS gives a ``PATH_INFO`` that duplicates the ``SCRIPT_NAME`` at the front, causing problems for WSGI applications that wish to implement routing. This handler strips any such duplicated path.
uk: За замовчуванням IIS надає ``PATH_INFO``, який дублює ``SCRIPT_NAME`` спереду, що спричиняє проблеми для програм WSGI, які бажають реалізувати маршрутизацію. Цей обробник видаляє будь-який такий дубльований шлях.

source: IIS can be configured to pass the correct ``PATH_INFO``, but this causes another bug where ``PATH_TRANSLATED`` is wrong. Luckily this variable is rarely used and is not guaranteed by WSGI. On IIS<7, though, the setting can only be made on a vhost level, affecting all other script mappings, many of which break when exposed to the ``PATH_TRANSLATED`` bug. For this reason IIS<7 is almost never deployed with the fix (Even IIS7 rarely uses it because there is still no UI for it.).
uk: IIS можна налаштувати для передачі правильного ``PATH_INFO``, але це спричиняє ще одну помилку, коли ``PATH_TRANSLATED`` неправильний. На щастя, ця змінна рідко використовується і не гарантується WSGI. Однак у IIS<7 це налаштування можна зробити лише на рівні vhost, впливаючи на всі інші зіставлення сценаріїв, багато з яких ламаються, коли піддаються помилці ``PATH_TRANSLATED``. З цієї причини IIS<7 майже ніколи не розгортається з виправленням (навіть IIS7 рідко використовує його, оскільки для нього все ще немає інтерфейсу користувача).

source: There is no way for CGI code to tell whether the option was set, so a separate handler class is provided. It is used in the same way as :class:`CGIHandler`, i.e., by calling ``IISCGIHandler().run(app)``, where ``app`` is the WSGI application object you wish to invoke.
uk: Код CGI не може визначити, чи встановлено параметр, тому надається окремий клас обробника. Він використовується так само, як :class:`CGIHandler`, тобто шляхом виклику ``IISCGIHandler().run(app)``, де ``app`` є об'єктом програми WSGI, який ви хочете викликати.

source: Similar to :class:`CGIHandler`, but instead of using the :mod:`sys` and :mod:`os` modules, the CGI environment and I/O streams are specified explicitly. The *multithread* and *multiprocess* values are used to set the ``wsgi.multithread`` and ``wsgi.multiprocess`` flags for any applications run by the handler instance.
uk: Подібно до :class:`CGIHandler`, але замість використання модулів :mod:`sys` і :mod:`os` середовище CGI та потоки введення/виведення вказуються явно. Значення *multithread* і *multiprocess* використовуються для встановлення прапорів ``wsgi.multithread`` і ``wsgi.multiprocess`` для будь-яких програм, запущених екземпляром обробника.

source: This class is a subclass of :class:`SimpleHandler` intended for use with software other than HTTP "origin servers". If you are writing a gateway protocol implementation (such as CGI, FastCGI, SCGI, etc.) that uses a ``Status:`` header to send an HTTP status, you probably want to subclass this instead of :class:`SimpleHandler`.
uk: Цей клас є підкласом :class:`SimpleHandler`, призначеного для використання з програмним забезпеченням, відмінним від HTTP-серверів. Якщо ви пишете реалізацію протоколу шлюзу (наприклад, CGI, FastCGI, SCGI тощо), яка використовує заголовок ``Status:`` для надсилання статусу HTTP, можливо, ви захочете створити підклас цього замість :class:`SimpleHandler` .

source: Similar to :class:`BaseCGIHandler`, but designed for use with HTTP origin servers. If you are writing an HTTP server implementation, you will probably want to subclass this instead of :class:`BaseCGIHandler`.
uk: Подібний до :class:`BaseCGIHandler`, але призначений для використання з вихідними серверами HTTP. Якщо ви пишете реалізацію сервера HTTP, ви, ймовірно, захочете створити підклас цього замість :class:`BaseCGIHandler`.

source: The :meth:`~io.BufferedIOBase.write` method of *stdout* should write each chunk in full, like :class:`io.BufferedIOBase`.
uk: Метод :meth:`~io.BufferedIOBase.write` *stdout* має записувати кожен фрагмент повністю, як :class:`io.BufferedIOBase`.

source: This is an abstract base class for running WSGI applications. Each instance will handle a single HTTP request, although in principle you could create a subclass that was reusable for multiple requests.
uk: Це абстрактний базовий клас для запуску програм WSGI. Кожен екземпляр оброблятиме один HTTP-запит, хоча в принципі ви можете створити підклас, який можна повторно використовувати для кількох запитів.

source: :class:`BaseHandler` instances have only one method intended for external use:
uk: Екземпляри :class:`BaseHandler` мають лише один метод, призначений для зовнішнього використання:

source: Run the specified WSGI application, *app*.
uk: Запустіть вказану програму WSGI, *app*.

source: All of the other :class:`BaseHandler` methods are invoked by this method in the process of running the application, and thus exist primarily to allow customizing the process.
uk: Усі інші методи :class:`BaseHandler` викликаються цим методом у процесі запуску програми, і, отже, існують, перш за все, щоб дозволити налаштувати процес.

source: The following methods MUST be overridden in a subclass:
uk: Наступні методи ПОВИННІ бути замінені в підкласі:

source: Buffer the bytes *data* for transmission to the client. It's okay if this method actually transmits the data; :class:`BaseHandler` just separates write and flush operations for greater efficiency when the underlying system actually has such a distinction.
uk: Буферизуйте байти *data* для передачі клієнту. Це нормально, якщо цей метод дійсно передає дані; :class:`BaseHandler` просто розділяє операції запису та очищення для більшої ефективності, коли основна система насправді має таку відмінність.

source: Force buffered data to be transmitted to the client. It's okay if this method is a no-op (i.e., if :meth:`_write` actually sends the data).
uk: Примусова передача буферизованих даних клієнту. Це нормально, якщо цей метод є безопераційним (тобто якщо :meth:`_write` справді надсилає дані).

source: Insert CGI variables for the current request into the :attr:`environ` attribute.
uk: Вставте змінні CGI для поточного запиту в атрибут :attr:`environ`.

source: Here are some other methods and attributes you may wish to override. This list is only a summary, however, and does not include every method that can be overridden. You should consult the docstrings and source code for additional information before attempting to create a customized :class:`BaseHandler` subclass.
uk: Ось деякі інші методи та атрибути, які ви можете змінити. Однак цей список є лише підсумковим і не включає всі методи, які можна замінити. Перш ніж намагатися створити налаштований підклас :class:`BaseHandler`, вам слід переглянути рядки документації та вихідний код для отримання додаткової інформації.

source: Attributes and methods for customizing the WSGI environment:
uk: Атрибути та методи налаштування середовища WSGI:

source: The value to be used for the ``wsgi.multithread`` environment variable. It defaults to true in :class:`BaseHandler`, but may have a different default (or be set by the constructor) in the other subclasses.
uk: Значення, яке буде використовуватися для змінної середовища ``wsgi.multithread``. За замовчуванням у :class:`BaseHandler` він має значення true, але може мати інше значення за замовчуванням (або бути встановленим конструктором) в інших підкласах.

source: The value to be used for the ``wsgi.multiprocess`` environment variable. It defaults to true in :class:`BaseHandler`, but may have a different default (or be set by the constructor) in the other subclasses.
uk: Значення, яке буде використовуватися для змінної середовища ``wsgi.multiprocess``. За замовчуванням у :class:`BaseHandler` він має значення true, але може мати інше значення за замовчуванням (або бути встановленим конструктором) в інших підкласах.

source: The value to be used for the ``wsgi.run_once`` environment variable. It defaults to false in :class:`BaseHandler`, but :class:`CGIHandler` sets it to true by default.
uk: Значення, яке буде використовуватися для змінної середовища ``wsgi.run_once``. За замовчуванням у :class:`BaseHandler` встановлено значення false, але :class:`CGIHandler` за замовчуванням встановлює значення true.

source: The default environment variables to be included in every request's WSGI environment. By default, this is a copy of ``os.environ`` at the time that :mod:`wsgiref.handlers` was imported, but subclasses can either create their own at the class or instance level. Note that the dictionary should be considered read-only, since the default value is shared between multiple classes and instances.
uk: Змінні середовища за замовчуванням, які будуть включені в середовище WSGI кожного запиту. За замовчуванням це копія ``os.environ`` на момент імпорту :mod:`wsgiref.handlers`, але підкласи можуть створювати власні на рівні класу або екземпляра. Зауважте, що словник слід вважати доступним лише для читання, оскільки значення за замовчуванням використовується між кількома класами та примірниками.

source: If the :attr:`origin_server` attribute is set, this attribute's value is used to set the default ``SERVER_SOFTWARE`` WSGI environment variable, and also to set a default ``Server:`` header in HTTP responses. It is ignored for handlers (such as :class:`BaseCGIHandler` and :class:`CGIHandler`) that are not HTTP origin servers.
uk: Якщо встановлено атрибут :attr:`origin_server`, значення цього атрибута використовується для встановлення змінної середовища WSGI за замовчуванням ``SERVER_SOFTWARE``, а також для встановлення заголовка ``Server:`` за замовчуванням у відповідях HTTP. Він ігнорується для обробників (таких як :class:`BaseCGIHandler` і :class:`CGIHandler`), які не є вихідними серверами HTTP.

source: The term "Python" is replaced with implementation specific term like "CPython", "Jython" etc.
uk: Термін "Python" замінено терміном для конкретної реалізації, наприклад "CPython", "Jython" тощо.

source: Return the URL scheme being used for the current request. The default implementation uses the :func:`guess_scheme` function from :mod:`wsgiref.util` to guess whether the scheme should be "http" or "https", based on the current request's :attr:`environ` variables.
uk: Повертає схему URL-адреси, яка використовується для поточного запиту. Реалізація за замовчуванням використовує функцію :func:`guess_scheme` з :mod:`wsgiref.util`, щоб визначити, чи має бути схема "http" чи "https", на основі змінних :attr:`environ` поточного запиту.

source: Methods and attributes for customizing exception handling:
uk: Методи та атрибути для налаштування обробки винятків:

source: Log the *exc_info* tuple in the server log. *exc_info* is a ``(type, value, traceback)`` tuple. The default implementation simply writes the traceback to the request's ``wsgi.errors`` stream and flushes it. Subclasses can override this method to change the format or retarget the output, mail the traceback to an administrator, or whatever other action may be deemed suitable.
uk: Зареєструйте кортеж *exc_info* у журналі сервера. *exc_info* — це кортеж ``(тип, значення, відстеження)``. Реалізація за замовчуванням просто записує трасування в потік ``wsgi.errors`` запиту та очищає його. Підкласи можуть замінити цей метод, щоб змінити формат або перенацілити вивід, надіслати трасування поштою адміністратору або зробити будь-яку іншу дію, яку можна вважати прийнятною.

source: The maximum number of frames to include in tracebacks output by the default :meth:`log_exception` method. If ``None``, all frames are included.
uk: Максимальна кількість фреймів, які можна включити у вивід трасування методом :meth:`log_exception` за замовчуванням. Якщо ``None``, усі кадри включені.

source: This method is a WSGI application to generate an error page for the user. It is only invoked if an error occurs before headers are sent to the client.
uk: Цей метод є програмою WSGI для створення сторінки помилки для користувача. Він викликається, лише якщо виникає помилка до того, як заголовки будуть надіслані клієнту.

source: The default implementation just uses the :attr:`error_status`, :attr:`error_headers`, and :attr:`error_body` attributes to generate an output page. Subclasses can override this to produce more dynamic error output.
uk: Реалізація за замовчуванням просто використовує атрибути :attr:`error_status`, :attr:`error_headers` і :attr:`error_body` для створення сторінки виводу. Підкласи можуть замінити це, щоб створити більш динамічний вихід помилок.

source: Note, however, that it's not recommended from a security perspective to spit out diagnostics to any old user; ideally, you should have to do something special to enable diagnostic output, which is why the default implementation doesn't include any.
uk: Однак зауважте, що з точки зору безпеки не рекомендується передавати діагностику старим користувачам; в ідеалі, ви повинні зробити щось особливе, щоб увімкнути діагностичний вихід, тому реалізація за замовчуванням не включає жодного.

source: The HTTP status used for error responses. This should be a status string as defined in :pep:`3333`; it defaults to a 500 code and message.
uk: Статус HTTP, який використовується для відповідей на помилки. Це має бути рядок стану, як визначено в :pep:`3333`; за замовчуванням це код і повідомлення 500.

source: The HTTP headers used for error responses. This should be a list of WSGI response headers (``(name, value)`` tuples), as described in :pep:`3333`. The default list just sets the content type to ``text/plain``.
uk: Заголовки HTTP, які використовуються для відповідей на помилки. Це має бути список заголовків відповіді WSGI (кортежі ``(ім’я, значення)``), як описано в :pep:`3333`. Список за замовчуванням лише встановлює тип вмісту ``text/plain``.

source: The error response body. This should be an HTTP response body bytestring. It defaults to the plain text, "A server error occurred. Please contact the administrator."
uk: Тіло відповіді на помилку. Це має бути байтовий рядок тіла відповіді HTTP. За замовчуванням це простий текст: "Сталася помилка сервера. Зверніться до адміністратора".

source: Methods and attributes for :pep:`3333`'s "Optional Platform-Specific File Handling" feature:
uk: Методи та атрибути для функції :pep:`3333` "Додаткова обробка файлів на певній платформі":

source: Override to implement platform-specific file transmission. This method is called only if the application's return value is an instance of the class specified by the :attr:`wsgi_file_wrapper` attribute. It should return a true value if it was able to successfully transmit the file, so that the default transmission code will not be executed. The default implementation of this method just returns a false value.
uk: Перевизначення для реалізації передачі файлів на платформі. Цей метод викликається, лише якщо значення, яке повертає програма, є екземпляром класу, указаного атрибутом :attr:`wsgi_file_wrapper`. Він має повернути справжнє значення, якщо вдалося успішно передати файл, щоб код передачі за замовчуванням не виконувався. Стандартна реалізація цього методу просто повертає хибне значення.

source: Miscellaneous methods and attributes:
uk: Різні методи та атрибути:

source: This attribute should be set to a true value if the handler's :meth:`_write` and :meth:`_flush` are being used to communicate directly to the client, rather than via a CGI-like gateway protocol that wants the HTTP status in a special ``Status:`` header.
uk: Для цього атрибута слід встановити справжнє значення, якщо :meth:`_write` і :meth:`_flush` обробника використовуються для безпосереднього зв’язку з клієнтом, а не через CGI-подібний протокол шлюзу, якому потрібен статус HTTP у спеціальний заголовок ``Status:``.

source: This attribute's default value is true in :class:`BaseHandler`, but false in :class:`BaseCGIHandler` and :class:`CGIHandler`.
uk: Значення цього атрибута за замовчуванням є true у :class:`BaseHandler`, але false у :class:`BaseCGIHandler` і :class:`CGIHandler`.

source: If :attr:`origin_server` is true, this string attribute is used to set the HTTP version of the response set to the client. It defaults to ``"1.0"``.
uk: Якщо :attr:`origin_server` має значення true, цей рядковий атрибут використовується для встановлення HTTP-версії набору відповідей для клієнта. За замовчуванням ``"1.0"``.

source: Transcode CGI variables from ``os.environ`` to :pep:`3333` "bytes in unicode" strings, returning a new dictionary. This function is used by :class:`CGIHandler` and :class:`IISCGIHandler` in place of directly using ``os.environ``, which is not necessarily WSGI-compliant on all platforms and web servers using Python 3 -- specifically, ones where the OS's actual environment is Unicode (i.e. Windows), or ones where the environment is bytes, but the system encoding used by Python to decode it is anything other than ISO-8859-1 (e.g. Unix systems using UTF-8).
uk: Транскодує змінні CGI з ``os.environ`` в :pep:`3333` рядки "байтів у юнікоді", повертаючи новий словник. Ця функція використовується :class:`CGIHandler` і :class:`IISCGIHandler` замість безпосереднього використання ``os.environ``, який не обов’язково є сумісним з WSGI на всіх платформах і веб-серверах, які використовують Python 3, зокрема , де фактичне середовище ОС є Unicode (тобто Windows), або ті, де середовищем є байти, але системне кодування, яке використовує Python для його декодування, є будь-яким іншим, ніж ISO-8859-1 (наприклад, системи Unix використовують UTF-8) .

source: If you are implementing a CGI-based handler of your own, you probably want to use this routine instead of just copying values out of ``os.environ`` directly.
uk: Якщо ви впроваджуєте власний обробник на основі CGI, ви, ймовірно, захочете використовувати цю процедуру замість того, щоб просто копіювати значення безпосередньо з ``os.environ``.

source: Examples
uk: Приклади
