Repository: python/python-docs-uk
Catalog: library/xml.po
Languages: uk

source: XML Processing Modules
uk: Модулі обробки XML

source: **Source code:** :source:`Lib/xml/`
uk: **Вихідний код:** :source:`Lib/xml/`

source: Python's interfaces for processing XML are grouped in the ``xml`` package.
uk: Інтерфейси Python для обробки XML згруповані в пакеті ``xml``.

source: The XML modules are not secure against erroneous or maliciously constructed data. If you need to parse untrusted or unauthenticated data see the :ref:`xml-vulnerabilities` and :ref:`defusedxml-package` sections.
uk: Модулі XML не захищені від помилкових або зловмисно створених даних. Якщо вам потрібно проаналізувати ненадійні або неавтентифіковані дані, перегляньте розділи :ref:`xml-vulnerabilities` і :ref:`defusedxml-package`.

source: It is important to note that modules in the :mod:`xml` package require that there be at least one SAX-compliant XML parser available. The Expat parser is included with Python, so the :mod:`xml.parsers.expat` module will always be available.
uk: Важливо зазначити, що модулі в пакеті :mod:`xml` вимагають наявності принаймні одного XML-аналізатора, сумісного з SAX. Синтаксичний аналізатор Expat включено в Python, тому модуль :mod:`xml.parsers.expat` буде завжди доступним.

source: The documentation for the :mod:`xml.dom` and :mod:`xml.sax` packages are the definition of the Python bindings for the DOM and SAX interfaces.
uk: Документація для пакетів :mod:`xml.dom` і :mod:`xml.sax` містить визначення прив’язок Python для інтерфейсів DOM і SAX.

source: The XML handling submodules are:
uk: Субмодулі обробки XML:

source: :mod:`xml.etree.ElementTree`: the ElementTree API, a simple and lightweight XML processor
uk: :mod:`xml.etree.ElementTree`: API ElementTree, простий і легкий процесор XML

source: :mod:`xml.dom`: the DOM API definition
uk: :mod:`xml.dom`: визначення DOM API

source: :mod:`xml.dom.minidom`: a minimal DOM implementation
uk: :mod:`xml.dom.minidom`: мінімальна реалізація DOM

source: :mod:`xml.dom.pulldom`: support for building partial DOM trees
uk: :mod:`xml.dom.pulldom`: підтримка створення часткових дерев DOM

source: :mod:`xml.sax`: SAX2 base classes and convenience functions
uk: :mod:`xml.sax`: Базові класи SAX2 і зручні функції

source: :mod:`xml.parsers.expat`: the Expat parser binding
uk: :mod:`xml.parsers.expat`: прив’язка аналізатора Expat

source: XML vulnerabilities
uk: Уразливості XML

source: The XML processing modules are not secure against maliciously constructed data. An attacker can abuse XML features to carry out denial of service attacks, access local files, generate network connections to other machines, or circumvent firewalls.
uk: Модулі обробки XML не захищені від зловмисно створених даних. Зловмисник може зловживати функціями XML для здійснення атак на відмову в обслуговуванні, доступу до локальних файлів, створення мережевих підключень до інших машин або обходу брандмауерів.

source: The following table gives an overview of the known attacks and whether the various modules are vulnerable to them.
uk: У наведеній нижче таблиці наведено огляд відомих атак і вразливість різних модулів до них.

source: kind
uk: вид

source: sax
uk: саксофон

source: minidom
uk: мінідом

source: pulldom
uk: тяга

source: billion laughs
uk: мільярд сміху

source: **Vulnerable** (1)
uk: **Вразливий** (1)

source: quadratic blowup
uk: квадратичне роздуття

source: external entity expansion
uk: розширення зовнішньої сутності

source: Safe (5)
uk: Безпечний (5)

source: Safe (2)
uk: Безпечний (2)

source: Safe (3)
uk: Безпечний (3)

source: Safe (4)
uk: Безпечний (4)

source: `DTD`_ retrieval
uk: `DTD`_ пошук

source: Safe
uk: Сейф

source: decompression bomb
uk: декомпресійна бомба

source: **Vulnerable**
uk: **Вразливий**

source: :mod:`xml.dom.minidom` doesn't expand external entities and simply returns the unexpanded entity verbatim.
uk: :mod:`xml.dom.minidom` не розгортає зовнішні сутності, а просто повертає нерозгорнуту сутність дослівно.

source: Since Python 3.7.1, external general entities are no longer processed by default.
uk: Починаючи з Python 3.7.1, зовнішні загальні сутності більше не обробляються за замовчуванням.

source: billion laughs / exponential entity expansion
uk: мільярд сміхів / експоненціальне розширення сутності

source: The `Billion Laughs`_ attack -- also known as exponential entity expansion -- uses multiple levels of nested entities. Each entity refers to another entity several times, and the final entity definition contains a small string. The exponential expansion results in several gigabytes of text and consumes lots of memory and CPU time.
uk: Атака `Billion Laughs`_ — також відома як експоненціальне розширення об’єктів — використовує кілька рівнів вкладених об’єктів. Кожна сутність посилається на іншу сутність кілька разів, і остаточне визначення сутності містить невеликий рядок. Експоненціальне розширення призводить до кількох гігабайт тексту та споживає багато пам’яті та часу ЦП.

source: quadratic blowup entity expansion
uk: квадратичне розширення сутності

source: Entity declarations can contain more than just text for replacement. They can also point to external resources or local files. The XML parser accesses the resource and embeds the content into the XML document.
uk: Оголошення сутностей можуть містити більше, ніж просто текст для заміни. Вони також можуть вказувати на зовнішні ресурси або локальні файли. Синтаксичний аналізатор XML отримує доступ до ресурсу та вбудовує вміст у документ XML.

source: Some XML libraries like Python's :mod:`xml.dom.pulldom` retrieve document type definitions from remote or local locations. The feature has similar implications as the external entity expansion issue.
uk: Деякі бібліотеки XML, такі як :mod:`xml.dom.pulldom` Python, отримують визначення типів документів із віддалених або локальних місць. Ця функція має такі ж наслідки, як і проблема розширення зовнішнього об’єкта.

source: Decompression bombs (aka `ZIP bomb`_) apply to all XML libraries that can parse compressed XML streams such as gzipped HTTP streams or LZMA-compressed files. For an attacker it can reduce the amount of transmitted data by three magnitudes or more.
uk: Бомби декомпресії (також відомі як `ZIP-бомба`_) застосовуються до всіх бібліотек XML, які можуть аналізувати стислі потоки XML, такі як потоки HTTP, стиснуті gzip, або файли, стиснуті за допомогою LZMA. Для зловмисника це може зменшити обсяг переданих даних на три або більше величин.
