Repository: python/python-docs-uk
Catalog: library/xml_sax_reader.po
Languages: uk

source: :mod:`xml.sax.xmlreader` --- Interface for XML parsers
uk: :mod:`xml.sax.xmlreader` --- Інтерфейс для парсерів XML

source: **Source code:** :source:`Lib/xml/sax/xmlreader.py`
uk: **Вихідний код:** :source:`Lib/xml/sax/xmlreader.py`

source: SAX parsers implement the :class:`XMLReader` interface. They are implemented in a Python module, which must provide a function :func:`create_parser`. This function is invoked by :func:`xml.sax.make_parser` with no arguments to create a new parser object.
uk: Парсери SAX реалізують інтерфейс :class:`XMLReader`. Вони реалізовані в модулі Python, який повинен надавати функцію :func:`create_parser`. Ця функція викликається :func:`xml.sax.make_parser` без аргументів для створення нового об’єкта аналізатора.

source: Base class which can be inherited by SAX parsers.
uk: Базовий клас, який може бути успадкований аналізаторами SAX.

source: In some cases, it is desirable not to parse an input source at once, but to feed chunks of the document as they get available. Note that the reader will normally not read the entire file, but read it in chunks as well; still :meth:`parse` won't return until the entire document is processed. So these interfaces should be used if the blocking behaviour of :meth:`parse` is not desirable.
uk: У деяких випадках бажано не аналізувати джерело введення відразу, а подавати фрагменти документа, коли вони стають доступними. Зауважте, що читач зазвичай читатиме не весь файл, а також його частини; все одно :meth:`parse` не повернеться, доки не буде оброблено весь документ. Тому ці інтерфейси слід використовувати, якщо блокуюча поведінка :meth:`parse` є небажаною.

source: When the parser is instantiated it is ready to begin accepting data from the feed method immediately. After parsing has been finished with a call to close the reset method must be called to make the parser ready to accept new data, either from feed or using the parse method.
uk: Коли аналізатор створено, він готовий негайно почати приймати дані з методу каналу. Після завершення синтаксичного аналізу з викликом для закриття потрібно викликати метод reset, щоб зробити аналізатор готовим приймати нові дані, або з каналу, або за допомогою методу аналізу.

source: Note that these methods must *not* be called during parsing, that is, after parse has been called and before it returns.
uk: Зауважте, що ці методи *не* можна викликати під час синтаксичного аналізу, тобто після виклику аналізу та до його повернення.

source: By default, the class also implements the parse method of the XMLReader interface using the feed, close and reset methods of the IncrementalParser interface as a convenience to SAX 2.0 driver writers.
uk: За замовчуванням клас також реалізує метод синтаксичного аналізу інтерфейсу XMLReader за допомогою методів feed, close і reset інтерфейсу IncrementalParser для зручності авторів драйверів SAX 2.0.

source: Interface for associating a SAX event with a document location. A locator object will return valid results only during calls to DocumentHandler methods; at any other time, the results are unpredictable. If information is not available, methods may return ``None``.
uk: Інтерфейс для зв’язування події SAX із розташуванням документа. Об’єкт локатора поверне дійсні результати лише під час викликів методів DocumentHandler; в будь-який інший час результати непередбачувані. Якщо інформація недоступна, методи можуть повернути ``None``.

source: Encapsulation of the information needed by the :class:`XMLReader` to read entities.
uk: Інкапсуляція інформації, необхідної :class:`XMLReader` для читання сутностей.

source: This class may include information about the public identifier, system identifier, byte stream (possibly with character encoding information) and/or the character stream of an entity.
uk: Цей клас може містити інформацію про загальнодоступний ідентифікатор, ідентифікатор системи, потік байтів (можливо, з інформацією про кодування символів) та/або потік символів сутності.

source: Applications will create objects of this class for use in the :meth:`XMLReader.parse` method and for returning from EntityResolver.resolveEntity.
uk: Програми створюватимуть об’єкти цього класу для використання в методі :meth:`XMLReader.parse` і для повернення з EntityResolver.resolveEntity.

source: An :class:`InputSource` belongs to the application, the :class:`XMLReader` is not allowed to modify :class:`InputSource` objects passed to it from the application, although it may make copies and modify those.
uk: :class:`InputSource` належить програмі, :class:`XMLReader` не дозволяється змінювати об’єкти :class:`InputSource`, передані йому з програми, хоча він може робити копії та змінювати їх.

source: This is an implementation of the :class:`Attributes` interface (see section :ref:`attributes-objects`). This is a dictionary-like object which represents the element attributes in a :meth:`startElement` call. In addition to the most useful dictionary operations, it supports a number of other methods as described by the interface. Objects of this class should be instantiated by readers; *attrs* must be a dictionary-like object containing a mapping from attribute names to attribute values.
uk: Це реалізація інтерфейсу :class:`Attributes` (див. розділ :ref:`attributes-objects`). Це об’єкт, схожий на словник, який представляє атрибути елемента у виклику :meth:`startElement`. Окрім найкорисніших операцій зі словником, він підтримує низку інших методів, як описано в інтерфейсі. Об'єкти цього класу повинні створюватися читачами; *attrs* має бути об’єктом, подібним до словника, який містить відображення імен атрибутів у значення атрибутів.

source: Namespace-aware variant of :class:`AttributesImpl`, which will be passed to :meth:`startElementNS`. It is derived from :class:`AttributesImpl`, but understands attribute names as two-tuples of *namespaceURI* and *localname*. In addition, it provides a number of methods expecting qualified names as they appear in the original document. This class implements the :class:`AttributesNS` interface (see section :ref:`attributes-ns-objects`).
uk: Варіант :class:`AttributesImpl` з урахуванням простору імен, який буде передано в :meth:`startElementNS`. Він походить від :class:`AttributesImpl`, але розуміє імена атрибутів як два кортежі *namespaceURI* і *localname*. Крім того, він надає низку методів очікування кваліфікованих імен, як вони з’являються в оригінальному документі. Цей клас реалізує інтерфейс :class:`AttributesNS` (див. розділ :ref:`attributes-ns-objects`).

source: XMLReader Objects
uk: Об’єкти XMLReader

source: The :class:`XMLReader` interface supports the following methods:
uk: Інтерфейс :class:`XMLReader` підтримує такі методи:

source: Process an input source, producing SAX events. The *source* object can be a system identifier (a string identifying the input source -- typically a file name or a URL), a :class:`pathlib.Path` or :term:`path-like <path-like object>` object, or an :class:`InputSource` object. When :meth:`parse` returns, the input is completely processed, and the parser object can be discarded or reset.
uk: Обробляти джерело вхідних даних, створюючи події SAX. Об’єкт *джерело* може бути системним ідентифікатором (рядок, що ідентифікує джерело вхідних даних – зазвичай це ім’я файлу або URL-адреса), об’єктом :class:`pathlib.Path` або :term:`path-like <path-like object>` або об’єкт :class:`InputSource`. Коли :meth:`parse` повертається, введення повністю оброблено, а об’єкт парсера можна відкинути або скинути.

source: Added support of character streams.
uk: Додано підтримку потоків символів.

source: Added support of path-like objects.
uk: Додано підтримку шляхоподібних об'єктів.

source: Return the current :class:`~xml.sax.handler.ContentHandler`.
uk: Повертає поточний :class:`~xml.sax.handler.ContentHandler`.

source: Set the current :class:`~xml.sax.handler.ContentHandler`. If no :class:`~xml.sax.handler.ContentHandler` is set, content events will be discarded.
uk: Установіть поточний :class:`~xml.sax.handler.ContentHandler`. Якщо :class:`~xml.sax.handler.ContentHandler` не встановлено, події вмісту буде відхилено.

source: Return the current :class:`~xml.sax.handler.DTDHandler`.
uk: Повертає поточний :class:`~xml.sax.handler.DTDHandler`.

source: Set the current :class:`~xml.sax.handler.DTDHandler`. If no :class:`~xml.sax.handler.DTDHandler` is set, DTD events will be discarded.
uk: Установіть поточний :class:`~xml.sax.handler.DTDHandler`. Якщо :class:`~xml.sax.handler.DTDHandler` не встановлено, події DTD будуть відхилені.

source: Return the current :class:`~xml.sax.handler.EntityResolver`.
uk: Повертає поточний :class:`~xml.sax.handler.EntityResolver`.

source: Set the current :class:`~xml.sax.handler.EntityResolver`. If no :class:`~xml.sax.handler.EntityResolver` is set, attempts to resolve an external entity will result in opening the system identifier for the entity, and fail if it is not available.
uk: Установіть поточний :class:`~xml.sax.handler.EntityResolver`. Якщо :class:`~xml.sax.handler.EntityResolver` не встановлено, спроби розпізнати зовнішню сутність призведуть до відкриття системного ідентифікатора для цієї сутності та завершаться помилкою, якщо він недоступний.

source: Return the current :class:`~xml.sax.handler.ErrorHandler`.
uk: Повертає поточний :class:`~xml.sax.handler.ErrorHandler`.

source: Set the current error handler. If no :class:`~xml.sax.handler.ErrorHandler` is set, errors will be raised as exceptions, and warnings will be printed.
uk: Встановити поточний обробник помилок. Якщо :class:`~xml.sax.handler.ErrorHandler` не встановлено, помилки будуть викликані як винятки, а попередження будуть надруковані.

source: Allow an application to set the locale for errors and warnings.
uk: Дозволити програмі встановлювати мову для помилок і попереджень.

source: SAX parsers are not required to provide localization for errors and warnings; if they cannot support the requested locale, however, they must raise a SAX exception. Applications may request a locale change in the middle of a parse.
uk: Синтаксичним аналізаторам SAX не потрібно забезпечувати локалізацію помилок і попереджень; однак, якщо вони не можуть підтримувати запитану локаль, вони повинні викликати виняток SAX. Програми можуть запитувати зміну локалі в середині аналізу.

source: Return the current setting for feature *featurename*. If the feature is not recognized, :exc:`SAXNotRecognizedException` is raised. The well-known featurenames are listed in the module :mod:`xml.sax.handler`.
uk: Повернути поточне налаштування для функції *назва функції*. Якщо функція не розпізнається, виникає :exc:`SAXNotRecognizedException`. Добре відомі назви функцій перераховані в модулі :mod:`xml.sax.handler`.

source: Set the *featurename* to *value*. If the feature is not recognized, :exc:`SAXNotRecognizedException` is raised. If the feature or its setting is not supported by the parser, *SAXNotSupportedException* is raised.
uk: Встановіть *назва функції* на *значення*. Якщо функція не розпізнається, виникає :exc:`SAXNotRecognizedException`. Якщо функція або її параметри не підтримуються аналізатором, виникає *SAXNotSupportedException*.

source: Return the current setting for property *propertyname*. If the property is not recognized, a :exc:`SAXNotRecognizedException` is raised. The well-known propertynames are listed in the module :mod:`xml.sax.handler`.
uk: Повернути поточне налаштування властивості *propertyname*. Якщо властивість не розпізнається, виникає :exc:`SAXNotRecognizedException`. Добре відомі назви властивостей перераховані в модулі :mod:`xml.sax.handler`.

source: Set the *propertyname* to *value*. If the property is not recognized, :exc:`SAXNotRecognizedException` is raised. If the property or its setting is not supported by the parser, *SAXNotSupportedException* is raised.
uk: Установіть *propertyname* на *value*. Якщо властивість не розпізнається, виникає :exc:`SAXNotRecognizedException`. Якщо властивість або її налаштування не підтримується аналізатором, виникає *SAXNotSupportedException*.

source: IncrementalParser Objects
uk: Інкрементальний аналізатор об’єктів

source: Instances of :class:`IncrementalParser` offer the following additional methods:
uk: Екземпляри :class:`IncrementalParser` пропонують такі додаткові методи:

source: Process a chunk of *data*.
uk: Обробити фрагмент *даних*.

source: Assume the end of the document. That will check well-formedness conditions that can be checked only at the end, invoke handlers, and may clean up resources allocated during parsing.
uk: Припустимо кінець документа. Це перевірить правильно сформовані умови, які можна перевірити лише в кінці, викличе обробники та може очистити ресурси, виділені під час аналізу.

source: This method is called after close has been called to reset the parser so that it is ready to parse new documents. The results of calling parse or feed after close without calling reset are undefined.
uk: Цей метод викликається після виклику close, щоб скинути синтаксичний аналізатор, щоб він був готовий аналізувати нові документи. Результати виклику parse або feed після закриття без виклику reset не визначені.

source: Locator Objects
uk: Локатор об'єктів

source: Instances of :class:`Locator` provide these methods:
uk: Екземпляри :class:`Locator` надають ці методи:

source: Return the column number where the current event begins.
uk: Повертає номер стовпця, де починається поточна подія.

source: Return the line number where the current event begins.
uk: Повертає номер рядка, де починається поточна подія.

source: Return the public identifier for the current event.
uk: Повернути публічний ідентифікатор для поточної події.

source: Return the system identifier for the current event.
uk: Повертає ідентифікатор системи для поточної події.

source: InputSource Objects
uk: Об’єкти InputSource

source: Sets the public identifier of this :class:`InputSource`.
uk: Встановлює публічний ідентифікатор цього :class:`InputSource`.

source: Returns the public identifier of this :class:`InputSource`.
uk: Повертає публічний ідентифікатор цього :class:`InputSource`.

source: Sets the system identifier of this :class:`InputSource`.
uk: Встановлює системний ідентифікатор цього :class:`InputSource`.

source: Returns the system identifier of this :class:`InputSource`.
uk: Повертає системний ідентифікатор цього :class:`InputSource`.

source: Sets the character encoding of this :class:`InputSource`.
uk: Встановлює кодування символів цього :class:`InputSource`.

source: The encoding must be a string acceptable for an XML encoding declaration (see section 4.3.3 of the XML recommendation).
uk: Кодування має бути рядком, прийнятним для декларації кодування XML (див. розділ 4.3.3 рекомендації XML).

source: The encoding attribute of the :class:`InputSource` is ignored if the :class:`InputSource` also contains a character stream.
uk: Атрибут кодування :class:`InputSource` ігнорується, якщо :class:`InputSource` також містить потік символів.

source: Get the character encoding of this InputSource.
uk: Отримайте кодування символів цього InputSource.

source: Set the byte stream (a :term:`binary file`) for this input source.
uk: Установіть потік байтів (:term:`binary file`) для цього джерела вхідних даних.

source: The SAX parser will ignore this if there is also a character stream specified, but it will use a byte stream in preference to opening a URI connection itself.
uk: Синтаксичний аналізатор SAX ігноруватиме це, якщо також буде вказано потік символів, але він використовуватиме потік байтів замість відкриття самого URI-з’єднання.

source: If the application knows the character encoding of the byte stream, it should set it with the setEncoding method.
uk: Якщо програма знає кодування символів потоку байтів, вона повинна встановити її за допомогою методу setEncoding.

source: Get the byte stream for this input source.
uk: Отримайте потік байтів для цього джерела вхідних даних.

source: The getEncoding method will return the character encoding for this byte stream, or ``None`` if unknown.
uk: Метод getEncoding поверне кодування символів для цього потоку байтів або ``None``, якщо невідомо.

source: Set the character stream (a :term:`text file`) for this input source.
uk: Установіть потік символів (:term:`text file`) для цього джерела введення.

source: If there is a character stream specified, the SAX parser will ignore any byte stream and will not attempt to open a URI connection to the system identifier.
uk: Якщо вказано потік символів, аналізатор SAX ігноруватиме будь-який потік байтів і не намагатиметься відкрити з’єднання URI із системним ідентифікатором.

source: Get the character stream for this input source.
uk: Отримайте потік символів для цього джерела введення.

source: The :class:`Attributes` Interface
uk: Інтерфейс :class:`Attributes`

source: :class:`Attributes` objects implement a portion of the :term:`mapping protocol <mapping>`, including the methods :meth:`~collections.abc.Mapping.copy`, :meth:`~collections.abc.Mapping.get`, :meth:`~object.__contains__`, :meth:`~collections.abc.Mapping.items`, :meth:`~collections.abc.Mapping.keys`, and :meth:`~collections.abc.Mapping.values`. The following methods are also provided:
uk: Об’єкти :class:`Attributes` реалізують частину :term:`протоколу відображення <mapping>`, включаючи методи :meth:`~collections.abc.Mapping.copy`, :meth:`~collections.abc.Mapping.get`, :meth:`~object.__contains__`, :meth:`~collections.abc.Mapping.items`, :meth:`~collections.abc.Mapping.keys` і :meth:`~collections.abc. Mapping.values`. Також передбачені такі методи:

source: Return the number of attributes.
uk: Повертає кількість атрибутів.

source: Return the names of the attributes.
uk: Повернути назви атрибутів.

source: Returns the type of the attribute *name*, which is normally ``'CDATA'``.
uk: Повертає тип атрибута *name*, який зазвичай є ``'CDATA'``.

source: Return the value of attribute *name*.
uk: Повертає значення атрибута *name*.

source: The :class:`AttributesNS` Interface
uk: Інтерфейс :class:`AttributesNS`

source: This interface is a subtype of the :class:`Attributes` interface (see section :ref:`attributes-objects`). All methods supported by that interface are also available on :class:`AttributesNS` objects.
uk: Цей інтерфейс є підтипом інтерфейсу :class:`Attributes` (див. розділ :ref:`attributes-objects`). Усі методи, які підтримує цей інтерфейс, також доступні в об’єктах :class:`AttributesNS`.

source: The following methods are also available:
uk: Також доступні такі методи:

source: Return the value for a qualified name.
uk: Повертає значення для кваліфікованого імені.

source: Return the ``(namespace, localname)`` pair for a qualified *name*.
uk: Повертає пару ``(простір імен, локальне ім’я)`` для кваліфікованого *назви*.

source: Return the qualified name for a ``(namespace, localname)`` pair.
uk: Повертає кваліфіковане ім’я для пари ``(простір імен, локальне ім’я)``.

source: Return the qualified names of all attributes.
uk: Повертає кваліфіковані імена всіх атрибутів.
