Repository: python/python-docs-uk
Catalog: library/xml_dom_pulldom.po
Languages: uk

source: **Source code:** :source:`Lib/xml/dom/pulldom.py`
uk: **Вихідний код:** :source:`Lib/xml/dom/pulldom.py`

source: The :mod:`xml.dom.pulldom` module provides a "pull parser" which can also be asked to produce DOM-accessible fragments of the document where necessary. The basic concept involves pulling "events" from a stream of incoming XML and processing them. In contrast to SAX which also employs an event-driven processing model together with callbacks, the user of a pull parser is responsible for explicitly pulling events from the stream, looping over those events until either processing is finished or an error condition occurs.
uk: Модуль :mod:`xml.dom.pulldom` забезпечує "аналізатор витягування", який також може бути запрошений створити доступні для DOM фрагменти документа, де це необхідно. Основна концепція передбачає вилучення "подій" із потоку вхідного XML та їх обробку. На відміну від SAX, який також використовує керовану подіями модель обробки разом із зворотними викликами, користувач аналізатора вилучення відповідає за явне отримання подій із потоку, циклюючи ці події, доки обробка не завершиться або не виникне помилка.

source: The :mod:`xml.dom.pulldom` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
uk: Модуль :mod:`xml.dom.pulldom` не захищений від зловмисно створених даних. Якщо вам потрібно проаналізувати ненадійні або неавтентифіковані дані, перегляньте :ref:`xml-vulnerabilities`.

source: The SAX parser no longer processes general external entities by default to increase security by default. To enable processing of external entities, pass a custom parser instance in::
uk: Синтаксичний аналізатор SAX більше не обробляє загальні зовнішні сутності за замовчуванням, щоб підвищити рівень безпеки за замовчуванням. Щоб увімкнути обробку зовнішніх об’єктів, передайте настроюваний екземпляр аналізатора в::

source: Example::
uk: Приклад::

source: ``event`` is a constant and can be one of:
uk: ``подія`` є константою і може бути одним із:

source: :data:`PROCESSING_INSTRUCTION`
uk: :data:`INSTRUCTION_PROCESSING_INSTRUCTION`

source: ``node`` is an object of type :class:`xml.dom.minidom.Document`, :class:`xml.dom.minidom.Element` or :class:`xml.dom.minidom.Text`.
uk: ``вузол`` є об’єктом типу :class:`xml.dom.minidom.Document`, :class:`xml.dom.minidom.Element` або :class:`xml.dom.minidom.Text`.

source: Since the document is treated as a "flat" stream of events, the document "tree" is implicitly traversed and the desired elements are found regardless of their depth in the tree. In other words, one does not need to consider hierarchical issues such as recursive searching of the document nodes, although if the context of elements were important, one would either need to maintain some context-related state (i.e. remembering where one is in the document at any given point) or to make use of the :func:`DOMEventStream.expandNode` method and switch to DOM-related processing.
uk: Оскільки документ розглядається як "плоский" потік подій, "дерево" документа обходиться неявно, і потрібні елементи знаходять незалежно від їх глибини в дереві. Іншими словами, не потрібно розглядати ієрархічні проблеми, такі як рекурсивний пошук вузлів документа, хоча, якби контекст елементів був важливим, потрібно було б підтримувати певний контекстно-пов’язаний стан (тобто запам’ятовувати, де ви знаходитесь у документі) у будь-який момент) або використати метод :func:`DOMEventStream.expandNode` і перейти до обробки, пов’язаної з DOM.

source: Subclass of :class:`xml.sax.handler.ContentHandler`.
uk: Підклас :class:`xml.sax.handler.ContentHandler`.

source: Return a :class:`DOMEventStream` from the given input. *stream_or_string* may be either a file name, or a file-like object. *parser*, if given, must be an :class:`~xml.sax.xmlreader.XMLReader` object. This function will change the document handler of the parser and activate namespace support; other parser configuration (like setting an entity resolver) must have been done in advance.
uk: Повертає :class:`DOMEventStream` із заданого введення. *stream_or_string* може бути ім’ям файлу або файлоподібним об’єктом. *parser*, якщо задано, має бути об’єктом :class:`~xml.sax.xmlreader.XMLReader`. Ця функція змінить обробник документів аналізатора та активує підтримку простору імен; іншу конфігурацію синтаксичного аналізатора (наприклад, налаштування розв’язувача сутностей) потрібно було виконати заздалегідь.

source: If you have XML in a string, you can use the :func:`parseString` function instead:
uk: Якщо у вас є XML у рядку, ви можете використовувати замість нього функцію :func:`parseString`:

source: Return a :class:`DOMEventStream` that represents the (Unicode) *string*.
uk: Повертає :class:`DOMEventStream`, який представляє *рядок* (Unicode).

source: Default value for the *bufsize* parameter to :func:`parse`.
uk: Значення за замовчуванням для параметра *bufsize* — :func:`parse`.

source: The value of this variable can be changed before calling :func:`parse` and the new value will take effect.
uk: Значення цієї змінної можна змінити перед викликом :func:`parse`, і нове значення набуде чинності.

source: DOMEventStream Objects
uk: Об’єкти DOMEventStream

source: Return a tuple containing *event* and the current *node* as :class:`xml.dom.minidom.Document` if event equals :data:`START_DOCUMENT`, :class:`xml.dom.minidom.Element` if event equals :data:`START_ELEMENT` or :data:`END_ELEMENT` or :class:`xml.dom.minidom.Text` if event equals :data:`CHARACTERS`. The current node does not contain information about its children, unless :func:`expandNode` is called.
uk: Повертає кортеж, що містить *подію* та поточний *вузол* як :class:`xml.dom.minidom.Document`, якщо подія дорівнює :data:`START_DOCUMENT`, :class:`xml.dom.minidom.Element`, якщо подія дорівнює :data:`START_ELEMENT` або :data:`END_ELEMENT` або :class:`xml.dom.minidom.Text`, якщо подія дорівнює :data:`CHARACTERS`. Поточний вузол не містить інформації про своїх дочірніх вузлів, якщо не викликати :func:`expandNode`.

source: Expands all children of *node* into *node*. Example::
uk: Розгортає всі дочірні елементи *node* у *node*. Приклад::
