Repository: python/python-docs-uk
Catalog: library/xml_sax_utils.po
Languages: uk

source: **Source code:** :source:`Lib/xml/sax/saxutils.py`
uk: **Вихідний код:** :source:`Lib/xml/sax/saxutils.py`

source: The module :mod:`xml.sax.saxutils` contains a number of classes and functions that are commonly useful when creating SAX applications, either in direct use, or as base classes.
uk: Модуль :mod:`xml.sax.saxutils` містить низку класів і функцій, які зазвичай корисні під час створення програм SAX, або для прямого використання, або як базові класи.

source: Escape ``'&'``, ``'<'``, and ``'>'`` in a string of data.
uk: Escape ``'&''``, ``' <'``, and ``'> ''`` у рядку даних.

source: You can escape other strings of data by passing a dictionary as the optional *entities* parameter. The keys and values must all be strings; each key will be replaced with its corresponding value. The characters ``'&'``, ``'<'`` and ``'>'`` are always escaped, even if *entities* is provided.
uk: Ви можете уникнути інших рядків даних, передавши словник як необов’язковий параметр *entities*. Усі ключі та значення мають бути рядками; кожен ключ буде замінено відповідним значенням. Символи ``'&'``, ``' <'`` and ``'> ''`` завжди екрануються, навіть якщо вказано *entities*.

source: Unescape ``'&amp;'``, ``'&lt;'``, and ``'&gt;'`` in a string of data.
uk: Скасуйте екранування ``'&amp;''``, ``'&lt;''`` і ``'&gt;''`` у рядку даних.

source: You can unescape other strings of data by passing a dictionary as the optional *entities* parameter. The keys and values must all be strings; each key will be replaced with its corresponding value. ``'&amp'``, ``'&lt;'``, and ``'&gt;'`` are always unescaped, even if *entities* is provided.
uk: Ви можете скасувати екранування інших рядків даних, передавши словник як необов’язковий параметр *entities*. Усі ключі та значення мають бути рядками; кожен ключ буде замінено відповідним значенням. ``'&amp'``, ``'&lt;'`` і ``'&gt;''`` завжди не екрануються, навіть якщо надано *entities*.

source: Similar to :func:`escape`, but also prepares *data* to be used as an attribute value. The return value is a quoted version of *data* with any additional required replacements. :func:`quoteattr` will select a quote character based on the content of *data*, attempting to avoid encoding any quote characters in the string. If both single- and double-quote characters are already in *data*, the double-quote characters will be encoded and *data* will be wrapped in double-quotes. The resulting string can be used directly as an attribute value::
uk: Подібно до :func:`escape`, але також готує *data* для використання як значення атрибута. Повернене значення — це версія *data* у лапках із будь-якими додатковими необхідними замінами. :func:`quoteattr` вибере символ лапок на основі вмісту *data*, намагаючись уникнути кодування будь-яких символів лапок у рядку. Якщо в *data* вже є символи одинарних і подвійних лапок, символи подвійних лапок буде закодовано, а *data* буде взято в подвійні лапки. Отриманий рядок можна використовувати безпосередньо як значення атрибута::

source: This function is useful when generating attribute values for HTML or any SGML using the reference concrete syntax.
uk: Ця функція корисна під час генерування значень атрибутів для HTML або будь-якого SGML за допомогою еталонного конкретного синтаксису.

source: This class implements the :class:`~xml.sax.handler.ContentHandler` interface by writing SAX events back into an XML document. In other words, using an :class:`XMLGenerator` as the content handler will reproduce the original document being parsed. *out* should be a file-like object which will default to *sys.stdout*. *encoding* is the encoding of the output stream which defaults to ``'iso-8859-1'``. *short_empty_elements* controls the formatting of elements that contain no content: if ``False`` (the default) they are emitted as a pair of start/end tags, if set to ``True`` they are emitted as a single self-closed tag.
uk: Цей клас реалізує інтерфейс :class:`~xml.sax.handler.ContentHandler`, записуючи події SAX назад у документ XML. Іншими словами, використання :class:`XMLGenerator` як обробника вмісту відтворить вихідний документ, що аналізується. *out* має бути файлоподібним об’єктом, який за умовчанням матиме *sys.stdout*. *кодування* — це кодування вихідного потоку, яке за умовчанням має значення ``'iso-8859-1'``. *short_empty_elements* контролює форматування елементів, які не містять вмісту: якщо ``False`` (за замовчуванням), вони випромінюються як пара початкових/кінцевих тегів, якщо встановлено ``True``, вони випромінюються як один сам - закритий тег.

source: This class is designed to sit between an :class:`~xml.sax.xmlreader.XMLReader` and the client application's event handlers. By default, it does nothing but pass requests up to the reader and events on to the handlers unmodified, but subclasses can override specific methods to modify the event stream or the configuration requests as they pass through.
uk: Цей клас призначений для розташування між :class:`~xml.sax.xmlreader.XMLReader` і обробниками подій клієнтської програми. За замовчуванням він не робить нічого, крім передачі запитів до читача та подій до обробників без змін, але підкласи можуть перевизначати певні методи для зміни потоку подій або запитів конфігурації під час їх проходження.
