Repository: python/python-docs-uk
Catalog: library/zipapp.po
Languages: uk

source: If your application depends on a package that includes a C extension, that package cannot be run from a zip file (this is an OS limitation, as executable code must be present in the filesystem for the OS loader to load it). In this case, you can exclude that dependency from the zipfile, and either require your users to have it installed, or ship it alongside your zipfile and add code to your ``__main__.py`` to include the directory containing the unzipped module in ``sys.path``. In this case, you will need to make sure to ship appropriate binaries for your target architecture(s) (and potentially pick the correct version to add to ``sys.path`` at runtime, based on the user's machine).
uk: Якщо ваша програма залежить від пакета, який містить розширення C, цей пакет не можна запустити з zip-файлу (це обмеження ОС, оскільки виконуваний код має бути присутнім у файловій системі, щоб завантажувач ОС міг його завантажити). У цьому випадку ви можете виключити цю залежність із zip-файлу та вимагати, щоб ваші користувачі встановили його, або надіслати його разом із zip-файлом і додати код до свого ``__main__.py``, щоб включити каталог, що містить розархівований модуль, у ``sys.path``. У цьому випадку вам потрібно буде переконатися, що надіслано відповідні двійкові файли для вашої цільової архітектури (і, можливо, вибрати правильну версію для додавання до ``sys.path`` під час виконання, на основі комп’ютера користувача).

source: If you are shipping a Windows executable as described above, you either need to ensure that your users have ``python3.dll`` on their PATH (which is not the default behaviour of the installer) or you should bundle your application with the embedded distribution.
uk: Якщо ви надсилаєте виконуваний файл Windows, як описано вище, вам потрібно переконатися, що ваші користувачі мають ``python3.dll`` у своєму ШЛЯХУ (що не є поведінкою інсталятора за замовчуванням), або ви повинні об’єднати свою програму з вбудованим розподіл.

source: The suggested launcher above uses the Python embedding API. This means that in your application, ``sys.executable`` will be your application, and *not* a conventional Python interpreter. Your code and its dependencies need to be prepared for this possibility. For example, if your application uses the :mod:`multiprocessing` module, it will need to call :func:`multiprocessing.set_executable` to let the module know where to find the standard Python interpreter.
uk: Запропонований вище засіб запуску використовує API вбудовування Python. Це означає, що у вашій програмі ``sys.executable`` буде вашою програмою, а *не* звичайним інтерпретатором Python. Ваш код і його залежності мають бути готові до такої можливості. Наприклад, якщо ваша програма використовує модуль :mod:`multiprocessing`, їй потрібно буде викликати :func:`multiprocessing.set_executable`, щоб повідомити модулю, де знайти стандартний інтерпретатор Python.

source: The Python Zip Application Archive Format
uk: Формат архіву програми Python Zip

source: Python has been able to execute zip files which contain a ``__main__.py`` file since version 2.6. In order to be executed by Python, an application archive simply has to be a standard zip file containing a ``__main__.py`` file which will be run as the entry point for the application. As usual for any Python script, the parent of the script (in this case the zip file) will be placed on :data:`sys.path` and thus further modules can be imported from the zip file.
uk: З версії 2.6 Python може виконувати файли zip, які містять файл ``__main__.py``. Для виконання Python архів програми просто має бути стандартним zip-файлом, що містить файл ``__main__.py``, який буде запущено як точка входу для програми. Як зазвичай для будь-якого сценарію Python, батьківський сценарій (у цьому випадку zip-файл) буде розміщено в :data:`sys.path` і, таким чином, інші модулі можуть бути імпортовані з zip-файлу.

source: The zip file format allows arbitrary data to be prepended to a zip file. The zip application format uses this ability to prepend a standard POSIX "shebang" line to the file (``#!/path/to/interpreter``).
uk: Формат файлу zip дозволяє додавати довільні дані до файлу zip. Формат програми zip використовує цю можливість для додавання до файлу стандартного рядка POSIX "shebang" (``#!/path/to/interpreter``).

source: Formally, the Python zip application format is therefore:
uk: Формально формат програми Python zip є таким:

source: An optional shebang line, containing the characters ``b'#!'`` followed by an interpreter name, and then a newline (``b'\n'``) character. The interpreter name can be anything acceptable to the OS "shebang" processing, or the Python launcher on Windows. The interpreter should be encoded in UTF-8 on Windows, and in :func:`sys.getfilesystemencoding()` on POSIX.
uk: Додатковий рядок shebang, що містить символи ``b'#!'``, за якими йде ім'я інтерпретатора, а потім символ нового рядка (``b'\n'``). Ім’я інтерпретатора може бути будь-яким, прийнятним для обробки "shebang" ОС або засобу запуску Python у Windows. Інтерпретатор має бути закодований у UTF-8 у Windows та у :func:`sys.getfilesystemencoding()` у POSIX.

source: Standard zipfile data, as generated by the :mod:`zipfile` module. The zipfile content *must* include a file called ``__main__.py`` (which must be in the "root" of the zipfile - i.e., it cannot be in a subdirectory). The zipfile data can be compressed or uncompressed.
uk: Стандартні дані файлу zip, згенеровані модулем :mod:`zipfile`. Вміст zip-файлу *має* включати файл під назвою ``__main__.py`` (який має бути в "корені" zip-файлу, тобто не може бути у підкаталозі). Дані файлу zip можна стиснути або розпакувати.

source: If an application archive has a shebang line, it may have the executable bit set on POSIX systems, to allow it to be executed directly.
uk: Якщо в архіві програми є рядок shebang, він може мати біт виконуваного файлу, встановлений у системах POSIX, щоб дозволити його виконання безпосередньо.

source: There is no requirement that the tools in this module are used to create application archives - the module is a convenience, but archives in the above format created by any means are acceptable to Python.
uk: Немає вимог, щоб інструменти в цьому модулі використовувалися для створення архівів програми - модуль є зручним, але архіви у вищезазначеному форматі, створені будь-якими засобами, прийнятні для Python.
