Repository: python/python-docs-uk
Catalog: distributing/index.po
Languages: uk

source: Distributing Python Modules
uk: Розповсюдження модулів Python

source: Email
uk: Електронна пошта

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
uk: Як популярний проект розробки з відкритим кодом, Python має активну спільноту учасників і користувачів, які також надають своє програмне забезпечення іншим розробникам Python для використання на умовах ліцензії з відкритим кодом.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
uk: Це дозволяє користувачам Python ефективно ділитися та співпрацювати, отримуючи вигоду від рішень, які інші вже створили для поширених (а іноді навіть рідкісних!) проблем, а також потенційно вносячи власні рішення в загальний пул.

source: This guide covers the distribution part of the process. For a guide to installing other Python projects, refer to the :ref:`installation guide <installing-index>`.
uk: Цей посібник описує частину процесу розповсюдження. Щоб отримати посібник із встановлення інших проектів Python, зверніться до :ref:`посібника з встановлення <installing-index>`.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
uk: Для корпоративних та інших інституційних користувачів пам’ятайте, що багато організацій мають власні політики щодо використання програмного забезпечення з відкритим вихідним кодом і надання допомоги в ньому. Будь ласка, візьміть до уваги ці правила під час використання інструментів розповсюдження та встановлення, які надаються разом з Python.

source: Key terms
uk: Ключові терміни

source: the `Python Package Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users
uk: `Python Package Index <https://pypi.org>`__ є загальнодоступним сховищем ліцензованих пакетів з відкритим вихідним кодом, доступним для використання іншими користувачами Python

source: the `Python Packaging Authority <https://www.pypa.io/>`__ are the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation and issue trackers on both `GitHub <https://github.com/pypa>`__ and `Bitbucket <https://bitbucket.org/pypa/>`__.
uk: `Python Packaging Authority <https://www.pypa.io/>`__ — це група розробників і авторів документації, відповідальних за підтримку та розвиток стандартних інструментів пакування та відповідних стандартів метаданих і форматів файлів. Вони підтримують різноманітні інструменти, документацію та засоби відстеження проблем як на `GitHub <https://github.com/pypa>`__, так і `Bitbucket <https://bitbucket.org/pypa/>`__.

source: :mod:`distutils` is the original build and distribution system first added to the Python standard library in 1998. While direct use of :mod:`distutils` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
uk: :mod:`distutils` — це оригінальна система збірки та розповсюдження, яка вперше була додана до стандартної бібліотеки Python у 1998 році. Хоча пряме використання :mod:`distutils` поступово припиняється, вона все ж заклала основу для поточної інфраструктури пакування та розповсюдження. , і він не лише залишається частиною стандартної бібліотеки, але його ім’я живе іншими способами (наприклад, ім’я списку розсилки, який використовується для координації розробки стандартів пакування Python).

source: `setuptools`_ is a (largely) drop-in replacement for :mod:`distutils` first published in 2004. Its most notable addition over the unmodified :mod:`distutils` tools was the ability to declare dependencies on other packages. It is currently recommended as a more regularly updated alternative to :mod:`distutils` that offers consistent support for more recent packaging standards across a wide range of Python versions.
uk: `setuptools`_ — це (в основному) додаткова заміна :mod:`distutils`, яка була вперше опублікована в 2004 році. Найпомітнішим доповненням до немодифікованих інструментів :mod:`distutils` була можливість оголошувати залежності від інших пакунків. Наразі його рекомендують як регулярніше оновлену альтернативу :mod:`distutils`, яка пропонує послідовну підтримку новіших стандартів пакування в широкому діапазоні версій Python.

source: `wheel`_ (in this context) is a project that adds the ``bdist_wheel`` command to :mod:`distutils`/`setuptools`_. This produces a cross platform binary packaging format (called "wheels" or "wheel files" and defined in :pep:`427`) that allows Python libraries, even those including binary extensions, to be installed on a system without needing to be built locally.
uk: `wheel`_ (у цьому контексті) — це проект, який додає команду ``bdist_wheel`` до :mod:`distutils`/`setuptools`_. Це створює міжплатформний двійковий формат пакування (який називається "колеса" або "файли коліс" і визначено в :pep:`427`), який дозволяє бібліотекам Python, навіть тим, що включають двійкові розширення, встановлювати в систему без необхідності збирання локально.

source: Open source licensing and collaboration
uk: Ліцензування та співпраця з відкритим кодом

source: In most parts of the world, software is automatically covered by copyright. This means that other developers require explicit permission to copy, use, modify and redistribute the software.
uk: У більшості країн світу на програмне забезпечення автоматично поширюється авторське право. Це означає, що іншим розробникам потрібен явний дозвіл на копіювання, використання, зміну та повторне розповсюдження програмного забезпечення.

source: Open source licensing is a way of explicitly granting such permission in a relatively consistent way, allowing developers to share and collaborate efficiently by making common solutions to various problems freely available. This leaves many developers free to spend more time focusing on the problems that are relatively unique to their specific situation.
uk: Ліцензування з відкритим вихідним кодом — це спосіб явного надання такого дозволу відносно послідовним способом, що дозволяє розробникам ділитися та ефективно співпрацювати, надаючи загальні рішення для різних проблем у вільний доступ. Це дозволяє багатьом розробникам витрачати більше часу, зосереджуючись на проблемах, які відносно унікальні для їх конкретної ситуації.

source: The distribution tools provided with Python are designed to make it reasonably straightforward for developers to make their own contributions back to that common pool of software if they choose to do so.
uk: Інструменти розповсюдження, що надаються разом із Python, створені для того, щоб розробникам було достатньо просто зробити свій внесок у цей загальний пул програмного забезпечення, якщо вони вирішать це зробити.

source: The same distribution tools can also be used to distribute software within an organisation, regardless of whether that software is published as open source software or not.
uk: Ті самі інструменти розповсюдження також можна використовувати для розповсюдження програмного забезпечення всередині організації, незалежно від того, опубліковано це програмне забезпечення як програмне забезпечення з відкритим кодом чи ні.

source: Installing the tools
uk: Установка інструментів

source: The standard library does not include build tools that support modern Python packaging standards, as the core development team has found that it is important to have standard tools that work consistently, even on older versions of Python.
uk: Стандартна бібліотека не включає інструменти збірки, які підтримують сучасні стандарти упаковки Python, оскільки основна команда розробників виявила, що важливо мати стандартні інструменти, які працюють узгоджено, навіть на старих версіях Python.

source: The currently recommended build and distribution tools can be installed by invoking the ``pip`` module at the command line::
uk: Наразі рекомендовані інструменти збирання та розповсюдження можна встановити, викликавши модуль ``pip`` у командному рядку::

source: For POSIX users (including macOS and Linux users), these instructions assume the use of a :term:`virtual environment`.
uk: Для користувачів POSIX (включаючи користувачів macOS і Linux) ці інструкції передбачають використання :term:`virtual environment`.

source: For Windows users, these instructions assume that the option to adjust the system PATH environment variable was selected when installing Python.
uk: Для користувачів Windows ці інструкції припускають, що під час інсталяції Python було вибрано параметр налаштування системної змінної середовища PATH.

source: The Python Packaging User Guide includes more details on the `currently recommended tools`_.
uk: Посібник користувача з пакування Python містить додаткові відомості про `currently recommended tools`_.

source: Reading the Python Packaging User Guide
uk: Читання посібника користувача з пакування Python

source: The Python Packaging User Guide covers the various key steps and elements involved in creating and publishing a project:
uk: Посібник користувача з пакування Python охоплює різні ключові кроки та елементи, пов’язані зі створенням і публікацією проекту:

source: `Project structure`_
uk: Структура проекту (`Project structure`_)

source: `Building and packaging the project`_
uk: Створення та упаковка проекту (`Building and packaging the project`_)

source: `Uploading the project to the Python Package Index`_
uk: `Завантаження проекту в індекс пакетів Python`_

source: `The .pypirc file`_
uk: `Файл .pypirc`_

source: How do I...?
uk: Як мені...?

source: These are quick answers or links for some common tasks.
uk: Це короткі відповіді або посилання для деяких типових завдань.

source: ... choose a name for my project?
uk: ... вибрати назву для мого проекту?

source: This isn't an easy topic, but here are a few tips:
uk: Це непроста тема, але ось кілька порад:

source: check the Python Package Index to see if the name is already in use
uk: перевірте індекс пакета Python, щоб побачити, чи ім’я вже використовується

source: check popular hosting sites like GitHub, Bitbucket, etc to see if there is already a project with that name
uk: перевірте популярні сайти хостингу, такі як GitHub, Bitbucket тощо, щоб побачити, чи вже існує проект із такою назвою

source: check what comes up in a web search for the name you're considering
uk: перевірте, що з’являється під час веб-пошуку для імені, яке ви розглядаєте

source: avoid particularly common words, especially ones with multiple meanings, as they can make it difficult for users to find your software when searching for it
uk: уникайте особливо загальних слів, особливо багатозначних, оскільки вони можуть ускладнити користувачам пошук вашого програмного забезпечення під час його пошуку

source: ... create and distribute binary extensions?
uk: ... створювати та розповсюджувати двійкові розширення?

source: This is actually quite a complex topic, with a variety of alternatives available depending on exactly what you're aiming to achieve. See the Python Packaging User Guide for more information and recommendations.
uk: Насправді це досить складна тема, з різними доступними альтернативами залежно від того, чого саме ви прагнете досягти. Додаткову інформацію та рекомендації див. у Посібнику користувача з пакування Python.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`__
uk: `Посібник користувача з пакування Python: двійкові розширення <https://packaging.python.org/guides/packaging-binary-extensions/>`__
