Repository: python/python-docs-uk
Catalog: distutils/apiref.po
Languages: uk

source: API Reference
uk: Довідник з API

source: `New and changed setup.py arguments in setuptools`_
uk: `Нові та змінені аргументи setup.py в setuptools`_

source: The ``setuptools`` project adds new capabilities to the ``setup`` function and other APIs, makes the API consistent across different Python versions, and is hence recommended over using ``distutils`` directly.
uk: Проект ``setuptools`` додає нові можливості до функції ``setup`` та інших інтерфейсів API, робить API узгодженим для різних версій Python, і тому рекомендується замість безпосереднього використання ``distutils``.

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
uk: Цей документ зберігається лише до тих пір, поки документація ``setuptools`` за адресою https://setuptools.readthedocs.io/en/latest/setuptools.html окремо не охопить всю відповідну інформацію, яка зараз включена тут.

source: :mod:`distutils.core` --- Core Distutils functionality
uk: :mod:`distutils.core` --- Основні функції Distutils

source: The :mod:`distutils.core` module is the only module that needs to be installed to use the Distutils. It provides the :func:`setup` (which is called from the setup script). Indirectly provides the :class:`distutils.dist.Distribution` and :class:`distutils.cmd.Command` class.
uk: Модуль :mod:`distutils.core` — це єдиний модуль, який потрібно встановити для використання Distutils. Він забезпечує :func:`setup` (який викликається зі сценарію налаштування). Опосередковано надає клас :class:`distutils.dist.Distribution` і :class:`distutils.cmd.Command`.

source: The basic do-everything function that does most everything you could ever ask for from a Distutils method.
uk: Основна функція "зроби все", яка робить майже все, що ви можете попросити від методу Distutils.

source: The setup function takes a large number of arguments. These are laid out in the following table.
uk: Функція налаштування приймає велику кількість аргументів. Вони наведені в наступній таблиці.

source: argument name
uk: назва аргументу

source: value
uk: значення

source: type
uk: типу

source: *name*
uk: *ім'я*

source: The name of the package
uk: Назва пакета

source: a string
uk: рядок

source: *version*
uk: *версія*

source: The version number of the package; see :mod:`distutils.version`
uk: номер версії пакета; див. :mod:`distutils.version`

source: *description*
uk: *опис*

source: A single line describing the package
uk: Один рядок, що описує пакет

source: *long_description*
uk: *довгий_опис*

source: Longer description of the package
uk: Довший опис пакету

source: *author*
uk: *автор*

source: The name of the package author
uk: Ім'я автора пакета

source: *author_email*
uk: *email_автора*

source: The email address of the package author
uk: Адреса електронної пошти автора пакета

source: *maintainer*
uk: *супроводжувач*

source: The name of the current maintainer, if different from the author. Note that if the maintainer is provided, distutils will use it as the author in :file:`PKG-INFO`
uk: Ім'я поточного супроводжуючого, якщо воно відрізняється від автора. Зауважте, що якщо супроводжувач надано, distutils використовуватиме його як автора у :file:`PKG-INFO`

source: *maintainer_email*
uk: *email_maintainer_email*

source: The email address of the current maintainer, if different from the author
uk: Електронна адреса поточного супроводжуючого, якщо вона відрізняється від автора

source: A URL for the package (homepage)
uk: URL-адреса пакета (домашня сторінка)

source: *download_url*
uk: *URL-адреса_завантаження*

source: A URL to download the package
uk: URL-адреса для завантаження пакета

source: *packages*
uk: *пакети*

source: A list of Python packages that distutils will manipulate
uk: Список пакетів Python, якими distutils працюватиме

source: a list of strings
uk: список рядків

source: A list of Python modules that distutils will manipulate
uk: Список модулів Python, якими distutils працюватиме

source: *scripts*
uk: *скрипти*

source: A list of standalone script files to be built and installed
uk: Список автономних файлів сценаріїв, які потрібно створити та встановити

source: A list of Python extensions to be built
uk: Список розширень Python для створення

source: a list of instances of :class:`distutils.core.Extension`
uk: список екземплярів :class:`distutils.core.Extension`

source: *classifiers*
uk: *класифікатори*

source: A list of categories for the package
uk: Список категорій для пакета

source: a list of strings; valid classifiers are listed on `PyPI <https://pypi.org/classifiers>`_.
uk: список рядків; дійсні класифікатори перераховані на `PyPI <https://pypi.org/classifiers>`_.

source: the :class:`Distribution` class to use
uk: клас :class:`Distribution` для використання

source: a subclass of :class:`distutils.core.Distribution`
uk: підклас :class:`distutils.core.Distribution`

source: The name of the setup.py script - defaults to ``sys.argv[0]``
uk: Назва сценарію setup.py - за умовчанням ``sys.argv[0]``

source: Arguments to supply to the setup script
uk: Аргументи для налаштування сценарію

source: *options*
uk: *опції*

source: default options for the setup script
uk: параметри за замовчуванням для сценарію налаштування

source: a dictionary
uk: словник

source: *license*
uk: *ліцензія*

source: The license for the package
uk: Ліцензія на пакет

source: *keywords*
uk: *ключові слова*

source: Descriptive meta-data, see :pep:`314`
uk: Описові метадані див. :pep:`314`

source: a list of strings or a comma-separated string
uk: список рядків або рядок, розділений комами

source: *platforms*
uk: *платформи*

source: A mapping of command names to :class:`Command` subclasses
uk: Відображення назв команд на підкласи :class:`Command`

source: *data_files*
uk: *файли_даних*

source: A list of data files to install
uk: Список файлів даних для встановлення

source: a list
uk: список

source: A mapping of package to directory names
uk: Відображення пакета в іменах каталогу

source: Run a setup script in a somewhat controlled environment, and return the :class:`distutils.dist.Distribution` instance that drives things. This is useful if you need to find out the distribution meta-data (passed as keyword args from *script* to :func:`setup`), or the contents of the config files or command-line.
uk: Запустіть сценарій налаштування в дещо контрольованому середовищі та поверніть екземпляр :class:`distutils.dist.Distribution`, який керує діями. Це корисно, якщо вам потрібно дізнатися метадані розповсюдження (передані як аргументи ключового слова від *script* до :func:`setup`), або вміст конфігураційних файлів чи командного рядка.

source: *script_name* is a file that will be read and run with :func:`exec`. ``sys.argv[0]`` will be replaced with *script* for the duration of the call. *script_args* is a list of strings; if supplied, ``sys.argv[1:]`` will be replaced by *script_args* for the duration of the call.
uk: *script_name* — це файл, який читатиметься та запускатиметься за допомогою :func:`exec`. ``sys.argv[0]`` буде замінено на *script* на час виклику. *script_args* — це список рядків; якщо надано, ``sys.argv[1:]`` буде замінено на *script_args* протягом тривалості виклику.

source: *stop_after* tells :func:`setup` when to stop processing; possible values:
uk: *stop_after* повідомляє :func:`setup`, коли зупинити обробку; можливі значення:

source: description
uk: опис

source: *init*
uk: *у цьому*

source: Stop after the :class:`Distribution` instance has been created and populated with the keyword arguments to :func:`setup`
uk: Зупиніться після того, як екземпляр :class:`Distribution` буде створено та заповнено ключовими аргументами для :func:`setup`

source: *config*
uk: *конфігурація*

source: Stop after config files have been parsed (and their data stored in the :class:`Distribution` instance)
uk: Зупинити після аналізу конфігураційних файлів (і їх даних, збережених в екземплярі :class:`Distribution`)

source: *commandline*
uk: *командний рядок*

source: Stop after the command-line (``sys.argv[1:]`` or *script_args*) have been parsed (and the data stored in the :class:`Distribution` instance.)
uk: Зупиніться після аналізу командного рядка (``sys.argv[1:]`` або *script_args*) (і даних, збережених в екземплярі :class:`Distribution`).

source: *run*
uk: *бігти*

source: Stop after all commands have been run (the same as if :func:`setup` had been called in the usual way). This is the default value.
uk: Зупиніться після виконання всіх команд (так само, якби :func:`setup` було викликано звичайним способом). Це значення за умовчанням.

source: In addition, the :mod:`distutils.core` module exposed a number of classes that live elsewhere.
uk: Крім того, модуль :mod:`distutils.core` відкрив низку класів, які живуть в інших місцях.

source: :class:`~distutils.extension.Extension` from :mod:`distutils.extension`
uk: :class:`~distutils.extension.Extension` з :mod:`distutils.extension`

source: :class:`~distutils.cmd.Command` from :mod:`distutils.cmd`
uk: :class:`~distutils.cmd.Command` з :mod:`distutils.cmd`

source: :class:`~distutils.dist.Distribution` from :mod:`distutils.dist`
uk: :class:`~distutils.dist.Distribution` з :mod:`distutils.dist`

source: A short description of each of these follows, but see the relevant module for the full reference.
uk: Нижче наведено короткий опис кожного з них, але повну довідку див. у відповідному модулі.

source: The Extension class describes a single C or C++ extension module in a setup script. It accepts the following keyword arguments in its constructor:
uk: Клас Extension описує один модуль розширення C або C++ у сценарії налаштування. Він приймає такі ключові аргументи у своєму конструкторі:

source: the full name of the extension, including any packages --- ie. *not* a filename or pathname, but Python dotted name
uk: повна назва розширення, включаючи будь-які пакети --- тобто. *не* ім’я файлу чи шлях, а ім’я Python із крапками

source: *sources*
uk: *джерела*

source: list of source filenames, relative to the distribution root (where the setup script lives), in Unix form (slash-separated) for portability. Source files may be C, C++, SWIG (.i), platform-specific resource files, or whatever else is recognized by the :command:`build_ext` command as source for a Python extension.
uk: список імен вихідних файлів відносно кореня розповсюдження (де знаходиться сценарій встановлення), у формі Unix (розділені скісною рискою) для переносимості. Вихідними файлами можуть бути C, C++, SWIG (.i), файли ресурсів для певної платформи або будь-які інші файли, які розпізнаються командою :command:`build_ext` як джерело для розширення Python.

source: list of directories to search for C/C++ header files (in Unix form for portability)
uk: список каталогів для пошуку файлів заголовків C/C++ (у формі Unix для переносимості)

source: list of macros to define; each macro is defined using a 2-tuple ``(name, value)``, where *value* is either the string to define it to or ``None`` to define it without a particular value (equivalent of ``#define FOO`` in source or :option:`!-DFOO` on Unix C compiler command line)
uk: список макросів для визначення; кожен макрос визначається за допомогою 2-кортежу ``(ім’я, значення)``, де *value* є або рядком для його визначення, або ``None``, щоб визначити його без певного значення (еквівалент ``# визначте FOO`` у джерелі або :option:`!-DFOO` в командному рядку компілятора Unix C)

source: a list of tuples
uk: список кортежів

source: list of macros to undefine explicitly
uk: список макросів для явного скасування визначення

source: list of directories to search for C/C++ libraries at link time
uk: список каталогів для пошуку бібліотек C/C++ під час підключення

source: *libraries*
uk: *бібліотеки*

source: list of library names (not filenames or paths) to link against
uk: список імен бібліотек (не імен файлів чи шляхів), з якими потрібно посилатися

source: *runtime_library_dirs*
uk: *каталоги_бібліотеки_запуску*

source: list of directories to search for C/C++ libraries at run time (for shared extensions, this is when the extension is loaded)
uk: список каталогів для пошуку бібліотек C/C++ під час виконання (для спільних розширень це час завантаження розширення)

source: *extra_objects*
uk: *додаткові_об'єкти*

source: list of extra files to link with (eg. object files not implied by 'sources', static library that must be explicitly specified, binary resource files, etc.)
uk: список додаткових файлів, з якими можна зв’язатися (наприклад, об’єктні файли, які не передбачаються "джерелами", статична бібліотека, яку необхідно вказати явно, двійкові файли ресурсів тощо)

source: any extra platform- and compiler-specific information to use when compiling the source files in 'sources'. For platforms and compilers where a command line makes sense, this is typically a list of command-line arguments, but for other platforms it could be anything.
uk: будь-яка додаткова інформація про платформу та компілятор для використання під час компіляції вихідних файлів у "джерелах". Для платформ і компіляторів, де командний рядок має сенс, це зазвичай список аргументів командного рядка, але для інших платформ це може бути будь-що.

source: any extra platform- and compiler-specific information to use when linking object files together to create the extension (or to create a new static Python interpreter). Similar interpretation as for 'extra_compile_args'.
uk: будь-яка додаткова інформація про платформу та компілятор, яку можна використовувати під час зв’язування об’єктних файлів разом для створення розширення (або для створення нового статичного інтерпретатора Python). Інтерпретація подібна до 'extra_compile_args'.

source: list of symbols to be exported from a shared extension. Not used on all platforms, and not generally necessary for Python extensions, which typically export exactly one symbol: ``init`` + extension_name.
uk: список символів, які потрібно експортувати зі спільного розширення. Не використовується на всіх платформах і не є загалом необхідним для розширень Python, які зазвичай експортують лише один символ: ``init`` + extension_name.

source: *depends*
uk: *залежить*

source: list of files that the extension depends on
uk: список файлів, від яких залежить розширення

source: *language*
uk: *мову*

source: extension language (i.e. ``'c'``, ``'c++'``, ``'objc'``). Will be detected from the source extensions if not provided.
uk: мова розширення (тобто ``'c'``, ``'c++'``, ``'objc'``). Буде виявлено з вихідних розширень, якщо їх не надано.

source: *optional*
uk: *необов'язково*

source: specifies that a build failure in the extension should not abort the build process, but simply skip the extension.
uk: вказує, що помилка збірки в розширенні не повинна переривати процес збірки, а просто пропускати розширення.

source: a boolean
uk: логічне значення

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin.
uk: В Unix розширення C більше не пов’язані з libpython, за винятком Android і Cygwin.

source: A :class:`Distribution` describes how to build, install and package up a Python software package.
uk: :class:`Distribution` описує, як створити, встановити та запакувати програмний пакет Python.

source: See the :func:`setup` function for a list of keyword arguments accepted by the Distribution constructor. :func:`setup` creates a Distribution instance.
uk: Перегляньте функцію :func:`setup`, щоб переглянути список ключових аргументів, які приймає конструктор розподілу. :func:`setup` створює екземпляр Distribution.

source: :class:`~distutils.core.Distribution` now warns if ``classifiers``, ``keywords`` and ``platforms`` fields are not specified as a list or a string.
uk: :class:`~distutils.core.Distribution` тепер попереджає, якщо поля ``класифікатори``, ``ключові слова`` та ``платформи`` не вказані як список або рядок.

source: A :class:`Command` class (or rather, an instance of one of its subclasses) implement a single distutils command.
uk: Клас :class:`Command` (точніше, екземпляр одного з його підкласів) реалізує одну команду distutils.

source: :mod:`distutils.ccompiler` --- CCompiler base class
uk: :mod:`distutils.ccompiler` --- базовий клас CCompiler

source: This module provides the abstract base class for the :class:`CCompiler` classes. A :class:`CCompiler` instance can be used for all the compile and link steps needed to build a single project. Methods are provided to set options for the compiler --- macro definitions, include directories, link path, libraries and the like.
uk: Цей модуль надає абстрактний базовий клас для класів :class:`CCompiler`. Екземпляр :class:`CCompiler` можна використовувати для всіх кроків компіляції та зв’язування, необхідних для створення одного проекту. Надаються методи для встановлення опцій для компілятора --- визначень макросів, включення каталогів, шляхів посилань, бібліотек тощо.

source: This module provides the following functions.
uk: Цей модуль забезпечує такі функції.

source: Generate linker options for searching library directories and linking with specific libraries. *libraries* and *library_dirs* are, respectively, lists of library names (not filenames!) and search directories. Returns a list of command-line options suitable for use with some compiler (depending on the two format strings passed in).
uk: Створення параметрів компонувальника для пошуку каталогів бібліотек і зв’язування з певними бібліотеками. *libraries* і *library_dirs* — це, відповідно, списки імен бібліотек (а не імен файлів!) і каталогів пошуку. Повертає список параметрів командного рядка, придатних для використання з деяким компілятором (залежно від двох переданих рядків формату).

source: Generate C pre-processor options (:option:`!-D`, :option:`!-U`, :option:`!-I`) as used by at least two types of compilers: the typical Unix compiler and Visual C++. *macros* is the usual thing, a list of 1- or 2-tuples, where ``(name,)`` means undefine (:option:`!-U`) macro *name*, and ``(name, value)`` means define (:option:`!-D`) macro *name* to *value*. *include_dirs* is just a list of directory names to be added to the header file search path (:option:`!-I`). Returns a list of command-line options suitable for either Unix compilers or Visual C++.
uk: Згенеруйте параметри попереднього процесора C (:option:`!-D`, :option:`!-U`, :option:`!-I`), які використовуються принаймні двома типами компіляторів: типовим компілятором Unix і Visual C++. *макроси* — це звичайна річ, список 1- або 2-кортежів, де ``(name,)`` означає undefine (:option:`!-U`) макрос *name*, а ``(name, значення)`` означає визначення (:option:`!-D`) *назви* макросу на *значення*. *include_dirs* — це лише список імен каталогів, які потрібно додати до шляху пошуку файлу заголовка (:option:`!-I`). Повертає список параметрів командного рядка, придатних для компіляторів Unix або Visual C++.

source: Determine the default compiler to use for the given platform.
uk: Визначте компілятор за замовчуванням для даної платформи.

source: *osname* should be one of the standard Python OS names (i.e. the ones returned by ``os.name``) and *platform* the common value returned by ``sys.platform`` for the platform in question.
uk: *osname* має бути одним із стандартних імен ОС Python (тобто тих, які повертає ``os.name``), а *platform* — загальне значення, яке повертає ``sys.platform`` для відповідної платформи.

source: The default values are ``os.name`` and ``sys.platform`` in case the parameters are not given.
uk: Значеннями за замовчуванням є ``os.name`` і ``sys.platform``, якщо параметри не вказано.

source: Factory function to generate an instance of some CCompiler subclass for the supplied platform/compiler combination. *plat* defaults to ``os.name`` (eg. ``'posix'``, ``'nt'``), and *compiler* defaults to the default compiler for that platform. Currently only ``'posix'`` and ``'nt'`` are supported, and the default compilers are "traditional Unix interface" (:class:`UnixCCompiler` class) and Visual C++ (:class:`MSVCCompiler` class). Note that it's perfectly possible to ask for a Unix compiler object under Windows, and a Microsoft compiler object under Unix---if you supply a value for *compiler*, *plat* is ignored.
uk: Фабрична функція для створення екземпляра деякого підкласу CCompiler для наданої комбінації платформа/компілятор. *plat* за замовчуванням має ``os.name`` (наприклад, ``'posix'``, ``'nt'``), а *compiler* за замовчуванням використовує компілятор за замовчуванням для цієї платформи. Наразі підтримуються лише ``'posix'`` і ``'nt'``, а компіляторами за замовчуванням є "традиційний інтерфейс Unix" (:class:`UnixCCompiler` клас) і Visual C++ (:class:`MSVCCompiler` клас ). Зауважте, що цілком можливо запросити об’єкт компілятора Unix під Windows і об’єкт компілятора Microsoft під Unix --- якщо ви вказуєте значення для *compiler*, *plat* ігнорується.

source: Print list of available compilers (used by the :option:`!--help-compiler` options to :command:`build`, :command:`build_ext`, :command:`build_clib`).
uk: Надрукувати список доступних компіляторів (використовується параметрами :option:`!--help-compiler` для :command:`build`, :command:`build_ext`, :command:`build_clib`).

source: The abstract base class :class:`CCompiler` defines the interface that must be implemented by real compiler classes. The class also has some utility methods used by several compiler classes.
uk: Абстрактний базовий клас :class:`CCompiler` визначає інтерфейс, який має бути реалізований реальними класами компілятора. Клас також має деякі корисні методи, які використовуються кількома класами компілятора.

source: The basic idea behind a compiler abstraction class is that each instance can be used for all the compile/link steps in building a single project. Thus, attributes common to all of those compile and link steps --- include directories, macros to define, libraries to link against, etc. --- are attributes of the compiler instance. To allow for variability in how individual files are treated, most of those attributes may be varied on a per-compilation or per-link basis.
uk: Основна ідея класу абстракції компілятора полягає в тому, що кожен екземпляр можна використовувати для всіх етапів компіляції/зв’язування в створенні одного проекту. Таким чином, атрибути, загальні для всіх цих етапів компіляції та зв’язування --- включають каталоги, макроси для визначення, бібліотеки для зв’язування тощо --- є атрибутами примірника компілятора. Щоб уможливити варіативність у тому, як обробляються окремі файли, більшість із цих атрибутів можна змінювати для кожної компіляції чи кожного посилання.

source: The constructor for each subclass creates an instance of the Compiler object. Flags are *verbose* (show verbose output), *dry_run* (don't actually execute the steps) and *force* (rebuild everything, regardless of dependencies). All of these flags default to ``0`` (off). Note that you probably don't want to instantiate :class:`CCompiler` or one of its subclasses directly - use the :func:`distutils.CCompiler.new_compiler` factory function instead.
uk: Конструктор для кожного підкласу створює екземпляр об’єкта Compiler. Прапори: *verbose* (показати докладний вихід), *dry_run* (фактично не виконувати кроки) і *force* (перебудувати все, незалежно від залежностей). Усі ці прапорці за замовчуванням мають значення ``0`` (вимкнено). Зауважте, що ви, мабуть, не бажаєте створювати екземпляр :class:`CCompiler` або один із його підкласів напряму - використовуйте натомість фабричну функцію :func:`distutils.CCompiler.new_compiler`.

source: The following methods allow you to manually alter compiler options for the instance of the Compiler class.
uk: Наступні методи дозволяють вручну змінювати параметри компілятора для екземпляра класу Compiler.
