Repository: python/python-docs-uk
Catalog: distutils/apiref.po
Languages: uk

source: For macOS systems the OS version reflects the minimal version on which binaries will run (that is, the value of ``MACOSX_DEPLOYMENT_TARGET`` during the build of Python), not the OS version of the current system.
uk: Для систем macOS версія ОС відображає мінімальну версію, на якій запускатимуться двійкові файли (тобто значення ``MACOSX_DEPLOYMENT_TARGET`` під час збирання Python), а не версію ОС поточної системи.

source: For universal binary builds on macOS the architecture value reflects the universal binary status instead of the architecture of the current processor. For 32-bit universal binaries the architecture is ``fat``, for 64-bit universal binaries the architecture is ``fat64``, and for 4-way universal binaries the architecture is ``universal``. Starting from Python 2.7 and Python 3.2 the architecture ``fat3`` is used for a 3-way universal build (ppc, i386, x86_64) and ``intel`` is used for a universal build with the i386 and x86_64 architectures
uk: Для універсальних двійкових збірок на macOS значення архітектури відображає статус універсального двійкового файлу замість архітектури поточного процесора. Для 32-розрядних універсальних двійкових файлів архітектура ``fat``, для 64-розрядних універсальних двійкових файлів архітектура ``fat64``, а для 4-сторонніх універсальних двійкових файлів архітектура ``universal``. Починаючи з Python 2.7 і Python 3.2, архітектура ``fat3`` використовується для тристоронньої універсальної збірки (ppc, i386, x86_64), а ``intel`` використовується для універсальної збірки з архітектурами i386 і x86_64

source: Examples of returned values on macOS:
uk: Приклади повернених значень у macOS:

source: For AIX, Python 3.9 and later return a string starting with "aix", followed by additional fields (separated by ``'-'``) that represent the combined values of AIX Version, Release and Technology Level (first field), Build Date (second field), and bit-size (third field). Python 3.8 and earlier returned only a single additional field with the AIX Version and Release.
uk: Для AIX Python 3.9 і пізніших версій повертає рядок, що починається з "aix", за яким ідуть додаткові поля (розділені "-"), які представляють об’єднані значення версії AIX, випуску та рівня технології (перше поле), Build Дата (друге поле) і бітовий розмір (третє поле). Python 3.8 і попередні версії повертали лише одне додаткове поле з версією та випуском AIX.

source: Examples of returned values on AIX:
uk: Приклади повернених значень в AIX:

source: ``aix-5307-0747-32`` # 32-bit build on AIX ``oslevel -s``: 5300-07-00-0000
uk: ``aix-5307-0747-32`` # 32-розрядна збірка на AIX ``oslevel -s``: 5300-07-00-0000

source: ``aix-7105-1731-64`` # 64-bit build on AIX ``oslevel -s``: 7100-05-01-1731
uk: ``aix-7105-1731-64`` # 64-розрядна збірка на AIX ``oslevel -s``: 7100-05-01-1731

source: ``aix-7.2`` # Legacy form reported in Python 3.8 and earlier
uk: ``aix-7.2`` # Застаріла форма, представлена в Python 3.8 і раніше

source: The AIX platform string format now also includes the technology level, build date, and ABI bit-size.
uk: Формат рядка платформи AIX тепер також включає рівень технології, дату збірки та бітовий розмір ABI.

source: Return 'pathname' as a name that will work on the native filesystem, i.e. split it on '/' and put it back together again using the current directory separator. Needed because filenames in the setup script are always supplied in Unix style, and have to be converted to the local convention before we can actually use them in the filesystem. Raises :exc:`ValueError` on non-Unix-ish systems if *pathname* either starts or ends with a slash.
uk: Поверніть "pathname" як ім’я, яке працюватиме у рідній файловій системі, тобто розділіть його на "/" і знову об’єднайте, використовуючи поточний роздільник каталогів. Необхідно, тому що імена файлів у сценарії встановлення завжди надаються у стилі Unix і мають бути перетворені відповідно до локальної угоди, перш ніж ми зможемо фактично використовувати їх у файловій системі. Викликає :exc:`ValueError` на системах, що не підтримують Unix, якщо *шлях* починається або закінчується скісною рискою.

source: Return *pathname* with *new_root* prepended. If *pathname* is relative, this is equivalent to ``os.path.join(new_root,pathname)`` Otherwise, it requires making *pathname* relative and then joining the two, which is tricky on DOS/Windows.
uk: Повернути *pathname* з *new_root* перед початком. Якщо *pathname* є відносним, це еквівалентно ``os.path.join(new_root,pathname)``. В іншому випадку потрібно зробити *pathname* відносним, а потім об’єднати два, що складно в DOS/Windows.

source: Ensure that 'os.environ' has all the environment variables we guarantee that users can use in config files, command-line options, etc. Currently this includes:
uk: Переконайтеся, що "os.environ" містить усі змінні середовища, які ми гарантуємо, що користувачі можуть використовувати у файлах конфігурації, параметрах командного рядка тощо. Наразі це включає:

source: :envvar:`HOME` - user's home directory (Unix only)
uk: :envvar:`HOME` - домашній каталог користувача (тільки для Unix)

source: :envvar:`PLAT` - description of the current platform, including hardware and OS (see :func:`get_platform`)
uk: :envvar:`PLAT` - опис поточної платформи, включаючи обладнання та ОС (див. :func:`get_platform`)

source: Perform shell/Perl-style variable substitution on *s*. Every occurrence of ``$`` followed by a name is considered a variable, and variable is substituted by the value found in the *local_vars* dictionary, or in ``os.environ`` if it's not in *local_vars*. *os.environ* is first checked/augmented to guarantee that it contains certain values: see :func:`check_environ`. Raise :exc:`ValueError` for any variables not found in either *local_vars* or ``os.environ``.
uk: Виконайте підстановку змінної у стилі shell/Perl на *s*. Кожне входження ``$``, після якого йде ім’я, вважається змінною, а змінна замінюється значенням, знайденим у словнику *local_vars* або в ``os.environ``, якщо його немає в *local_vars*. *os.environ* спочатку перевіряється/доповнюється, щоб гарантувати, що він містить певні значення: див. :func:`check_environ`. Викликати :exc:`ValueError` для будь-яких змінних, не знайдених ні в *local_vars*, ні в ``os.environ``.

source: Note that this is not a fully-fledged string interpolation function. A valid ``$variable`` can consist only of upper and lower case letters, numbers and an underscore. No { } or ( ) style quoting is available.
uk: Зауважте, що це не повноцінна функція інтерполяції рядків. Дійсна ``$змінна`` може складатися лише з великих і малих літер, цифр і підкреслення. Лавування стилю { } або ( ) недоступне.

source: Split a string up according to Unix shell-like rules for quotes and backslashes. In short: words are delimited by spaces, as long as those spaces are not escaped by a backslash, or inside a quoted string. Single and double quotes are equivalent, and the quote characters can be backslash-escaped. The backslash is stripped from any two-character escape sequence, leaving only the escaped character. The quote characters are stripped from any quoted string. Returns a list of words.
uk: Розділіть рядок відповідно до правил оболонки Unix для лапок і зворотних косих риск. Коротше кажучи: слова розділені пробілами, якщо ці пробіли не виділені зворотною скісною рискою або всередині рядка в лапках. Одинарні та подвійні лапки еквівалентні, а символи лапок можна екранувати зворотною скісною рискою. Зворотний слеш видаляється з будь-якої послідовності екранування з двох символів, залишаючи лише екранований символ. Символи лапок видаляються з будь-якого рядка в лапках. Повертає список слів.

source: Perform some action that affects the outside world (for instance, writing to the filesystem). Such actions are special because they are disabled by the *dry_run* flag. This method takes care of all that bureaucracy for you; all you have to do is supply the function to call and an argument tuple for it (to embody the "external action" being performed), and an optional message to print.
uk: Виконайте певну дію, яка впливає на зовнішній світ (наприклад, запис у файлову систему). Такі дії є особливими, тому що вони вимкнені прапором *dry_run*. Цей метод подбає про всю цю бюрократію за вас; все, що вам потрібно зробити, це надати функцію для виклику та кортеж аргументів для неї (щоб втілити "зовнішню дію", що виконується), і додаткове повідомлення для друку.

source: Convert a string representation of truth to true (1) or false (0).
uk: Перетворення рядкового представлення правди в істину (1) або хибність (0).

source: True values are ``y``, ``yes``, ``t``, ``true``, ``on`` and ``1``; false values are ``n``, ``no``, ``f``, ``false``, ``off`` and ``0``. Raises :exc:`ValueError` if *val* is anything else.
uk: Справжніми значеннями є ``y``, ``yes``, ``t``, ``true``, ``on`` і ``1``; помилковими значеннями є ``n``, ``no``, ``f``, ``false``, ``off`` і ``0``. Викликає :exc:`ValueError`, якщо *val* є чимось іншим.

source: Byte-compile a collection of Python source files to :file:`.pyc` files in a :file:`__pycache__` subdirectory (see :pep:`3147` and :pep:`488`). *py_files* is a list of files to compile; any files that don't end in :file:`.py` are silently skipped. *optimize* must be one of the following:
uk: Байтова компіляція колекції вихідних файлів Python у файли :file:`.pyc` у підкаталозі :file:`__pycache__` (див. :pep:`3147` і :pep:`488`). *py_files* — список файлів для компіляції; будь-які файли, які не закінчуються на :file:`.py` мовчки пропускаються. *optimize* має бути одним із таких:

source: ``0`` - don't optimize
uk: ``0`` - не оптимізувати

source: ``1`` - normal optimization (like ``python -O``)
uk: ``1`` - звичайна оптимізація (наприклад, ``python -O``)

source: ``2`` - extra optimization (like ``python -OO``)
uk: ``2`` - додаткова оптимізація (наприклад, ``python -OO``)

source: If *force* is true, all files are recompiled regardless of timestamps.
uk: Якщо *force* має значення true, усі файли перекомпільовуються незалежно від позначок часу.

source: The source filename encoded in each :term:`bytecode` file defaults to the filenames listed in *py_files*; you can modify these with *prefix* and *basedir*. *prefix* is a string that will be stripped off of each source filename, and *base_dir* is a directory name that will be prepended (after *prefix* is stripped). You can supply either or both (or neither) of *prefix* and *base_dir*, as you wish.
uk: Ім’я вихідного файлу, закодоване в кожному файлі :term:`bytecode`, за замовчуванням відповідає назвам файлів, указаним у *py_files*; ви можете змінити їх за допомогою *prefix* і *basedir*. *префікс* — це рядок, який буде видалено з імені кожного вихідного файлу, а *base_dir* — це ім’я каталогу, яке буде додано перед (після видалення *префікса*). Ви можете вказати один або обидва (або жоден) з *prefix* і *base_dir*, як хочете.

source: If *dry_run* is true, doesn't actually do anything that would affect the filesystem.
uk: Якщо *dry_run* має значення true, фактично не робить нічого, що могло б вплинути на файлову систему.

source: Byte-compilation is either done directly in this interpreter process with the standard :mod:`py_compile` module, or indirectly by writing a temporary script and executing it. Normally, you should let :func:`byte_compile` figure out to use direct compilation or not (see the source for details). The *direct* flag is used by the script generated in indirect mode; unless you know what you're doing, leave it set to ``None``.
uk: Компіляція байтів виконується або безпосередньо в цьому процесі інтерпретатора за допомогою стандартного модуля :mod:`py_compile`, або опосередковано шляхом написання тимчасового сценарію та його виконання. Зазвичай ви повинні дозволити :func:`byte_compile` визначити, використовувати пряму компіляцію чи ні (дивіться джерело для деталей). Прапор *прямий* використовується сценарієм, згенерованим у непрямому режимі; Якщо ви не знаєте, що робите, залиште значення ``None``.

source: Create ``.pyc`` files with an :func:`import magic tag <imp.get_tag>` in their name, in a :file:`__pycache__` subdirectory instead of files without tag in the current directory.
uk: Створюйте файли ``.pyc`` із :func:`магічним тегом імпорту <imp.get_tag>` у своєму імені в підкаталозі :file:`__pycache__` замість файлів без тегу в поточному каталозі.

source: Create ``.pyc`` files according to :pep:`488`.
uk: Створіть файли ``.pyc`` відповідно до :pep:`488`.

source: Return a version of *header* escaped for inclusion in an :rfc:`822` header, by ensuring there are 8 spaces space after each newline. Note that it does no other modification of the string.
uk: Повертає екрановану версію *заголовка* для включення в заголовок :rfc:`822`, переконавшись, що після кожного нового рядка є 8 пробілів. Зауважте, що він не виконує інших модифікацій рядка.

source: :mod:`distutils.dist` --- The Distribution class
uk: :mod:`distutils.dist` --- Клас розподілу

source: This module provides the :class:`~distutils.core.Distribution` class, which represents the module distribution being built/installed/distributed.
uk: Цей модуль надає клас :class:`~distutils.core.Distribution`, який представляє дистрибутив модуля, який створюється/встановлюється/розповсюджується.

source: :mod:`distutils.extension` --- The Extension class
uk: :mod:`distutils.extension` --- Клас розширення

source: This module provides the :class:`Extension` class, used to describe C/C++ extension modules in setup scripts.
uk: Цей модуль надає клас :class:`Extension`, який використовується для опису модулів розширення C/C++ у сценаріях налаштування.

source: :mod:`distutils.debug` --- Distutils debug mode
uk: :mod:`distutils.debug` --- Режим налагодження Distutils

source: This module provides the DEBUG flag.
uk: Цей модуль надає позначку DEBUG.

source: :mod:`distutils.errors` --- Distutils exceptions
uk: :mod:`distutils.errors` --- винятки Distutils

source: Provides exceptions used by the Distutils modules. Note that Distutils modules may raise standard exceptions; in particular, SystemExit is usually raised for errors that are obviously the end-user's fault (eg. bad command-line arguments).
uk: Надає винятки, які використовуються модулями Distutils. Зауважте, що модулі Distutils можуть викликати стандартні винятки; зокрема, SystemExit зазвичай викликається для помилок, які, очевидно, є помилкою кінцевого користувача (наприклад, неправильні аргументи командного рядка).

source: This module is safe to use in ``from ... import *`` mode; it only exports symbols whose names start with ``Distutils`` and end with ``Error``.
uk: Цей модуль безпечно використовувати в режимі ``from ... import *``; він експортує лише символи, імена яких починаються з ``Distutils`` і закінчуються ``Error``.

source: :mod:`distutils.fancy_getopt` --- Wrapper around the standard getopt module
uk: :mod:`distutils.fancy_getopt` --- Обгортка навколо стандартного модуля getopt

source: This module provides a wrapper around the standard :mod:`getopt` module that provides the following additional features:
uk: Цей модуль надає оболонку стандартного модуля :mod:`getopt`, яка надає наступні додаткові функції:

source: short and long options are tied together
uk: короткі і довгі варіанти зв'язуються разом

source: options have help strings, so :func:`fancy_getopt` could potentially create a complete usage summary
uk: параметри мають рядки довідки, тому :func:`fancy_getopt` потенційно може створити повний підсумок використання

source: options set attributes of a passed-in object
uk: параметри встановлюють атрибути переданого об'єкта

source: boolean options can have "negative aliases" --- eg. if :option:`!--quiet` is the "negative alias" of :option:`!--verbose`, then :option:`!--quiet` on the command line sets *verbose* to false.
uk: логічні параметри можуть мати "негативні псевдоніми" --- наприклад. якщо :option:`!--quiet` є "негативним псевдонімом" :option:`!--verbose`, тоді :option:`!--quiet` у командному рядку встановлює для *verbose* значення false.

source: Wrapper function. *options* is a list of ``(long_option, short_option, help_string)`` 3-tuples as described in the constructor for :class:`FancyGetopt`. *negative_opt* should be a dictionary mapping option names to option names, both the key and value should be in the *options* list. *object* is an object which will be used to store values (see the :meth:`getopt` method of the :class:`FancyGetopt` class). *args* is the argument list. Will use ``sys.argv[1:]`` if you pass ``None`` as *args*.
uk: Функція обгортки. *options* — це список ``(long_option, short_option, help_string)`` 3-кортежів, як описано в конструкторі для :class:`FancyGetopt`. *negative_opt* має бути словником, який зіставляє назви параметрів з назвами параметрів, і ключ, і значення мають бути в списку *параметрів*. *object* — це об’єкт, який використовуватиметься для зберігання значень (дивіться метод :meth:`getopt` класу :class:`FancyGetopt`). *args* — список аргументів. Використовуватиме ``sys.argv[1:]``, якщо ви передасте ``None`` як *args*.

source: Wraps *text* to less than *width* wide.
uk: Переносить *текст* на ширину менше *ширини*.

source: The option_table is a list of 3-tuples: ``(long_option, short_option, help_string)``
uk: Таблиця_опцій — це список із трьох кортежів: ``(long_option, short_option, help_string)``

source: If an option takes an argument, its *long_option* should have ``'='`` appended; *short_option* should just be a single character, no ``':'`` in any case. *short_option* should be ``None`` if a *long_option* doesn't have a corresponding *short_option*. All option tuples must have long options.
uk: Якщо параметр приймає аргумент, до його *long_option* має бути додано ``'='``; *short_option* має бути лише одним символом, ні в якому разі не ``':''``. *short_option* має бути ``None``, якщо *long_option* не має відповідного *short_option*. Усі кортежі параметрів повинні мати довгі параметри.

source: The :class:`FancyGetopt` class provides the following methods:
uk: Клас :class:`FancyGetopt` надає такі методи:

source: Parse command-line options in args. Store as attributes on *object*.
uk: Розібрати параметри командного рядка в args. Зберігати як атрибути на *об’єкті*.

source: If *args* is ``None`` or not supplied, uses ``sys.argv[1:]``. If *object* is ``None`` or not supplied, creates a new :class:`OptionDummy` instance, stores option values there, and returns a tuple ``(args, object)``. If *object* is supplied, it is modified in place and :func:`getopt` just returns *args*; in both cases, the returned *args* is a modified copy of the passed-in *args* list, which is left untouched.
uk: Якщо *args* має значення ``None`` або не надається, використовується ``sys.argv[1:]``. Якщо *object* має значення ``None`` або не надано, створює новий екземпляр :class:`OptionDummy`, зберігає там значення параметрів і повертає кортеж ``(args, object)``. Якщо надається *object*, він змінюється на місці, і :func:`getopt` просто повертає *args*; в обох випадках повернутий *args* є модифікованою копією переданого списку *args*, який залишається недоторканим.

source: Returns the list of ``(option, value)`` tuples processed by the previous run of :meth:`getopt` Raises :exc:`RuntimeError` if :meth:`getopt` hasn't been called yet.
uk: Повертає список кортежів ``(option, value)``, оброблених попереднім запуском :meth:`getopt` Викликає :exc:`RuntimeError`, якщо :meth:`getopt` ще не було викликано.

source: Generate help text (a list of strings, one per suggested line of output) from the option table for this :class:`FancyGetopt` object.
uk: Згенеруйте довідковий текст (список рядків, по одному на запропонований рядок виводу) з таблиці параметрів для цього об’єкта :class:`FancyGetopt`.

source: If supplied, prints the supplied *header* at the top of the help.
uk: Якщо надається, друкує наданий *заголовок* у верхній частині довідки.

source: :mod:`distutils.filelist` --- The FileList class
uk: :mod:`distutils.filelist` --- Клас FileList

source: This module provides the :class:`FileList` class, used for poking about the filesystem and building lists of files.
uk: Цей модуль надає клас :class:`FileList`, який використовується для вивчення файлової системи та створення списків файлів.

source: :mod:`distutils.log` --- Simple :pep:`282`-style logging
uk: :mod:`distutils.log` --- Просте журналювання у стилі :pep:`282`

source: :mod:`distutils.spawn` --- Spawn a sub-process
uk: :mod:`distutils.spawn` --- Створення підпроцесу

source: This module provides the :func:`spawn` function, a front-end to various platform-specific functions for launching another program in a sub-process. Also provides :func:`find_executable` to search the path for a given executable name.
uk: Цей модуль надає функцію :func:`spawn`, інтерфейс для різних функцій, специфічних для платформи, для запуску іншої програми в підпроцесі. Також надає :func:`find_executable` для пошуку шляху для вказаного імені виконуваного файлу.

source: :mod:`distutils.sysconfig` --- System configuration information
uk: :mod:`distutils.sysconfig` --- Інформація про конфігурацію системи

source: :mod:`distutils.sysconfig` has been merged into :mod:`sysconfig`.
uk: :mod:`distutils.sysconfig` було об’єднано в :mod:`sysconfig`.

source: The :mod:`distutils.sysconfig` module provides access to Python's low-level configuration information. The specific configuration variables available depend heavily on the platform and configuration. The specific variables depend on the build process for the specific version of Python being run; the variables are those found in the :file:`Makefile` and configuration header that are installed with Python on Unix systems. The configuration header is called :file:`pyconfig.h` for Python versions starting with 2.2, and :file:`config.h` for earlier versions of Python.
uk: Модуль :mod:`distutils.sysconfig` забезпечує доступ до низькорівневої конфігураційної інформації Python. Конкретні доступні змінні конфігурації значною мірою залежать від платформи та конфігурації. Конкретні змінні залежать від процесу збирання для конкретної версії Python, що виконується; змінні знаходяться в :file:`Makefile` та заголовку конфігурації, які встановлено разом з Python у системах Unix. Заголовок конфігурації називається :file:`pyconfig.h` для версій Python, починаючи з 2.2, і :file:`config.h` для попередніх версій Python.

source: Some additional functions are provided which perform some useful manipulations for other parts of the :mod:`distutils` package.
uk: Надаються деякі додаткові функції, які виконують деякі корисні маніпуляції для інших частин пакета :mod:`distutils`.

source: The result of ``os.path.normpath(sys.prefix)``.
uk: Результат ``os.path.normpath(sys.prefix)``.

source: The result of ``os.path.normpath(sys.exec_prefix)``.
uk: Результат ``os.path.normpath(sys.exec_prefix)``.

source: Return the value of a single variable. This is equivalent to ``get_config_vars().get(name)``.
uk: Повертає значення однієї змінної. Це еквівалентно ``get_config_vars().get(name)``.

source: Return a set of variable definitions. If there are no arguments, this returns a dictionary mapping names of configuration variables to values. If arguments are provided, they should be strings, and the return value will be a sequence giving the associated values. If a given name does not have a corresponding value, ``None`` will be included for that variable.
uk: Повертає набір визначень змінних. Якщо аргументів немає, повертається словник, який зіставляє імена змінних конфігурації зі значеннями. Якщо надано аргументи, вони мають бути рядками, а значення, що повертається, буде послідовністю, що надає пов’язані значення. Якщо задане ім’я не має відповідного значення, для цієї змінної буде включено значення "Немає".
