Repository: python/python-docs-uk
Catalog: distutils/apiref.po
Languages: uk

source: Returns the filename of the executable for the given *basename*. Typically for non-Windows platforms this is the same as the basename, while Windows will get a :file:`.exe` added.
uk: Повертає назву виконуваного файлу для заданого *базового імені*. Зазвичай для платформ, відмінних від Windows, це те саме, що й базове ім’я, у той час як Windows додаватиме :file:`.exe`.

source: Returns the filename for the given library name on the current platform. On Unix a library with *lib_type* of ``'static'`` will typically be of the form :file:`liblibname.a`, while a *lib_type* of ``'dynamic'`` will be of the form :file:`liblibname.so`.
uk: Повертає назву файлу для заданої назви бібліотеки на поточній платформі. В Unix бібліотека з *lib_type* ``'static'`` зазвичай матиме форму :file:`liblibname.a`, тоді як *lib_type* ``'dynamic'`` матиме форму: файл:`liblibname.so`.

source: Returns the name of the object files for the given source files. *source_filenames* should be a list of filenames.
uk: Повертає назву об’єктних файлів для заданих вихідних файлів. *source_filenames* має бути списком імен файлів.

source: Returns the name of a shared object file for the given file name *basename*.
uk: Повертає назву файлу спільного об’єкта для заданого імені *basename*.

source: Invokes :func:`distutils.util.execute`. This method invokes a Python function *func* with the given arguments *args*, after logging and taking into account the *dry_run* flag.
uk: Викликає :func:`distutils.util.execute`. Цей метод викликає функцію Python *func* із заданими аргументами *args* після реєстрації та з урахуванням прапора *dry_run*.

source: Invokes :func:`distutils.util.spawn`. This invokes an external process to run the given command.
uk: Викликає :func:`distutils.util.spawn`. Це викликає зовнішній процес для виконання даної команди.

source: Invokes :func:`distutils.dir_util.mkpath`. This creates a directory and any missing ancestor directories.
uk: Викликає :func:`distutils.dir_util.mkpath`. Це створює каталог і будь-які відсутні каталоги предків.

source: Invokes :meth:`distutils.file_util.move_file`. Renames *src* to *dst*.
uk: Викликає :meth:`distutils.file_util.move_file`. Перейменовує *src* на *dst*.

source: Write a message using :func:`distutils.log.debug`.
uk: Напишіть повідомлення за допомогою :func:`distutils.log.debug`.

source: Write a warning message *msg* to standard error.
uk: Напишіть попередження *msg* до стандартної помилки.

source: If the *debug* flag is set on this :class:`CCompiler` instance, print *msg* to standard output, otherwise do nothing.
uk: Якщо на цьому екземплярі :class:`CCompiler` встановлено прапор *debug*, виведіть *msg* у стандартний вихід, інакше нічого не робіть.

source: :mod:`distutils.unixccompiler` --- Unix C Compiler
uk: :mod:`distutils.unixccompiler` --- Компілятор Unix C

source: This module provides the :class:`UnixCCompiler` class, a subclass of :class:`CCompiler` that handles the typical Unix-style command-line C compiler:
uk: Цей модуль надає клас :class:`UnixCCompiler`, підклас :class:`CCompiler`, який обробляє типовий компілятор командного рядка C у стилі Unix:

source: macros defined with :option:`!-Dname[=value]`
uk: макроси, визначені за допомогою :option:`!-Dname[=value]`

source: macros undefined with :option:`!-Uname`
uk: макроси невизначені з :option:`!-Uname`

source: include search directories specified with :option:`!-Idir`
uk: включати каталоги пошуку, визначені за допомогою :option:`!-Idir`

source: libraries specified with :option:`!-llib`
uk: бібліотеки, визначені за допомогою :option:`!-llib`

source: library search directories specified with :option:`!-Ldir`
uk: каталоги пошуку бібліотек, указані за допомогою :option:`!-Ldir`

source: compile handled by :program:`cc` (or similar) executable with :option:`!-c` option: compiles :file:`.c` to :file:`.o`
uk: компілюється за допомогою :program:`cc` (або подібного) виконуваного файлу з опцією :option:`!-c`: компілює :file:`.c` до :file:`.o`

source: link static library handled by :program:`ar` command (possibly with :program:`ranlib`)
uk: зв’язати статичну бібліотеку, яка обробляється командою :program:`ar` (можливо, за допомогою :program:`ranlib`)

source: link shared library handled by :program:`cc` :option:`!-shared`
uk: посилання на спільну бібліотеку обробляється :program:`cc` :option:`!-shared`

source: :mod:`distutils.msvccompiler` --- Microsoft Compiler
uk: :mod:`distutils.msvccompiler` --- Компілятор Microsoft

source: This module provides :class:`MSVCCompiler`, an implementation of the abstract :class:`CCompiler` class for Microsoft Visual Studio. Typically, extension modules need to be compiled with the same compiler that was used to compile Python. For Python 2.3 and earlier, the compiler was Visual Studio 6. For Python 2.4 and 2.5, the compiler is Visual Studio .NET 2003.
uk: Цей модуль забезпечує :class:`MSVCCompiler`, реалізацію абстрактного :class:`CCompiler` класу для Microsoft Visual Studio. Як правило, модулі розширення потрібно скомпілювати за допомогою того самого компілятора, який використовувався для компіляції Python. Для Python 2.3 і раніших версій компілятором була Visual Studio 6. Для Python 2.4 і 2.5 компілятором була Visual Studio .NET 2003.

source: :class:`MSVCCompiler` will normally choose the right compiler, linker etc. on its own. To override this choice, the environment variables *DISTUTILS_USE_SDK* and *MSSdk* must be both set. *MSSdk* indicates that the current environment has been setup by the SDK's ``SetEnv.Cmd`` script, or that the environment variables had been registered when the SDK was installed; *DISTUTILS_USE_SDK* indicates that the distutils user has made an explicit choice to override the compiler selection by :class:`MSVCCompiler`.
uk: :class:`MSVCCompiler` зазвичай самостійно вибере правильний компілятор, компонувальник тощо. Щоб перевизначити цей вибір, потрібно встановити обидві змінні середовища *DISTUTILS_USE_SDK* і *MSSdk*. *MSSdk* вказує на те, що поточне середовище було налаштовано за допомогою сценарію ``SetEnv.Cmd`` SDK або що змінні середовища були зареєстровані під час встановлення SDK; *DISTUTILS_USE_SDK* вказує, що користувач distutils зробив явний вибір перевизначити вибір компілятора за допомогою :class:`MSVCCompiler`.

source: :mod:`distutils.bcppcompiler` --- Borland Compiler
uk: :mod:`distutils.bcppcompiler` --- Компілятор Borland

source: This module provides :class:`BorlandCCompiler`, a subclass of the abstract :class:`CCompiler` class for the Borland C++ compiler.
uk: Цей модуль надає :class:`BorlandCCompiler`, підклас абстрактного :class:`CCompiler` класу для компілятора Borland C++.

source: :mod:`distutils.cygwincompiler` --- Cygwin Compiler
uk: :mod:`distutils.cygwincompiler` --- компілятор Cygwin

source: This module provides the :class:`CygwinCCompiler` class, a subclass of :class:`UnixCCompiler` that handles the Cygwin port of the GNU C compiler to Windows. It also contains the Mingw32CCompiler class which handles the mingw32 port of GCC (same as cygwin in no-cygwin mode).
uk: Цей модуль надає клас :class:`CygwinCCompiler`, підклас :class:`UnixCCompiler`, який обробляє порт Cygwin компілятора GNU C для Windows. Він також містить клас Mingw32CCompiler, який обробляє порт mingw32 GCC (те саме, що cygwin у режимі без cygwin).

source: :mod:`distutils.archive_util` --- Archiving utilities
uk: :mod:`distutils.archive_util` --- Утиліти архівування

source: This module provides a few functions for creating archive files, such as tarballs or zipfiles.
uk: Цей модуль надає кілька функцій для створення архівних файлів, таких як tar-файли або zip-файли.

source: Create an archive file (eg. ``zip`` or ``tar``). *base_name* is the name of the file to create, minus any format-specific extension; *format* is the archive format: one of ``zip``, ``tar``, ``gztar``, ``bztar``, ``xztar``, or ``ztar``. *root_dir* is a directory that will be the root directory of the archive; ie. we typically ``chdir`` into *root_dir* before creating the archive. *base_dir* is the directory where we start archiving from; ie. *base_dir* will be the common prefix of all files and directories in the archive. *root_dir* and *base_dir* both default to the current directory. Returns the name of the archive file.
uk: Створіть архівний файл (наприклад, ``zip`` або ``tar``). *base_name* — це ім’я файлу, який потрібно створити, за вирахуванням розширення, що залежить від формату; *format* — це формат архіву: один із ``zip``, ``tar``, ``gztar``, ``bztar``, ``xztar`` або ``ztar``. *root_dir* – це каталог, який буде кореневим каталогом архіву; тобто. ми зазвичай ``chdir`` в *root_dir* перед створенням архіву. *base_dir* - це каталог, з якого ми починаємо архівування; тобто. *base_dir* буде загальним префіксом для всіх файлів і каталогів в архіві. *root_dir* і *base_dir* за замовчуванням є поточним каталогом. Повертає назву архівного файлу.

source: Added support for the ``xztar`` format.
uk: Додано підтримку формату ``xztar``.

source: 'Create an (optional compressed) archive as a tar file from all files in and under *base_dir*. *compress* must be ``'gzip'`` (the default), ``'bzip2'``, ``'xz'``, ``'compress'``, or ``None``. For the ``'compress'`` method the compression utility named by :program:`compress` must be on the default program search path, so this is probably Unix-specific. The output tar file will be named :file:`base_dir.tar`, possibly plus the appropriate compression extension (``.gz``, ``.bz2``, ``.xz`` or ``.Z``). Return the output filename.
uk: "Створіть (необов’язково стиснутий) архів як файл tar з усіх файлів у *base_dir* та під ним. *compress* має бути ``'gzip'`` (за замовчуванням), ``'bzip2'``, ``'xz'``, ``'compress'`` або ``None``. Для методу ``'стиснення''`` утиліта стиснення, названа :program:`compress`, має бути на шляху пошуку програми за замовчуванням, тому це, ймовірно, специфічно для Unix. Вихідний файл tar матиме назву :file:`base_dir.tar`, можливо, з додаванням відповідного розширення стиснення (``.gz``, ``.bz2``, ``.xz`` або ``.Z`` ). Повернути назву вихідного файлу.

source: Added support for the ``xz`` compression.
uk: Додано підтримку стиснення ``xz``.

source: Create a zip file from all files in and under *base_dir*. The output zip file will be named *base_name* + :file:`.zip`. Uses either the :mod:`zipfile` Python module (if available) or the InfoZIP :file:`zip` utility (if installed and found on the default search path). If neither tool is available, raises :exc:`DistutilsExecError`. Returns the name of the output zip file.
uk: Створіть файл zip з усіх файлів у *base_dir* і під ним. Вихідний zip-файл матиме назву *base_name* + :file:`.zip`. Використовує або модуль :mod:`zipfile` Python (якщо доступний), або утиліту InfoZIP :file:`zip` (якщо встановлено та знайдено на шляху пошуку за умовчанням). Якщо жоден інструмент недоступний, викликає :exc:`DistutilsExecError`. Повертає назву вихідного zip-файлу.

source: :mod:`distutils.dep_util` --- Dependency checking
uk: :mod:`distutils.dep_util` --- Перевірка залежностей

source: This module provides functions for performing simple, timestamp-based dependency of files and groups of files; also, functions based entirely on such timestamp dependency analysis.
uk: Цей модуль надає функції для виконання простої залежності файлів і груп файлів на основі часових позначок; також функції, повністю засновані на такому аналізі залежностей часових позначок.

source: Return true if *source* exists and is more recently modified than *target*, or if *source* exists and *target* doesn't. Return false if both exist and *target* is the same age or newer than *source*. Raise :exc:`DistutilsFileError` if *source* does not exist.
uk: Повертає істину, якщо *джерело* існує та змінено нещодавно, ніж *ціль*, або якщо *джерело* існує, а *ціль* ні. Повертає false, якщо обидва існують і *ціль* має той самий вік або новіший, ніж *джерело*. Викликати :exc:`DistutilsFileError`, якщо *джерело* не існує.

source: Walk two filename lists in parallel, testing if each source is newer than its corresponding target. Return a pair of lists (*sources*, *targets*) where source is newer than target, according to the semantics of :func:`newer`.
uk: Перегляньте два списки імен файлів паралельно, перевіряючи, чи кожне джерело є новішим за відповідну ціль. Повертає пару списків (*джерела*, *цілі*), де джерело є новішим за ціль, відповідно до семантики :func:`newer`.

source: Return true if *target* is out-of-date with respect to any file listed in *sources*. In other words, if *target* exists and is newer than every file in *sources*, return false; otherwise return true. *missing* controls what we do when a source file is missing; the default (``'error'``) is to blow up with an :exc:`OSError` from inside :func:`os.stat`; if it is ``'ignore'``, we silently drop any missing source files; if it is ``'newer'``, any missing source files make us assume that *target* is out-of-date (this is handy in "dry-run" mode: it'll make you pretend to carry out commands that wouldn't work because inputs are missing, but that doesn't matter because you're not actually going to run the commands).
uk: Повертає true, якщо *target* застарів щодо будь-якого файлу, зазначеного в *джерелах*. Іншими словами, якщо *target* існує і є новішим за всі файли в *sources*, поверніть false; інакше повертає true. *missing* контролює те, що ми робимо, коли вихідний файл відсутній; за замовчуванням (``'помилка'``) вибухає з :exc:`OSError` зсередини :func:`os.stat`; якщо це ``'ignore''``, ми мовчки видаляємо всі відсутні джерельні файли; якщо він ``'новіший'``, будь-які відсутні вихідні файли змушують нас вважати, що *target* застарів (це зручно в режимі "сухого запуску": це змусить вас вдавати, що ви виконуєте команди це не спрацює, оскільки вхідні дані відсутні, але це не має значення, оскільки ви насправді не збираєтеся виконувати команди).

source: :mod:`distutils.dir_util` --- Directory tree operations
uk: :mod:`distutils.dir_util` --- Операції з деревом каталогів

source: This module provides functions for operating on directories and trees of directories.
uk: Цей модуль надає функції для роботи з каталогами та деревами каталогів.

source: Create a directory and any missing ancestor directories. If the directory already exists (or if *name* is the empty string, which means the current directory, which of course exists), then do nothing. Raise :exc:`DistutilsFileError` if unable to create some directory along the way (eg. some sub-path exists, but is a file rather than a directory). If *verbose* is true, print a one-line summary of each mkdir to stdout. Return the list of directories actually created.
uk: Створіть каталог і будь-які відсутні каталоги предків. Якщо каталог уже існує (або якщо *name* є порожнім рядком, що означає поточний каталог, який, звичайно, існує), тоді нічого не робити. Викликати :exc:`DistutilsFileError`, якщо неможливо створити певний каталог (наприклад, якийсь підшлях існує, але це файл, а не каталог). Якщо *verbose* має значення true, вивести однорядковий підсумок кожного mkdir у стандартний вихід. Повертає список фактично створених каталогів.

source: Create all the empty directories under *base_dir* needed to put *files* there. *base_dir* is just the name of a directory which doesn't necessarily exist yet; *files* is a list of filenames to be interpreted relative to *base_dir*. *base_dir* + the directory portion of every file in *files* will be created if it doesn't already exist. *mode*, *verbose* and *dry_run* flags are as for :func:`mkpath`.
uk: Створіть усі порожні каталоги в *base_dir*, необхідні для розміщення туди *файлів*. *base_dir* — це просто назва каталогу, який ще не обов’язково існує; *files* — це список імен файлів, які слід інтерпретувати відносно *base_dir*. *base_dir* + частина каталогу кожного файлу в *files* буде створена, якщо вона ще не існує. Прапори *mode*, *verbose* і *dry_run* такі ж, як і для :func:`mkpath`.

source: Copy an entire directory tree *src* to a new location *dst*. Both *src* and *dst* must be directory names. If *src* is not a directory, raise :exc:`DistutilsFileError`. If *dst* does not exist, it is created with :func:`mkpath`. The end result of the copy is that every file in *src* is copied to *dst*, and directories under *src* are recursively copied to *dst*. Return the list of files that were copied or might have been copied, using their output name. The return value is unaffected by *update* or *dry_run*: it is simply the list of all files under *src*, with the names changed to be under *dst*.
uk: Скопіюйте все дерево каталогів *src* до нового розташування *dst*. І *src*, і *dst* мають бути іменами каталогів. Якщо *src* не є каталогом, викликайте :exc:`DistutilsFileError`. Якщо *dst* не існує, він створюється за допомогою :func:`mkpath`. Кінцевим результатом копіювання є те, що кожен файл у *src* копіюється в *dst*, а каталоги в *src* рекурсивно копіюються в *dst*. Повертає список файлів, які були скопійовані або могли бути скопійовані, використовуючи їхні вихідні назви. На повернене значення не впливають *update* або *dry_run*: це просто список усіх файлів у *src*, імена яких змінено на *dst*.

source: *preserve_mode* and *preserve_times* are the same as for :func:`distutils.file_util.copy_file`; note that they only apply to regular files, not to directories. If *preserve_symlinks* is true, symlinks will be copied as symlinks (on platforms that support them!); otherwise (the default), the destination of the symlink will be copied. *update* and *verbose* are the same as for :func:`copy_file`.
uk: *preserve_mode* і *preserve_times* такі самі, як і для :func:`distutils.file_util.copy_file`; зауважте, що вони застосовуються лише до звичайних файлів, а не до каталогів. Якщо *preserve_symlinks* має значення true, символічні посилання буде скопійовано як символічні посилання (на платформах, які їх підтримують!); інакше (за замовчуванням) місце призначення символічного посилання буде скопійовано. *update* і *verbose* такі самі, як і для :func:`copy_file`.

source: Files in *src* that begin with :file:`.nfs` are skipped (more information on these files is available in answer D2 of the `NFS FAQ page <http://nfs.sourceforge.net/#section_d>`_).
uk: Файли в *src*, які починаються з :file:`.nfs`, пропускаються (додаткову інформацію про ці файли можна знайти у відповіді D2 на сторінці `NFS FAQ <http://nfs.sourceforge.net/#section_d>`_).

source: NFS files are ignored.
uk: Файли NFS ігноруються.

source: Recursively remove *directory* and all files and directories underneath it. Any errors are ignored (apart from being reported to ``sys.stdout`` if *verbose* is true).
uk: Рекурсивно видаліть *каталог* і всі файли та каталоги під ним. Будь-які помилки ігноруються (крім повідомлень у ``sys.stdout``, якщо *verbose* має значення true).

source: :mod:`distutils.file_util` --- Single file operations
uk: :mod:`distutils.file_util` --- Операції з одним файлом

source: This module contains some utility functions for operating on individual files.
uk: Цей модуль містить деякі службові функції для роботи з окремими файлами.

source: Copy file *src* to *dst*. If *dst* is a directory, then *src* is copied there with the same name; otherwise, it must be a filename. (If the file exists, it will be ruthlessly clobbered.) If *preserve_mode* is true (the default), the file's mode (type and permission bits, or whatever is analogous on the current platform) is copied. If *preserve_times* is true (the default), the last-modified and last-access times are copied as well. If *update* is true, *src* will only be copied if *dst* does not exist, or if *dst* does exist but is older than *src*.
uk: Скопіюйте файл *src* в *dst*. Якщо *dst* є каталогом, то *src* копіюється туди з таким же ім’ям; інакше це має бути ім'я файлу. (Якщо файл існує, його буде безжально знищено.) Якщо *preserve_mode* має значення true (за замовчуванням), режим файлу (тип і біти дозволу або щось аналогічне на поточній платформі) копіюється. Якщо *preserve_times* має значення true (за замовчуванням), час останньої зміни та останнього доступу також копіюється. Якщо *update* має значення true, *src* буде скопійовано, лише якщо *dst* не існує, або якщо *dst* існує, але він старіший за *src*.

source: *link* allows you to make hard links (using :func:`os.link`) or symbolic links (using :func:`os.symlink`) instead of copying: set it to ``'hard'`` or ``'sym'``; if it is ``None`` (the default), files are copied. Don't set *link* on systems that don't support it: :func:`copy_file` doesn't check if hard or symbolic linking is available. It uses :func:`_copy_file_contents` to copy file contents.
uk: *link* дозволяє створювати жорсткі посилання (за допомогою :func:`os.link`) або символічні посилання (за допомогою :func:`os.symlink`) замість копіювання: установіть значення ``'hard'`` або ``'сим'``; якщо значення ``None`` (за замовчуванням), файли копіюються. Не встановлюйте *посилання* на системах, які його не підтримують: :func:`copy_file` не перевіряє наявність жорсткого чи символічного зв’язування. Він використовує :func:`_copy_file_contents` для копіювання вмісту файлу.

source: Return a tuple ``(dest_name, copied)``: *dest_name* is the actual name of the output file, and *copied* is true if the file was copied (or would have been copied, if *dry_run* true).
uk: Повертає кортеж ``(dest_name, copied)``: *dest_name* є фактичною назвою вихідного файлу, а *copied* має значення true, якщо файл було скопійовано (або було б скопійовано, якщо *dry_run* true).

source: Move file *src* to *dst*. If *dst* is a directory, the file will be moved into it with the same name; otherwise, *src* is just renamed to *dst*. Returns the new full name of the file.
uk: Перемістити файл *src* до *dst*. Якщо *dst* є каталогом, файл буде переміщено до нього з таким же ім'ям; інакше *src* просто перейменовується на *dst*. Повертає нову повну назву файлу.

source: Handles cross-device moves on Unix using :func:`copy_file`. What about other systems?
uk: Обробляє переміщення між пристроями в Unix за допомогою :func:`copy_file`. А як щодо інших систем?

source: Create a file called *filename* and write *contents* (a sequence of strings without line terminators) to it.
uk: Створіть файл під назвою *filename* і запишіть у нього *contents* (послідовність рядків без символів закінчення рядків).

source: :mod:`distutils.util` --- Miscellaneous other utility functions
uk: :mod:`distutils.util` --- Інші інші службові функції

source: This module contains other assorted bits and pieces that don't fit into any other utility module.
uk: Цей модуль містить інші різні частини, які не підходять до жодного іншого службового модуля.

source: Return a string that identifies the current platform. This is used mainly to distinguish platform-specific build directories and platform-specific built distributions. Typically includes the OS name and version and the architecture (as supplied by 'os.uname()'), although the exact information included depends on the OS; e.g., on Linux, the kernel version isn't particularly important.
uk: Повертає рядок, що ідентифікує поточну платформу. Це використовується в основному для того, щоб розрізнити каталоги збірок для певної платформи та побудовані дистрибутиви для конкретної платформи. Зазвичай включає назву та версію ОС та архітектуру (як надає 'os.uname()'), хоча точна включена інформація залежить від ОС; наприклад, у Linux версія ядра не особливо важлива.

source: Examples of returned values:
uk: Приклади повернених значень:

source: ``linux-alpha``
uk: ``linux-альфа``

source: For non-POSIX platforms, currently just returns ``sys.platform``.
uk: Для платформ, відмінних від POSIX, наразі повертає лише ``sys.platform``.
