Repository: python/python-docs-uk
Catalog: distutils/apiref.po
Languages: uk

source: :mod:`distutils.command.build_clib` --- Build any C libraries in a package
uk: :mod:`distutils.command.build_clib` --- Збірка будь-яких бібліотек C у пакунок

source: :mod:`distutils.command.build_ext` --- Build any extensions in a package
uk: :mod:`distutils.command.build_ext` --- Створення будь-яких розширень у пакеті

source: :mod:`distutils.command.build_py` --- Build the .py/.pyc files of a package
uk: :mod:`distutils.command.build_py` --- Створення файлів .py/.pyc пакета

source: Alternative implementation of build_py which also runs the 2to3 conversion library on each .py file that is going to be installed. To use this in a setup.py file for a distribution that is designed to run with both Python 2.x and 3.x, add::
uk: Альтернативна реалізація build_py, яка також запускає бібліотеку перетворення 2to3 для кожного файлу .py, який буде встановлено. Щоб використовувати це у файлі setup.py для дистрибутива, призначеного для роботи з Python 2.x і 3.x, додайте::

source: to your setup.py, and later::
uk: до вашого setup.py, а пізніше::

source: to the invocation of setup().
uk: до виклику setup().

source: :mod:`distutils.command.build_scripts` --- Build the scripts of a package
uk: :mod:`distutils.command.build_scripts` --- Збірка сценаріїв пакета

source: :mod:`distutils.command.clean` --- Clean a package build area
uk: :mod:`distutils.command.clean` --- Очистити область збірки пакета

source: This command removes the temporary files created by :command:`build` and its subcommands, like intermediary compiled object files. With the ``--all`` option, the complete build directory will be removed.
uk: Ця команда видаляє тимчасові файли, створені :command:`build` та його підкомандами, як-от проміжні скомпільовані об’єктні файли. З опцією ``--all`` буде видалено повний каталог збірки.

source: Extension modules built :ref:`in place <distutils-build-ext-inplace>` will not be cleaned, as they are not in the build directory.
uk: Модулі розширення, створені :ref:`in place <distutils-build-ext-inplace>`, не будуть очищені, оскільки їх немає в каталозі збірки.

source: :mod:`distutils.command.config` --- Perform package configuration
uk: :mod:`distutils.command.config` --- Виконати налаштування пакета

source: :mod:`distutils.command.install` --- Install a package
uk: :mod:`distutils.command.install` --- Встановити пакет

source: :mod:`distutils.command.install_data` --- Install data files from a package
uk: :mod:`distutils.command.install_data` --- Встановити файли даних із пакета

source: :mod:`distutils.command.install_headers` --- Install C/C++ header files from a package
uk: :mod:`distutils.command.install_headers` --- Встановити файли заголовків C/C++ із пакета

source: :mod:`distutils.command.install_lib` --- Install library files from a package
uk: :mod:`distutils.command.install_lib` --- Встановити файли бібліотеки з пакета

source: :mod:`distutils.command.install_scripts` --- Install script files from a package
uk: :mod:`distutils.command.install_scripts` --- Встановити файли сценарію з пакета

source: :mod:`distutils.command.register` --- Register a module with the Python Package Index
uk: :mod:`distutils.command.register` --- Реєстрація модуля в індексі пакетів Python

source: The ``register`` command registers the package with the Python Package Index. This is described in more detail in :pep:`301`.
uk: Команда ``register`` реєструє пакет в індексі пакетів Python. Це описано більш детально в :pep:`301`.

source: :mod:`distutils.command.check` --- Check the meta-data of a package
uk: :mod:`distutils.command.check` --- Перевірити метадані пакета

source: The ``check`` command performs some tests on the meta-data of a package. For example, it verifies that all required meta-data are provided as the arguments passed to the :func:`setup` function.
uk: Команда ``check`` виконує деякі перевірки метаданих пакета. Наприклад, він перевіряє, що всі необхідні метадані надано як аргументи, передані до функції :func:`setup`.
