Repository: python/python-docs-uk
Catalog: distutils/apiref.po
Languages: uk

source: Add *dir* to the list of directories that will be searched for header files. The compiler is instructed to search directories in the order in which they are supplied by successive calls to :meth:`add_include_dir`.
uk: Додайте *dir* до списку каталогів, у яких здійснюватиметься пошук файлів заголовків. Компілятор отримує вказівку шукати каталоги в тому порядку, в якому вони надаються послідовними викликами :meth:`add_include_dir`.

source: Set the list of directories that will be searched to *dirs* (a list of strings). Overrides any preceding calls to :meth:`add_include_dir`; subsequent calls to :meth:`add_include_dir` add to the list passed to :meth:`set_include_dirs`. This does not affect any list of standard include directories that the compiler may search by default.
uk: Встановіть список каталогів, у яких здійснюватиметься пошук, як *dirs* (список рядків). Перевизначає будь-які попередні виклики :meth:`add_include_dir`; наступні виклики :meth:`add_include_dir` додають до списку, переданого :meth:`set_include_dirs`. Це не впливає на список каталогів стандартного включення, які компілятор може шукати за замовчуванням.

source: Add *libname* to the list of libraries that will be included in all links driven by this compiler object. Note that *libname* should \*not\* be the name of a file containing a library, but the name of the library itself: the actual filename will be inferred by the linker, the compiler, or the compiler class (depending on the platform).
uk: Додайте *libname* до списку бібліотек, які будуть включені в усі посилання, керовані цим об’єктом компілятора. Зауважте, що *libname* має \*не\* бути назвою файлу, що містить бібліотеку, а назвою самої бібліотеки: фактичне ім’я файлу буде визначено компонувальником, компілятором або класом компілятора (залежно від платформа).

source: The linker will be instructed to link against libraries in the order they were supplied to :meth:`add_library` and/or :meth:`set_libraries`. It is perfectly valid to duplicate library names; the linker will be instructed to link against libraries as many times as they are mentioned.
uk: Пов’язувач отримає вказівку зв’язувати бібліотеки в тому порядку, в якому вони були надані в :meth:`add_library` та/або :meth:`set_libraries`. Цілком допустимо дублювати імена бібліотек; компонувальник отримає вказівку створити зв’язок із бібліотеками стільки разів, скільки вони згадуються.

source: Set the list of libraries to be included in all links driven by this compiler object to *libnames* (a list of strings). This does not affect any standard system libraries that the linker may include by default.
uk: Встановіть список бібліотек, які будуть включені в усі посилання, керовані цим об’єктом компілятора, як *libnames* (список рядків). Це не впливає на стандартні системні бібліотеки, які компонувальник може включати за замовчуванням.

source: Add *dir* to the list of directories that will be searched for libraries specified to :meth:`add_library` and :meth:`set_libraries`. The linker will be instructed to search for libraries in the order they are supplied to :meth:`add_library_dir` and/or :meth:`set_library_dirs`.
uk: Додайте *dir* до списку каталогів, у яких здійснюватиметься пошук бібліотек, указаних у :meth:`add_library` і :meth:`set_libraries`. Пов’язувач отримає вказівку шукати бібліотеки в тому порядку, в якому вони надані в :meth:`add_library_dir` та/або :meth:`set_library_dirs`.

source: Set the list of library search directories to *dirs* (a list of strings). This does not affect any standard library search path that the linker may search by default.
uk: Встановіть список каталогів пошуку бібліотек на *dirs* (список рядків). Це не впливає на будь-який стандартний шлях пошуку бібліотеки, який компонувальник може шукати за замовчуванням.

source: Add *dir* to the list of directories that will be searched for shared libraries at runtime.
uk: Додайте *dir* до списку каталогів, у яких здійснюватиметься пошук спільних бібліотек під час виконання.

source: Set the list of directories to search for shared libraries at runtime to *dirs* (a list of strings). This does not affect any standard search path that the runtime linker may search by default.
uk: Встановіть список каталогів для пошуку спільних бібліотек під час виконання на *dirs* (список рядків). Це не впливає на будь-який стандартний шлях пошуку, який компонувальник під час виконання може шукати за замовчуванням.

source: Define a preprocessor macro for all compilations driven by this compiler object. The optional parameter *value* should be a string; if it is not supplied, then the macro will be defined without an explicit value and the exact outcome depends on the compiler used.
uk: Визначте макрос препроцесора для всіх компіляцій, керованих цим об’єктом компілятора. Додатковий параметр *value* має бути рядком; якщо він не наданий, то макрос буде визначено без явного значення, і точний результат залежить від використовуваного компілятора.

source: Undefine a preprocessor macro for all compilations driven by this compiler object. If the same macro is defined by :meth:`define_macro` and undefined by :meth:`undefine_macro` the last call takes precedence (including multiple redefinitions or undefinitions). If the macro is redefined/undefined on a per-compilation basis (ie. in the call to :meth:`compile`), then that takes precedence.
uk: Скасуйте визначення макросу препроцесора для всіх компіляцій, керованих цим об’єктом компілятора. Якщо той самий макрос визначено :meth:`define_macro` і не визначено :meth:`undefine_macro`, останній виклик має перевагу (включно з кількома перевизначеннями або невизначеннями). Якщо макрос перевизначено/не визначено на основі кожної компіляції (тобто під час виклику :meth:`compile`), то він має перевагу.

source: Add *object* to the list of object files (or analogues, such as explicitly named library files or the output of "resource compilers") to be included in every link driven by this compiler object.
uk: Додайте *об’єкт* до списку об’єктних файлів (або аналогів, таких як бібліотечні файли з явною назвою або вихідні дані "компіляторів ресурсів"), які будуть включені в кожне посилання, кероване цим об’єктом компілятора.

source: Set the list of object files (or analogues) to be included in every link to *objects*. This does not affect any standard object files that the linker may include by default (such as system libraries).
uk: Встановіть список об’єктних файлів (або аналогів), які будуть включені до кожного посилання на *об’єкти*. Це не впливає на будь-які стандартні об’єктні файли, які компонувальник може включати за замовчуванням (наприклад, системні бібліотеки).

source: The following methods implement methods for autodetection of compiler options, providing some functionality similar to GNU :program:`autoconf`.
uk: Наступні методи реалізують методи для автоматичного визначення параметрів компілятора, надаючи деякі функції, подібні до GNU :program:`autoconf`.

source: Detect the language of a given file, or list of files. Uses the instance attributes :attr:`language_map` (a dictionary), and :attr:`language_order` (a list) to do the job.
uk: Визначити мову певного файлу або списку файлів. Використовує атрибути екземпляра :attr:`language_map` (словник) і :attr:`language_order` (список) для виконання завдання.

source: Search the specified list of directories for a static or shared library file *lib* and return the full path to that file. If *debug* is true, look for a debugging version (if that makes sense on the current platform). Return ``None`` if *lib* wasn't found in any of the specified directories.
uk: Знайдіть у вказаному списку каталогів файл статичної або спільної бібліотеки *lib* і поверніть повний шлях до цього файлу. Якщо *debug* має значення true, знайдіть версію для налагодження (якщо це має сенс на поточній платформі). Повертає ``None``, якщо *lib* не знайдено в жодному з указаних каталогів.

source: Return a boolean indicating whether *funcname* is supported on the current platform. The optional arguments can be used to augment the compilation environment by providing additional include files and paths and libraries and paths.
uk: Повертає логічне значення, яке вказує, чи підтримується *funcname* на поточній платформі. Необов’язкові аргументи можна використовувати для розширення середовища компіляції шляхом надання додаткових файлів і шляхів, а також бібліотек і шляхів.

source: Return the compiler option to add *dir* to the list of directories searched for libraries.
uk: Повернути опцію компілятора, щоб додати *dir* до списку каталогів, у яких шукаються бібліотеки.

source: Return the compiler option to add *lib* to the list of libraries linked into the shared library or executable.
uk: Поверніть опцію компілятора, щоб додати *lib* до списку бібліотек, пов’язаних із спільною бібліотекою або виконуваним файлом.

source: Return the compiler option to add *dir* to the list of directories searched for runtime libraries.
uk: Поверніть опцію компілятора, щоб додати *dir* до списку каталогів, у яких шукаються бібліотеки середовища виконання.

source: Define the executables (and options for them) that will be run to perform the various stages of compilation. The exact set of executables that may be specified here depends on the compiler class (via the 'executables' class attribute), but most will have:
uk: Визначте виконувані файли (і параметри для них), які будуть запущені для виконання різних етапів компіляції. Точний набір виконуваних файлів, який можна вказати тут, залежить від класу компілятора (через атрибут класу 'executables'), але більшість матиме:

source: attribute
uk: атрибут

source: *compiler*
uk: *компілятор*

source: the C/C++ compiler
uk: компілятор C/C++

source: linker used to create shared objects and libraries
uk: компонувальник, який використовується для створення спільних об’єктів і бібліотек

source: linker used to create binary executables
uk: компонувальник, який використовується для створення двійкових виконуваних файлів

source: *archiver*
uk: *архіватор*

source: static library creator
uk: творець статичної бібліотеки

source: On platforms with a command-line (Unix, DOS/Windows), each of these is a string that will be split into executable name and (optional) list of arguments. (Splitting the string is done similarly to how Unix shells operate: words are delimited by spaces, but quotes and backslashes can override this. See :func:`distutils.util.split_quoted`.)
uk: На платформах із командним рядком (Unix, DOS/Windows) кожен із них є рядком, який буде розділено на ім’я виконуваного файлу та (необов’язковий) список аргументів. (Поділ рядка виконується подібно до того, як працюють оболонки Unix: слова розділені пробілами, але лапки та зворотні косі риски можуть замінити це. Див. :func:`distutils.util.split_quoted`.)

source: The following methods invoke stages in the build process.
uk: Наступні методи викликають етапи процесу побудови.

source: Compile one or more source files. Generates object files (e.g. transforms a :file:`.c` file to a :file:`.o` file.)
uk: Скомпілюйте один або кілька вихідних файлів. Створює об’єктні файли (наприклад, перетворює файл :file:`.c` на файл :file:`.o`.)

source: *sources* must be a list of filenames, most likely C/C++ files, but in reality anything that can be handled by a particular compiler and compiler class (eg. :class:`MSVCCompiler` can handle resource files in *sources*). Return a list of object filenames, one per source filename in *sources*. Depending on the implementation, not all source files will necessarily be compiled, but all corresponding object filenames will be returned.
uk: *джерела* мають бути списком імен файлів, швидше за все файлів C/C++, але насправді все, що може оброблятися певним компілятором і класом компілятора (наприклад, :class:`MSVCCompiler` може обробляти файли ресурсів у *джерелах*) . Повертає список імен файлів об’єктів, по одному на ім’я вихідного файлу в *джерелах*. Залежно від реалізації, не всі вихідні файли обов’язково будуть скомпільовані, але будуть повернуті всі відповідні імена файлів об’єктів.

source: If *output_dir* is given, object files will be put under it, while retaining their original path component. That is, :file:`foo/bar.c` normally compiles to :file:`foo/bar.o` (for a Unix implementation); if *output_dir* is *build*, then it would compile to :file:`build/foo/bar.o`.
uk: Якщо задано *output_dir*, об’єктні файли буде розміщено під ним, зберігаючи при цьому їхній початковий компонент шляху. Тобто :file:`foo/bar.c` зазвичай компілюється до :file:`foo/bar.o` (для реалізації Unix); якщо *output_dir* є *build*, тоді він скомпілюється до :file:`build/foo/bar.o`.

source: *macros*, if given, must be a list of macro definitions. A macro definition is either a ``(name, value)`` 2-tuple or a ``(name,)`` 1-tuple. The former defines a macro; if the value is ``None``, the macro is defined without an explicit value. The 1-tuple case undefines a macro. Later definitions/redefinitions/undefinitions take precedence.
uk: *макроси*, якщо вказано, мають бути списком визначень макросів. Визначення макросу – це 2-кортеж ``(ім’я, значення)" або 1-кортеж ``(ім’я,)``. Перший визначає макрос; якщо значенням є ``None``, макрос визначено без явного значення. Випадок 1-кортежу не визначає макрос. Пізніші визначення/перевизначення/невизначення мають пріоритет.

source: *include_dirs*, if given, must be a list of strings, the directories to add to the default include file search path for this compilation only.
uk: *include_dirs*, якщо задано, має бути списком рядків, каталогів, які потрібно додати до шляху пошуку файлів за замовчуванням лише для цієї компіляції.

source: *debug* is a boolean; if true, the compiler will be instructed to output debug symbols in (or alongside) the object file(s).
uk: *debug* є логічним; якщо істина, компілятор отримає вказівку вивести символи налагодження в (або поруч) з об’єктним файлом(ами).

source: *extra_preargs* and *extra_postargs* are implementation-dependent. On platforms that have the notion of a command-line (e.g. Unix, DOS/Windows), they are most likely lists of strings: extra command-line arguments to prepend/append to the compiler command line. On other platforms, consult the implementation class documentation. In any event, they are intended as an escape hatch for those occasions when the abstract compiler framework doesn't cut the mustard.
uk: *extra_preargs* і *extra_postargs* залежать від реалізації. На платформах, які мають поняття командного рядка (наприклад, Unix, DOS/Windows), це, швидше за все, списки рядків: додаткові аргументи командного рядка для додавання перед/до командного рядка компілятора. На інших платформах зверніться до документації класу реалізації. У будь-якому випадку, вони призначені як аварійний люк у тих випадках, коли структура абстрактного компілятора не вирішує проблеми.

source: *depends*, if given, is a list of filenames that all targets depend on. If a source file is older than any file in depends, then the source file will be recompiled. This supports dependency tracking, but only at a coarse granularity.
uk: *depends*, якщо вказано, це список імен файлів, від яких залежать усі цілі. Якщо вихідний файл старіший за будь-який файл у залежностях, вихідний файл буде перекомпільовано. Це підтримує відстеження залежностей, але лише з грубою деталізацією.

source: Raises :exc:`CompileError` on failure.
uk: Викликає :exc:`CompileError` у разі помилки.

source: Link a bunch of stuff together to create a static library file. The "bunch of stuff" consists of the list of object files supplied as *objects*, the extra object files supplied to :meth:`add_link_object` and/or :meth:`set_link_objects`, the libraries supplied to :meth:`add_library` and/or :meth:`set_libraries`, and the libraries supplied as *libraries* (if any).
uk: Зв’яжіть купу матеріалів разом, щоб створити файл статичної бібліотеки. "Кучка речей" складається зі списку об’єктних файлів, наданих як *objects*, додаткових об’єктних файлів, наданих у :meth:`add_link_object` та/або :meth:`set_link_objects`, бібліотек, наданих у :meth:`add_library` та/або :meth:`set_libraries`, а також бібліотеки, що надаються як *бібліотеки* (якщо такі є).

source: *output_libname* should be a library name, not a filename; the filename will be inferred from the library name. *output_dir* is the directory where the library file will be put.
uk: *output_libname* має бути назвою бібліотеки, а не назвою файлу; ім'я файлу буде виведено з назви бібліотеки. *output_dir* - це каталог, куди буде розміщено файл бібліотеки.

source: *debug* is a boolean; if true, debugging information will be included in the library (note that on most platforms, it is the compile step where this matters: the *debug* flag is included here just for consistency).
uk: *debug* є логічним; якщо true, інформація про налагодження буде включена в бібліотеку (зауважте, що на більшості платформ це має значення на етапі компіляції: прапор *debug* включено тут лише для узгодженості).

source: *target_lang* is the target language for which the given objects are being compiled. This allows specific linkage time treatment of certain languages.
uk: *target_lang* — цільова мова, для якої компілюються ці об’єкти. Це дозволяє обробку певних мов у певний час зв’язування.

source: Raises :exc:`LibError` on failure.
uk: Викликає :exc:`LibError` у разі помилки.

source: Link a bunch of stuff together to create an executable or shared library file.
uk: Пов’яжіть купу матеріалів разом, щоб створити виконуваний файл або файл спільної бібліотеки.

source: The "bunch of stuff" consists of the list of object files supplied as *objects*. *output_filename* should be a filename. If *output_dir* is supplied, *output_filename* is relative to it (i.e. *output_filename* can provide directory components if needed).
uk: "Кучка речей" складається зі списку об'єктних файлів, які надаються як *об'єкти*. *вихідна_назва_файлу* має бути назвою файлу. Якщо вказано *output_dir*, *output_filename* є відносно нього (тобто *output_filename* може надати компоненти каталогу, якщо це необхідно).

source: *libraries* is a list of libraries to link against. These are library names, not filenames, since they're translated into filenames in a platform-specific way (eg. *foo* becomes :file:`libfoo.a` on Unix and :file:`foo.lib` on DOS/Windows). However, they can include a directory component, which means the linker will look in that specific directory rather than searching all the normal locations.
uk: *libraries* — це список бібліотек, з якими можна посилатися. Це назви бібліотек, а не назви файлів, оскільки вони перекладаються на назви файлів залежно від платформи (наприклад, *foo* стає :file:`libfoo.a` в Unix і :file:`foo.lib` в DOS/ вікна). Однак вони можуть містити компонент каталогу, що означає, що компонувальник шукатиме в цьому конкретному каталозі, а не шукатиме у всіх звичайних місцях.

source: *library_dirs*, if supplied, should be a list of directories to search for libraries that were specified as bare library names (ie. no directory component). These are on top of the system default and those supplied to :meth:`add_library_dir` and/or :meth:`set_library_dirs`. *runtime_library_dirs* is a list of directories that will be embedded into the shared library and used to search for other shared libraries that \*it\* depends on at run-time. (This may only be relevant on Unix.)
uk: *library_dirs*, якщо надається, має бути списком каталогів для пошуку бібліотек, які були вказані як голі імена бібліотек (тобто без компонента каталогу). Вони є поверх системних стандартних і тих, що надаються до :meth:`add_library_dir` та/або :meth:`set_library_dirs`. *runtime_library_dirs* — це список каталогів, які будуть вбудовані в спільну бібліотеку та використовуватимуться для пошуку інших спільних бібліотек, від яких \*вона\* залежить під час виконання. (Це може бути актуальним лише для Unix.)

source: *export_symbols* is a list of symbols that the shared library will export. (This appears to be relevant only on Windows.)
uk: *export_symbols* — це список символів, які буде експортовано спільною бібліотекою. (Здається, це стосується лише Windows.)

source: *debug* is as for :meth:`compile` and :meth:`create_static_lib`, with the slight distinction that it actually matters on most platforms (as opposed to :meth:`create_static_lib`, which includes a *debug* flag mostly for form's sake).
uk: *debug* — це те саме, що стосується :meth:`compile` і :meth:`create_static_lib`, з тією невеликою різницею, що це насправді має значення на більшості платформ (на відміну від :meth:`create_static_lib`, який переважно містить прапорець *debug* заради форми).

source: *extra_preargs* and *extra_postargs* are as for :meth:`compile` (except of course that they supply command-line arguments for the particular linker being used).
uk: *extra_preargs* і *extra_postargs* схожі на :meth:`compile` (звісно, за винятком того, що вони надають аргументи командного рядка для конкретного використовуваного компонувальника).

source: Raises :exc:`LinkError` on failure.
uk: Викликає :exc:`LinkError` у разі помилки.

source: Link an executable. *output_progname* is the name of the file executable, while *objects* are a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
uk: Посилання на виконуваний файл. *output_progname* — це ім’я виконуваного файлу, тоді як *objects* — це список імен файлів об’єктів для посилань. Інші аргументи такі ж, як і для методу :meth:`link`.

source: Link a shared library. *output_libname* is the name of the output library, while *objects* is a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
uk: Пов’язати спільну бібліотеку. *output_libname* — це ім’я вихідної бібліотеки, тоді як *objects* — це список імен файлів об’єктів для посилань. Інші аргументи такі ж, як і для методу :meth:`link`.

source: Link a shared object. *output_filename* is the name of the shared object that will be created, while *objects* is a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
uk: Пов’язати спільний об’єкт. *output_filename* — це ім’я спільного об’єкта, який буде створено, тоді як *objects* — це список імен файлів об’єктів для посилань. Інші аргументи такі ж, як і для методу :meth:`link`.

source: Preprocess a single C/C++ source file, named in *source*. Output will be written to file named *output_file*, or *stdout* if *output_file* not supplied. *macros* is a list of macro definitions as for :meth:`compile`, which will augment the macros set with :meth:`define_macro` and :meth:`undefine_macro`. *include_dirs* is a list of directory names that will be added to the default list, in the same way as :meth:`add_include_dir`.
uk: Попередньо обробіть один вихідний файл C/C++, названий у *source*. Вихідні дані буде записано у файл з назвою *output_file* або *stdout*, якщо *output_file* не надано. *макроси* — це список визначень макросів, як для :meth:`compile`, який доповнює набір макросів за допомогою :meth:`define_macro` і :meth:`undefine_macro`. *include_dirs* — це список імен каталогів, які буде додано до списку за замовчуванням так само, як :meth:`add_include_dir`.

source: Raises :exc:`PreprocessError` on failure.
uk: Викликає :exc:`PreprocessError` у разі помилки.

source: The following utility methods are defined by the :class:`CCompiler` class, for use by the various concrete subclasses.
uk: Наступні службові методи визначені класом :class:`CCompiler` для використання різними конкретними підкласами.
