Repository: python/python-docs-uk
Catalog: distutils/apiref.po
Languages: uk

source: Return the full path name of the configuration header. For Unix, this will be the header generated by the :program:`configure` script; for other platforms the header will have been supplied directly by the Python source distribution. The file is a platform-specific text file.
uk: Повертає повну назву шляху до заголовка конфігурації. Для Unix це буде заголовок, згенерований сценарієм :program:`configure`; для інших платформ заголовок буде надано безпосередньо вихідним кодом Python. Файл є текстовим файлом для конкретної платформи.

source: Return the full path name of the :file:`Makefile` used to build Python. For Unix, this will be a file generated by the :program:`configure` script; the meaning for other platforms will vary. The file is a platform-specific text file, if it exists. This function is only useful on POSIX platforms.
uk: Повертає повну назву шляху до :file:`Makefile`, який використовується для створення Python. Для Unix це буде файл, згенерований сценарієм :program:`configure`; значення для інших платформ буде іншим. Файл є текстовим файлом певної платформи, якщо він існує. Ця функція корисна лише на платформах POSIX.

source: The following functions are deprecated together with this module and they have no direct replacement.
uk: Наступні функції застаріли разом із цим модулем і не мають прямої заміни.

source: Return the directory for either the general or platform-dependent C include files. If *plat_specific* is true, the platform-dependent include directory is returned; if false or omitted, the platform-independent directory is returned. If *prefix* is given, it is used as either the prefix instead of :const:`PREFIX`, or as the exec-prefix instead of :const:`EXEC_PREFIX` if *plat_specific* is true.
uk: Повертає каталог для загальних або залежних від платформи C-файлів включення. Якщо *plat_specific* має значення true, повертається залежний від платформи каталог включення; якщо false або опущено, повертається незалежний від платформи каталог. Якщо вказано *префікс*, він використовується або як префікс замість :const:`PREFIX`, або як префікс exec замість :const:`EXEC_PREFIX`, якщо *plat_specific* має значення true.

source: Return the directory for either the general or platform-dependent library installation. If *plat_specific* is true, the platform-dependent include directory is returned; if false or omitted, the platform-independent directory is returned. If *prefix* is given, it is used as either the prefix instead of :const:`PREFIX`, or as the exec-prefix instead of :const:`EXEC_PREFIX` if *plat_specific* is true. If *standard_lib* is true, the directory for the standard library is returned rather than the directory for the installation of third-party extensions.
uk: Поверніть каталог для встановлення загальної або залежної від платформи бібліотеки. Якщо *plat_specific* має значення true, повертається залежний від платформи каталог включення; якщо false або опущено, повертається незалежний від платформи каталог. Якщо вказано *префікс*, він використовується або як префікс замість :const:`PREFIX`, або як префікс exec замість :const:`EXEC_PREFIX`, якщо *plat_specific* має значення true. Якщо *standard_lib* має значення true, повертається каталог для стандартної бібліотеки, а не каталог для встановлення розширень сторонніх розробників.

source: The following function is only intended for use within the :mod:`distutils` package.
uk: Наступна функція призначена лише для використання в пакеті :mod:`distutils`.

source: Do any platform-specific customization of a :class:`distutils.ccompiler.CCompiler` instance.
uk: Виконайте будь-яке налаштування екземпляра :class:`distutils.ccompiler.CCompiler` для певної платформи.

source: This function is only needed on Unix at this time, but should be called consistently to support forward-compatibility. It inserts the information that varies across Unix flavors and is stored in Python's :file:`Makefile`. This information includes the selected compiler, compiler and linker options, and the extension used by the linker for shared objects.
uk: На даний момент ця функція потрібна тільки в Unix, але її слід викликати постійно, щоб підтримувати сумісність. Він вставляє інформацію, яка різниться в різних варіантах Unix і зберігається в файлі :file:`Makefile` Python. Ця інформація включає вибраний компілятор, параметри компілятора та компонувальника, а також розширення, яке використовує компонувальник для спільних об’єктів.

source: This function is even more special-purpose, and should only be used from Python's own build procedures.
uk: Ця функція ще більш спеціального призначення, і її слід використовувати лише з власних процедур збірки Python.

source: Inform the :mod:`distutils.sysconfig` module that it is being used as part of the build process for Python. This changes a lot of relative locations for files, allowing them to be located in the build area rather than in an installed Python.
uk: Повідомте модуль :mod:`distutils.sysconfig`, що він використовується як частина процесу збирання для Python. Це змінює багато відносних розташувань файлів, дозволяючи їм розташовуватися в області збірки, а не у встановленому Python.

source: :mod:`distutils.text_file` --- The TextFile class
uk: :mod:`distutils.text_file` --- Клас TextFile

source: This module provides the :class:`TextFile` class, which gives an interface to text files that (optionally) takes care of stripping comments, ignoring blank lines, and joining lines with backslashes.
uk: Цей модуль надає клас :class:`TextFile`, який надає інтерфейс для текстових файлів, який (необов’язково) піклується про видалення коментарів, ігнорування порожніх рядків і об’єднання рядків зворотними похилими рисками.

source: This class provides a file-like object that takes care of all the things you commonly want to do when processing a text file that has some line-by-line syntax: strip comments (as long as ``#`` is your comment character), skip blank lines, join adjacent lines by escaping the newline (ie. backslash at end of line), strip leading and/or trailing whitespace. All of these are optional and independently controllable.
uk: Цей клас надає файлоподібний об’єкт, який піклується про всі речі, які ви зазвичай хочете робити під час обробки текстового файлу, який має деякий рядковий синтаксис: видалення коментарів (за умови, що ``#`` є вашим символом коментаря ), пропускати порожні рядки, об’єднувати суміжні рядки шляхом екранування символу нового рядка (тобто зворотної косої риски в кінці рядка), видаляти пробіли на початку та/або в кінці. Усі вони необов’язкові та управляються незалежно.

source: The class provides a :meth:`warn` method so you can generate warning messages that report physical line number, even if the logical line in question spans multiple physical lines. Also provides :meth:`unreadline` for implementing line-at-a-time lookahead.
uk: Клас надає метод :meth:`warn`, щоб ви могли генерувати попередження, які повідомляють номер фізичного рядка, навіть якщо відповідний логічний рядок охоплює кілька фізичних рядків. Також надає :meth:`unreadline` для реалізації построкового перегляду.

source: :class:`TextFile` instances are create with either *filename*, *file*, or both. :exc:`RuntimeError` is raised if both are ``None``. *filename* should be a string, and *file* a file object (or something that provides :meth:`readline` and :meth:`close` methods). It is recommended that you supply at least *filename*, so that :class:`TextFile` can include it in warning messages. If *file* is not supplied, :class:`TextFile` creates its own using the :func:`open` built-in function.
uk: :class:`TextFile` екземпляри створюються з *filename*, *file* або обома. :exc:`RuntimeError` виникає, якщо обидва мають значення ``None``. *filename* має бути рядком, а *file* — файловим об’єктом (або чимось, що надає методи :meth:`readline` і :meth:`close`). Рекомендовано вказати принаймні *ім’я файлу*, щоб :class:`TextFile` міг включити його в попередження. Якщо *file* не вказано, :class:`TextFile` створює власний за допомогою вбудованої функції :func:`open`.

source: The options are all boolean, and affect the values returned by :meth:`readline`
uk: Усі параметри є логічними і впливають на значення, які повертає :meth:`readline`

source: option name
uk: назва опції

source: default
uk: за замовчуванням

source: strip from ``'#'`` to end-of-line, as well as any whitespace leading up to the ``'#'``\ ---unless it is escaped by a backslash
uk: смуга від ``'#'`` до кінця рядка, а також будь-які пробіли, що ведуть до ``'#'``\ --- якщо це не екрановано зворотною скісною рискою

source: true
uk: правда

source: strip leading whitespace from each line before returning it
uk: видаляти початкові пробіли з кожного рядка перед поверненням

source: false
uk: помилковий

source: strip trailing whitespace (including line terminator!) from each line before returning it.
uk: видаляти кінцеві пробіли (включно з символом закінчення рядка!) з кожного рядка перед поверненням.

source: skip lines that are empty \*after\* stripping comments and whitespace. (If both lstrip_ws and rstrip_ws are false, then some lines may consist of solely whitespace: these will \*not\* be skipped, even if *skip_blanks* is true.)
uk: пропускати порожні рядки \*після\* видалення коментарів і пробілів. (Якщо і lstrip_ws, і rstrip_ws false, то деякі рядки можуть складатися лише з пробілів: вони \*не\* будуть пропущені, навіть якщо *skip_blanks* має значення true.)

source: if a backslash is the last non-newline character on a line after stripping comments and whitespace, join the following line to it to form one logical line; if N consecutive lines end with a backslash, then N+1 physical lines will be joined to form one logical line.
uk: якщо зворотна скісна риска є останнім символом у рядку після видалення коментарів і пробілів, приєднайте наступний рядок до нього, щоб утворити один логічний рядок; якщо N послідовних рядків закінчуються зворотною скісною рискою, тоді N+1 фізичний рядок буде об’єднано в один логічний рядок.

source: strip leading whitespace from lines that are joined to their predecessor; only matters if ``(join_lines and not lstrip_ws)``
uk: видаляти початкові пробіли з рядків, які приєднані до їх попереднього; має значення лише якщо ``(join_lines, а не lstrip_ws)``

source: Note that since *rstrip_ws* can strip the trailing newline, the semantics of :meth:`readline` must differ from those of the built-in file object's :meth:`readline` method! In particular, :meth:`readline` returns ``None`` for end-of-file: an empty string might just be a blank line (or an all-whitespace line), if *rstrip_ws* is true but *skip_blanks* is not.
uk: Зауважте, що оскільки *rstrip_ws* може видаляти кінцевий новий рядок, семантика :meth:`readline` має відрізнятися від методу :meth:`readline` вбудованого файлового об’єкта! Зокрема, :meth:`readline` повертає ``None`` для кінця файлу: порожній рядок може бути просто порожнім рядком (або рядком із пробілами), якщо *rstrip_ws* має значення true, але *skip_blanks* не.

source: Open a new file *filename*. This overrides any *file* or *filename* constructor arguments.
uk: Відкрийте новий файл *назва файлу*. Це перевизначає будь-які аргументи конструктора *file* або *filename*.

source: Close the current file and forget everything we know about it (including the filename and the current line number).
uk: Закрийте поточний файл і забудьте все, що ми знаємо про нього (включно з назвою файлу та номером поточного рядка).

source: Print (to stderr) a warning message tied to the current logical line in the current file. If the current logical line in the file spans multiple physical lines, the warning refers to the whole range, such as ``"lines 3-5"``. If *line* is supplied, it overrides the current line number; it may be a list or tuple to indicate a range of physical lines, or an integer for a single physical line.
uk: Вивести (у stderr) попереджувальне повідомлення, прив’язане до поточного логічного рядка в поточному файлі. Якщо поточний логічний рядок у файлі охоплює кілька фізичних рядків, попередження стосується всього діапазону, наприклад "рядків 3-5". Якщо вказано *рядок*, він замінює поточний номер рядка; це може бути список або кортеж для позначення діапазону фізичних рядків або ціле число для окремого фізичного рядка.

source: Read and return a single logical line from the current file (or from an internal buffer if lines have previously been "unread" with :meth:`unreadline`). If the *join_lines* option is true, this may involve reading multiple physical lines concatenated into a single string. Updates the current line number, so calling :meth:`warn` after :meth:`readline` emits a warning about the physical line(s) just read. Returns ``None`` on end-of-file, since the empty string can occur if *rstrip_ws* is true but *strip_blanks* is not.
uk: Читання та повернення одного логічного рядка з поточного файлу (або з внутрішнього буфера, якщо рядки раніше були "непрочитаними" за допомогою :meth:`unreadline`). Якщо параметр *join_lines* має значення true, це може передбачати читання кількох фізичних рядків, об’єднаних в один рядок. Оновлює номер поточного рядка, тому виклик :meth:`warn` після :meth:`readline` видає попередження про щойно прочитаний фізичний рядок(и). Повертає ``None`` у кінці файлу, оскільки порожній рядок може виникнути, якщо *rstrip_ws* має значення true, а *strip_blanks* — ні.

source: Read and return the list of all logical lines remaining in the current file. This updates the current line number to the last line of the file.
uk: Прочитати та повернути список усіх логічних рядків, що залишилися в поточному файлі. Це оновить номер поточного рядка до останнього рядка файлу.

source: Push *line* (a string) onto an internal buffer that will be checked by future :meth:`readline` calls. Handy for implementing a parser with line-at-a-time lookahead. Note that lines that are "unread" with :meth:`unreadline` are not subsequently re-cleansed (whitespace stripped, or whatever) when read with :meth:`readline`. If multiple calls are made to :meth:`unreadline` before a call to :meth:`readline`, the lines will be returned most in most recent first order.
uk: Надішліть *рядок* (рядок) у внутрішній буфер, який перевірятиметься майбутніми викликами :meth:`readline`. Зручно для реалізації синтаксичного аналізатора з построковим переглядом. Зауважте, що рядки, які є "непрочитаними" за допомогою :meth:`unreadline`, згодом не очищаються повторно (видаляються пробіли чи щось інше), коли читаються за допомогою :meth:`readline`. Якщо перед викликом :meth:`readline` зроблено декілька викликів :meth:`unreadline`, рядки буде повернуто в найновішому першому порядку.

source: :mod:`distutils.version` --- Version number classes
uk: :mod:`distutils.version` --- Класи номерів версій

source: :mod:`distutils.cmd` --- Abstract base class for Distutils commands
uk: :mod:`distutils.cmd` --- Абстрактний базовий клас для команд Distutils

source: This module supplies the abstract base class :class:`Command`.
uk: Цей модуль надає абстрактний базовий клас :class:`Command`.

source: Abstract base class for defining command classes, the "worker bees" of the Distutils. A useful analogy for command classes is to think of them as subroutines with local variables called *options*. The options are declared in :meth:`initialize_options` and defined (given their final values) in :meth:`finalize_options`, both of which must be defined by every command class. The distinction between the two is necessary because option values might come from the outside world (command line, config file, ...), and any options dependent on other options must be computed after these outside influences have been processed --- hence :meth:`finalize_options`. The body of the subroutine, where it does all its work based on the values of its options, is the :meth:`run` method, which must also be implemented by every command class.
uk: Абстрактний базовий клас для визначення класів команд, "робочих бджіл" Distutils. Корисною аналогією для класів команд є розглядати їх як підпрограми з локальними змінними, які називаються *options*. Параметри оголошені в :meth:`initialize_options` і визначені (враховуючи їх кінцеві значення) в :meth:`finalize_options`, обидва з яких повинні бути визначені кожним класом команд. Розрізнення між цими двома параметрами є необхідним, оскільки значення параметрів можуть надходити із зовнішнього світу (командний рядок, конфігураційний файл, ...), а будь-які параметри, залежні від інших параметрів, мають бути обчислені після обробки цих зовнішніх впливів --- отже :meth:`finalize_options`. Тіло підпрограми, де вона виконує всю свою роботу на основі значень своїх параметрів, є методом :meth:`run`, який також має бути реалізований кожним класом команд.

source: The class constructor takes a single argument *dist*, a :class:`~distutils.core.Distribution` instance.
uk: Конструктор класу приймає один аргумент *dist*, екземпляр :class:`~distutils.core.Distribution`.

source: Creating a new Distutils command
uk: Створення нової команди Distutils

source: This section outlines the steps to create a new Distutils command.
uk: У цьому розділі описано кроки для створення нової команди Distutils.

source: A new command lives in a module in the :mod:`distutils.command` package. There is a sample template in that directory called :file:`command_template`. Copy this file to a new module with the same name as the new command you're implementing. This module should implement a class with the same name as the module (and the command). So, for instance, to create the command ``peel_banana`` (so that users can run ``setup.py peel_banana``), you'd copy :file:`command_template` to :file:`distutils/command/peel_banana.py`, then edit it so that it's implementing the class :class:`peel_banana`, a subclass of :class:`distutils.cmd.Command`.
uk: Нова команда міститься в модулі в пакеті :mod:`distutils.command`. У цьому каталозі є зразок шаблону під назвою :file:`command_template`. Скопіюйте цей файл до нового модуля з такою ж назвою, як і нова команда, яку ви реалізуєте. Цей модуль має реалізовувати клас із такою самою назвою, як і модуль (і команда). Отже, наприклад, щоб створити команду ``peel_banana`` (щоб користувачі могли запускати ``setup.py peel_banana``), ви повинні скопіювати :file:`command_template` до :file:`distutils/command/peel_banana .py`, потім відредагуйте його так, щоб він реалізував клас :class:`peel_banana`, підклас :class:`distutils.cmd.Command`.

source: Subclasses of :class:`Command` must define the following methods.
uk: Підкласи :class:`Command` повинні визначати такі методи.

source: Set default values for all the options that this command supports. Note that these defaults may be overridden by other commands, by the setup script, by config files, or by the command-line. Thus, this is not the place to code dependencies between options; generally, :meth:`initialize_options` implementations are just a bunch of ``self.foo = None`` assignments.
uk: Установіть значення за замовчуванням для всіх параметрів, які підтримує ця команда. Зауважте, що ці параметри за замовчуванням можуть бути замінені іншими командами, сценарієм налаштування, файлами конфігурації або командним рядком. Таким чином, це не місце для кодування залежностей між параметрами; загалом, реалізації :meth:`initialize_options` — це просто купа призначень ``self.foo = None``.

source: Set final values for all the options that this command supports. This is always called as late as possible, ie. after any option assignments from the command-line or from other commands have been done. Thus, this is the place to code option dependencies: if *foo* depends on *bar*, then it is safe to set *foo* from *bar* as long as *foo* still has the same value it was assigned in :meth:`initialize_options`.
uk: Установіть остаточні значення для всіх параметрів, які підтримує ця команда. Це завжди викликається якомога пізніше, тобто. після виконання будь-яких призначень параметрів із командного рядка чи інших команд. Таким чином, це місце для кодування залежностей параметрів: якщо *foo* залежить від *bar*, тоді безпечно встановити *foo* з *bar*, якщо *foo* все ще має те саме значення, яке було призначено в :meth:`ініціалізувати_параметри`.

source: A command's raison d'etre: carry out the action it exists to perform, controlled by the options initialized in :meth:`initialize_options`, customized by other commands, the setup script, the command-line, and config files, and finalized in :meth:`finalize_options`. All terminal output and filesystem interaction should be done by :meth:`run`.
uk: Сенс існування команди: виконати дію, для виконання якої вона існує, що контролюється параметрами, ініціалізованими в :meth:`initialize_options`, налаштованими іншими командами, сценарієм налаштування, командним рядком і файлами конфігурації, а також завершеними в :meth:`finalize_options`. Весь вихід терміналу та взаємодія з файловою системою має здійснюватися за допомогою :meth:`run`.

source: *sub_commands* formalizes the notion of a "family" of commands, e.g. ``install`` as the parent with sub-commands ``install_lib``, ``install_headers``, etc. The parent of a family of commands defines *sub_commands* as a class attribute; it's a list of 2-tuples ``(command_name, predicate)``, with *command_name* a string and *predicate* a function, a string or ``None``. *predicate* is a method of the parent command that determines whether the corresponding command is applicable in the current situation. (E.g. ``install_headers`` is only applicable if we have any C header files to install.) If *predicate* is ``None``, that command is always applicable.
uk: *sub_commands* формалізує поняття "сімейства" команд, напр. ``install`` як батьківський з підкомандами ``install_lib``, ``install_headers`` тощо. Батьківський елемент сімейства команд визначає *sub_commands* як атрибут класу; це список із двох кортежів ``(назва_команди, предикат)``, де *назва_команди* є рядком, а *предикат* — функцією, рядком або ``None``. *предикат* — це метод батьківської команди, який визначає, чи застосовна відповідна команда в поточній ситуації. (Наприклад, ``install_headers`` застосовний, лише якщо у нас є файли заголовків C для встановлення.) Якщо *predicate* має значення ``None``, ця команда завжди застосовна.

source: *sub_commands* is usually defined at the *end* of a class, because predicates can be methods of the class, so they must already have been defined. The canonical example is the :command:`install` command.
uk: *sub_commands* зазвичай визначається в *кінці* класу, оскільки предикати можуть бути методами класу, тому вони повинні бути вже визначені. Канонічним прикладом є команда :command:`install`.

source: :mod:`distutils.command` --- Individual Distutils commands
uk: :mod:`distutils.command` --- Окремі команди Distutils

source: :mod:`distutils.command.bdist` --- Build a binary installer
uk: :mod:`distutils.command.bdist` --- Створення бінарного інсталятора

source: :mod:`distutils.command.bdist_packager` --- Abstract base class for packagers
uk: :mod:`distutils.command.bdist_packager` --- Абстрактний базовий клас для пакувальників

source: :mod:`distutils.command.bdist_dumb` --- Build a "dumb" installer
uk: :mod:`distutils.command.bdist_dumb` --- Створення "тупого" інсталятора

source: :mod:`distutils.command.bdist_rpm` --- Build a binary distribution as a Redhat RPM and SRPM
uk: :mod:`distutils.command.bdist_rpm` --- Створення бінарного дистрибутива як Redhat RPM і SRPM

source: :mod:`distutils.command.sdist` --- Build a source distribution
uk: :mod:`distutils.command.sdist` --- Створення вихідного дистрибутива

source: :mod:`distutils.command.build` --- Build all files of a package
uk: :mod:`distutils.command.build` --- Збірка всіх файлів пакета
