Repository: python/python-docs-uk
Catalog: distutils/builtdist.po
Languages: uk

source: If the folder cannot be retrieved, :exc:`OSError` is raised.
uk: Якщо папку неможливо отримати, виникає :exc:`OSError`.

source: Which folders are available depends on the exact Windows version, and probably also the configuration. For details refer to Microsoft's documentation of the :c:func:`SHGetSpecialFolderPath` function.
uk: Які папки доступні, залежить від точної версії Windows і, можливо, також від конфігурації. Додаткову інформацію див. у документації Microsoft щодо функції :c:func:`SHGetSpecialFolderPath`.

source: This function creates a shortcut. *target* is the path to the program to be started by the shortcut. *description* is the description of the shortcut. *filename* is the title of the shortcut that the user will see. *arguments* specifies the command line arguments, if any. *workdir* is the working directory for the program. *iconpath* is the file containing the icon for the shortcut, and *iconindex* is the index of the icon in the file *iconpath*. Again, for details consult the Microsoft documentation for the :class:`IShellLink` interface.
uk: Ця функція створює ярлик. *ціль* — це шлях до програми, яка запускається за допомогою ярлика. *description* — це опис ярлика. *ім’я файлу* – це назва ярлика, який побачить користувач. *arguments* визначає аргументи командного рядка, якщо такі є. *workdir* — це робочий каталог для програми. *iconpath* — це файл, що містить піктограму для ярлика, а *iconindex* — це індекс піктограми у файлі *iconpath*. Знову ж таки, для отримання детальної інформації зверніться до документації Microsoft для інтерфейсу :class:`IShellLink`.
