Repository: python/python-docs-uk
Catalog: distutils/commandref.po
Languages: uk

source: Command Reference
uk: Довідник команд

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
uk: Цей документ зберігається лише до тих пір, поки документація ``setuptools`` за адресою https://setuptools.readthedocs.io/en/latest/setuptools.html окремо не охопить всю відповідну інформацію, яка зараз включена тут.

source: Installing modules: the :command:`install` command family
uk: Встановлення модулів: сімейство команд :command:`install`

source: The install command ensures that the build commands have been run and then runs the subcommands :command:`install_lib`, :command:`install_data` and :command:`install_scripts`.
uk: Команда інсталяції перевіряє виконання команд збірки, а потім запускає підкоманди :command:`install_lib`, :command:`install_data` і :command:`install_scripts`.

source: This command installs all data files provided with the distribution.
uk: Ця команда інсталює всі файли даних, що надаються разом із дистрибутивом.

source: This command installs all (Python) scripts in the distribution.
uk: Ця команда встановлює всі сценарії (Python) у дистрибутиві.

source: Creating a source distribution: the :command:`sdist` command
uk: Створення вихідного дистрибутива: команда :command:`sdist`

source: The manifest template commands are:
uk: Команди шаблону маніфесту:

source: Command
uk: Команда

source: Description
uk: опис

source: include all files matching any of the listed patterns
uk: включити всі файли, що відповідають будь-якому з перелічених шаблонів

source: :command:`exclude pat1 pat2 ...`
uk: :command:`виключити pat1 pat2 ...`

source: exclude all files matching any of the listed patterns
uk: виключити всі файли, що відповідають будь-якому з перелічених шаблонів

source: include all files under *dir* matching any of the listed patterns
uk: включити всі файли в *dir*, які відповідають будь-якому з перелічених шаблонів

source: exclude all files under *dir* matching any of the listed patterns
uk: виключити всі файли в *dir*, які відповідають будь-якому з перелічених шаблонів

source: include all files anywhere in the source tree matching --- & any of the listed patterns
uk: включити всі файли будь-де в вихідному дереві, які відповідають --- і будь-якому з перелічених шаблонів

source: exclude all files anywhere in the source tree matching --- & any of the listed patterns
uk: виключити всі файли будь-де у вихідному дереві, що відповідають --- та будь-якому з перелічених шаблонів

source: exclude all files under *dir*
uk: виключити всі файли в *dir*

source: include all files under *dir*
uk: включити всі файли в *dir*

source: The patterns here are Unix-style "glob" patterns: ``*`` matches any sequence of regular filename characters, ``?`` matches any single regular filename character, and ``[range]`` matches any of the characters in *range* (e.g., ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). The definition of "regular filename character" is platform-specific: on Unix it is anything except slash; on Windows anything except backslash or colon.
uk: Шаблони тут є шаблонами "glob" у стилі Unix: ``*`` відповідає будь-якій послідовності звичайних символів назви файлу, ``?`` відповідає будь-якому окремому звичайному символу назви файлу, а ``[діапазон]`` відповідає будь-якому з символів у *діапазоні* (наприклад, ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). Визначення "звичайного символу імені файлу" залежить від платформи: в Unix це будь-що, крім скісної риски; у Windows будь-що, крім зворотної скісної риски або двокрапки.
