Repository: python/python-docs-uk
Catalog: distutils/configfile.po
Languages: uk

source: Writing the Setup Configuration File
uk: Написання файлу конфігурації установки

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
uk: Цей документ зберігається лише до тих пір, поки документація ``setuptools`` за адресою https://setuptools.readthedocs.io/en/latest/setuptools.html окремо не охопить всю відповідну інформацію, яка зараз включена тут.

source: Often, it's not possible to write down everything needed to build a distribution *a priori*: you may need to get some information from the user, or from the user's system, in order to proceed. As long as that information is fairly simple---a list of directories to search for C header files or libraries, for example---then providing a configuration file, :file:`setup.cfg`, for users to edit is a cheap and easy way to solicit it. Configuration files also let you provide default values for any command option, which the installer can then override either on the command-line or by editing the config file.
uk: Часто неможливо записати все, що потрібно для створення дистрибутива *a priori*: вам може знадобитися отримати деяку інформацію від користувача або від системи користувача, щоб продовжити. Якщо ця інформація досить проста --- список каталогів для пошуку файлів заголовків C або бібліотек, наприклад --- тоді надання файлу конфігурації, :file:`setup.cfg` для редагування користувачами, є дешевий і простий спосіб отримати його. Файли конфігурації також дають змогу вказати значення за замовчуванням для будь-якого параметра команди, які інсталятор може потім змінити або в командному рядку, або шляхом редагування файлу конфігурації.

source: The setup configuration file is a useful middle-ground between the setup script---which, ideally, would be opaque to installers [#]_---and the command-line to the setup script, which is outside of your control and entirely up to the installer. In fact, :file:`setup.cfg` (and any other Distutils configuration files present on the target system) are processed after the contents of the setup script, but before the command-line. This has several useful consequences:
uk: Файл конфігурації інсталяції є корисною серединою між сценарієм інсталяції --- який в ідеалі був би непрозорим для інсталяторів [#]_--- та командним рядком до сценарію інсталяції, який знаходиться поза вашим контролем і повністю залежить від інсталятора. Насправді :file:`setup.cfg` (та будь-які інші конфігураційні файли Distutils, наявні в цільовій системі) обробляються після вмісту сценарію встановлення, але перед командним рядком. Це має кілька корисних наслідків:

source: installers can override some of what you put in :file:`setup.py` by editing :file:`setup.cfg`
uk: інсталятори можуть перевизначати частину того, що ви додаєте до :file:`setup.py`, редагуючи :file:`setup.cfg`

source: you can provide non-standard defaults for options that are not easily set in :file:`setup.py`
uk: ви можете надати нестандартні параметри за замовчуванням для параметрів, які непросто встановити в :file:`setup.py`

source: installers can override anything in :file:`setup.cfg` using the command-line options to :file:`setup.py`
uk: інсталятори можуть змінити будь-що в :file:`setup.cfg` за допомогою параметрів командного рядка до :file:`setup.py`

source: The basic syntax of the configuration file is simple:
uk: Основний синтаксис файлу конфігурації простий:

source: where *command* is one of the Distutils commands (e.g. :command:`build_py`, :command:`install`), and *option* is one of the options that command supports. Any number of options can be supplied for each command, and any number of command sections can be included in the file. Blank lines are ignored, as are comments, which run from a ``'#'`` character until the end of the line. Long option values can be split across multiple lines simply by indenting the continuation lines.
uk: де *command* — одна з команд Distutils (наприклад, :command:`build_py`, :command:`install`), а *option* — один із параметрів, які підтримує ця команда. Для кожної команди можна надати будь-яку кількість параметрів, і до файлу можна включити будь-яку кількість розділів команд. Порожні рядки ігноруються, як і коментарі, які починаються від символу ``'#'`` до кінця рядка. Довгі значення параметрів можна розділити на кілька рядків, просто зробивши відступ у рядках продовження.

source: You can find out the list of options supported by a particular command with the universal :option:`!--help` option, e.g.
uk: Ви можете дізнатися список параметрів, які підтримує певна команда, за допомогою універсального параметра :option:`!--help`, напр.

source: Note that an option spelled :option:`!--foo-bar` on the command-line is spelled ``foo_bar`` in configuration files.
uk: Зауважте, що параметр, написаний :option:`!--foo-bar` у командному рядку, у файлах конфігурації пишеться як ``foo_bar``.

source: For example, say you want your extensions to be built "in-place"---that is, you have an extension :mod:`pkg.ext`, and you want the compiled extension file (:file:`ext.so` on Unix, say) to be put in the same source directory as your pure Python modules :mod:`pkg.mod1` and :mod:`pkg.mod2`. You can always use the :option:`!--inplace` option on the command-line to ensure this:
uk: Наприклад, скажімо, ви хочете, щоб ваші розширення створювалися "на місці" --- тобто у вас є розширення :mod:`pkg.ext`, і ви хочете скомпільований файл розширення (:file:`ext.so` в Unix, скажімо) для розміщення в тому ж вихідному каталозі, що й ваші чисті модулі Python :mod:`pkg.mod1` і :mod:`pkg.mod2`. Ви завжди можете скористатися параметром :option:`!--inplace` у командному рядку, щоб переконатися в цьому:

source: But this requires that you always specify the :command:`build_ext` command explicitly, and remember to provide :option:`!--inplace`. An easier way is to "set and forget" this option, by encoding it in :file:`setup.cfg`, the configuration file for this distribution:
uk: Але це вимагає, щоб ви завжди явно вказували команду :command:`build_ext` і не забувайте вказувати :option:`!--inplace`. Простіший спосіб — "встановити та забути" цей параметр, закодувавши його у :file:`setup.cfg`, файл конфігурації для цього дистрибутива:

source: This will affect all builds of this module distribution, whether or not you explicitly specify :command:`build_ext`. If you include :file:`setup.cfg` in your source distribution, it will also affect end-user builds---which is probably a bad idea for this option, since always building extensions in-place would break installation of the module distribution. In certain peculiar cases, though, modules are built right in their installation directory, so this is conceivably a useful ability. (Distributing extensions that expect to be built in their installation directory is almost always a bad idea, though.)
uk: Це вплине на всі збірки цього дистрибутива модуля, незалежно від того, чи вказано ви явно :command:`build_ext`. Якщо ви включите :file:`setup.cfg` у вихідний дистрибутив, це також вплине на збірки для кінцевих користувачів --- що, ймовірно, є поганою ідеєю для цього варіанту, оскільки постійне створення розширень на місці порушить установку модуля розподіл. Однак у певних особливих випадках модулі збираються прямо в каталозі встановлення, тому це, ймовірно, корисна можливість. (Однак розповсюдження розширень, які планується створити в каталозі встановлення, майже завжди є поганою ідеєю.)

source: Another example: certain commands take a lot of options that don't change from run to run; for example, :command:`bdist_rpm` needs to know everything required to generate a "spec" file for creating an RPM distribution. Some of this information comes from the setup script, and some is automatically generated by the Distutils (such as the list of files installed). But some of it has to be supplied as options to :command:`bdist_rpm`, which would be very tedious to do on the command-line for every run. Hence, here is a snippet from the Distutils' own :file:`setup.cfg`:
uk: Інший приклад: певні команди мають багато параметрів, які не змінюються від запуску до запуску; наприклад, :command:`bdist_rpm` потрібно знати все, що потрібно для створення файлу специфікації для створення дистрибутива RPM. Частина цієї інформації надходить зі сценарію встановлення, а частина автоматично генерується Distutils (наприклад, список встановлених файлів). Але деякі з них мають бути надані як параметри :command:`bdist_rpm`, що було б дуже втомливо робити в командному рядку для кожного запуску. Отже, ось фрагмент із власного :file:`setup.cfg` Distutils:

source: Note that the ``doc_files`` option is simply a whitespace-separated string split across multiple lines for readability.
uk: Зауважте, що параметр ``doc_files`` — це просто розділений пробілами рядок, розділений на кілька рядків для зручності читання.

source: :ref:`inst-config-syntax` in "Installing Python Modules"
uk: :ref:`inst-config-syntax` у розділі "Встановлення модулів Python"

source: More information on the configuration files is available in the manual for system administrators.
uk: Додаткову інформацію про файли конфігурації можна знайти в посібнику для системних адміністраторів.

source: Footnotes
uk: Виноски

source: This ideal probably won't be achieved until auto-configuration is fully supported by the Distutils.
uk: Цей ідеал, ймовірно, не буде досягнутий, доки автоматичне налаштування не буде повністю підтримуватися Distutils.
