Repository: python/python-docs-uk
Catalog: distutils/extending.po
Languages: uk

source: Extending Distutils
uk: Розширення Distutils

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
uk: Цей документ зберігається лише до тих пір, поки документація ``setuptools`` за адресою https://setuptools.readthedocs.io/en/latest/setuptools.html окремо не охопить всю відповідну інформацію, яка зараз включена тут.

source: Distutils can be extended in various ways. Most extensions take the form of new commands or replacements for existing commands. New commands may be written to support new types of platform-specific packaging, for example, while replacements for existing commands may be made to modify details of how the command operates on a package.
uk: Distutils можна розширити різними способами. Більшість розширень мають форму нових команд або заміни існуючих команд. Нові команди можуть бути написані для підтримки нових типів пакетів, що стосуються платформи, наприклад, тоді як заміни існуючих команд можуть бути зроблені для зміни деталей того, як команда працює з пакетом.

source: Most extensions of the distutils are made within :file:`setup.py` scripts that want to modify existing commands; many simply add a few file extensions that should be copied into packages in addition to :file:`.py` files as a convenience.
uk: Більшість розширень distutils створено в сценаріях :file:`setup.py`, які хочуть змінити існуючі команди; багато хто просто додає кілька розширень файлів, які слід скопіювати в пакунки на додаток до файлів :file:`.py` для зручності.

source: Most distutils command implementations are subclasses of the :class:`distutils.cmd.Command` class. New commands may directly inherit from :class:`Command`, while replacements often derive from :class:`Command` indirectly, directly subclassing the command they are replacing. Commands are required to derive from :class:`Command`.
uk: Більшість реалізацій команд distutils є підкласами класу :class:`distutils.cmd.Command`. Нові команди можуть безпосередньо успадковувати :class:`Command`, тоді як заміни часто походять від :class:`Command` опосередковано, безпосередньо створюючи підклас команди, яку вони замінюють. Команди повинні походити від :class:`Command`.

source: Integrating new commands
uk: Інтеграція нових команд

source: There are different ways to integrate new command implementations into distutils. The most difficult is to lobby for the inclusion of the new features in distutils itself, and wait for (and require) a version of Python that provides that support. This is really hard for many reasons.
uk: Існують різні способи інтеграції нових реалізацій команд у distutils. Найважче — лобіювати включення нових функцій у sam distutils і чекати (і вимагати) версії Python, яка надає цю підтримку. Це дійсно важко з багатьох причин.

source: The most common, and possibly the most reasonable for most needs, is to include the new implementations with your :file:`setup.py` script, and cause the :func:`distutils.core.setup` function use them::
uk: Найпоширенішим і, можливо, найдоцільнішим для більшості потреб є включення нових реалізацій у ваш сценарій :file:`setup.py` і використання їх функцією :func:`distutils.core.setup`:

source: This approach is most valuable if the new implementations must be used to use a particular package, as everyone interested in the package will need to have the new command implementation.
uk: Цей підхід є найбільш цінним, якщо нові реалізації потрібно використовувати для використання конкретного пакета, оскільки кожен, хто зацікавлений у пакеті, повинен мати нову реалізацію команди.

source: Beginning with Python 2.4, a third option is available, intended to allow new commands to be added which can support existing :file:`setup.py` scripts without requiring modifications to the Python installation. This is expected to allow third-party extensions to provide support for additional packaging systems, but the commands can be used for anything distutils commands can be used for. A new configuration option, ``command_packages`` (command-line option :option:`!--command-packages`), can be used to specify additional packages to be searched for modules implementing commands. Like all distutils options, this can be specified on the command line or in a configuration file. This option can only be set in the ``[global]`` section of a configuration file, or before any commands on the command line. If set in a configuration file, it can be overridden from the command line; setting it to an empty string on the command line causes the default to be used. This should never be set in a configuration file provided with a package.
uk: Починаючи з Python 2.4, доступний третій параметр, призначений для додавання нових команд, які можуть підтримувати існуючі сценарії :file:`setup.py` без необхідності модифікації інсталяції Python. Очікується, що це дозволить стороннім розширенням надавати підтримку для додаткових систем пакування, але команди можна використовувати для будь-яких завдань, для яких можна використовувати команди distutils. Новий параметр конфігурації, ``command_packages`` (параметр командного рядка :option:`!--command-packages`), можна використовувати для визначення додаткових пакетів для пошуку модулів, що реалізують команди. Як і всі параметри distutils, це можна вказати в командному рядку або у файлі конфігурації. Цей параметр можна встановити лише в розділі ``[global]`` конфігураційного файлу або перед будь-якими командами в командному рядку. Якщо встановлено у файлі конфігурації, його можна змінити з командного рядка; встановлення його як порожнього рядка в командному рядку призводить до використання типового значення. Це ніколи не можна встановлювати у файлі конфігурації, що надається разом із пакетом.

source: This new option can be used to add any number of packages to the list of packages searched for command implementations; multiple package names should be separated by commas. When not specified, the search is only performed in the :mod:`distutils.command` package. When :file:`setup.py` is run with the option ``--command-packages distcmds,buildcmds``, however, the packages :mod:`distutils.command`, :mod:`distcmds`, and :mod:`buildcmds` will be searched in that order. New commands are expected to be implemented in modules of the same name as the command by classes sharing the same name. Given the example command line option above, the command :command:`bdist_openpkg` could be implemented by the class :class:`distcmds.bdist_openpkg.bdist_openpkg` or :class:`buildcmds.bdist_openpkg.bdist_openpkg`.
uk: Цю нову опцію можна використовувати для додавання будь-якої кількості пакунків до списку пакетів, у яких шукаються реалізації команд; кілька назв пакетів слід розділяти комами. Якщо не вказано, пошук виконується лише в пакеті :mod:`distutils.command`. Коли :file:`setup.py` запускається з параметром ``--command-packages distcmds,buildcmds``, проте пакунки :mod:`distutils.command`, :mod:`distcmds` і :mod:`buildcmds` шукатиметься в такому порядку. Очікується, що нові команди будуть реалізовані в модулях з тим же іменем, що й команда, класами, що мають таке ж ім’я. Враховуючи наведений вище приклад командного рядка, команду :command:`bdist_openpkg` можна реалізувати за допомогою класу :class:`distcmds.bdist_openpkg.bdist_openpkg` або :class:`buildcmds.bdist_openpkg.bdist_openpkg`.

source: Adding new distribution types
uk: Додавання нових типів розподілу

source: Commands that create distributions (files in the :file:`dist/` directory) need to add ``(command, filename)`` pairs to ``self.distribution.dist_files`` so that :command:`upload` can upload it to PyPI. The *filename* in the pair contains no path information, only the name of the file itself. In dry-run mode, pairs should still be added to represent what would have been created.
uk: Команди, які створюють дистрибутиви (файли в каталозі :file:`dist/`), повинні додати пари ``(command, filename)`` до ``self.distribution.dist_files``, щоб :command:`upload` міг завантажувати це в PyPI. *Назва файлу* в парі не містить інформації про шлях, лише назву самого файлу. У режимі сухого запуску пари все одно повинні бути додані, щоб представити те, що було б створено.
