Repository: python/python-docs-uk
Catalog: distutils/setupscript.po
Languages: uk

source: On the other hand, this doesn't help the developer to find the cause of the failure. For this purpose, the :envvar:`DISTUTILS_DEBUG` environment variable can be set to anything except an empty string, and distutils will now print detailed information about what it is doing, dump the full traceback when an exception occurs, and print the whole command line when an external program (like a C compiler) fails.
uk: З іншого боку, це не допомагає розробнику знайти причину збою. З цією метою для змінної середовища :envvar:`DISTUTILS_DEBUG` можна встановити будь-яке значення, окрім порожнього рядка, і distutils тепер друкуватиме детальну інформацію про те, що він робить, створюватиме повну трасування, коли станеться виняткова ситуація, і друкуватиме всю команду рядок, коли зовнішня програма (наприклад, компілятор C) дає збій.
