Repository: python/python-docs-uk
Catalog: distutils/setupscript.po
Languages: uk

source: For example, if you need to link against libraries known to be in the standard library search path on target systems ::
uk: Наприклад, якщо вам потрібно зв’язатися з бібліотеками, які, як відомо, знаходяться в стандартному шляху пошуку бібліотек у цільових системах ::

source: If you need to link with libraries in a non-standard location, you'll have to include the location in ``library_dirs``::
uk: Якщо вам потрібно зв’язатися з бібліотеками в нестандартному розташуванні, вам доведеться включити це розташування в ``library_dirs``::

source: (Again, this sort of non-portable construct should be avoided if you intend to distribute your code.)
uk: (Знову ж таки, такого роду непереносимих конструкцій слід уникати, якщо ви маєте намір поширювати свій код.)

source: Other options
uk: Інші варіанти

source: There are still some other options which can be used to handle special cases.
uk: Є ще деякі інші параметри, які можна використовувати для обробки особливих випадків.

source: The ``optional`` option is a boolean; if it is true, a build failure in the extension will not abort the build process, but instead simply not install the failing extension.
uk: Параметр ``optional`` є логічним; якщо це правда, помилка збірки в розширенні не призведе до переривання процесу збірки, а натомість просто не встановить помилкове розширення.

source: The ``extra_objects`` option is a list of object files to be passed to the linker. These files must not have extensions, as the default extension for the compiler is used.
uk: Параметр ``extra_objects`` - це список об'єктних файлів, які будуть передані компонувальнику. Ці файли не повинні мати розширень, оскільки використовується розширення за замовчуванням для компілятора.

source: ``extra_compile_args`` and ``extra_link_args`` can be used to specify additional command line options for the respective compiler and linker command lines.
uk: ``extra_compile_args`` і ``extra_link_args`` можна використовувати для визначення додаткових параметрів командного рядка для відповідних командних рядків компілятора та компонувальника.

source: ``export_symbols`` is only useful on Windows. It can contain a list of symbols (functions or variables) to be exported. This option is not needed when building compiled extensions: Distutils will automatically add ``initmodule`` to the list of exported symbols.
uk: ``export_symbols`` корисний лише в Windows. Він може містити список символів (функцій або змінних), які потрібно експортувати. Ця опція не потрібна під час створення скомпільованих розширень: Distutils автоматично додасть ``initmodule`` до списку експортованих символів.

source: The ``depends`` option is a list of files that the extension depends on (for example header files). The build command will call the compiler on the sources to rebuild extension if any on this files has been modified since the previous build.
uk: Параметр ``depends`` — це список файлів, від яких залежить розширення (наприклад, файли заголовків). Команда збірки викличе компілятор вихідних кодів, щоб відновити розширення, якщо якісь у цих файлах було змінено з часу попередньої збірки.

source: Relationships between Distributions and Packages
uk: Відносини між дистрибутивами та пакетами

source: A distribution may relate to packages in three specific ways:
uk: Розповсюдження може стосуватися пакетів трьома конкретними способами:

source: It can require packages or modules.
uk: Для цього можуть знадобитися пакети або модулі.

source: It can provide packages or modules.
uk: Він може надавати пакети або модулі.

source: It can obsolete packages or modules.
uk: Це може застаріти пакети або модулі.

source: These relationships can be specified using keyword arguments to the :func:`distutils.core.setup` function.
uk: Ці зв’язки можна вказати за допомогою ключових аргументів функції :func:`distutils.core.setup`.

source: Dependencies on other Python modules and packages can be specified by supplying the *requires* keyword argument to :func:`setup`. The value must be a list of strings. Each string specifies a package that is required, and optionally what versions are sufficient.
uk: Залежності від інших модулів і пакетів Python можна вказати, надавши аргумент ключового слова *requires* для :func:`setup`. Значення має бути списком рядків. Кожен рядок визначає необхідний пакет і, за бажанням, достатні версії.

source: To specify that any version of a module or package is required, the string should consist entirely of the module or package name. Examples include ``'mymodule'`` and ``'xml.parsers.expat'``.
uk: Щоб вказати, що потрібна будь-яка версія модуля чи пакета, рядок має повністю складатися з назви модуля чи пакета. Приклади включають ``'mymodule`` і ``'xml.parsers.expat''``.

source: If specific versions are required, a sequence of qualifiers can be supplied in parentheses. Each qualifier may consist of a comparison operator and a version number. The accepted comparison operators are::
uk: Якщо потрібні певні версії, у дужках можна вказати послідовність кваліфікаторів. Кожен кваліфікатор може складатися з оператора порівняння та номера версії. Прийнятні оператори порівняння:

source: These can be combined by using multiple qualifiers separated by commas (and optional whitespace). In this case, all of the qualifiers must be matched; a logical AND is used to combine the evaluations.
uk: Їх можна комбінувати за допомогою кількох кваліфікаторів, розділених комами (і необов’язковими пробілами). У цьому випадку всі кваліфікатори повинні збігатися; логічне І використовується для об’єднання оцінок.

source: Let's look at a bunch of examples:
uk: Давайте розглянемо кілька прикладів:

source: Requires Expression
uk: Вимагає експресії

source: Explanation
uk: Пояснення

source: Only version ``1.0`` is compatible
uk: Лише версія ``1.0`` сумісна

source: Any version after ``1.0`` and before ``2.0`` is compatible, except ``1.5.1``
uk: Будь-яка версія після ``1.0`` і до ``2.0`` сумісна, крім ``1.5.1``

source: Now that we can specify dependencies, we also need to be able to specify what we provide that other distributions can require. This is done using the *provides* keyword argument to :func:`setup`. The value for this keyword is a list of strings, each of which names a Python module or package, and optionally identifies the version. If the version is not specified, it is assumed to match that of the distribution.
uk: Тепер, коли ми можемо вказати залежності, нам також потрібно мати можливість вказати, що ми надаємо, що можуть вимагати інші дистрибутиви. Це робиться за допомогою ключового аргументу *provides* для :func:`setup`. Значення цього ключового слова — це список рядків, кожен з яких іменує модуль або пакет Python і, за бажанням, визначає версію. Якщо версія не вказана, вважається, що вона відповідає версії дистрибутива.

source: Some examples:
uk: Деякі приклади:

source: Provides Expression
uk: Забезпечує експресію

source: Provide ``mypkg``, using the distribution version
uk: Надайте ``mypkg``, використовуючи версію розповсюдження

source: Provide ``mypkg`` version 1.1, regardless of the distribution version
uk: Надайте ``mypkg`` версії 1.1, незалежно від версії дистрибутива

source: A package can declare that it obsoletes other packages using the *obsoletes* keyword argument. The value for this is similar to that of the *requires* keyword: a list of strings giving module or package specifiers. Each specifier consists of a module or package name optionally followed by one or more version qualifiers. Version qualifiers are given in parentheses after the module or package name.
uk: Пакунок може оголосити, що він застарів іншим пакункам за допомогою аргументу ключового слова *obsoletes*. Значення для цього подібне до значення ключового слова *requires*: список рядків, що надають специфікатори модуля або пакета. Кожен специфікатор складається з назви модуля або пакета, за якою необов’язково слідують один або більше кваліфікаторів версії. Специфікатори версії наведені в круглих дужках після назви модуля або пакета.

source: The versions identified by the qualifiers are those that are obsoleted by the distribution being described. If no qualifiers are given, all versions of the named module or package are understood to be obsoleted.
uk: Версії, визначені кваліфікаторами, є тими, які застаріли через описуваний розподіл. Якщо кваліфікатори не вказано, усі версії названого модуля або пакета вважаються застарілими.

source: Installing Scripts
uk: Встановлення скриптів

source: So far we have been dealing with pure and non-pure Python modules, which are usually not run by themselves but imported by scripts.
uk: Поки що ми мали справу з чистими та нечистими модулями Python, які зазвичай не запускаються самостійно, а імпортуються за допомогою сценаріїв.

source: Scripts are files containing Python source code, intended to be started from the command line. Scripts don't require Distutils to do anything very complicated. The only clever feature is that if the first line of the script starts with ``#!`` and contains the word "python", the Distutils will adjust the first line to refer to the current interpreter location. By default, it is replaced with the current interpreter location. The :option:`!--executable` (or :option:`!-e`) option will allow the interpreter path to be explicitly overridden.
uk: Сценарії — це файли, що містять вихідний код Python і призначені для запуску з командного рядка. Сценарії не вимагають від Distutils виконання чогось дуже складного. Єдина розумна функція полягає в тому, що якщо перший рядок сценарію починається з ``#!`` і містить слово "python", Distutils відкоригує перший рядок відповідно до поточного розташування інтерпретатора. За замовчуванням його замінено на поточне розташування інтерпретатора. Параметр :option:`!--executable` (або :option:`!-e`) дозволить явно перевизначати шлях інтерпретатора.

source: The ``scripts`` option simply is a list of files to be handled in this way. From the PyXML setup script::
uk: Параметр ``scripts`` — це просто список файлів, які потрібно обробляти таким чином. Зі сценарію налаштування PyXML::

source: All the scripts will also be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
uk: Усі сценарії також буде додано до файлу ``MANIFEST``, якщо шаблон не надано. Див. :ref:`manifest`.

source: Installing Package Data
uk: Встановлення пакетних даних

source: Often, additional files need to be installed into a package. These files are often data that's closely related to the package's implementation, or text files containing documentation that might be of interest to programmers using the package. These files are called :dfn:`package data`.
uk: Часто в пакет потрібно інсталювати додаткові файли. Ці файли часто є даними, тісно пов’язаними з реалізацією пакета, або текстовими файлами, що містять документацію, яка може зацікавити програмістів, які використовують пакет. Ці файли називаються :dfn:`package data`.

source: Package data can be added to packages using the ``package_data`` keyword argument to the :func:`setup` function. The value must be a mapping from package name to a list of relative path names that should be copied into the package. The paths are interpreted as relative to the directory containing the package (information from the ``package_dir`` mapping is used if appropriate); that is, the files are expected to be part of the package in the source directories. They may contain glob patterns as well.
uk: Дані пакетів можна додати до пакетів за допомогою ключового аргументу ``package_data`` функції :func:`setup`. Значення має бути зіставленням назви пакета зі списком відносних імен шляхів, які слід скопіювати в пакет. Шляхи інтерпретуються як відносні до каталогу, що містить пакунок (інформація з відображення ``package_dir`` використовується, якщо це доречно); тобто очікується, що файли будуть частиною пакета у вихідних каталогах. Вони також можуть містити глобуси.

source: The path names may contain directory portions; any necessary directories will be created in the installation.
uk: Назви шляхів можуть містити частини каталогу; усі необхідні каталоги будуть створені під час встановлення.

source: For example, if a package should contain a subdirectory with several data files, the files can be arranged like this in the source tree::
uk: Наприклад, якщо пакунок має містити підкаталог із кількома файлами даних, файли можна розташувати таким чином у вихідному дереві:

source: The corresponding call to :func:`setup` might be::
uk: Відповідний виклик :func:`setup` може бути::

source: All the files that match ``package_data`` will be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
uk: Усі файли, які відповідають ``package_data``, будуть додані до ``MANIFEST`` файлу, якщо шаблон не надано. Див. :ref:`manifest`.

source: Installing Additional Files
uk: Встановлення додаткових файлів

source: The ``data_files`` option can be used to specify additional files needed by the module distribution: configuration files, message catalogs, data files, anything which doesn't fit in the previous categories.
uk: Параметр ``data_files`` можна використовувати для визначення додаткових файлів, необхідних для розповсюдження модуля: конфігураційні файли, каталоги повідомлень, файли даних, будь-що, що не підходить до попередніх категорій.

source: ``data_files`` specifies a sequence of (*directory*, *files*) pairs in the following way::
uk: ``data_files`` визначає послідовність пар (*каталог*, *файли*) таким чином:

source: Each (*directory*, *files*) pair in the sequence specifies the installation directory and the files to install there.
uk: Кожна пара (*каталог*, *файли*) у послідовності визначає каталог інсталяції та файли для інсталяції.

source: Each file name in *files* is interpreted relative to the :file:`setup.py` script at the top of the package source distribution. Note that you can specify the directory where the data files will be installed, but you cannot rename the data files themselves.
uk: Кожне ім’я файлу в *files* інтерпретується відносно сценарію :file:`setup.py` у верхній частині вихідного коду пакета. Зверніть увагу, що ви можете вказати каталог, куди будуть встановлені файли даних, але ви не можете перейменувати самі файли даних.

source: The *directory* should be a relative path. It is interpreted relative to the installation prefix (Python's ``sys.prefix`` for system installations; ``site.USER_BASE`` for user installations). Distutils allows *directory* to be an absolute installation path, but this is discouraged since it is incompatible with the wheel packaging format. No directory information from *files* is used to determine the final location of the installed file; only the name of the file is used.
uk: *Каталог* має бути відносним шляхом. Він інтерпретується відносно префікса встановлення (``sys.prefix`` Python для системних установок; ``site.USER_BASE`` для установок користувача). Distutils дозволяє *каталог* бути абсолютним шляхом встановлення, але це не рекомендується, оскільки це несумісно з форматом упаковки коліс. Для визначення кінцевого розташування встановленого файлу інформація про каталог із *файлів* не використовується; використовується лише ім'я файлу.

source: You can specify the ``data_files`` options as a simple sequence of files without specifying a target directory, but this is not recommended, and the :command:`install` command will print a warning in this case. To install data files directly in the target directory, an empty string should be given as the directory.
uk: Ви можете вказати параметри ``data_files`` як просту послідовність файлів без вказівки цільового каталогу, але це не рекомендується, і команда :command:`install` у цьому випадку виведе попередження. Щоб установити файли даних безпосередньо в цільовий каталог, як каталог слід вказати порожній рядок.

source: All the files that match ``data_files`` will be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
uk: Усі файли, які відповідають ``data_files``, будуть додані до ``MANIFEST`` файлу, якщо шаблон не надано. Див. :ref:`manifest`.

source: Additional meta-data
uk: Додаткові метадані

source: The setup script may include additional meta-data beyond the name and version. This information includes:
uk: Сценарій налаштування може містити додаткові метадані, окрім імені та версії. Ця інформація включає:

source: Meta-Data
uk: Мета-дані

source: Description
uk: опис

source: Value
uk: Значення

source: Notes
uk: Примітки

source: ``name``
uk: ``ім'я``

source: name of the package
uk: назву пакета

source: short string
uk: короткий рядок

source: ``version``
uk: ``версія``

source: version of this release
uk: версія цього випуску

source: ``author``
uk: ``автор``

source: package author's name
uk: ім'я автора пакета

source: email address of the package author
uk: адреса електронної пошти автора пакета

source: email address
uk: адреса електронної пошти

source: ``maintainer``
uk: ``підтримувач``

source: package maintainer's name
uk: ім'я супроводжуючого пакета

source: email address of the package maintainer
uk: адреса електронної пошти супроводжуючого пакет

source: home page for the package
uk: домашня сторінка для пакета

source: ``description``
uk: ``опис``

source: short, summary description of the package
uk: короткий короткий опис пакету

source: ``long_description``
uk: ``довгий_опис``

source: longer description of the package
uk: додатковий опис пакета

source: long string
uk: довгий рядок

source: ``download_url``
uk: URL-адреса_завантаження

source: location where the package may be downloaded
uk: місце, де можна завантажити пакет

source: ``classifiers``
uk: ``класифікатори``

source: a list of classifiers
uk: список класифікаторів

source: list of strings
uk: список рядків

source: ``platforms``
uk: ``платформи``

source: a list of platforms
uk: список платформ

source: ``keywords``
uk: ``ключові слова``

source: a list of keywords
uk: список ключових слів

source: ``license``
uk: ``ліцензія``

source: license for the package
uk: ліцензія на пакет

source: Notes:
uk: Примітки:

source: These fields are required.
uk: Ці поля є обов’язковими.

source: It is recommended that versions take the form *major.minor[.patch[.sub]]*.
uk: Рекомендується, щоб версії мали форму *major.minor[.patch[.sub]]*.

source: Either the author or the maintainer must be identified. If maintainer is provided, distutils lists it as the author in :file:`PKG-INFO`.
uk: Має бути ідентифікований або автор, або супроводжувач. Якщо вказано супроводжуючого, distutils вказує його як автора в :file:`PKG-INFO`.

source: The ``long_description`` field is used by PyPI when you publish a package, to build its project page.
uk: Поле ``long_description`` використовується PyPI, коли ви публікуєте пакет, для створення його сторінки проекту.

source: The ``license`` field is a text indicating the license covering the package where the license is not a selection from the "License" Trove classifiers. See the ``Classifier`` field. Notice that there's a ``licence`` distribution option which is deprecated but still acts as an alias for ``license``.
uk: Поле "ліцензія" — це текст, що вказує на ліцензію, що охоплює пакет, де ліцензія не є вибором із класифікаторів Trove "Ліцензії". Перегляньте поле ``Класифікатор``. Зауважте, що існує опція розповсюдження ``ліцензія``, яка є застарілою, але все ще діє як псевдонім для ``ліцензії``.

source: This field must be a list.
uk: Це поле має бути списком.

source: The valid classifiers are listed on `PyPI <https://pypi.org/classifiers>`_.
uk: Дійсні класифікатори перераховані на `PyPI <https://pypi.org/classifiers>`_.

source: To preserve backward compatibility, this field also accepts a string. If you pass a comma-separated string ``'foo, bar'``, it will be converted to ``['foo', 'bar']``, Otherwise, it will be converted to a list of one string.
uk: Щоб зберегти зворотну сумісність, це поле також приймає рядок. Якщо ви передасте розділений комами рядок ``'foo, bar''``, він буде перетворений на ``['foo', 'bar']``, інакше він буде перетворений на список з одного рядка.

source: 'short string'
uk: 'короткий рядок'

source: A single line of text, not more than 200 characters.
uk: Один рядок тексту, не більше 200 символів.

source: 'long string'
uk: "довгий рядок"

source: 'list of strings'
uk: 'список рядків'

source: See below.
uk: Дивіться нижче.

source: Encoding the version information is an art in itself. Python packages generally adhere to the version format *major.minor[.patch][sub]*. The major number is 0 for initial, experimental releases of software. It is incremented for releases that represent major milestones in a package. The minor number is incremented when important new features are added to the package. The patch number increments when bug-fix releases are made. Additional trailing version information is sometimes used to indicate sub-releases. These are "a1,a2,...,aN" (for alpha releases, where functionality and API may change), "b1,b2,...,bN" (for beta releases, which only fix bugs) and "pr1,pr2,...,prN" (for final pre-release release testing). Some examples:
uk: Кодування інформації про версію — це саме по собі мистецтво. Пакунки Python зазвичай мають формат версії *major.minor[.patch][sub]*. Основне число — 0 для початкових, експериментальних версій програмного забезпечення. Він збільшується для випусків, які представляють основні віхи в пакеті. Менше число збільшується, коли до пакета додаються важливі нові функції. Номер виправлення збільшується, коли випускаються випуски виправлень помилок. Додаткова кінцева інформація про версію іноді використовується для позначення підрелізів. Це "a1,a2,...,aN" (для альфа-версій, де функціональність і API можуть змінюватися), "b1,b2,...,bN" (для бета-версій, які лише виправляють помилки) і "pr1 ,pr2,...,prN" (для остаточного тестування перед випуском). Деякі приклади:

source: the first, experimental release of a package
uk: перший, експериментальний випуск пакету

source: the second alpha release of the first patch version of 1.0
uk: друга альфа-версія першої версії патча 1.0

source: ``classifiers`` must be specified in a list::
uk: ``класифікатори`` повинні бути вказані в списку::

source: :class:`~distutils.core.setup` now warns when ``classifiers``, ``keywords`` or ``platforms`` fields are not specified as a list or a string.
uk: :class:`~distutils.core.setup` тепер попереджає, коли поля ``класифікатори``, ``ключові слова`` або ``платформи`` не вказані як список або рядок.

source: Debugging the setup script
uk: Налагодження сценарію налаштування

source: Sometimes things go wrong, and the setup script doesn't do what the developer wants.
uk: Іноді щось йде не так, і сценарій налаштування не виконує те, що хоче розробник.

source: Distutils catches any exceptions when running the setup script, and print a simple error message before the script is terminated. The motivation for this behaviour is to not confuse administrators who don't know much about Python and are trying to install a package. If they get a big long traceback from deep inside the guts of Distutils, they may think the package or the Python installation is broken because they don't read all the way down to the bottom and see that it's a permission problem.
uk: Distutils вловлює будь-які винятки під час запуску сценарію налаштування та друкує просте повідомлення про помилку перед завершенням сценарію. Мотивація такої поведінки полягає в тому, щоб не заплутати адміністраторів, які мало знають про Python і намагаються встановити пакет. Якщо вони отримають велике довге відстеження з глибини нутрощів Distutils, вони можуть подумати, що пакет або інсталяція Python зламані, оскільки вони не прочитали весь шлях до кінця й побачать, що це проблема з дозволом.
