Repository: python/python-docs-uk
Catalog: distutils/setupscript.po
Languages: uk

source: Writing the Setup Script
uk: Написання сценарію налаштування

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
uk: Цей документ зберігається лише до тих пір, поки документація ``setuptools`` за адресою https://setuptools.readthedocs.io/en/latest/setuptools.html окремо не охопить всю відповідну інформацію, яка зараз включена тут.

source: The setup script is the centre of all activity in building, distributing, and installing modules using the Distutils. The main purpose of the setup script is to describe your module distribution to the Distutils, so that the various commands that operate on your modules do the right thing. As we saw in section :ref:`distutils-simple-example` above, the setup script consists mainly of a call to :func:`setup`, and most information supplied to the Distutils by the module developer is supplied as keyword arguments to :func:`setup`.
uk: Сценарій встановлення є центром усієї діяльності зі створення, розповсюдження та встановлення модулів за допомогою Distutils. Основна мета сценарію налаштування — описати розповсюдження ваших модулів у Distutils, щоб різні команди, що працюють із вашими модулями, працювали правильно. Як ми бачили в розділі :ref:`distutils-simple-example` вище, сценарій налаштування складається в основному з виклику :func:`setup`, і більшість інформації, яку надає Distutils розробник модуля, надається як аргументи ключового слова до :func:`setup`.

source: Here's a slightly more involved example, which we'll follow for the next couple of sections: the Distutils' own setup script. (Keep in mind that although the Distutils are included with Python 1.6 and later, they also have an independent existence so that Python 1.5.2 users can use them to install other module distributions. The Distutils' own setup script, shown here, is used to install the package into Python 1.5.2.) ::
uk: Ось трохи складніший приклад, який ми розглянемо в наступних кількох розділах: власний сценарій налаштування Distutils. (Майте на увазі, що незважаючи на те, що Distutils включено до Python 1.6 і пізніших версій, вони також існують незалежно, тому користувачі Python 1.5.2 можуть використовувати їх для встановлення інших дистрибутивів модулів. Використовується власний сценарій налаштування Distutils, показаний тут щоб інсталювати пакет у Python 1.5.2.) ::

source: There are only two differences between this and the trivial one-file distribution presented in section :ref:`distutils-simple-example`: more metadata, and the specification of pure Python modules by package, rather than by module. This is important since the Distutils consist of a couple of dozen modules split into (so far) two packages; an explicit list of every module would be tedious to generate and difficult to maintain. For more information on the additional meta-data, see section :ref:`meta-data`.
uk: Існує лише дві відмінності між цим і тривіальним однофайловим розподілом, представленим у розділі :ref:`distutils-simple-example`: більше метаданих і специфікація чистих модулів Python за пакетом, а не за модулем. Це важливо, оскільки Distutils складається з кількох десятків модулів, розділених на (поки що) два пакети; явний список кожного модуля було б стомлюючим для створення та важким для підтримки. Для отримання додаткової інформації про додаткові метадані перегляньте розділ :ref:`meta-data`.

source: Note that any pathnames (files or directories) supplied in the setup script should be written using the Unix convention, i.e. slash-separated. The Distutils will take care of converting this platform-neutral representation into whatever is appropriate on your current platform before actually using the pathname. This makes your setup script portable across operating systems, which of course is one of the major goals of the Distutils. In this spirit, all pathnames in this document are slash-separated.
uk: Зауважте, що будь-які імена шляхів (файлів або каталогів), надані в сценарії встановлення, мають бути записані з використанням конвенції Unix, тобто розділені рискою. Distutils подбає про перетворення цього нейтрального щодо платформи представлення у те, що підходить для вашої поточної платформи, перш ніж фактично використовувати шлях. Це робить ваш сценарій налаштування переносимим між операційними системами, що, звичайно, є однією з головних цілей Distutils. У цьому дусі всі назви шляхів у цьому документі розділені косою рискою.

source: This, of course, only applies to pathnames given to Distutils functions. If you, for example, use standard Python functions such as :func:`glob.glob` or :func:`os.listdir` to specify files, you should be careful to write portable code instead of hardcoding path separators::
uk: Звичайно, це стосується лише імен шляхів, наданих функціям Distutils. Якщо ви, наприклад, використовуєте стандартні функції Python, такі як :func:`glob.glob` або :func:`os.listdir` для вказування файлів, вам слід бути обережними, щоб писати портативний код замість жорсткого кодування роздільників шляхів::

source: Listing whole packages
uk: Перелік цілих пакетів

source: The ``packages`` option tells the Distutils to process (build, distribute, install, etc.) all pure Python modules found in each package mentioned in the ``packages`` list. In order to do this, of course, there has to be a correspondence between package names and directories in the filesystem. The default correspondence is the most obvious one, i.e. package :mod:`distutils` is found in the directory :file:`distutils` relative to the distribution root. Thus, when you say ``packages = ['foo']`` in your setup script, you are promising that the Distutils will find a file :file:`foo/__init__.py` (which might be spelled differently on your system, but you get the idea) relative to the directory where your setup script lives. If you break this promise, the Distutils will issue a warning but still process the broken package anyway.
uk: Параметр ``packages`` повідомляє Distutils обробляти (збирати, розповсюджувати, інсталювати тощо) усі чисті модулі Python, знайдені в кожному пакеті, згаданому у списку ``packages``. Для цього, звичайно, має бути відповідність між назвами пакетів і каталогами у файловій системі. Типова відповідність є найбільш очевидною, тобто пакунок :mod:`distutils` знаходиться в каталозі :file:`distutils` відносно кореня дистрибутива. Таким чином, коли ви кажете ``packages = ['foo']`` у вашому сценарії встановлення, ви обіцяєте, що Distutils знайде файл :file:`foo/__init__.py` (який може бути написаний інакше у вашій системі , але ви зрозуміли) відносно каталогу, де знаходиться ваш сценарій налаштування. Якщо ви порушите цю обіцянку, Distutils видасть попередження, але все одно обробить зламаний пакет.

source: If you use a different convention to lay out your source directory, that's no problem: you just have to supply the ``package_dir`` option to tell the Distutils about your convention. For example, say you keep all Python source under :file:`lib`, so that modules in the "root package" (i.e., not in any package at all) are in :file:`lib`, modules in the :mod:`foo` package are in :file:`lib/foo`, and so forth. Then you would put ::
uk: Якщо ви використовуєте іншу угоду для компонування вихідного каталогу, це не проблема: вам просто потрібно вказати опцію ``package_dir``, щоб повідомити Distutils про вашу угоду. Наприклад, припустимо, що ви зберігаєте всі джерела Python у :file:`lib`, так що модулі в "кореневому пакеті" (тобто не в будь-якому пакеті взагалі) знаходяться в :file:`lib`, а модулі в Пакет :mod:`foo` міститься в :file:`lib/foo` і так далі. Тоді ви б поставили ::

source: in your setup script. The keys to this dictionary are package names, and an empty package name stands for the root package. The values are directory names relative to your distribution root. In this case, when you say ``packages = ['foo']``, you are promising that the file :file:`lib/foo/__init__.py` exists.
uk: у вашому сценарії налаштування. Ключами до цього словника є імена пакетів, а порожня назва пакета означає кореневий пакет. Значення – це імена каталогів відносно кореня дистрибутива. У цьому випадку, коли ви кажете ``packages = ['foo']``, ви обіцяєте, що файл :file:`lib/foo/__init__.py` існує.

source: Another possible convention is to put the :mod:`foo` package right in :file:`lib`, the :mod:`foo.bar` package in :file:`lib/bar`, etc. This would be written in the setup script as ::
uk: Іншою можливою угодою є розміщення пакета :mod:`foo` безпосередньо в :file:`lib`, пакета :mod:`foo.bar` в :file:`lib/bar` тощо. Це буде написано в сценарій налаштування як ::

source: A ``package: dir`` entry in the ``package_dir`` dictionary implicitly applies to all packages below *package*, so the :mod:`foo.bar` case is automatically handled here. In this example, having ``packages = ['foo', 'foo.bar']`` tells the Distutils to look for :file:`lib/__init__.py` and :file:`lib/bar/__init__.py`. (Keep in mind that although ``package_dir`` applies recursively, you must explicitly list all packages in ``packages``: the Distutils will *not* recursively scan your source tree looking for any directory with an :file:`__init__.py` file.)
uk: Запис ``package: dir`` у словнику ``package_dir`` неявно застосовується до всіх пакунків нижче *package*, тому тут автоматично обробляється випадок :mod:`foo.bar`. У цьому прикладі наявність ``packages = ['foo', 'foo.bar']`` повідомляє Distutils шукати :file:`lib/__init__.py` і :file:`lib/bar/__init__.py`. (Майте на увазі, що хоча ``package_dir`` застосовується рекурсивно, ви повинні явно перерахувати всі пакунки в ``packages``: Distutils *не* рекурсивно скануватиме ваше вихідне дерево в пошуках будь-якого каталогу з :file:`__init__. py` файл.)

source: Listing individual modules
uk: Перелік окремих модулів

source: For a small module distribution, you might prefer to list all modules rather than listing packages---especially the case of a single module that goes in the "root package" (i.e., no package at all). This simplest case was shown in section :ref:`distutils-simple-example`; here is a slightly more involved example::
uk: Для невеликого розповсюдження модулів ви можете віддати перевагу переліку всіх модулів, а не переліку пакунків --- особливо у випадку окремого модуля, який міститься в "кореневому пакеті" (тобто без пакета взагалі). Цей найпростіший випадок було показано в розділі :ref:`distutils-simple-example`; ось трохи складніший приклад::

source: This describes two modules, one of them in the "root" package, the other in the :mod:`pkg` package. Again, the default package/directory layout implies that these two modules can be found in :file:`mod1.py` and :file:`pkg/mod2.py`, and that :file:`pkg/__init__.py` exists as well. And again, you can override the package/directory correspondence using the ``package_dir`` option.
uk: Це описує два модулі, один з них у кореневому пакеті, інший у пакеті :mod:`pkg`. Знову ж таки, макет пакета/каталогу за замовчуванням означає, що ці два модулі можна знайти в :file:`mod1.py` і :file:`pkg/mod2.py`, і що :file:`pkg/__init__.py` існує так само. І знову ж таки, ви можете змінити відповідність пакета/каталогу за допомогою параметра ``package_dir``.

source: Describing extension modules
uk: Опис модулів розширення

source: Just as writing Python extension modules is a bit more complicated than writing pure Python modules, describing them to the Distutils is a bit more complicated. Unlike pure modules, it's not enough just to list modules or packages and expect the Distutils to go out and find the right files; you have to specify the extension name, source file(s), and any compile/link requirements (include directories, libraries to link with, etc.).
uk: Подібно до того, як написання модулів розширення Python є дещо складнішим, ніж написання чистих модулів Python, описувати їх у Distutils дещо складніше. На відміну від чистих модулів, недостатньо просто перерахувати модулі чи пакети й очікувати, що Distutils вийдуть і знайдуть потрібні файли; ви повинні вказати ім’я розширення, вихідний(і) файл(и) та будь-які вимоги до компіляції/посилання (включно з каталогами, бібліотеками для зв’язування тощо).

source: All of this is done through another keyword argument to :func:`setup`, the ``ext_modules`` option. ``ext_modules`` is just a list of :class:`~distutils.core.Extension` instances, each of which describes a single extension module. Suppose your distribution includes a single extension, called :mod:`foo` and implemented by :file:`foo.c`. If no additional instructions to the compiler/linker are needed, describing this extension is quite simple::
uk: Все це робиться за допомогою іншого ключового аргументу :func:`setup`, параметра ``ext_modules``. ``ext_modules`` - це лише список екземплярів :class:`~distutils.core.Extension`, кожен з яких описує окремий модуль розширення. Припустімо, що ваш дистрибутив містить одне розширення, яке називається :mod:`foo` і реалізоване :file:`foo.c`. Якщо додаткові інструкції для компілятора/лінкера не потрібні, описати це розширення досить просто:

source: The :class:`Extension` class can be imported from :mod:`distutils.core` along with :func:`setup`. Thus, the setup script for a module distribution that contains only this one extension and nothing else might be::
uk: Клас :class:`Extension` можна імпортувати з :mod:`distutils.core` разом із :func:`setup`. Таким чином, сценарій налаштування для розповсюдження модуля, який містить лише це одне розширення і нічого іншого, може бути:

source: The :class:`Extension` class (actually, the underlying extension-building machinery implemented by the :command:`build_ext` command) supports a great deal of flexibility in describing Python extensions, which is explained in the following sections.
uk: Клас :class:`Extension` (фактично базовий механізм створення розширень, реалізований командою :command:`build_ext`) підтримує велику гнучкість в описі розширень Python, що пояснюється в наступних розділах.

source: Extension names and packages
uk: Назви розширень і пакети

source: The first argument to the :class:`~distutils.core.Extension` constructor is always the name of the extension, including any package names. For example, ::
uk: Першим аргументом конструктора :class:`~distutils.core.Extension` завжди є ім’я розширення, включаючи будь-які імена пакетів. Наприклад, ::

source: describes an extension that lives in the root package, while ::
uk: описує розширення, яке знаходиться в кореневому пакеті, а ::

source: describes the same extension in the :mod:`pkg` package. The source files and resulting object code are identical in both cases; the only difference is where in the filesystem (and therefore where in Python's namespace hierarchy) the resulting extension lives.
uk: описує те саме розширення в пакеті :mod:`pkg`. Вихідні файли та отриманий об’єктний код ідентичні в обох випадках; єдина різниця полягає в тому, де у файловій системі (і, отже, де в ієрархії простору імен Python) живе результуюче розширення.

source: If you have a number of extensions all in the same package (or all under the same base package), use the ``ext_package`` keyword argument to :func:`setup`. For example, ::
uk: Якщо у вас є декілька розширень в одному пакеті (або всі в одному базовому пакеті), використовуйте аргумент ключового слова ``ext_package`` для :func:`setup`. Наприклад, ::

source: will compile :file:`foo.c` to the extension :mod:`pkg.foo`, and :file:`bar.c` to :mod:`pkg.subpkg.bar`.
uk: скомпілює :file:`foo.c` до розширення :mod:`pkg.foo`, а :file:`bar.c` до :mod:`pkg.subpkg.bar`.

source: Extension source files
uk: Вихідні файли розширення

source: The second argument to the :class:`~distutils.core.Extension` constructor is a list of source files. Since the Distutils currently only support C, C++, and Objective-C extensions, these are normally C/C++/Objective-C source files. (Be sure to use appropriate extensions to distinguish C++ source files: :file:`.cc` and :file:`.cpp` seem to be recognized by both Unix and Windows compilers.)
uk: Другим аргументом конструктора :class:`~distutils.core.Extension` є список вихідних файлів. Оскільки Distutils наразі підтримують лише розширення C, C++ і Objective-C, зазвичай це вихідні файли C/C++/Objective-C. (Обов’язково використовуйте відповідні розширення, щоб розрізняти вихідні файли C++: :file:`.cc` і :file:`.cpp`, здається, розпізнаються як компіляторами Unix, так і Windows.)

source: However, you can also include SWIG interface (:file:`.i`) files in the list; the :command:`build_ext` command knows how to deal with SWIG extensions: it will run SWIG on the interface file and compile the resulting C/C++ file into your extension.
uk: Однак ви також можете включити файли інтерфейсу SWIG (:file:`.i`) до списку; Команда :command:`build_ext` знає, як працювати з розширеннями SWIG: вона запустить SWIG у файлі інтерфейсу та скомпілює отриманий файл C/C++ у ваше розширення.

source: This warning notwithstanding, options to SWIG can be currently passed like this::
uk: Незважаючи на це попередження, наразі параметри для SWIG можна передати так:

source: Or on the commandline like this::
uk: Або в командному рядку так::

source: On some platforms, you can include non-source files that are processed by the compiler and included in your extension. Currently, this just means Windows message text (:file:`.mc`) files and resource definition (:file:`.rc`) files for Visual C++. These will be compiled to binary resource (:file:`.res`) files and linked into the executable.
uk: На деяких платформах ви можете включити не вихідні файли, які оброблені компілятором і включені у ваше розширення. Наразі це лише файли текстових повідомлень Windows (:file:`.mc`) і файли визначення ресурсів (:file:`.rc`) для Visual C++. Вони будуть скомпільовані у двійкові файли ресурсів (:file:`.res`) і пов’язані у виконуваний файл.

source: Preprocessor options
uk: Опції препроцесора

source: Three optional arguments to :class:`~distutils.core.Extension` will help if you need to specify include directories to search or preprocessor macros to define/undefine: ``include_dirs``, ``define_macros``, and ``undef_macros``.
uk: Три необов’язкові аргументи для :class:`~distutils.core.Extension` допоможуть, якщо вам потрібно вказати включати каталоги для пошуку або макроси препроцесора для визначення/невизначення: ``include_dirs``, ``define_macros`` і ``undef_macros``.

source: For example, if your extension requires header files in the :file:`include` directory under your distribution root, use the ``include_dirs`` option::
uk: Наприклад, якщо ваше розширення потребує файлів заголовків у каталозі :file:`include` у корені дистрибутива, використовуйте опцію ``include_dirs``::

source: You can specify absolute directories there; if you know that your extension will only be built on Unix systems with X11R6 installed to :file:`/usr`, you can get away with ::
uk: Там можна вказати абсолютні каталоги; якщо ви знаєте, що ваше розширення буде побудовано лише на системах Unix із X11R6, встановленим у :file:`/usr`, ви можете обійтися ::

source: You should avoid this sort of non-portable usage if you plan to distribute your code: it's probably better to write C code like ::
uk: Якщо ви плануєте розповсюджувати свій код, вам слід уникати такого непортативного використання: ймовірно, краще писати код на C так::

source: If you need to include header files from some other Python extension, you can take advantage of the fact that header files are installed in a consistent way by the Distutils :command:`install_headers` command. For example, the Numerical Python header files are installed (on a standard Unix installation) to :file:`/usr/local/include/python1.5/Numerical`. (The exact location will differ according to your platform and Python installation.) Since the Python include directory---\ :file:`/usr/local/include/python1.5` in this case---is always included in the search path when building Python extensions, the best approach is to write C code like ::
uk: Якщо вам потрібно включити файли заголовків з іншого розширення Python, ви можете скористатися тим фактом, що файли заголовків установлюються узгоджено за допомогою команди Distutils :command:`install_headers`. Наприклад, числові файли заголовків Python інсталюються (у стандартній установці Unix) у :file:`/usr/local/include/python1.5/Numerical`. (Точне розташування буде відрізнятися залежно від вашої платформи та інсталяції Python.) Оскільки каталог включення Python---\ :file:`/usr/local/include/python1.5` у цьому випадку---завжди включається в Шлях пошуку під час створення розширень Python найкращим підходом є написання коду C, наприклад::

source: If you must put the :file:`Numerical` include directory right into your header search path, though, you can find that directory using the Distutils :mod:`distutils.sysconfig` module::
uk: Якщо вам потрібно розмістити каталог :file:`Numerical` включення прямо в шлях пошуку заголовка, ви можете знайти цей каталог за допомогою модуля Distutils :mod:`distutils.sysconfig`::

source: Even though this is quite portable---it will work on any Python installation, regardless of platform---it's probably easier to just write your C code in the sensible way.
uk: Незважаючи на те, що це досить портативно --- воно працюватиме на будь-якій інсталяції Python, незалежно від платформи --- мабуть, легше просто написати свій код на C розумним способом.

source: You can define and undefine pre-processor macros with the ``define_macros`` and ``undef_macros`` options. ``define_macros`` takes a list of ``(name, value)`` tuples, where ``name`` is the name of the macro to define (a string) and ``value`` is its value: either a string or ``None``. (Defining a macro ``FOO`` to ``None`` is the equivalent of a bare ``#define FOO`` in your C source: with most compilers, this sets ``FOO`` to the string ``1``.) ``undef_macros`` is just a list of macros to undefine.
uk: Ви можете визначити та скасувати визначення макросів попередньої обробки за допомогою параметрів ``define_macros`` і ``undef_macros``. ``define_macros`` бере список кортежів ``(name, value)``, де ``name`` є назвою макросу для визначення (рядок), а ``value`` є його значенням: або рядок або ``None``. (Визначення макросу ``FOO`` як ``None`` є еквівалентом простого ``#define FOO`` у вашому вихідному коді C: у більшості компіляторів це встановлює ``FOO`` у рядок ``1``.) ``undef_macros`` — це лише список макросів, які потрібно скасувати.

source: For example::
uk: Наприклад::

source: is the equivalent of having this at the top of every C source file::
uk: це еквівалент розміщення цього у верхній частині кожного вихідного файлу C::

source: Library options
uk: Параметри бібліотеки

source: You can also specify the libraries to link against when building your extension, and the directories to search for those libraries. The ``libraries`` option is a list of libraries to link against, ``library_dirs`` is a list of directories to search for libraries at link-time, and ``runtime_library_dirs`` is a list of directories to search for shared (dynamically loaded) libraries at run-time.
uk: Ви також можете вказати бібліотеки для зв’язування під час створення розширення та каталоги для пошуку цих бібліотек. Параметр ``libraries`` — це список бібліотек, з якими потрібно зв’язатися, ``library_dirs`` — це список каталогів для пошуку бібліотек під час підключення, а ``runtime_library_dirs`` — це список каталогів для пошуку спільних (динамічно завантажувані) бібліотеки під час виконання.
