Repository: python/python-docs-uk
Catalog: distutils/sourcedist.po
Languages: uk

source: Creating a Source Distribution
uk: Створення вихідного розповсюдження

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
uk: Цей документ зберігається лише до тих пір, поки документація ``setuptools`` за адресою https://setuptools.readthedocs.io/en/latest/setuptools.html окремо не охопить всю відповідну інформацію, яка зараз включена тут.

source: As shown in section :ref:`distutils-simple-example`, you use the :command:`sdist` command to create a source distribution. In the simplest case, ::
uk: Як показано в розділі :ref:`distutils-simple-example`, ви використовуєте команду :command:`sdist` для створення вихідного дистрибутива. У найпростішому випадку::

source: (assuming you haven't specified any :command:`sdist` options in the setup script or config file), :command:`sdist` creates the archive of the default format for the current platform. The default format is a gzip'ed tar file (:file:`.tar.gz`) on Unix, and ZIP file on Windows.
uk: (припустимо, що ви не вказали параметри :command:`sdist` у сценарії встановлення чи файлі конфігурації), :command:`sdist` створює архів формату за замовчуванням для поточної платформи. Типовим форматом є файл tar у форматі gzip (:file:`.tar.gz`) в Unix і ZIP-файл у Windows.

source: You can specify as many formats as you like using the :option:`!--formats` option, for example::
uk: Ви можете вказати скільки завгодно форматів за допомогою опції :option:`!--formats`, наприклад::

source: to create a gzipped tarball and a zip file. The available formats are:
uk: щоб створити стиснутий архів і файл zip. Доступні формати:

source: Format
uk: Формат

source: Description
uk: Опис

source: Notes
uk: Примітки

source: zip file (:file:`.zip`)
uk: zip-файл (:file:`.zip`)

source: gzip'ed tar file (:file:`.tar.gz`)
uk: gzip-ований tar-файл (:file:`.tar.gz`)

source: bzip2'ed tar file (:file:`.tar.bz2`)
uk: bzip2-файл tar (:file:`.tar.bz2`)

source: xz'ed tar file (:file:`.tar.xz`)
uk: xz-ваний tar-файл (:file:`.tar.xz`)

source: compressed tar file (:file:`.tar.Z`)
uk: стиснутий файл tar (:file:`.tar.Z`)

source: tar file (:file:`.tar`)
uk: tar-файл (:file:`.tar`)

source: Added support for the ``xztar`` format.
uk: Додано підтримку формату ``xztar``.

source: Notes:
uk: Примітки:

source: default on Windows
uk: за замовчуванням у Windows

source: default on Unix
uk: за замовчуванням в Unix

source: requires either external :program:`zip` utility or :mod:`zipfile` module (part of the standard Python library since Python 1.6)
uk: вимагає зовнішньої утиліти :program:`zip` або модуля :mod:`zipfile` (частина стандартної бібліотеки Python, починаючи з Python 1.6)

source: requires the :program:`compress` program. Notice that this format is now pending for deprecation and will be removed in the future versions of Python.
uk: потрібна програма :program:`compress`. Зверніть увагу, що цей формат зараз очікує на припинення підтримки та буде видалено в наступних версіях Python.

source: When using any ``tar`` format (``gztar``, ``bztar``, ``xztar``, ``ztar`` or ``tar``), under Unix you can specify the ``owner`` and ``group`` names that will be set for each member of the archive.
uk: При використанні будь-якого ``tar`` формату (``gztar``, ``bztar``, ``xztar``, ``ztar`` або ``tar``), в Unix ви можете вказати імена ``owner`` та ``group``, які будуть встановлені для кожного члена архіву.

source: For example, if you want all files of the archive to be owned by root::
uk: Наприклад, якщо ви хочете, щоб усі файли архіву належали root:

source: Specifying the files to distribute
uk: Визначення файлів для розповсюдження

source: If you don't supply an explicit list of files (or instructions on how to generate one), the :command:`sdist` command puts a minimal default set into the source distribution:
uk: Якщо ви не надаєте явного списку файлів (або інструкцій щодо того, як його створити), команда :command:`sdist` розміщує мінімальний набір за замовчуванням у вихідному дистрибутиві:

source: all Python source files implied by the ``py_modules`` and ``packages`` options
uk: усі вихідні файли Python, передбачені параметрами ``py_modules`` і ``packages``

source: all C source files mentioned in the ``ext_modules`` or ``libraries`` options
uk: усі вихідні файли C, згадані в параметрах ``ext_modules`` або ``libraries``

source: scripts identified by the ``scripts`` option See :ref:`distutils-installing-scripts`.
uk: сценарії, визначені параметром ``scripts`` Див. :ref:`distutils-installing-scripts`.

source: anything that looks like a test script: :file:`test/test\*.py` (currently, the Distutils don't do anything with test scripts except include them in source distributions, but in the future there will be a standard for testing Python module distributions)
uk: усе, що виглядає як тестовий сценарій: :file:`test/test\*.py` (наразі Distutils нічого не роблять із тестовими сценаріями, окрім включення їх у вихідні дистрибутиви, але в майбутньому буде стандарт для тестування дистрибутивів модулів Python)

source: Any of the standard README files (:file:`README`, :file:`README.txt`, or :file:`README.rst`), :file:`setup.py` (or whatever you called your setup script), and :file:`setup.cfg`.
uk: Будь-який із стандартних файлів README (:file:`README`, :file:`README.txt` або :file:`README.rst`), :file:`setup.py` (або як ви називаєте свій сценарій налаштування ) і :file:`setup.cfg`.

source: all files that matches the ``package_data`` metadata. See :ref:`distutils-installing-package-data`.
uk: усі файли, які відповідають метаданим ``package_data``. Перегляньте :ref:`distutils-installing-package-data`.

source: all files that matches the ``data_files`` metadata. See :ref:`distutils-additional-files`.
uk: усі файли, які відповідають метаданим ``data_files``. Перегляньте :ref:`distutils-additional-files`.

source: Sometimes this is enough, but usually you will want to specify additional files to distribute. The typical way to do this is to write a *manifest template*, called :file:`MANIFEST.in` by default. The manifest template is just a list of instructions for how to generate your manifest file, :file:`MANIFEST`, which is the exact list of files to include in your source distribution. The :command:`sdist` command processes this template and generates a manifest based on its instructions and what it finds in the filesystem.
uk: Іноді цього достатньо, але зазвичай ви захочете вказати додаткові файли для розповсюдження. Типовий спосіб зробити це — написати *шаблон маніфесту*, який за замовчуванням називається :file:`MANIFEST.in`. Шаблон маніфесту — це лише список інструкцій щодо того, як створити файл маніфесту, :file:`MANIFEST`, який є точним списком файлів, які потрібно включити у вихідний дистрибутив. Команда :command:`sdist` обробляє цей шаблон і створює маніфест на основі його інструкцій і того, що вона знаходить у файловій системі.

source: If you prefer to roll your own manifest file, the format is simple: one filename per line, regular files (or symlinks to them) only. If you do supply your own :file:`MANIFEST`, you must specify everything: the default set of files described above does not apply in this case.
uk: Якщо ви віддаєте перевагу створенню власного файлу маніфесту, формат простий: одна назва файлу на рядок, лише звичайні файли (або символічні посилання на них). Якщо ви надаєте власний :file:`MANIFEST`, ви повинні вказати все: набір файлів за замовчуванням, описаний вище, у цьому випадку не застосовується.

source: An existing generated :file:`MANIFEST` will be regenerated without :command:`sdist` comparing its modification time to the one of :file:`MANIFEST.in` or :file:`setup.py`.
uk: Існуючий згенерований :file:`MANIFEST` буде повторно згенерований без :command:`sdist` порівняння часу його модифікації з часом :file:`MANIFEST.in` або :file:`setup.py`.

source: :file:`MANIFEST` files start with a comment indicating they are generated. Files without this comment are not overwritten or removed.
uk: Файли :file:`MANIFEST` починаються з коментаря, який вказує на те, що вони створені. Файли без цього коментаря не перезаписуються та не видаляються.

source: :command:`sdist` will read a :file:`MANIFEST` file if no :file:`MANIFEST.in` exists, like it used to do.
uk: :command:`sdist` прочитає файл :file:`MANIFEST`, якщо не існує :file:`MANIFEST.in`, як це було раніше.

source: :file:`README.rst` is now included in the list of distutils standard READMEs.
uk: :file:`README.rst` тепер включено до списку стандартних файлів README distutils.

source: The manifest template has one command per line, where each command specifies a set of files to include or exclude from the source distribution. For an example, again we turn to the Distutils' own manifest template:
uk: У шаблоні маніфесту є одна команда на рядок, де кожна команда визначає набір файлів, які потрібно включити або виключити з вихідного розповсюдження. Для прикладу ми знову звернемося до власного шаблону маніфесту Distutils:

source: The meanings should be fairly clear: include all files in the distribution root matching :file:`\*.txt`, all files anywhere under the :file:`examples` directory matching :file:`\*.txt` or :file:`\*.py`, and exclude all directories matching :file:`examples/sample?/build`. All of this is done *after* the standard include set, so you can exclude files from the standard set with explicit instructions in the manifest template. (Or, you can use the :option:`!--no-defaults` option to disable the standard set entirely.) There are several other commands available in the manifest template mini-language; see section :ref:`sdist-cmd`.
uk: Значення мають бути досить зрозумілими: включити всі файли в кореневій версії дистрибутива, відповідні :file:`\*.txt`, усі файли будь-де в каталозі :file:`examples`, відповідні :file:`\*.txt` або :file:`\*.py` і виключити всі каталоги, що відповідають :file:`examples/sample?/build`. Усе це робиться *після* стандартного набору включення, тому ви можете виключати файли зі стандартного набору за допомогою чітких інструкцій у шаблоні маніфесту. (Або ви можете використати опцію :option:`!--no-defaults`, щоб повністю вимкнути стандартний набір.) У міні-мові шаблону маніфесту є кілька інших команд; див. розділ :ref:`sdist-cmd`.

source: The order of commands in the manifest template matters: initially, we have the list of default files as described above, and each command in the template adds to or removes from that list of files. Once we have fully processed the manifest template, we remove files that should not be included in the source distribution:
uk: Порядок команд у шаблоні маніфесту має значення: спочатку ми маємо список файлів за замовчуванням, як описано вище, і кожна команда в шаблоні додає або видаляє з цього списку файли. Після того, як ми повністю обробили шаблон маніфесту, ми видаляємо файли, які не повинні бути включені до вихідного дистрибутива:

source: all files in the Distutils "build" tree (default :file:`build/`)
uk: усі файли в дереві збірок Distutils (за замовчуванням :file:`build/`)

source: all files in directories named :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` or :file:`_darcs`
uk: усі файли в каталогах з назвами :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` або :file:`_darcs`

source: Now we have our complete list of files, which is written to the manifest for future reference, and then used to build the source distribution archive(s).
uk: Тепер у нас є повний список файлів, який записується в маніфест для подальшого використання, а потім використовується для створення архіву(ів) вихідного дистрибутива.

source: You can disable the default set of included files with the :option:`!--no-defaults` option, and you can disable the standard exclude set with :option:`!--no-prune`.
uk: Ви можете вимкнути стандартний набір включених файлів за допомогою параметра :option:`!--no-defaults`, а стандартний набір виключень можна вимкнути за допомогою :option:`!--no-prune`.

source: Following the Distutils' own manifest template, let's trace how the :command:`sdist` command builds the list of files to include in the Distutils source distribution:
uk: Дотримуючись власного шаблону маніфесту Distutils, давайте простежимо, як команда :command:`sdist` створює список файлів для включення в дистрибутив вихідного коду Distutils:

source: include all Python source files in the :file:`distutils` and :file:`distutils/command` subdirectories (because packages corresponding to those two directories were mentioned in the ``packages`` option in the setup script---see section :ref:`setup-script`)
uk: включити всі вихідні файли Python у підкаталоги :file:`distutils` і :file:`distutils/command` (оскільки пакунки, що відповідають цим двом каталогам, були згадані в параметрі ``packages`` у сценарії встановлення --- див. розділ :ref:`setup-script`)

source: include :file:`README.txt`, :file:`setup.py`, and :file:`setup.cfg` (standard files)
uk: включають :file:`README.txt`, :file:`setup.py` і :file:`setup.cfg` (стандартні файли)

source: include :file:`test/test\*.py` (standard files)
uk: включає :file:`test/test\*.py` (стандартні файли)

source: include :file:`\*.txt` in the distribution root (this will find :file:`README.txt` a second time, but such redundancies are weeded out later)
uk: включити :file:`\*.txt` в кореневу папку дистрибутива (це знайде :file:`README.txt` вдруге, але такі надмірності будуть видалені пізніше)

source: include anything matching :file:`\*.txt` or :file:`\*.py` in the sub-tree under :file:`examples`,
uk: включити все, що відповідає :file:`\*.txt` або :file:`\*.py` у піддереві під :file:`examples`,

source: exclude all files in the sub-trees starting at directories matching :file:`examples/sample?/build`\ ---this may exclude files included by the previous two steps, so it's important that the ``prune`` command in the manifest template comes after the ``recursive-include`` command
uk: виключити всі файли в піддеревах, починаючи з каталогів, що відповідають :file:`examples/sample?/build`\ ---це може виключити файли, включені двома попередніми кроками, тому важливо, щоб команда ``prune`` у шаблон маніфесту йде після команди ``recursive-include``

source: exclude the entire :file:`build` tree, and any :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` and :file:`_darcs` directories
uk: виключити все дерево :file:`build` і будь-які :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git` , :file:`.bzr` і :file:`_darcs` каталоги

source: Just like in the setup script, file and directory names in the manifest template should always be slash-separated; the Distutils will take care of converting them to the standard representation on your platform. That way, the manifest template is portable across operating systems.
uk: Так само, як і в сценарії встановлення, імена файлів і каталогів у шаблоні маніфесту завжди мають бути розділені косою рискою; Distutils подбає про перетворення їх у стандартне представлення на вашій платформі. Таким чином, шаблон маніфесту переноситься між операційними системами.

source: Manifest-related options
uk: Опції, пов’язані з маніфестом

source: The normal course of operations for the :command:`sdist` command is as follows:
uk: Нормальний хід операцій для команди :command:`sdist` такий:

source: if the manifest file (:file:`MANIFEST` by default) exists and the first line does not have a comment indicating it is generated from :file:`MANIFEST.in`, then it is used as is, unaltered
uk: якщо файл маніфесту (:file:`MANIFEST` за замовчуванням) існує, і перший рядок не має коментаря, який вказує, що він створений з :file:`MANIFEST.in`, тоді він використовується як є, без змін

source: if the manifest file doesn't exist or has been previously automatically generated, read :file:`MANIFEST.in` and create the manifest
uk: якщо файл маніфесту не існує або був попередньо створений автоматично, прочитайте :file:`MANIFEST.in` і створіть маніфест

source: if neither :file:`MANIFEST` nor :file:`MANIFEST.in` exist, create a manifest with just the default file set
uk: якщо ані :file:`MANIFEST`, ані :file:`MANIFEST.in` не існує, створіть маніфест лише з набором файлів за замовчуванням

source: use the list of files now in :file:`MANIFEST` (either just generated or read in) to create the source distribution archive(s)
uk: використовуйте список файлів у :file:`MANIFEST` (щойно створений або прочитаний), щоб створити архів(и) розповсюдження коду

source: There are a couple of options that modify this behaviour. First, use the :option:`!--no-defaults` and :option:`!--no-prune` to disable the standard "include" and "exclude" sets.
uk: Є кілька варіантів, які змінюють цю поведінку. По-перше, використовуйте :option:`!--no-defaults` і :option:`!--no-prune`, щоб вимкнути стандартні набори "include" і "exclude".

source: Second, you might just want to (re)generate the manifest, but not create a source distribution::
uk: По-друге, ви можете просто захотіти (повторно) створити маніфест, але не створювати вихідний розподіл::

source: :option:`!-o` is a shortcut for :option:`!--manifest-only`.
uk: :option:`!-o` — це ярлик для :option:`!--manifest-only`.
