Repository: python/python-docs-uk
Catalog: install/index.po
Languages: uk

source: These compilers require some special libraries. This task is more complex than for Borland's C++, because there is no program to convert the library. First you have to create a list of symbols which the Python DLL exports. (You can find a good program for this task at https://sourceforge.net/projects/mingw/files/MinGW/Extension/pexports/).
uk: Для цих компіляторів потрібні спеціальні бібліотеки. Це завдання більш складне, ніж для C++ від Borland, оскільки немає програми для перетворення бібліотеки. Спочатку вам потрібно створити список символів, які експортує DLL Python. (Ви можете знайти хорошу програму для цього завдання на https://sourceforge.net/projects/mingw/files/MinGW/Extension/pexports/).

source: The location of an installed :file:`python25.dll` will depend on the installation options and the version and language of Windows. In a "just for me" installation, it will appear in the root of the installation directory. In a shared installation, it will be located in the system directory.
uk: Розташування встановленого :file:`python25.dll` залежатиме від параметрів встановлення, версії та мови Windows. Під час встановлення "тільки для мене" він з’явиться в кореневому каталозі встановлення. У спільній установці він буде розташований у системному каталозі.

source: Then you can create from these information an import library for gcc. ::
uk: Тоді ви можете створити з цієї інформації бібліотеку імпорту для gcc. ::

source: The resulting library has to be placed in the same directory as :file:`python25.lib`. (Should be the :file:`libs` directory under your Python installation directory.)
uk: Отриману бібліотеку потрібно розмістити в тому ж каталозі, що й :file:`python25.lib`. (Має бути каталог :file:`libs` у вашому каталозі встановлення Python.)

source: If your extension uses other libraries (zlib,...) you might have to convert them too. The converted files have to reside in the same directories as the normal libraries do.
uk: Якщо ваше розширення використовує інші бібліотеки (zlib,...), вам, можливо, доведеться конвертувати їх також. Перетворені файли мають зберігатися в тих самих каталогах, що й звичайні бібліотеки.

source: Information about building the required libraries for the MinGW environment.
uk: Інформація про створення необхідних бібліотек для середовища MinGW.

source: Footnotes
uk: Виноски

source: This also means you could replace all existing COFF-libraries with OMF-libraries of the same name.
uk: Це також означає, що ви можете замінити всі існуючі COFF-бібліотеки бібліотеками OMF з такою ж назвою.

source: Check https://www.sourceware.org/cygwin/ for more information
uk: Перегляньте https://www.sourceware.org/cygwin/ для отримання додаткової інформації

source: Then you have no POSIX emulation available, but you also don't need :file:`cygwin1.dll`.
uk: Тоді вам не доступна емуляція POSIX, але вам також не потрібен :file:`cygwin1.dll`.
