Repository: python/python-docs-uk
Catalog: install/index.po
Languages: uk

source: The idea behind the "home scheme" is that you build and maintain a personal stash of Python modules. This scheme's name is derived from the idea of a "home" directory on Unix, since it's not unusual for a Unix user to make their home directory have a layout similar to :file:`/usr/` or :file:`/usr/local/`. This scheme can be used by anyone, regardless of the operating system they are installing for.
uk: Ідея "домашньої схеми" полягає в тому, що ви створюєте та підтримуєте особистий запас модулів Python. Назва цієї схеми походить від ідеї "домашнього" каталогу в Unix, оскільки для користувачів Unix не є незвичайним зробити свій домашній каталог макетом, подібним до :file:`/usr/` або :file:`/usr /локальний/`. Цю схему може використовувати будь-хто, незалежно від операційної системи, для якої він встановлюється.

source: Installing a new module distribution is as simple as ::
uk: Встановити новий дистрибутив модуля так само просто, як:

source: where you can supply any directory you like for the :option:`!--home` option. On Unix, lazy typists can just type a tilde (``~``); the :command:`install` command will expand this to your home directory::
uk: де ви можете вказати будь-який каталог для опції :option:`!--home`. В Unix ліниві друкарки можуть просто ввести тильду (``~``); команда :command:`install` розширить це до вашого домашнього каталогу::

source: The :option:`!--home` option defines the installation base directory. Files are installed to the following directories under the installation base as follows:
uk: Параметр :option:`!--home` визначає базовий каталог встановлення. Файли встановлюються в такі каталоги в базі інсталяції наступним чином:

source: (Mentally replace slashes with backslashes if you're on Windows.)
uk: (Подумки замініть скісні риски на зворотні скісні риски, якщо ви використовуєте Windows.)

source: Alternate installation: Unix (the prefix scheme)
uk: Альтернативна інсталяція: Unix (префіксна схема)

source: The "prefix scheme" is useful when you wish to use one Python installation to perform the build/install (i.e., to run the setup script), but install modules into the third-party module directory of a different Python installation (or something that looks like a different Python installation). If this sounds a trifle unusual, it is---that's why the user and home schemes come before. However, there are at least two known cases where the prefix scheme will be useful.
uk: "Схема префіксів" корисна, коли ви бажаєте використовувати одну інсталяцію Python для виконання побудови/інсталяції (тобто для запуску сценарію інсталяції), але інсталювати модулі в каталог модулів сторонніх розробників іншої інсталяції Python (або щось, що виглядає як інша інсталяція Python). Якщо це звучить трішки незвично, це---тому користувальницька та домашня схеми стоять раніше. Однак є принаймні два відомі випадки, коли префіксна схема буде корисною.

source: First, consider that many Linux distributions put Python in :file:`/usr`, rather than the more traditional :file:`/usr/local`. This is entirely appropriate, since in those cases Python is part of "the system" rather than a local add-on. However, if you are installing Python modules from source, you probably want them to go in :file:`/usr/local/lib/python2.{X}` rather than :file:`/usr/lib/python2.{X}`. This can be done with ::
uk: По-перше, врахуйте, що багато дистрибутивів Linux розміщують Python у :file:`/usr`, а не в більш традиційному :file:`/usr/local`. Це цілком доречно, оскільки в таких випадках Python є частиною "системи", а не локальним додатком. Однак, якщо ви встановлюєте модулі Python із джерела, ви, ймовірно, хочете, щоб вони містилися в :file:`/usr/local/lib/python2.{X}`, а не в :file:`/usr/lib/python2.{X }`. Це можна зробити за допомогою ::

source: Another possibility is a network filesystem where the name used to write to a remote directory is different from the name used to read it: for example, the Python interpreter accessed as :file:`/usr/local/bin/python` might search for modules in :file:`/usr/local/lib/python2.{X}`, but those modules would have to be installed to, say, :file:`/mnt/{@server}/export/lib/python2.{X}`. This could be done with ::
uk: Іншою можливістю є мережева файлова система, де ім’я, що використовується для запису у віддалений каталог, відрізняється від імені, яке використовується для його читання: наприклад, інтерпретатор Python, доступ до якого здійснюється як :file:`/usr/local/bin/python`, може шукати модулі в :file:`/usr/local/lib/python2.{X}`, але ці модулі мають бути встановлені, скажімо, у :file:`/mnt/{@server}/export/lib/python2. {X}`. Це можна зробити за допомогою ::

source: In either case, the :option:`!--prefix` option defines the installation base, and the :option:`!--exec-prefix` option defines the platform-specific installation base, which is used for platform-specific files. (Currently, this just means non-pure module distributions, but could be expanded to C libraries, binary executables, etc.) If :option:`!--exec-prefix` is not supplied, it defaults to :option:`!--prefix`. Files are installed as follows:
uk: У будь-якому випадку параметр :option:`!--prefix` визначає базу інсталяції, а параметр :option:`!--exec-prefix` визначає базу інсталяції для певної платформи, яка використовується для файлів певної платформи. . (Наразі це означає лише розповсюдження нечистих модулів, але може бути розширено до бібліотек C, двійкових виконуваних файлів тощо.) Якщо :option:`!--exec-prefix` не вказано, за умовчанням буде :option:`! --префікс`. Файли встановлюються наступним чином:

source: Python modules
uk: Модулі Python

source: extension modules
uk: модулі розширення

source: :file:`{prefix}/include/python{X.Y}{abiflags}/{distname}`
uk: :file:`{префікс}/include/python{X.Y}{abiflags}/{distname}`

source: There is no requirement that :option:`!--prefix` or :option:`!--exec-prefix` actually point to an alternate Python installation; if the directories listed above do not already exist, they are created at installation time.
uk: Немає вимоги, щоб :option:`!--prefix` або :option:`!--exec-prefix` справді вказували на альтернативну установку Python; якщо перелічені вище каталоги ще не існують, вони створюються під час встановлення.

source: Incidentally, the real reason the prefix scheme is important is simply that a standard Unix installation uses the prefix scheme, but with :option:`!--prefix` and :option:`!--exec-prefix` supplied by Python itself as ``sys.prefix`` and ``sys.exec_prefix``. Thus, you might think you'll never use the prefix scheme, but every time you run ``python setup.py install`` without any other options, you're using it.
uk: До речі, справжня причина важливості схеми префіксів полягає просто в тому, що стандартна інсталяція Unix використовує схему префіксів, але з :option:`!--prefix` і :option:`!--exec-prefix`, що надаються самим Python як ``sys.prefix`` і ``sys.exec_prefix``. Таким чином, ви можете подумати, що ніколи не використовуватимете схему префіксів, але кожного разу, коли ви запускаєте ``python setup.py install`` без будь-яких інших параметрів, ви використовуєте її.

source: Note that installing extensions to an alternate Python installation has no effect on how those extensions are built: in particular, the Python header files (:file:`Python.h` and friends) installed with the Python interpreter used to run the setup script will be used in compiling extensions. It is your responsibility to ensure that the interpreter used to run extensions installed in this way is compatible with the interpreter used to build them. The best way to do this is to ensure that the two interpreters are the same version of Python (possibly different builds, or possibly copies of the same build). (Of course, if your :option:`!--prefix` and :option:`!--exec-prefix` don't even point to an alternate Python installation, this is immaterial.)
uk: Зауважте, що встановлення розширень до альтернативної інсталяції Python не впливає на те, як створено ці розширення: зокрема, файли заголовків Python (:file:`Python.h` і друзі), встановлені за допомогою інтерпретатора Python, який використовується для запуску сценарію налаштування, будуть використовувати для компіляції розширень. Ви несете відповідальність за те, щоб інтерпретатор, який використовується для запуску встановлених таким чином розширень, був сумісний з інтерпретатором, який використовується для їх створення. Найкращий спосіб зробити це — переконатися, що два інтерпретатори є однаковою версією Python (можливо, різними збірками або, можливо, копіями однієї збірки). (Звичайно, якщо ваші :option:`!--prefix` і :option:`!--exec-prefix` навіть не вказують на альтернативну інсталяцію Python, це не має значення.)

source: Alternate installation: Windows (the prefix scheme)
uk: Альтернативна установка: Windows (префіксна схема)

source: Windows has no concept of a user's home directory, and since the standard Python installation under Windows is simpler than under Unix, the :option:`!--prefix` option has traditionally been used to install additional packages in separate locations on Windows. ::
uk: Windows не має концепції домашнього каталогу користувача, і оскільки стандартна інсталяція Python у Windows є простішою, ніж у Unix, опція :option:`!--prefix` традиційно використовується для інсталяції додаткових пакетів в окремих місцях у Windows. ::

source: to install modules to the :file:`\\Temp\\Python` directory on the current drive.
uk: для встановлення модулів у каталог :file:`\\Temp\\Python` на поточному диску.

source: The installation base is defined by the :option:`!--prefix` option; the :option:`!--exec-prefix` option is not supported under Windows, which means that pure Python modules and extension modules are installed into the same location. Files are installed as follows:
uk: База встановлення визначається параметром :option:`!--prefix`; параметр :option:`!--exec-prefix` не підтримується в Windows, що означає, що чисті модулі Python і модулі розширення встановлені в одному місці. Файли встановлюються наступним чином:

source: :file:`{prefix}\\Scripts`
uk: :file:`{prefix}\\Сценарії`

source: :file:`{prefix}\\Include\\{distname}`
uk: :file:`{prefix}\\Включити\\{distname}`

source: Custom Installation
uk: Вибіркова установка

source: Sometimes, the alternate installation schemes described in section :ref:`inst-alt-install` just don't do what you want. You might want to tweak just one or two directories while keeping everything under the same base directory, or you might want to completely redefine the installation scheme. In either case, you're creating a *custom installation scheme*.
uk: Іноді альтернативні схеми встановлення, описані в розділі :ref:`inst-alt-install`, просто не роблять того, що ви хочете. Можливо, ви захочете налаштувати лише один або два каталоги, зберігаючи все в одному базовому каталозі, або ви можете повністю перевизначити схему встановлення. У будь-якому випадку ви створюєте *спеціальну схему встановлення*.

source: To create a custom installation scheme, you start with one of the alternate schemes and override some of the installation directories used for the various types of files, using these options:
uk: Щоб створити спеціальну схему встановлення, ви починаєте з однієї з альтернативних схем і замінюєте деякі каталоги встановлення, які використовуються для різних типів файлів, використовуючи ці параметри:

source: Override option
uk: Опція перевизначення

source: all modules
uk: всі модулі

source: These override options can be relative, absolute, or explicitly defined in terms of one of the installation base directories. (There are two installation base directories, and they are normally the same---they only differ when you use the Unix "prefix scheme" and supply different ``--prefix`` and ``--exec-prefix`` options; using ``--install-lib`` will override values computed or given for ``--install-purelib`` and ``--install-platlib``, and is recommended for schemes that don't make a difference between Python and extension modules.)
uk: Ці параметри заміни можуть бути відносними, абсолютними або явно визначеними в термінах одного з базових каталогів встановлення. (Існує два базові каталоги встановлення, і зазвичай вони однакові --- вони відрізняються лише тоді, коли ви використовуєте "префіксну схему" Unix і надаєте різні параметри ``--prefix`` і ``--exec-prefix`` ; використання ``--install-lib`` замінить значення, обчислені або надані для ``--install-purelib`` і ``--install-platlib``, і рекомендовано для схем, які не мають значення між Python і модулями розширення.)

source: For example, say you're installing a module distribution to your home directory under Unix---but you want scripts to go in :file:`~/scripts` rather than :file:`~/bin`. As you might expect, you can override this directory with the :option:`!--install-scripts` option; in this case, it makes most sense to supply a relative path, which will be interpreted relative to the installation base directory (your home directory, in this case)::
uk: Наприклад, скажімо, ви встановлюєте дистрибутив модуля у свій домашній каталог під Unix --- але ви хочете, щоб сценарії містилися в :file:`~/scripts`, а не в :file:`~/bin`. Як і слід було очікувати, ви можете замінити цей каталог опцією :option:`!--install-scripts`; у цьому випадку має сенс надати відносний шлях, який інтерпретуватиметься відносно основного каталогу інсталяції (у цьому випадку вашого домашнього каталогу):

source: Another Unix example: suppose your Python installation was built and installed with a prefix of :file:`/usr/local/python`, so under a standard installation scripts will wind up in :file:`/usr/local/python/bin`. If you want them in :file:`/usr/local/bin` instead, you would supply this absolute directory for the :option:`!--install-scripts` option::
uk: Інший приклад Unix: припустімо, що вашу інсталяцію Python було зібрано та встановлено з префіксом :file:`/usr/local/python`, тому за стандартної інсталяції сценарії з’являться у :file:`/usr/local/python/bin`. Якщо ви хочете, щоб вони були в :file:`/usr/local/bin` замість цього, ви повинні вказати цей абсолютний каталог для параметра :option:`!--install-scripts`::

source: (This performs an installation using the "prefix scheme", where the prefix is whatever your Python interpreter was installed with--- :file:`/usr/local/python` in this case.)
uk: (Це виконує інсталяцію за допомогою "схеми префіксів", де префіксом є те, що було встановлено вашим інтерпретатором Python --- :file:`/usr/local/python` у цьому випадку.)

source: If you maintain Python on Windows, you might want third-party modules to live in a subdirectory of :file:`{prefix}`, rather than right in :file:`{prefix}` itself. This is almost as easy as customizing the script installation directory---you just have to remember that there are two types of modules to worry about, Python and extension modules, which can conveniently be both controlled by one option::
uk: Якщо ви підтримуєте Python у Windows, можливо, ви захочете, щоб модулі сторонніх розробників знаходилися в підкаталозі :file:`{prefix}`, а не безпосередньо в :file:`{prefix}`. Це майже так само просто, як налаштувати каталог встановлення сценарію --- вам потрібно лише пам’ятати, що є два типи модулів, про які варто турбуватися, Python і модулі розширення, якими зручно керувати одним параметром::

source: The specified installation directory is relative to :file:`{prefix}`. Of course, you also have to ensure that this directory is in Python's module search path, such as by putting a :file:`.pth` file in a site directory (see :mod:`site`). See section :ref:`inst-search-path` to find out how to modify Python's search path.
uk: Указаний каталог встановлення відноситься до :file:`{prefix}`. Звичайно, ви також повинні переконатися, що цей каталог знаходиться в шляху пошуку модуля Python, наприклад, помістивши файл :file:`.pth` в каталог сайту (див. :mod:`site`). Перегляньте розділ :ref:`inst-search-path`, щоб дізнатися, як змінити шлях пошуку Python.

source: If you want to define an entire installation scheme, you just have to supply all of the installation directory options. The recommended way to do this is to supply relative paths; for example, if you want to maintain all Python module-related files under :file:`python` in your home directory, and you want a separate directory for each platform that you use your home directory from, you might define the following installation scheme::
uk: Якщо ви бажаєте визначити повну схему встановлення, вам просто потрібно вказати всі параметри каталогу встановлення. Рекомендований спосіб зробити це — надати відносні шляхи; наприклад, якщо ви хочете підтримувати всі файли, пов’язані з модулями Python, у :file:`python` у вашому домашньому каталозі, і вам потрібен окремий каталог для кожної платформи, з якої ви використовуєте свій домашній каталог, ви можете визначити наступну схему встановлення ::

source: or, equivalently, ::
uk: або, еквівалентно, ::

source: ``$PLAT`` is not (necessarily) an environment variable---it will be expanded by the Distutils as it parses your command line options, just as it does when parsing your configuration file(s).
uk: ``$PLAT`` не є (обов’язково) змінною середовища --- вона буде розширена за допомогою Distutils під час аналізу ваших параметрів командного рядка, так само, як це робиться під час аналізу ваших конфігураційних файлів.

source: Obviously, specifying the entire installation scheme every time you install a new module distribution would be very tedious. Thus, you can put these options into your Distutils config file (see section :ref:`inst-config-files`):
uk: Очевидно, що вказувати всю схему встановлення кожного разу, коли ви встановлюєте новий дистрибутив модуля, було б дуже виснажливо. Таким чином, ви можете розмістити ці параметри у вашому конфігураційному файлі Distutils (див. розділ :ref:`inst-config-files`):

source: or, equivalently,
uk: або, те саме,

source: Note that these two are *not* equivalent if you supply a different installation base directory when you run the setup script. For example, ::
uk: Зауважте, що ці два *не* еквівалентні, якщо ви вказуєте інший базовий каталог встановлення під час запуску сценарію налаштування. Наприклад, ::

source: would install pure modules to :file:`/tmp/python/lib` in the first case, and to :file:`/tmp/lib` in the second case. (For the second case, you probably want to supply an installation base of :file:`/tmp/python`.)
uk: встановить чисті модулі до :file:`/tmp/python/lib` у першому випадку та до :file:`/tmp/lib` у другому випадку. (Для другого випадку ви, ймовірно, захочете надати базу встановлення :file:`/tmp/python`.)

source: You probably noticed the use of ``$HOME`` and ``$PLAT`` in the sample configuration file input. These are Distutils configuration variables, which bear a strong resemblance to environment variables. In fact, you can use environment variables in config files on platforms that have such a notion but the Distutils additionally define a few extra variables that may not be in your environment, such as ``$PLAT``. (And of course, on systems that don't have environment variables, such as Mac OS 9, the configuration variables supplied by the Distutils are the only ones you can use.) See section :ref:`inst-config-files` for details.
uk: Можливо, ви помітили використання ``$HOME`` і ``$PLAT`` у зразку вхідних даних файлу конфігурації. Це змінні конфігурації Distutils, які дуже схожі на змінні середовища. Фактично, ви можете використовувати змінні середовища у файлах конфігурації на платформах, які мають таке поняття, але Distutils додатково визначає кілька додаткових змінних, яких може не бути у вашому середовищі, наприклад ``$PLAT``. (Звичайно, у системах, які не мають змінних середовища, наприклад Mac OS 9, змінні конфігурації, надані Distutils, є єдиними, які ви можете використовувати.) Перегляньте розділ :ref:`inst-config-files` для деталі.

source: When a :ref:`virtual environment <venv-def>` is activated, any options that change the installation path will be ignored from all distutils configuration files to prevent inadvertently installing projects outside of the virtual environment.
uk: Коли активовано :ref:`віртуальне середовище <venv-def>`, будь-які параметри, які змінюють шлях інсталяції, ігноруватимуться в усіх конфігураційних файлах distutils, щоб запобігти випадковому встановленню проектів за межами віртуального середовища.

source: Modifying Python's Search Path
uk: Зміна шляху пошуку Python

source: When the Python interpreter executes an :keyword:`import` statement, it searches for both Python code and extension modules along a search path. A default value for the path is configured into the Python binary when the interpreter is built. You can determine the path by importing the :mod:`sys` module and printing the value of ``sys.path``. ::
uk: Коли інтерпретатор Python виконує оператор :keyword:`import`, він шукає як код Python, так і модулі розширення вздовж шляху пошуку. Значення за замовчуванням для шляху налаштовується у двійковий файл Python під час створення інтерпретатора. Ви можете визначити шлях, імпортувавши модуль :mod:`sys` і надрукувавши значення ``sys.path``. ::

source: The null string in ``sys.path`` represents the current working directory.
uk: Нульовий рядок у ``sys.path`` представляє поточний робочий каталог.

source: The expected convention for locally installed packages is to put them in the :file:`{...}/site-packages/` directory, but you may want to install Python modules into some arbitrary directory. For example, your site may have a convention of keeping all software related to the web server under :file:`/www`. Add-on Python modules might then belong in :file:`/www/python`, and in order to import them, this directory must be added to ``sys.path``. There are several different ways to add the directory.
uk: Очікувана умова для локально встановлених пакунків полягає в тому, щоб розмістити їх у каталозі :file:`{...}/site-packages/`, але ви можете встановити модулі Python у будь-який довільний каталог. Наприклад, ваш сайт може зберігати все програмне забезпечення, пов’язане з веб-сервером, у :file:`/www`. Додаткові модулі Python можуть належати до :file:`/www/python`, і щоб імпортувати їх, цей каталог потрібно додати до ``sys.path``. Є кілька різних способів додати каталог.

source: The most convenient way is to add a path configuration file to a directory that's already on Python's path, usually to the :file:`.../site-packages/` directory. Path configuration files have an extension of :file:`.pth`, and each line must contain a single path that will be appended to ``sys.path``. (Because the new paths are appended to ``sys.path``, modules in the added directories will not override standard modules. This means you can't use this mechanism for installing fixed versions of standard modules.)
uk: Найзручніший спосіб — додати файл конфігурації шляху до каталогу, який уже є на шляху Python, зазвичай до каталогу :file:`.../site-packages/`. Файли конфігурації шляху мають розширення :file:`.pth`, і кожен рядок має містити один шлях, який буде додано до ``sys.path``. (Оскільки нові шляхи додаються до ``sys.path``, модулі в доданих каталогах не замінять стандартні модулі. Це означає, що ви не можете використовувати цей механізм для встановлення фіксованих версій стандартних модулів.)

source: Paths can be absolute or relative, in which case they're relative to the directory containing the :file:`.pth` file. See the documentation of the :mod:`site` module for more information.
uk: Шляхи можуть бути абсолютними або відносними, і в цьому випадку вони відносяться до каталогу, що містить файл :file:`.pth`. Дивіться документацію модуля :mod:`site` для отримання додаткової інформації.
