Repository: python/python-docs-uk
Catalog: install/index.po
Languages: uk

source: Installing Python Modules (Legacy version)
uk: Встановлення модулів Python (застаріла версія)

source: Author
uk: Автор

source: The entire ``distutils`` package has been deprecated and will be removed in Python 3.12. This documentation is retained as a reference only, and will be removed with the package. See the :ref:`What's New <distutils-deprecated>` entry for more information.
uk: Весь пакет ``distutils`` застарів і буде видалено в Python 3.12. Ця документація зберігається лише як довідка та буде видалена разом із пакетом. Перегляньте запис :ref:`Що нового <distutils-deprecated>` для отримання додаткової інформації.

source: The up to date module installation documentation. For regular Python usage, you almost certainly want that document rather than this one.
uk: Актуальна документація по установці модуля. Для регулярного використання Python вам майже напевно потрібен цей документ, а не цей.

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
uk: Цей документ зберігається лише до тих пір, поки документація ``setuptools`` за адресою https://setuptools.readthedocs.io/en/latest/setuptools.html окремо не охопить всю відповідну інформацію, яка зараз включена тут.

source: This guide only covers the basic tools for building and distributing extensions that are provided as part of this version of Python. Third party tools offer easier to use and more secure alternatives. Refer to the `quick recommendations section <https://packaging.python.org/guides/tool-recommendations/>`__ in the Python Packaging User Guide for more information.
uk: Цей посібник охоплює лише основні інструменти для створення та розповсюдження розширень, які надаються як частина цієї версії Python. Інструменти сторонніх розробників пропонують прості у використанні та безпечніші альтернативи. Для отримання додаткової інформації зверніться до розділу `швидких рекомендацій <https://packaging.python.org/guides/tool-recommendations/>`__ у посібнику користувача з пакування Python.

source: Introduction
uk: вступ

source: In Python 2.0, the ``distutils`` API was first added to the standard library. This provided Linux distro maintainers with a standard way of converting Python projects into Linux distro packages, and system administrators with a standard way of installing them directly onto target systems.
uk: У Python 2.0 API distutils було вперше додано до стандартної бібліотеки. Це забезпечило розробникам дистрибутивів Linux стандартний спосіб перетворення проектів Python у пакети дистрибутивів Linux, а системним адміністраторам — стандартний спосіб встановлення їх безпосередньо на цільових системах.

source: In the many years since Python 2.0 was released, tightly coupling the build system and package installer to the language runtime release cycle has turned out to be problematic, and it is now recommended that projects use the ``pip`` package installer and the ``setuptools`` build system, rather than using ``distutils`` directly.
uk: За багато років після випуску Python 2.0 тісно зв’язати систему збірки та інсталятор пакунків із циклом випуску середовища виконання мови виявилося проблематично, і тепер рекомендовано, щоб проекти використовували інсталятор пакетів ``pip`` і ``setuptools`` будує систему, а не використовує ``distutils`` безпосередньо.

source: See :ref:`installing-index` and :ref:`distributing-index` for more details.
uk: Перегляньте :ref:`installing-index` і :ref:`distributing-index` для отримання додаткової інформації.

source: This legacy documentation is being retained only until we're confident that the ``setuptools`` documentation covers everything needed.
uk: Ця застаріла документація зберігається лише до тих пір, поки ми не будемо впевнені, що документація ``setuptools`` охоплює все необхідне.

source: Distutils based source distributions
uk: Розповсюдження джерел на основі Distutils

source: For Windows, this command should be run from a command prompt window (:menuselection:`Start --> Accessories`)::
uk: Для Windows цю команду слід запускати з вікна командного рядка (:menuselection:`Пуск --> Аксесуари`):

source: If all these things are true, then you already know how to build and install the modules you've just downloaded: Run the command above. Unless you need to install things in a non-standard way or customize the build process, you don't really need this manual. Or rather, the above command is everything you need to get out of this manual.
uk: Якщо все це правда, то ви вже знаєте, як створити та встановити модулі, які щойно завантажили: виконайте наведену вище команду. Якщо вам не потрібно встановлювати щось нестандартним способом або налаштовувати процес збірки, цей посібник вам не потрібен. Або, точніше, наведена вище команда - це все, що вам потрібно, щоб вийти з цього посібника.

source: Standard Build and Install
uk: Стандартна збірка та встановлення

source: As described in section :ref:`inst-new-standard`, building and installing a module distribution using the Distutils is usually one simple command to run from a terminal::
uk: Як описано в розділі :ref:`inst-new-standard`, створення та встановлення дистрибутива модуля за допомогою Distutils зазвичай виконується однією простою командою з терміналу::

source: Platform variations
uk: Варіації платформи

source: You should always run the setup command from the distribution root directory, i.e. the top-level subdirectory that the module source distribution unpacks into. For example, if you've just downloaded a module source distribution :file:`foo-1.0.tar.gz` onto a Unix system, the normal thing to do is::
uk: Завжди слід запускати команду налаштування з кореневого каталогу розповсюдження, тобто підкаталогу верхнього рівня, куди розпаковується дистрибутив джерела модуля. Наприклад, якщо ви щойно завантажили дистрибутив вихідного коду модуля :file:`foo-1.0.tar.gz` на систему Unix, звичайною справою є:

source: On Windows, you'd probably download :file:`foo-1.0.zip`. If you downloaded the archive file to :file:`C:\\Temp`, then it would unpack into :file:`C:\\Temp\\foo-1.0`; you can use either an archive manipulator with a graphical user interface (such as WinZip) or a command-line tool (such as :program:`unzip` or :program:`pkunzip`) to unpack the archive. Then, open a command prompt window and run::
uk: У Windows ви, ймовірно, завантажите :file:`foo-1.0.zip`. Якщо ви завантажили архівний файл до :file:`C:\\Temp`, він буде розпакований у :file:`C:\\Temp\\foo-1.0`; ви можете використовувати маніпулятор архіву з графічним інтерфейсом користувача (наприклад, WinZip) або інструмент командного рядка (наприклад, :program:`unzip` або :program:`pkunzip`), щоб розпакувати архів. Потім відкрийте вікно командного рядка та запустіть::

source: Splitting the job up
uk: Розподіл роботи

source: Running ``setup.py install`` builds and installs all modules in one run. If you prefer to work incrementally---especially useful if you want to customize the build process, or if things are going wrong---you can use the setup script to do one thing at a time. This is particularly helpful when the build and install will be done by different users---for example, you might want to build a module distribution and hand it off to a system administrator for installation (or do it yourself, with super-user privileges).
uk: Запуск ``setup.py install`` збирає та встановлює всі модулі за один запуск. Якщо ви віддаєте перевагу працювати поступово --- особливо корисно, якщо ви хочете налаштувати процес збирання, або якщо щось йде не так --- ви можете використовувати сценарій налаштування, щоб виконувати одну дію за раз. Це особливо корисно, коли збирання та встановлення виконуватимуться різними користувачами --- наприклад, ви можете створити дистрибутив модуля та передати його системному адміністратору для встановлення (або зробити це самостійно, з правами суперкористувача ).

source: For example, you can build everything in one step, and then install everything in a second step, by invoking the setup script twice::
uk: Наприклад, ви можете створити все за один крок, а потім інсталювати все за другий крок, двічі викликавши сценарій встановлення:

source: If you do this, you will notice that running the :command:`install` command first runs the :command:`build` command, which---in this case---quickly notices that it has nothing to do, since everything in the :file:`build` directory is up-to-date.
uk: Якщо ви це зробите, ви помітите, що виконання команди :command:`install` спочатку запускає команду :command:`build`, яка --- в цьому випадку --- швидко помічає, що вона не має нічого робити, оскільки все у каталозі :file:`build` є актуальною.

source: You may not need this ability to break things down often if all you do is install modules downloaded off the 'net, but it's very handy for more advanced tasks. If you get into distributing your own Python modules and extensions, you'll run lots of individual Distutils commands on their own.
uk: Можливо, вам не знадобиться ця здатність часто розбивати речі, якщо все, що ви робите, це встановлювати модулі, завантажені з мережі, але це дуже зручно для більш складних завдань. Якщо ви починаєте розповсюджувати свої власні модулі та розширення Python, ви запускатимете багато окремих команд Distutils окремо.

source: How building works
uk: Як працює будівництво

source: As implied above, the :command:`build` command is responsible for putting the files to install into a *build directory*. By default, this is :file:`build` under the distribution root; if you're excessively concerned with speed, or want to keep the source tree pristine, you can change the build directory with the :option:`!--build-base` option. For example::
uk: Як було зазначено вище, команда :command:`build` відповідає за розміщення файлів для встановлення в *каталог збірки*. За замовчуванням це :file:`build` у корені розповсюдження; якщо ви надмірно стурбовані швидкістю або хочете зберегти вихідне дерево незайманим, ви можете змінити каталог збірки за допомогою опції :option:`!--build-base`. Наприклад::

source: (Or you could do this permanently with a directive in your system or personal Distutils configuration file; see section :ref:`inst-config-files`.) Normally, this isn't necessary.
uk: (Або ви можете зробити це назавжди за допомогою директиви у вашій системі чи особистому конфігураційному файлі Distutils; див. розділ :ref:`inst-config-files`.) Зазвичай це не обов’язково.

source: The default layout for the build tree is as follows::
uk: Типовий макет дерева побудови такий:

source: where ``<plat>`` expands to a brief description of the current OS/hardware platform and Python version. The first form, with just a :file:`lib` directory, is used for "pure module distributions"---that is, module distributions that include only pure Python modules. If a module distribution contains any extensions (modules written in C/C++), then the second form, with two ``<plat>`` directories, is used. In that case, the :file:`temp.{plat}` directory holds temporary files generated by the compile/link process that don't actually get installed. In either case, the :file:`lib` (or :file:`lib.{plat}`) directory contains all Python modules (pure Python and extensions) that will be installed.
uk: де ``<plat>`` розширюється до короткого опису поточної ОС/апаратної платформи та версії Python. Перша форма, лише з каталогом :file:`lib`, використовується для "дистрибутивів чистих модулів" --- тобто дистрибутивів модулів, які містять лише чисті модулі Python. Якщо розповсюдження модуля містить будь-які розширення (модулі, написані мовою C/C++), то використовується друга форма з двома каталогами ``<plat>``. У цьому випадку каталог :file:`temp.{plat}` містить тимчасові файли, згенеровані процесом компіляції/посилання, які фактично не встановлюються. У будь-якому випадку каталог :file:`lib` (або :file:`lib.{plat}`) містить усі модулі Python (чистий Python і розширення), які буде встановлено.

source: In the future, more directories will be added to handle Python scripts, documentation, binary executables, and whatever else is needed to handle the job of installing Python modules and applications.
uk: У майбутньому буде додано більше каталогів для обробки сценаріїв Python, документації, двійкових виконуваних файлів і всього іншого, що буде потрібно для роботи зі встановлення модулів і програм Python.

source: How installation works
uk: Як працює установка

source: After the :command:`build` command runs (whether you run it explicitly, or the :command:`install` command does it for you), the work of the :command:`install` command is relatively simple: all it has to do is copy everything under :file:`build/lib` (or :file:`build/lib.{plat}`) to your chosen installation directory.
uk: Після виконання команди :command:`build` (незалежно від того, запускаєте ви її явно чи команда :command:`install` робить це за вас), робота команди :command:`install` відносно проста: усе, що вона має це скопіювати все в :file:`build/lib` (або :file:`build/lib.{plat}`) до вибраного каталогу встановлення.

source: If you don't choose an installation directory---i.e., if you just run ``setup.py install``\ ---then the :command:`install` command installs to the standard location for third-party Python modules. This location varies by platform and by how you built/installed Python itself. On Unix (and macOS, which is also Unix-based), it also depends on whether the module distribution being installed is pure Python or contains extensions ("non-pure"):
uk: Якщо ви не виберете каталог інсталяції --- тобто якщо ви просто запустите ``setup.py install``\ --- тоді команда :command:`install` встановить стандартне розташування для сторонніх модулів Python . Це розташування залежить від платформи та способу створення/встановлення самого Python. В Unix (і macOS, яка також базується на Unix), це також залежить від того, чи інстальований дистрибутив модуля є чистим Python чи містить розширення ("нечисті"):

source: Platform
uk: Платформа

source: Standard installation location
uk: Стандартне місце установки

source: Default value
uk: Значення за замовчуванням

source: Notes
uk: Примітки

source: Unix (pure)
uk: Unix (чистий)

source: :file:`{prefix}/lib/python{X.Y}/site-packages`
uk: :file:`{префікс}/lib/python{X.Y}/site-packages`

source: Unix (non-pure)
uk: Unix (не чистий)

source: Windows
uk: вікна

source: Notes:
uk: Примітки:

source: Most Linux distributions include Python as a standard part of the system, so :file:`{prefix}` and :file:`{exec-prefix}` are usually both :file:`/usr` on Linux. If you build Python yourself on Linux (or any Unix-like system), the default :file:`{prefix}` and :file:`{exec-prefix}` are :file:`/usr/local`.
uk: Більшість дистрибутивів Linux включають Python як стандартну частину системи, тому :file:`{prefix}` і :file:`{exec-prefix}` зазвичай обидва є :file:`/usr` в Linux. Якщо ви самостійно створюєте Python на Linux (або будь-якій Unix-подібній системі), типовими :file:`{prefix}` і :file:`{exec-prefix}` є :file:`/usr/local`.

source: The default installation directory on Windows was :file:`C:\\Program Files\\Python` under Python 1.6a1, 1.5.2, and earlier.
uk: Стандартним каталогом інсталяції в Windows був :file:`C:\\Program Files\\Python` у Python 1.6a1, 1.5.2 і попередніх версіях.

source: :file:`{prefix}` and :file:`{exec-prefix}` stand for the directories that Python is installed to, and where it finds its libraries at run-time. They are always the same under Windows, and very often the same under Unix and macOS. You can find out what your Python installation uses for :file:`{prefix}` and :file:`{exec-prefix}` by running Python in interactive mode and typing a few simple commands. Under Unix, just type ``python`` at the shell prompt. Under Windows, choose :menuselection:`Start --> Programs --> Python X.Y --> Python (command line)`. Once the interpreter is started, you type Python code at the prompt. For example, on my Linux system, I type the three Python statements shown below, and get the output as shown, to find out my :file:`{prefix}` and :file:`{exec-prefix}`:
uk: :file:`{prefix}` і :file:`{exec-prefix}` означають каталоги, у які встановлено Python, і де він знаходить свої бібліотеки під час виконання. Вони завжди однакові під Windows і дуже часто однакові під Unix і macOS. Ви можете дізнатися, що ваша інсталяція Python використовує для :file:`{prefix}` і :file:`{exec-prefix}`, запустивши Python в інтерактивному режимі та ввівши кілька простих команд. В Unix просто введіть ``python`` у командному рядку оболонки. У Windows виберіть :menuselection:`Пуск --> Програми --> Python X.Y --> Python (командний рядок)`. Після запуску інтерпретатора ви вводите код Python у запиті. Наприклад, у моїй системі Linux я вводжу три оператори Python, показані нижче, і отримую результат, як показано, щоб дізнатися мої :file:`{prefix}` і :file:`{exec-prefix}`:

source: A few other placeholders are used in this document: :file:`{X.Y}` stands for the version of Python, for example ``3.2``; :file:`{abiflags}` will be replaced by the value of :data:`sys.abiflags` or the empty string for platforms which don't define ABI flags; :file:`{distname}` will be replaced by the name of the module distribution being installed. Dots and capitalization are important in the paths; for example, a value that uses ``python3.2`` on UNIX will typically use ``Python32`` on Windows.
uk: У цьому документі використовується кілька інших заповнювачів: :file:`{X.Y}` означає версію Python, наприклад ``3.2``; :file:`{abiflags}` буде замінено на значення :data:`sys.abiflags` або порожній рядок для платформ, які не визначають прапори ABI; :file:`{distname}` буде замінено назвою дистрибутива модуля, який встановлюється. Крапки та великі літери важливі в шляхах; наприклад, значення, яке використовує ``python3.2`` в UNIX, зазвичай використовуватиме ``Python32`` у Windows.

source: If you don't want to install modules to the standard location, or if you don't have permission to write there, then you need to read about alternate installations in section :ref:`inst-alt-install`. If you want to customize your installation directories more heavily, see section :ref:`inst-custom-install` on custom installations.
uk: Якщо ви не бажаєте встановлювати модулі у стандартне розташування або якщо у вас немає дозволу на запис у цьому місці, вам потрібно прочитати про альтернативні встановлення в розділі :ref:`inst-alt-install`. Якщо ви бажаєте суттєвіше налаштувати ваші каталоги встановлення, див. розділ :ref:`inst-custom-install` про нестандартне встановлення.

source: Alternate Installation
uk: Альтернативна інсталяція

source: Often, it is necessary or desirable to install modules to a location other than the standard location for third-party Python modules. For example, on a Unix system you might not have permission to write to the standard third-party module directory. Or you might wish to try out a module before making it a standard part of your local Python installation. This is especially true when upgrading a distribution already present: you want to make sure your existing base of scripts still works with the new version before actually upgrading.
uk: Часто необхідно або бажано встановити модулі в інше місце, ніж стандартне розташування для сторонніх модулів Python. Наприклад, у системі Unix ви можете не мати дозволу на запис у стандартний каталог сторонніх модулів. Або ви можете спробувати модуль перед тим, як зробити його стандартною частиною локальної інсталяції Python. Це особливо актуально під час оновлення наявного дистрибутива: ви хочете переконатися, що ваша існуюча база сценаріїв все ще працює з новою версією, перш ніж фактично оновлювати.

source: The Distutils :command:`install` command is designed to make installing module distributions to an alternate location simple and painless. The basic idea is that you supply a base directory for the installation, and the :command:`install` command picks a set of directories (called an *installation scheme*) under this base directory in which to install files. The details differ across platforms, so read whichever of the following sections applies to you.
uk: Команда Distutils :command:`install` призначена для простого та безболісного встановлення дистрибутивів модулів до альтернативного розташування. Основна ідея полягає в тому, що ви вказуєте базовий каталог для інсталяції, а команда :command:`install` вибирає набір каталогів (званий *схемою інсталяції*) у цьому базовому каталозі, у який потрібно інсталювати файли. Деталі відрізняються для різних платформ, тому прочитайте той із наступних розділів, який вам підходить.

source: Note that the various alternate installation schemes are mutually exclusive: you can pass ``--user``, or ``--home``, or ``--prefix`` and ``--exec-prefix``, or ``--install-base`` and ``--install-platbase``, but you can't mix from these groups.
uk: Зауважте, що різні альтернативні схеми встановлення є взаємовиключними: ви можете передати ``--user``, ``--home``, ``--prefix`` і ``--exec-prefix``, або ``--install-base`` і ``--install-platbase``, але ви не можете змішувати ці групи.

source: Alternate installation: the user scheme
uk: Альтернативна установка: схема користувача

source: This scheme is designed to be the most convenient solution for users that don't have write permission to the global site-packages directory or don't want to install into it. It is enabled with a simple option::
uk: Ця схема розроблена як найзручніше рішення для користувачів, які не мають дозволу на запис до глобального каталогу пакетів сайтів або не хочуть встановлювати в нього. Це вмикається простим параметром::

source: Type of file
uk: Тип файлу

source: Installation directory
uk: Каталог встановлення

source: modules
uk: модулі

source: scripts
uk: сценарії

source: data
uk: даних

source: C headers
uk: C заголовки

source: And here are the values used on Windows:
uk: А ось значення, які використовуються в Windows:

source: :file:`{userbase}\\Python{XY}\\Scripts`
uk: :file:`{userbase}\\Python{XY}\\Сценарії`

source: The advantage of using this scheme compared to the other ones described below is that the user site-packages directory is under normal conditions always included in :data:`sys.path` (see :mod:`site` for more information), which means that there is no additional step to perform after running the :file:`setup.py` script to finalize the installation.
uk: Перевага використання цієї схеми порівняно з іншими, описаними нижче, полягає в тому, що каталог пакетів сайту користувача за звичайних умов завжди включається в :data:`sys.path` (див. :mod:`site` для отримання додаткової інформації), що означає, що після запуску сценарію :file:`setup.py` для завершення встановлення не потрібно виконувати жодних додаткових кроків.

source: The :command:`build_ext` command also has a ``--user`` option to add :file:`{userbase}/include` to the compiler search path for header files and :file:`{userbase}/lib` to the compiler search path for libraries as well as to the runtime search path for shared C libraries (rpath).
uk: Команда :command:`build_ext` також має опцію ``--user``, щоб додати :file:`{userbase}/include` до шляху пошуку компілятора для файлів заголовків і :file:`{userbase}/lib` до шляху пошуку компілятора для бібліотек, а також до шляху пошуку під час виконання для спільних бібліотек C (rpath).

source: Alternate installation: the home scheme
uk: Альтернативна установка: домашня схема
