Repository: python/python-docs-uk
Catalog: install/index.po
Languages: uk

source: A slightly less convenient way is to edit the :file:`site.py` file in Python's standard library, and modify ``sys.path``. :file:`site.py` is automatically imported when the Python interpreter is executed, unless the :option:`-S` switch is supplied to suppress this behaviour. So you could simply edit :file:`site.py` and add two lines to it:
uk: Трохи менш зручний спосіб – редагувати файл :file:`site.py` у стандартній бібліотеці Python і змінити ``sys.path``. :file:`site.py` автоматично імпортується під час виконання інтерпретатора Python, якщо не встановлено перемикач :option:`-S` для придушення такої поведінки. Тож ви можете просто відредагувати :file:`site.py` і додати до нього два рядки:

source: There are two environment variables that can modify ``sys.path``. :envvar:`PYTHONHOME` sets an alternate value for the prefix of the Python installation. For example, if :envvar:`PYTHONHOME` is set to ``/www/python``, the search path will be set to ``['', '/www/python/lib/pythonX.Y/', '/www/python/lib/pythonX.Y/plat-linux2', ...]``.
uk: Є дві змінні середовища, які можуть змінювати ``sys.path``. :envvar:`PYTHONHOME` встановлює альтернативне значення для префікса встановлення Python. Наприклад, якщо :envvar:`PYTHONHOME` встановлено на ``/www/python``, шлях пошуку буде встановлено на ``['', '/www/python/lib/pythonX.Y/', ' /www/python/lib/pythonX.Y/plat-linux2', ...]``.

source: The :envvar:`PYTHONPATH` variable can be set to a list of paths that will be added to the beginning of ``sys.path``. For example, if :envvar:`PYTHONPATH` is set to ``/www/python:/opt/py``, the search path will begin with ``['/www/python', '/opt/py']``. (Note that directories must exist in order to be added to ``sys.path``; the :mod:`site` module removes paths that don't exist.)
uk: Для змінної :envvar:`PYTHONPATH` можна встановити список шляхів, які будуть додані на початок ``sys.path``. Наприклад, якщо для :envvar:`PYTHONPATH` встановлено значення ``/www/python:/opt/py``, шлях пошуку починатиметься з ``['/www/python', '/opt/py']``. (Зауважте, що каталоги мають існувати, щоб їх можна було додати до ``sys.path``; модуль :mod:`site` видаляє шляхи, яких не існує.)

source: Finally, ``sys.path`` is just a regular Python list, so any Python application can modify it by adding or removing entries.
uk: Нарешті, ``sys.path`` — це звичайний список Python, тому будь-яка програма Python може змінити його, додаючи або видаляючи записи.

source: Distutils Configuration Files
uk: Файли конфігурації Distutils

source: As mentioned above, you can use Distutils configuration files to record personal or site preferences for any Distutils options. That is, any option to any command can be stored in one of two or three (depending on your platform) configuration files, which will be consulted before the command-line is parsed. This means that configuration files will override default values, and the command-line will in turn override configuration files. Furthermore, if multiple configuration files apply, values from "earlier" files are overridden by "later" files.
uk: Як згадувалося вище, ви можете використовувати конфігураційні файли Distutils для запису особистих налаштувань або параметрів сайту для будь-яких параметрів Distutils. Тобто будь-яку опцію будь-якої команди можна зберегти в одному з двох або трьох (залежно від вашої платформи) конфігураційних файлів, які будуть перевірені перед аналізом командного рядка. Це означає, що файли конфігурації замінять значення за замовчуванням, а командний рядок, у свою чергу, замінить файли конфігурації. Крім того, якщо застосовуються кілька файлів конфігурації, значення з "попередніх" файлів замінюються "пізнішими".

source: Location and names of config files
uk: Розташування та назви конфігураційних файлів

source: The names and locations of the configuration files vary slightly across platforms. On Unix and macOS, the three configuration files (in the order they are processed) are:
uk: Імена та розташування конфігураційних файлів дещо відрізняються на різних платформах. В Unix і macOS три файли конфігурації (у порядку їх обробки):

source: Location and filename
uk: Розташування та назва файлу

source: system
uk: система

source: personal
uk: особистий

source: local
uk: місцевий

source: And on Windows, the configuration files are:
uk: А в Windows конфігураційні файли:

source: Strictly speaking, the system-wide configuration file lives in the directory where the Distutils are installed; under Python 1.6 and later on Unix, this is as shown. For Python 1.5.2, the Distutils will normally be installed to :file:`{prefix}/lib/python1.5/site-packages/distutils`, so the system configuration file should be put there under Python 1.5.2.
uk: Власне кажучи, загальносистемний файл конфігурації знаходиться в каталозі, де встановлено Distutils; під Python 1.6 і пізніше в Unix, це як показано. Для Python 1.5.2 Distutils зазвичай встановлюється в :file:`{prefix}/lib/python1.5/site-packages/distutils`, тому файл конфігурації системи слід розміщувати туди під Python 1.5.2.

source: I.e., in the current directory (usually the location of the setup script).
uk: Тобто в поточному каталозі (зазвичай місце розташування сценарію налаштування).

source: (See also note (1).) Under Python 1.6 and later, Python's default "installation prefix" is :file:`C:\\Python`, so the system configuration file is normally :file:`C:\\Python\\Lib\\distutils\\distutils.cfg`. Under Python 1.5.2, the default prefix was :file:`C:\\Program Files\\Python`, and the Distutils were not part of the standard library---so the system configuration file would be :file:`C:\\Program Files\\Python\\distutils\\distutils.cfg` in a standard Python 1.5.2 installation under Windows.
uk: (Див. також примітку (1).) У Python 1.6 і пізніших версіях стандартним "префіксом встановлення" Python є :file:`C:\\Python`, тому файл конфігурації системи зазвичай має вигляд :file:`C:\\Python\ \Lib\\distutils\\distutils.cfg`. У Python 1.5.2 префікс за замовчуванням був :file:`C:\\Program Files\\Python`, а Distutils не були частиною стандартної бібліотеки --- тому файл конфігурації системи мав би виглядати як :file:`C :\\Program Files\\Python\\distutils\\distutils.cfg` у стандартній установці Python 1.5.2 під Windows.

source: On Windows, if the :envvar:`HOME` environment variable is not defined, :envvar:`USERPROFILE` then :envvar:`HOMEDRIVE` and :envvar:`HOMEPATH` will be tried. This is done by the :func:`os.path.expanduser` function used by Distutils.
uk: У Windows, якщо змінна середовища :envvar:`HOME` не визначена, :envvar:`USERPROFILE`, то :envvar:`HOMEDRIVE` і :envvar:`HOMEPATH` будуть спробовані. Це робиться за допомогою функції :func:`os.path.expanduser`, яку використовує Distutils.

source: Syntax of config files
uk: Синтаксис конфігураційних файлів

source: The Distutils configuration files all have the same syntax. The config files are grouped into sections. There is one section for each Distutils command, plus a ``global`` section for global options that affect every command. Each section consists of one option per line, specified as ``option=value``.
uk: Усі конфігураційні файли Distutils мають однаковий синтаксис. Файли конфігурації згруповані в розділи. Існує один розділ для кожної команди Distutils, а також розділ ``global`` для глобальних параметрів, які впливають на кожну команду. Кожен розділ складається з одного параметра на рядок, визначеного як ``option=value``.

source: For example, the following is a complete config file that just forces all commands to run quietly by default:
uk: Наприклад, нижче наведено повний файл конфігурації, який просто змушує всі команди виконуватися тихо за замовчуванням:

source: If this is installed as the system config file, it will affect all processing of any Python module distribution by any user on the current system. If it is installed as your personal config file (on systems that support them), it will affect only module distributions processed by you. And if it is used as the :file:`setup.cfg` for a particular module distribution, it affects only that distribution.
uk: Якщо це встановлено як файл конфігурації системи, це вплине на всю обробку будь-якого розповсюдження модуля Python будь-яким користувачем у поточній системі. Якщо його встановлено як ваш особистий конфігураційний файл (у системах, які їх підтримують), він впливатиме лише на розповсюдження модулів, які ви обробляєте. І якщо він використовується як :file:`setup.cfg` для певного дистрибутива модуля, він впливає лише на цей дистрибутив.

source: You could override the default "build base" directory and make the :command:`build\*` commands always forcibly rebuild all files with the following:
uk: Ви можете перевизначити типовий каталог "build base" і змусити команди :command:`build\*` завжди примусово перезбирати всі файли за допомогою наступного:

source: which corresponds to the command-line arguments ::
uk: який відповідає аргументам командного рядка ::

source: except that including the :command:`build` command on the command-line means that command will be run. Including a particular command in config files has no such implication; it only means that if the command is run, the options in the config file will apply. (Or if other commands that derive values from it are run, they will use the values in the config file.)
uk: за винятком того, що включення команди :command:`build` до командного рядка означає, що команда буде виконана. Включення конкретної команди до конфігураційних файлів не має такого значення; це лише означає, що якщо команду запущено, будуть застосовані параметри у файлі конфігурації. (Або якщо запускаються інші команди, які отримують значення з нього, вони використовуватимуть значення у файлі конфігурації.)

source: You can find out the complete list of options for any command using the :option:`!--help` option, e.g.::
uk: Ви можете знайти повний список параметрів для будь-якої команди за допомогою параметра :option:`!--help`, наприклад::

source: and you can find out the complete list of global options by using :option:`!--help` without a command::
uk: і ви можете дізнатися повний список глобальних параметрів, використовуючи :option:`!--help` без команди::

source: See also the "Reference" section of the "Distributing Python Modules" manual.
uk: Дивіться також розділ "Довідка" посібника "Розповсюдження модулів Python".

source: Building Extensions: Tips and Tricks
uk: Будівництво прибудов: поради та підказки

source: Whenever possible, the Distutils try to use the configuration information made available by the Python interpreter used to run the :file:`setup.py` script. For example, the same compiler and linker flags used to compile Python will also be used for compiling extensions. Usually this will work well, but in complicated situations this might be inappropriate. This section discusses how to override the usual Distutils behaviour.
uk: Коли це можливо, Distutils намагаються використовувати інформацію про конфігурацію, надану інтерпретатором Python, який використовується для запуску сценарію :file:`setup.py`. Наприклад, ті самі прапорці компілятора та компонувальника, що використовуються для компіляції Python, також використовуватимуться для компіляції розширень. Зазвичай це добре працює, але в складних ситуаціях це може бути недоречним. У цьому розділі обговорюється, як змінити звичайну поведінку Distutils.

source: Tweaking compiler/linker flags
uk: Налаштування прапорів компілятора/лінкера

source: Compiling a Python extension written in C or C++ will sometimes require specifying custom flags for the compiler and linker in order to use a particular library or produce a special kind of object code. This is especially true if the extension hasn't been tested on your platform, or if you're trying to cross-compile Python.
uk: Компіляція розширення Python, написаного на C або C++, іноді потребує вказівки спеціальних прапорів для компілятора та компонувальника, щоб використовувати певну бібліотеку або створювати особливий тип об’єктного коду. Це особливо вірно, якщо розширення не було протестовано на вашій платформі або якщо ви намагаєтеся крос-компілювати Python.

source: In the most general case, the extension author might have foreseen that compiling the extensions would be complicated, and provided a :file:`Setup` file for you to edit. This will likely only be done if the module distribution contains many separate extension modules, or if they often require elaborate sets of compiler flags in order to work.
uk: У найзагальнішому випадку автор розширення міг передбачити, що компіляція розширень буде складною, і надав файл :file:`Setup` для редагування. Ймовірно, це буде зроблено, лише якщо дистрибутив модуля містить багато окремих модулів розширення, або якщо вони часто вимагають складних наборів прапорів компілятора для роботи.

source: A :file:`Setup` file, if present, is parsed in order to get a list of extensions to build. Each line in a :file:`Setup` describes a single module. Lines have the following structure::
uk: Файл :file:`Setup`, якщо він є, аналізується, щоб отримати список розширень для створення. Кожен рядок у :file:`Setup` описує окремий модуль. Лінії мають таку структуру:

source: Let's examine each of the fields in turn.
uk: Розглянемо по черзі кожне з полів.

source: *module* is the name of the extension module to be built, and should be a valid Python identifier. You can't just change this in order to rename a module (edits to the source code would also be needed), so this should be left alone.
uk: *module* — це ім’я модуля розширення, який потрібно створити, і має бути дійсним ідентифікатором Python. Ви не можете просто змінити це, щоб перейменувати модуль (також буде потрібно редагування вихідного коду), тому це слід залишити.

source: *sourcefile* is anything that's likely to be a source code file, at least judging by the filename. Filenames ending in :file:`.c` are assumed to be written in C, filenames ending in :file:`.C`, :file:`.cc`, and :file:`.c++` are assumed to be C++, and filenames ending in :file:`.m` or :file:`.mm` are assumed to be in Objective C.
uk: *sourcefile* — це все, що ймовірно є файлом вихідного коду, принаймні судячи з назви файлу. Передбачається, що назви файлів, що закінчуються на :file:`.c`, написані на C, а назви файлів, що закінчуються на :file:`.C`, :file:`.cc` і :file:`.c++`, — на C++ , а імена файлів, що закінчуються на :file:`.m` або :file:`.mm`, вважаються такими, що належать до Objective C.

source: *cpparg* is an argument for the C preprocessor, and is anything starting with :option:`!-I`, :option:`!-D`, :option:`!-U` or :option:`!-C`.
uk: *cpparg* — це аргумент для препроцесора C і все, що починається з :option:`!-I`, :option:`!-D`, :option:`!-U` або :option:`!-C`.

source: *library* is anything ending in :file:`.a` or beginning with :option:`!-l` or :option:`!-L`.
uk: *бібліотека* — це все, що закінчується на :file:`.a` або починається на :option:`!-l` чи :option:`!-L`.

source: If a particular platform requires a special library on your platform, you can add it by editing the :file:`Setup` file and running ``python setup.py build``. For example, if the module defined by the line ::
uk: Якщо певна платформа потребує спеціальної бібліотеки на вашій платформі, ви можете додати її, відредагувавши файл :file:`Setup` і запустивши ``python setup.py build``. Наприклад, якщо модуль, визначений рядком ::

source: must be linked with the math library :file:`libm.a` on your platform, simply add :option:`!-lm` to the line::
uk: має бути пов’язано з математичною бібліотекою :file:`libm.a` на вашій платформі, просто додайте :option:`!-lm` до рядка::

source: Arbitrary switches intended for the compiler or the linker can be supplied with the :option:`!-Xcompiler` *arg* and :option:`!-Xlinker` *arg* options::
uk: Довільні перемикачі, призначені для компілятора або компонувальника, можуть бути забезпечені параметрами :option:`!-Xcompiler` *arg* і :option:`!-Xlinker` *arg*::

source: The next option after :option:`!-Xcompiler` and :option:`!-Xlinker` will be appended to the proper command line, so in the above example the compiler will be passed the :option:`!-o32` option, and the linker will be passed :option:`!-shared`. If a compiler option requires an argument, you'll have to supply multiple :option:`!-Xcompiler` options; for example, to pass ``-x c++`` the :file:`Setup` file would have to contain ``-Xcompiler -x -Xcompiler c++``.
uk: Наступний параметр після :option:`!-Xcompiler` і :option:`!-Xlinker` буде додано до відповідного командного рядка, тому у наведеному вище прикладі компілятору буде передано параметр :option:`!-o32` , і компонувальнику буде передано :option:`!-shared`. Якщо параметр компілятора потребує аргументу, вам доведеться надати кілька параметрів :option:`!-Xcompiler`; наприклад, щоб передати ``-x c++`` файл :file:`Setup` повинен містити ``-Xcompiler -x -Xcompiler c++``.

source: Compiler flags can also be supplied through setting the :envvar:`CFLAGS` environment variable. If set, the contents of :envvar:`CFLAGS` will be added to the compiler flags specified in the :file:`Setup` file.
uk: Прапори компілятора також можна надати через встановлення змінної середовища :envvar:`CFLAGS`. Якщо встановлено, вміст :envvar:`CFLAGS` буде додано до позначок компілятора, указаних у файлі :file:`Setup`.

source: Using non-Microsoft compilers on Windows
uk: Використання компіляторів не від Microsoft у Windows

source: This subsection describes the necessary steps to use Distutils with the Borland C++ compiler version 5.5. First you have to know that Borland's object file format (OMF) is different from the format used by the Python version you can download from the Python or ActiveState web site. (Python is built with Microsoft Visual C++, which uses COFF as the object file format.) For this reason you have to convert Python's library :file:`python25.lib` into the Borland format. You can do this as follows:
uk: У цьому підрозділі описано необхідні кроки для використання Distutils із компілятором Borland C++ версії 5.5. По-перше, ви повинні знати, що формат об’єктного файлу Borland (OMF) відрізняється від формату, який використовується версією Python, яку можна завантажити з веб-сайту Python або ActiveState. (Python побудовано з Microsoft Visual C++, який використовує COFF як формат об’єктного файлу.) З цієї причини вам потрібно конвертувати бібліотеку Python :file:`python25.lib` у формат Borland. Ви можете зробити це наступним чином:

source: The :file:`coff2omf` program comes with the Borland compiler. The file :file:`python25.lib` is in the :file:`Libs` directory of your Python installation. If your extension uses other libraries (zlib, ...) you have to convert them too.
uk: Програма :file:`coff2omf` постачається разом із компілятором Borland. Файл :file:`python25.lib` знаходиться в каталозі :file:`Libs` вашого встановлення Python. Якщо ваше розширення використовує інші бібліотеки (zlib, ...), їх також потрібно конвертувати.

source: The converted files have to reside in the same directories as the normal libraries.
uk: Перетворені файли мають зберігатися в тих самих каталогах, що й звичайні бібліотеки.

source: How does Distutils manage to use these libraries with their changed names? If the extension needs a library (eg. :file:`foo`) Distutils checks first if it finds a library with suffix :file:`_bcpp` (eg. :file:`foo_bcpp.lib`) and then uses this library. In the case it doesn't find such a special library it uses the default name (:file:`foo.lib`.) [#]_
uk: Як Distutils вдається використовувати ці бібліотеки зі зміненими назвами? Якщо для розширення потрібна бібліотека (наприклад, :file:`foo`), Distutils спочатку перевіряє, чи знайде бібліотеку з суфіксом :file:`_bcpp` (наприклад, :file:`foo_bcpp.lib`), а потім використовує цю бібліотеку. У випадку, якщо він не знаходить такої спеціальної бібліотеки, він використовує назву за замовчуванням (:file:`foo.lib`.) [#]_

source: To let Distutils compile your extension with Borland C++ you now have to type::
uk: Щоб дозволити Distutils скомпілювати ваше розширення за допомогою Borland C++, вам тепер потрібно ввести::

source: If you want to use the Borland C++ compiler as the default, you could specify this in your personal or system-wide configuration file for Distutils (see section :ref:`inst-config-files`.)
uk: Якщо ви хочете використовувати компілятор Borland C++ за замовчуванням, ви можете вказати це у своєму особистому або системному файлі конфігурації для Distutils (див. розділ :ref:`inst-config-files`.)

source: `C++Builder Compiler <https://www.embarcadero.com/products>`_
uk: `Компілятор C++Builder <https://www.embarcadero.com/products>`_

source: Information about the free C++ compiler from Borland, including links to the download pages.
uk: Інформація про безкоштовний компілятор C++ від Borland, включаючи посилання на сторінки завантаження.

source: `Creating Python Extensions Using Borland's Free Compiler <http://www.cyberus.ca/~g_will/pyExtenDL.shtml>`_
uk: `Створення розширень Python за допомогою безкоштовного компілятора Borland <http://www.cyberus.ca/~g_will/pyExtenDL.shtml>`_

source: Document describing how to use Borland's free command-line C++ compiler to build Python.
uk: Документ, що описує, як використовувати безкоштовний компілятор командного рядка Borland C++ для створення Python.

source: This section describes the necessary steps to use Distutils with the GNU C/C++ compilers in their Cygwin and MinGW distributions. [#]_ For a Python interpreter that was built with Cygwin, everything should work without any of these following steps.
uk: У цьому розділі описано необхідні кроки для використання Distutils із компіляторами GNU C/C++ у їхніх дистрибутивах Cygwin та MinGW. [#]_ Для інтерпретатора Python, створеного за допомогою Cygwin, усе повинно працювати без будь-якого з цих кроків.

source: Not all extensions can be built with MinGW or Cygwin, but many can. Extensions most likely to not work are those that use C++ or depend on Microsoft Visual C extensions.
uk: Не всі розширення можна створити за допомогою MinGW або Cygwin, але багато з них можуть. Швидше за все не працюють розширення, які використовують C++ або залежать від розширень Microsoft Visual C.

source: To let Distutils compile your extension with Cygwin you have to type::
uk: Щоб дозволити Distutils скомпілювати ваше розширення за допомогою Cygwin, вам потрібно ввести::

source: and for Cygwin in no-cygwin mode [#]_ or for MinGW type::
uk: і для Cygwin у режимі без Cygwin [#]_ або для типу MinGW::

source: If you want to use any of these options/compilers as default, you should consider writing it in your personal or system-wide configuration file for Distutils (see section :ref:`inst-config-files`.)
uk: Якщо ви хочете використовувати будь-який із цих параметрів/компіляторів за замовчуванням, вам слід записати його у свій особистий або загальносистемний файл конфігурації для Distutils (див. розділ :ref:`inst-config-files`.)

source: Older Versions of Python and MinGW
uk: Старіші версії Python і MinGW

source: The following instructions only apply if you're using a version of Python inferior to 2.4.1 with a MinGW inferior to 3.0.0 (with binutils-2.13.90-20030111-1).
uk: Наступні вказівки застосовуються, лише якщо ви використовуєте версію Python нижчу за 2.4.1 із MinGW нижчою за 3.0.0 (з binutils-2.13.90-20030111-1).
