Repository: python/python-docs-uk
Catalog: using/mac.po
Languages: uk

source: Using Python on a Mac
uk: Використання Python на Mac

source: Author
uk: Автор

source: Bob Savage <bobsavage@mac.com>
uk: Боб Севідж <bobsavage@mac.com>

source: Python on a Mac running macOS is in principle very similar to Python on any other Unix platform, but there are a number of additional features such as the IDE and the Package Manager that are worth pointing out.
uk: Python на Mac під керуванням macOS в принципі дуже схожий на Python на будь-якій іншій платформі Unix, але є ряд додаткових функцій, таких як IDE та менеджер пакунків, на які варто звернути увагу.

source: Getting and Installing MacPython
uk: Отримання та встановлення MacPython

source: macOS since version 10.8 comes with Python 2.7 pre-installed by Apple. If you wish, you are invited to install the most recent version of Python 3 from the Python website (https://www.python.org). A current "universal binary" build of Python, which runs natively on the Mac's new Intel and legacy PPC CPU's, is available there.
uk: macOS, починаючи з версії 10.8, поставляється з Python 2.7, попередньо встановленим Apple. Якщо ви бажаєте, вам пропонується встановити найновішу версію Python 3 із веб-сайту Python (https://www.python.org). Там доступна поточна "універсальна бінарна" збірка Python, яка працює на новому процесорі Intel від Mac і застарілих процесорах PPC.

source: What you get after installing is a number of things:
uk: Після встановлення ви отримуєте кілька речей:

source: A :file:`Python 3.9` folder in your :file:`Applications` folder. In here you find IDLE, the development environment that is a standard part of official Python distributions; and PythonLauncher, which handles double-clicking Python scripts from the Finder.
uk: Папка :file:`Python 3.9` у вашій папці :file:`Applications`. Тут ви знайдете IDLE, середовище розробки, яке є стандартною частиною офіційних дистрибутивів Python; і PythonLauncher, який обробляє подвійне клацання сценаріїв Python із Finder.

source: A framework :file:`/Library/Frameworks/Python.framework`, which includes the Python executable and libraries. The installer adds this location to your shell path. To uninstall MacPython, you can simply remove these three things. A symlink to the Python executable is placed in /usr/local/bin/.
uk: Фреймворк :file:`/Library/Frameworks/Python.framework`, який містить виконуваний файл Python і бібліотеки. Інсталятор додає це розташування до вашого шляху оболонки. Щоб видалити MacPython, ви можете просто видалити ці три речі. Символічне посилання на виконуваний файл Python розміщується в /usr/local/bin/.

source: The Apple-provided build of Python is installed in :file:`/System/Library/Frameworks/Python.framework` and :file:`/usr/bin/python`, respectively. You should never modify or delete these, as they are Apple-controlled and are used by Apple- or third-party software. Remember that if you choose to install a newer Python version from python.org, you will have two different but functional Python installations on your computer, so it will be important that your paths and usages are consistent with what you want to do.
uk: Складання Python, надане Apple, встановлено в :file:`/System/Library/Frameworks/Python.framework` і :file:`/usr/bin/python` відповідно. Ви ніколи не повинні змінювати або видаляти їх, оскільки вони контролюються Apple і використовуються програмним забезпеченням Apple або сторонніх виробників. Пам’ятайте, що якщо ви вирішите інсталювати новішу версію Python із сайту python.org, у вас буде дві різні, але функціональні інсталяції Python на вашому комп’ютері, тому важливо, щоб ваші шляхи та використання відповідали тому, що ви хочете зробити.

source: IDLE includes a help menu that allows you to access Python documentation. If you are completely new to Python you should start reading the tutorial introduction in that document.
uk: IDLE містить меню довідки, яке дозволяє отримати доступ до документації Python. Якщо ви зовсім новачок у Python, вам слід почати читати вступ до підручника в цьому документі.

source: If you are familiar with Python on other Unix platforms you should read the section on running Python scripts from the Unix shell.
uk: Якщо ви знайомі з Python на інших платформах Unix, вам слід прочитати розділ про запуск сценаріїв Python з оболонки Unix.

source: How to run a Python script
uk: Як запустити скрипт Python

source: Your best way to get started with Python on macOS is through the IDLE integrated development environment, see section :ref:`ide` and use the Help menu when the IDE is running.
uk: Ваш найкращий спосіб розпочати роботу з Python у macOS — скористатися інтегрованим середовищем розробки IDLE, перегляньте розділ :ref:`ide` і скористайтеся меню "Довідка", коли IDE запущено.

source: If you want to run Python scripts from the Terminal window command line or from the Finder you first need an editor to create your script. macOS comes with a number of standard Unix command line editors, :program:`vim` and :program:`emacs` among them. If you want a more Mac-like editor, :program:`BBEdit` or :program:`TextWrangler` from Bare Bones Software (see http://www.barebones.com/products/bbedit/index.html) are good choices, as is :program:`TextMate` (see https://macromates.com/). Other editors include :program:`Gvim` (http://macvim-dev.github.io/macvim/) and :program:`Aquamacs` (http://aquamacs.org/).
uk: Якщо ви хочете запускати сценарії Python з командного рядка вікна терміналу або з Finder, вам спочатку потрібен редактор для створення сценарію. macOS поставляється з низкою стандартних редакторів командного рядка Unix, серед яких :program:`vim` і :program:`emacs`. Якщо вам потрібен редактор, більш схожий на Mac, :program:`BBEdit` або :program:`TextWrangler` від Bare Bones Software (див. http://www.barebones.com/products/bbedit/index.html) — гарний вибір , як і :program:`TextMate` (див. https://macromates.com/). Інші редактори включають :program:`Gvim` (http://macvim-dev.github.io/macvim/) і :program:`Aquamacs` (http://aquamacs.org/).

source: To run your script from the Terminal window you must make sure that :file:`/usr/local/bin` is in your shell search path.
uk: Щоб запустити сценарій із вікна терміналу, переконайтеся, що :file:`/usr/local/bin` знаходиться у вашому шляху пошуку оболонки.

source: To run your script from the Finder you have two options:
uk: Щоб запустити свій сценарій із Finder, у вас є два варіанти:

source: Drag it to :program:`PythonLauncher`
uk: Перетягніть його до :program:`PythonLauncher`

source: Select :program:`PythonLauncher` as the default application to open your script (or any .py script) through the finder Info window and double-click it. :program:`PythonLauncher` has various preferences to control how your script is launched. Option-dragging allows you to change these for one invocation, or use its Preferences menu to change things globally.
uk: Виберіть :program:`PythonLauncher` як програму за замовчуванням, щоб відкрити свій сценарій (або будь-який сценарій .py) у вікні інформації пошуку та двічі клацніть його. :program:`PythonLauncher` має різні параметри для керування запуском вашого сценарію. Перетягування параметрів дає змогу змінювати їх за один виклик або використовувати його меню "Параметри", щоб змінити речі глобально.

source: Running scripts with a GUI
uk: Запуск скриптів з графічним інтерфейсом

source: With older versions of Python, there is one macOS quirk that you need to be aware of: programs that talk to the Aqua window manager (in other words, anything that has a GUI) need to be run in a special way. Use :program:`pythonw` instead of :program:`python` to start such scripts.
uk: У старих версіях Python є одна примха macOS, про яку вам потрібно знати: програми, які спілкуються з диспетчером вікон Aqua (іншими словами, все, що має графічний інтерфейс), потрібно запускати особливим чином. Використовуйте :program:`pythonw` замість :program:`python` для запуску таких сценаріїв.

source: With Python 3.9, you can use either :program:`python` or :program:`pythonw`.
uk: З Python 3.9 ви можете використовувати :program:`python` або :program:`pythonw`.

source: Configuration
uk: Конфігурація

source: Python on macOS honors all standard Unix environment variables such as :envvar:`PYTHONPATH`, but setting these variables for programs started from the Finder is non-standard as the Finder does not read your :file:`.profile` or :file:`.cshrc` at startup. You need to create a file :file:`~/.MacOSX/environment.plist`. See Apple's Technical Document QA1067 for details.
uk: Python у macOS підтримує всі стандартні змінні середовища Unix, такі як :envvar:`PYTHONPATH`, але встановлення цих змінних для програм, запущених із Finder, є нестандартним, оскільки Finder не читає ваші :file:`.profile` або :file:`.cshrc` під час запуску. Вам потрібно створити файл :file:`~/.MacOSX/environment.plist`. Докладніше див. у технічному документі Apple QA1067.

source: For more information on installation Python packages in MacPython, see section :ref:`mac-package-manager`.
uk: Додаткову інформацію про встановлення пакетів Python у MacPython див. у розділі :ref:`mac-package-manager`.

source: The IDE
uk: IDE

source: MacPython ships with the standard IDLE development environment. A good introduction to using IDLE can be found at http://www.hashcollision.org/hkn/python/idle_intro/index.html.
uk: MacPython поставляється зі стандартним середовищем розробки IDLE. Хороший вступ до використання IDLE можна знайти на http://www.hashcollision.org/hkn/python/idle_intro/index.html.

source: Installing Additional Python Packages
uk: Встановлення додаткових пакетів Python

source: There are several methods to install additional Python packages:
uk: Існує кілька способів встановлення додаткових пакетів Python:

source: Packages can be installed via the standard Python distutils mode (``python setup.py install``).
uk: Пакети можна встановити через стандартний режим Python distutils (``python setup.py install``).

source: Many packages can also be installed via the :program:`setuptools` extension or :program:`pip` wrapper, see https://pip.pypa.io/.
uk: Багато пакунків також можна встановити через розширення :program:`setuptools` або оболонку :program:`pip`, див. https://pip.pypa.io/.

source: GUI Programming on the Mac
uk: Програмування GUI на Mac

source: There are several options for building GUI applications on the Mac with Python.
uk: Існує кілька варіантів створення програм графічного інтерфейсу на Mac за допомогою Python.

source: *PyObjC* is a Python binding to Apple's Objective-C/Cocoa framework, which is the foundation of most modern Mac development. Information on PyObjC is available from https://pypi.org/project/pyobjc/.
uk: *PyObjC* — це прив’язка Python до фреймворку Apple Objective-C/Cocoa, який є основою більшості сучасних розробок Mac. Інформація про PyObjC доступна за адресою https://pypi.org/project/pyobjc/.

source: The standard Python GUI toolkit is :mod:`tkinter`, based on the cross-platform Tk toolkit (https://www.tcl.tk). An Aqua-native version of Tk is bundled with OS X by Apple, and the latest version can be downloaded and installed from https://www.activestate.com; it can also be built from source.
uk: Стандартний набір інструментів графічного інтерфейсу Python — це :mod:`tkinter`, заснований на кросплатформному наборі інструментів Tk (https://www.tcl.tk). Рідна версія Tk для Aqua поставляється в комплекті з OS X від Apple, а останню версію можна завантажити та встановити з https://www.activestate.com; його також можна створити з джерела.

source: *wxPython* is another popular cross-platform GUI toolkit that runs natively on macOS. Packages and documentation are available from https://www.wxpython.org.
uk: *wxPython* — це ще один популярний кросплатформний набір графічних інтерфейсів користувача, який працює на macOS. Пакети та документація доступні на сайті https://www.wxpython.org.

source: *PyQt* is another popular cross-platform GUI toolkit that runs natively on macOS. More information can be found at https://riverbankcomputing.com/software/pyqt/intro.
uk: *PyQt* — ще один популярний кросплатформний інструментарій із графічним інтерфейсом користувача, який працює на macOS. Більше інформації можна знайти на https://riverbankcomputing.com/software/pyqt/intro.

source: Distributing Python Applications on the Mac
uk: Розповсюдження програм Python на Mac

source: The standard tool for deploying standalone Python applications on the Mac is :program:`py2app`. More information on installing and using py2app can be found at https://pypi.org/project/py2app/.
uk: Стандартним інструментом для розгортання автономних програм Python на Mac є :program:`py2app`. Більше інформації про встановлення та використання py2app можна знайти на сторінці https://pypi.org/project/py2app/.

source: Other Resources
uk: Інші ресурси

source: The MacPython mailing list is an excellent support resource for Python users and developers on the Mac:
uk: Список розсилки MacPython є чудовим ресурсом підтримки для користувачів і розробників Python на Mac:

source: Another useful resource is the MacPython wiki:
uk: Іншим корисним ресурсом є вікі MacPython:
