Repository: python/python-docs-uk
Catalog: using/unix.po
Languages: uk

source: Using Python on Unix platforms
uk: Використання Python на платформах Unix

source: Getting and installing the latest version of Python
uk: Отримання та встановлення останньої версії Python

source: On Linux
uk: На Linux

source: Python comes preinstalled on most Linux distributions, and is available as a package on all others. However there are certain features you might want to use that are not available on your distro's package. You can easily compile the latest version of Python from source.
uk: Python попередньо встановлено на більшості дистрибутивів Linux і доступний у вигляді пакета на всіх інших. Однак є певні функції, які ви можете використати, але недоступні в пакеті вашого дистрибутива. Ви можете легко скомпілювати останню версію Python із початкового коду.

source: In the event that Python doesn't come preinstalled and isn't in the repositories as well, you can easily make packages for your own distro. Have a look at the following links:
uk: У випадку, якщо Python не попередньо встановлений і його також немає в репозиторіях, ви можете легко створити пакунки для свого власного дистрибутива. Перегляньте наступні посилання:

source: for Debian users
uk: для користувачів Debian

source: for OpenSuse users
uk: для користувачів OpenSuse

source: for Fedora users
uk: для користувачів Fedora

source: for Slackware users
uk: для користувачів Slackware

source: On FreeBSD and OpenBSD
uk: На FreeBSD і OpenBSD

source: FreeBSD users, to add the package use::
uk: Користувачі FreeBSD, щоб додати пакет, використовуйте::

source: OpenBSD users, to add the package use::
uk: Користувачі OpenBSD, щоб додати пакет, використовуйте::

source: For example i386 users get the 2.5.1 version of Python using::
uk: Наприклад, користувачі i386 отримують версію Python 2.5.1 за допомогою:

source: On OpenSolaris
uk: На OpenSolaris

source: You can get Python from `OpenCSW <https://www.opencsw.org/>`_. Various versions of Python are available and can be installed with e.g. ``pkgutil -i python27``.
uk: Ви можете отримати Python з `OpenCSW <https://www.opencsw.org/>`_. Доступні різні версії Python, які можна встановити, напр. ``pkgutil -i python27``.

source: Building Python
uk: Створення Python

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `clone <https://devguide.python.org/setup/#getting-the-source-code>`_. (If you want to contribute patches, you will need a clone.)
uk: Якщо ви хочете скомпілювати CPython самостійно, перше, що вам слід зробити, це отримати `джерело <https://www.python.org/downloads/source/>`_. Ви можете завантажити вихідний код останнього випуску або просто отримати новий `клон <https://devguide.python.org/setup/#getting-the-source-code>`_. (Якщо ви хочете додати патчі, вам знадобиться клон.)

source: The build process consists of the usual commands::
uk: Процес збирання складається зі звичайних команд:

source: :ref:`Configuration options <configure-options>` and caveats for specific Unix platforms are extensively documented in the :source:`README.rst` file in the root of the Python source tree.
uk: :ref:`Параметри конфігурації <configure-options>` і застереження для конкретних платформ Unix детально задокументовані у файлі :source:`README.rst` у корені дерева вихідних кодів Python.

source: ``make install`` can overwrite or masquerade the :file:`python3` binary. ``make altinstall`` is therefore recommended instead of ``make install`` since it only installs :file:`{exec_prefix}/bin/python{version}`.
uk: ``make install`` може перезаписати або маскувати двійковий файл :file:`python3`. Таким чином, ``make altinstall`` рекомендується замість ``make install``, оскільки він встановлює лише :file:`{exec_prefix}/bin/python{version}`.

source: Python-related paths and files
uk: Шляхи та файли, пов’язані з Python

source: These are subject to difference depending on local installation conventions; :envvar:`prefix` (``${prefix}``) and :envvar:`exec_prefix` (``${exec_prefix}``) are installation-dependent and should be interpreted as for GNU software; they may be the same.
uk: Вони можуть відрізнятися залежно від місцевих умов встановлення; :envvar:`prefix` (``${prefix}``) і :envvar:`exec_prefix` (``${exec_prefix}``) залежать від інсталяції та мають інтерпретуватися як програмне забезпечення GNU; вони можуть бути однаковими.

source: For example, on most Linux systems, the default for both is :file:`/usr`.
uk: Наприклад, у більшості систем Linux типовим для обох є :file:`/usr`.

source: File/directory
uk: Файл/каталог

source: Meaning
uk: Значення

source: Recommended location of the interpreter.
uk: Рекомендоване місце розташування перекладача.

source: Recommended locations of the directories containing the standard modules.
uk: Рекомендоване розташування каталогів, що містять стандартні модулі.

source: Recommended locations of the directories containing the include files needed for developing Python extensions and embedding the interpreter.
uk: Рекомендовані розташування каталогів, що містять файли включення, необхідні для розробки розширень Python і вбудовування інтерпретатора.

source: Miscellaneous
uk: Різне

source: To easily use Python scripts on Unix, you need to make them executable, e.g. with
uk: Щоб легко використовувати сценарії Python в Unix, вам потрібно зробити їх виконуваними, напр. з

source: and put an appropriate Shebang line at the top of the script. A good choice is usually ::
uk: і помістіть відповідний рядок Shebang у верхній частині сценарію. Зазвичай хороший вибір:

source: which searches for the Python interpreter in the whole :envvar:`PATH`. However, some Unices may not have the :program:`env` command, so you may need to hardcode ``/usr/bin/python3`` as the interpreter path.
uk: який шукає інтерпретатор Python у всьому :envvar:`PATH`. Однак деякі Unix можуть не мати команди :program:`env`, тому вам може знадобитися жорстко закодувати ``/usr/bin/python3`` як шлях інтерпретатора.

source: To use shell commands in your Python scripts, look at the :mod:`subprocess` module.
uk: Щоб використовувати команди оболонки у ваших сценаріях Python, подивіться на модуль :mod:`subprocess`.

source: Custom OpenSSL
uk: Спеціальний OpenSSL

source: To use your vendor's OpenSSL configuration and system trust store, locate the directory with ``openssl.cnf`` file or symlink in ``/etc``. On most distribution the file is either in ``/etc/ssl`` or ``/etc/pki/tls``. The directory should also contain a ``cert.pem`` file and/or a ``certs`` directory.
uk: Щоб використовувати конфігурацію OpenSSL і сховище довіри системи вашого постачальника, знайдіть каталог із файлом ``openssl.cnf`` або символічним посиланням у ``/etc``. У більшості дистрибутивів файл знаходиться або в ``/etc/ssl``, або ``/etc/pki/tls``. Каталог також має містити файл ``cert.pem`` та/або каталог ``certs``.

source: Download, build, and install OpenSSL. Make sure you use ``install_sw`` and not ``install``. The ``install_sw`` target does not override ``openssl.cnf``.
uk: Завантажте, створіть і встановіть OpenSSL. Переконайтеся, що ви використовуєте ``install_sw``, а не ``install``. Ціль ``install_sw`` не перевизначає ``openssl.cnf``.

source: Build Python with custom OpenSSL (see the configure `--with-openssl` and `--with-openssl-rpath` options)
uk: Створюйте Python із спеціальним OpenSSL (перегляньте параметри налаштування `--with-openssl` і `--with-openssl-rpath`)

source: Patch releases of OpenSSL have a backwards compatible ABI. You don't need to recompile Python to update OpenSSL. It's sufficient to replace the custom OpenSSL installation with a newer version.
uk: Патчі OpenSSL мають зворотну сумісність ABI. Вам не потрібно перекомпілювати Python, щоб оновити OpenSSL. Досить замінити спеціальну установку OpenSSL на новішу версію.
