Repository: python/python-docs-uk
Catalog: howto/argparse.po
Languages: uk

source: Argparse Tutorial
uk: Підручник Argparse

source: author
uk: автор

source: This tutorial is intended to be a gentle introduction to :mod:`argparse`, the recommended command-line parsing module in the Python standard library.
uk: Цей підручник призначений для ознайомлення з :mod:`argparse`, рекомендованим модулем аналізу командного рядка в стандартній бібліотеці Python.

source: There are two other modules that fulfill the same task, namely :mod:`getopt` (an equivalent for :c:func:`getopt` from the C language) and the deprecated :mod:`optparse`. Note also that :mod:`argparse` is based on :mod:`optparse`, and therefore very similar in terms of usage.
uk: Є два інші модулі, які виконують те саме завдання, а саме :mod:`getopt` (еквівалент :c:func:`getopt` з мови C) і застарілий :mod:`optparse`. Зауважте також, що :mod:`argparse` засновано на :mod:`optparse`, і тому дуже подібний з точки зору використання.

source: Concepts
uk: Концепції

source: Let's show the sort of functionality that we are going to explore in this introductory tutorial by making use of the :command:`ls` command:
uk: Давайте покажемо тип функціональності, який ми збираємося досліджувати в цьому вступному посібнику, використовуючи команду :command:`ls`:

source: A few concepts we can learn from the four commands:
uk: Кілька понять, які ми можемо вивчити з чотирьох команд:

source: The :command:`ls` command is useful when run without any options at all. It defaults to displaying the contents of the current directory.
uk: Команда :command:`ls` корисна, якщо її запускати без жодних опцій. За замовчуванням відображається вміст поточного каталогу.

source: If we want beyond what it provides by default, we tell it a bit more. In this case, we want it to display a different directory, ``pypy``. What we did is specify what is known as a positional argument. It's named so because the program should know what to do with the value, solely based on where it appears on the command line. This concept is more relevant to a command like :command:`cp`, whose most basic usage is ``cp SRC DEST``. The first position is *what you want copied,* and the second position is *where you want it copied to*.
uk: Якщо ми хочемо вийти за межі того, що він надає за замовчуванням, ми розповідаємо про це трохи більше. У цьому випадку ми хочемо, щоб він відображав інший каталог, ``pypy``. Ми вказали так званий позиційний аргумент. Це названо так, тому що програма повинна знати, що робити зі значенням, виключно на основі того, де воно з’являється в командному рядку. Ця концепція більш актуальна для такої команди, як :command:`cp`, основним використанням якої є ``cp SRC DEST``. Перша позиція — це *те, що ви хочете скопіювати*, а друга позиція — це *куди ви хочете це скопіювати*.

source: Now, say we want to change behaviour of the program. In our example, we display more info for each file instead of just showing the file names. The ``-l`` in that case is known as an optional argument.
uk: Тепер, скажімо, ми хочемо змінити поведінку програми. У нашому прикладі ми показуємо більше інформації для кожного файлу, а не просто показуємо імена файлів. ``-l`` у цьому випадку відомий як необов'язковий аргумент.

source: That's a snippet of the help text. It's very useful in that you can come across a program you have never used before, and can figure out how it works simply by reading its help text.
uk: Це фрагмент довідкового тексту. Це дуже корисно, оскільки ви можете натрапити на програму, якою ніколи раніше не користувалися, і зрозуміти, як вона працює, просто прочитавши довідковий текст.

source: The basics
uk: Основи

source: Let us start with a very simple example which does (almost) nothing::
uk: Почнемо з дуже простого прикладу, який (майже) нічого не робить:

source: Following is a result of running the code:
uk: Нижче наведено результат виконання коду:

source: Here is what is happening:
uk: Ось що відбувається:

source: Running the script without any options results in nothing displayed to stdout. Not so useful.
uk: Запуск сценарію без будь-яких параметрів призводить до того, що стандартний вивід нічого не відображає. Не дуже корисно.

source: The second one starts to display the usefulness of the :mod:`argparse` module. We have done almost nothing, but already we get a nice help message.
uk: Другий починає відображати корисність модуля :mod:`argparse`. Ми майже нічого не зробили, але вже отримуємо гарне довідкове повідомлення.

source: The ``--help`` option, which can also be shortened to ``-h``, is the only option we get for free (i.e. no need to specify it). Specifying anything else results in an error. But even then, we do get a useful usage message, also for free.
uk: Опція ``--help``, яку також можна скоротити до ``-h``, є єдиною опцією, яку ми отримуємо безкоштовно (тобто її не потрібно вказувати). Вказівка будь-чого іншого призводить до помилки. Але навіть тоді ми отримуємо корисне повідомлення про використання, також безкоштовно.

source: Introducing Positional arguments
uk: Представлення позиційних аргументів

source: An example::
uk: Приклад::

source: And running the code:
uk: І запуск коду:

source: Here is what's happening:
uk: Ось що відбувається:

source: We've added the :meth:`add_argument` method, which is what we use to specify which command-line options the program is willing to accept. In this case, I've named it ``echo`` so that it's in line with its function.
uk: Ми додали метод :meth:`add_argument`, який ми використовуємо, щоб визначити, які параметри командного рядка програма готова прийняти. У цьому випадку я назвав його ``echo``, щоб воно відповідало його функції.

source: Calling our program now requires us to specify an option.
uk: Для виклику нашої програми тепер потрібно вказати опцію.

source: The :meth:`parse_args` method actually returns some data from the options specified, in this case, ``echo``.
uk: Метод :meth:`parse_args` насправді повертає деякі дані з указаних параметрів, у даному випадку це ``echo``.

source: The variable is some form of 'magic' that :mod:`argparse` performs for free (i.e. no need to specify which variable that value is stored in). You will also notice that its name matches the string argument given to the method, ``echo``.
uk: Змінна є певною формою "магії", яку :mod:`argparse` виконує безкоштовно (тобто не потрібно вказувати, у якій змінній це значення зберігається). Ви також помітите, що його назва відповідає рядковому аргументу, наданому методу, ``echo``.

source: Note however that, although the help display looks nice and all, it currently is not as helpful as it can be. For example we see that we got ``echo`` as a positional argument, but we don't know what it does, other than by guessing or by reading the source code. So, let's make it a bit more useful::
uk: Зауважте, однак, що, незважаючи на те, що екран довідки виглядає гарно і все таке, наразі він не такий корисний, як міг би бути. Наприклад, ми бачимо, що ми отримали ``echo`` як позиційний аргумент, але ми не знаємо, що він робить, окрім здогадок або читання вихідного коду. Отже, давайте зробимо це трохи кориснішим::

source: And we get:
uk: І отримуємо:

source: Now, how about doing something even more useful::
uk: А тепер як щодо того, щоб зробити щось ще корисніше:

source: That didn't go so well. That's because :mod:`argparse` treats the options we give it as strings, unless we tell it otherwise. So, let's tell :mod:`argparse` to treat that input as an integer::
uk: Це пішло не так добре. Це тому, що :mod:`argparse` розглядає надані нами параметри як рядки, якщо ми не вкажемо інше. Отже, давайте скажемо :mod:`argparse` розглядати цей вхід як ціле число::

source: That went well. The program now even helpfully quits on bad illegal input before proceeding.
uk: Це пройшло добре. Програма тепер навіть допомагає завершити роботу, якщо неправильно введено неправильні дані, перш ніж продовжити.

source: Introducing Optional arguments
uk: Представляємо додаткові аргументи

source: So far we have been playing with positional arguments. Let us have a look on how to add optional ones::
uk: Досі ми гралися з позиційними аргументами. Давайте розглянемо, як додати необов'язкові:

source: And the output:
uk: І вихід:

source: The program is written so as to display something when ``--verbosity`` is specified and display nothing when not.
uk: Програма написана таким чином, щоб щось відображати, коли вказано ``--verbosity``, і нічого не відображати, якщо ні.

source: To show that the option is actually optional, there is no error when running the program without it. Note that by default, if an optional argument isn't used, the relevant variable, in this case :attr:`args.verbosity`, is given ``None`` as a value, which is the reason it fails the truth test of the :keyword:`if` statement.
uk: Щоб показати, що цей параметр насправді є необов’язковим, помилка не виникає під час запуску програми без нього. Зауважте, що за замовчуванням, якщо необов’язковий аргумент не використовується, відповідній змінній, у цьому випадку :attr:`args.verbosity`, присвоюється значення ``None``, через що вона не проходить тест на істинність оператора :keyword:`if`.

source: The help message is a bit different.
uk: Довідкове повідомлення дещо інше.

source: When using the ``--verbosity`` option, one must also specify some value, any value.
uk: При використанні опції ``--verbosity`` необхідно також вказати певне значення, будь-яке значення.

source: The above example accepts arbitrary integer values for ``--verbosity``, but for our simple program, only two values are actually useful, ``True`` or ``False``. Let's modify the code accordingly::
uk: Наведений вище приклад приймає довільні цілі значення для ``--verbosity``, але для нашої простої програми насправді корисними є лише два значення, ``True`` або ``False``. Давайте відповідно змінимо код::

source: The option is now more of a flag than something that requires a value. We even changed the name of the option to match that idea. Note that we now specify a new keyword, ``action``, and give it the value ``"store_true"``. This means that, if the option is specified, assign the value ``True`` to :data:`args.verbose`. Not specifying it implies ``False``.
uk: Параметр тепер більше схожий на прапор, ніж щось, що вимагає значення. Ми навіть змінили назву опції відповідно до цієї ідеї. Зауважте, що тепер ми вказуємо нове ключове слово, ``action``, і надаємо йому значення ``"store_true"``. Це означає, що якщо параметр указано, присвойте значення ``True`` для :data:`args.verbose`. Невказівка означає ``False``.

source: It complains when you specify a value, in true spirit of what flags actually are.
uk: Він скаржиться, коли ви вказуєте значення, у справжньому дусі того, чим насправді є прапори.

source: Notice the different help text.
uk: Зверніть увагу на інший текст довідки.

source: Short options
uk: Короткі варіанти

source: If you are familiar with command line usage, you will notice that I haven't yet touched on the topic of short versions of the options. It's quite simple::
uk: Якщо ви знайомі з використанням командного рядка, ви помітите, що я ще не торкався теми коротких версій параметрів. Це досить просто::

source: And here goes:
uk: І ось:

source: Note that the new ability is also reflected in the help text.
uk: Зверніть увагу, що нова здатність також відображається в тексті довідки.

source: Combining Positional and Optional arguments
uk: Поєднання позиційних і необов’язкових аргументів

source: Our program keeps growing in complexity::
uk: Наша програма постійно ускладнюється:

source: And now the output:
uk: А тепер вихід:

source: We've brought back a positional argument, hence the complaint.
uk: Ми повернули позиційний аргумент, тому скарга.

source: Note that the order does not matter.
uk: Зауважте, що порядок не має значення.

source: How about we give this program of ours back the ability to have multiple verbosity values, and actually get to use them::
uk: Як щодо того, щоб ми повернули цій нашій програмі можливість мати кілька значень докладності та фактично отримати їх використання:

source: These all look good except the last one, which exposes a bug in our program. Let's fix it by restricting the values the ``--verbosity`` option can accept::
uk: Усі вони виглядають добре, крім останнього, який виявляє помилку в нашій програмі. Давайте виправимо це, обмеживши значення, які може приймати параметр ``--verbosity``:

source: Note that the change also reflects both in the error message as well as the help string.
uk: Зауважте, що зміна також відображається як у повідомленні про помилку, так і в рядку довідки.

source: Now, let's use a different approach of playing with verbosity, which is pretty common. It also matches the way the CPython executable handles its own verbosity argument (check the output of ``python --help``)::
uk: Тепер давайте використаємо інший підхід гри з багатослівністю, який є досить поширеним. Це також відповідає тому, як виконуваний файл CPython обробляє власний аргумент багатослівності (перевірте вихід ``python --help``)::

source: We have introduced another action, "count", to count the number of occurrences of specific options.
uk: Ми запровадили ще одну дію, "підрахунок", щоб підрахувати кількість повторень певних параметрів.

source: Yes, it's now more of a flag (similar to ``action="store_true"``) in the previous version of our script. That should explain the complaint.
uk: Так, тепер це більше позначка (схожа на ``action="store_true"``) у попередній версії нашого сценарію. Це має пояснити скаргу.

source: It also behaves similar to "store_true" action.
uk: Він також поводиться подібно до дії "store_true".

source: Now here's a demonstration of what the "count" action gives. You've probably seen this sort of usage before.
uk: Тепер ось демонстрація того, що дає дія "підрахунок". Ви, напевно, бачили таке використання раніше.

source: And if you don't specify the ``-v`` flag, that flag is considered to have ``None`` value.
uk: І якщо ви не вкажете прапорець ``-v``, цей прапорець вважатиметься таким, що має значення ``None``.

source: As should be expected, specifying the long form of the flag, we should get the same output.
uk: Як і слід було очікувати, вказавши довгу форму прапора, ми повинні отримати той самий результат.

source: Sadly, our help output isn't very informative on the new ability our script has acquired, but that can always be fixed by improving the documentation for our script (e.g. via the ``help`` keyword argument).
uk: На жаль, результати нашої довідки не надто інформативні щодо нових можливостей, які отримав наш сценарій, але це завжди можна виправити, покращивши документацію для нашого сценарію (наприклад, за допомогою аргументу ключового слова ``help``).

source: That last output exposes a bug in our program.
uk: Цей останній вихід виявляє помилку в нашій програмі.

source: Let's fix::
uk: Виправимо::

source: And this is what it gives:
uk: І ось що це дає:

source: First output went well, and fixes the bug we had before. That is, we want any value >= 2 to be as verbose as possible.
uk: Перший вихід пройшов добре та виправляє помилку, яку ми мали раніше. Тобто ми хочемо, щоб будь-яке значення >= 2 було якомога детальнішим.

source: Third output not so good.
uk: Третій вихід не дуже хороший.

source: Let's fix that bug::
uk: Давайте виправимо цю помилку::

source: We've just introduced yet another keyword, ``default``. We've set it to ``0`` in order to make it comparable to the other int values. Remember that by default, if an optional argument isn't specified, it gets the ``None`` value, and that cannot be compared to an int value (hence the :exc:`TypeError` exception).
uk: Ми щойно представили ще одне ключове слово, ``default``. Ми встановили для нього значення ``0``, щоб зробити його порівнянним з іншими значеннями int. Пам’ятайте, що за замовчуванням, якщо необов’язковий аргумент не вказано, він отримує значення ``None``, яке не можна порівняти зі значенням int (отже, виняток :exc:`TypeError`).

source: And:
uk: і:

source: You can go quite far just with what we've learned so far, and we have only scratched the surface. The :mod:`argparse` module is very powerful, and we'll explore a bit more of it before we end this tutorial.
uk: Ви можете зайти досить далеко лише з тим, що ми навчилися досі, і ми лише подряпали поверхню. Модуль :mod:`argparse` дуже потужний, і ми вивчимо його трохи більше, перш ніж закінчити цей підручник.

source: Getting a little more advanced
uk: Ставши трохи більш просунутим

source: What if we wanted to expand our tiny program to perform other powers, not just squares::
uk: Що, якби ми захотіли розширити нашу крихітну програму для виконання інших ступенів, а не лише квадратів:

source: Output:
uk: Вихід:

source: Notice that so far we've been using verbosity level to *change* the text that gets displayed. The following example instead uses verbosity level to display *more* text instead::
uk: Зверніть увагу, що досі ми використовували рівень докладності, щоб *змінити* текст, який відображається. Натомість у наступному прикладі використовується рівень детальності для відображення *більше* тексту::

source: Conflicting options
uk: Конфліктні варіанти

source: So far, we have been working with two methods of an :class:`argparse.ArgumentParser` instance. Let's introduce a third one, :meth:`add_mutually_exclusive_group`. It allows for us to specify options that conflict with each other. Let's also change the rest of the program so that the new functionality makes more sense: we'll introduce the ``--quiet`` option, which will be the opposite of the ``--verbose`` one::
uk: Поки що ми працювали з двома методами екземпляра :class:`argparse.ArgumentParser`. Давайте представимо третій, :meth:`add_mutually_exclusive_group`. Це дозволяє нам вказувати параметри, які суперечать один одному. Давайте також змінимо решту програми, щоб нова функціональність мала більше сенсу: ми запровадимо опцію ``--quiet``, яка буде протилежною опції ``--verbose``::

source: Our program is now simpler, and we've lost some functionality for the sake of demonstration. Anyways, here's the output:
uk: Наша програма стала простішою, і ми втратили деякі функції заради демонстрації. У будь-якому випадку, ось результат:

source: That should be easy to follow. I've added that last output so you can see the sort of flexibility you get, i.e. mixing long form options with short form ones.
uk: Це повинно бути легко слідкувати. Я додав цей останній вихід, щоб ви могли бачити, яку гнучкість ви отримуєте, тобто змішування параметрів довгої форми з опціями короткої.

source: Before we conclude, you probably want to tell your users the main purpose of your program, just in case they don't know::
uk: Перш ніж завершити, ви, ймовірно, захочете повідомити своїм користувачам головну мету вашої програми, на випадок, якщо вони не знають:

source: Note that slight difference in the usage text. Note the ``[-v | -q]``, which tells us that we can either use ``-v`` or ``-q``, but not both at the same time:
uk: Зверніть увагу на невелику різницю в тексті використання. Зверніть увагу на ``[-v | -q]``, який говорить нам, що ми можемо використовувати ``-v`` або ``-q``, але не обидва одночасно:

source: Conclusion
uk: Висновок

source: The :mod:`argparse` module offers a lot more than shown here. Its docs are quite detailed and thorough, and full of examples. Having gone through this tutorial, you should easily digest them without feeling overwhelmed.
uk: Модуль :mod:`argparse` пропонує набагато більше, ніж показано тут. Його документи досить докладні та ретельні та повні прикладів. Пройшовши цей підручник, ви повинні легко засвоїти їх, не відчуваючи себе приголомшеними.
