Repository: python/python-docs-uk
Catalog: howto/curses.po
Languages: uk

source: Windows remember where the cursor was left after the last operation, so if you leave out the *y,x* coordinates, the string or character will be displayed wherever the last operation left off. You can also move the cursor with the ``move(y,x)`` method. Because some terminals always display a flashing cursor, you may want to ensure that the cursor is positioned in some location where it won't be distracting; it can be confusing to have the cursor blinking at some apparently random location.
uk: Windows запам’ятовує, де був залишений курсор після останньої операції, тому, якщо ви пропустите координати *y,x*, рядок або символ відображатиметься там, де зупинилася остання операція. Ви також можете перемістити курсор за допомогою методу ``move(y,x)``. Оскільки деякі термінали завжди відображають блимаючий курсор, ви можете переконатися, що курсор розташований у певному місці, де він не буде відволікати; блимання курсора в певному, начебто випадковому, місці може бути збентеженим.

source: If your application doesn't need a blinking cursor at all, you can call ``curs_set(False)`` to make it invisible. For compatibility with older curses versions, there's a ``leaveok(bool)`` function that's a synonym for :func:`~curses.curs_set`. When *bool* is true, the curses library will attempt to suppress the flashing cursor, and you won't need to worry about leaving it in odd locations.
uk: Якщо вашій програмі зовсім не потрібен мерехтливий курсор, ви можете викликати ``curs_set(False)``, щоб зробити його невидимим. Для сумісності зі старішими версіями curses існує функція ``leaveok(bool)``, яка є синонімом :func:`~curses.curs_set`. Якщо *bool* має значення true, бібліотека curses намагатиметься придушити миготливий курсор, і вам не потрібно буде турбуватися про те, щоб залишити його в незвичних місцях.

source: Attributes and Color
uk: Атрибути та колір

source: Characters can be displayed in different ways. Status lines in a text-based application are commonly shown in reverse video, or a text viewer may need to highlight certain words. curses supports this by allowing you to specify an attribute for each cell on the screen.
uk: Символи можуть відображатися різними способами. Рядки стану в текстовій програмі зазвичай відображаються у зворотному відео, або програмі перегляду тексту може знадобитися виділити певні слова. curses підтримує це, дозволяючи вам вказати атрибут для кожної клітинки на екрані.

source: An attribute is an integer, each bit representing a different attribute. You can try to display text with multiple attribute bits set, but curses doesn't guarantee that all the possible combinations are available, or that they're all visually distinct. That depends on the ability of the terminal being used, so it's safest to stick to the most commonly available attributes, listed here.
uk: Атрибут — це ціле число, кожен біт якого представляє окремий атрибут. Ви можете спробувати відобразити текст з кількома встановленими бітами атрибутів, але curses не гарантує, що всі можливі комбінації доступні, або що всі вони візуально відрізняються. Це залежить від можливостей використовуваного терміналу, тому найбезпечніше дотримуватися найпоширеніших атрибутів, перелічених тут.

source: Attribute
uk: Атрибут

source: Blinking text
uk: Миготливий текст

source: Extra bright or bold text
uk: Дуже яскравий або жирний текст

source: Half bright text
uk: Наполовину яскравий текст

source: Reverse-video text
uk: Зворотний відеотекст

source: The best highlighting mode available
uk: Найкращий доступний режим підсвічування

source: Underlined text
uk: Підкреслений текст

source: So, to display a reverse-video status line on the top line of the screen, you could code::
uk: Отже, щоб відобразити рядок стану реверсивного відео у верхньому рядку екрана, ви можете закодувати:

source: The curses library also supports color on those terminals that provide it. The most common such terminal is probably the Linux console, followed by color xterms.
uk: Бібліотека curses також підтримує колір на тих терміналах, які його надають. Найпоширенішим таким терміналом, ймовірно, є консоль Linux, за якою слідують кольорові xterms.

source: To use color, you must call the :func:`~curses.start_color` function soon after calling :func:`~curses.initscr`, to initialize the default color set (the :func:`curses.wrapper` function does this automatically). Once that's done, the :func:`~curses.has_colors` function returns TRUE if the terminal in use can actually display color. (Note: curses uses the American spelling 'color', instead of the Canadian/British spelling 'colour'. If you're used to the British spelling, you'll have to resign yourself to misspelling it for the sake of these functions.)
uk: Щоб використовувати колір, ви повинні викликати функцію :func:`~curses.start_color` відразу після виклику :func:`~curses.initscr`, щоб ініціалізувати набір кольорів за замовчуванням (це робить функція :func:`curses.wrapper` автоматично). Після цього функція :func:`~curses.has_colors` повертає TRUE, якщо термінал, що використовується, справді може відображати колір. (Примітка: curses використовує американське написання "колір" замість канадсько-британського написання "колір". Якщо ви звикли до британського написання, вам доведеться змиритися з орфографічною помилкою заради цих функцій. )

source: The curses library maintains a finite number of color pairs, containing a foreground (or text) color and a background color. You can get the attribute value corresponding to a color pair with the :func:`~curses.color_pair` function; this can be bitwise-OR'ed with other attributes such as :const:`A_REVERSE`, but again, such combinations are not guaranteed to work on all terminals.
uk: Бібліотека curses підтримує кінцеву кількість пар кольорів, що містять колір переднього плану (або тексту) і колір фону. Ви можете отримати значення атрибута, що відповідає парі кольорів, за допомогою функції :func:`~curses.color_pair`; це можна об’єднати порозрядним АБО з іншими атрибутами, такими як :const:`A_REVERSE`, але знову ж таки, такі комбінації не гарантовано працюють на всіх терміналах.

source: An example, which displays a line of text using color pair 1::
uk: Приклад, який відображає рядок тексту за допомогою пари кольорів 1::

source: As I said before, a color pair consists of a foreground and background color. The ``init_pair(n, f, b)`` function changes the definition of color pair *n*, to foreground color f and background color b. Color pair 0 is hard-wired to white on black, and cannot be changed.
uk: Як я вже говорив раніше, пара кольорів складається з кольору переднього плану та кольору фону. Функція ``init_pair(n, f, b)`` змінює визначення пари кольорів *n* на колір переднього плану f і колір фону b. Пара кольорів 0 жорстко з’єднана з білим на чорному, і її неможливо змінити.

source: Colors are numbered, and :func:`start_color` initializes 8 basic colors when it activates color mode. They are: 0:black, 1:red, 2:green, 3:yellow, 4:blue, 5:magenta, 6:cyan, and 7:white. The :mod:`curses` module defines named constants for each of these colors: :const:`curses.COLOR_BLACK`, :const:`curses.COLOR_RED`, and so forth.
uk: Кольори пронумеровані, і :func:`start_color` ініціалізує 8 основних кольорів, коли він активує колірний режим. Це: 0:чорний, 1:червоний, 2:зелений, 3:жовтий, 4:синій, 5:пурпурний, 6:блакитний і 7:білий. Модуль :mod:`curses` визначає іменовані константи для кожного з цих кольорів: :const:`curses.COLOR_BLACK`, :const:`curses.COLOR_RED` і так далі.

source: Let's put all this together. To change color 1 to red text on a white background, you would call::
uk: Давайте все це разом. Щоб змінити колір 1 на червоний текст на білому фоні, ви повинні викликати:

source: When you change a color pair, any text already displayed using that color pair will change to the new colors. You can also display new text in this color with::
uk: Коли ви змінюєте пару кольорів, будь-який текст, який уже відображається за допомогою цієї пари кольорів, зміниться на нові кольори. Ви також можете відобразити новий текст у цьому кольорі за допомогою:

source: Very fancy terminals can change the definitions of the actual colors to a given RGB value. This lets you change color 1, which is usually red, to purple or blue or any other color you like. Unfortunately, the Linux console doesn't support this, so I'm unable to try it out, and can't provide any examples. You can check if your terminal can do this by calling :func:`~curses.can_change_color`, which returns ``True`` if the capability is there. If you're lucky enough to have such a talented terminal, consult your system's man pages for more information.
uk: Дуже модні термінали можуть змінювати визначення фактичних кольорів на задане значення RGB. Це дозволяє змінити колір 1, який зазвичай червоний, на фіолетовий, синій або будь-який інший колір, який вам подобається. На жаль, консоль Linux не підтримує це, тому я не можу випробувати це й не можу надати жодних прикладів. Ви можете перевірити, чи ваш термінал може зробити це, викликавши :func:`~curses.can_change_color`, який повертає ``True``, якщо така можливість є. Якщо вам пощастило мати такий талановитий термінал, зверніться до сторінок керівництва вашої системи для отримання додаткової інформації.

source: User Input
uk: Введення користувача

source: The C curses library offers only very simple input mechanisms. Python's :mod:`curses` module adds a basic text-input widget. (Other libraries such as `Urwid <https://pypi.org/project/urwid/>`_ have more extensive collections of widgets.)
uk: Бібліотека C curses пропонує лише дуже прості механізми введення. Модуль Python :mod:`curses` додає базовий віджет для введення тексту. (Інші бібліотеки, такі як `Urwid <https://pypi.org/project/urwid/>`_ мають більші колекції віджетів.)

source: There are two methods for getting input from a window:
uk: Існує два способи отримання даних із вікна:

source: :meth:`~curses.window.getch` refreshes the screen and then waits for the user to hit a key, displaying the key if :func:`~curses.echo` has been called earlier. You can optionally specify a coordinate to which the cursor should be moved before pausing.
uk: :meth:`~curses.window.getch` оновлює екран, а потім чекає, поки користувач натисне клавішу, відображаючи клавішу, якщо :func:`~curses.echo` було викликано раніше. Додатково можна вказати координату, до якої слід перемістити курсор перед паузою.

source: :meth:`~curses.window.getkey` does the same thing but converts the integer to a string. Individual characters are returned as 1-character strings, and special keys such as function keys return longer strings containing a key name such as ``KEY_UP`` or ``^G``.
uk: :meth:`~curses.window.getkey` робить те саме, але перетворює ціле число на рядок. Окремі символи повертаються як рядки з 1 символу, а спеціальні клавіші, такі як функціональні клавіші, повертають довші рядки, що містять ім’я ключа, наприклад ``KEY_UP`` або ``^G``.

source: It's possible to not wait for the user using the :meth:`~curses.window.nodelay` window method. After ``nodelay(True)``, :meth:`getch` and :meth:`getkey` for the window become non-blocking. To signal that no input is ready, :meth:`getch` returns ``curses.ERR`` (a value of -1) and :meth:`getkey` raises an exception. There's also a :func:`~curses.halfdelay` function, which can be used to (in effect) set a timer on each :meth:`getch`; if no input becomes available within a specified delay (measured in tenths of a second), curses raises an exception.
uk: Можна не чекати користувача за допомогою віконного методу :meth:`~curses.window.nodelay`. Після ``nodelay(True)`` :meth:`getch` і :meth:`getkey` для вікна стають неблокуючими. Щоб повідомити, що введення не готове, :meth:`getch` повертає ``curses.ERR`` (значення -1), а :meth:`getkey` викликає виняткову ситуацію. Існує також функція :func:`~curses.halfdelay`, яка може бути використана для (фактично) встановлення таймера для кожного :meth:`getch`; якщо введення не стає доступним протягом зазначеної затримки (вимірюється десятими частками секунди), curses викликає виняток.

source: The :meth:`getch` method returns an integer; if it's between 0 and 255, it represents the ASCII code of the key pressed. Values greater than 255 are special keys such as Page Up, Home, or the cursor keys. You can compare the value returned to constants such as :const:`curses.KEY_PPAGE`, :const:`curses.KEY_HOME`, or :const:`curses.KEY_LEFT`. The main loop of your program may look something like this::
uk: Метод :meth:`getch` повертає ціле число; якщо він між 0 і 255, він представляє код ASCII натиснутої клавіші. Значення більше 255 — це спеціальні клавіші, наприклад Page Up, Home або клавіші керування курсором. Ви можете порівняти значення, що повертаються до таких констант, як :const:`curses.KEY_PPAGE`, :const:`curses.KEY_HOME` або :const:`curses.KEY_LEFT`. Основний цикл вашої програми може виглядати приблизно так:

source: The :mod:`curses.ascii` module supplies ASCII class membership functions that take either integer or 1-character string arguments; these may be useful in writing more readable tests for such loops. It also supplies conversion functions that take either integer or 1-character-string arguments and return the same type. For example, :func:`curses.ascii.ctrl` returns the control character corresponding to its argument.
uk: Модуль :mod:`curses.ascii` надає функції приналежності до класу ASCII, які приймають цілі або односимвольні рядкові аргументи; вони можуть бути корисними для написання більш читабельних тестів для таких циклів. Він також надає функції перетворення, які приймають цілі або односимвольні аргументи та повертають той самий тип. Наприклад, :func:`curses.ascii.ctrl` повертає керуючий символ, що відповідає його аргументу.

source: There's also a method to retrieve an entire string, :meth:`~curses.window.getstr`. It isn't used very often, because its functionality is quite limited; the only editing keys available are the backspace key and the Enter key, which terminates the string. It can optionally be limited to a fixed number of characters. ::
uk: Існує також метод для отримання цілого рядка, :meth:`~curses.window.getstr`. Використовується не дуже часто, оскільки його функціональність досить обмежена; єдиними доступними клавішами редагування є клавіша повернення та клавіша Enter, яка завершує рядок. За бажанням його можна обмежити фіксованою кількістю символів. ::

source: The :mod:`curses.textpad` module supplies a text box that supports an Emacs-like set of keybindings. Various methods of the :class:`~curses.textpad.Textbox` class support editing with input validation and gathering the edit results either with or without trailing spaces. Here's an example::
uk: Модуль :mod:`curses.textpad` надає текстове поле, яке підтримує Emacs-подібний набір сполучень клавіш. Різні методи класу :class:`~curses.textpad.Textbox` підтримують редагування з перевіркою введених даних і збиранням результатів редагування з пробілами в кінці або без них. Ось приклад::

source: See the library documentation on :mod:`curses.textpad` for more details.
uk: Перегляньте документацію бібліотеки на :mod:`curses.textpad` для отримання додаткової інформації.

source: For More Information
uk: Для отримання додаткової інформації

source: This HOWTO doesn't cover some advanced topics, such as reading the contents of the screen or capturing mouse events from an xterm instance, but the Python library page for the :mod:`curses` module is now reasonably complete. You should browse it next.
uk: Цей HOWTO не охоплює деякі складні теми, такі як читання вмісту екрана чи захоплення подій миші з екземпляра xterm, але сторінка бібліотеки Python для модуля :mod:`curses` тепер досить повна. Ви повинні переглянути його далі.

source: If you're in doubt about the detailed behavior of the curses functions, consult the manual pages for your curses implementation, whether it's ncurses or a proprietary Unix vendor's. The manual pages will document any quirks, and provide complete lists of all the functions, attributes, and :const:`ACS_\*` characters available to you.
uk: Якщо ви сумніваєтеся щодо детальної поведінки функцій curses, зверніться до сторінок посібника для вашої реалізації curses, незалежно від того, чи це ncurses, чи власність постачальника Unix. Сторінки посібника задокументують будь-які особливості та нададуть повний список усіх доступних вам функцій, атрибутів і символів :const:`ACS_\*`.

source: Because the curses API is so large, some functions aren't supported in the Python interface. Often this isn't because they're difficult to implement, but because no one has needed them yet. Also, Python doesn't yet support the menu library associated with ncurses. Patches adding support for these would be welcome; see `the Python Developer's Guide <https://devguide.python.org/>`_ to learn more about submitting patches to Python.
uk: Оскільки API curses дуже великий, деякі функції не підтримуються в інтерфейсі Python. Часто це відбувається не тому, що їх важко реалізувати, а тому, що вони ще нікому не потрібні. Крім того, Python ще не підтримує бібліотеку меню, пов’язану з ncurses. Латки, що додають підтримку для них, будуть вітатися; див. `Посібник розробника Python <https://devguide.python.org/>`_, щоб дізнатися більше про надсилання виправлень у Python.

source: `Writing Programs with NCURSES <http://invisible-island.net/ncurses/ncurses-intro.html>`_: a lengthy tutorial for C programmers.
uk: `Написання програм за допомогою NCURSES <http://invisible-island.net/ncurses/ncurses-intro.html>`_: довгий посібник для програмістів на C.

source: `The ncurses man page <https://linux.die.net/man/3/ncurses>`_
uk: `Довідкова сторінка ncurses <https://linux.die.net/man/3/ncurses>`_

source: `The ncurses FAQ <http://invisible-island.net/ncurses/ncurses.faq.html>`_
uk: `Поширені запитання про ncurses <http://invisible-island.net/ncurses/ncurses.faq.html>`_

source: `"Use curses... don't swear" <https://www.youtube.com/watch?v=eN1eZtjLEnU>`_: video of a PyCon 2013 talk on controlling terminals using curses or Urwid.
uk: `"Використовуйте прокляття... не лайтеся" <https://www.youtube.com/watch?v=eN1eZtjLEnU>`_: відео розмови на PyCon 2013 про керування терміналами за допомогою проклять або Urwid.

source: `"Console Applications with Urwid" <http://www.pyvideo.org/video/1568/console-applications-with-urwid>`_: video of a PyCon CA 2012 talk demonstrating some applications written using Urwid.
uk: `"Консольні програми з Urwid" <http://www.pyvideo.org/video/1568/console-applications-with-urwid>`_: відео доповіді PyCon CA 2012, що демонструє деякі програми, написані за допомогою Urwid.
