Repository: python/python-docs-uk
Catalog: howto/curses.po
Languages: uk

source: Curses Programming with Python
uk: Програмування Curses на Python

source: Author
uk: Автор

source: Release
uk: Реліз

source: Abstract
uk: Анотація

source: This document describes how to use the :mod:`curses` extension module to control text-mode displays.
uk: У цьому документі описано, як використовувати модуль розширення :mod:`curses` для керування відображеннями в текстовому режимі.

source: What is curses?
uk: Що таке прокляття?

source: The curses library supplies a terminal-independent screen-painting and keyboard-handling facility for text-based terminals; such terminals include VT100s, the Linux console, and the simulated terminal provided by various programs. Display terminals support various control codes to perform common operations such as moving the cursor, scrolling the screen, and erasing areas. Different terminals use widely differing codes, and often have their own minor quirks.
uk: Бібліотека curses надає незалежне від терміналу засіб малювання екрану та керування клавіатурою для текстових терміналів; такі термінали включають VT100s, консоль Linux і імітований термінал, що надається різними програмами. Дисплейні термінали підтримують різні керуючі коди для виконання типових операцій, таких як переміщення курсору, прокручування екрана та стирання областей. Різні термінали використовують дуже різні коди та часто мають власні незначні особливості.

source: In a world of graphical displays, one might ask "why bother"? It's true that character-cell display terminals are an obsolete technology, but there are niches in which being able to do fancy things with them are still valuable. One niche is on small-footprint or embedded Unixes that don't run an X server. Another is tools such as OS installers and kernel configurators that may have to run before any graphical support is available.
uk: У світі графічних дисплеїв хтось може запитати "навіщо турбуватися"? Це правда, що дисплеї з символьними комірками є застарілою технологією, але є ніші, в яких можливість робити з ними фантастичні речі все ще цінна. Одна ніша займає малогабаритні або вбудовані системи Unix, на яких не працює X-сервер. Інші інструменти, такі як інсталятори ОС і конфігуратори ядра, які, можливо, доведеться запустити, перш ніж буде доступна будь-яка графічна підтримка.

source: The curses library provides fairly basic functionality, providing the programmer with an abstraction of a display containing multiple non-overlapping windows of text. The contents of a window can be changed in various ways---adding text, erasing it, changing its appearance---and the curses library will figure out what control codes need to be sent to the terminal to produce the right output. curses doesn't provide many user-interface concepts such as buttons, checkboxes, or dialogs; if you need such features, consider a user interface library such as `Urwid <https://pypi.org/project/urwid/>`_.
uk: Бібліотека curses надає досить базову функціональність, надаючи програмісту абстракцію відображення, що містить кілька вікон тексту, які не перекриваються. Вміст вікна можна змінювати різними способами --- додавати текст, стирати його, змінювати його вигляд --- і бібліотека curses визначить, які керуючі коди потрібно надіслати на термінал, щоб отримати правильний результат. curses не надає багато концепцій інтерфейсу користувача, таких як кнопки, прапорці або діалогові вікна; якщо вам потрібні такі функції, розгляньте бібліотеку інтерфейсу користувача, таку як `Urwid <https://pypi.org/project/urwid/>`_.

source: The curses library was originally written for BSD Unix; the later System V versions of Unix from AT&T added many enhancements and new functions. BSD curses is no longer maintained, having been replaced by ncurses, which is an open-source implementation of the AT&T interface. If you're using an open-source Unix such as Linux or FreeBSD, your system almost certainly uses ncurses. Since most current commercial Unix versions are based on System V code, all the functions described here will probably be available. The older versions of curses carried by some proprietary Unixes may not support everything, though.
uk: Бібліотека curses спочатку була написана для BSD Unix; пізніші версії System V Unix від AT&T додали багато вдосконалень і нових функцій. BSD curses більше не підтримується, їх замінив ncurses, який є реалізацією інтерфейсу AT&T з відкритим кодом. Якщо ви використовуєте Unix з відкритим кодом, наприклад Linux або FreeBSD, ваша система майже напевно використовує ncurses. Оскільки більшість сучасних комерційних версій Unix базується на коді System V, усі описані тут функції, ймовірно, будуть доступні. Однак старіші версії curses, які містяться в деяких пропрієтарних системах Unix, можуть не підтримувати все.

source: The Windows version of Python doesn't include the :mod:`curses` module. A ported version called `UniCurses <https://pypi.org/project/UniCurses>`_ is available.
uk: Версія Python для Windows не включає модуль :mod:`curses`. Доступна перенесена версія під назвою `UniCurses <https://pypi.org/project/UniCurses>`_.

source: The Python curses module
uk: Модуль проклинань Python

source: The Python module is a fairly simple wrapper over the C functions provided by curses; if you're already familiar with curses programming in C, it's really easy to transfer that knowledge to Python. The biggest difference is that the Python interface makes things simpler by merging different C functions such as :c:func:`addstr`, :c:func:`mvaddstr`, and :c:func:`mvwaddstr` into a single :meth:`~curses.window.addstr` method. You'll see this covered in more detail later.
uk: Модуль Python є досить простою обгорткою для функцій C, що надаються curses; якщо ви вже знайомі з програмуванням curses на C, вам дуже легко перенести ці знання на Python. Найбільша відмінність полягає в тому, що інтерфейс Python спрощує речі, об’єднуючи різні функції C, такі як :c:func:`addstr`, :c:func:`mvaddstr` і :c:func:`mvwaddstr` в єдиний :meth:`~curses.window.addstr` метод. Ви побачите це більш детально пізніше.

source: This HOWTO is an introduction to writing text-mode programs with curses and Python. It doesn't attempt to be a complete guide to the curses API; for that, see the Python library guide's section on ncurses, and the C manual pages for ncurses. It will, however, give you the basic ideas.
uk: Цей HOWTO є вступом до написання програм у текстовому режимі за допомогою curses і Python. Він не намагається бути повним посібником з curses API; для цього дивіться розділ посібника з бібліотеки Python про ncurses і сторінки посібника C для ncurses. Однак це дасть вам основні ідеї.

source: Starting and ending a curses application
uk: Запуск і завершення програми curses

source: Before doing anything, curses must be initialized. This is done by calling the :func:`~curses.initscr` function, which will determine the terminal type, send any required setup codes to the terminal, and create various internal data structures. If successful, :func:`initscr` returns a window object representing the entire screen; this is usually called ``stdscr`` after the name of the corresponding C variable. ::
uk: Перш ніж щось робити, curses потрібно ініціалізувати. Це робиться шляхом виклику функції :func:`~curses.initscr`, яка визначить тип терміналу, надішле будь-які необхідні коди налаштування на термінал і створить різні внутрішні структури даних. У разі успіху :func:`initscr` повертає віконний об’єкт, що представляє весь екран; це зазвичай називається ``stdscr`` за назвою відповідної змінної C. ::

source: Usually curses applications turn off automatic echoing of keys to the screen, in order to be able to read keys and only display them under certain circumstances. This requires calling the :func:`~curses.noecho` function. ::
uk: Зазвичай програми curses вимикають автоматичне відлуння клавіш на екрані, щоб мати можливість читати клавіші та відображати їх лише за певних обставин. Для цього потрібно викликати функцію :func:`~curses.noecho`. ::

source: Applications will also commonly need to react to keys instantly, without requiring the Enter key to be pressed; this is called cbreak mode, as opposed to the usual buffered input mode. ::
uk: Додаткам також зазвичай потрібно миттєво реагувати на натискання клавіш, не вимагаючи натискання клавіші Enter; це називається режимом cbreak, на відміну від звичайного режиму буферизованого введення. ::

source: Terminals usually return special keys, such as the cursor keys or navigation keys such as Page Up and Home, as a multibyte escape sequence. While you could write your application to expect such sequences and process them accordingly, curses can do it for you, returning a special value such as :const:`curses.KEY_LEFT`. To get curses to do the job, you'll have to enable keypad mode. ::
uk: Термінали зазвичай повертають спеціальні клавіші, такі як клавіші керування курсором або навігаційні клавіші, такі як Page Up і Home, як багатобайтову escape-послідовність. Хоча ви можете написати свою програму так, щоб очікувати такі послідовності та обробляти їх відповідно, curses може зробити це за вас, повертаючи спеціальне значення, наприклад :const:`curses.KEY_LEFT`. Щоб змусити прокляття виконувати роботу, вам потрібно буде ввімкнути режим клавіатури. ::

source: Terminating a curses application is much easier than starting one. You'll need to call::
uk: Завершити роботу програми curses набагато легше, ніж розпочати її. Вам потрібно зателефонувати::

source: to reverse the curses-friendly terminal settings. Then call the :func:`~curses.endwin` function to restore the terminal to its original operating mode. ::
uk: щоб змінити налаштування терміналу, зручні для curses. Потім викличте функцію :func:`~curses.endwin`, щоб відновити термінал до вихідного режиму роботи. ::

source: A common problem when debugging a curses application is to get your terminal messed up when the application dies without restoring the terminal to its previous state. In Python this commonly happens when your code is buggy and raises an uncaught exception. Keys are no longer echoed to the screen when you type them, for example, which makes using the shell difficult.
uk: Поширеною проблемою під час налагодження програми curses є псування терміналу, коли програма вимикається без відновлення попереднього стану терміналу. У Python це зазвичай трапляється, коли ваш код має помилки та викликає неперехоплений виняток. Наприклад, клавіші більше не відтворюються на екрані, коли ви їх вводите, що ускладнює використання оболонки.

source: In Python you can avoid these complications and make debugging much easier by importing the :func:`curses.wrapper` function and using it like this::
uk: У Python ви можете уникнути цих ускладнень і значно полегшити налагодження, імпортувавши функцію :func:`curses.wrapper` і використовуючи її таким чином::

source: The :func:`~curses.wrapper` function takes a callable object and does the initializations described above, also initializing colors if color support is present. :func:`wrapper` then runs your provided callable. Once the callable returns, :func:`wrapper` will restore the original state of the terminal. The callable is called inside a :keyword:`try`...\ :keyword:`except` that catches exceptions, restores the state of the terminal, and then re-raises the exception. Therefore your terminal won't be left in a funny state on exception and you'll be able to read the exception's message and traceback.
uk: Функція :func:`~curses.wrapper` приймає об’єкт, який можна викликати, і виконує ініціалізацію, описану вище, а також ініціалізацію кольорів, якщо присутня підтримка кольорів. :func:`wrapper` потім запускає наданий вами виклик. Після того, як виклик повернеться, :func:`wrapper` відновить вихідний стан терміналу. Викликається всередині :keyword:`try`...\ :keyword:`except`, який перехоплює винятки, відновлює стан терміналу, а потім повторно викликає виняток. Таким чином, ваш термінал не залишиться у дивному стані під час виключення, і ви зможете прочитати повідомлення про виняток і відстежити його.

source: Windows and Pads
uk: Вікна та колодки

source: Windows are the basic abstraction in curses. A window object represents a rectangular area of the screen, and supports methods to display text, erase it, allow the user to input strings, and so forth.
uk: Вікна є основною абстракцією в curses. Об’єкт вікна представляє прямокутну область екрана та підтримує методи відображення тексту, його стирання, дозволу користувачеві вводити рядки тощо.

source: The ``stdscr`` object returned by the :func:`~curses.initscr` function is a window object that covers the entire screen. Many programs may need only this single window, but you might wish to divide the screen into smaller windows, in order to redraw or clear them separately. The :func:`~curses.newwin` function creates a new window of a given size, returning the new window object. ::
uk: Об’єкт ``stdscr``, що повертається функцією :func:`~curses.initscr`, є об’єктом вікна, що покриває весь екран. Багатьом програмам може знадобитися лише це одне вікно, але ви можете розділити екран на менші вікна, щоб перемалювати або очистити їх окремо. Функція :func:`~curses.newwin` створює нове вікно заданого розміру, повертаючи новий об’єкт вікна. ::

source: Note that the coordinate system used in curses is unusual. Coordinates are always passed in the order *y,x*, and the top-left corner of a window is coordinate (0,0). This breaks the normal convention for handling coordinates where the *x* coordinate comes first. This is an unfortunate difference from most other computer applications, but it's been part of curses since it was first written, and it's too late to change things now.
uk: Зверніть увагу, що система координат, яка використовується в curses, є незвичною. Координати завжди передаються в порядку *y,x*, а верхній лівий кут вікна є координатою (0,0). Це порушує звичайну угоду щодо обробки координат, де координата *x* стоїть першою. Це прикра відмінність від більшості інших комп’ютерних програм, але вона була частиною прокляття відтоді, як була написана, і зараз надто пізно щось змінювати.

source: Your application can determine the size of the screen by using the :data:`curses.LINES` and :data:`curses.COLS` variables to obtain the *y* and *x* sizes. Legal coordinates will then extend from ``(0,0)`` to ``(curses.LINES - 1, curses.COLS - 1)``.
uk: Ваша програма може визначити розмір екрана за допомогою змінних :data:`curses.LINES` і :data:`curses.COLS` для отримання розмірів *y* і *x*. Тоді юридичні координати розширюватимуться від ``(0,0)`` до ``(curses.LINES - 1, curses.COLS - 1)``.

source: When you call a method to display or erase text, the effect doesn't immediately show up on the display. Instead you must call the :meth:`~curses.window.refresh` method of window objects to update the screen.
uk: Коли ви викликаєте метод для відображення або стирання тексту, ефект не відразу відображається на дисплеї. Натомість ви повинні викликати метод :meth:`~curses.window.refresh` об’єктів вікна, щоб оновити екран.

source: This is because curses was originally written with slow 300-baud terminal connections in mind; with these terminals, minimizing the time required to redraw the screen was very important. Instead curses accumulates changes to the screen and displays them in the most efficient manner when you call :meth:`refresh`. For example, if your program displays some text in a window and then clears the window, there's no need to send the original text because they're never visible.
uk: Це тому, що curses спочатку було написано з урахуванням повільних термінальних з’єднань на 300 бод; з цими терміналами мінімізація часу, необхідного для перемальовування екрана, була дуже важливою. Натомість curses накопичує зміни на екрані та відображає їх у найефективніший спосіб, коли ви викликаєте :meth:`refresh`. Наприклад, якщо ваша програма відображає деякий текст у вікні, а потім очищає вікно, немає потреби надсилати вихідний текст, оскільки він ніколи не буде видимим.

source: In practice, explicitly telling curses to redraw a window doesn't really complicate programming with curses much. Most programs go into a flurry of activity, and then pause waiting for a keypress or some other action on the part of the user. All you have to do is to be sure that the screen has been redrawn before pausing to wait for user input, by first calling ``stdscr.refresh()`` or the :meth:`refresh` method of some other relevant window.
uk: На практиці явне вказівку curses перемалювати вікно не дуже ускладнює програмування з curses. Більшість програм починає активно працювати, а потім призупиняється, чекаючи натискання клавіші або іншої дії з боку користувача. Все, що вам потрібно зробити, це переконатися, що екран було перемальовано перед тим, як призупинити очікування введення користувача, спершу викликавши ``stdscr.refresh()`` або метод :meth:`refresh` іншого відповідного вікна.

source: A pad is a special case of a window; it can be larger than the actual display screen, and only a portion of the pad displayed at a time. Creating a pad requires the pad's height and width, while refreshing a pad requires giving the coordinates of the on-screen area where a subsection of the pad will be displayed. ::
uk: Колодка — окремий випадок вікна; він може бути більшим, ніж фактичний екран дисплея, і одночасно відображатися лише частина панелі. Щоб створити блокнот, потрібно вказати його висоту та ширину, тоді як для оновлення блокнота потрібно вказати координати області на екрані, де відображатиметься його підрозділ. ::

source: The :meth:`refresh` call displays a section of the pad in the rectangle extending from coordinate (5,5) to coordinate (20,75) on the screen; the upper left corner of the displayed section is coordinate (0,0) on the pad. Beyond that difference, pads are exactly like ordinary windows and support the same methods.
uk: Виклик :meth:`refresh` відображає на екрані частину панелі в прямокутнику від координати (5,5) до координати (20,75); верхній лівий кут відображуваного розділу є координатою (0,0) на панелі. Окрім цієї різниці, колодки схожі на звичайні вікна та підтримують ті самі методи.

source: If you have multiple windows and pads on screen there is a more efficient way to update the screen and prevent annoying screen flicker as each part of the screen gets updated. :meth:`refresh` actually does two things:
uk: Якщо на екрані є кілька вікон і панелей, є ефективніший спосіб оновити екран і запобігти дратівливому мерехтінню екрана під час оновлення кожної частини екрана. :meth:`refresh` насправді робить дві речі:

source: Calls the :meth:`~curses.window.noutrefresh` method of each window to update an underlying data structure representing the desired state of the screen.
uk: Викликає метод :meth:`~curses.window.noutrefresh` кожного вікна, щоб оновити базову структуру даних, що представляє потрібний стан екрана.

source: Calls the function :func:`~curses.doupdate` function to change the physical screen to match the desired state recorded in the data structure.
uk: Викликає функцію :func:`~curses.doupdate`, щоб змінити фізичний екран відповідно до потрібного стану, записаного в структурі даних.

source: Instead you can call :meth:`noutrefresh` on a number of windows to update the data structure, and then call :func:`doupdate` to update the screen.
uk: Натомість ви можете викликати :meth:`noutrefresh` у кількох вікнах, щоб оновити структуру даних, а потім викликати :func:`doupdate`, щоб оновити екран.

source: Displaying Text
uk: Відображення тексту

source: From a C programmer's point of view, curses may sometimes look like a twisty maze of functions, all subtly different. For example, :c:func:`addstr` displays a string at the current cursor location in the ``stdscr`` window, while :c:func:`mvaddstr` moves to a given y,x coordinate first before displaying the string. :c:func:`waddstr` is just like :c:func:`addstr`, but allows specifying a window to use instead of using ``stdscr`` by default. :c:func:`mvwaddstr` allows specifying both a window and a coordinate.
uk: З точки зору програміста на C, curses іноді можуть виглядати як заплутаний лабіринт функцій, усі дещо різні. Наприклад, :c:func:`addstr` відображає рядок у поточному місці розташування курсору у вікні ``stdscr``, тоді як :c:func:`mvaddstr` спочатку переміщується до заданої координати y,x перед відображенням рядка . :c:func:`waddstr` схожий на :c:func:`addstr`, але дозволяє вказати вікно для використання замість використання ``stdscr`` за замовчуванням. :c:func:`mvwaddstr` дозволяє вказати як вікно, так і координату.

source: Fortunately the Python interface hides all these details. ``stdscr`` is a window object like any other, and methods such as :meth:`~curses.window.addstr` accept multiple argument forms. Usually there are four different forms.
uk: На щастя, інтерфейс Python приховує всі ці деталі. ``stdscr`` є віконним об’єктом, як і будь-який інший, і такі методи, як :meth:`~curses.window.addstr` приймають кілька форм аргументів. Зазвичай є чотири різні форми.

source: Form
uk: Форма

source: Description
uk: опис

source: *str* or *ch*
uk: *str* або *ch*

source: Display the string *str* or character *ch* at the current position
uk: Відобразити рядок *str* або символ *ch* у поточній позиції

source: *str* or *ch*, *attr*
uk: *str* або *ch*, *attr*

source: Display the string *str* or character *ch*, using attribute *attr* at the current position
uk: Відобразити рядок *str* або символ *ch*, використовуючи атрибут *attr* у поточній позиції

source: *y*, *x*, *str* or *ch*
uk: *y*, *x*, *str* або *ch*

source: Move to position *y,x* within the window, and display *str* or *ch*
uk: Перейдіть до позиції *y,x* у вікні та відобразіть *str* або *ch*

source: *y*, *x*, *str* or *ch*, *attr*
uk: *y*, *x*, *str* або *ch*, *attr*

source: Move to position *y,x* within the window, and display *str* or *ch*, using attribute *attr*
uk: Перейдіть до позиції *y,x* у вікні та відобразіть *str* або *ch*, використовуючи атрибут *attr*

source: Attributes allow displaying text in highlighted forms such as boldface, underline, reverse code, or in color. They'll be explained in more detail in the next subsection.
uk: Атрибути дозволяють відображати текст у виділених формах, наприклад жирним шрифтом, підкресленням, зворотним кодом або кольором. Вони будуть пояснені більш детально в наступному підрозділі.

source: The :meth:`~curses.window.addch` methods take a character, which can be either a string of length 1, a bytestring of length 1, or an integer.
uk: Методи :meth:`~curses.window.addch` приймають символ, який може бути рядком довжини 1, байтовим рядком довжини 1 або цілим числом.

source: Constants are provided for extension characters; these constants are integers greater than 255. For example, :const:`ACS_PLMINUS` is a +/- symbol, and :const:`ACS_ULCORNER` is the upper left corner of a box (handy for drawing borders). You can also use the appropriate Unicode character.
uk: Константи надаються для символів розширення; ці константи є цілими числами, більшими за 255. Наприклад, :const:`ACS_PLMINUS` — це символ +/-, а :const:`ACS_ULCORNER` — верхній лівий кут прямокутника (зручно для малювання меж). Ви також можете використовувати відповідний символ Unicode.
