Repository: python/python-docs-uk
Catalog: howto/descriptor.po
Languages: uk

source: :meth:`object.__getattribute__` and :meth:`type.__getattribute__` make different calls to :meth:`__get__`. The first includes the instance and may include the class. The second puts in ``None`` for the instance and always includes the class.
uk: :meth:`object.__getattribute__` і :meth:`type.__getattribute__` здійснюють різні виклики :meth:`__get__`. Перший включає екземпляр і може включати клас. Другий ставить ``None`` для екземпляра та завжди включає клас.

source: Data descriptors always override instance dictionaries.
uk: Дескриптори даних завжди перевизначають словники примірників.

source: Non-data descriptors may be overridden by instance dictionaries.
uk: Дескриптори, не пов’язані з даними, можуть бути перевизначені словниками примірників.

source: Automatic name notification
uk: Автоматичне сповіщення про ім'я

source: Sometimes it is desirable for a descriptor to know what class variable name it was assigned to. When a new class is created, the :class:`type` metaclass scans the dictionary of the new class. If any of the entries are descriptors and if they define :meth:`__set_name__`, that method is called with two arguments. The *owner* is the class where the descriptor is used, and the *name* is the class variable the descriptor was assigned to.
uk: Іноді дескриптору бажано знати, яке ім'я змінної класу було призначено. Коли створюється новий клас, метаклас :class:`type` сканує словник нового класу. Якщо будь-який із записів є дескрипторами та якщо вони визначають :meth:`__set_name__`, цей метод викликається з двома аргументами. *Власник* — це клас, де використовується дескриптор, а *ім’я* — це змінна класу, якій призначено дескриптор.

source: Since the update logic is in :meth:`type.__new__`, notifications only take place at the time of class creation. If descriptors are added to the class afterwards, :meth:`__set_name__` will need to be called manually.
uk: Оскільки логіка оновлення знаходиться в :meth:`type.__new__`, сповіщення надходять лише під час створення класу. Якщо дескриптори додаються до класу пізніше, :meth:`__set_name__` потрібно буде викликати вручну.

source: ORM example
uk: Приклад ORM

source: The essential idea is that the data is stored in an external database. The Python instances only hold keys to the database's tables. Descriptors take care of lookups or updates:
uk: Основна ідея полягає в тому, що дані зберігаються у зовнішній базі даних. Екземпляри Python містять лише ключі до таблиць бази даних. Дескриптори піклуються про пошук або оновлення:

source: We can use the :class:`Field` class to define `models <https://en.wikipedia.org/wiki/Database_model>`_ that describe the schema for each table in a database:
uk: Ми можемо використовувати клас :class:`Field`, щоб визначити `моделі <https://en.wikipedia.org/wiki/Database_model>`_, які описують схему для кожної таблиці в базі даних:

source: To use the models, first connect to the database::
uk: Щоб використовувати моделі, спочатку підключіться до бази даних:

source: An interactive session shows how data is retrieved from the database and how it can be updated:
uk: Інтерактивний сеанс показує, як дані витягуються з бази даних і як їх можна оновити:

source: Pure Python Equivalents
uk: Чисті еквіваленти Python

source: The descriptor protocol is simple and offers exciting possibilities. Several use cases are so common that they have been prepackaged into built-in tools. Properties, bound methods, static methods, class methods, and \_\_slots\_\_ are all based on the descriptor protocol.
uk: Протокол дескриптора простий і пропонує захоплюючі можливості. Кілька варіантів використання настільки поширені, що вони були попередньо упаковані у вбудовані інструменти. Властивості, прив’язані методи, статичні методи, методи класу та \_\_слоти\_\_ базуються на протоколі дескриптора.

source: Properties
uk: Властивості

source: Calling :func:`property` is a succinct way of building a data descriptor that triggers a function call upon access to an attribute. Its signature is::
uk: Виклик :func:`property` — це короткий спосіб створення дескриптора даних, який ініціює виклик функції після доступу до атрибута. Його підпис::

source: The documentation shows a typical use to define a managed attribute ``x``:
uk: У документації показано типове використання для визначення керованого атрибута ``x``:

source: The :func:`property` builtin helps whenever a user interface has granted attribute access and then subsequent changes require the intervention of a method.
uk: Вбудована функція :func:`property` допомагає щоразу, коли інтерфейс користувача надає доступ до атрибутів, а подальші зміни вимагають втручання методу.

source: For instance, a spreadsheet class may grant access to a cell value through ``Cell('b10').value``. Subsequent improvements to the program require the cell to be recalculated on every access; however, the programmer does not want to affect existing client code accessing the attribute directly. The solution is to wrap access to the value attribute in a property data descriptor:
uk: Наприклад, клас електронної таблиці може надати доступ до значення клітинки через ``Cell('b10').value``. Подальші вдосконалення програми вимагають перерахунку комірки при кожному доступі; однак програміст не хоче впливати на існуючий клієнтський код, який безпосередньо звертається до атрибута. Рішення полягає в тому, щоб загорнути доступ до атрибута значення в дескриптор даних властивості:

source: Either the built-in :func:`property` or our :func:`Property` equivalent would work in this example.
uk: У цьому прикладі працюватиме або вбудований :func:`property`, або наш еквівалент :func:`Property`.

source: Functions and methods
uk: Функції та методи

source: Python's object oriented features are built upon a function based environment. Using non-data descriptors, the two are merged seamlessly.
uk: Об’єктно-орієнтовані функції Python побудовані на функціональному середовищі. Використовуючи дескриптори, не пов’язані з даними, ці два об’єднуються без проблем.

source: Functions stored in class dictionaries get turned into methods when invoked. Methods only differ from regular functions in that the object instance is prepended to the other arguments. By convention, the instance is called *self* but could be called *this* or any other variable name.
uk: Функції, що зберігаються в словниках класів, під час виклику перетворюються на методи. Методи відрізняються від звичайних функцій лише тим, що екземпляр об’єкта додається до інших аргументів. За домовленістю екземпляр називається *self*, але може мати назву *this* або будь-яке інше ім’я змінної.

source: Methods can be created manually with :class:`types.MethodType` which is roughly equivalent to:
uk: Методи можна створити вручну за допомогою :class:`types.MethodType`, що приблизно еквівалентно:

source: To support automatic creation of methods, functions include the :meth:`__get__` method for binding methods during attribute access. This means that functions are non-data descriptors that return bound methods during dotted lookup from an instance. Here's how it works:
uk: Щоб підтримувати автоматичне створення методів, функції включають метод :meth:`__get__` для зв’язування методів під час доступу до атрибутів. Це означає, що функції є дескрипторами, не пов’язаними з даними, які повертають пов’язані методи під час пошуку з пунктиром з екземпляра. Ось як це працює:

source: Running the following class in the interpreter shows how the function descriptor works in practice:
uk: Запуск наступного класу в інтерпретаторі показує, як дескриптор функції працює на практиці:

source: The function has a :term:`qualified name` attribute to support introspection:
uk: Функція має атрибут :term:`qualified name` для підтримки самоаналізу:

source: Accessing the function through the class dictionary does not invoke :meth:`__get__`. Instead, it just returns the underlying function object::
uk: Доступ до функції через словник класу не викликає :meth:`__get__`. Замість цього він просто повертає базовий об’єкт функції::

source: Dotted access from a class calls :meth:`__get__` which just returns the underlying function unchanged::
uk: Пунктирний доступ із класу викликає :meth:`__get__`, який просто повертає базову функцію без змін::

source: The interesting behavior occurs during dotted access from an instance. The dotted lookup calls :meth:`__get__` which returns a bound method object::
uk: Цікава поведінка відбувається під час доступу з екземпляра з пунктиром. Пошук із пунктиром викликає :meth:`__get__`, який повертає пов’язаний об’єкт методу::

source: Internally, the bound method stores the underlying function and the bound instance::
uk: Внутрішньо зв’язаний метод зберігає базову функцію та зв’язаний екземпляр::

source: If you have ever wondered where *self* comes from in regular methods or where *cls* comes from in class methods, this is it!
uk: Якщо ви коли-небудь задавалися питанням, звідки береться *self* у звичайних методах або звідки *cls* у методах класу, то це все!

source: Kinds of methods
uk: Види методів

source: Non-data descriptors provide a simple mechanism for variations on the usual patterns of binding functions into methods.
uk: Дескриптори, не пов’язані з даними, надають простий механізм для варіацій звичайних шаблонів зв’язування функцій у методи.

source: To recap, functions have a :meth:`__get__` method so that they can be converted to a method when accessed as attributes. The non-data descriptor transforms an ``obj.f(*args)`` call into ``f(obj, *args)``. Calling ``cls.f(*args)`` becomes ``f(*args)``.
uk: Підсумовуючи, функції мають метод :meth:`__get__`, щоб їх можна було перетворити на метод, коли вони доступні як атрибути. Дескриптор без даних перетворює виклик ``obj.f(*args)`` на ``f(obj, *args)``. Виклик ``cls.f(*args)`` перетворюється на ``f(*args)``.

source: This chart summarizes the binding and its two most useful variants:
uk: Ця діаграма підсумовує прив’язку та два її найкорисніші варіанти:

source: Transformation
uk: Трансформація

source: Called from an object
uk: Викликано з об'єкта

source: Called from a class
uk: Подзвонили з класу

source: function
uk: функція

source: staticmethod
uk: статичний метод

source: classmethod
uk: метод класу

source: Static methods
uk: Статичні методи

source: Static methods return the underlying function without changes. Calling either ``c.f`` or ``C.f`` is the equivalent of a direct lookup into ``object.__getattribute__(c, "f")`` or ``object.__getattribute__(C, "f")``. As a result, the function becomes identically accessible from either an object or a class.
uk: Статичні методи повертають базову функцію без змін. Виклик ``c.f`` або ``C.f`` є еквівалентом прямого пошуку ``object.__getattribute__(c, "f")`` або ``object.__getattribute__(C, "f")`` . У результаті функція стає однаково доступною з об’єкта або класу.

source: Good candidates for static methods are methods that do not reference the ``self`` variable.
uk: Хорошими кандидатами на статичні методи є методи, які не посилаються на змінну ``self``.

source: Since static methods return the underlying function with no changes, the example calls are unexciting:
uk: Оскільки статичні методи повертають базову функцію без змін, приклади викликів нецікаві:

source: Using the non-data descriptor protocol, a pure Python version of :func:`staticmethod` would look like this:
uk: Використовуючи протокол дескриптора без даних, чиста версія :func:`staticmethod` на Python виглядала б так:

source: Class methods
uk: Методи класу

source: Unlike static methods, class methods prepend the class reference to the argument list before calling the function. This format is the same for whether the caller is an object or a class:
uk: На відміну від статичних методів, методи класу додають посилання на клас до списку аргументів перед викликом функції. Цей формат є однаковим для того, чи є викликаючий об’єкт чи клас:

source: This behavior is useful whenever the method only needs to have a class reference and does not rely on data stored in a specific instance. One use for class methods is to create alternate class constructors. For example, the classmethod :func:`dict.fromkeys` creates a new dictionary from a list of keys. The pure Python equivalent is:
uk: Така поведінка корисна, коли метод потребує лише посилання на клас і не покладається на дані, що зберігаються в конкретному екземплярі. Одним із способів використання методів класу є створення альтернативних конструкторів класу. Наприклад, метод класу :func:`dict.fromkeys` створює новий словник зі списку ключів. Чистий еквівалент Python:

source: Now a new dictionary of unique keys can be constructed like this:
uk: Тепер новий словник унікальних ключів можна сконструювати так:

source: Using the non-data descriptor protocol, a pure Python version of :func:`classmethod` would look like this:
uk: Використовуючи протокол дескриптора без даних, чиста версія :func:`classmethod` на Python виглядала б так:

source: Member objects and __slots__
uk: Об'єкти-члени та __slots__

source: When a class defines ``__slots__``, it replaces instance dictionaries with a fixed-length array of slot values. From a user point of view that has several effects:
uk: Коли клас визначає ``__slots__``, він замінює словники примірників на масив значень слотів фіксованої довжини. З точки зору користувача, це має кілька ефектів:

source: 1. Provides immediate detection of bugs due to misspelled attribute assignments. Only attribute names specified in ``__slots__`` are allowed:
uk: 1. Забезпечує негайне виявлення помилок через неправильно написані атрибути. Дозволяються лише імена атрибутів, указані в ``__slots__``:

source: 2. Helps create immutable objects where descriptors manage access to private attributes stored in ``__slots__``:
uk: 2. Допомагає створювати незмінні об’єкти, де дескриптори керують доступом до приватних атрибутів, що зберігаються в ``__slots__``:

source: 3. Saves memory. On a 64-bit Linux build, an instance with two attributes takes 48 bytes with ``__slots__`` and 152 bytes without. This `flyweight design pattern <https://en.wikipedia.org/wiki/Flyweight_pattern>`_ likely only matters when a large number of instances are going to be created.
uk: 3. Економить пам'ять. У 64-розрядній збірці Linux екземпляр із двома атрибутами займає 48 байтів із ``__slots__`` і 152 байти без. Цей `шаблон проектування легкої ваги <https://en.wikipedia.org/wiki/Flyweight_pattern>`_, ймовірно, має значення лише тоді, коли буде створено велику кількість екземплярів.

source: 4. Improves speed. Reading instance variables is 35% faster with ``__slots__`` (as measured with Python 3.10 on an Apple M1 processor).
uk: 4. Покращує швидкість. Читання змінних екземплярів відбувається на 35% швидше за допомогою ``__slots__`` (виміряно за допомогою Python 3.10 на процесорі Apple M1).

source: 5. Blocks tools like :func:`functools.cached_property` which require an instance dictionary to function correctly:
uk: 5. Блокує такі інструменти, як :func:`functools.cached_property`, яким для коректної роботи потрібен словник екземплярів:

source: It is not possible to create an exact drop-in pure Python version of ``__slots__`` because it requires direct access to C structures and control over object memory allocation. However, we can build a mostly faithful simulation where the actual C structure for slots is emulated by a private ``_slotvalues`` list. Reads and writes to that private structure are managed by member descriptors:
uk: Неможливо створити точну версію ``__slots__`` на Python, оскільки для цього потрібен прямий доступ до структур C і контроль над розподілом пам’яті об’єктів. Однак ми можемо побудувати здебільшого точну симуляцію, де фактична структура C для слотів емулюється приватним списком ``_slotvalues``. Читанням і записом у цю приватну структуру керують дескриптори членів:

source: The :meth:`type.__new__` method takes care of adding member objects to class variables:
uk: Метод :meth:`type.__new__` піклується про додавання об’єктів-членів до змінних класу:

source: The :meth:`object.__new__` method takes care of creating instances that have slots instead of an instance dictionary. Here is a rough simulation in pure Python:
uk: Метод :meth:`object.__new__` піклується про створення екземплярів, які мають слоти замість словника екземплярів. Ось приблизне моделювання на чистому Python:

source: To use the simulation in a real class, just inherit from :class:`Object` and set the :term:`metaclass` to :class:`Type`:
uk: Щоб використовувати симуляцію в реальному класі, просто успадкуйте від :class:`Object` і встановіть :term:`metaclass` на :class:`Type`:

source: At this point, the metaclass has loaded member objects for *x* and *y*::
uk: На даний момент метаклас завантажив об’єкти-члени для *x* і *y*::

source: When instances are created, they have a ``slot_values`` list where the attributes are stored:
uk: Коли екземпляри створюються, вони мають список ``slot_values``, де зберігаються атрибути:

source: Misspelled or unassigned attributes will raise an exception:
uk: Помилково введені або непризначені атрибути викликають виняток:
