Repository: python/python-docs-uk
Catalog: howto/descriptor.po
Languages: uk

source: Author
uk: Автор

source: Contact
uk: контакт

source: Contents
uk: Зміст

source: :term:`Descriptors <descriptor>` let objects customize attribute lookup, storage, and deletion.
uk: :term:`Дескриптори <descriptor>` дозволяють об’єктам налаштовувати пошук атрибутів, зберігання та видалення.

source: This guide has four major sections:
uk: Цей посібник складається з чотирьох основних розділів:

source: The "primer" gives a basic overview, moving gently from simple examples, adding one feature at a time. Start here if you're new to descriptors.
uk: "Буквар" дає базовий огляд, обережно переходячи від простих прикладів, додаючи одну функцію за раз. Почніть тут, якщо ви новачок у дескрипторах.

source: The second section shows a complete, practical descriptor example. If you already know the basics, start there.
uk: Другий розділ показує повний, практичний приклад дескриптора. Якщо ви вже знаєте основи, почніть з цього.

source: The third section provides a more technical tutorial that goes into the detailed mechanics of how descriptors work. Most people don't need this level of detail.
uk: Третій розділ містить більш технічний підручник, який детально описує механізм роботи дескрипторів. Більшості людей не потрібен такий рівень деталізації.

source: The last section has pure Python equivalents for built-in descriptors that are written in C. Read this if you're curious about how functions turn into bound methods or about the implementation of common tools like :func:`classmethod`, :func:`staticmethod`, :func:`property`, and :term:`__slots__`.
uk: Останній розділ містить чисті еквіваленти Python для вбудованих дескрипторів, написаних мовою C. Прочитайте це, якщо вам цікаво, як функції перетворюються на зв’язані методи, або про реалізацію звичайних інструментів, таких як :func:`classmethod`, :func:`staticmethod`, :func:`property` і :term:`__slots__`.

source: Primer
uk: Буквар

source: In this primer, we start with the most basic possible example and then we'll add new capabilities one by one.
uk: У цьому посібнику ми починаємо з найпростішого можливого прикладу, а потім будемо додавати нові можливості одну за одною.

source: Simple example: A descriptor that returns a constant
uk: Простий приклад: дескриптор, який повертає константу

source: The :class:`Ten` class is a descriptor whose :meth:`__get__` method always returns the constant ``10``:
uk: Клас :class:`Ten` — це дескриптор, чий метод :meth:`__get__` завжди повертає константу ``10``:

source: To use the descriptor, it must be stored as a class variable in another class:
uk: Щоб використовувати дескриптор, його потрібно зберегти як змінну класу в іншому класі:

source: An interactive session shows the difference between normal attribute lookup and descriptor lookup:
uk: Інтерактивний сеанс показує різницю між звичайним пошуком атрибута та пошуком дескриптора:

source: In the ``a.x`` attribute lookup, the dot operator finds ``'x': 5`` in the class dictionary. In the ``a.y`` lookup, the dot operator finds a descriptor instance, recognized by its ``__get__`` method. Calling that method returns ``10``.
uk: Під час пошуку атрибутів ``a.x`` оператор крапки знаходить ``'x': 5`` у словнику класу. Під час пошуку ``a.y`` оператор точки знаходить екземпляр дескриптора, розпізнаний його методом ``__get__``. Виклик цього методу повертає ``10``.

source: Note that the value ``10`` is not stored in either the class dictionary or the instance dictionary. Instead, the value ``10`` is computed on demand.
uk: Зверніть увагу, що значення ``10`` не зберігається ні в словнику класу, ні в словнику екземпляра. Натомість значення ``10`` обчислюється на вимогу.

source: This example shows how a simple descriptor works, but it isn't very useful. For retrieving constants, normal attribute lookup would be better.
uk: Цей приклад показує, як працює простий дескриптор, але він не дуже корисний. Для отримання констант кращим буде звичайний пошук атрибутів.

source: In the next section, we'll create something more useful, a dynamic lookup.
uk: У наступному розділі ми створимо щось більш корисне, динамічний пошук.

source: Dynamic lookups
uk: Динамічні пошуки

source: Interesting descriptors typically run computations instead of returning constants:
uk: Цікаві дескриптори зазвичай запускають обчислення замість повернення констант:

source: An interactive session shows that the lookup is dynamic — it computes different, updated answers each time::
uk: Інтерактивний сеанс показує, що пошук є динамічним — він щоразу обчислює різні оновлені відповіді:

source: Besides showing how descriptors can run computations, this example also reveals the purpose of the parameters to :meth:`__get__`. The *self* parameter is *size*, an instance of *DirectorySize*. The *obj* parameter is either *g* or *s*, an instance of *Directory*. It is the *obj* parameter that lets the :meth:`__get__` method learn the target directory. The *objtype* parameter is the class *Directory*.
uk: Крім показу того, як дескриптори можуть запускати обчислення, цей приклад також показує призначення параметрів для :meth:`__get__`. Параметр *self* — це *size*, екземпляр *DirectorySize*. Параметр *obj* — це або *g*, або *s*, екземпляр *Directory*. Саме параметр *obj* дозволяє методу :meth:`__get__` вивчати цільовий каталог. Параметр *objtype* є класом *Directory*.

source: Managed attributes
uk: Керовані атрибути

source: A popular use for descriptors is managing access to instance data. The descriptor is assigned to a public attribute in the class dictionary while the actual data is stored as a private attribute in the instance dictionary. The descriptor's :meth:`__get__` and :meth:`__set__` methods are triggered when the public attribute is accessed.
uk: Популярним використанням дескрипторів є керування доступом до даних екземплярів. Дескриптор призначається публічному атрибуту в словнику класу, а фактичні дані зберігаються як приватний атрибут у словнику екземпляра. Методи дескриптора :meth:`__get__` і :meth:`__set__` запускаються під час доступу до публічного атрибута.

source: In the following example, *age* is the public attribute and *_age* is the private attribute. When the public attribute is accessed, the descriptor logs the lookup or update:
uk: У наступному прикладі *age* є публічним атрибутом, а *_age* є приватним. Коли здійснюється доступ до публічного атрибута, дескриптор реєструє пошук або оновлення:

source: An interactive session shows that all access to the managed attribute *age* is logged, but that the regular attribute *name* is not logged:
uk: Інтерактивний сеанс показує, що весь доступ до керованого атрибута *age* реєструється, але звичайний атрибут *name* не реєструється:

source: One major issue with this example is that the private name *_age* is hardwired in the *LoggedAgeAccess* class. That means that each instance can only have one logged attribute and that its name is unchangeable. In the next example, we'll fix that problem.
uk: Однією з основних проблем у цьому прикладі є те, що приватне ім’я *_age* закріплено в класі *LoggedAgeAccess*. Це означає, що кожен екземпляр може мати лише один зареєстрований атрибут і що його ім’я не змінюється. У наступному прикладі ми вирішимо цю проблему.

source: Customized names
uk: Індивідуальні імена

source: When a class uses descriptors, it can inform each descriptor about which variable name was used.
uk: Коли клас використовує дескриптори, він може інформувати кожен дескриптор про те, яке ім'я змінної було використано.

source: In this example, the :class:`Person` class has two descriptor instances, *name* and *age*. When the :class:`Person` class is defined, it makes a callback to :meth:`__set_name__` in *LoggedAccess* so that the field names can be recorded, giving each descriptor its own *public_name* and *private_name*:
uk: У цьому прикладі клас :class:`Person` має два екземпляри дескриптора, *name* і *age*. Коли визначено клас :class:`Person`, він здійснює зворотний виклик до :meth:`__set_name__` у *LoggedAccess*, щоб можна було записати назви полів, надаючи кожному дескриптору власні *public_name* і *private_name*:

source: An interactive session shows that the :class:`Person` class has called :meth:`__set_name__` so that the field names would be recorded. Here we call :func:`vars` to look up the descriptor without triggering it:
uk: Інтерактивний сеанс показує, що клас :class:`Person` викликав :meth:`__set_name__`, щоб назви полів були записані. Тут ми викликаємо :func:`vars` для пошуку дескриптора без його запуску:

source: The new class now logs access to both *name* and *age*:
uk: Новий клас тепер реєструє доступ як до *ім’я*, так і до *віку*:

source: The two *Person* instances contain only the private names:
uk: Два екземпляри *Person* містять лише приватні імена:

source: Closing thoughts
uk: Закриття думок

source: A :term:`descriptor` is what we call any object that defines :meth:`__get__`, :meth:`__set__`, or :meth:`__delete__`.
uk: :term:`descriptor` — це те, що ми називаємо будь-яким об’єктом, який визначає :meth:`__get__`, :meth:`__set__` або :meth:`__delete__`.

source: Optionally, descriptors can have a :meth:`__set_name__` method. This is only used in cases where a descriptor needs to know either the class where it was created or the name of class variable it was assigned to. (This method, if present, is called even if the class is not a descriptor.)
uk: Додатково дескриптори можуть мати метод :meth:`__set_name__`. Це використовується лише у випадках, коли дескриптору потрібно знати або клас, у якому він був створений, або назву змінної класу, якій він був призначений. (Цей метод, якщо він присутній, викликається, навіть якщо клас не є дескриптором.)

source: Descriptors get invoked by the dot operator during attribute lookup. If a descriptor is accessed indirectly with ``vars(some_class)[descriptor_name]``, the descriptor instance is returned without invoking it.
uk: Дескриптори викликаються оператором крапки під час пошуку атрибутів. Якщо до дескриптора звертаються опосередковано за допомогою ``vars(some_class)[descriptor_name]``, екземпляр дескриптора повертається без його виклику.

source: Descriptors only work when used as class variables. When put in instances, they have no effect.
uk: Дескриптори працюють лише тоді, коли використовуються як змінні класу. Якщо їх поставити в інстанції, вони не мають ефекту.

source: The main motivation for descriptors is to provide a hook allowing objects stored in class variables to control what happens during attribute lookup.
uk: Основна мотивація для дескрипторів полягає в тому, щоб надати гачок, який дозволяє об’єктам, що зберігаються у змінних класу, контролювати те, що відбувається під час пошуку атрибутів.

source: Traditionally, the calling class controls what happens during lookup. Descriptors invert that relationship and allow the data being looked-up to have a say in the matter.
uk: Традиційно викликаючий клас контролює те, що відбувається під час пошуку. Дескриптори інвертують цей зв’язок і дозволяють шуканим даним мати право голосу в цьому питанні.

source: Descriptors are used throughout the language. It is how functions turn into bound methods. Common tools like :func:`classmethod`, :func:`staticmethod`, :func:`property`, and :func:`functools.cached_property` are all implemented as descriptors.
uk: Дескриптори використовуються в усій мові. Саме так функції перетворюються на зв’язані методи. Загальні інструменти, такі як :func:`classmethod`, :func:`staticmethod`, :func:`property` і :func:`functools.cached_property`, усі реалізовані як дескриптори.

source: Complete Practical Example
uk: Повний практичний приклад

source: In this example, we create a practical and powerful tool for locating notoriously hard to find data corruption bugs.
uk: У цьому прикладі ми створюємо практичний і потужний інструмент для виявлення помилок пошкодження даних, які, як відомо, важко знайти.

source: Validator class
uk: Клас валідатора

source: A validator is a descriptor for managed attribute access. Prior to storing any data, it verifies that the new value meets various type and range restrictions. If those restrictions aren't met, it raises an exception to prevent data corruption at its source.
uk: Валідатор — це дескриптор керованого доступу до атрибутів. Перш ніж зберігати будь-які дані, він перевіряє, чи нове значення відповідає різним обмеженням типу та діапазону. Якщо ці обмеження не виконуються, створюється виняток, щоб запобігти пошкодженню даних у їх джерелі.

source: This :class:`Validator` class is both an :term:`abstract base class` and a managed attribute descriptor:
uk: Цей клас :class:`Validator` є водночас :term:`abstract base class` і дескриптором керованих атрибутів:

source: Custom validators need to inherit from :class:`Validator` and must supply a :meth:`validate` method to test various restrictions as needed.
uk: Спеціальні валідатори повинні успадкувати :class:`Validator` і надати метод :meth:`validate` для перевірки різноманітних обмежень за потреби.

source: Custom validators
uk: Спеціальні валідатори

source: Here are three practical data validation utilities:
uk: Ось три практичні утиліти перевірки даних:

source: :class:`OneOf` verifies that a value is one of a restricted set of options.
uk: :class:`OneOf` перевіряє, чи значення є одним із обмеженого набору параметрів.

source: :class:`Number` verifies that a value is either an :class:`int` or :class:`float`. Optionally, it verifies that a value is between a given minimum or maximum.
uk: :class:`Number` перевіряє, чи значення є або :class:`int`, або :class:`float`. За бажанням він перевіряє, чи значення знаходиться між заданим мінімумом або максимумом.

source: :class:`String` verifies that a value is a :class:`str`. Optionally, it validates a given minimum or maximum length. It can validate a user-defined `predicate <https://en.wikipedia.org/wiki/Predicate_(mathematical_logic)>`_ as well.
uk: :class:`String` перевіряє, що значення є :class:`str`. За бажанням він перевіряє задану мінімальну або максимальну довжину. Він також може перевірити визначений користувачем `предикат <https://en.wikipedia.org/wiki/Predicate_(mathematical_logic)>`_.

source: Practical application
uk: Практичне застосування

source: Here's how the data validators can be used in a real class:
uk: Ось як валідатори даних можна використовувати в реальному класі:

source: The descriptors prevent invalid instances from being created:
uk: Дескриптори запобігають створенню недійсних екземплярів:

source: Technical Tutorial
uk: Технічний підручник

source: What follows is a more technical tutorial for the mechanics and details of how descriptors work.
uk: Далі є більш технічний підручник для механіки та деталей роботи дескрипторів.

source: Abstract
uk: Анотація

source: Defines descriptors, summarizes the protocol, and shows how descriptors are called. Provides an example showing how object relational mappings work.
uk: Визначає дескриптори, підсумовує протокол і показує, як викликаються дескриптори. Надає приклад, який показує, як працюють об’єктно-реляційні відображення.

source: Learning about descriptors not only provides access to a larger toolset, it creates a deeper understanding of how Python works.
uk: Вивчення дескрипторів не тільки забезпечує доступ до більшого набору інструментів, це створює глибше розуміння того, як працює Python.

source: Definition and introduction
uk: Визначення та вступ

source: In general, a descriptor is an attribute value that has one of the methods in the descriptor protocol. Those methods are :meth:`__get__`, :meth:`__set__`, and :meth:`__delete__`. If any of those methods are defined for an attribute, it is said to be a :term:`descriptor`.
uk: Загалом, дескриптор — це значення атрибута, яке має один із методів у протоколі дескриптора. Ці методи: :meth:`__get__`, :meth:`__set__` і :meth:`__delete__`. Якщо будь-який із цих методів визначено для атрибута, він називається :term:`descriptor`.

source: The default behavior for attribute access is to get, set, or delete the attribute from an object's dictionary. For instance, ``a.x`` has a lookup chain starting with ``a.__dict__['x']``, then ``type(a).__dict__['x']``, and continuing through the method resolution order of ``type(a)``. If the looked-up value is an object defining one of the descriptor methods, then Python may override the default behavior and invoke the descriptor method instead. Where this occurs in the precedence chain depends on which descriptor methods were defined.
uk: Поведінка за умовчанням для доступу до атрибутів полягає в отриманні, установці або видаленні атрибута зі словника об’єкта. Наприклад, ``a.x`` має ланцюжок пошуку, починаючи з ``a.__dict__['x']``, потім ``type(a).__dict__['x']`` і продовжуючи через дозвіл методу порядок ``type(a)``. Якщо шукане значення є об’єктом, що визначає один із методів дескриптора, тоді Python може замінити поведінку за замовчуванням і замість цього викликати метод дескриптора. Де це відбувається в ланцюжку пріоритетів, залежить від того, які методи дескриптора були визначені.

source: Descriptor protocol
uk: Дескрипторний протокол

source: That is all there is to it. Define any of these methods and an object is considered a descriptor and can override default behavior upon being looked up as an attribute.
uk: Це все. Визначте будь-який із цих методів, і об’єкт вважатиметься дескриптором і зможе замінити поведінку за замовчуванням, якщо його шукати як атрибут.

source: If an object defines :meth:`__set__` or :meth:`__delete__`, it is considered a data descriptor. Descriptors that only define :meth:`__get__` are called non-data descriptors (they are often used for methods but other uses are possible).
uk: Якщо об’єкт визначає :meth:`__set__` або :meth:`__delete__`, він вважається дескриптором даних. Дескриптори, які визначають лише :meth:`__get__`, називаються дескрипторами не даних (вони часто використовуються для методів, але можливі й інші способи використання).

source: Data and non-data descriptors differ in how overrides are calculated with respect to entries in an instance's dictionary. If an instance's dictionary has an entry with the same name as a data descriptor, the data descriptor takes precedence. If an instance's dictionary has an entry with the same name as a non-data descriptor, the dictionary entry takes precedence.
uk: Дескриптори даних і не даних відрізняються тим, як обчислюються перевизначення щодо записів у словнику екземпляра. Якщо в словнику екземпляра є запис із таким самим іменем, як і дескриптор даних, дескриптор даних має пріоритет. Якщо в словнику екземпляра є запис із таким же ім’ям, що й дескриптор, що не є даними, пріоритет має словниковий запис.

source: To make a read-only data descriptor, define both :meth:`__get__` and :meth:`__set__` with the :meth:`__set__` raising an :exc:`AttributeError` when called. Defining the :meth:`__set__` method with an exception raising placeholder is enough to make it a data descriptor.
uk: Щоб створити дескриптор даних лише для читання, визначте :meth:`__get__` і :meth:`__set__` з :meth:`__set__`, що викликає :exc:`AttributeError` під час виклику. Щоб зробити його дескриптором даних, достатньо визначити метод :meth:`__set__` із заповнювачем, що викликає винятки.

source: Overview of descriptor invocation
uk: Огляд виклику дескриптора

source: A descriptor can be called directly with ``desc.__get__(obj)`` or ``desc.__get__(None, cls)``.
uk: Дескриптор можна викликати безпосередньо за допомогою ``desc.__get__(obj)`` або ``desc.__get__(None, cls)``.

source: But it is more common for a descriptor to be invoked automatically from attribute access.
uk: Але частіше дескриптор викликається автоматично з доступу до атрибутів.

source: The details of invocation depend on whether ``obj`` is an object, class, or instance of super.
uk: Деталі виклику залежать від того, чи є ``obj`` об'єктом, класом або екземпляром super.

source: Invocation from an instance
uk: Виклик із екземпляра

source: Instance lookup scans through a chain of namespaces giving data descriptors the highest priority, followed by instance variables, then non-data descriptors, then class variables, and lastly :meth:`__getattr__` if it is provided.
uk: Пошук екземплярів сканує ланцюжок просторів імен, надаючи найвищий пріоритет дескрипторам даних, потім змінним екземплярів, потім дескрипторам, що не є даними, потім змінним класу, і нарешті :meth:`__getattr__`, якщо він надається.

source: If a descriptor is found for ``a.x``, then it is invoked with: ``desc.__get__(a, type(a))``.
uk: Якщо для ``a.x`` знайдено дескриптор, він викликається за допомогою: ``desc.__get__(a, type(a))``.

source: The logic for a dotted lookup is in :meth:`object.__getattribute__`. Here is a pure Python equivalent:
uk: Логіка пошуку з пунктиром міститься в :meth:`object.__getattribute__`. Ось чистий еквівалент Python:

source: Note, there is no :meth:`__getattr__` hook in the :meth:`__getattribute__` code. That is why calling :meth:`__getattribute__` directly or with ``super().__getattribute__`` will bypass :meth:`__getattr__` entirely.
uk: Зауважте, що в коді :meth:`__getattribute__` немає хука :meth:`__getattr__`. Ось чому виклик :meth:`__getattribute__` безпосередньо або за допомогою ``super().__getattribute__`` повністю обійде :meth:`__getattr__`.

source: Instead, it is the dot operator and the :func:`getattr` function that are responsible for invoking :meth:`__getattr__` whenever :meth:`__getattribute__` raises an :exc:`AttributeError`. Their logic is encapsulated in a helper function:
uk: Натомість це оператор крапки та функція :func:`getattr`, які відповідають за виклик :meth:`__getattr__` щоразу, коли :meth:`__getattribute__` викликає :exc:`AttributeError`. Їхня логіка інкапсульована в допоміжній функції:

source: Invocation from a class
uk: Виклик із класу

source: The logic for a dotted lookup such as ``A.x`` is in :meth:`type.__getattribute__`. The steps are similar to those for :meth:`object.__getattribute__` but the instance dictionary lookup is replaced by a search through the class's :term:`method resolution order`.
uk: Логіка пошуку з пунктиром, наприклад ``A.x``, знаходиться в :meth:`type.__getattribute__`. Кроки подібні до кроків для :meth:`object.__getattribute__`, але пошук у словнику екземпляра замінюється пошуком у :term:`method resolution order` класу.

source: If a descriptor is found, it is invoked with ``desc.__get__(None, A)``.
uk: Якщо дескриптор знайдено, він викликається за допомогою ``desc.__get__(None, A)``.

source: Invocation from super
uk: Заклик від супер

source: A dotted lookup such as ``super(A, obj).m`` searches ``obj.__class__.__mro__`` for the base class ``B`` immediately following ``A`` and then returns ``B.__dict__['m'].__get__(obj, A)``. If not a descriptor, ``m`` is returned unchanged.
uk: Пошук із пунктиром, наприклад ``super(A, obj).m``, шукає ``obj.__class__.__mro__`` для базового класу ``B`` відразу після ``A``, а потім повертає ``B". __dict__['m'].__get__(obj, A)``. Якщо не є дескриптором, ``m`` повертається без змін.

source: Summary of invocation logic
uk: Короткий опис логіки виклику

source: The important points to remember are:
uk: Важливо пам’ятати:

source: Descriptors are invoked by the :meth:`__getattribute__` method.
uk: Дескриптори викликаються методом :meth:`__getattribute__`.

source: Classes inherit this machinery from :class:`object`, :class:`type`, or :func:`super`.
uk: Класи успадковують цей механізм від :class:`object`, :class:`type` або :func:`super`.

source: Overriding :meth:`__getattribute__` prevents automatic descriptor calls because all the descriptor logic is in that method.
uk: Перевизначення :meth:`__getattribute__` запобігає автоматичним викликам дескриптора, оскільки вся логіка дескриптора міститься в цьому методі.
