Repository: python/python-docs-uk
Catalog: howto/enum.po
Languages: uk

source: Author
uk: Автор

source: An :class:`Enum` is a set of symbolic names bound to unique values. They are similar to global variables, but they offer a more useful :func:`repr()`, grouping, type-safety, and a few other features.
uk: :class:`Enum` — це набір символічних імен, прив’язаних до унікальних значень. Вони подібні до глобальних змінних, але пропонують більш корисні функції :func:`repr()`, групування, безпеку типів і кілька інших функцій.

source: They are most useful when you have a variable that can take one of a limited selection of values. For example, the days of the week::
uk: Вони найбільш корисні, коли у вас є змінна, яка може приймати одне з обмеженого вибору значень. Наприклад, дні тижня::

source: As you can see, creating an :class:`Enum` is as simple as writing a class that inherits from :class:`Enum` itself.
uk: Як бачите, створити :class:`Enum` так само просто, як написати клас, який успадковує сам :class:`Enum`.

source: Case of Enum Members
uk: Випадок членів Enum

source: Because Enums are used to represent constants we recommend using UPPER_CASE names for members, and will be using that style in our examples.
uk: Оскільки Enum використовуються для представлення констант, ми рекомендуємо використовувати UPPER_CASE імена для членів і використовуватимемо цей стиль у наших прикладах.

source: Depending on the nature of the enum a member's value may or may not be important, but either way that value can be used to get the corresponding member::
uk: Залежно від характеру переліку значення члена може бути важливим або неважливим, але в будь-якому випадку це значення можна використовувати для отримання відповідного члена::

source: The *type* of an enumeration member is the enum it belongs to::
uk: *Тип* члена переліку — це enum, якому він належить::

source: Enum members have an attribute that contains just their :attr:`name`::
uk: Члени Enum мають атрибут, який містить лише їх :attr:`name`::

source: Likewise, they have an attribute for their :attr:`value`::
uk: Так само вони мають атрибут для свого :attr:`value`::

source: Unlike many languages that treat enumerations solely as name/value pairs, Python Enums can have behavior added. For example, :class:`datetime.date` has two methods for returning the weekday: :meth:`weekday` and :meth:`isoweekday`. The difference is that one of them counts from 0-6 and the other from 1-7. Rather than keep track of that ourselves we can add a method to the :class:`Weekday` enum to extract the day from the :class:`date` instance and return the matching enum member::
uk: На відміну від багатьох мов, які розглядають перерахування виключно як пари ім’я/значення, Python Enums може мати додану поведінку. Наприклад, :class:`datetime.date` має два методи для повернення дня тижня: :meth:`weekday` і :meth:`isoweekday`. Різниця в тому, що один з них рахує від 0 до 6, а інший від 1 до 7. Замість того, щоб відслідковувати це самостійно, ми можемо додати метод до переліку :class:`Weekday`, щоб отримати день із примірника :class:`date` і повернути відповідний член переліку::

source: The complete :class:`Weekday` enum now looks like this::
uk: Повний перелік :class:`Weekday` виглядає так:

source: Now we can find out what today is! Observe::
uk: Тепер ми можемо дізнатися, що таке сьогодні! Спостерігати::

source: Of course, if you're reading this on some other day, you'll see that day instead.
uk: Звичайно, якщо ви читаєте це в інший день, ви побачите цей день.

source: This :class:`Weekday` enum is great if our variable only needs one day, but what if we need several? Maybe we're writing a function to plot chores during a week, and don't want to use a :class:`list` -- we could use a different type of :class:`Enum`::
uk: Цей перелік :class:`Weekday` чудово підходить, якщо нашій змінній потрібен лише один день, але що, якщо нам потрібно декілька? Можливо, ми пишемо функцію для графіку роботи протягом тижня, і не хочемо використовувати :class:`list` -- ми можемо використати інший тип :class:`Enum`::

source: We've changed two things: we're inherited from :class:`Flag`, and the values are all powers of 2.
uk: Ми змінили дві речі: ми успадковані від :class:`Flag`, і всі значення є степенями 2.

source: Just like the original :class:`Weekday` enum above, we can have a single selection::
uk: Як і в оригінальному переліку :class:`Weekday` вище, ми можемо мати один вибір::

source: But :class:`Flag` also allows us to combine several members into a single variable::
uk: Але :class:`Flag` також дозволяє нам об’єднати кілька членів в одну змінну::

source: You can even iterate over a :class:`Flag` variable::
uk: Ви навіть можете перебирати змінну :class:`Flag`::

source: Okay, let's get some chores set up::
uk: Гаразд, давайте приступимо до роботи::

source: And a function to display the chores for a given day::
uk: І функція для відображення справ за певний день::

source: In cases where the actual values of the members do not matter, you can save yourself some work and use :func:`auto()` for the values::
uk: У випадках, коли фактичні значення членів не мають значення, ви можете заощадити собі трохи праці та використати :func:`auto()` для значень::

source: Programmatic access to enumeration members and their attributes
uk: Програмний доступ до елементів переліку та їх атрибутів

source: Sometimes it's useful to access members in enumerations programmatically (i.e. situations where ``Color.RED`` won't do because the exact color is not known at program-writing time). ``Enum`` allows such access::
uk: Іноді корисно отримати доступ до членів у перерахуваннях програмно (тобто ситуації, коли ``Color.RED`` не підійде, оскільки точний колір невідомий під час написання програми). ``Enum`` дозволяє такий доступ:

source: If you want to access enum members by *name*, use item access::
uk: Якщо ви хочете отримати доступ до членів enum за *ім’ям*, використовуйте доступ до елемента::

source: If you have an enum member and need its :attr:`name` or :attr:`value`::
uk: Якщо у вас є член enum і вам потрібно його :attr:`name` або :attr:`value`::

source: Duplicating enum members and values
uk: Дублювання членів enum і значень

source: Having two enum members with the same name is invalid::
uk: Наявність двох членів переліку з однаковими іменами недійсна::

source: However, an enum member can have other names associated with it. Given two entries ``A`` and ``B`` with the same value (and ``A`` defined first), ``B`` is an alias for the member ``A``. By-value lookup of the value of ``A`` will return the member ``A``. By-name lookup of ``A`` will return the member ``A``. By-name lookup of ``B`` will also return the member ``A``::
uk: Однак член enum може мати інші імена, пов’язані з ним. За наявності двох записів ``A`` і ``B`` з однаковим значенням (і ``A``, визначеним першим), ``B`` є псевдонімом для члена ``A``. Пошук за значенням значення ``A`` поверне член ``A``. Пошук за назвою ``A`` поверне член ``A``. Пошук за назвою ``B`` також поверне член ``A``::

source: Attempting to create a member with the same name as an already defined attribute (another member, a method, etc.) or attempting to create an attribute with the same name as a member is not allowed.
uk: Спроба створити член із тим же ім’ям, що й уже визначений атрибут (інший член, метод тощо), або спроба створити атрибут із тим же ім’ям, що й член, не дозволяється.

source: Ensuring unique enumeration values
uk: Забезпечення унікальних значень перерахування

source: By default, enumerations allow multiple names as aliases for the same value. When this behavior isn't desired, you can use the :func:`unique` decorator::
uk: За замовчуванням перерахування дозволяють використовувати кілька імен як псевдоніми для одного значення. Якщо така поведінка небажана, ви можете використати декоратор :func:`unique`::

source: Using automatic values
uk: Використання автоматичних значень

source: If the exact value is unimportant you can use :class:`auto`::
uk: Якщо точне значення неважливе, ви можете використовувати :class:`auto`::

source: The values are chosen by :func:`_generate_next_value_`, which can be overridden::
uk: Значення вибираються :func:`_generate_next_value_`, які можна замінити:

source: The :meth:`_generate_next_value_` method must be defined before any members.
uk: Метод :meth:`_generate_next_value_` має бути визначений перед будь-якими членами.

source: Iteration
uk: Ітерація

source: Iterating over the members of an enum does not provide the aliases::
uk: Перебір членів enum не забезпечує псевдоніми::

source: The special attribute ``__members__`` is a read-only ordered mapping of names to members. It includes all names defined in the enumeration, including the aliases::
uk: Спеціальний атрибут ``__members__`` — це впорядковане відображення імен учасників лише для читання. Він включає всі імена, визначені в переліку, включаючи псевдоніми::

source: The ``__members__`` attribute can be used for detailed programmatic access to the enumeration members. For example, finding all the aliases::
uk: Атрибут ``__members__`` можна використовувати для детального програмного доступу до елементів переліку. Наприклад, пошук усіх псевдонімів::

source: Comparisons
uk: Порівняння

source: Enumeration members are compared by identity::
uk: Члени переліку порівнюються за ідентичністю::

source: Ordered comparisons between enumeration values are *not* supported. Enum members are not integers (but see `IntEnum`_ below)::
uk: Упорядковані порівняння між значеннями перерахування *не* підтримуються. Члени Enum не є цілими числами (але дивіться `IntEnum`_ нижче):

source: Equality comparisons are defined though::
uk: Однак порівняння рівності визначено:

source: Comparisons against non-enumeration values will always compare not equal (again, :class:`IntEnum` was explicitly designed to behave differently, see below)::
uk: Порівняння зі значеннями, не пов’язаними з перерахуванням, завжди порівнюватиметься нерівними (знову ж таки, :class:`IntEnum` був явно розроблений для іншої поведінки, див. нижче)::

source: Allowed members and attributes of enumerations
uk: Дозволені члени та атрибути перерахувань

source: Most of the examples above use integers for enumeration values. Using integers is short and handy (and provided by default by the `Functional API`_), but not strictly enforced. In the vast majority of use-cases, one doesn't care what the actual value of an enumeration is. But if the value *is* important, enumerations can have arbitrary values.
uk: Більшість наведених вище прикладів використовують цілі числа для значень перерахування. Використання цілих чисел є коротким і зручним (і надається за замовчуванням `Functional API`_), але не суворо дотримується. У переважній більшості варіантів використання байдуже, яке фактичне значення перерахування. Але якщо значення *є* важливим, перерахування можуть мати довільні значення.

source: Enumerations are Python classes, and can have methods and special methods as usual. If we have this enumeration::
uk: Перерахування є класами Python і, як зазвичай, можуть мати методи та спеціальні методи. Якщо ми маємо цей перелік::

source: Then::
uk: Потім::

source: The rules for what is allowed are as follows: names that start and end with a single underscore are reserved by enum and cannot be used; all other attributes defined within an enumeration will become members of this enumeration, with the exception of special methods (:meth:`__str__`, :meth:`__add__`, etc.), descriptors (methods are also descriptors), and variable names listed in :attr:`_ignore_`.
uk: Дозволені правила такі: імена, які починаються і закінчуються одним підкресленням, зарезервовані enum і не можуть використовуватися; усі інші атрибути, визначені в переліку, стануть членами цього переліку, за винятком спеціальних методів (:meth:`__str__`, :meth:`__add__` тощо), дескрипторів (методи також є дескрипторами) і імен змінних перераховані в :attr:`_ignore_`.

source: Note: if your enumeration defines :meth:`__new__` and/or :meth:`__init__` then any value(s) given to the enum member will be passed into those methods. See `Planet`_ for an example.
uk: Примітка: якщо ваш перелік визначає :meth:`__new__` та/або :meth:`__init__`, тоді будь-яке значення, надане члену enum, буде передано в ці методи. Перегляньте `Planet`_ для прикладу.

source: Restricted Enum subclassing
uk: Обмежений підклас Enum

source: A new :class:`Enum` class must have one base enum class, up to one concrete data type, and as many :class:`object`-based mixin classes as needed. The order of these base classes is::
uk: Новий клас :class:`Enum` повинен мати один базовий клас enum, до одного конкретного типу даних і стільки класів міксину на основі :class:`object`, скільки потрібно. Порядок цих базових класів:

source: Also, subclassing an enumeration is allowed only if the enumeration does not define any members. So this is forbidden::
uk: Крім того, створення підкласу переліку дозволяється, лише якщо перелік не визначає жодних членів. Тому це заборонено::

source: But this is allowed::
uk: Але це дозволено::

source: Allowing subclassing of enums that define members would lead to a violation of some important invariants of types and instances. On the other hand, it makes sense to allow sharing some common behavior between a group of enumerations. (See `OrderedEnum`_ for an example.)
uk: Дозвіл створення підкласів для переліків, які визначають члени, призведе до порушення деяких важливих інваріантів типів і екземплярів. З іншого боку, має сенс дозволити спільну поведінку між групою перерахувань. (Див. `OrderedEnum`_ для прикладу.)

source: Pickling
uk: Соління

source: Enumerations can be pickled and unpickled::
uk: Перерахування можна маринувати і не маринувати:

source: The usual restrictions for pickling apply: picklable enums must be defined in the top level of a module, since unpickling requires them to be importable from that module.
uk: Застосовуються звичайні обмеження для маркування: переліки, які можна піклувати, повинні бути визначені на верхньому рівні модуля, оскільки для скасування потрібно, щоб їх можна було імпортувати з цього модуля.

source: With pickle protocol version 4 it is possible to easily pickle enums nested in other classes.
uk: За допомогою протоколу pickle версії 4 можна легко маринувати переліки, вкладені в інші класи.

source: It is possible to modify how enum members are pickled/unpickled by defining :meth:`__reduce_ex__` in the enumeration class.
uk: Можна змінити те, як члени enum вибираються/розбираються, визначивши :meth:`__reduce_ex__` у класі переліку.

source: Functional API
uk: Функціональний API

source: The :class:`Enum` class is callable, providing the following functional API::
uk: Клас :class:`Enum` можна викликати, забезпечуючи такий функціональний API:

source: The semantics of this API resemble :class:`~collections.namedtuple`. The first argument of the call to :class:`Enum` is the name of the enumeration.
uk: Семантика цього API нагадує :class:`~collections.namedtuple`. Першим аргументом виклику :class:`Enum` є назва переліку.

source: The second argument is the *source* of enumeration member names. It can be a whitespace-separated string of names, a sequence of names, a sequence of 2-tuples with key/value pairs, or a mapping (e.g. dictionary) of names to values. The last two options enable assigning arbitrary values to enumerations; the others auto-assign increasing integers starting with 1 (use the ``start`` parameter to specify a different starting value). A new class derived from :class:`Enum` is returned. In other words, the above assignment to :class:`Animal` is equivalent to::
uk: Другим аргументом є *джерело* імен членів переліку. Це може бути рядок імен, розділених пробілами, послідовність імен, послідовність 2-кортежів із парами ключ/значення або зіставлення (наприклад, словник) імен із значеннями. Останні два параметри дозволяють присвоювати довільні значення перерахуванням; інші автоматично призначають зростаючі цілі числа, починаючи з 1 (використовуйте параметр ``start``, щоб вказати інше початкове значення). Повертається новий клас, похідний від :class:`Enum`. Іншими словами, наведене вище призначення :class:`Animal` еквівалентне::

source: The reason for defaulting to ``1`` as the starting number and not ``0`` is that ``0`` is ``False`` in a boolean sense, but by default enum members all evaluate to ``True``.
uk: Причина того, що за замовчуванням початковим числом є ``1``, а не ``0``, полягає в тому, що ``0`` є ``False`` у логічному сенсі, але за замовчуванням усі члени enum оцінюються як ``True``.

source: If ``module`` is not supplied, and Enum cannot determine what it is, the new Enum members will not be unpicklable; to keep errors closer to the source, pickling will be disabled.
uk: Якщо ``module`` не вказано, і Enum не може визначити, що це таке, нові члени Enum не можна буде вибрати; щоб зберегти помилки ближче до джерела, травлення буде вимкнено.

source: The new pickle protocol 4 also, in some circumstances, relies on :attr:`~definition.__qualname__` being set to the location where pickle will be able to find the class. For example, if the class was made available in class SomeData in the global scope::
uk: Новий протокол pickle 4 також, за деяких обставин, покладається на те, що :attr:`~definition.__qualname__` встановлено на місце, де pickle зможе знайти клас. Наприклад, якщо клас був доступний у класі SomeData у глобальній області::

source: The complete signature is::
uk: Повний підпис:

source: value
uk: значення

source: What the new enum class will record as its name.
uk: Те, що новий клас enum записуватиме як своє ім’я.

source: names
uk: імена

source: or an iterator of names::
uk: або ітератор імен::

source: or an iterator of (name, value) pairs::
uk: або ітератор пар (ім'я, значення)::

source: or a mapping::
uk: або відображення::

source: module
uk: модуль

source: name of module where new enum class can be found.
uk: назва модуля, де можна знайти новий клас enum.

source: where in module new enum class can be found.
uk: де в модулі можна знайти новий клас enum.

source: type
uk: типу

source: type to mix in to new enum class.
uk: введіть, щоб додати до нового класу enum.

source: start
uk: початок

source: number to start counting at if only names are passed in.
uk: число для початку підрахунку, якщо передано лише імена.

source: The *start* parameter was added.
uk: Додано параметр *start*.

source: Derived Enumerations
uk: Похідні перерахування

source: The first variation of :class:`Enum` that is provided is also a subclass of :class:`int`. Members of an :class:`IntEnum` can be compared to integers; by extension, integer enumerations of different types can also be compared to each other::
uk: Перший наданий варіант :class:`Enum` також є підкласом :class:`int`. Члени :class:`IntEnum` можна порівняти з цілими числами; за розширенням, цілочисельні перерахування різних типів також можна порівнювати один з одним:

source: However, they still can't be compared to standard :class:`Enum` enumerations::
uk: Однак їх все ще не можна порівняти зі стандартними перерахуваннями :class:`Enum`::

source: :class:`IntEnum` values behave like integers in other ways you'd expect::
uk: Значення :class:`IntEnum` поводяться як цілі числа іншим чином:

source: Any operation on an :class:`IntFlag` member besides the bit-wise operations will lose the :class:`IntFlag` membership.
uk: Будь-яка операція з членом :class:`IntFlag`, крім побітових операцій, втрачає членство :class:`IntFlag`.

source: Bit-wise operations that result in invalid :class:`IntFlag` values will lose the :class:`IntFlag` membership. See :class:`FlagBoundary` for details.
uk: Побітові операції, які призводять до недійсних значень :class:`IntFlag`, втратять членство :class:`IntFlag`. Перегляньте :class:`FlagBoundary` для деталей.

source: Sample :class:`IntFlag` class::
uk: Приклад :class:`IntFlag` class::

source: It is also possible to name the combinations::
uk: Також можна назвати комбінації:

source: Named combinations are considered aliases. Aliases do not show up during iteration, but can be returned from by-value lookups.
uk: Іменовані комбінації вважаються псевдонімами. Псевдоніми не відображаються під час ітерації, але їх можна повернути під час пошуку за значенням.

source: Another important difference between :class:`IntFlag` and :class:`Enum` is that if no flags are set (the value is 0), its boolean evaluation is :data:`False`::
uk: Ще одна важлива відмінність між :class:`IntFlag` і :class:`Enum` полягає в тому, що якщо не встановлено жодного прапора (значення дорівнює 0), його логічна оцінка буде :data:`False`::

source: Because :class:`IntFlag` members are also subclasses of :class:`int` they can be combined with them (but may lose :class:`IntFlag` membership::
uk: Оскільки члени :class:`IntFlag` також є підкласами :class:`int`, їх можна поєднувати з ними (але вони можуть втратити членство :class:`IntFlag`::

source: The negation operator, ``~``, always returns an :class:`IntFlag` member with a positive value::
uk: Оператор заперечення, ``~``, завжди повертає член :class:`IntFlag` із позитивним значенням::

source: :class:`IntFlag` members can also be iterated over::
uk: Члени :class:`IntFlag` також можна повторювати:

source: Flag
uk: Прапор

source: The last variation is :class:`Flag`. Like :class:`IntFlag`, :class:`Flag` members can be combined using the bitwise operators (&, \|, ^, ~). Unlike :class:`IntFlag`, they cannot be combined with, nor compared against, any other :class:`Flag` enumeration, nor :class:`int`. While it is possible to specify the values directly it is recommended to use :class:`auto` as the value and let :class:`Flag` select an appropriate value.
uk: Останнім варіантом є :class:`Flag`. Подібно до :class:`IntFlag`, члени :class:`Flag` можна комбінувати за допомогою порозрядних операторів (&, \|, ^, ~). На відміну від :class:`IntFlag`, їх не можна комбінувати з будь-яким іншим переліком :class:`Flag` або :class:`int`, ані порівнювати з ними. Хоча можна вказати значення безпосередньо, рекомендується використовувати :class:`auto` як значення, а :class:`Flag` вибрати відповідне значення.

source: Like :class:`IntFlag`, if a combination of :class:`Flag` members results in no flags being set, the boolean evaluation is :data:`False`::
uk: Подібно до :class:`IntFlag`, якщо комбінація членів :class:`Flag` не призводить до встановлення прапорів, логічна оцінка буде :data:`False`::

source: Individual flags should have values that are powers of two (1, 2, 4, 8, ...), while combinations of flags won't::
uk: Індивідуальні прапори повинні мати значення, які є степенями двійки (1, 2, 4, 8, ...), тоді як комбінації прапорів не матимуть:

source: Giving a name to the "no flags set" condition does not change its boolean value::
uk: Присвоєння назви умові "прапори не встановлено" не змінює її логічного значення::

source: :class:`Flag` members can also be iterated over::
uk: Члени :class:`Flag` також можна повторювати:
