Repository: python/python-docs-uk
Catalog: howto/enum.po
Languages: uk

source: For the majority of new code, :class:`Enum` and :class:`Flag` are strongly recommended, since :class:`IntEnum` and :class:`IntFlag` break some semantic promises of an enumeration (by being comparable to integers, and thus by transitivity to other unrelated enumerations). :class:`IntEnum` and :class:`IntFlag` should be used only in cases where :class:`Enum` and :class:`Flag` will not do; for example, when integer constants are replaced with enumerations, or for interoperability with other systems.
uk: Для більшості нового коду наполегливо рекомендується використовувати :class:`Enum` і :class:`Flag`, оскільки :class:`IntEnum` і :class:`IntFlag` порушують деякі семантичні обіцянки перерахування (через їх порівняння з цілі числа, і, таким чином, через перехідність до інших непов’язаних перерахувань). :class:`IntEnum` і :class:`IntFlag` слід використовувати лише у випадках, коли :class:`Enum` і :class:`Flag` не підходять; наприклад, коли цілі константи замінюються перерахуваннями або для взаємодії з іншими системами.

source: Others
uk: інші

source: While :class:`IntEnum` is part of the :mod:`enum` module, it would be very simple to implement independently::
uk: Хоча :class:`IntEnum` є частиною модуля :mod:`enum`, його було б дуже просто реалізувати незалежно:

source: Some rules:
uk: Деякі правила:

source: When subclassing :class:`Enum`, mix-in types must appear before :class:`Enum` itself in the sequence of bases, as in the :class:`IntEnum` example above.
uk: Під час створення підкласу :class:`Enum` змішані типи повинні з’являтися перед самим :class:`Enum` у послідовності основ, як у прикладі :class:`IntEnum` вище.

source: While :class:`Enum` can have members of any type, once you mix in an additional type, all the members must have values of that type, e.g. :class:`int` above. This restriction does not apply to mix-ins which only add methods and don't specify another type.
uk: Хоча :class:`Enum` може мати члени будь-якого типу, коли ви додаєте додатковий тип, усі члени повинні мати значення цього типу, наприклад. :class:`int` вище. Це обмеження не стосується змішувань, які лише додають методи і не вказують інший тип.

source: When another data type is mixed in, the :attr:`value` attribute is *not the same* as the enum member itself, although it is equivalent and will compare equal.
uk: Коли додається інший тип даних, атрибут :attr:`value` *не такий самий*, як сам член переліку, хоча він еквівалентний і порівнюватиметься рівним.

source: When to use :meth:`__new__` vs. :meth:`__init__`
uk: Коли використовувати :meth:`__new__` проти :meth:`__init__`

source: :meth:`__new__` must be used whenever you want to customize the actual value of the :class:`Enum` member. Any other modifications may go in either :meth:`__new__` or :meth:`__init__`, with :meth:`__init__` being preferred.
uk: :meth:`__new__` потрібно використовувати щоразу, коли ви хочете налаштувати фактичне значення члена :class:`Enum`. Будь-які інші модифікації можна вносити в :meth:`__new__` або :meth:`__init__`, причому перевага віддається :meth:`__init__`.

source: For example, if you want to pass several items to the constructor, but only want one of them to be the value::
uk: Наприклад, якщо ви хочете передати кілька елементів у конструктор, але хочете, щоб лише один із них був значенням::

source: Finer Points
uk: Більш тонкі точки

source: Supported ``__dunder__`` names
uk: Підтримувані імена ``__dunder__``

source: :attr:`__members__` is a read-only ordered mapping of ``member_name``:``member`` items. It is only available on the class.
uk: :attr:`__members__` — це впорядковане зіставлення елементів ``member_name``:``member`` лише для читання. Це доступно лише в класі.

source: :meth:`__new__`, if specified, must create and return the enum members; it is also a very good idea to set the member's :attr:`_value_` appropriately. Once all the members are created it is no longer used.
uk: :meth:`__new__`, якщо вказано, має створити та повернути члени enum; також дуже гарна ідея належним чином встановити :attr:`_value_` члена. Після створення всіх учасників він більше не використовується.

source: Supported ``_sunder_`` names
uk: Підтримувані імена ``_sunder_``

source: ``_name_`` -- name of the member
uk: ``_name_`` -- ім'я учасника

source: ``_value_`` -- value of the member; can be set / modified in ``__new__``
uk: ``_value_`` -- значення члена; можна встановити/змінити в ``__new__``

source: ``_missing_`` -- a lookup function used when a value is not found; may be overridden
uk: ``_missing_`` -- функція пошуку, яка використовується, коли значення не знайдено; може бути перевизначено

source: ``_ignore_`` -- a list of names, either as a :class:`list` or a :class:`str`, that will not be transformed into members, and will be removed from the final class
uk: ``_ignore_`` -- список імен у вигляді :class:`list` або :class:`str`, які не будуть перетворені в члени та будуть видалені з остаточного класу

source: ``_order_`` -- used in Python 2/3 code to ensure member order is consistent (class attribute, removed during class creation)
uk: ``_order_`` -- використовується в коді Python 2/3 для забезпечення узгодженості порядку членів (атрибут класу, видалений під час створення класу)

source: ``_generate_next_value_`` -- used by the `Functional API`_ and by :class:`auto` to get an appropriate value for an enum member; may be overridden
uk: ``_generate_next_value_`` -- використовується `Functional API`_ і :class:`auto` для отримання відповідного значення для члена enum; може бути перевизначено

source: For standard :class:`Enum` classes the next value chosen is the last value seen incremented by one.
uk: Для стандартних класів :class:`Enum` наступним вибраним значенням є останнє значення, збільшене на одиницю.

source: For :class:`Flag` classes the next value chosen will be the next highest power-of-two, regardless of the last value seen.
uk: Для класів :class:`Flag` наступним вибраним значенням буде наступний найвищий ступінь двох, незалежно від останнього побаченого значення.

source: ``_ignore_``
uk: ``_ігнорувати_``

source: To help keep Python 2 / Python 3 code in sync an :attr:`_order_` attribute can be provided. It will be checked against the actual order of the enumeration and raise an error if the two do not match::
uk: Щоб підтримувати синхронізацію коду Python 2 / Python 3, можна надати атрибут :attr:`_order_`. Його буде перевірено на фактичний порядок перерахування та викличе помилку, якщо вони не збігаються:

source: In Python 2 code the :attr:`_order_` attribute is necessary as definition order is lost before it can be recorded.
uk: У коді Python 2 атрибут :attr:`_order_` необхідний, оскільки порядок визначення втрачається, перш ніж його можна записати.

source: ``Enum`` member type
uk: Тип члена ``Enum``

source: Creating members that are mixed with other data types
uk: Створення елементів, змішаних з іншими типами даних

source: Boolean value of ``Enum`` classes and members
uk: Логічне значення класів і членів ``Enum``

source: Enum classes that are mixed with non-:class:`Enum` types (such as :class:`int`, :class:`str`, etc.) are evaluated according to the mixed-in type's rules; otherwise, all members evaluate as :data:`True`. To make your own enum's boolean evaluation depend on the member's value add the following to your class::
uk: Класи Enum, змішані з типами не :class:`Enum` (такими як :class:`int`, :class:`str` тощо), оцінюються відповідно до правил змішаного типу; інакше всі члени оцінюються як :data:`True`. Щоб зробити логічне обчислення вашого власного переліку залежним від значення члена, додайте наступне до свого класу:

source: Plain :class:`Enum` classes always evaluate as :data:`True`.
uk: Класи Plain :class:`Enum` завжди оцінюються як :data:`True`.

source: ``Enum`` classes with methods
uk: ``Enum`` класи з методами

source: Combining members of ``Flag``
uk: Об'єднання членів ``Прапора``

source: Iterating over a combination of :class:`Flag` members will only return the members that are comprised of a single bit::
uk: Ітерація по комбінації елементів :class:`Flag` поверне лише елементи, які складаються з одного біта::

source: ``Flag`` and ``IntFlag`` minutia
uk: Деталі ``Flag`` і ``IntFlag``

source: Using the following snippet for our examples::
uk: Використовуючи наступний фрагмент для наших прикладів:

source: the following are true:
uk: вірно наступне:

source: single-bit flags are canonical
uk: однобітові прапори є канонічними

source: multi-bit and zero-bit flags are aliases
uk: багатобітні та нульові бітові прапорці є псевдонімами

source: only canonical flags are returned during iteration::
uk: під час ітерації повертаються лише канонічні прапори::

source: negating a flag or flag set returns a new flag/flag set with the corresponding positive integer value::
uk: заперечення прапора або набору прапорів повертає новий прапор/набір прапорів із відповідним додатним цілим значенням::

source: names of pseudo-flags are constructed from their members' names::
uk: імена псевдо-прапорів складаються з імен їх членів::

source: multi-bit flags, aka aliases, can be returned from operations::
uk: багатобітові прапорці, або псевдоніми, можуть бути повернуті з операцій::

source: There is a new boundary mechanism that controls how out-of-range / invalid bits are handled: ``STRICT``, ``CONFORM``, ``EJECT``, and ``KEEP``:
uk: Існує новий граничний механізм, який контролює, як обробляються біти за межами діапазону/недійсні: ``STRICT``, ``CONFORM``, ``EJECT`` і ``KEEP``:

source: STRICT --> raises an exception when presented with invalid values
uk: STRICT --> створює виняток, якщо надає недійсні значення

source: CONFORM --> discards any invalid bits
uk: CONFORM --> відкидає всі недійсні біти

source: EJECT --> lose Flag status and become a normal int with the given value
uk: EJECT --> втрачає статус прапора та стає звичайним int із заданим значенням

source: KEEP --> keep the extra bits
uk: KEEP --> збережіть зайві біти

source: keeps Flag status and extra bits
uk: зберігає статус прапора та додаткові біти

source: extra bits do not show up in iteration
uk: зайві біти не відображаються в ітерації

source: extra bits do show up in repr() and str()
uk: додаткові біти з’являються в repr() і str()

source: The default for Flag is ``STRICT``, the default for ``IntFlag`` is ``EJECT``, and the default for ``_convert_`` is ``KEEP`` (see ``ssl.Options`` for an example of when ``KEEP`` is needed).
uk: Типовим значенням для прапора є ``STRICT``, значенням за замовчуванням ``IntFlag`` є ``EJECT``, а за умовчанням для ``_convert_`` є ``KEEP`` (див. ``ssl.Options`` для прикладу того, коли потрібен ``KEEP``).

source: How are Enums different?
uk: Чим відрізняються Enum?

source: Enums have a custom metaclass that affects many aspects of both derived :class:`Enum` classes and their instances (members).
uk: Переліки мають спеціальний метаклас, який впливає на багато аспектів як похідних класів :class:`Enum`, так і їх екземплярів (членів).

source: Enum Classes
uk: Класи Enum

source: The :class:`EnumType` metaclass is responsible for providing the :meth:`__contains__`, :meth:`__dir__`, :meth:`__iter__` and other methods that allow one to do things with an :class:`Enum` class that fail on a typical class, such as `list(Color)` or `some_enum_var in Color`. :class:`EnumType` is responsible for ensuring that various other methods on the final :class:`Enum` class are correct (such as :meth:`__new__`, :meth:`__getnewargs__`, :meth:`__str__` and :meth:`__repr__`).
uk: Метаклас :class:`EnumType` відповідає за надання :meth:`__contains__`, :meth:`__dir__`, :meth:`__iter__` та інших методів, які дозволяють виконувати дії з :class:`Enum` які не виконуються у типовому класі, наприклад `list(Color)` або `some_enum_var in Color`. :class:`EnumType` відповідає за те, щоб різноманітні інші методи остаточного класу :class:`Enum` були правильними (наприклад, :meth:`__new__`, :meth:`__getnewargs__`, :meth:`__str__` та :meth:`__repr__`).

source: Enum Members (aka instances)
uk: Члени Enum (також відомі як екземпляри)

source: The most interesting thing about enum members is that they are singletons. :class:`EnumType` creates them all while it is creating the enum class itself, and then puts a custom :meth:`__new__` in place to ensure that no new ones are ever instantiated by returning only the existing member instances.
uk: Найцікавіше в членах enum те, що вони є одиночними. :class:`EnumType` створює їх усі під час створення самого класу enum, а потім розміщує спеціальний :meth:`__new__`, щоб гарантувати, що нові екземпляри ніколи не створюватимуться, повертаючи лише наявні екземпляри членів.

source: While :class:`Enum`, :class:`IntEnum`, :class:`StrEnum`, :class:`Flag`, and :class:`IntFlag` are expected to cover the majority of use-cases, they cannot cover them all. Here are recipes for some different types of enumerations that can be used directly, or as examples for creating one's own.
uk: Хоча очікується, що :class:`Enum`, :class:`IntEnum`, :class:`StrEnum`, :class:`Flag` і :class:`IntFlag` охоплять більшість варіантів використання, вони не можуть охопити їх усіх. Ось рецепти для деяких різних типів перерахувань, які можна використовувати безпосередньо або як приклади для створення власних.

source: Omitting values
uk: Пропуск значень

source: use instances of :class:`auto` for the value
uk: використовувати екземпляри :class:`auto` для значення

source: use instances of :class:`object` as the value
uk: використовуйте екземпляри :class:`object` як значення

source: use a descriptive string as the value
uk: використовуйте описовий рядок як значення

source: use a tuple as the value and a custom :meth:`__new__` to replace the tuple with an :class:`int` value
uk: використовуйте кортеж як значення та спеціальний :meth:`__new__`, щоб замінити кортеж на значення :class:`int`

source: Using any of these methods signifies to the user that these values are not important, and also enables one to add, remove, or reorder members without having to renumber the remaining members.
uk: Використання будь-якого з цих методів означає для користувача, що ці значення не є важливими, а також дозволяє додавати, видаляти або змінювати порядок членів без необхідності перенумеровувати решту членів.

source: Using :class:`auto`
uk: Використання :class:`auto`

source: Using :class:`auto` would look like::
uk: Використання :class:`auto` виглядатиме так::

source: Using :class:`object`
uk: Використання :class:`object`

source: Using :class:`object` would look like::
uk: Використання :class:`object` виглядатиме так::

source: Using a descriptive string
uk: Використання описового рядка

source: Using a string as the value would look like::
uk: Використання рядка як значення виглядатиме так::

source: Using a custom :meth:`__new__`
uk: Використання спеціального :meth:`__new__`

source: Using an auto-numbering :meth:`__new__` would look like::
uk: Використання автоматичної нумерації :meth:`__new__` виглядатиме так::

source: To make a more general purpose ``AutoNumber``, add ``*args`` to the signature::
uk: Щоб зробити ``AutoNumber`` більш загального призначення, додайте ``*args`` до підпису::

source: Then when you inherit from ``AutoNumber`` you can write your own ``__init__`` to handle any extra arguments::
uk: Тоді, коли ви успадкуєте від ``AutoNumber``, ви можете написати свій власний ``__init__`` для обробки будь-яких додаткових аргументів::

source: The :meth:`__new__` method, if defined, is used during creation of the Enum members; it is then replaced by Enum's :meth:`__new__` which is used after class creation for lookup of existing members.
uk: Метод :meth:`__new__`, якщо його визначено, використовується під час створення елементів Enum; потім його замінює :meth:`__new__` Enum, який використовується після створення класу для пошуку існуючих членів.

source: An ordered enumeration that is not based on :class:`IntEnum` and so maintains the normal :class:`Enum` invariants (such as not being comparable to other enumerations)::
uk: Упорядковане перерахування, яке не базується на :class:`IntEnum` і тому підтримує звичайні інваріанти :class:`Enum` (наприклад, не порівнюється з іншими переліками):

source: Raises an error if a duplicate member name is found instead of creating an alias::
uk: Викликає помилку, якщо замість створення псевдоніма знайдено повторюване ім’я члена::

source: This is a useful example for subclassing Enum to add or change other behaviors as well as disallowing aliases. If the only desired change is disallowing aliases, the :func:`unique` decorator can be used instead.
uk: Це корисний приклад для підкласу Enum для додавання або зміни іншої поведінки, а також заборони псевдонімів. Якщо єдиною бажаною зміною є заборона псевдонімів, натомість можна використати декоратор :func:`unique`.

source: Planet
uk: Планета

source: TimePeriod
uk: Період часу

source: An example to show the :attr:`_ignore_` attribute in use::
uk: Приклад використання атрибута :attr:`_ignore_`::

source: Subclassing EnumType
uk: Підклас EnumType

source: While most enum needs can be met by customizing :class:`Enum` subclasses, either with class decorators or custom functions, :class:`EnumType` can be subclassed to provide a different Enum experience.
uk: У той час як більшість потреб enum можна задовольнити, налаштувавши підкласи :class:`Enum`, або за допомогою декораторів класів, або користувацьких функцій, :class:`EnumType` можна створити підкласи, щоб забезпечити інший досвід Enum.
