Repository: python/python-docs-uk
Catalog: howto/functional.po
Languages: uk

source: Functional Programming HOWTO
uk: Функціональне програмування HOWTO

source: Author
uk: Автор

source: Release
uk: Реліз

source: In this document, we'll take a tour of Python's features suitable for implementing programs in a functional style. After an introduction to the concepts of functional programming, we'll look at language features such as :term:`iterator`\s and :term:`generator`\s and relevant library modules such as :mod:`itertools` and :mod:`functools`.
uk: У цьому документі ми ознайомимося з функціями Python, придатними для реалізації програм у функціональному стилі. Після вступу до концепцій функціонального програмування ми розглянемо функції мови, такі як :term:`iterator`\s і :term:`generator`\s, а також відповідні бібліотечні модулі, такі як :mod:`itertools` і :mod:`functools`.

source: Introduction
uk: вступ

source: This section explains the basic concept of functional programming; if you're just interested in learning about Python language features, skip to the next section on :ref:`functional-howto-iterators`.
uk: У цьому розділі пояснюється основна концепція функціонального програмування; якщо вам просто цікаво дізнатися про функції мови Python, перейдіть до наступного розділу :ref:`functional-howto-iterators`.

source: Programming languages support decomposing problems in several different ways:
uk: Мови програмування підтримують декомпозицію проблем кількома різними способами:

source: Most programming languages are **procedural**: programs are lists of instructions that tell the computer what to do with the program's input. C, Pascal, and even Unix shells are procedural languages.
uk: Більшість мов програмування є **процедурними**: програми — це списки інструкцій, які вказують комп’ютеру, що робити з вхідними даними програми. C, Pascal і навіть оболонки Unix є процедурними мовами.

source: In **declarative** languages, you write a specification that describes the problem to be solved, and the language implementation figures out how to perform the computation efficiently. SQL is the declarative language you're most likely to be familiar with; a SQL query describes the data set you want to retrieve, and the SQL engine decides whether to scan tables or use indexes, which subclauses should be performed first, etc.
uk: У **декларативних** мовах ви пишете специфікацію, яка описує проблему, яку потрібно вирішити, а реалізація мови визначає, як виконати обчислення ефективно. SQL — це декларативна мова, з якою ви, швидше за все, знайомі; SQL-запит описує набір даних, який ви хочете отримати, і механізм SQL вирішує, сканувати таблиці чи використовувати індекси, які підпункти слід виконати першими тощо.

source: **Object-oriented** programs manipulate collections of objects. Objects have internal state and support methods that query or modify this internal state in some way. Smalltalk and Java are object-oriented languages. C++ and Python are languages that support object-oriented programming, but don't force the use of object-oriented features.
uk: **Об’єктно-орієнтовані** програми маніпулюють колекціями об’єктів. Об’єкти мають внутрішній стан і підтримують методи, які певним чином запитують або змінюють цей внутрішній стан. Smalltalk і Java є об'єктно-орієнтованими мовами. C++ і Python — це мови, які підтримують об’єктно-орієнтоване програмування, але не примусово використовують об’єктно-орієнтовані функції.

source: **Functional** programming decomposes a problem into a set of functions. Ideally, functions only take inputs and produce outputs, and don't have any internal state that affects the output produced for a given input. Well-known functional languages include the ML family (Standard ML, OCaml, and other variants) and Haskell.
uk: **Функціональне** програмування розкладає проблему на набір функцій. В ідеалі функції лише приймають вхідні дані та виробляють виходи, і не мають жодного внутрішнього стану, який впливає на вихідні дані, отримані для даного вхідного елемента. Добре відомі функціональні мови включають сімейство ML (Standard ML, OCaml та інші варіанти) і Haskell.

source: The designers of some computer languages choose to emphasize one particular approach to programming. This often makes it difficult to write programs that use a different approach. Other languages are multi-paradigm languages that support several different approaches. Lisp, C++, and Python are multi-paradigm; you can write programs or libraries that are largely procedural, object-oriented, or functional in all of these languages. In a large program, different sections might be written using different approaches; the GUI might be object-oriented while the processing logic is procedural or functional, for example.
uk: Розробники деяких комп’ютерних мов вирішують наголосити на одному конкретному підході до програмування. Це часто ускладнює написання програм, які використовують інший підхід. Інші мови є мовами з кількома парадигмами, які підтримують кілька різних підходів. Lisp, C++ і Python є мультипарадигмальними; ви можете писати програми або бібліотеки, які в основному є процедурними, об'єктно-орієнтованими або функціональними на всіх цих мовах. У великій програмі різні розділи можуть бути написані з використанням різних підходів; GUI може бути об'єктно-орієнтованим, тоді як логіка обробки є процедурною або функціональною, наприклад.

source: In a functional program, input flows through a set of functions. Each function operates on its input and produces some output. Functional style discourages functions with side effects that modify internal state or make other changes that aren't visible in the function's return value. Functions that have no side effects at all are called **purely functional**. Avoiding side effects means not using data structures that get updated as a program runs; every function's output must only depend on its input.
uk: У функціональній програмі введення проходить через набір функцій. Кожна функція працює зі своїм входом і видає певний результат. Функціональний стиль не заохочує функції з побічними ефектами, які змінюють внутрішній стан або вносять інші зміни, які не видно у значенні, що повертається функцією. Функції, які взагалі не мають побічних ефектів, називаються **чисто функціональними**. Уникати побічних ефектів означає не використовувати структури даних, які оновлюються під час виконання програми; кожен вихід функції повинен залежати лише від її входу.

source: Some languages are very strict about purity and don't even have assignment statements such as ``a=3`` or ``c = a + b``, but it's difficult to avoid all side effects, such as printing to the screen or writing to a disk file. Another example is a call to the :func:`print` or :func:`time.sleep` function, neither of which returns a useful value. Both are called only for their side effects of sending some text to the screen or pausing execution for a second.
uk: Деякі мови дуже суворі щодо чистоти й навіть не мають операторів присвоєння, таких як ``a=3`` або ``c = a + b``, але важко уникнути всіх побічних ефектів, таких як друк на екрані або запис у файл диска. Іншим прикладом є виклик функції :func:`print` або :func:`time.sleep`, жодна з яких не повертає корисне значення. Обидва викликаються лише через побічні ефекти надсилання тексту на екран або призупинення виконання на секунду.

source: Python programs written in functional style usually won't go to the extreme of avoiding all I/O or all assignments; instead, they'll provide a functional-appearing interface but will use non-functional features internally. For example, the implementation of a function will still use assignments to local variables, but won't modify global variables or have other side effects.
uk: Програми на Python, написані у функціональному стилі, зазвичай не йдуть до крайнощів, щоб уникнути всього вводу-виводу або всіх призначень; замість цього вони забезпечуватимуть функціональний інтерфейс, але використовуватимуть нефункціональні функції всередині. Наприклад, реалізація функції все одно використовуватиме призначення локальним змінним, але не змінюватиме глобальні змінні чи матиме інші побічні ефекти.

source: Functional programming can be considered the opposite of object-oriented programming. Objects are little capsules containing some internal state along with a collection of method calls that let you modify this state, and programs consist of making the right set of state changes. Functional programming wants to avoid state changes as much as possible and works with data flowing between functions. In Python you might combine the two approaches by writing functions that take and return instances representing objects in your application (e-mail messages, transactions, etc.).
uk: Функціональне програмування можна вважати протилежністю об'єктно-орієнтованого програмування. Об’єкти — це маленькі капсули, що містять певний внутрішній стан разом із набором викликів методів, які дозволяють змінювати цей стан, а програми складаються із внесення правильних змін стану. Функціональне програмування хоче якомога більше уникати змін стану та працює з потоком даних між функціями. У Python ви можете поєднати два підходи, написавши функції, які приймають і повертають екземпляри, що представляють об’єкти у вашій програмі (повідомлення електронної пошти, транзакції тощо).

source: Functional design may seem like an odd constraint to work under. Why should you avoid objects and side effects? There are theoretical and practical advantages to the functional style:
uk: Функціональний дизайн може здатися дивним обмеженням для роботи. Чому слід уникати предметів і побічних ефектів? Існують теоретичні та практичні переваги функціонального стилю:

source: Formal provability.
uk: Формальна доказовість.

source: Modularity.
uk: Модульність.

source: Composability.
uk: Композиційність.

source: Ease of debugging and testing.
uk: Простота налагодження та тестування.

source: Formal provability
uk: Формальна доказовість

source: A theoretical benefit is that it's easier to construct a mathematical proof that a functional program is correct.
uk: Теоретична перевага полягає в тому, що легше побудувати математичний доказ правильності функціональної програми.

source: For a long time researchers have been interested in finding ways to mathematically prove programs correct. This is different from testing a program on numerous inputs and concluding that its output is usually correct, or reading a program's source code and concluding that the code looks right; the goal is instead a rigorous proof that a program produces the right result for all possible inputs.
uk: Довгий час дослідники були зацікавлені в пошуку способів математичної перевірки правильності програм. Це відрізняється від тестування програми на численних вхідних даних і висновку, що її вихід зазвичай правильний, або читання вихідного коду програми та висновку, що код виглядає правильно; натомість метою є суворий доказ того, що програма дає правильний результат для всіх можливих вхідних даних.

source: The technique used to prove programs correct is to write down **invariants**, properties of the input data and of the program's variables that are always true. For each line of code, you then show that if invariants X and Y are true **before** the line is executed, the slightly different invariants X' and Y' are true **after** the line is executed. This continues until you reach the end of the program, at which point the invariants should match the desired conditions on the program's output.
uk: Техніка, яка використовується для підтвердження правильності програм, полягає в записі **інваріантів**, властивостей вхідних даних і змінних програми, які завжди є істинними. Для кожного рядка коду ви потім показуєте, що якщо інваріанти X і Y істинні **до** виконання рядка, дещо інші інваріанти X' і Y' є істинними **після** виконання рядка. Це продовжується, доки ви не досягнете кінця програми, після чого інваріанти повинні відповідати бажаним умовам на виході програми.

source: Functional programming's avoidance of assignments arose because assignments are difficult to handle with this technique; assignments can break invariants that were true before the assignment without producing any new invariants that can be propagated onward.
uk: Уникання присвоєння у функціональному програмуванні виникло тому, що присвоєння важко обробляти за допомогою цієї техніки; призначення можуть порушувати інваріанти, які були істинними до призначення, не створюючи жодних нових інваріантів, які можна поширювати далі.

source: Unfortunately, proving programs correct is largely impractical and not relevant to Python software. Even trivial programs require proofs that are several pages long; the proof of correctness for a moderately complicated program would be enormous, and few or none of the programs you use daily (the Python interpreter, your XML parser, your web browser) could be proven correct. Even if you wrote down or generated a proof, there would then be the question of verifying the proof; maybe there's an error in it, and you wrongly believe you've proved the program correct.
uk: На жаль, перевірка правильності програм в основному непрактична і не стосується програмного забезпечення Python. Навіть тривіальні програми вимагають доказів довжиною кілька сторінок; докази правильності для помірно складної програми були б величезними, і мало або жодна з програм, якими ви користуєтеся щодня (інтерпретатор Python, ваш аналізатор XML, ваш веб-браузер), може бути доведена правильною. Навіть якщо ви записали або згенерували доказ, тоді виникне питання перевірки доказу; можливо, у ньому є помилка, і ви помилково вважаєте, що довели правильність програми.

source: Modularity
uk: Модульність

source: A more practical benefit of functional programming is that it forces you to break apart your problem into small pieces. Programs are more modular as a result. It's easier to specify and write a small function that does one thing than a large function that performs a complicated transformation. Small functions are also easier to read and to check for errors.
uk: Більш практична перевага функціонального програмування полягає в тому, що воно змушує вас розбивати проблему на дрібні частини. В результаті програми стають більш модульними. Простіше вказати та написати невелику функцію, яка виконує щось одне, ніж велику функцію, яка виконує складне перетворення. Невеликі функції також легше читати та перевіряти на наявність помилок.

source: Ease of debugging and testing
uk: Простота налагодження та тестування

source: Testing and debugging a functional-style program is easier.
uk: Тестування та налагодження програми у функціональному стилі легше.

source: Debugging is simplified because functions are generally small and clearly specified. When a program doesn't work, each function is an interface point where you can check that the data are correct. You can look at the intermediate inputs and outputs to quickly isolate the function that's responsible for a bug.
uk: Налагодження спрощене, оскільки функції, як правило, невеликі та чітко визначені. Коли програма не працює, кожна функція є точкою інтерфейсу, де можна перевірити правильність даних. Ви можете переглянути проміжні входи та виходи, щоб швидко виділити функцію, яка є відповідальною за помилку.

source: Testing is easier because each function is a potential subject for a unit test. Functions don't depend on system state that needs to be replicated before running a test; instead you only have to synthesize the right input and then check that the output matches expectations.
uk: Тестування легше, тому що кожна функція є потенційним предметом модульного тесту. Функції не залежать від стану системи, який потрібно відтворити перед виконанням тесту; натомість вам потрібно лише синтезувати правильні вхідні дані, а потім перевірити, чи результат відповідає очікуванням.

source: Composability
uk: Композиційність

source: As you work on a functional-style program, you'll write a number of functions with varying inputs and outputs. Some of these functions will be unavoidably specialized to a particular application, but others will be useful in a wide variety of programs. For example, a function that takes a directory path and returns all the XML files in the directory, or a function that takes a filename and returns its contents, can be applied to many different situations.
uk: Працюючи над програмою функціонального стилю, ви напишете ряд функцій із різними входами та виходами. Деякі з цих функцій неминуче будуть спеціалізовані для конкретної програми, але інші будуть корисні в широкому спектрі програм. Наприклад, функцію, яка приймає шлях до каталогу та повертає всі файли XML у каталозі, або функцію, яка приймає ім’я файлу та повертає його вміст, можна застосувати до багатьох різних ситуацій.

source: Over time you'll form a personal library of utilities. Often you'll assemble new programs by arranging existing functions in a new configuration and writing a few functions specialized for the current task.
uk: З часом ви сформуєте особисту бібліотеку утиліт. Часто ви збираєте нові програми, організовуючи існуючі функції в новій конфігурації та написавши кілька функцій, спеціалізованих для поточного завдання.

source: Iterators
uk: Ітератори

source: I'll start by looking at a Python language feature that's an important foundation for writing functional-style programs: iterators.
uk: Я почну з вивчення функції мови Python, яка є важливою основою для написання програм у функціональному стилі: ітератори.

source: An iterator is an object representing a stream of data; this object returns the data one element at a time. A Python iterator must support a method called :meth:`~iterator.__next__` that takes no arguments and always returns the next element of the stream. If there are no more elements in the stream, :meth:`~iterator.__next__` must raise the :exc:`StopIteration` exception. Iterators don't have to be finite, though; it's perfectly reasonable to write an iterator that produces an infinite stream of data.
uk: Ітератор - це об'єкт, що представляє потік даних; цей об’єкт повертає дані по одному елементу за раз. Ітератор Python має підтримувати метод під назвою :meth:`~iterator.__next__`, який не приймає аргументів і завжди повертає наступний елемент потоку. Якщо в потоці більше немає елементів, :meth:`~iterator.__next__` має викликати виняток :exc:`StopIteration`. Проте ітератори не обов’язково мають бути кінцевими; цілком розумно написати ітератор, який створює нескінченний потік даних.

source: The built-in :func:`iter` function takes an arbitrary object and tries to return an iterator that will return the object's contents or elements, raising :exc:`TypeError` if the object doesn't support iteration. Several of Python's built-in data types support iteration, the most common being lists and dictionaries. An object is called :term:`iterable` if you can get an iterator for it.
uk: Вбудована функція :func:`iter` приймає довільний об’єкт і намагається повернути ітератор, який повертатиме вміст або елементи об’єкта, викликаючи :exc:`TypeError`, якщо об’єкт не підтримує ітерацію. Кілька вбудованих типів даних Python підтримують ітерацію, найпоширенішими з яких є списки та словники. Об’єкт називається :term:`iterable`, якщо ви можете отримати для нього ітератор.

source: You can experiment with the iteration interface manually:
uk: Ви можете експериментувати з інтерфейсом ітерації вручну:

source: Python expects iterable objects in several different contexts, the most important being the :keyword:`for` statement. In the statement ``for X in Y``, Y must be an iterator or some object for which :func:`iter` can create an iterator. These two statements are equivalent::
uk: Python очікує ітерованих об’єктів у кількох різних контекстах, найважливішим з яких є оператор :keyword:`for`. У операторі ``для X в Y`` Y має бути ітератором або деяким об’єктом, для якого :func:`iter` може створити ітератор. Ці два твердження еквівалентні:

source: Iterators can be materialized as lists or tuples by using the :func:`list` or :func:`tuple` constructor functions:
uk: Ітератори можна матеріалізувати як списки або кортежі за допомогою функцій конструктора :func:`list` або :func:`tuple`:

source: Sequence unpacking also supports iterators: if you know an iterator will return N elements, you can unpack them into an N-tuple:
uk: Розпакування послідовності також підтримує ітератори: якщо ви знаєте, що ітератор поверне N елементів, ви можете розпакувати їх у N-кортеж:

source: Built-in functions such as :func:`max` and :func:`min` can take a single iterator argument and will return the largest or smallest element. The ``"in"`` and ``"not in"`` operators also support iterators: ``X in iterator`` is true if X is found in the stream returned by the iterator. You'll run into obvious problems if the iterator is infinite; :func:`max`, :func:`min` will never return, and if the element X never appears in the stream, the ``"in"`` and ``"not in"`` operators won't return either.
uk: Вбудовані функції, такі як :func:`max` і :func:`min`, можуть приймати один аргумент ітератора та повертати найбільший або найменший елемент. Оператори ``"in"`` і ``"not in"`` також підтримують ітератори: ``X в ітераторі`` є істинним, якщо X знайдено в потоці, повернутому ітератором. Ви зіткнетеся з очевидними проблемами, якщо ітератор нескінченний; :func:`max`, :func:`min` ніколи не повертаються, а якщо елемент X ніколи не з’являється в потоці, оператори ``"in"`` і ``"not in"`` не повертаються або.

source: Note that you can only go forward in an iterator; there's no way to get the previous element, reset the iterator, or make a copy of it. Iterator objects can optionally provide these additional capabilities, but the iterator protocol only specifies the :meth:`~iterator.__next__` method. Functions may therefore consume all of the iterator's output, and if you need to do something different with the same stream, you'll have to create a new iterator.
uk: Зауважте, що в ітераторі можна рухатися лише вперед; немає способу отримати попередній елемент, скинути ітератор або зробити його копію. Об’єкти-ітератори можуть додатково надавати ці додаткові можливості, але протокол ітераторів визначає лише метод :meth:`~iterator.__next__`. Тому функції можуть споживати весь вихід ітератора, і якщо вам потрібно зробити щось інше з тим самим потоком, вам доведеться створити новий ітератор.

source: Data Types That Support Iterators
uk: Типи даних, які підтримують ітератори

source: We've already seen how lists and tuples support iterators. In fact, any Python sequence type, such as strings, will automatically support creation of an iterator.
uk: Ми вже бачили, як списки та кортежі підтримують ітератори. Насправді будь-який тип послідовності Python, наприклад рядки, автоматично підтримуватиме створення ітератора.

source: Calling :func:`iter` on a dictionary returns an iterator that will loop over the dictionary's keys::
uk: Виклик :func:`iter` для словника повертає ітератор, який перебиратиме ключі словника::

source: Note that starting with Python 3.7, dictionary iteration order is guaranteed to be the same as the insertion order. In earlier versions, the behaviour was unspecified and could vary between implementations.
uk: Зауважте, що, починаючи з Python 3.7, порядок ітерацій словника гарантовано збігається з порядком вставки. У попередніх версіях поведінка була невизначеною та могла відрізнятися в різних реалізаціях.
