Repository: python/python-docs-uk
Catalog: howto/functional.po
Languages: uk

source: Version 0.30: Adds a section on the ``functional`` module written by Collin Winter; adds short section on the operator module; a few other edits.
uk: Версія 0.30: додано розділ про ``функціональний`` модуль, написаний Колліном Вінтером; додає короткий розділ про модуль оператора; кілька інших правок.

source: References
uk: Список літератури

source: General
uk: Загальний

source: https://en.wikipedia.org/wiki/Functional_programming: General Wikipedia entry describing functional programming.
uk: https://en.wikipedia.org/wiki/Functional_programming: загальний запис у Вікіпедії, що описує функціональне програмування.

source: https://en.wikipedia.org/wiki/Coroutine: Entry for coroutines.
uk: https://en.wikipedia.org/wiki/Coroutine: Запис для співпрограм.

source: https://en.wikipedia.org/wiki/Currying: Entry for the concept of currying.
uk: https://en.wikipedia.org/wiki/Currying: Початок поняття каррі.

source: Python-specific
uk: Специфічний для Python

source: Mertz also wrote a 3-part series of articles on functional programming for IBM's DeveloperWorks site; see `part 1 <https://developer.ibm.com/articles/l-prog/>`__, `part 2 <https://developer.ibm.com/tutorials/l-prog2/>`__, and `part 3 <https://developer.ibm.com/tutorials/l-prog3/>`__,
uk: Мерц також написав серію статей із 3 частин про функціональне програмування для сайту IBM DeveloperWorks; див. `частина 1 <https://developer.ibm.com/articles/l-prog/>`__, `частина 2 <https://developer.ibm.com/tutorials/l-prog2/>`__ та `частина 3 <https://developer.ibm.com/tutorials/l-prog3/>`__,

source: Python documentation
uk: Документація Python

source: Documentation for the :mod:`itertools` module.
uk: Документація для модуля :mod:`itertools`.

source: Documentation for the :mod:`functools` module.
uk: Документація для модуля :mod:`functools`.

source: Documentation for the :mod:`operator` module.
uk: Документація для модуля :mod:`operator`.

source: :pep:`289`: "Generator Expressions"
uk: :pep:`289`: "Генератор виразів"

source: :pep:`342`: "Coroutines via Enhanced Generators" describes the new generator features in Python 2.5.
uk: :pep:`342`: "Сопрограми через розширені генератори" описує нові функції генератора в Python 2.5.
