Repository: python/python-docs-uk
Catalog: howto/functional.po
Languages: uk

source: It doesn't construct an in-memory list and exhaust all the input iterators before returning; instead tuples are constructed and returned only if they're requested. (The technical term for this behaviour is `lazy evaluation <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)
uk: Він не створює список у пам’яті та не вичерпує всі ітератори введення перед поверненням; натомість кортежі створюються та повертаються лише за запитом. (Технічний термін для такої поведінки — `лінива оцінка <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)

source: This iterator is intended to be used with iterables that are all of the same length. If the iterables are of different lengths, the resulting stream will be the same length as the shortest iterable. ::
uk: Цей ітератор призначений для використання з ітераторами, які мають однакову довжину. Якщо ітератори мають різну довжину, результуючий потік буде такої ж довжини, як і найкоротший ітератор. ::

source: You should avoid doing this, though, because an element may be taken from the longer iterators and discarded. This means you can't go on to use the iterators further because you risk skipping a discarded element.
uk: Однак вам слід уникати цього, оскільки елемент може бути взято з довших ітераторів і відкинуто. Це означає, що ви не можете продовжувати використовувати ітератори, оскільки ризикуєте пропустити відкинутий елемент.

source: The itertools module
uk: Модуль itertools

source: The module's functions fall into a few broad classes:
uk: Функції модуля поділяються на кілька широких класів:

source: Functions that create a new iterator based on an existing iterator.
uk: Функції, які створюють новий ітератор на основі існуючого ітератора.

source: Functions for treating an iterator's elements as function arguments.
uk: Функції для обробки елементів ітератора як аргументів функції.

source: Functions for selecting portions of an iterator's output.
uk: Функції для вибору частин виводу ітератора.

source: A function for grouping an iterator's output.
uk: Функція для групування виводу ітератора.

source: Creating new iterators
uk: Створення нових ітераторів

source: :func:`itertools.count(start, step) <itertools.count>` returns an infinite stream of evenly spaced values. You can optionally supply the starting number, which defaults to 0, and the interval between numbers, which defaults to 1::
uk: :func:`itertools.count(start, step) <itertools.count>` повертає нескінченний потік рівномірно розподілених значень. Додатково можна вказати початкове число, яке за замовчуванням дорівнює 0, і інтервал між числами, який за замовчуванням дорівнює 1::

source: :func:`itertools.cycle(iter) <itertools.cycle>` saves a copy of the contents of a provided iterable and returns a new iterator that returns its elements from first to last. The new iterator will repeat these elements infinitely. ::
uk: :func:`itertools.cycle(iter) <itertools.cycle>` зберігає копію вмісту наданого ітератора та повертає новий ітератор, який повертає елементи від першого до останнього. Новий ітератор буде нескінченно повторювати ці елементи. ::

source: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` returns the provided element *n* times, or returns the element endlessly if *n* is not provided. ::
uk: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` повертає наданий елемент *n* разів або нескінченно повертає елемент, якщо *n* не надано. ::

source: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` takes an arbitrary number of iterables as input, and returns all the elements of the first iterator, then all the elements of the second, and so on, until all of the iterables have been exhausted. ::
uk: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` приймає довільну кількість ітераторів як вхідні дані та повертає всі елементи першого ітератора, потім усі елементи другого і так далі, доки усі ітерації вичерпано. ::

source: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` returns a stream that's a slice of the iterator. With a single *stop* argument, it will return the first *stop* elements. If you supply a starting index, you'll get *stop-start* elements, and if you supply a value for *step*, elements will be skipped accordingly. Unlike Python's string and list slicing, you can't use negative values for *start*, *stop*, or *step*. ::
uk: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` повертає потік, який є фрагментом ітератора. З одним аргументом *stop* він повертає перші елементи *stop*. Якщо ви вкажете початковий індекс, ви отримаєте елементи *stop-start*, а якщо ви вкажете значення для *step*, елементи будуть відповідно пропущені. На відміну від нарізки рядків і списків Python, ви не можете використовувати від’ємні значення для *start*, *stop* або *step*. ::

source: :func:`itertools.tee(iter, [n]) <itertools.tee>` replicates an iterator; it returns *n* independent iterators that will all return the contents of the source iterator. If you don't supply a value for *n*, the default is 2. Replicating iterators requires saving some of the contents of the source iterator, so this can consume significant memory if the iterator is large and one of the new iterators is consumed more than the others. ::
uk: :func:`itertools.tee(iter, [n]) <itertools.tee>` повторює ітератор; він повертає *n* незалежних ітераторів, які повертатимуть вміст вихідного ітератора. Якщо ви не вкажете значення для *n*, за замовчуванням буде 2. Реплікація ітераторів вимагає збереження частини вмісту вихідного ітератора, тому це може споживати значну кількість пам’яті, якщо ітератор великий і один із нових ітераторів споживається більше ніж інші. ::

source: Calling functions on elements
uk: Виклик функцій на елементах

source: The :mod:`operator` module contains a set of functions corresponding to Python's operators. Some examples are :func:`operator.add(a, b) <operator.add>` (adds two values), :func:`operator.ne(a, b) <operator.ne>` (same as ``a != b``), and :func:`operator.attrgetter('id') <operator.attrgetter>` (returns a callable that fetches the ``.id`` attribute).
uk: Модуль :mod:`operator` містить набір функцій, що відповідають операторам Python. Деякі приклади: :func:`operator.add(a, b) <operator.add>` (додає два значення), :func:`operator.ne(a, b) <operator.ne>` (те саме, що ``a != b``), і :func:`operator.attrgetter('id') <operator.attrgetter>` (повертає виклик, який отримує атрибут ``.id``).

source: :func:`itertools.starmap(func, iter) <itertools.starmap>` assumes that the iterable will return a stream of tuples, and calls *func* using these tuples as the arguments::
uk: :func:`itertools.starmap(func, iter) <itertools.starmap>` припускає, що iterable поверне потік кортежів, і викликає *func*, використовуючи ці кортежі як аргументи:

source: Selecting elements
uk: Вибір елементів

source: Another group of functions chooses a subset of an iterator's elements based on a predicate.
uk: Інша група функцій вибирає підмножину елементів ітератора на основі предикату.

source: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` is the opposite of :func:`filter`, returning all elements for which the predicate returns false::
uk: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` є протилежністю :func:`filter`, повертаючи всі елементи, для яких предикат повертає false::

source: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` returns elements for as long as the predicate returns true. Once the predicate returns false, the iterator will signal the end of its results. ::
uk: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` повертає елементи до тих пір, поки предикат повертає true. Як тільки предикат повертає false, ітератор сигналізує про закінчення своїх результатів. ::

source: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` discards elements while the predicate returns true, and then returns the rest of the iterable's results. ::
uk: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` відкидає елементи, поки предикат повертає true, а потім повертає решту результатів ітерації. ::

source: :func:`itertools.compress(data, selectors) <itertools.compress>` takes two iterators and returns only those elements of *data* for which the corresponding element of *selectors* is true, stopping whenever either one is exhausted::
uk: :func:`itertools.compress(data, selectors) <itertools.compress>` приймає два ітератори та повертає лише ті елементи *data*, для яких відповідний елемент *selectors* є істинним, зупиняючись щоразу, коли один із них вичерпується::

source: Combinatoric functions
uk: Комбінаторні функції

source: The :func:`itertools.combinations(iterable, r) <itertools.combinations>` returns an iterator giving all possible *r*-tuple combinations of the elements contained in *iterable*. ::
uk: :func:`itertools.combinations(iterable, r) <itertools.combinations>` повертає ітератор, що містить усі можливі *r*-кортежні комбінації елементів, що містяться в *iterable*. ::

source: The elements within each tuple remain in the same order as *iterable* returned them. For example, the number 1 is always before 2, 3, 4, or 5 in the examples above. A similar function, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, removes this constraint on the order, returning all possible arrangements of length *r*::
uk: Елементи в кожному кортежі залишаються в тому самому порядку, у якому їх повернув *iterable*. Наприклад, число 1 завжди стоїть перед 2, 3, 4 або 5 у наведених вище прикладах. Подібна функція, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, усуває це обмеження на порядок, повертаючи всі можливі розташування довжини *r*::

source: If you don't supply a value for *r* the length of the iterable is used, meaning that all the elements are permuted.
uk: Якщо ви не вказуєте значення для *r*, використовується довжина ітерованого, що означає, що всі елементи переставлені.

source: Note that these functions produce all of the possible combinations by position and don't require that the contents of *iterable* are unique::
uk: Зауважте, що ці функції створюють усі можливі комбінації за позицією та не вимагають, щоб вміст *iterable* був унікальним::

source: The identical tuple ``('a', 'a', 'b')`` occurs twice, but the two 'a' strings came from different positions.
uk: Ідентичний кортеж ``('a', 'a', 'b')`` зустрічається двічі, але два рядки 'a' походять з різних позицій.

source: The :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` function relaxes a different constraint: elements can be repeated within a single tuple. Conceptually an element is selected for the first position of each tuple and then is replaced before the second element is selected. ::
uk: Функція :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` послаблює інше обмеження: елементи можуть повторюватися в одному кортежі. Концептуально елемент вибирається для першої позиції кожного кортежу, а потім замінюється перед вибором другого елемента. ::

source: Grouping elements
uk: Групування елементів

source: The last function I'll discuss, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, is the most complicated. ``key_func(elem)`` is a function that can compute a key value for each element returned by the iterable. If you don't supply a key function, the key is simply each element itself.
uk: Остання функція, яку я розповім, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, є найскладнішою. ``key_func(elem)`` - це функція, яка може обчислити значення ключа для кожного елемента, повернутого ітерованим. Якщо ви не надаєте ключову функцію, ключем буде просто кожен елемент сам по собі.

source: :func:`~itertools.groupby` collects all the consecutive elements from the underlying iterable that have the same key value, and returns a stream of 2-tuples containing a key value and an iterator for the elements with that key.
uk: :func:`~itertools.groupby` збирає всі послідовні елементи з основного ітератора, які мають однакове значення ключа, і повертає потік 2-кортежів, що містить значення ключа та ітератор для елементів із цим ключем.

source: :func:`~itertools.groupby` assumes that the underlying iterable's contents will already be sorted based on the key. Note that the returned iterators also use the underlying iterable, so you have to consume the results of iterator-1 before requesting iterator-2 and its corresponding key.
uk: :func:`~itertools.groupby` припускає, що вміст базового ітератора вже буде відсортовано на основі ключа. Зверніть увагу, що повернуті ітератори також використовують базовий ітератор, тому ви повинні споживати результати ітератора-1 перед запитом ітератора-2 та його відповідного ключа.

source: The functools module
uk: Модуль functools

source: For programs written in a functional style, you'll sometimes want to construct variants of existing functions that have some of the parameters filled in. Consider a Python function ``f(a, b, c)``; you may wish to create a new function ``g(b, c)`` that's equivalent to ``f(1, b, c)``; you're filling in a value for one of ``f()``'s parameters. This is called "partial function application".
uk: Для програм, написаних у функціональному стилі, ви іноді захочете побудувати варіанти існуючих функцій із заповненими деякими параметрами. Розглянемо функцію Python ``f(a, b, c)``; ви можете створити нову функцію ``g(b, c)``, еквівалентну ``f(1, b, c)``; ви вводите значення для одного з параметрів ``f()``. Це називається "часткове застосування функції".

source: The constructor for :func:`~functools.partial` takes the arguments ``(function, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. The resulting object is callable, so you can just call it to invoke ``function`` with the filled-in arguments.
uk: Конструктор для :func:`~functools.partial` приймає аргументи ``(функція, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. Отриманий об’єкт можна викликати, тому ви можете просто викликати його, щоб викликати ``функцію`` із заповненими аргументами.

source: Here's a small but realistic example::
uk: Ось маленький, але реалістичний приклад:

source: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` cumulatively performs an operation on all the iterable's elements and, therefore, can't be applied to infinite iterables. *func* must be a function that takes two elements and returns a single value. :func:`functools.reduce` takes the first two elements A and B returned by the iterator and calculates ``func(A, B)``. It then requests the third element, C, calculates ``func(func(A, B), C)``, combines this result with the fourth element returned, and continues until the iterable is exhausted. If the iterable returns no values at all, a :exc:`TypeError` exception is raised. If the initial value is supplied, it's used as a starting point and ``func(initial_value, A)`` is the first calculation. ::
uk: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` кумулятивно виконує операцію над усіма елементами iterable і, отже, не може бути застосовано до нескінченних iterables. *func* має бути функцією, яка приймає два елементи та повертає одне значення. :func:`functools.reduce` бере перші два елементи A і B, повернуті ітератором, і обчислює ``func(A, B)``. Потім він запитує третій елемент, C, обчислює ``func(func(A, B), C)``, поєднує цей результат із повернутим четвертим елементом і продовжує роботу, доки не вичерпається ітерація. Якщо ітерація не повертає жодних значень, виникає виняток :exc:`TypeError`. Якщо вказано початкове значення, воно використовується як початкова точка, а ``func(initial_value, A)`` є першим обчисленням. ::

source: If you use :func:`operator.add` with :func:`functools.reduce`, you'll add up all the elements of the iterable. This case is so common that there's a special built-in called :func:`sum` to compute it:
uk: Якщо ви використовуєте :func:`operator.add` з :func:`functools.reduce`, ви додасте всі елементи iterable. Цей випадок настільки поширений, що для його обчислення існує спеціальна вбудована функція під назвою :func:`sum`:

source: For many uses of :func:`functools.reduce`, though, it can be clearer to just write the obvious :keyword:`for` loop::
uk: Однак для багатьох застосувань :func:`functools.reduce` може бути зрозумілішим просто написати очевидний :keyword:`for` цикл::

source: The operator module
uk: Операторський модуль

source: The :mod:`operator` module was mentioned earlier. It contains a set of functions corresponding to Python's operators. These functions are often useful in functional-style code because they save you from writing trivial functions that perform a single operation.
uk: Модуль :mod:`operator` згадувався раніше. Він містить набір функцій, що відповідають операторам Python. Ці функції часто корисні в коді функціонального стилю, оскільки вони позбавляють вас від написання тривіальних функцій, які виконують одну операцію.

source: Some of the functions in this module are:
uk: Деякі з функцій цього модуля:

source: Math operations: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...
uk: Математичні операції: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...

source: Logical operations: ``not_()``, ``truth()``.
uk: Логічні операції: ``not_()``, ``truth()``.

source: Bitwise operations: ``and_()``, ``or_()``, ``invert()``.
uk: Побітові операції: ``and_()``, ``or_()``, ``invert()``.

source: Comparisons: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()``, and ``ge()``.
uk: Порівняння: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()`` і ``ge()`` .

source: Object identity: ``is_()``, ``is_not()``.
uk: Ідентифікація об'єкта: ``is_()``, ``is_not()``.

source: Consult the operator module's documentation for a complete list.
uk: Зверніться до документації модуля оператора, щоб отримати повний список.

source: Small functions and the lambda expression
uk: Малі функції та лямбда-вираз

source: When writing functional-style programs, you'll often need little functions that act as predicates or that combine elements in some way.
uk: Під час написання програм у функціональному стилі вам часто знадобляться невеликі функції, які виконують роль предикатів або якимось чином поєднують елементи.

source: If there's a Python built-in or a module function that's suitable, you don't need to define a new function at all::
uk: Якщо є вбудована функція Python або функція модуля, яка підходить, вам взагалі не потрібно визначати нову функцію::

source: If the function you need doesn't exist, you need to write it. One way to write small functions is to use the :keyword:`lambda` expression. ``lambda`` takes a number of parameters and an expression combining these parameters, and creates an anonymous function that returns the value of the expression::
uk: Якщо потрібної вам функції не існує, її потрібно написати. Один із способів написання невеликих функцій — це використання виразу :keyword:`lambda`. ``лямбда`` приймає кілька параметрів і вираз, що поєднує ці параметри, і створює анонімну функцію, яка повертає значення виразу::

source: An alternative is to just use the ``def`` statement and define a function in the usual way::
uk: Альтернативою є просто використання оператора ``def`` і визначення функції звичайним способом::

source: Which alternative is preferable? That's a style question; my usual course is to avoid using ``lambda``.
uk: Яка альтернатива є кращою? Це питання стилю; мій звичайний курс — уникати використання ``лямбда``.

source: One reason for my preference is that ``lambda`` is quite limited in the functions it can define. The result has to be computable as a single expression, which means you can't have multiway ``if... elif... else`` comparisons or ``try... except`` statements. If you try to do too much in a ``lambda`` statement, you'll end up with an overly complicated expression that's hard to read. Quick, what's the following code doing? ::
uk: Однією з причин моїх переваг є те, що ``лямбда`` досить обмежена у функціях, які вона може визначати. Результат має бути обчислюваним як один вираз, що означає, що ви не можете мати багатосторонні порівняння ``if... elif... else`` або ``try... osim`` операторів. Якщо ви спробуєте зробити занадто багато в операторі ``лямбда``, ви отримаєте надто складний вираз, який важко прочитати. Швидко, що робить наступний код? ::

source: You can figure it out, but it takes time to disentangle the expression to figure out what's going on. Using a short nested ``def`` statements makes things a little bit better::
uk: Ви можете це зрозуміти, але потрібен час, щоб розібрати вираз, щоб зрозуміти, що відбувається. Використання коротких вкладених операторів ``def`` покращує ситуацію:

source: But it would be best of all if I had simply used a ``for`` loop::
uk: Але було б найкраще, якби я просто використав цикл ``for``::

source: Or the :func:`sum` built-in and a generator expression::
uk: Або вбудований :func:`sum` і вираз генератора::

source: Many uses of :func:`functools.reduce` are clearer when written as ``for`` loops.
uk: Багато способів використання :func:`functools.reduce` зрозуміліші, коли записуються як цикли ``for``.

source: Fredrik Lundh once suggested the following set of rules for refactoring uses of ``lambda``:
uk: Фредрік Лунд одного разу запропонував наступний набір правил для рефакторингу використання ``лямбда``:

source: Write a lambda function.
uk: Напишіть лямбда-функцію.

source: Write a comment explaining what the heck that lambda does.
uk: Напишіть коментар, пояснюючи, що в біса робить ця лямбда.

source: Study the comment for a while, and think of a name that captures the essence of the comment.
uk: Вивчіть коментар деякий час і придумайте назву, яка б передавала суть коментаря.

source: Convert the lambda to a def statement, using that name.
uk: Перетворіть лямбда-вираз на оператор def, використовуючи це ім’я.

source: Remove the comment.
uk: Видалити коментар.

source: I really like these rules, but you're free to disagree about whether this lambda-free style is better.
uk: Мені дуже подобаються ці правила, але ви можете не погоджуватися щодо того, чи цей стиль без лямбда кращий.

source: Revision History and Acknowledgements
uk: Історія переглядів і подяки

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.
uk: Автор хотів би подякувати наступним особам за пропозиції, виправлення та допомогу з різними чернетками цієї статті: Іен Бікінґ, Нік Коглан, Нік Еффорд, Реймонд Геттінгер, Джим Джеветт, Майк Крелл, Леандро Ламейро, Юссі Салмела, Коллін Вінтер, Блейк Вінтон.

source: Version 0.1: posted June 30 2006.
uk: Версія 0.1: опубліковано 30 червня 2006 р.

source: Version 0.11: posted July 1 2006. Typo fixes.
uk: Версія 0.11: опубліковано 1 липня 2006 р. Виправлення друкарських помилок.

source: Version 0.2: posted July 10 2006. Merged genexp and listcomp sections into one. Typo fixes.
uk: Версія 0.2: опубліковано 10 липня 2006 р. Об’єднано розділи genexp і listcomp в один. Виправлення друкарських помилок.

source: Version 0.21: Added more references suggested on the tutor mailing list.
uk: Версія 0.21: додано більше посилань, запропонованих у списку розсилки викладачів.
