Repository: python/python-docs-uk
Catalog: howto/instrumentation.po
Languages: uk

source: Instrumenting CPython with DTrace and SystemTap
uk: Інструментування CPython за допомогою DTrace і SystemTap

source: author
uk: автор

source: DTrace and SystemTap are monitoring tools, each providing a way to inspect what the processes on a computer system are doing. They both use domain-specific languages allowing a user to write scripts which:
uk: DTrace і SystemTap — це інструменти моніторингу, кожен з яких надає спосіб перевірити, що роблять процеси в комп’ютерній системі. Вони обидва використовують доменно-спеціальні мови, що дозволяє користувачеві писати сценарії, які:

source: filter which processes are to be observed
uk: фільтрувати процеси, які слід спостерігати

source: gather data from the processes of interest
uk: збирати дані з цікавих процесів

source: generate reports on the data
uk: створювати звіти за даними

source: As of Python 3.6, CPython can be built with embedded "markers", also known as "probes", that can be observed by a DTrace or SystemTap script, making it easier to monitor what the CPython processes on a system are doing.
uk: Починаючи з Python 3.6, CPython можна створювати за допомогою вбудованих "маркерів", також відомих як "зонди", які можна спостерігати за допомогою сценарію DTrace або SystemTap, що полегшує моніторинг того, що роблять процеси CPython у системі.

source: DTrace markers are implementation details of the CPython interpreter. No guarantees are made about probe compatibility between versions of CPython. DTrace scripts can stop working or work incorrectly without warning when changing CPython versions.
uk: Маркери DTrace є деталями реалізації інтерпретатора CPython. Жодних гарантій щодо сумісності зондів між версіями CPython не надається. Під час зміни версій CPython сценарії DTrace можуть перестати працювати або працювати неправильно без попередження.

source: Enabling the static markers
uk: Увімкнення статичних маркерів

source: macOS comes with built-in support for DTrace. On Linux, in order to build CPython with the embedded markers for SystemTap, the SystemTap development tools must be installed.
uk: macOS має вбудовану підтримку DTrace. У Linux, щоб створити CPython із вбудованими маркерами для SystemTap, необхідно встановити інструменти розробки SystemTap.

source: On a Linux machine, this can be done via::
uk: На машині Linux це можна зробити за допомогою::

source: or::
uk: або::

source: CPython must then be :option:`configured with the --with-dtrace option <--with-dtrace>`:
uk: Тоді CPython має бути :option:`налаштований за допомогою параметра --with-dtrace <--with-dtrace>`:

source: On macOS, you can list available DTrace probes by running a Python process in the background and listing all probes made available by the Python provider::
uk: У macOS ви можете отримати список доступних зондів DTrace, запустивши процес Python у фоновому режимі та перерахувавши всі зонди, доступні постачальником Python:

source: On Linux, you can verify if the SystemTap static markers are present in the built binary by seeing if it contains a ".note.stapsdt" section.
uk: У Linux ви можете перевірити наявність статичних маркерів SystemTap у вбудованому двійковому файлі, перевіривши, чи містить він розділ ".note.stapsdt".

source: If you've built Python as a shared library (with the :option:`--enable-shared` configure option), you need to look instead within the shared library. For example::
uk: Якщо ви створили Python як спільну бібліотеку (з параметром конфігурації :option:`--enable-shared`), вам потрібно натомість шукати в спільній бібліотеці. Наприклад::

source: Sufficiently modern readelf can print the metadata::
uk: Досить сучасний readelf може друкувати метадані::

source: Static DTrace probes
uk: Статичні зонди DTrace

source: The following example DTrace script can be used to show the call/return hierarchy of a Python script, only tracing within the invocation of a function called "start". In other words, import-time function invocations are not going to be listed:
uk: Наступний приклад сценарію DTrace можна використовувати, щоб показати ієрархію викликів/повернень сценарію Python, лише відстежуючи в межах виклику функції під назвою "start". Іншими словами, виклики функцій під час імпорту не будуть перераховані:

source: It can be invoked like this::
uk: Його можна викликати так::

source: The output looks like this:
uk: Результат виглядає так:

source: Static SystemTap markers
uk: Статичні маркери SystemTap

source: The low-level way to use the SystemTap integration is to use the static markers directly. This requires you to explicitly state the binary file containing them.
uk: Низькорівневий спосіб використання інтеграції SystemTap полягає в безпосередньому використанні статичних маркерів. Це вимагає, щоб ви явно вказали бінарний файл, який їх містить.

source: For example, this SystemTap script can be used to show the call/return hierarchy of a Python script:
uk: Наприклад, цей сценарій SystemTap можна використовувати, щоб показати ієрархію викликів/повернень сценарію Python:

source: where the columns are:
uk: де стовпці:

source: time in microseconds since start of script
uk: час у мікросекундах з моменту запуску сценарію

source: name of executable
uk: ім'я виконуваного файлу

source: PID of process
uk: PID процесу

source: and the remainder indicates the call/return hierarchy as the script executes.
uk: а залишок вказує на ієрархію виклику/повернення під час виконання сценарію.

source: For a :option:`--enable-shared` build of CPython, the markers are contained within the libpython shared library, and the probe's dotted path needs to reflect this. For example, this line from the above example:
uk: Для :option:`--enable-shared` збірки CPython маркери містяться в спільній бібліотеці libpython, і пунктирний шлях зонда повинен це відображати. Наприклад, цей рядок із наведеного вище прикладу:

source: should instead read:
uk: замість цього слід читати:

source: (assuming a :ref:`debug build <debug-build>` of CPython 3.6)
uk: (за умови :ref:`debug build <debug-build>` CPython 3.6)

source: Available static markers
uk: Наявні статичні маркери

source: This marker indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
uk: Цей маркер вказує на те, що почалося виконання функції Python. Він запускається лише для функцій чистого Python (байт-код).

source: The filename, function name, and line number are provided back to the tracing script as positional arguments, which must be accessed using ``$arg1``, ``$arg2``, ``$arg3``:
uk: Ім’я файлу, ім’я функції та номер рядка повертаються до сценарію трасування як позиційні аргументи, до яких потрібно отримати доступ за допомогою ``$arg1``, ``$arg2``, ``$arg3``:

source: ``$arg1`` : ``(const char *)`` filename, accessible using ``user_string($arg1)``
uk: ``$arg1`` : ``(const char *)`` ім'я файлу, доступне за допомогою ``user_string($arg1)``

source: ``$arg2`` : ``(const char *)`` function name, accessible using ``user_string($arg2)``
uk: ``$arg2`` : ``(const char *)`` назва функції, доступна за допомогою ``user_string($arg2)``

source: ``$arg3`` : ``int`` line number
uk: ``$arg3`` : ``int`` номер рядка

source: This marker indicates a Python line is about to be executed. It is the equivalent of line-by-line tracing with a Python profiler. It is not triggered within C functions.
uk: Цей маркер вказує на те, що рядок Python збирається виконати. Це еквівалент построкової трасування за допомогою профайлера Python. Він не запускається у функціях C.

source: Fires when the Python interpreter finishes a garbage collection cycle. ``arg0`` is the number of collected objects.
uk: Спрацьовує, коли інтерпретатор Python завершує цикл збирання сміття. ``arg0`` - кількість зібраних об'єктів.

source: Fires before :mod:`importlib` attempts to find and load the module. ``arg0`` is the module name.
uk: Спрацьовує перед спробою :mod:`importlib` знайти та завантажити модуль. ``arg0`` - це назва модуля.

source: Fires after :mod:`importlib`'s find_and_load function is called. ``arg0`` is the module name, ``arg1`` indicates if module was successfully loaded.
uk: Спрацьовує після виклику функції find_and_load :mod:`importlib`. ``arg0`` - це назва модуля, ``arg1`` вказує, чи модуль було успішно завантажено.

source: Fires when :func:`sys.audit` or :c:func:`PySys_Audit` is called. ``arg0`` is the event name as C string, ``arg1`` is a :c:type:`PyObject` pointer to a tuple object.
uk: Спрацьовує під час виклику :func:`sys.audit` або :c:func:`PySys_Audit`. ``arg0`` — це ім’я події у вигляді рядка C, ``arg1`` — це покажчик :c:type:`PyObject` на об’єкт кортежу.

source: SystemTap Tapsets
uk: Системні крани

source: The higher-level way to use the SystemTap integration is to use a "tapset": SystemTap's equivalent of a library, which hides some of the lower-level details of the static markers.
uk: Шлях вищого рівня використання інтеграції SystemTap полягає у використанні "tapset": еквівалента бібліотеки SystemTap, яка приховує деякі деталі нижчого рівня статичних маркерів.

source: Here is a tapset file, based on a non-shared build of CPython:
uk: Ось файл tapset, заснований на незагальній збірці CPython:

source: If this file is installed in SystemTap's tapset directory (e.g. ``/usr/share/systemtap/tapset``), then these additional probepoints become available:
uk: Якщо цей файл встановлено в каталозі tapset SystemTap (наприклад, ``/usr/share/systemtap/tapset``), тоді ці додаткові точки дослідження стають доступними:

source: This probe point indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
uk: Ця точка тестування вказує на те, що почалося виконання функції Python. Він запускається лише для функцій чистого Python (байт-код).

source: This probe point is the converse of ``python.function.return``, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
uk: Ця точка тестування є протилежністю ``python.function.return`` і вказує, що виконання функції Python завершилося (або через ``return``, або через виняток). Він запускається лише для функцій чистого Python (байт-код).

source: Examples
uk: Приклади

source: This SystemTap script uses the tapset above to more cleanly implement the example given above of tracing the Python function-call hierarchy, without needing to directly name the static markers:
uk: Цей сценарій SystemTap використовує наведений вище набір для більш чіткої реалізації наведеного вище прикладу відстеження ієрархії викликів функцій Python, без необхідності безпосередньо називати статичні маркери:
