Repository: python/python-docs-uk
Catalog: howto/ipaddress.po
Languages: uk

source: An introduction to the ipaddress module
uk: Знайомство з модулем ipaddress

source: author
uk: автор

source: Overview
uk: Огляд

source: This document aims to provide a gentle introduction to the :mod:`ipaddress` module. It is aimed primarily at users that aren't already familiar with IP networking terminology, but may also be useful to network engineers wanting an overview of how :mod:`ipaddress` represents IP network addressing concepts.
uk: Цей документ має на меті надати короткий вступ до модуля :mod:`ipaddress`. Він орієнтований насамперед на користувачів, які ще не знайомі з термінологією IP-мереж, але також може бути корисним для мережевих інженерів, які бажають отримати огляд того, як :mod:`ipaddress` представляє концепції адресації IP-мережі.

source: Creating Address/Network/Interface objects
uk: Створення об’єктів Адреса/Мережа/Інтерфейс

source: Since :mod:`ipaddress` is a module for inspecting and manipulating IP addresses, the first thing you'll want to do is create some objects. You can use :mod:`ipaddress` to create objects from strings and integers.
uk: Оскільки :mod:`ipaddress` — це модуль для перевірки та маніпулювання IP-адресами, перше, що ви захочете зробити, це створити кілька об’єктів. Ви можете використовувати :mod:`ipaddress` для створення об’єктів із рядків і цілих чисел.

source: A Note on IP Versions
uk: Примітка щодо версій IP

source: For readers that aren't particularly familiar with IP addressing, it's important to know that the Internet Protocol (IP) is currently in the process of moving from version 4 of the protocol to version 6. This transition is occurring largely because version 4 of the protocol doesn't provide enough addresses to handle the needs of the whole world, especially given the increasing number of devices with direct connections to the internet.
uk: Читачам, які не особливо знайомі з IP-адресацією, важливо знати, що Інтернет-протокол (IP) зараз перебуває в процесі переходу від версії 4 протоколу до версії 6. Цей перехід відбувається головним чином тому, що версія 4 протоколу протокол не надає достатньо адрес для задоволення потреб усього світу, особливо зважаючи на збільшення кількості пристроїв із прямим підключенням до Інтернету.

source: Explaining the details of the differences between the two versions of the protocol is beyond the scope of this introduction, but readers need to at least be aware that these two versions exist, and it will sometimes be necessary to force the use of one version or the other.
uk: Пояснення деталей відмінностей між двома версіями протоколу виходить за рамки цього вступу, але читачі повинні принаймні знати, що ці дві версії існують, і іноді буде необхідно примусово використовувати одну версію або інший.

source: IP Host Addresses
uk: IP-адреси хостів

source: Addresses, often referred to as "host addresses" are the most basic unit when working with IP addressing. The simplest way to create addresses is to use the :func:`ipaddress.ip_address` factory function, which automatically determines whether to create an IPv4 or IPv6 address based on the passed in value:
uk: Адреси, які часто називають "адресами хостів", є основними одиницями роботи з IP-адресуванням. Найпростішим способом створення адрес є використання фабричної функції :func:`ipaddress.ip_address`, яка автоматично визначає, чи потрібно створити адресу IPv4 чи IPv6 на основі переданого значення:

source: Addresses can also be created directly from integers. Values that will fit within 32 bits are assumed to be IPv4 addresses::
uk: Адреси також можна створювати безпосередньо з цілих чисел. Припускається, що значення, які вміщуються в 32 біти, є адресами IPv4:

source: To force the use of IPv4 or IPv6 addresses, the relevant classes can be invoked directly. This is particularly useful to force creation of IPv6 addresses for small integers::
uk: Щоб примусово використовувати адреси IPv4 або IPv6, відповідні класи можна викликати безпосередньо. Це особливо корисно для примусового створення адрес IPv6 для малих цілих чисел:

source: Defining Networks
uk: Визначення мереж

source: Host addresses are usually grouped together into IP networks, so :mod:`ipaddress` provides a way to create, inspect and manipulate network definitions. IP network objects are constructed from strings that define the range of host addresses that are part of that network. The simplest form for that information is a "network address/network prefix" pair, where the prefix defines the number of leading bits that are compared to determine whether or not an address is part of the network and the network address defines the expected value of those bits.
uk: Адреси хостів зазвичай групуються в IP-мережі, тому :mod:`ipaddress` надає можливість створювати, перевіряти та маніпулювати визначеннями мережі. Об’єкти IP-мережі складаються з рядків, які визначають діапазон адрес хостів, які є частиною цієї мережі. Найпростішою формою цієї інформації є пара "адреса мережі/префікс мережі", де префікс визначає кількість початкових бітів, які порівнюються, щоб визначити, чи є адреса частиною мережі, а мережева адреса визначає очікуване значення ці шматочки.

source: As for addresses, a factory function is provided that determines the correct IP version automatically::
uk: Що стосується адрес, передбачена заводська функція, яка автоматично визначає правильну версію IP:

source: Network objects cannot have any host bits set. The practical effect of this is that ``192.0.2.1/24`` does not describe a network. Such definitions are referred to as interface objects since the ip-on-a-network notation is commonly used to describe network interfaces of a computer on a given network and are described further in the next section.
uk: Мережні об’єкти не можуть мати встановлені біти хоста. Практичний ефект цього полягає в тому, що ``192.0.2.1/24`` не описує мережу. Такі визначення називаються об’єктами інтерфейсу, оскільки нотація ip-on-a-network зазвичай використовується для опису мережевих інтерфейсів комп’ютера в даній мережі та описана далі в наступному розділі.

source: By default, attempting to create a network object with host bits set will result in :exc:`ValueError` being raised. To request that the additional bits instead be coerced to zero, the flag ``strict=False`` can be passed to the constructor::
uk: За замовчуванням спроба створити мережевий об’єкт із встановленими бітами хоста призведе до появи :exc:`ValueError`. Щоб запитати, щоб додаткові біти натомість привели до нуля, прапорець ``strict=False`` можна передати конструктору:

source: While the string form offers significantly more flexibility, networks can also be defined with integers, just like host addresses. In this case, the network is considered to contain only the single address identified by the integer, so the network prefix includes the entire network address::
uk: Хоча рядкова форма забезпечує значно більшу гнучкість, мережі також можна визначати цілими числами, як і адреси хостів. У цьому випадку вважається, що мережа містить лише одну адресу, визначену цілим числом, тому мережевий префікс включає всю мережеву адресу::

source: As with addresses, creation of a particular kind of network can be forced by calling the class constructor directly instead of using the factory function.
uk: Як і у випадку з адресами, створення певного типу мережі можна примусово викликати безпосередньо конструктор класу замість використання функції фабрики.

source: Host Interfaces
uk: Інтерфейси хоста

source: As mentioned just above, if you need to describe an address on a particular network, neither the address nor the network classes are sufficient. Notation like ``192.0.2.1/24`` is commonly used by network engineers and the people who write tools for firewalls and routers as shorthand for "the host ``192.0.2.1`` on the network ``192.0.2.0/24``", Accordingly, :mod:`ipaddress` provides a set of hybrid classes that associate an address with a particular network. The interface for creation is identical to that for defining network objects, except that the address portion isn't constrained to being a network address.
uk: Як згадувалося вище, якщо вам потрібно описати адресу в певній мережі, ні адреси, ні класів мережі недостатньо. Позначення на зразок ``192.0.2.1/24`` зазвичай використовується мережевими інженерами та людьми, які пишуть інструменти для брандмауерів і маршрутизаторів, як скорочення для "хосту ``192.0.2.1`` в мережі ``192.0.2.0/24``", Відповідно, :mod:`ipaddress` надає набір гібридних класів, які пов’язують адресу з певною мережею. Інтерфейс для створення ідентичний інтерфейсу для визначення мережевих об’єктів, за винятком того, що частина адреси не обмежена мережевою адресою.

source: Integer inputs are accepted (as with networks), and use of a particular IP version can be forced by calling the relevant constructor directly.
uk: Цілочисельні введення приймаються (як у випадку з мережами), і використання певної версії IP може бути примусово викликано відповідний конструктор безпосередньо.

source: Inspecting Address/Network/Interface Objects
uk: Перевірка об’єктів адреси/мережі/інтерфейсу

source: You've gone to the trouble of creating an IPv(4|6)(Address|Network|Interface) object, so you probably want to get information about it. :mod:`ipaddress` tries to make doing this easy and intuitive.
uk: Ви потрудилися зі створенням об’єкта IPv(4|6)(Address|Network|Interface), тож, мабуть, хочете отримати інформацію про нього. :mod:`ipaddress` намагається зробити це легким та інтуїтивно зрозумілим.

source: Extracting the IP version::
uk: Витяг версії IP::

source: Obtaining the network from an interface::
uk: Отримання мережі через інтерфейс::

source: Finding out how many individual addresses are in a network::
uk: Дізнатися кількість окремих адрес у мережі:

source: Iterating through the "usable" addresses on a network::
uk: Перебір "придатних" адрес у мережі:

source: Obtaining the netmask (i.e. set bits corresponding to the network prefix) or the hostmask (any bits that are not part of the netmask):
uk: Отримання маски мережі (тобто встановлених бітів, що відповідають префіксу мережі) або маски хоста (будь-яких бітів, які не є частиною маски мережі):

source: Exploding or compressing the address::
uk: Розкладання або стиснення адреси:

source: While IPv4 doesn't support explosion or compression, the associated objects still provide the relevant properties so that version neutral code can easily ensure the most concise or most verbose form is used for IPv6 addresses while still correctly handling IPv4 addresses.
uk: Незважаючи на те, що IPv4 не підтримує розгортання чи стиснення, пов’язані об’єкти все одно надають відповідні властивості, щоб нейтральний код версії міг легко гарантувати, що для адрес IPv6 використовується найкоротша чи найбільш докладна форма, водночас правильно обробляючи адреси IPv4.

source: Networks as lists of Addresses
uk: Мережі як списки адрес

source: It's sometimes useful to treat networks as lists. This means it is possible to index them like this::
uk: Іноді корисно розглядати мережі як списки. Це означає, що їх можна індексувати таким чином:

source: It also means that network objects lend themselves to using the list membership test syntax like this::
uk: Це також означає, що мережеві об’єкти піддаються використанню синтаксису перевірки членства в списку таким чином:

source: Containment testing is done efficiently based on the network prefix::
uk: Тестування обмеження виконується ефективно на основі мережевого префікса::

source: Comparisons
uk: Порівняння

source: :mod:`ipaddress` provides some simple, hopefully intuitive ways to compare objects, where it makes sense::
uk: :mod:`ipaddress` надає кілька простих, сподіваюся, інтуїтивно зрозумілих способів порівняння об’єктів, де це має сенс:

source: A :exc:`TypeError` exception is raised if you try to compare objects of different versions or different types.
uk: Виняток :exc:`TypeError` виникає, якщо ви намагаєтеся порівняти об’єкти різних версій або різних типів.

source: Using IP Addresses with other modules
uk: Використання IP-адрес з іншими модулями

source: Other modules that use IP addresses (such as :mod:`socket`) usually won't accept objects from this module directly. Instead, they must be coerced to an integer or string that the other module will accept::
uk: Інші модулі, які використовують IP-адреси (такі як :mod:`socket`), зазвичай не приймають об’єкти з цього модуля безпосередньо. Замість цього вони повинні бути приведені до цілого числа або рядка, який прийме інший модуль:

source: Getting more detail when instance creation fails
uk: Отримання додаткової інформації, коли не вдається створити примірник

source: When creating address/network/interface objects using the version-agnostic factory functions, any errors will be reported as :exc:`ValueError` with a generic error message that simply says the passed in value was not recognized as an object of that type. The lack of a specific error is because it's necessary to know whether the value is *supposed* to be IPv4 or IPv6 in order to provide more detail on why it has been rejected.
uk: Під час створення об’єктів адреси/мережі/інтерфейсу за допомогою функцій фабрики, що не залежать від версії, про будь-які помилки повідомлятиметься як :exc:`ValueError` із загальним повідомленням про помилку, яке просто повідомляє, що передане значення не було розпізнано як об’єкт цього типу. Відсутність конкретної помилки пов’язана з тим, що необхідно знати, чи *має* значення бути IPv4 чи IPv6, щоб надати докладнішу інформацію про те, чому його було відхилено.

source: To support use cases where it is useful to have access to this additional detail, the individual class constructors actually raise the :exc:`ValueError` subclasses :exc:`ipaddress.AddressValueError` and :exc:`ipaddress.NetmaskValueError` to indicate exactly which part of the definition failed to parse correctly.
uk: Щоб підтримати випадки використання, де корисно мати доступ до цієї додаткової деталі, окремі конструктори класів фактично створюють підкласи :exc:`ValueError` :exc:`ipaddress.AddressValueError` і :exc:`ipaddress.NetmaskValueError`, щоб точно вказати яку частину визначення не вдалося правильно проаналізувати.

source: The error messages are significantly more detailed when using the class constructors directly. For example::
uk: Повідомлення про помилки значно більш детальні при безпосередньому використанні конструкторів класів. Наприклад::

source: However, both of the module specific exceptions have :exc:`ValueError` as their parent class, so if you're not concerned with the particular type of error, you can still write code like the following::
uk: Однак обидва винятки, специфічні для модуля, мають :exc:`ValueError` як батьківський клас, тому, якщо вас не хвилює певний тип помилки, ви все одно можете написати наступний код:
