Repository: python/python-docs-uk
Catalog: howto/regex.po
Languages: uk

source: Regular Expression HOWTO
uk: Регулярний вираз HOWTO

source: Author
uk: Автор

source: Abstract
uk: Анотація

source: This document is an introductory tutorial to using regular expressions in Python with the :mod:`re` module. It provides a gentler introduction than the corresponding section in the Library Reference.
uk: Цей документ є вступним посібником із використання регулярних виразів у Python із модулем :mod:`re`. Він містить більш лагідний вступ, ніж відповідний розділ довідника бібліотеки.

source: Introduction
uk: Вступ

source: Regular expressions (called REs, or regexes, or regex patterns) are essentially a tiny, highly specialized programming language embedded inside Python and made available through the :mod:`re` module. Using this little language, you specify the rules for the set of possible strings that you want to match; this set might contain English sentences, or e-mail addresses, or TeX commands, or anything you like. You can then ask questions such as "Does this string match the pattern?", or "Is there a match for the pattern anywhere in this string?". You can also use REs to modify a string or to split it apart in various ways.
uk: Регулярні вирази (так звані RE, або регулярні вирази, або шаблони регулярних виразів) — це, по суті, крихітна вузькоспеціалізована мова програмування, вбудована в Python і доступна через модуль :mod:`re`. Використовуючи цю маленьку мову, ви визначаєте правила для набору можливих рядків, які ви хочете зіставити; цей набір може містити англійські речення, або адреси електронної пошти, або команди TeX, або будь-що, що вам подобається. Потім ви можете поставити такі запитання, як "Чи відповідає цей рядок шаблону?" або "Чи є відповідність шаблону десь у цьому рядку?". Ви також можете використовувати RE, щоб змінити рядок або розділити його різними способами.

source: Regular expression patterns are compiled into a series of bytecodes which are then executed by a matching engine written in C. For advanced use, it may be necessary to pay careful attention to how the engine will execute a given RE, and write the RE in a certain way in order to produce bytecode that runs faster. Optimization isn't covered in this document, because it requires that you have a good understanding of the matching engine's internals.
uk: Шаблони регулярних виразів компілюються в серію байт-кодів, які потім виконуються механізмом відповідності, написаним мовою C. Для розширеного використання може знадобитися звернути особливу увагу на те, як механізм виконуватиме заданий RE, і записати RE у певним чином, щоб створити байт-код, який працює швидше. Оптимізація не розглядається в цьому документі, оскільки вона вимагає, щоб ви добре розуміли внутрішні механізми відповідності.

source: The regular expression language is relatively small and restricted, so not all possible string processing tasks can be done using regular expressions. There are also tasks that *can* be done with regular expressions, but the expressions turn out to be very complicated. In these cases, you may be better off writing Python code to do the processing; while Python code will be slower than an elaborate regular expression, it will also probably be more understandable.
uk: Мова регулярних виразів є відносно невеликою та обмеженою, тому не всі можливі завдання обробки рядків можна виконати за допомогою регулярних виразів. Також є завдання, які *можна* виконувати регулярними виразами, але вирази виявляються дуже складними. У цих випадках вам може бути краще написати код Python для виконання обробки; Хоча код Python буде повільнішим, ніж складний регулярний вираз, він також, ймовірно, буде більш зрозумілим.

source: Simple Patterns
uk: Прості візерунки

source: We'll start by learning about the simplest possible regular expressions. Since regular expressions are used to operate on strings, we'll begin with the most common task: matching characters.
uk: Ми почнемо з вивчення найпростіших регулярних виразів. Оскільки регулярні вирази використовуються для роботи з рядками, ми почнемо з найпоширенішого завдання: зіставлення символів.

source: For a detailed explanation of the computer science underlying regular expressions (deterministic and non-deterministic finite automata), you can refer to almost any textbook on writing compilers.
uk: Для детального пояснення інформатики, що лежить в основі регулярних виразів (детермінованих і недетермінованих кінцевих автоматів), ви можете звернутися до майже будь-якого підручника з написання компіляторів.

source: Matching Characters
uk: Відповідні символи

source: Most letters and characters will simply match themselves. For example, the regular expression ``test`` will match the string ``test`` exactly. (You can enable a case-insensitive mode that would let this RE match ``Test`` or ``TEST`` as well; more about this later.)
uk: Більшість літер і символів просто збігаються. Наприклад, регулярний вираз ``test`` точно збігатиметься з рядком ``test``. (Ви можете ввімкнути режим без урахування регістру, який дозволив би цьому RE відповідати також ``Test`` або ``TEST``; докладніше про це пізніше.)

source: There are exceptions to this rule; some characters are special :dfn:`metacharacters`, and don't match themselves. Instead, they signal that some out-of-the-ordinary thing should be matched, or they affect other portions of the RE by repeating them or changing their meaning. Much of this document is devoted to discussing various metacharacters and what they do.
uk: З цього правила є винятки; деякі символи є спеціальними :dfn:`metacharacters` і не відповідають самі собі. Натомість вони сигналізують про те, що потрібно зіставити щось незвичайне, або впливають на інші частини RE, повторюючи їх або змінюючи їх значення. Велика частина цього документа присвячена обговоренню різних метасимволів і того, що вони роблять.

source: Here's a complete list of the metacharacters; their meanings will be discussed in the rest of this HOWTO.
uk: Ось повний список метасимволів; їхнє значення буде обговорено в решті цього HOWTO.

source: The first metacharacters we'll look at are ``[`` and ``]``. They're used for specifying a character class, which is a set of characters that you wish to match. Characters can be listed individually, or a range of characters can be indicated by giving two characters and separating them by a ``'-'``. For example, ``[abc]`` will match any of the characters ``a``, ``b``, or ``c``; this is the same as ``[a-c]``, which uses a range to express the same set of characters. If you wanted to match only lowercase letters, your RE would be ``[a-z]``.
uk: Перші метасимволи, які ми розглянемо, це ``[`` і ``]``. Вони використовуються для вказівки класу символів, який є набором символів, які ви хочете зіставити. Символи можна перераховувати окремо або діапазон символів можна вказати двома символами та розділити їх символом ``'-'``. Наприклад, "[abc]" відповідатиме будь-якому із символів "a", "b" або "c"; це те саме, що ``[a-c]``, який використовує діапазон для вираження того самого набору символів. Якщо ви хочете зіставити лише малі літери, вашим RE буде ``[a-z]``.

source: Metacharacters (except ``\``) are not active inside classes. For example, ``[akm$]`` will match any of the characters ``'a'``, ``'k'``, ``'m'``, or ``'$'``; ``'$'`` is usually a metacharacter, but inside a character class it's stripped of its special nature.
uk: Метасимволи (крім ``\``) неактивні всередині класів. Наприклад, ``[akm$]`` відповідатиме будь-якому із символів ``'a'``, ``'k'``, ``'m'`` або ``'$'``; ``'$'`` зазвичай є метасимволом, але всередині класу символів він позбавлений особливої природи.

source: You can match the characters not listed within the class by :dfn:`complementing` the set. This is indicated by including a ``'^'`` as the first character of the class. For example, ``[^5]`` will match any character except ``'5'``. If the caret appears elsewhere in a character class, it does not have special meaning. For example: ``[5^]`` will match either a ``'5'`` or a ``'^'``.
uk: Ви можете зіставити символи, яких немає в списку в класі, :dfn:`complementing` набір. Це вказується додаванням ``'^'`` як першого символу класу. Наприклад, ``[^5]`` відповідатиме будь-якому символу, крім ``'5'``. Якщо каретка з’являється в іншому місці класу символів, вона не має особливого значення. Наприклад: ``[5^]`` відповідатиме або ``'5''``, або ``'^'``.

source: Perhaps the most important metacharacter is the backslash, ``\``. As in Python string literals, the backslash can be followed by various characters to signal various special sequences. It's also used to escape all the metacharacters so you can still match them in patterns; for example, if you need to match a ``[`` or ``\``, you can precede them with a backslash to remove their special meaning: ``\[`` or ``\\``.
uk: Мабуть, найважливішим метасимволом є зворотна коса риска, ``\``. Як і в рядкових літералах Python, за зворотною скісною рискою можуть слідувати різні символи, щоб позначити різні спеціальні послідовності. Він також використовується для екранування всіх метасимволів, щоб ви все ще могли зіставляти їх у шаблонах; наприклад, якщо вам потрібно знайти відповідність ``[`` або ``\``, ви можете поставити перед ними зворотну скісну риску, щоб видалити їхнє спеціальне значення: ``\[`` або ``\\``.

source: Some of the special sequences beginning with ``'\'`` represent predefined sets of characters that are often useful, such as the set of digits, the set of letters, or the set of anything that isn't whitespace.
uk: Деякі спеціальні послідовності, що починаються з ``'\'``, представляють заздалегідь визначені набори символів, які часто є корисними, наприклад набір цифр, набір літер або набір будь-чого, що не є пробілами.

source: Let's take an example: ``\w`` matches any alphanumeric character. If the regex pattern is expressed in bytes, this is equivalent to the class ``[a-zA-Z0-9_]``. If the regex pattern is a string, ``\w`` will match all the characters marked as letters in the Unicode database provided by the :mod:`unicodedata` module. You can use the more restricted definition of ``\w`` in a string pattern by supplying the :const:`re.ASCII` flag when compiling the regular expression.
uk: Розглянемо приклад: ``\w`` відповідає будь-якому буквено-цифровому символу. Якщо шаблон регулярного виразу виражено в байтах, це еквівалентно класу ``[a-zA-Z0-9_]``. Якщо шаблон регулярного виразу є рядком, ``\w`` відповідатиме всім символам, позначеним як літери в базі даних Unicode, наданій модулем :mod:`unicodedata`. Ви можете використовувати більш обмежене визначення ``\w`` у шаблоні рядка, поставивши прапорець :const:`re.ASCII` під час компіляції регулярного виразу.

source: The following list of special sequences isn't complete. For a complete list of sequences and expanded class definitions for Unicode string patterns, see the last part of :ref:`Regular Expression Syntax <re-syntax>` in the Standard Library reference. In general, the Unicode versions match any character that's in the appropriate category in the Unicode database.
uk: Наступний список спеціальних послідовностей не є повним. Щоб отримати повний список послідовностей і розширених визначень класів для шаблонів рядків Unicode, перегляньте останню частину :ref:`Синтаксису регулярного виразу <re-syntax>` у довіднику стандартної бібліотеки. Загалом, версії Unicode відповідають будь-якому символу, який знаходиться у відповідній категорії бази даних Unicode.

source: Matches any decimal digit; this is equivalent to the class ``[0-9]``.
uk: Збігається з будь-якою десятковою цифрою; це еквівалентно класу ``[0-9]``.

source: Matches any non-digit character; this is equivalent to the class ``[^0-9]``.
uk: Відповідає будь-якому нецифровому символу; це еквівалентно класу ``[^0-9]``.

source: Matches any whitespace character; this is equivalent to the class ``[ \t\n\r\f\v]``.
uk: Відповідає будь-якому пробілу; це еквівалентно класу ``[ \t\n\r\f\v]``.

source: Matches any non-whitespace character; this is equivalent to the class ``[^ \t\n\r\f\v]``.
uk: Відповідає будь-якому непробільному символу; це еквівалентно класу ``[^ \t\n\r\f\v]``.

source: Matches any alphanumeric character; this is equivalent to the class ``[a-zA-Z0-9_]``.
uk: Відповідає будь-якому буквено-цифровому символу; це еквівалентно класу ``[a-zA-Z0-9_]``.

source: Matches any non-alphanumeric character; this is equivalent to the class ``[^a-zA-Z0-9_]``.
uk: Відповідає будь-якому небуквено-цифровому символу; це еквівалентно класу ``[^a-zA-Z0-9_]``.

source: These sequences can be included inside a character class. For example, ``[\s,.]`` is a character class that will match any whitespace character, or ``','`` or ``'.'``.
uk: Ці послідовності можна включити в клас символів. Наприклад, ``[\s,.]`` — це клас символів, який відповідатиме будь-якому пробілу, або ``',''`` чи ``'.''``.

source: The final metacharacter in this section is ``.``. It matches anything except a newline character, and there's an alternate mode (:const:`re.DOTALL`) where it will match even a newline. ``.`` is often used where you want to match "any character".
uk: Останнім метасимволом у цьому розділі є ``.``. Він відповідає будь-чому, крім символу нового рядка, і є альтернативний режим (:const:`re.DOTALL`), де він відповідатиме навіть новому рядку. ``.`` часто використовується, коли потрібно знайти відповідність "будь-якому символу".

source: Repeating Things
uk: Повторення речей

source: Being able to match varying sets of characters is the first thing regular expressions can do that isn't already possible with the methods available on strings. However, if that was the only additional capability of regexes, they wouldn't be much of an advance. Another capability is that you can specify that portions of the RE must be repeated a certain number of times.
uk: Здатність зіставляти різні набори символів — це перше, що можуть зробити регулярні вирази, що ще не можливо за допомогою методів, доступних для рядків. Однак, якби це була єдина додаткова можливість регулярних виразів, вони не були б великим прогресом. Інша можливість полягає в тому, що ви можете вказати, що частини RE мають повторюватися певну кількість разів.

source: The first metacharacter for repeating things that we'll look at is ``*``. ``*`` doesn't match the literal character ``'*'``; instead, it specifies that the previous character can be matched zero or more times, instead of exactly once.
uk: Перший метасимвол для повторення речей, які ми розглянемо, це ``*``. ``*`` не відповідає буквальному символу ``'*'``; натомість він визначає, що попередній символ може бути зіставлений нуль або більше разів замість точно одного разу.

source: For example, ``ca*t`` will match ``'ct'`` (0 ``'a'`` characters), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` characters), and so forth.
uk: Наприклад, ``ca*t`` відповідатиме ``'ct'`` (0 символів ``'a'``), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 символи ``'a'``) і так далі.

source: Repetitions such as ``*`` are :dfn:`greedy`; when repeating a RE, the matching engine will try to repeat it as many times as possible. If later portions of the pattern don't match, the matching engine will then back up and try again with fewer repetitions.
uk: Такі повтори, як ``*`` є :dfn:`greedy`; при повторенні RE механізм пошуку відповідності намагатиметься повторити його якомога більше разів. Якщо пізніші частини шаблону не збігаються, механізм пошуку відповідностей створить резервну копію та спробує знову з меншою кількістю повторень.

source: A step-by-step example will make this more obvious. Let's consider the expression ``a[bcd]*b``. This matches the letter ``'a'``, zero or more letters from the class ``[bcd]``, and finally ends with a ``'b'``. Now imagine matching this RE against the string ``'abcbd'``.
uk: Покроковий приклад зробить це більш очевидним. Розглянемо вираз ``a[bcd]*b``. Це відповідає літері ``'a'``, нулю або більше літер з класу ``[bcd]`` і, нарешті, закінчується ``'b'``. Тепер уявіть, що зіставлення цього RE з рядком ``'abcbd``.

source: Step
uk: Крок

source: Matched
uk: Збіг

source: Explanation
uk: Пояснення

source: The ``a`` in the RE matches.
uk: ``a`` у RE відповідає.

source: The engine matches ``[bcd]*``, going as far as it can, which is to the end of the string.
uk: Механізм збігається з ``[bcd]*``, просуваючись якомога далі, тобто до кінця рядка.

source: *Failure*
uk: *Невдача*

source: The engine tries to match ``b``, but the current position is at the end of the string, so it fails.
uk: Механізм намагається знайти відповідність ``b``, але поточна позиція знаходиться в кінці рядка, тому це не вдається.

source: Back up, so that ``[bcd]*`` matches one less character.
uk: Зробіть резервну копію, щоб ``[bcd]*`` відповідав на один символ менше.

source: Try ``b`` again, but the current position is at the last character, which is a ``'d'``.
uk: Спробуйте ``b`` ще раз, але поточна позиція знаходиться на останньому символі, який є ``'d'``.

source: Back up again, so that ``[bcd]*`` is only matching ``bc``.
uk: Знову створіть резервну копію, щоб ``[bcd]*`` відповідало лише ``bc``.

source: Try ``b`` again. This time the character at the current position is ``'b'``, so it succeeds.
uk: Спробуйте ``b`` знову. Цього разу символом у поточній позиції є ``'b'``, отже, це вдалось.

source: The end of the RE has now been reached, and it has matched ``'abcb'``. This demonstrates how the matching engine goes as far as it can at first, and if no match is found it will then progressively back up and retry the rest of the RE again and again. It will back up until it has tried zero matches for ``[bcd]*``, and if that subsequently fails, the engine will conclude that the string doesn't match the RE at all.
uk: Кінець RE вже досягнуто, і він відповідає ``'abcb``. Це демонструє, як система пошуку відповідностей спочатку йде так далеко, як тільки може, і якщо відповідності не знайдено, вона поступово створюватиме резервні копії та повторюватиме решту RE знову і знову. Він виконуватиме резервне копіювання, доки не знайде нульових збігів для ``[bcd]*``, і якщо це згодом не вдасться, система зробить висновок, що рядок взагалі не відповідає RE.

source: Another repeating metacharacter is ``+``, which matches one or more times. Pay careful attention to the difference between ``*`` and ``+``; ``*`` matches *zero* or more times, so whatever's being repeated may not be present at all, while ``+`` requires at least *one* occurrence. To use a similar example, ``ca+t`` will match ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), but won't match ``'ct'``.
uk: Ще один повторюваний метасимвол – це ``+``, який збігається один або кілька разів. Зверніть увагу на різницю між ``*`` і ``+``; ``*`` відповідає *нуль* або більше разів, тому все, що повторюється, може взагалі не бути присутнім, тоді як ``+`` вимагає принаймні *одного* входження. Щоб використати подібний приклад, ``ca+t`` відповідатиме ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), але не відповідатиме ``'ct``.

source: There are two more repeating operators or quantifiers. The question mark character, ``?``, matches either once or zero times; you can think of it as marking something as being optional. For example, ``home-?brew`` matches either ``'homebrew'`` or ``'home-brew'``.
uk: Є ще два повторювані оператори або квантори. Знак питання, ``?``, збігається або один раз, або нуль разів; ви можете розглядати це як позначення чогось як необов’язкового. Наприклад, ``home-?brew`` matches either ``'homebrew'`` або ``'home-brew'``.

source: The most complicated quantifier is ``{m,n}``, where *m* and *n* are decimal integers. This quantifier means there must be at least *m* repetitions, and at most *n*. For example, ``a/{1,3}b`` will match ``'a/b'``, ``'a//b'``, and ``'a///b'``. It won't match ``'ab'``, which has no slashes, or ``'a////b'``, which has four.
uk: Найскладнішим квантором є ``{m,n}``, де *m* і *n* є десятковими цілими числами. Цей квантор означає, що має бути принаймні *m* повторень і не більше *n*. Наприклад, ``a/{1,3}b`` відповідатиме ``'a/b'``, ``'a//b'``, та ``'a///b'``. Він не збігатиметься з ``'ab'``, який не має похилих рисок, або ``'a////b'``, який має чотири.

source: You can omit either *m* or *n*; in that case, a reasonable value is assumed for the missing value. Omitting *m* is interpreted as a lower limit of 0, while omitting *n* results in an upper bound of infinity.
uk: Ви можете опустити *m* або *n*; у цьому випадку для відсутнього значення приймається розумне значення. Пропуск *m* інтерпретується як нижня межа 0, тоді як пропуск *n* призводить до верхньої межі нескінченності.

source: Readers of a reductionist bent may notice that the three other quantifiers can all be expressed using this notation. ``{0,}`` is the same as ``*``, ``{1,}`` is equivalent to ``+``, and ``{0,1}`` is the same as ``?``. It's better to use ``*``, ``+``, or ``?`` when you can, simply because they're shorter and easier to read.
uk: Редукціоністські читачі можуть помітити, що всі три інші квантори можна виразити за допомогою цієї нотації. ``{0,}`` те саме, що ` ``*``, ``{1,}`` еквівалентно ``+``, and ``{0,1}`` is the same as ``?``. Краще використовувати ``*``, ``+``, або ``?``, коли є така можливість, просто тому, що вони коротші та легші для читання.

source: Using Regular Expressions
uk: Використання регулярних виразів

source: Now that we've looked at some simple regular expressions, how do we actually use them in Python? The :mod:`re` module provides an interface to the regular expression engine, allowing you to compile REs into objects and then perform matches with them.
uk: Тепер, коли ми розглянули деякі прості регулярні вирази, як ми насправді використовуємо їх у Python? Модуль :mod:`re` надає інтерфейс механізму регулярних виразів, дозволяючи вам компілювати RE в об’єкти, а потім виконувати з ними збіги.

source: Compiling Regular Expressions
uk: Компіляція регулярних виразів

source: Regular expressions are compiled into pattern objects, which have methods for various operations such as searching for pattern matches or performing string substitutions. ::
uk: Регулярні вирази компілюються в об’єкти шаблонів, які мають методи для різноманітних операцій, таких як пошук збігів шаблону або виконання підстановок рядків. ::

source: :func:`re.compile` also accepts an optional *flags* argument, used to enable various special features and syntax variations. We'll go over the available settings later, but for now a single example will do::
uk: :func:`re.compile` також приймає необов’язковий аргумент *flags*, який використовується для ввімкнення різних спеціальних функцій і варіантів синтаксису. Пізніше ми розглянемо доступні параметри, а поки підійде один приклад:

source: The RE is passed to :func:`re.compile` as a string. REs are handled as strings because regular expressions aren't part of the core Python language, and no special syntax was created for expressing them. (There are applications that don't need REs at all, so there's no need to bloat the language specification by including them.) Instead, the :mod:`re` module is simply a C extension module included with Python, just like the :mod:`socket` or :mod:`zlib` modules.
uk: RE передається до :func:`re.compile` як рядок. RE обробляються як рядки, оскільки регулярні вирази не є частиною основної мови Python, і для їх вираження не створено спеціального синтаксису. (Існують програми, які взагалі не потребують RE, тому немає потреби роздувати специфікацію мови, включаючи їх.) Натомість модуль :mod:`re` є просто модулем розширення C, що входить до складу Python, як і модулі :mod:`socket` або :mod:`zlib`.

source: Putting REs in strings keeps the Python language simpler, but has one disadvantage which is the topic of the next section.
uk: Розміщення RE в рядках робить мову Python простішою, але має один недолік, який є темою наступного розділу.
