Repository: python/python-docs-uk
Catalog: howto/regex.po
Languages: uk

source: Notice that the ``.`` needs to be treated specially because it's a metacharacter, so it's inside a character class to only match that specific character. Also notice the trailing ``$``; this is added to ensure that all the rest of the string must be included in the extension. This regular expression matches ``foo.bar`` and ``autoexec.bat`` and ``sendmail.cf`` and ``printers.conf``.
uk: Зауважте, що ``.`` потрібно обробляти спеціально, оскільки це метасимвол, тому він знаходиться всередині класу символів, щоб відповідати лише цьому конкретному символу. Також зверніть увагу на закінчення ``$``; це додається, щоб переконатися, що вся решта рядка повинна бути включена в розширення. Цей регулярний вираз відповідає ``foo.bar`` і ``autoexec.bat``, ``sendmail.cf`` і ``printers.conf``.

source: Now, consider complicating the problem a bit; what if you want to match filenames where the extension is not ``bat``? Some incorrect attempts:
uk: Тепер подумайте про те, щоб трохи ускладнити проблему; що, якщо ви хочете зіставити назви файлів, розширення яких не є ``bat``? Деякі неправильні спроби:

source: ``.*[.][^b].*$`` The first attempt above tries to exclude ``bat`` by requiring that the first character of the extension is not a ``b``. This is wrong, because the pattern also doesn't match ``foo.bar``.
uk: ``.*[.][^b].*$`` Перша спроба вище намагається виключити ``bat``, вимагаючи, щоб перший символ розширення не був ``b``. Це неправильно, оскільки шаблон також не відповідає ``foo.bar``.

source: The expression gets messier when you try to patch up the first solution by requiring one of the following cases to match: the first character of the extension isn't ``b``; the second character isn't ``a``; or the third character isn't ``t``. This accepts ``foo.bar`` and rejects ``autoexec.bat``, but it requires a three-letter extension and won't accept a filename with a two-letter extension such as ``sendmail.cf``. We'll complicate the pattern again in an effort to fix it.
uk: Вираз стає складнішим, коли ви намагаєтеся виправити перше рішення, вимагаючи збігу одного з наступних випадків: перший символ розширення не є ``b``; другий символ не є ``a``; або третій символ не є ``t``. Це приймає ``foo.bar`` і відхиляє ``autoexec.bat``, але воно вимагає розширення з трьох літер і не приймає ім’я файлу з дволітерним розширенням, наприклад ``sendmail.cf``. Ми знову ускладнимо шаблон, намагаючись його виправити.

source: In the third attempt, the second and third letters are all made optional in order to allow matching extensions shorter than three characters, such as ``sendmail.cf``.
uk: Під час третьої спроби друга та третя літери стають необов’язковими, щоб дозволити відповідні розширення коротші за три символи, наприклад ``sendmail.cf``.

source: The pattern's getting really complicated now, which makes it hard to read and understand. Worse, if the problem changes and you want to exclude both ``bat`` and ``exe`` as extensions, the pattern would get even more complicated and confusing.
uk: Зараз шаблон стає дуже складним, тому його важко прочитати та зрозуміти. Гірше того, якщо проблема зміниться і ви захочете виключити і ``bat``, і ``exe`` як розширення, шаблон стане ще більш складним і заплутаним.

source: A negative lookahead cuts through all this confusion:
uk: Негативний прогноз прорізає всю цю плутанину:

source: ``.*[.](?!bat$)[^.]*$`` The negative lookahead means: if the expression ``bat`` doesn't match at this point, try the rest of the pattern; if ``bat$`` does match, the whole pattern will fail. The trailing ``$`` is required to ensure that something like ``sample.batch``, where the extension only starts with ``bat``, will be allowed. The ``[^.]*`` makes sure that the pattern works when there are multiple dots in the filename.
uk: ``.*[.](?!bat$)[^.]*$`` Негативний перегляд означає: якщо вираз ``bat`` не збігається на цьому етапі, спробуйте решту шаблону; якщо ``bat$`` збігається, весь шаблон буде невдалим. Кінцевий ``$`` потрібен, щоб переконатися, що щось на зразок ``sample.batch``, де розширення починається лише з ``bat``, буде дозволено. ``[^.]*`` гарантує, що шаблон працює, якщо в назві файлу є кілька крапок.

source: Excluding another filename extension is now easy; simply add it as an alternative inside the assertion. The following pattern excludes filenames that end in either ``bat`` or ``exe``:
uk: Виключити інше розширення імені файлу тепер легко; просто додайте його як альтернативу всередину твердження. Наступний шаблон виключає імена файлів, які закінчуються на ``bat`` або ``exe``:

source: Modifying Strings
uk: Зміна рядків

source: Up to this point, we've simply performed searches against a static string. Regular expressions are also commonly used to modify strings in various ways, using the following pattern methods:
uk: До цього моменту ми просто виконували пошук у статичному рядку. Регулярні вирази також часто використовуються для зміни рядків різними способами, використовуючи такі методи шаблонів:

source: Split the string into a list, splitting it wherever the RE matches
uk: Розділіть рядок на список, розділивши його там, де відповідає RE

source: Find all substrings where the RE matches, and replace them with a different string
uk: Знайдіть усі підрядки, де відповідає RE, і замініть їх іншим рядком

source: Does the same thing as :meth:`!sub`, but returns the new string and the number of replacements
uk: Робить те саме, що :meth:`!sub`, але повертає новий рядок і кількість замін

source: Splitting Strings
uk: Розбиття рядків

source: The :meth:`~re.Pattern.split` method of a pattern splits a string apart wherever the RE matches, returning a list of the pieces. It's similar to the :meth:`~str.split` method of strings but provides much more generality in the delimiters that you can split by; string :meth:`!split` only supports splitting by whitespace or by a fixed string. As you'd expect, there's a module-level :func:`re.split` function, too.
uk: Метод шаблону :meth:`~re.Pattern.split` розділяє рядок на частини, де збігається RE, повертаючи список фрагментів. Він подібний до методу рядків :meth:`~str.split`, але надає набагато більшу загальність роздільників, за якими можна розділяти; string :meth:`!split` підтримує лише поділ за пробілами або за фіксованим рядком. Як і слід було очікувати, також існує функція :func:`re.split` на рівні модуля.

source: Split *string* by the matches of the regular expression. If capturing parentheses are used in the RE, then their contents will also be returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits are performed.
uk: Розділити *рядок* за збігами регулярного виразу. Якщо в RE використовуються круглі дужки, їхній вміст також повертатиметься як частина результуючого списку. Якщо *maxsplit* відмінний від нуля, виконується не більше ніж *maxsplit*.

source: You can limit the number of splits made, by passing a value for *maxsplit*. When *maxsplit* is nonzero, at most *maxsplit* splits will be made, and the remainder of the string is returned as the final element of the list. In the following example, the delimiter is any sequence of non-alphanumeric characters. ::
uk: Ви можете обмежити кількість зроблених поділів, передавши значення *maxsplit*. Якщо *maxsplit* відмінний від нуля, буде виконано щонайбільше *maxsplit* розбиття, а залишок рядка повертається як останній елемент списку. У наступному прикладі роздільником є будь-яка послідовність не буквено-цифрових символів. ::

source: Sometimes you're not only interested in what the text between delimiters is, but also need to know what the delimiter was. If capturing parentheses are used in the RE, then their values are also returned as part of the list. Compare the following calls::
uk: Іноді вам не тільки цікаво, що таке текст між роздільниками, а й потрібно знати, що це за роздільник. Якщо в RE використовуються круглі дужки, їх значення також повертаються як частина списку. Порівняйте наступні виклики:

source: The module-level function :func:`re.split` adds the RE to be used as the first argument, but is otherwise the same. ::
uk: Функція рівня модуля :func:`re.split` додає RE, який буде використовуватися як перший аргумент, але в іншому вона така сама. ::

source: Search and Replace
uk: Пошук і заміна

source: Another common task is to find all the matches for a pattern, and replace them with a different string. The :meth:`~re.Pattern.sub` method takes a replacement value, which can be either a string or a function, and the string to be processed.
uk: Ще одне поширене завдання — знайти всі збіги для шаблону та замінити їх іншим рядком. Метод :meth:`~re.Pattern.sub` приймає значення заміни, яке може бути або рядком, або функцією, і рядок, який потрібно обробити.

source: Returns the string obtained by replacing the leftmost non-overlapping occurrences of the RE in *string* by the replacement *replacement*. If the pattern isn't found, *string* is returned unchanged.
uk: Повертає рядок, отриманий шляхом заміни крайніх лівих неперекриваючих входжень RE в *рядку* на заміну *replacement*. Якщо шаблон не знайдено, *рядок* повертається без змін.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. The default value of 0 means to replace all occurrences.
uk: Необов’язковий аргумент *count* — це максимальна кількість шаблонів, які потрібно замінити; *count* має бути невід’ємним цілим числом. Значення за замовчуванням 0 означає заміну всіх входжень.

source: Here's a simple example of using the :meth:`~re.Pattern.sub` method. It replaces colour names with the word ``colour``::
uk: Ось простий приклад використання методу :meth:`~re.Pattern.sub`. Він замінює назви кольорів словом ``колір``::

source: The :meth:`~re.Pattern.subn` method does the same work, but returns a 2-tuple containing the new string value and the number of replacements that were performed::
uk: Метод :meth:`~re.Pattern.subn` виконує ту саму роботу, але повертає 2-кортеж, що містить нове значення рядка та кількість виконаних замін:

source: Empty matches are replaced only when they're not adjacent to a previous empty match. ::
uk: Порожні збіги замінюються лише тоді, коли вони не суміжні з попереднім порожнім збігом. ::

source: If *replacement* is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by the corresponding group in the RE. This lets you incorporate portions of the original text in the resulting replacement string.
uk: Якщо *replacement* є рядком, будь-які вихідні символи зворотної косої риски в ньому обробляються. Тобто ``\n`` перетворюється на один символ нового рядка, ``\r`` перетворюється на повернення каретки і так далі. Невідомі вихідні коди, такі як ``\&`` залишаються в спокої. Зворотні посилання, такі як ``\6``, замінюються підрядком, який відповідає відповідній групі в RE. Це дає змогу включати частини вихідного тексту в отриманий рядок заміни.

source: This example matches the word ``section`` followed by a string enclosed in ``{``, ``}``, and changes ``section`` to ``subsection``::
uk: Цей приклад відповідає слову ``розділ``, за яким слідує рядок, укладений у ``{``, ``}``, і змінює ``розділ`` на ``підрозділ``::

source: There's also a syntax for referring to named groups as defined by the ``(?P<name>...)`` syntax. ``\g<name>`` will use the substring matched by the group named ``name``, and ``\g<number>`` uses the corresponding group number. ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement string such as ``\g<2>0``. (``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``.) The following substitutions are all equivalent, but use all three variations of the replacement string. ::
uk: Існує також синтаксис для посилань на іменовані групи, як визначено синтаксисом ``(?P <name> ...)``. ``\g <name>`` використовуватиме підрядок, який відповідає групі з назвою ``name``, а ``\g <number>`` використовує відповідний номер групи. ``\g <2>``, отже, еквівалентний ``\2``, але не є неоднозначним у рядку заміни, такому як ``\g <2> 0``. (``\20`` буде інтерпретуватися як посилання на групу 20, а не як посилання на групу 2, за якою йде літеральний символ ``'0''``.) Усі наступні заміни еквівалентні, але використовують усі три варіанти рядок заміни. ::

source: *replacement* can also be a function, which gives you even more control. If *replacement* is a function, the function is called for every non-overlapping occurrence of *pattern*. On each call, the function is passed a :ref:`match object <match-objects>` argument for the match and can use this information to compute the desired replacement string and return it.
uk: *заміна* також може бути функцією, яка дає вам ще більше контролю. Якщо *replacement* є функцією, функція викликається для кожного неперекриваючого входження *pattern*. Під час кожного виклику функції передається аргумент :ref:`match object <match-objects>` для відповідності, і ця інформація може використовуватися для обчислення потрібного рядка заміни та повернення його.

source: In the following example, the replacement function translates decimals into hexadecimal::
uk: У наступному прикладі функція заміни перетворює десяткові числа в шістнадцяткові:

source: When using the module-level :func:`re.sub` function, the pattern is passed as the first argument. The pattern may be provided as an object or as a string; if you need to specify regular expression flags, you must either use a pattern object as the first parameter, or use embedded modifiers in the pattern string, e.g. ``sub("(?i)b+", "x", "bbbb BBBB")`` returns ``'x x'``.
uk: Під час використання функції :func:`re.sub` на рівні модуля шаблон передається як перший аргумент. Шаблон може бути наданий як об'єкт або як рядок; якщо вам потрібно вказати прапорці регулярного виразу, ви повинні або використовувати об’єкт шаблону як перший параметр, або використати вбудовані модифікатори в рядок шаблону, напр. ``sub("(?i)b+", "x", "bbbb BBBB")`` повертає ``'x x''``.

source: Common Problems
uk: Загальні проблеми

source: Regular expressions are a powerful tool for some applications, but in some ways their behaviour isn't intuitive and at times they don't behave the way you may expect them to. This section will point out some of the most common pitfalls.
uk: Регулярні вирази є потужним інструментом для деяких програм, але в певному сенсі їх поведінка не є інтуїтивно зрозумілою, а іноді вони поводяться не так, як ви від них можете очікувати. У цьому розділі буде вказано на деякі з найпоширеніших пасток.

source: Use String Methods
uk: Використовуйте рядкові методи

source: Sometimes using the :mod:`re` module is a mistake. If you're matching a fixed string, or a single character class, and you're not using any :mod:`re` features such as the :const:`~re.IGNORECASE` flag, then the full power of regular expressions may not be required. Strings have several methods for performing operations with fixed strings and they're usually much faster, because the implementation is a single small C loop that's been optimized for the purpose, instead of the large, more generalized regular expression engine.
uk: Іноді використання модуля :mod:`re` є помилкою. Якщо ви зіставляєте фіксований рядок або одиничний клас символів і не використовуєте жодних функцій :mod:`re`, таких як прапор :const:`~re.IGNORECASE`, тоді повна потужність регулярних виразів може не знадобитися. Рядки мають кілька методів для виконання операцій із фіксованими рядками, і зазвичай вони набагато швидші, оскільки реалізація являє собою один маленький цикл C, оптимізований для цієї мети, замість великого, більш узагальненого механізму регулярних виразів.

source: One example might be replacing a single fixed string with another one; for example, you might replace ``word`` with ``deed``. :func:`re.sub` seems like the function to use for this, but consider the :meth:`~str.replace` method. Note that :meth:`!replace` will also replace ``word`` inside words, turning ``swordfish`` into ``sdeedfish``, but the naive RE ``word`` would have done that, too. (To avoid performing the substitution on parts of words, the pattern would have to be ``\bword\b``, in order to require that ``word`` have a word boundary on either side. This takes the job beyond :meth:`!replace`'s abilities.)
uk: Одним із прикладів може бути заміна одного фіксованого рядка іншим; наприклад, ви можете замінити ``слово`` на ``справа``. :func:`re.sub` здається функцією для цього, але розгляньте метод :meth:`~str.replace`. Зауважте, що :meth:`!replace` також замінить ``word`` всередині слів, перетворивши ``swordfish`` на ``sdeedfish``, але наївний RE ``word`` також зробив би це. (Щоб уникнути виконання заміни на частинах слів, шаблон має бути ``\bword\b``, щоб вимагати, щоб ``слово`` мало межу слова з обох боків. Це виводить роботу за межі :meth:`!replace`.)

source: Another common task is deleting every occurrence of a single character from a string or replacing it with another single character. You might do this with something like ``re.sub('\n', ' ', S)``, but :meth:`~str.translate` is capable of doing both tasks and will be faster than any regular expression operation can be.
uk: Інше поширене завдання — видалення кожного входження одного символу з рядка або заміна його іншим окремим символом. Ви можете зробити це за допомогою чогось на зразок ``re.sub('\n', ' ', S)``, але :meth:`~str.translate` здатний виконувати обидва завдання та буде швидшим за будь-який регулярний вираз операція може бути.

source: In short, before turning to the :mod:`re` module, consider whether your problem can be solved with a faster and simpler string method.
uk: Коротше кажучи, перш ніж звернутися до модуля :mod:`re`, подумайте, чи можна вирішити вашу проблему швидшим і простішим методом рядка.

source: match() versus search()
uk: match() проти search()

source: The :func:`~re.match` function only checks if the RE matches at the beginning of the string while :func:`~re.search` will scan forward through the string for a match. It's important to keep this distinction in mind. Remember, :func:`!match` will only report a successful match which will start at 0; if the match wouldn't start at zero, :func:`!match` will *not* report it. ::
uk: Функція :func:`~re.match` лише перевіряє, чи RE збігається на початку рядка, тоді як :func:`~re.search` скануватиме рядок вперед у пошуках відповідності. Важливо пам’ятати про цю відмінність. Пам’ятайте, :func:`!match` повідомлятиме лише про успішний збіг, який розпочнеться з 0; якщо збіг не починається з нуля, :func:`!match` *не* повідомить про це. ::

source: On the other hand, :func:`~re.search` will scan forward through the string, reporting the first match it finds. ::
uk: З іншого боку, :func:`~re.search` скануватиме рядок вперед, повідомляючи про перший знайдений збіг. ::

source: Sometimes you'll be tempted to keep using :func:`re.match`, and just add ``.*`` to the front of your RE. Resist this temptation and use :func:`re.search` instead. The regular expression compiler does some analysis of REs in order to speed up the process of looking for a match. One such analysis figures out what the first character of a match must be; for example, a pattern starting with ``Crow`` must match starting with a ``'C'``. The analysis lets the engine quickly scan through the string looking for the starting character, only trying the full match if a ``'C'`` is found.
uk: Іноді у вас виникне спокуса продовжувати використовувати :func:`re.match` і просто додати ``.*`` на початку вашого RE. Утримайтесь від цієї спокуси та використовуйте замість цього :func:`re.search`. Компілятор регулярних виразів виконує деякий аналіз RE, щоб прискорити процес пошуку відповідності. Один такий аналіз визначає, яким повинен бути перший символ відповідності; наприклад, шаблон, що починається з ``Crow``, повинен збігатися з ``'C``. Аналіз дозволяє механізму швидко сканувати рядок у пошуках початкового символу, лише намагаючись знайти повну відповідність, якщо знайдено ``'C'``.

source: Adding ``.*`` defeats this optimization, requiring scanning to the end of the string and then backtracking to find a match for the rest of the RE. Use :func:`re.search` instead.
uk: Додавання ``.*`` руйнує цю оптимізацію, вимагаючи сканування до кінця рядка, а потім повернення назад, щоб знайти збіг для решти RE. Натомість використовуйте :func:`re.search`.

source: Greedy versus Non-Greedy
uk: Жадібний проти нежадібного

source: When repeating a regular expression, as in ``a*``, the resulting action is to consume as much of the pattern as possible. This fact often bites you when you're trying to match a pair of balanced delimiters, such as the angle brackets surrounding an HTML tag. The naive pattern for matching a single HTML tag doesn't work because of the greedy nature of ``.*``. ::
uk: Під час повторення регулярного виразу, як у ``a*``, результуюча дія полягає в споживанні якомога більшої частини шаблону. Цей факт часто кусає вас, коли ви намагаєтеся зіставити пару збалансованих розділювачів, таких як кутові дужки, що оточують тег HTML. Наївний шаблон для відповідності одному тегу HTML не працює через жадібний характер ``.*``. ::

source: The RE matches the ``'<'`` in ``'<html>'``, and the ``.*`` consumes the rest of the string. There's still more left in the RE, though, and the ``>`` can't match at the end of the string, so the regular expression engine has to backtrack character by character until it finds a match for the ``>``. The final match extends from the ``'<'`` in ``'<html>'`` to the ``'>'`` in ``'</title>'``, which isn't what you want.
uk: RE відповідає ``'<'`` in ``'<html>'``, а ``.*`` займає решту рядка. Однак у RE залишилося ще більше, і ``>`` не може збігатися в кінці рядка, тому система регулярних виразів має відстежувати символ за символом, поки не знайде відповідність ``>``. Фінальний збіг поширюється від ``' <'`` in ``'<html> ''`` до ``'>''`` в ``' </title> ''``, що не те, чого ви хочете.

source: In this case, the solution is to use the non-greedy quantifiers ``*?``, ``+?``, ``??``, or ``{m,n}?``, which match as *little* text as possible. In the above example, the ``'>'`` is tried immediately after the first ``'<'`` matches, and when it fails, the engine advances a character at a time, retrying the ``'>'`` at every step. This produces just the right result::
uk: У цьому випадку рішенням є використання нежадібних кванторів ``*?``, ``+?``, ``??``, або ``{m,n}?``, які відповідають як *якомога менше* тексту. У наведеному вище прикладі ``'>'`` виконується відразу після перших збігів ``'<'``, і коли це не вдається, система пересуває на символ за раз, повторюючи ``'>'`` на кожному кроці. Це дає правильний результат:

source: (Note that parsing HTML or XML with regular expressions is painful. Quick-and-dirty patterns will handle common cases, but HTML and XML have special cases that will break the obvious regular expression; by the time you've written a regular expression that handles all of the possible cases, the patterns will be *very* complicated. Use an HTML or XML parser module for such tasks.)
uk: (Зауважте, що синтаксичний аналіз HTML або XML за допомогою регулярних виразів є болючим. Швидкі та брудні шаблони впораються з типовими випадками, але HTML і XML мають особливі випадки, які порушують очевидний регулярний вираз; коли ви напишете регулярний вираз, обробляє всі можливі випадки, шаблони будуть *дуже* складними. Для таких завдань використовуйте модуль аналізатора HTML або XML.)

source: Using re.VERBOSE
uk: Використання re.VERBOSE
