Repository: python/python-docs-uk
Catalog: howto/regex.po
Languages: uk

source: By now you've probably noticed that regular expressions are a very compact notation, but they're not terribly readable. REs of moderate complexity can become lengthy collections of backslashes, parentheses, and metacharacters, making them difficult to read and understand.
uk: Наразі ви, напевно, помітили, що регулярні вирази є дуже компактним записом, але їх не дуже добре читати. RE помірної складності можуть перетворитися на довгі набори зворотних скісних риск, круглих дужок і метасимволів, що ускладнює їх читання та розуміння.

source: For such REs, specifying the :const:`re.VERBOSE` flag when compiling the regular expression can be helpful, because it allows you to format the regular expression more clearly.
uk: Для таких RE вказівка прапорця :const:`re.VERBOSE` під час компіляції регулярного виразу може бути корисною, оскільки це дозволяє форматувати регулярний вираз більш чітко.

source: The ``re.VERBOSE`` flag has several effects. Whitespace in the regular expression that *isn't* inside a character class is ignored. This means that an expression such as ``dog | cat`` is equivalent to the less readable ``dog|cat``, but ``[a b]`` will still match the characters ``'a'``, ``'b'``, or a space. In addition, you can also put comments inside a RE; comments extend from a ``#`` character to the next newline. When used with triple-quoted strings, this enables REs to be formatted more neatly::
uk: Прапор ``re.VERBOSE`` має кілька ефектів. Пробіли в регулярному виразі, яких *не* всередині класу символів, ігноруються. Це означає, що такий вираз, як ``собака | cat`` еквівалентний менш читабельному ``dog|cat``, але ``[a b]`` все одно відповідатиме символам ``'a'``, ``'b'`` або пробілу. Крім того, ви також можете розмістити коментарі всередині RE; коментарі поширюються від символу ``#`` до наступного нового рядка. При використанні з рядками в потрійних лапках це дає змогу форматувати RE більш акуратно::

source: This is far more readable than::
uk: Це набагато читабельніше, ніж:

source: Feedback
uk: Зворотній зв'язок

source: Regular expressions are a complicated topic. Did this document help you understand them? Were there parts that were unclear, or Problems you encountered that weren't covered here? If so, please send suggestions for improvements to the author.
uk: Регулярні вирази – це складна тема. Чи допоміг вам цей документ зрозуміти їх? Чи були частини, які були незрозумілими, або проблеми, з якими ви зіткнулися, які не були розглянуті тут? Якщо так, будь ласка, надішліть пропозиції щодо покращення автору.

source: The most complete book on regular expressions is almost certainly Jeffrey Friedl's Mastering Regular Expressions, published by O'Reilly. Unfortunately, it exclusively concentrates on Perl and Java's flavours of regular expressions, and doesn't contain any Python material at all, so it won't be useful as a reference for programming in Python. (The first edition covered Python's now-removed :mod:`!regex` module, which won't help you much.) Consider checking it out from your library.
uk: Найповнішою книгою про регулярні вирази майже напевно є "Опанування регулярних виразів" Джеффрі Фрідла, опублікована O'Reilly. На жаль, він зосереджений виключно на стилях регулярних виразів Perl і Java і взагалі не містить жодного матеріалу Python, тому він не буде корисним як довідник для програмування на Python. (Перше видання охоплювало видалений модуль Python :mod:`!regex`, який вам не дуже допоможе.) Подумайте про те, щоб перевірити його у своїй бібліотеці.
