Repository: python/python-docs-uk
Catalog: howto/regex.po
Languages: uk

source: In the above example, Python's automatic concatenation of string literals has been used to break up the RE into smaller pieces, but it's still more difficult to understand than the version using :const:`re.VERBOSE`.
uk: У наведеному вище прикладі автоматичне об’єднання рядкових літералів Python було використано для розбиття RE на менші частини, але це все ще важче зрозуміти, ніж версію з використанням :const:`re.VERBOSE`.

source: More Pattern Power
uk: Більше потужності шаблону

source: So far we've only covered a part of the features of regular expressions. In this section, we'll cover some new metacharacters, and how to use groups to retrieve portions of the text that was matched.
uk: Поки що ми розглянули лише частину функцій регулярних виразів. У цьому розділі ми розглянемо деякі нові метасимволи, а також те, як використовувати групи для отримання частин тексту, які збігаються.

source: More Metacharacters
uk: Більше метасимволів

source: There are some metacharacters that we haven't covered yet. Most of them will be covered in this section.
uk: Є деякі метасимволи, які ми ще не розглянули. Більшість із них буде розглянуто в цьому розділі.

source: Some of the remaining metacharacters to be discussed are :dfn:`zero-width assertions`. They don't cause the engine to advance through the string; instead, they consume no characters at all, and simply succeed or fail. For example, ``\b`` is an assertion that the current position is located at a word boundary; the position isn't changed by the ``\b`` at all. This means that zero-width assertions should never be repeated, because if they match once at a given location, they can obviously be matched an infinite number of times.
uk: Деякі метасимволи, які залишилися для обговорення, це :dfn:`затвердження нульової ширини`. Вони не змушують двигун просуватися по струні; натомість вони взагалі не використовують жодних символів і просто досягають успіху або зазнають невдачі. Наприклад, ``\b`` - це твердження, що поточна позиція розташована на межі слова; позиція взагалі не змінюється ``\b``. Це означає, що твердження нульової ширини ніколи не повинні повторюватися, оскільки якщо вони збігаються один раз у заданому місці, вони, очевидно, можуть бути зіставлені нескінченну кількість разів.

source: Alternation, or the "or" operator. If *A* and *B* are regular expressions, ``A|B`` will match any string that matches either *A* or *B*. ``|`` has very low precedence in order to make it work reasonably when you're alternating multi-character strings. ``Crow|Servo`` will match either ``'Crow'`` or ``'Servo'``, not ``'Cro'``, a ``'w'`` or an ``'S'``, and ``'ervo'``.
uk: Чергування або оператор "або". Якщо *A* і *B* є регулярними виразами, ``A|B`` відповідатиме будь-якому рядку, який відповідає *A* або *B*. ``|`` має дуже низький пріоритет, щоб він працював розумно, коли ви чергуєте багатосимвольні рядки. ``Crow|Servo`` відповідатиме ``'Crow'`` або ``'Servo'``, а не ``'Cro'``, ``'w'`` чи ``'S'`` і ``'ervo''``.

source: To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
uk: Щоб відповідати літералу ``'|'``, використовуйте ``\|`` або вкладіть його в клас символів, як у ``[|]``.

source: Matches at the beginning of lines. Unless the :const:`MULTILINE` flag has been set, this will only match at the beginning of the string. In :const:`MULTILINE` mode, this also matches immediately after each newline within the string.
uk: Збіги на початку рядків. Якщо не встановлено прапорець :const:`MULTILINE`, він збігатиметься лише на початку рядка. У режимі :const:`MULTILINE` це також збігається відразу після кожного нового рядка в рядку.

source: For example, if you wish to match the word ``From`` only at the beginning of a line, the RE to use is ``^From``. ::
uk: Наприклад, якщо ви бажаєте зіставити слово ``From`` лише на початку рядка, використовуйте RE ``^From``. ::

source: To match a literal ``'^'``, use ``\^``.
uk: Щоб відповідати літералу ``'^'``, використовуйте ``\^``.

source: Matches at the end of a line, which is defined as either the end of the string, or any location followed by a newline character. ::
uk: Збігається в кінці рядка, який визначається як кінець рядка або будь-яке місце, після якого йде символ нового рядка. ::

source: To match a literal ``'$'``, use ``\$`` or enclose it inside a character class, as in ``[$]``.
uk: Щоб відповідати літералу ``'$'``, використовуйте ``\$`` або вкладіть його в клас символів, як у ``[$]``.

source: Matches only at the start of the string. When not in :const:`MULTILINE` mode, ``\A`` and ``^`` are effectively the same. In :const:`MULTILINE` mode, they're different: ``\A`` still matches only at the beginning of the string, but ``^`` may match at any location inside the string that follows a newline character.
uk: Збігається лише на початку рядка. Якщо не в режимі :const:`MULTILINE`, ``\A`` і ``^`` фактично однакові. У режимі :const:`MULTILINE` вони відрізняються: ``\A`` все ще збігається лише на початку рядка, але ``^`` може збігатися в будь-якому місці всередині рядка, яке слідує за символом нового рядка.

source: Matches only at the end of the string.
uk: Збігається лише в кінці рядка.

source: Word boundary. This is a zero-width assertion that matches only at the beginning or end of a word. A word is defined as a sequence of alphanumeric characters, so the end of a word is indicated by whitespace or a non-alphanumeric character.
uk: Кордон слова. Це твердження нульової ширини, яке збігається лише на початку або в кінці слова. Слово визначається як послідовність буквено-цифрових символів, тому кінець слова позначається пробілом або неалфавітно-цифровим символом.

source: The following example matches ``class`` only when it's a complete word; it won't match when it's contained inside another word. ::
uk: Наступний приклад відповідає ``класу`` лише тоді, коли це повне слово; воно не збігається, якщо міститься всередині іншого слова. ::

source: There are two subtleties you should remember when using this special sequence. First, this is the worst collision between Python's string literals and regular expression sequences. In Python's string literals, ``\b`` is the backspace character, ASCII value 8. If you're not using raw strings, then Python will convert the ``\b`` to a backspace, and your RE won't match as you expect it to. The following example looks the same as our previous RE, but omits the ``'r'`` in front of the RE string. ::
uk: Використовуючи цю особливу послідовність, слід пам’ятати про дві тонкощі. По-перше, це найгірша колізія між рядковими літералами Python і послідовностями регулярних виразів. У рядкових літералах Python ``\b`` є символом повернення, значення ASCII 8. Якщо ви не використовуєте необроблені рядки, тоді Python перетворить ``\b`` на пропуск, а ваш RE не буде відповідати, як ви очікуєте. Наступний приклад виглядає так само, як наш попередній RE, але опущено ``'r'`` перед рядком RE. ::

source: Second, inside a character class, where there's no use for this assertion, ``\b`` represents the backspace character, for compatibility with Python's string literals.
uk: По-друге, всередині класу символів, де немає користі для цього твердження, ``\b`` представляє символ зворотного простору для сумісності з рядковими літералами Python.

source: Another zero-width assertion, this is the opposite of ``\b``, only matching when the current position is not at a word boundary.
uk: Інше твердження нульової ширини, це протилежність ``\b``, збігається лише тоді, коли поточна позиція не знаходиться на межі слова.

source: Grouping
uk: Групування

source: Frequently you need to obtain more information than just whether the RE matched or not. Regular expressions are often used to dissect strings by writing a RE divided into several subgroups which match different components of interest. For example, an RFC-822 header line is divided into a header name and a value, separated by a ``':'``, like this:
uk: Часто вам потрібно отримати більше інформації, ніж просто відповідність RE чи ні. Регулярні вирази часто використовуються для аналізу рядків шляхом запису RE, розділеного на кілька підгруп, які відповідають різним цікавим компонентам. Наприклад, рядок заголовка RFC-822 розділено на ім’я заголовка та значення, розділені символом ``':'``, ось так:

source: This can be handled by writing a regular expression which matches an entire header line, and has one group which matches the header name, and another group which matches the header's value.
uk: Це можна вирішити, написавши регулярний вираз, який відповідає всьому рядку заголовка та має одну групу, яка відповідає імені заголовка, та іншу групу, яка відповідає значенню заголовка.

source: Groups are marked by the ``'('``, ``')'`` metacharacters. ``'('`` and ``')'`` have much the same meaning as they do in mathematical expressions; they group together the expressions contained inside them, and you can repeat the contents of a group with a quantifier, such as ``*``, ``+``, ``?``, or ``{m,n}``. For example, ``(ab)*`` will match zero or more repetitions of ``ab``. ::
uk: Групи позначені метасимволами ``'('`` та ``')'``. ``'('`` і ``')'`` мають майже те саме значення, що й у математичних виразах; вони групують вирази, що містяться в них, і ви можете повторити вміст групи за допомогою квантора, наприклад ``*``, ``+``, ``?``, або ``{m,n}``. Наприклад, ``(ab)*`` відповідатиме нулю або більше повторень ``ab``. ::

source: Groups indicated with ``'('``, ``')'`` also capture the starting and ending index of the text that they match; this can be retrieved by passing an argument to :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, and :meth:`~re.Match.span`. Groups are numbered starting with 0. Group 0 is always present; it's the whole RE, so :ref:`match object <match-objects>` methods all have group 0 as their default argument. Later we'll see how to express groups that don't capture the span of text that they match. ::
uk: Групи, позначені ``'('``, ``')'`` також фіксують початковий і кінцевий індекс тексту, якому вони відповідають; це можна отримати, передавши аргумент до :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end` і :meth:`~re.Match.span`. Групи нумеруються, починаючи з 0. Група 0 завжди присутня; це весь RE, тому всі методи :ref:`match object <match-objects>` мають групу 0 як аргумент за замовчуванням. Пізніше ми побачимо, як виражати групи, які не фіксують діапазон тексту, якому вони відповідають. ::

source: Subgroups are numbered from left to right, from 1 upward. Groups can be nested; to determine the number, just count the opening parenthesis characters, going from left to right. ::
uk: Підгрупи нумеруються зліва направо, починаючи з 1 і вище. Групи можуть бути вкладеними; щоб визначити число, просто порахуйте символи відкриваючих дужок, рухаючись зліва направо. ::

source: :meth:`~re.Match.group` can be passed multiple group numbers at a time, in which case it will return a tuple containing the corresponding values for those groups. ::
uk: :meth:`~re.Match.group` можна передати кілька номерів груп одночасно, і в цьому випадку він поверне кортеж, що містить відповідні значення для цих груп. ::

source: The :meth:`~re.Match.groups` method returns a tuple containing the strings for all the subgroups, from 1 up to however many there are. ::
uk: Метод :meth:`~re.Match.groups` повертає кортеж, що містить рядки для всіх підгруп, від 1 до будь-якої кількості. ::

source: Backreferences in a pattern allow you to specify that the contents of an earlier capturing group must also be found at the current location in the string. For example, ``\1`` will succeed if the exact contents of group 1 can be found at the current position, and fails otherwise. Remember that Python's string literals also use a backslash followed by numbers to allow including arbitrary characters in a string, so be sure to use a raw string when incorporating backreferences in a RE.
uk: Зворотні посилання в шаблоні дозволяють вказати, що вміст попередньої групи захоплення також має бути знайдений у поточному місці в рядку. Наприклад, ``\1`` буде успішним, якщо точний вміст групи 1 можна знайти в поточній позиції, і не вдасться в іншому випадку. Пам’ятайте, що рядкові літерали Python також використовують зворотну скісну риску, за якою слідують числа, щоб дозволити включати довільні символи в рядок, тому обов’язково використовуйте необроблений рядок, коли включаєте зворотні посилання в RE.

source: For example, the following RE detects doubled words in a string. ::
uk: Наприклад, наступний RE виявляє подвоєні слова в рядку. ::

source: Backreferences like this aren't often useful for just searching through a string --- there are few text formats which repeat data in this way --- but you'll soon find out that they're *very* useful when performing string substitutions.
uk: Подібні зворотні посилання не часто корисні лише для пошуку в рядку --- є кілька текстових форматів, які повторюють дані таким чином --- але незабаром ви зрозумієте, що вони *дуже* корисні під час виконання замін рядків .

source: Non-capturing and Named Groups
uk: Неперехоплювані та іменовані групи

source: Elaborate REs may use many groups, both to capture substrings of interest, and to group and structure the RE itself. In complex REs, it becomes difficult to keep track of the group numbers. There are two features which help with this problem. Both of them use a common syntax for regular expression extensions, so we'll look at that first.
uk: Розроблені RE можуть використовувати багато груп як для захоплення цікавих підрядків, так і для групування та структурування самого RE. У складних RE стає важко відслідковувати номери груп. Є дві функції, які допомагають вирішити цю проблему. Обидва вони використовують загальний синтаксис для розширень регулярних виразів, тому ми розглянемо це спочатку.

source: Perl 5 is well known for its powerful additions to standard regular expressions. For these new features the Perl developers couldn't choose new single-keystroke metacharacters or new special sequences beginning with ``\`` without making Perl's regular expressions confusingly different from standard REs. If they chose ``&`` as a new metacharacter, for example, old expressions would be assuming that ``&`` was a regular character and wouldn't have escaped it by writing ``\&`` or ``[&]``.
uk: Perl 5 добре відомий своїми потужними доповненнями до стандартних регулярних виразів. Для цих нових можливостей розробники Perl не могли вибрати нові одноклавішні метасимволи або нові спеціальні послідовності, що починаються з ``\``, не зробивши регулярні вирази Perl різко відмінними від стандартних RE. Наприклад, якби вони вибрали ``&`` як новий метасимвол, старі вирази припускали б, що ``&`` був звичайним символом і не міг би уникнути його, написавши ``\&`` або ``[ &]``.

source: The solution chosen by the Perl developers was to use ``(?...)`` as the extension syntax. ``?`` immediately after a parenthesis was a syntax error because the ``?`` would have nothing to repeat, so this didn't introduce any compatibility problems. The characters immediately after the ``?`` indicate what extension is being used, so ``(?=foo)`` is one thing (a positive lookahead assertion) and ``(?:foo)`` is something else (a non-capturing group containing the subexpression ``foo``).
uk: Рішенням, обраним розробниками Perl, було використання ``(?...)`` як синтаксису розширення. ``?`` відразу після дужок було синтаксичною помилкою, оскільки ``?`` не було б чого повторювати, тому це не створювало жодних проблем із сумісністю. Символи відразу після ``?`` вказують на те, яке розширення використовується, тому ``(?=foo)`` це одне (позитивне твердження попереднього перегляду), а ``(?:foo)`` це щось інше ( група без захоплення, що містить підвираз ``foo``).

source: Python supports several of Perl's extensions and adds an extension syntax to Perl's extension syntax. If the first character after the question mark is a ``P``, you know that it's an extension that's specific to Python.
uk: Python підтримує кілька розширень Perl і додає синтаксис розширення до синтаксису розширення Perl. Якщо першим символом після знака питання є ``P``, ви знаєте, що це розширення, специфічне для Python.

source: Now that we've looked at the general extension syntax, we can return to the features that simplify working with groups in complex REs.
uk: Тепер, коли ми розглянули загальний синтаксис розширення, ми можемо повернутися до функцій, які спрощують роботу з групами в складних RE.

source: Sometimes you'll want to use a group to denote a part of a regular expression, but aren't interested in retrieving the group's contents. You can make this fact explicit by using a non-capturing group: ``(?:...)``, where you can replace the ``...`` with any other regular expression. ::
uk: Іноді вам потрібно використати групу для позначення частини регулярного виразу, але ви не зацікавлені в отриманні вмісту групи. Ви можете зробити цей факт явним, використовуючи групу без захоплення: ``(?:...)``, де ви можете замінити ``...`` будь-яким іншим регулярним виразом. ::

source: Except for the fact that you can't retrieve the contents of what the group matched, a non-capturing group behaves exactly the same as a capturing group; you can put anything inside it, repeat it with a repetition metacharacter such as ``*``, and nest it within other groups (capturing or non-capturing). ``(?:...)`` is particularly useful when modifying an existing pattern, since you can add new groups without changing how all the other groups are numbered. It should be mentioned that there's no performance difference in searching between capturing and non-capturing groups; neither form is any faster than the other.
uk: За винятком того факту, що ви не можете отримати вміст того, що відповідає групі, група без захоплення поводиться точно так само, як група захоплення; ви можете помістити в нього що завгодно, повторити це з метасимволом повторення, таким як ``*``, і вкладати його в інші групи (захоплюючі чи незахоплюючі). ``(?:...)`` особливо корисний під час зміни існуючого шаблону, оскільки ви можете додавати нові групи, не змінюючи спосіб нумерації всіх інших груп. Слід зазначити, що немає різниці в продуктивності пошуку між групами захоплення та групами без захоплення; жодна форма не є швидшою за іншу.

source: A more significant feature is named groups: instead of referring to them by numbers, groups can be referenced by a name.
uk: Більш важливою особливістю є іменовані групи: замість того, щоб посилатися на них номерами, на групи можна посилатися за назвою.

source: The syntax for a named group is one of the Python-specific extensions: ``(?P<name>...)``. *name* is, obviously, the name of the group. Named groups behave exactly like capturing groups, and additionally associate a name with a group. The :ref:`match object <match-objects>` methods that deal with capturing groups all accept either integers that refer to the group by number or strings that contain the desired group's name. Named groups are still given numbers, so you can retrieve information about a group in two ways::
uk: Синтаксис іменованої групи є одним із специфічних для Python розширень: ``(?P <name> ...)``. *name* — це, очевидно, назва групи. Іменовані групи поводяться так само, як групи захоплення, і додатково пов’язують назву з групою. Усі методи :ref:`match object <match-objects>`, які мають справу із захопленням груп, приймають або цілі числа, які посилаються на групу за номером, або рядки, які містять назву потрібної групи. Іменовані групи все ще мають номери, тому ви можете отримати інформацію про групу двома способами:

source: Additionally, you can retrieve named groups as a dictionary with :meth:`~re.Match.groupdict`::
uk: Крім того, ви можете отримати іменовані групи як словник за допомогою :meth:`~re.Match.groupdict`::

source: Named groups are handy because they let you use easily remembered names, instead of having to remember numbers. Here's an example RE from the :mod:`imaplib` module::
uk: Іменовані групи зручні, оскільки вони дозволяють використовувати імена, які легко запам’ятовуються, замість того, щоб запам’ятовувати числа. Ось приклад RE з модуля :mod:`imaplib`::

source: It's obviously much easier to retrieve ``m.group('zonem')``, instead of having to remember to retrieve group 9.
uk: Очевидно, набагато простіше отримати ``m.group('zonem')``, замість того, щоб пам'ятати, що потрібно отримати групу 9.

source: The syntax for backreferences in an expression such as ``(...)\1`` refers to the number of the group. There's naturally a variant that uses the group name instead of the number. This is another Python extension: ``(?P=name)`` indicates that the contents of the group called *name* should again be matched at the current point. The regular expression for finding doubled words, ``\b(\w+)\s+\1\b`` can also be written as ``\b(?P<word>\w+)\s+(?P=word)\b``::
uk: Синтаксис зворотних посилань у такому виразі, як ``(...)\1``, посилається на номер групи. Природно, існує варіант, який використовує назву групи замість номера. Це ще одне розширення Python: ``(?P=name)`` вказує на те, що вміст групи з назвою *name* знову повинен бути зіставлений у поточній точці. Регулярний вираз для пошуку подвоєних слів ``\b(\w+)\s+\1\b`` також можна записати як ``\b(?P<word>\w+)\s+(?P=word)\b``::

source: Lookahead Assertions
uk: Попередні твердження

source: Another zero-width assertion is the lookahead assertion. Lookahead assertions are available in both positive and negative form, and look like this:
uk: Іншим твердженням нульової ширини є твердження прогнозу. Попередні твердження доступні як у позитивній, так і в негативній формі та виглядають так:

source: Positive lookahead assertion. This succeeds if the contained regular expression, represented here by ``...``, successfully matches at the current location, and fails otherwise. But, once the contained expression has been tried, the matching engine doesn't advance at all; the rest of the pattern is tried right where the assertion started.
uk: Позитивне прогнозне твердження. Це виконується успішно, якщо регулярний вираз, представлений тут ``...``, успішно збігається в поточному місці, і не вдається в іншому випадку. Але після спроби виразу, що міститься, механізм пошуку відповідностей взагалі не переходить; решта шаблону пробується там, де почалося твердження.

source: Negative lookahead assertion. This is the opposite of the positive assertion; it succeeds if the contained expression *doesn't* match at the current position in the string.
uk: Негативне прогнозне твердження. Це протилежне до позитивного твердження; це вдається, якщо вираз, що міститься, *не* збігається з поточною позицією в рядку.

source: To make this concrete, let's look at a case where a lookahead is useful. Consider a simple pattern to match a filename and split it apart into a base name and an extension, separated by a ``.``. For example, in ``news.rc``, ``news`` is the base name, and ``rc`` is the filename's extension.
uk: Щоб зробити це конкретним, давайте подивимося на випадок, де корисний погляд наперед. Розглянемо простий шаблон для відповідності назві файлу та розділення його на базове ім’я та розширення, розділені символом ``.``. Наприклад, у ``news.rc`` ``news`` є базовою назвою, а ``rc`` є розширенням назви файлу.

source: The pattern to match this is quite simple:
uk: Викрійка для цього досить проста:
