Repository: python/python-docs-uk
Catalog: howto/regex.po
Languages: uk

source: The Backslash Plague
uk: Зворотна коса чума

source: As stated earlier, regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This conflicts with Python's usage of the same character for the same purpose in string literals.
uk: Як було сказано раніше, у регулярних виразах використовується символ зворотної косої риски (``'\'``), щоб позначити спеціальні форми або дозволити використовувати спеціальні символи без виклику їх особливого значення. Це суперечить використанню Python того самого символу для тієї ж мети в рядкових літералах.

source: Let's say you want to write a RE that matches the string ``\section``, which might be found in a LaTeX file. To figure out what to write in the program code, start with the desired string to be matched. Next, you must escape any backslashes and other metacharacters by preceding them with a backslash, resulting in the string ``\\section``. The resulting string that must be passed to :func:`re.compile` must be ``\\section``. However, to express this as a Python string literal, both backslashes must be escaped *again*.
uk: Припустімо, ви хочете написати RE, який відповідає рядку ``\section``, який можна знайти у файлі LaTeX. Щоб зрозуміти, що писати в коді програми, почніть із потрібного рядка, який потрібно знайти. Далі ви повинні уникнути будь-яких зворотних похилих рисок та інших метасимволів, поставивши перед ними зворотну похилу риску, що призведе до рядка ``\\section``. Отриманий рядок, який потрібно передати в :func:`re.compile`, має бути ``\\section``. Однак, щоб виразити це як рядковий літерал Python, обидві зворотні похилі риски потрібно екранувати *знову*.

source: Characters
uk: Персонажі

source: Stage
uk: етап

source: ``\section``
uk: ``\розділ``

source: Text string to be matched
uk: Текстовий рядок, який потрібно знайти

source: ``\\section``
uk: ``\\розділ``

source: Escaped backslash for :func:`re.compile`
uk: Екранований зворотний слеш для :func:`re.compile`

source: ``"\\\\section"``
uk: ``"\\\\розділ"``

source: Escaped backslashes for a string literal
uk: Екрановані зворотні косі риски для рядкового літералу

source: In short, to match a literal backslash, one has to write ``'\\\\'`` as the RE string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. In REs that feature backslashes repeatedly, this leads to lots of repeated backslashes and makes the resulting strings difficult to understand.
uk: Коротше кажучи, щоб відповідати буквальному зворотному слешу, потрібно написати ``'\\\\'`` як рядок RE, тому що регулярний вираз має бути ``\\``, а кожен зворотний слеш має бути виражений як ``\\`` всередині звичайного рядкового літералу Python. У RE, які неодноразово містять зворотні косі риски, це призводить до великої кількості повторюваних зворотних косих риск і ускладнює розуміння результуючих рядків.

source: The solution is to use Python's raw string notation for regular expressions; backslashes are not handled in any special way in a string literal prefixed with ``'r'``, so ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Regular expressions will often be written in Python code using this raw string notation.
uk: Рішення полягає у використанні необробленої рядкової нотації Python для регулярних виразів; зворотні косі риски не обробляються спеціальним чином у рядковому літералі з префіксом ``'r'``, тому ``r"\n"`` є двосимвольним рядком, що містить ``'\'`` і ``' n'``, тоді як ``"\n"`` є односимвольним рядком, що містить новий рядок. Регулярні вирази часто записуються в коді Python з використанням цієї необробленої рядкової нотації.

source: In addition, special escape sequences that are valid in regular expressions, but not valid as Python string literals, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`, which means the sequences will be invalid if raw string notation or escaping the backslashes isn't used.
uk: Крім того, спеціальні керуючі послідовності, дійсні в регулярних виразах, але недійсні як рядкові літерали Python, тепер призводять до :exc:`DeprecationWarning` і згодом стануть :exc:`SyntaxError`, що означає, що послідовності будуть недійсними якщо не використовується необроблений рядковий запис або екранування зворотних скісних риск.

source: Regular String
uk: Звичайний рядок

source: Raw string
uk: Необроблений рядок

source: ``r"\\section"``
uk: ``r"\\розділ"``

source: Performing Matches
uk: Виконання матчів

source: Once you have an object representing a compiled regular expression, what do you do with it? Pattern objects have several methods and attributes. Only the most significant ones will be covered here; consult the :mod:`re` docs for a complete listing.
uk: Якщо у вас є об’єкт, що представляє скомпільований регулярний вираз, що ви з ним робите? Об’єкти шаблонів мають кілька методів і атрибутів. Тут будуть розглянуті лише найважливіші з них; зверніться до документів :mod:`re` для отримання повного списку.

source: Method/Attribute
uk: Метод/атрибут

source: Purpose
uk: призначення

source: Determine if the RE matches at the beginning of the string.
uk: Визначте, чи відповідає RE на початку рядка.

source: Scan through a string, looking for any location where this RE matches.
uk: Проскануйте рядок, шукаючи будь-яке місце, де цей RE відповідає.

source: Find all substrings where the RE matches, and returns them as a list.
uk: Знайти всі підрядки, де відповідає RE, і повернути їх у вигляді списку.

source: Find all substrings where the RE matches, and returns them as an :term:`iterator`.
uk: Знайти всі підрядки, де відповідає RE, і повернути їх як :term:`iterator`.

source: :meth:`~re.Pattern.match` and :meth:`~re.Pattern.search` return ``None`` if no match can be found. If they're successful, a :ref:`match object <match-objects>` instance is returned, containing information about the match: where it starts and ends, the substring it matched, and more.
uk: :meth:`~re.Pattern.match` і :meth:`~re.Pattern.search` повертають ``None``, якщо збіг не знайдено. Якщо вони успішні, повертається екземпляр :ref:`match object <match-objects>`, який містить інформацію про збіг: де він починається і закінчується, підрядок, з яким він збігся, тощо.

source: You can learn about this by interactively experimenting with the :mod:`re` module.
uk: Ви можете дізнатися про це, інтерактивно поекспериментувавши з модулем :mod:`re`.

source: This HOWTO uses the standard Python interpreter for its examples. First, run the Python interpreter, import the :mod:`re` module, and compile a RE::
uk: Цей HOWTO використовує стандартний інтерпретатор Python для своїх прикладів. Спочатку запустіть інтерпретатор Python, імпортуйте модуль :mod:`re` і скомпілюйте RE::

source: Now, you can try matching various strings against the RE ``[a-z]+``. An empty string shouldn't match at all, since ``+`` means 'one or more repetitions'. :meth:`~re.Pattern.match` should return ``None`` in this case, which will cause the interpreter to print no output. You can explicitly print the result of :meth:`!match` to make this clear. ::
uk: Тепер ви можете спробувати зіставити різні рядки з RE ``[a-z]+``. Порожній рядок взагалі не повинен збігатися, оскільки ``+`` означає 'одне або більше повторень'. :meth:`~re.Pattern.match` має повернути ``None`` у цьому випадку, що призведе до того, що інтерпретатор не друкуватиме вихідні дані. Ви можете явно надрукувати результат :meth:`!match`, щоб це було зрозуміло. ::

source: Now, let's try it on a string that it should match, such as ``tempo``. In this case, :meth:`~re.Pattern.match` will return a :ref:`match object <match-objects>`, so you should store the result in a variable for later use. ::
uk: Тепер давайте спробуємо це на рядку, який має збігатися, наприклад ``tempo``. У цьому випадку :meth:`~re.Pattern.match` поверне :ref:`об’єкт відповідності <match-objects>`, тому ви повинні зберегти результат у змінній для подальшого використання. ::

source: Now you can query the :ref:`match object <match-objects>` for information about the matching string. Match object instances also have several methods and attributes; the most important ones are:
uk: Тепер ви можете запитати :ref:`match object <match-objects>` для отримання інформації про відповідний рядок. Екземпляри об’єктів зіставлення також мають кілька методів і атрибутів; найважливіші з них:

source: Return the string matched by the RE
uk: Повертає рядок, який відповідає RE

source: Return the starting position of the match
uk: Повернути вихідну позицію матчу

source: Return the ending position of the match
uk: Повернення кінцевої позиції матчу

source: Return a tuple containing the (start, end) positions of the match
uk: Повертає кортеж, що містить (початкову, кінцеву) позиції збігу

source: Trying these methods will soon clarify their meaning::
uk: Спроба цих методів незабаром прояснить їх значення:

source: :meth:`~re.Match.group` returns the substring that was matched by the RE. :meth:`~re.Match.start` and :meth:`~re.Match.end` return the starting and ending index of the match. :meth:`~re.Match.span` returns both start and end indexes in a single tuple. Since the :meth:`~re.Pattern.match` method only checks if the RE matches at the start of a string, :meth:`!start` will always be zero. However, the :meth:`~re.Pattern.search` method of patterns scans through the string, so the match may not start at zero in that case. ::
uk: :meth:`~re.Match.group` повертає підрядок, який був зіставлений RE. :meth:`~re.Match.start` і :meth:`~re.Match.end` повертають початковий і кінцевий індекси збігу. :meth:`~re.Match.span` повертає початковий і кінцевий індекси в одному кортежі. Оскільки метод :meth:`~re.Pattern.match` лише перевіряє, чи відповідає RE на початку рядка, :meth:`!start` завжди дорівнюватиме нулю. Однак метод шаблонів :meth:`~re.Pattern.search` сканує рядок, тому в цьому випадку збіг може не початися з нуля. ::

source: In actual programs, the most common style is to store the :ref:`match object <match-objects>` in a variable, and then check if it was ``None``. This usually looks like::
uk: У реальних програмах найпоширенішим стилем є збереження :ref:`match object <match-objects>` у змінній, а потім перевірка, чи вона була ``None``. Зазвичай це виглядає так::

source: Two pattern methods return all of the matches for a pattern. :meth:`~re.Pattern.findall` returns a list of matching strings::
uk: Два методи шаблону повертають усі збіги шаблону. :meth:`~re.Pattern.findall` повертає список відповідних рядків::

source: The ``r`` prefix, making the literal a raw string literal, is needed in this example because escape sequences in a normal "cooked" string literal that are not recognized by Python, as opposed to regular expressions, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`. See :ref:`the-backslash-plague`.
uk: Префікс ``r``, який робить літерал необробленим рядковим літералом, потрібен у цьому прикладі, тому що escape-послідовності у звичайному "вареному" рядковому літералі, які не розпізнаються Python, на відміну від регулярних виразів, тепер призводять до :exc:`DeprecationWarning` і з часом стане :exc:`SyntaxError`. Дивіться :ref:`the-backslash-plague`.

source: :meth:`~re.Pattern.findall` has to create the entire list before it can be returned as the result. The :meth:`~re.Pattern.finditer` method returns a sequence of :ref:`match object <match-objects>` instances as an :term:`iterator`::
uk: :meth:`~re.Pattern.findall` має створити весь список, перш ніж його можна буде повернути як результат. Метод :meth:`~re.Pattern.finditer` повертає послідовність екземплярів :ref:`match object <match-objects>` як :term:`iterator`::

source: Module-Level Functions
uk: Функції рівня модуля

source: You don't have to create a pattern object and call its methods; the :mod:`re` module also provides top-level functions called :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub`, and so forth. These functions take the same arguments as the corresponding pattern method with the RE string added as the first argument, and still return either ``None`` or a :ref:`match object <match-objects>` instance. ::
uk: Вам не потрібно створювати шаблонний об’єкт і викликати його методи; модуль :mod:`re` також надає функції верхнього рівня під назвою :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub` і так далі. Ці функції приймають ті самі аргументи, що й відповідний метод шаблону з рядком RE, доданим як перший аргумент, і все одно повертають ``None`` або екземпляр :ref:`match object <match-objects>`. ::

source: Under the hood, these functions simply create a pattern object for you and call the appropriate method on it. They also store the compiled object in a cache, so future calls using the same RE won't need to parse the pattern again and again.
uk: Під капотом ці функції просто створюють для вас шаблонний об’єкт і викликають для нього відповідний метод. Вони також зберігають скомпільований об’єкт у кеш-пам’яті, тому для майбутніх викликів із використанням того самого RE не потрібно буде аналізувати шаблон знову і знову.

source: Should you use these module-level functions, or should you get the pattern and call its methods yourself? If you're accessing a regex within a loop, pre-compiling it will save a few function calls. Outside of loops, there's not much difference thanks to the internal cache.
uk: Ви повинні використовувати ці функції на рівні модуля, чи вам слід отримати шаблон і викликати його методи самостійно? Якщо ви отримуєте доступ до регулярного виразу в циклі, його попередня компіляція заощадить кілька викликів функцій. За межами циклів немає великої різниці завдяки внутрішньому кешу.

source: Compilation Flags
uk: Прапори компіляції

source: Compilation flags let you modify some aspects of how regular expressions work. Flags are available in the :mod:`re` module under two names, a long name such as :const:`IGNORECASE` and a short, one-letter form such as :const:`I`. (If you're familiar with Perl's pattern modifiers, the one-letter forms use the same letters; the short form of :const:`re.VERBOSE` is :const:`re.X`, for example.) Multiple flags can be specified by bitwise OR-ing them; ``re.I | re.M`` sets both the :const:`I` and :const:`M` flags, for example.
uk: Прапори компіляції дозволяють змінювати деякі аспекти роботи регулярних виразів. Прапори доступні в модулі :mod:`re` під двома назвами: довгою назвою, як-от :const:`IGNORECASE`, і короткою однолітерною формою, як-от :const:`I`. (Якщо ви знайомі з модифікаторами шаблонів Perl, однолітерні форми використовують ті самі літери; наприклад, коротка форма :const:`re.VERBOSE` це :const:`re.X`.) Кілька прапорів можуть вказувати їх порозрядним АБО; ``re.I | re.M`` встановлює, наприклад, прапорці :const:`I` і :const:`M`.

source: Here's a table of the available flags, followed by a more detailed explanation of each one.
uk: Ось таблиця доступних прапорів із більш детальним поясненням кожного з них.

source: Flag
uk: Прапор

source: Meaning
uk: Значення

source: Makes several escapes like ``\w``, ``\b``, ``\s`` and ``\d`` match only on ASCII characters with the respective property.
uk: Декілька символів екранування, як-от ``\w``, ``\b``, ``\s`` і ``\d``, збігаються лише з символами ASCII з відповідною властивістю.

source: Make ``.`` match any character, including newlines.
uk: Зробіть "." відповідним будь-якому символу, включно з новими рядками.

source: Do case-insensitive matches.
uk: Збіги без урахування регістру.

source: Do a locale-aware match.
uk: Виконайте відповідність з урахуванням локалі.

source: Multi-line matching, affecting ``^`` and ``$``.
uk: Багаторядкова відповідність, що впливає на ``^`` і ``$``.

source: :const:`VERBOSE`, :const:`X` (for 'extended')
uk: :const:`VERBOSE`, :const:`X` (для "розширеного")

source: Enable verbose REs, which can be organized more cleanly and understandably.
uk: Увімкніть докладні RE, які можна організувати більш чітко та зрозуміло.

source: Perform case-insensitive matching; character class and literal strings will match letters by ignoring case. For example, ``[A-Z]`` will match lowercase letters, too. Full Unicode matching also works unless the :const:`ASCII` flag is used to disable non-ASCII matches. When the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). ``Spam`` will match ``'Spam'``, ``'spam'``, ``'spAM'``, or ``'ſpam'`` (the latter is matched only in Unicode mode). This lowercasing doesn't take the current locale into account; it will if you also set the :const:`LOCALE` flag.
uk: Виконуйте зіставлення без урахування регістру; клас символів і літеральні рядки будуть відповідати буквам, ігноруючи регістр. Наприклад, ``[A-Z]`` також відповідатиме малим регістрам. Повна відповідність Unicode також працює, якщо не використовується прапорець :const:`ASCII`, щоб вимкнути збіги, відмінні від ASCII. Коли шаблони Unicode ``[a-z]`` або ``[A-Z]`` використовуються в поєднанні з прапором :const:`IGNORECASE`, вони відповідатимуть 52 літерам ASCII і 4 додатковим літерам, які не належать до ASCII: 'İ ' (U+0130, латинська велика літера I з крапкою вгорі), 'ı' (U+0131, латинська мала літера без крапки), 'ſ' (U+017F, латинська мала літера довге s) і 'K' (U +212A, знак Кельвіна). ``Spam`` відповідатиме ``'Spam'``, ``'spam'``, ``'spAM'`` або ``'ſpam'`` (останній збігається лише в режимі Unicode). Цей нижній регістр не враховує поточну мову; це буде, якщо ви також установите прапорець :const:`LOCALE`.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale instead of the Unicode database.
uk: Зробіть ``\w``, ``\W``, ``\b``, ``\B`` і відповідність без урахування регістру залежною від поточної мови замість бази даних Unicode.

source: Locales are a feature of the C library intended to help in writing programs that take account of language differences. For example, if you're processing encoded French text, you'd want to be able to write ``\w+`` to match words, but ``\w`` only matches the character class ``[A-Za-z]`` in bytes patterns; it won't match bytes corresponding to ``é`` or ``ç``. If your system is configured properly and a French locale is selected, certain C functions will tell the program that the byte corresponding to ``é`` should also be considered a letter. Setting the :const:`LOCALE` flag when compiling a regular expression will cause the resulting compiled object to use these C functions for ``\w``; this is slower, but also enables ``\w+`` to match French words as you'd expect. The use of this flag is discouraged in Python 3 as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages.
uk: Локалі — це функція бібліотеки C, призначена для допомоги в написанні програм, які враховують мовні відмінності. Наприклад, якщо ви обробляєте закодований французький текст, ви б хотіли мати можливість писати ``\w+`` для відповідності слів, але ``\w`` відповідає лише класу символів ``[A-Za- z]`` у шаблонах байтів; він не співпадатиме з байтами, що відповідають ``é`` або ``ç``. Якщо ваша система налаштована належним чином і вибрано французьку мову, певні функції C повідомлять програмі, що байт, який відповідає ``é``, також слід вважати літерою. Встановлення прапорця :const:`LOCALE` під час компіляції регулярного виразу змусить отриманий скомпільований об’єкт використовувати ці функції C для ``\w``; це повільніше, але також дозволяє ``\w+`` відповідати французьким словам, як ви очікуєте. Використання цього прапора не рекомендується в Python 3, оскільки механізм локалізації дуже ненадійний, він обробляє лише одну "культуру" за раз і працює лише з 8-бітними локалями. Зіставлення Unicode вже ввімкнено за замовчуванням у Python 3 для шаблонів Unicode (str), і він здатний обробляти різні локалі/мови.

source: (``^`` and ``$`` haven't been explained yet; they'll be introduced in section :ref:`more-metacharacters`.)
uk: (``^`` і ``$`` ще не пояснено; їх буде введено в розділі :ref:`more-metacharacters`.)

source: Usually ``^`` matches only at the beginning of the string, and ``$`` matches only at the end of the string and immediately before the newline (if any) at the end of the string. When this flag is specified, ``^`` matches at the beginning of the string and at the beginning of each line within the string, immediately following each newline. Similarly, the ``$`` metacharacter matches either at the end of the string and at the end of each line (immediately preceding each newline).
uk: Зазвичай ``^`` збігається лише на початку рядка, а ``$`` збігається лише в кінці рядка та безпосередньо перед символом нового рядка (якщо є) у кінці рядка. Якщо вказано цей прапорець, ``^`` збігається на початку рядка та на початку кожного рядка в рядку, відразу після кожного нового рядка. Подібним чином, метасимвол ``$`` збігається або в кінці рядка, і в кінці кожного рядка (безпосередньо перед кожним новим рядком).

source: Makes the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline.
uk: Робить спеціальний символ `''.''` відповідним будь-якому символу взагалі, включно з символом нового рядка; без цього прапорця `''.''` відповідатиме будь-чому *крім* нового рядка.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns.
uk: Змусити ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` і ``\S`` виконувати відповідність лише ASCII замість повної Зіставлення Unicode. Це має значення лише для шаблонів Unicode та ігнорується для шаблонів байтів.

source: This flag allows you to write regular expressions that are more readable by granting you more flexibility in how you can format them. When this flag has been specified, whitespace within the RE string is ignored, except when the whitespace is in a character class or preceded by an unescaped backslash; this lets you organize and indent the RE more clearly. This flag also lets you put comments within a RE that will be ignored by the engine; comments are marked by a ``'#'`` that's neither in a character class or preceded by an unescaped backslash.
uk: Цей прапорець дозволяє вам писати регулярні вирази, які є більш читабельними, надаючи вам більше гнучкості у тому, як ви можете їх форматувати. Якщо вказано цей прапорець, пробіли в рядку RE ігноруються, за винятком випадків, коли пробіли знаходяться в класі символів або перед ними стоїть неекранована зворотна похила риска; це дозволяє більш чітко організувати та зробити відступи RE. Цей прапор також дозволяє розміщувати коментарі в RE, які ігноруватимуться механізмом; коментарі позначаються символом ``'#'``, якого немає в класі символів або якому передує неекранований зворотний слеш.

source: For example, here's a RE that uses :const:`re.VERBOSE`; see how much easier it is to read? ::
uk: Наприклад, ось RE, який використовує :const:`re.VERBOSE`; бачите, наскільки легше читати? ::

source: Without the verbose setting, the RE would look like this::
uk: Без параметра verbose RE виглядатиме так:
