Repository: python/python-docs-uk
Catalog: howto/urllib2.po
Languages: uk

source: The user agent for MSIE 6 is *'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*
uk: Агентом користувача для MSIE 6 є *"Mozilla/4.0 (сумісний; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)"*

source: For details of more HTTP request headers, see `Quick Reference to HTTP Headers`_.
uk: Додаткову інформацію про заголовки HTTP-запитів див. у розділі `Короткий довідник із заголовками HTTP`_.

source: In my case I have to use a proxy to access the internet at work. If you attempt to fetch *localhost* URLs through this proxy it blocks them. IE is set to use the proxy, which urllib picks up on. In order to test scripts with a localhost server, I have to prevent urllib from using the proxy.
uk: У моєму випадку мені доводиться використовувати проксі для доступу до Інтернету на роботі. Якщо ви намагаєтесь отримати URL-адреси *localhost* через цей проксі, він блокує їх. IE налаштовано на використання проксі, який підбирає urllib. Щоб перевірити сценарії на локальному сервері, я повинен заборонити urllib використовувати проксі.
