Repository: python/python-docs-uk
Catalog: c-api/arg.po
Languages: uk

source: ``k`` (:class:`int`) [unsigned long]
uk: ``k`` (:class:`int`) [беззнаковий довгий]

source: Convert a Python integer to a C :c:type:`unsigned long` without overflow checking.
uk: Перетворіть ціле число Python на C :c:type:`unsigned long` без перевірки переповнення.

source: ``L`` (:class:`int`) [long long]
uk: ``L`` (:class:`int`) [довгий довгий]

source: Convert a Python integer to a C :c:type:`long long`.
uk: Перетворіть ціле число Python на C :c:type:`long long`.

source: ``K`` (:class:`int`) [unsigned long long]
uk: ``K`` (:class:`int`) [беззнаковий довгий довгий]

source: Convert a Python integer to a C :c:type:`unsigned long long` without overflow checking.
uk: Перетворіть ціле число Python на C :c:type:`unsigned long long` без перевірки переповнення.

source: Convert a Python integer to a C :c:type:`Py_ssize_t`.
uk: Перетворіть ціле число Python на C :c:type:`Py_ssize_t`.

source: ``c`` (:class:`bytes` or :class:`bytearray` of length 1) [char]
uk: ``c`` (:class:`bytes` або :class:`bytearray` довжиною 1) [char]

source: Convert a Python byte, represented as a :class:`bytes` or :class:`bytearray` object of length 1, to a C :c:type:`char`.
uk: Перетворіть байт Python, представлений як об’єкт :class:`bytes` або :class:`bytearray` довжини 1, на C :c:type:`char`.

source: Allow :class:`bytearray` objects.
uk: Дозволити об’єкти :class:`bytearray`.

source: ``C`` (:class:`str` of length 1) [int]
uk: ``C`` (:class:`str` довжини 1) [int]

source: Convert a Python character, represented as a :class:`str` object of length 1, to a C :c:type:`int`.
uk: Перетворіть символ Python, представлений як об’єкт :class:`str` довжини 1, на C :c:type:`int`.

source: Convert a Python floating point number to a C :c:type:`float`.
uk: Перетворіть число з плаваючою комою Python на C :c:type:`float`.

source: Convert a Python floating point number to a C :c:type:`double`.
uk: Перетворіть число з плаваючою комою Python на C :c:type:`double`.

source: Convert a Python complex number to a C :c:type:`Py_complex` structure.
uk: Перетворіть комплексне число Python на структуру C :c:type:`Py_complex`.

source: Other objects
uk: Інші об'єкти

source: ``O`` (object) [PyObject \*]
uk: ``O`` (об'єкт) [PyObject \*]

source: Store a Python object (without any conversion) in a C object pointer. The C program thus receives the actual object that was passed. The object's reference count is not increased. The pointer stored is not ``NULL``.
uk: Зберігайте об’єкт Python (без будь-якого перетворення) у покажчику на об’єкт C. Таким чином, програма C отримує фактичний об’єкт, який було передано. Кількість посилань на об'єкт не збільшується. Збережений покажчик не є ``NULL``.

source: ``O!`` (object) [*typeobject*, PyObject \*]
uk: ``O!`` (об'єкт) [*typeobject*, PyObject \*]

source: Store a Python object in a C object pointer. This is similar to ``O``, but takes two C arguments: the first is the address of a Python type object, the second is the address of the C variable (of type :c:type:`PyObject*`) into which the object pointer is stored. If the Python object does not have the required type, :exc:`TypeError` is raised.
uk: Зберігайте об’єкт Python у покажчику на об’єкт C. Це схоже на ``O``, але приймає два аргументи C: перший — це адреса об’єкта типу Python, другий — адреса змінної C (типу :c:type:`PyObject*`) у в якому зберігається покажчик на об’єкт. Якщо об’єкт Python не має потрібного типу, виникає :exc:`TypeError`.

source: ``O&`` (object) [*converter*, *anything*]
uk: ``O&`` (об'єкт) [*конвертер*, *що завгодно*]

source: Convert a Python object to a C variable through a *converter* function. This takes two arguments: the first is a function, the second is the address of a C variable (of arbitrary type), converted to :c:type:`void *`. The *converter* function in turn is called as follows::
uk: Перетворіть об’єкт Python на змінну C за допомогою функції *конвертера*. Для цього потрібні два аргументи: перший — функція, другий — адреса змінної C (довільного типу), перетворена на :c:type:`void *`. Функція *converter* у свою чергу викликається наступним чином:

source: where *object* is the Python object to be converted and *address* is the :c:type:`void*` argument that was passed to the :c:func:`PyArg_Parse\*` function. The returned *status* should be ``1`` for a successful conversion and ``0`` if the conversion has failed. When the conversion fails, the *converter* function should raise an exception and leave the content of *address* unmodified.
uk: де *object* — це об’єкт Python, який потрібно перетворити, а *address* — це аргумент :c:type:`void*`, який було передано до функції :c:func:`PyArg_Parse\*`. Повернений *статус* має бути ``1`` для успішного перетворення та ``0``, якщо перетворення не вдалося. Якщо перетворення завершується невдачею, функція *конвертер* має викликати виняток і залишати вміст *адреси* без змін.

source: If the *converter* returns ``Py_CLEANUP_SUPPORTED``, it may get called a second time if the argument parsing eventually fails, giving the converter a chance to release any memory that it had already allocated. In this second call, the *object* parameter will be ``NULL``; *address* will have the same value as in the original call.
uk: Якщо *конвертер* повертає ``Py_CLEANUP_SUPPORTED``, він може бути викликаний вдруге, якщо синтаксичний аналіз аргументу врешті-решт не вдається, даючи конвертеру можливість звільнити будь-яку пам’ять, яку він уже виділив. У цьому другому виклику параметр *object* буде ``NULL``; *адреса* матиме те саме значення, що й у вихідному виклику.

source: ``Py_CLEANUP_SUPPORTED`` was added.
uk: Додано ``Py_CLEANUP_SUPPORTED``.

source: Tests the value passed in for truth (a boolean **p**\ redicate) and converts the result to its equivalent C true/false integer value. Sets the int to ``1`` if the expression was true and ``0`` if it was false. This accepts any valid Python value. See :ref:`truth` for more information about how Python tests values for truth.
uk: Перевіряє передане значення на істинність (логічне значення **p**\ повторне визначення) і перетворює результат на еквівалентне ціле значення C true/false. Встановлює int на ``1``, якщо вираз був істинним, і ``0``, якщо він був false. Це приймає будь-яке дійсне значення Python. Перегляньте :ref:`truth` для отримання додаткової інформації про те, як Python перевіряє значення на істинність.

source: The object must be a Python sequence whose length is the number of format units in *items*. The C arguments must correspond to the individual format units in *items*. Format units for sequences may be nested.
uk: Об’єкт має бути послідовністю Python, довжина якої дорівнює кількості одиниць формату в *елементах*. Аргументи C мають відповідати окремим одиницям формату в *items*. Одиниці формату для послідовностей можуть бути вкладеними.

source: It is possible to pass "long" integers (integers whose value exceeds the platform's :const:`LONG_MAX`) however no proper range checking is done --- the most significant bits are silently truncated when the receiving field is too small to receive the value (actually, the semantics are inherited from downcasts in C --- your mileage may vary).
uk: Можна передати "довгі" цілі числа (цілі числа, значення яких перевищує значення платформи :const:`LONG_MAX`), однак належна перевірка діапазону не виконується --- старші біти мовчки скорочуються, коли поле прийому замале для отримання значення (насправді, семантика успадкована від downcasts у C --- ваш пробіг може відрізнятися).

source: A few other characters have a meaning in a format string. These may not occur inside nested parentheses. They are:
uk: Кілька інших символів мають значення в рядку формату. Вони можуть не знаходитися всередині вкладених дужок. Вони є:

source: Indicates that the remaining arguments in the Python argument list are optional. The C variables corresponding to optional arguments should be initialized to their default value --- when an optional argument is not specified, :c:func:`PyArg_ParseTuple` does not touch the contents of the corresponding C variable(s).
uk: Вказує, що решта аргументів у списку аргументів Python необов’язкові. Змінні C, які відповідають необов’язковим аргументам, мають бути ініціалізовані значенням за замовчуванням --- коли необов’язковий аргумент не вказано, :c:func:`PyArg_ParseTuple` не торкається вмісту відповідних змінних C.

source: :c:func:`PyArg_ParseTupleAndKeywords` only: Indicates that the remaining arguments in the Python argument list are keyword-only. Currently, all keyword-only arguments must also be optional arguments, so ``|`` must always be specified before ``$`` in the format string.
uk: :c:func:`PyArg_ParseTupleAndKeywords` only: вказує, що решта аргументів у списку аргументів Python є лише ключовими словами. Наразі всі аргументи лише для ключових слів також мають бути необов’язковими, тому ``|`` завжди потрібно вказувати перед ``$`` у рядку формату.

source: The list of format units ends here; the string after the colon is used as the function name in error messages (the "associated value" of the exception that :c:func:`PyArg_ParseTuple` raises).
uk: Тут список одиниць формату закінчується; рядок після двокрапки використовується як ім’я функції в повідомленнях про помилки ("пов’язане значення" винятку, яке викликає :c:func:`PyArg_ParseTuple`).

source: The list of format units ends here; the string after the semicolon is used as the error message *instead* of the default error message. ``:`` and ``;`` mutually exclude each other.
uk: Тут список одиниць формату закінчується; рядок після крапки з комою використовується як повідомлення про помилку *замість* повідомлення про помилку за замовчуванням. ``:`` і ``;`` взаємно виключають один одного.

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
uk: Зауважте, що будь-які посилання на об’єкти Python, які надаються абоненту, є *позиченими* посиланнями; не зменшуйте кількість посилань!

source: Additional arguments passed to these functions must be addresses of variables whose type is determined by the format string; these are used to store values from the input tuple. There are a few cases, as described in the list of format units above, where these parameters are used as input values; they should match what is specified for the corresponding format unit in that case.
uk: Додатковими аргументами, що передаються цим функціям, повинні бути адреси змінних, тип яких визначається рядком формату; вони використовуються для зберігання значень із вхідного кортежу. Є кілька випадків, як описано у списку одиниць формату вище, де ці параметри використовуються як вхідні значення; вони повинні відповідати тому, що вказано для відповідної одиниці формату в цьому випадку.

source: For the conversion to succeed, the *arg* object must match the format and the format must be exhausted. On success, the :c:func:`PyArg_Parse\*` functions return true, otherwise they return false and raise an appropriate exception. When the :c:func:`PyArg_Parse\*` functions fail due to conversion failure in one of the format units, the variables at the addresses corresponding to that and the following format units are left untouched.
uk: Щоб перетворення відбулося успішно, об’єкт *arg* має відповідати формату, а формат має бути вичерпаним. У разі успіху функції :c:func:`PyArg_Parse\*` повертають true, інакше вони повертають false і викликають відповідний виняток. Коли функції :c:func:`PyArg_Parse\*` виходять з ладу через помилку перетворення в одному з блоків формату, змінні за адресами, що відповідають цьому та наступним блокам формату, залишаються недоторканими.

source: API Functions
uk: Функції API

source: Parse the parameters of a function that takes only positional parameters into local variables. Returns true on success; on failure, it returns false and raises the appropriate exception.
uk: Проаналізуйте параметри функції, яка приймає лише позиційні параметри в локальні змінні. Повертає true в разі успіху; у разі невдачі повертає false і викликає відповідний виняток.

source: Identical to :c:func:`PyArg_ParseTuple`, except that it accepts a va_list rather than a variable number of arguments.
uk: Ідентичний :c:func:`PyArg_ParseTuple`, за винятком того, що він приймає va_list, а не змінну кількість аргументів.

source: Parse the parameters of a function that takes both positional and keyword parameters into local variables. The *keywords* argument is a ``NULL``-terminated array of keyword parameter names. Empty names denote :ref:`positional-only parameters <positional-only_parameter>`. Returns true on success; on failure, it returns false and raises the appropriate exception.
uk: Проаналізуйте параметри функції, яка приймає як позиційні, так і ключові параметри в локальні змінні. Аргумент *keywords* — це масив імен параметрів ключових слів із закінченням ``NULL``. Порожні імена позначають :ref:`позиційні параметри <positional-only_parameter>`. Повертає true в разі успіху; у разі невдачі повертає false і викликає відповідний виняток.

source: Added support for :ref:`positional-only parameters <positional-only_parameter>`.
uk: Додано підтримку :ref:`позиційних параметрів <positional-only_parameter>`.

source: Identical to :c:func:`PyArg_ParseTupleAndKeywords`, except that it accepts a va_list rather than a variable number of arguments.
uk: Ідентичний :c:func:`PyArg_ParseTupleAndKeywords`, за винятком того, що він приймає va_list, а не змінну кількість аргументів.

source: Ensure that the keys in the keywords argument dictionary are strings. This is only needed if :c:func:`PyArg_ParseTupleAndKeywords` is not used, since the latter already does this check.
uk: Переконайтеся, що ключі в словнику аргументів ключових слів є рядками. Це потрібно, лише якщо :c:func:`PyArg_ParseTupleAndKeywords` не використовується, оскільки останній вже виконує цю перевірку.

source: Function used to deconstruct the argument lists of "old-style" functions --- these are functions which use the :const:`METH_OLDARGS` parameter parsing method, which has been removed in Python 3. This is not recommended for use in parameter parsing in new code, and most code in the standard interpreter has been modified to no longer use this for that purpose. It does remain a convenient way to decompose other tuples, however, and may continue to be used for that purpose.
uk: Функція, яка використовується для деконструювання списків аргументів функцій "старого стилю" --- це функції, які використовують метод аналізу параметрів :const:`METH_OLDARGS`, який було видалено в Python 3. Це не рекомендовано використовувати для аналізу параметрів у новому коді, і більшість коду в стандартному інтерпретаторі було змінено, щоб більше не використовувати це для цієї мети. Однак він залишається зручним способом розкладання інших кортежів і може продовжувати використовуватися для цієї мети.

source: A simpler form of parameter retrieval which does not use a format string to specify the types of the arguments. Functions which use this method to retrieve their parameters should be declared as :const:`METH_VARARGS` in function or method tables. The tuple containing the actual parameters should be passed as *args*; it must actually be a tuple. The length of the tuple must be at least *min* and no more than *max*; *min* and *max* may be equal. Additional arguments must be passed to the function, each of which should be a pointer to a :c:type:`PyObject*` variable; these will be filled in with the values from *args*; they will contain :term:`borrowed references <borrowed reference>`. The variables which correspond to optional parameters not given by *args* will not be filled in; these should be initialized by the caller. This function returns true on success and false if *args* is not a tuple or contains the wrong number of elements; an exception will be set if there was a failure.
uk: Простіша форма отримання параметрів, яка не використовує рядок формату для визначення типів аргументів. Функції, які використовують цей метод для отримання своїх параметрів, мають бути оголошені як :const:`METH_VARARGS` у таблицях функцій або методів. Кортеж, що містить фактичні параметри, слід передати як *args*; насправді це має бути кортеж. Довжина кортежу має бути не менше *min* і не більше *max*; *min* і *max* можуть бути рівними. У функцію повинні бути передані додаткові аргументи, кожен з яких має бути вказівником на змінну :c:type:`PyObject*`; вони будуть заповнені значеннями з *args*; вони міститимуть :term:`позичені посилання <borrowed reference>`. Змінні, які відповідають необов’язковим параметрам, не заданим *args*, не будуть заповнені; вони повинні бути ініціалізовані абонентом. Ця функція повертає true у разі успіху та false, якщо *args* не є кортежем або містить неправильну кількість елементів; якщо сталася помилка, буде встановлено виняток.

source: This is an example of the use of this function, taken from the sources for the :mod:`_weakref` helper module for weak references::
uk: Це приклад використання цієї функції, взятий із джерел допоміжного модуля :mod:`_weakref` для слабких посилань:

source: The call to :c:func:`PyArg_UnpackTuple` in this example is entirely equivalent to this call to :c:func:`PyArg_ParseTuple`::
uk: Виклик :c:func:`PyArg_UnpackTuple` у цьому прикладі повністю еквівалентний виклику :c:func:`PyArg_ParseTuple`::

source: Building values
uk: Формування цінностей

source: Create a new value based on a format string similar to those accepted by the :c:func:`PyArg_Parse\*` family of functions and a sequence of values. Returns the value or ``NULL`` in the case of an error; an exception will be raised if ``NULL`` is returned.
uk: Створіть нове значення на основі рядка формату, подібного до тих, що приймаються сімейством функцій :c:func:`PyArg_Parse\*` і послідовністю значень. Повертає значення або ``NULL`` у разі помилки; виняток буде викликано, якщо буде повернуто ``NULL``.

source: :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
uk: :c:func:`Py_BuildValue` не завжди створює кортеж. Він створює кортеж, лише якщо його рядок формату містить дві або більше одиниць формату. Якщо рядок формату порожній, повертається ``None``; якщо він містить рівно одну одиницю формату, він повертає будь-який об’єкт, описаний цією одиницею формату. Щоб змусити його повертати кортеж розміром 0 або одиницю, візьміть рядок формату в дужки.

source: When memory buffers are passed as parameters to supply data to build objects, as for the ``s`` and ``s#`` formats, the required data is copied. Buffers provided by the caller are never referenced by the objects created by :c:func:`Py_BuildValue`. In other words, if your code invokes :c:func:`malloc` and passes the allocated memory to :c:func:`Py_BuildValue`, your code is responsible for calling :c:func:`free` for that memory once :c:func:`Py_BuildValue` returns.
uk: Коли буфери пам’яті передаються як параметри для надання даних для створення об’єктів, як і для форматів ``s`` і ``s#``, необхідні дані копіюються. Об’єкти, створені :c:func:`Py_BuildValue`, ніколи не посилаються на буфери, надані абонентом. Іншими словами, якщо ваш код викликає :c:func:`malloc` і передає виділену пам’ять :c:func:`Py_BuildValue`, ваш код відповідальний за виклик :c:func:`free` для цієї пам’яті один раз :c:func:`Py_BuildValue` повертає.

source: In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that the format unit will return; and the entry in [square] brackets is the type of the C value(s) to be passed.
uk: У наступному описі форма в лапках є одиницею формату; запис у (круглих) дужках — це тип об’єкта Python, який поверне блок формату; і запис у [квадратних] дужках є типом значень C, які потрібно передати.

source: The characters space, tab, colon and comma are ignored in format strings (but not within format units such as ``s#``). This can be used to make long format strings a tad more readable.
uk: Символи пробілу, табуляції, двокрапки та коми ігноруються в рядках форматування (але не в одиницях форматування, таких як ``s#``). Це можна використати, щоб зробити рядки довгого формату трохи більш читабельними.

source: ``s`` (:class:`str` or ``None``) [const char \*]
uk: ``s`` (:class:`str` або ``None``) [const char \*]

source: Convert a null-terminated C string to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, ``None`` is used.
uk: Перетворіть рядок C із нульовим закінченням на об’єкт Python :class:`str` за допомогою кодування ``'utf-8'``. Якщо вказівник на рядок C має значення ``NULL``, використовується ``None``.

source: ``s#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
uk: ``s#`` (:class:`str` або ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Convert a C string and its length to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, the length is ignored and ``None`` is returned.
uk: Перетворіть рядок C та його довжину на об’єкт Python :class:`str` за допомогою кодування ``'utf-8'``. Якщо покажчик рядка C має значення ``NULL``, довжина ігнорується і повертається ``None``.

source: This converts a C string to a Python :class:`bytes` object. If the C string pointer is ``NULL``, ``None`` is returned.
uk: Це перетворює рядок C на об’єкт Python :class:`bytes`. Якщо вказівник на рядок C має значення ``NULL``, повертається ``None``.

source: This converts a C string and its lengths to a Python object. If the C string pointer is ``NULL``, ``None`` is returned.
uk: Це перетворює рядок C та його довжину на об’єкт Python. Якщо вказівник на рядок C має значення ``NULL``, повертається ``None``.

source: Same as ``s``.
uk: Те саме, що ``s``.

source: ``z#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
uk: ``z#`` (:class:`str` або ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Same as ``s#``.
uk: Те саме, що ``s#``.

source: Convert a null-terminated :c:type:`wchar_t` buffer of Unicode (UTF-16 or UCS-4) data to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, ``None`` is returned.
uk: Перетворіть буфер даних Unicode (UTF-16 або UCS-4) :c:type:`wchar_t` із закінченням нульовим символом на об’єкт Python Unicode. Якщо покажчик буфера Unicode має значення ``NULL``, повертається ``None``.

source: Convert a Unicode (UTF-16 or UCS-4) data buffer and its length to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, the length is ignored and ``None`` is returned.
uk: Перетворіть буфер даних Unicode (UTF-16 або UCS-4) і його довжину на об’єкт Python Unicode. Якщо покажчик буфера Unicode має значення ``NULL``, довжина ігнорується і повертається ``None``.

source: ``U`` (:class:`str` or ``None``) [const char \*]
uk: ``U`` (:class:`str` або ``None``) [const char \*]

source: ``U#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
uk: ``U#`` (:class:`str` або ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Convert a plain C :c:type:`int` to a Python integer object.
uk: Перетворіть простий C :c:type:`int` на цілочисельний об’єкт Python.

source: ``b`` (:class:`int`) [char]
uk: ``b`` (:class:`int`) [символ]

source: Convert a plain C :c:type:`char` to a Python integer object.
uk: Перетворіть звичайний C :c:type:`char` на цілочисельний об’єкт Python.

source: Convert a plain C :c:type:`short int` to a Python integer object.
uk: Перетворіть простий C :c:type:`short int` на цілочисельний об’єкт Python.
