Repository: python/python-docs-uk
Catalog: c-api/arg.po
Languages: uk

source: Parsing arguments and building values
uk: Розбір аргументів і створення значень

source: These functions are useful when creating your own extensions functions and methods. Additional information and examples are available in :ref:`extending-index`.
uk: Ці функції корисні під час створення власних функцій і методів розширень. Додаткова інформація та приклади доступні в :ref:`extending-index`.

source: The first three of these functions described, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, and :c:func:`PyArg_Parse`, all use *format strings* which are used to tell the function about the expected arguments. The format strings use the same syntax for each of these functions.
uk: Перші три з цих описаних функцій, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords` і :c:func:`PyArg_Parse`, усі використовують *форматні рядки*, які використовуються, щоб повідомити функції про очікувані аргументи. Рядки формату використовують однаковий синтаксис для кожної з цих функцій.

source: Parsing arguments
uk: Розбір аргументів

source: A format string consists of zero or more "format units." A format unit describes one Python object; it is usually a single character or a parenthesized sequence of format units. With a few exceptions, a format unit that is not a parenthesized sequence normally corresponds to a single address argument to these functions. In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that matches the format unit; and the entry in [square] brackets is the type of the C variable(s) whose address should be passed.
uk: Рядок формату складається з нуля або більше "одиниць формату". Одиниця формату описує один об’єкт Python; зазвичай це один символ або послідовність одиниць формату в дужках. За кількома винятками, одиниця формату, яка не є послідовністю в дужках, зазвичай відповідає одному аргументу адреси для цих функцій. У наступному описі форма в лапках є одиницею формату; запис у (круглих) дужках — це тип об’єкта Python, який відповідає одиниці формату; а запис у [квадратних] дужках — це тип змінної (змінних) C, адреса якої має бути передана.

source: Strings and buffers
uk: Рядки та буфери

source: These formats allow accessing an object as a contiguous chunk of memory. You don't have to provide raw storage for the returned unicode or bytes area.
uk: Ці формати дозволяють отримати доступ до об’єкта як до безперервної частини пам’яті. Вам не потрібно надавати необроблене сховище для поверненої області Юнікоду або байтів.

source: In general, when a format sets a pointer to a buffer, the buffer is managed by the corresponding Python object, and the buffer shares the lifetime of this object. You won't have to release any memory yourself. The only exceptions are ``es``, ``es#``, ``et`` and ``et#``.
uk: Загалом, коли формат встановлює вказівник на буфер, буфером керує відповідний об’єкт Python, і буфер розділяє час життя цього об’єкта. Вам не доведеться самостійно звільняти пам’ять. Єдиним винятком є ``es``, ``es#``, ``et`` і ``et#``.

source: However, when a :c:type:`Py_buffer` structure gets filled, the underlying buffer is locked so that the caller can subsequently use the buffer even inside a :c:type:`Py_BEGIN_ALLOW_THREADS` block without the risk of mutable data being resized or destroyed. As a result, **you have to call** :c:func:`PyBuffer_Release` after you have finished processing the data (or in any early abort case).
uk: Однак, коли структура :c:type:`Py_buffer` заповнюється, базовий буфер блокується, щоб абонент згодом міг використовувати буфер навіть усередині блоку :c:type:`Py_BEGIN_ALLOW_THREADS` без ризику зміни розміру змінних даних або знищено. У результаті **ви повинні викликати** :c:func:`PyBuffer_Release` після завершення обробки даних (або в будь-якому випадку раннього переривання).

source: Unless otherwise stated, buffers are not NUL-terminated.
uk: Якщо не зазначено інше, буфери не завершуються NUL.

source: Some formats require a read-only :term:`bytes-like object`, and set a pointer instead of a buffer structure. They work by checking that the object's :c:member:`PyBufferProcs.bf_releasebuffer` field is ``NULL``, which disallows mutable objects such as :class:`bytearray`.
uk: Деякі формати вимагають лише для читання :term:`bytes-like object` і встановлюють вказівник замість буферної структури. Вони працюють, перевіряючи, що поле :c:member:`PyBufferProcs.bf_releasebuffer` об’єкта має значення ``NULL``, що забороняє змінні об’єкти, такі як :class:`bytearray`.

source: For all ``#`` variants of formats (``s#``, ``y#``, etc.), the macro :c:macro:`PY_SSIZE_T_CLEAN` must be defined before including :file:`Python.h`. On Python 3.9 and older, the type of the length argument is :c:type:`Py_ssize_t` if the :c:macro:`PY_SSIZE_T_CLEAN` macro is defined, or int otherwise.
uk: Для всіх варіантів форматів ``#`` (``s#``, ``y#`` тощо) макрос :c:macro:`PY_SSIZE_T_CLEAN` має бути визначений перед включенням :file:`Python. h`. У Python 3.9 і старіших версіях тип аргументу length є :c:type:`Py_ssize_t`, якщо визначено макрос :c:macro:`PY_SSIZE_T_CLEAN`, або int в іншому випадку.

source: Convert a Unicode object to a C pointer to a character string. A pointer to an existing string is stored in the character pointer variable whose address you pass. The C string is NUL-terminated. The Python string must not contain embedded null code points; if it does, a :exc:`ValueError` exception is raised. Unicode objects are converted to C strings using ``'utf-8'`` encoding. If this conversion fails, a :exc:`UnicodeError` is raised.
uk: Перетворення об’єкта Unicode на покажчик C на рядок символів. Покажчик на існуючий рядок зберігається в змінній покажчика символів, адресу якої ви передаєте. Рядок C закінчується NUL. Рядок Python не повинен містити вбудованих нульових кодових точок; якщо це так, виникає виняток :exc:`ValueError`. Об’єкти Unicode перетворюються на рядки C за допомогою кодування ``'utf-8``. Якщо це перетворення не вдається, виникає помилка :exc:`UnicodeError`.

source: This format does not accept :term:`bytes-like objects <bytes-like object>`. If you want to accept filesystem paths and convert them to C character strings, it is preferable to use the ``O&`` format with :c:func:`PyUnicode_FSConverter` as *converter*.
uk: Цей формат не приймає :term:`байтоподібні об’єкти <bytes-like object>`. Якщо ви хочете прийняти шляхи до файлової системи та перетворити їх на рядки символів C, бажано використовувати формат ``O&`` з :c:func:`PyUnicode_FSConverter` як *перетворювач*.

source: Previously, :exc:`TypeError` was raised when embedded null code points were encountered in the Python string.
uk: Раніше помилка :exc:`TypeError` виникала, коли в рядку Python зустрічалися вбудовані нульові кодові точки.

source: ``s*`` (:class:`str` or :term:`bytes-like object`) [Py_buffer]
uk: ``s*`` (:class:`str` або :term:`bytes-like object`) [Py_buffer]

source: This format accepts Unicode objects as well as bytes-like objects. It fills a :c:type:`Py_buffer` structure provided by the caller. In this case the resulting C string may contain embedded NUL bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
uk: Цей формат приймає як об’єкти Unicode, так і байтоподібні об’єкти. Він заповнює структуру :c:type:`Py_buffer`, надану абонентом. У цьому випадку результуючий рядок C може містити вбудовані байти NUL. Об’єкти Unicode перетворюються на рядки C за допомогою кодування ``'utf-8``.

source: ``s#`` (:class:`str`, read-only :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]
uk: ``s#`` (:class:`str`, лише для читання :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]

source: Like ``s*``, except that it doesn't accept mutable objects. The result is stored into two C variables, the first one a pointer to a C string, the second one its length. The string may contain embedded null bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
uk: Як ``s*``, за винятком того, що він не приймає змінні об’єкти. Результат зберігається у двох змінних C, перша з яких є покажчиком на рядок C, а друга — її довжиною. Рядок може містити вбудовані нульові байти. Об’єкти Unicode перетворюються на рядки C за допомогою кодування ``'utf-8``.

source: ``z`` (:class:`str` or ``None``) [const char \*]
uk: ``z`` (:class:`str` або ``None``) [const char \*]

source: Like ``s``, but the Python object may also be ``None``, in which case the C pointer is set to ``NULL``.
uk: Подібно до ``s``, але об’єкт Python також може мати значення ``None``, у цьому випадку вказівник C встановлено на ``NULL``.

source: ``z*`` (:class:`str`, :term:`bytes-like object` or ``None``) [Py_buffer]
uk: ``z*`` (:class:`str`, :term:`bytes-like object` або ``None``) [Py_buffer]

source: Like ``s*``, but the Python object may also be ``None``, in which case the ``buf`` member of the :c:type:`Py_buffer` structure is set to ``NULL``.
uk: Подібно до ``s*``, але об’єкт Python також може бути ``None``, у цьому випадку ``buf`` член структури :c:type:`Py_buffer` має значення ``NULL`` .

source: ``z#`` (:class:`str`, read-only :term:`bytes-like object` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
uk: ``z#`` (:class:`str`, лише для читання :term:`bytes-like object` або ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Like ``s#``, but the Python object may also be ``None``, in which case the C pointer is set to ``NULL``.
uk: Подібно до ``s#``, але об’єкт Python також може мати значення ``None``, у цьому випадку вказівник на C встановлюється як ``NULL``.

source: ``y`` (read-only :term:`bytes-like object`) [const char \*]
uk: ``y`` (тільки для читання :term:`bytes-like object`) [const char \*]

source: This format converts a bytes-like object to a C pointer to a character string; it does not accept Unicode objects. The bytes buffer must not contain embedded null bytes; if it does, a :exc:`ValueError` exception is raised.
uk: Цей формат перетворює байтоподібний об’єкт на вказівник C на рядок символів; він не приймає об'єкти Unicode. Буфер байтів не повинен містити вбудованих нульових байтів; якщо це так, виникає виняток :exc:`ValueError`.

source: Previously, :exc:`TypeError` was raised when embedded null bytes were encountered in the bytes buffer.
uk: Раніше помилка :exc:`TypeError` виникала, коли в буфері байтів зустрічалися вбудовані нульові байти.

source: This variant on ``s*`` doesn't accept Unicode objects, only bytes-like objects. **This is the recommended way to accept binary data.**
uk: Цей варіант ``s*`` не приймає об’єкти Unicode, лише байтоподібні об’єкти. **Це рекомендований спосіб приймати двійкові дані.**

source: ``y#`` (read-only :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]
uk: ``y#`` (тільки для читання :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]

source: This variant on ``s#`` doesn't accept Unicode objects, only bytes-like objects.
uk: Цей варіант ``s#`` не приймає об’єкти Unicode, лише байтоподібні об’єкти.

source: Requires that the Python object is a :class:`bytes` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a bytes object. The C variable may also be declared as :c:type:`PyObject*`.
uk: Вимагає, щоб об’єкт Python був об’єктом :class:`bytes` без будь-яких спроб перетворення. Викликає :exc:`TypeError`, якщо об’єкт не є об’єктом bytes. Змінна C також може бути оголошена як :c:type:`PyObject*`.

source: Requires that the Python object is a :class:`bytearray` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a :class:`bytearray` object. The C variable may also be declared as :c:type:`PyObject*`.
uk: Вимагає, щоб об’єкт Python був об’єктом :class:`bytearray` без жодних спроб перетворення. Викликає :exc:`TypeError`, якщо об’єкт не є об’єктом :class:`bytearray`. Змінна C також може бути оголошена як :c:type:`PyObject*`.

source: Convert a Python Unicode object to a C pointer to a NUL-terminated buffer of Unicode characters. You must pass the address of a :c:type:`Py_UNICODE` pointer variable, which will be filled with the pointer to an existing Unicode buffer. Please note that the width of a :c:type:`Py_UNICODE` character depends on compilation options (it is either 16 or 32 bits). The Python string must not contain embedded null code points; if it does, a :exc:`ValueError` exception is raised.
uk: Перетворіть об’єкт Python Unicode на вказівник C на буфер із символами Unicode, що закінчується NUL. Ви повинні передати адресу змінної вказівника :c:type:`Py_UNICODE`, яка буде заповнена вказівником на існуючий буфер Unicode. Зауважте, що ширина символу :c:type:`Py_UNICODE` залежить від параметрів компіляції (це 16 або 32 біти). Рядок Python не повинен містити вбудованих нульових кодових точок; якщо це так, виникає виняток :exc:`ValueError`.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsWideCharString`.
uk: Частина API старого стилю :c:type:`Py_UNICODE`; будь ласка, перейдіть на використання :c:func:`PyUnicode_AsWideCharString`.

source: This variant on ``u`` stores into two C variables, the first one a pointer to a Unicode data buffer, the second one its length. This variant allows null code points.
uk: Цей варіант ``u`` зберігає дві змінні C, перша з яких є вказівником на буфер даних Unicode, а друга – його довжину. Цей варіант допускає нульові кодові точки.

source: ``Z`` (:class:`str` or ``None``) [const Py_UNICODE \*]
uk: ``Z`` (:class:`str` або ``None``) [const Py_UNICODE \*]

source: Like ``u``, but the Python object may also be ``None``, in which case the :c:type:`Py_UNICODE` pointer is set to ``NULL``.
uk: Подібно до ``u``, але об’єкт Python також може мати значення ``None``, у цьому випадку вказівник :c:type:`Py_UNICODE` має значення ``NULL``.

source: ``Z#`` (:class:`str` or ``None``) [const Py_UNICODE \*, :c:type:`Py_ssize_t`]
uk: ``Z#`` (:class:`str` або ``None``) [const Py_UNICODE \*, :c:type:`Py_ssize_t`]

source: Like ``u#``, but the Python object may also be ``None``, in which case the :c:type:`Py_UNICODE` pointer is set to ``NULL``.
uk: Подібно до ``u#``, але об’єкт Python також може мати значення ``None``, у цьому випадку вказівник :c:type:`Py_UNICODE` має значення ``NULL``.

source: Requires that the Python object is a Unicode object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a Unicode object. The C variable may also be declared as :c:type:`PyObject*`.
uk: Вимагає, щоб об’єкт Python був об’єктом Unicode, без будь-яких спроб перетворення. Викликає :exc:`TypeError`, якщо об’єкт не є об’єктом Unicode. Змінна C також може бути оголошена як :c:type:`PyObject*`.

source: ``w*`` (read-write :term:`bytes-like object`) [Py_buffer]
uk: ``w*`` (читання-запис :term:`bytes-like object`) [Py_buffer]

source: This format accepts any object which implements the read-write buffer interface. It fills a :c:type:`Py_buffer` structure provided by the caller. The buffer may contain embedded null bytes. The caller have to call :c:func:`PyBuffer_Release` when it is done with the buffer.
uk: Цей формат приймає будь-який об’єкт, який реалізує інтерфейс буфера читання-запису. Він заповнює структуру :c:type:`Py_buffer`, надану абонентом. Буфер може містити вбудовані нульові байти. Виклик має викликати :c:func:`PyBuffer_Release`, коли це буде зроблено з буфером.

source: ``es`` (:class:`str`) [const char \*encoding, char \*\*buffer]
uk: ``es`` (:class:`str`) [const char \*кодування, char \*\*buffer]

source: This variant on ``s`` is used for encoding Unicode into a character buffer. It only works for encoded data without embedded NUL bytes.
uk: Цей варіант на ``s`` використовується для кодування Юнікоду в символьний буфер. Він працює лише для закодованих даних без вбудованих байтів NUL.

source: This format requires two arguments. The first is only used as input, and must be a :c:type:`const char*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:type:`char**`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument.
uk: Цей формат вимагає двох аргументів. Перший використовується лише як вхід і має бути :c:type:`const char*`, який вказує на ім’я кодування як рядок із закінченням NUL, або ``NULL``, у цьому випадку ``' використовується кодування utf-8''``. Виняток виникає, якщо назване кодування невідоме Python. Другим аргументом має бути :c:type:`char**`; значення покажчика, на який він посилається, буде встановлено на буфер із вмістом тексту аргументу. Текст буде закодовано в кодуванні, визначеному першим аргументом.

source: :c:func:`PyArg_ParseTuple` will allocate a buffer of the needed size, copy the encoded data into this buffer and adjust *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after use.
uk: :c:func:`PyArg_ParseTuple` виділить буфер необхідного розміру, скопіює закодовані дані в цей буфер і налаштує *\*buffer* для посилання на щойно виділене сховище. Виклик відповідає за виклик :c:func:`PyMem_Free`, щоб звільнити виділений буфер після використання.

source: ``et`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer]
uk: ``et`` (:class:`str`, :class:`bytes` або :class:`bytearray`) [const char \*кодування, char \*\*buffer]

source: Same as ``es`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
uk: Те саме, що ``es``, за винятком того, що об’єкти рядків байтів передаються без їх перекодування. Натомість реалізація припускає, що об’єкт рядка байтів використовує кодування, передане як параметр.

source: ``es#`` (:class:`str`) [const char \*encoding, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]
uk: ``es#`` (:class:`str`) [const char \*кодування, char \*\*буфер, :c:type:`Py_ssize_t` \*buffer_length]

source: This variant on ``s#`` is used for encoding Unicode into a character buffer. Unlike the ``es`` format, this variant allows input data which contains NUL characters.
uk: Цей варіант ``s#`` використовується для кодування Юнікоду в символьний буфер. На відміну від формату ``es``, цей варіант дозволяє вводити дані, які містять символи NUL.

source: It requires three arguments. The first is only used as input, and must be a :c:type:`const char*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:type:`char**`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument. The third argument must be a pointer to an integer; the referenced integer will be set to the number of bytes in the output buffer.
uk: Для цього потрібні три аргументи. Перший використовується лише як вхід і має бути :c:type:`const char*`, який вказує на ім’я кодування як рядок із закінченням NUL, або ``NULL``, у цьому випадку ``' використовується кодування utf-8''``. Виняток виникає, якщо назване кодування невідоме Python. Другим аргументом має бути :c:type:`char**`; значення покажчика, на який він посилається, буде встановлено на буфер із вмістом тексту аргументу. Текст буде закодовано в кодуванні, визначеному першим аргументом. Третій аргумент повинен бути вказівником на ціле число; ціле число, на яке посилається, буде встановлено на кількість байтів у вихідному буфері.

source: There are two modes of operation:
uk: Є два режими роботи:

source: If *\*buffer* points a ``NULL`` pointer, the function will allocate a buffer of the needed size, copy the encoded data into this buffer and set *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after usage.
uk: Якщо *\*buffer* вказує на вказівник ``NULL``, функція виділить буфер необхідного розміру, скопіює закодовані дані в цей буфер і встановить *\*buffer* для посилання на щойно виділене сховище. Виклик відповідає за виклик :c:func:`PyMem_Free`, щоб звільнити виділений буфер після використання.

source: If *\*buffer* points to a non-``NULL`` pointer (an already allocated buffer), :c:func:`PyArg_ParseTuple` will use this location as the buffer and interpret the initial value of *\*buffer_length* as the buffer size. It will then copy the encoded data into the buffer and NUL-terminate it. If the buffer is not large enough, a :exc:`ValueError` will be set.
uk: Якщо *\*buffer* вказує на вказівник, відмінний від ``NULL`` (уже виділений буфер), :c:func:`PyArg_ParseTuple` використовуватиме це розташування як буфер та інтерпретуватиме початкове значення *\*buffer_length* як розмір буфера. Потім він скопіює закодовані дані в буфер і завершить його NUL. Якщо буфер недостатньо великий, буде встановлено :exc:`ValueError`.

source: In both cases, *\*buffer_length* is set to the length of the encoded data without the trailing NUL byte.
uk: В обох випадках *\*buffer_length* встановлюється на довжину закодованих даних без кінцевого байта NUL.

source: ``et#`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]
uk: ``et#`` (:class:`str`, :class:`bytes` або :class:`bytearray`) [const char \*кодування, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]

source: Same as ``es#`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
uk: Те саме, що ``es#``, за винятком того, що байтові рядкові об’єкти передаються без їх перекодування. Натомість реалізація припускає, що об’єкт рядка байтів використовує кодування, передане як параметр.

source: Numbers
uk: Числа

source: ``b`` (:class:`int`) [unsigned char]
uk: ``b`` (:class:`int`) [беззнаковий символ]

source: Convert a nonnegative Python integer to an unsigned tiny int, stored in a C :c:type:`unsigned char`.
uk: Перетворіть невід’ємне ціле число Python на беззнакове крихітне int, що зберігається в C :c:type:`unsigned char`.

source: ``B`` (:class:`int`) [unsigned char]
uk: ``B`` (:class:`int`) [беззнаковий символ]

source: Convert a Python integer to a tiny int without overflow checking, stored in a C :c:type:`unsigned char`.
uk: Перетворюйте ціле число Python на крихітне int без перевірки переповнення, що зберігається в C :c:type:`unsigned char`.

source: ``h`` (:class:`int`) [short int]
uk: ``h`` (:class:`int`) [короткий int]

source: Convert a Python integer to a C :c:type:`short int`.
uk: Перетворіть ціле число Python на C :c:type:`short int`.

source: Convert a Python integer to a C :c:type:`unsigned short int`, without overflow checking.
uk: Перетворіть ціле число Python на C :c:type:`unsigned short int` без перевірки переповнення.

source: Convert a Python integer to a plain C :c:type:`int`.
uk: Перетворіть ціле число Python на звичайне C :c:type:`int`.

source: Convert a Python integer to a C :c:type:`unsigned int`, without overflow checking.
uk: Перетворіть ціле число Python на C :c:type:`unsigned int` без перевірки переповнення.

source: ``l`` (:class:`int`) [long int]
uk: ``l`` (:class:`int`) [довге ціле]

source: Convert a Python integer to a C :c:type:`long int`.
uk: Перетворіть ціле число Python на C :c:type:`long int`.
