Repository: python/python-docs-uk
Catalog: c-api/arg.po
Languages: uk

source: Convert a C :c:type:`long int` to a Python integer object.
uk: Перетворіть C :c:type:`long int` на цілочисельний об’єкт Python.

source: Convert a C :c:type:`unsigned char` to a Python integer object.
uk: Перетворіть C :c:type:`unsigned char` на цілочисельний об’єкт Python.

source: Convert a C :c:type:`unsigned short int` to a Python integer object.
uk: Перетворіть C :c:type:`unsigned short int` на цілочисельний об’єкт Python.

source: Convert a C :c:type:`unsigned int` to a Python integer object.
uk: Перетворіть C :c:type:`unsigned int` на цілочисельний об’єкт Python.

source: Convert a C :c:type:`unsigned long` to a Python integer object.
uk: Перетворіть C :c:type:`unsigned long` на цілочисельний об’єкт Python.

source: Convert a C :c:type:`long long` to a Python integer object.
uk: Перетворіть C :c:type:`long long` на цілочисельний об’єкт Python.

source: Convert a C :c:type:`unsigned long long` to a Python integer object.
uk: Перетворіть C :c:type:`unsigned long long` на цілочисельний об’єкт Python.

source: Convert a C :c:type:`Py_ssize_t` to a Python integer.
uk: Перетворіть C :c:type:`Py_ssize_t` на ціле число Python.

source: ``c`` (:class:`bytes` of length 1) [char]
uk: ``c`` (:class:`bytes` довжиною 1) [символ]

source: Convert a C :c:type:`int` representing a byte to a Python :class:`bytes` object of length 1.
uk: Перетворіть C :c:type:`int`, що представляє байт, на об’єкт Python :class:`bytes` довжини 1.

source: Convert a C :c:type:`int` representing a character to Python :class:`str` object of length 1.
uk: Перетворіть C :c:type:`int`, що представляє символ, на Python :class:`str` об’єкт довжини 1.

source: Convert a C :c:type:`double` to a Python floating point number.
uk: Перетворіть C :c:type:`double` на число з плаваючою комою Python.

source: Convert a C :c:type:`float` to a Python floating point number.
uk: Перетворіть C :c:type:`float` на число з плаваючою комою Python.

source: Convert a C :c:type:`Py_complex` structure to a Python complex number.
uk: Перетворіть структуру C :c:type:`Py_complex` на комплексне число Python.

source: Pass a Python object untouched (except for its reference count, which is incremented by one). If the object passed in is a ``NULL`` pointer, it is assumed that this was caused because the call producing the argument found an error and set an exception. Therefore, :c:func:`Py_BuildValue` will return ``NULL`` but won't raise an exception. If no exception has been raised yet, :exc:`SystemError` is set.
uk: Передайте об’єкт Python без змін (крім його кількості посилань, яка збільшується на одиницю). Якщо переданий об’єкт є вказівником ``NULL``, припускається, що це сталося через те, що виклик, що створює аргумент, знайшов помилку та встановив виняток. Тому :c:func:`Py_BuildValue` поверне ``NULL``, але не викличе виняткову ситуацію. Якщо жодного винятку ще не було викликано, встановлено :exc:`SystemError`.

source: ``S`` (object) [PyObject \*]
uk: ``S`` (об'єкт) [PyObject \*]

source: Same as ``O``.
uk: Те саме, що "О".

source: ``N`` (object) [PyObject \*]
uk: ``N`` (об'єкт) [PyObject \*]

source: Same as ``O``, except it doesn't increment the reference count on the object. Useful when the object is created by a call to an object constructor in the argument list.
uk: Те саме, що ``O``, за винятком того, що він не збільшує кількість посилань на об’єкт. Корисно, коли об’єкт створюється за допомогою виклику конструктора об’єкта в списку аргументів.

source: Convert *anything* to a Python object through a *converter* function. The function is called with *anything* (which should be compatible with :c:type:`void*`) as its argument and should return a "new" Python object, or ``NULL`` if an error occurred.
uk: Перетворюйте *що завгодно* в об’єкт Python за допомогою функції *конвертера*. Функція викликається з *будь-яким* (що має бути сумісним з :c:type:`void*`) як аргументом і має повертати "новий" об’єкт Python або ``NULL``, якщо сталася помилка.

source: Convert a sequence of C values to a Python tuple with the same number of items.
uk: Перетворіть послідовність значень C на кортеж Python із такою ж кількістю елементів.

source: Convert a sequence of C values to a Python list with the same number of items.
uk: Перетворіть послідовність значень C на список Python з такою ж кількістю елементів.

source: ``{items}`` (:class:`dict`) [*matching-items*]
uk: ``{items}`` (:class:`dict`) [*відповідні-елементи*]

source: Convert a sequence of C values to a Python dictionary. Each pair of consecutive C values adds one item to the dictionary, serving as key and value, respectively.
uk: Перетворіть послідовність значень C у словник Python. Кожна пара послідовних значень C додає один елемент до словника, який виконує функції ключа та значення відповідно.

source: If there is an error in the format string, the :exc:`SystemError` exception is set and ``NULL`` returned.
uk: Якщо в рядку формату є помилка, встановлюється виняток :exc:`SystemError` і повертається ``NULL``.

source: Identical to :c:func:`Py_BuildValue`, except that it accepts a va_list rather than a variable number of arguments.
uk: Ідентичний :c:func:`Py_BuildValue`, за винятком того, що він приймає va_list, а не змінну кількість аргументів.
