Repository: python/python-docs-uk
Catalog: c-api/buffer.po
Languages: uk

source: Copy contiguous *len* bytes from *buf* to *view*. *fort* can be ``'C'`` or ``'F'`` (for C-style or Fortran-style ordering). ``0`` is returned on success, ``-1`` on error.
uk: Скопіюйте послідовні *len* байти з *buf* у *view*. *fort* може бути ``'C'`` або ``'F'`` (для впорядкування у стилі C або Fortran). ``0`` повертається в разі успіху, ``-1`` у разі помилки.

source: Copy *len* bytes from *src* to its contiguous representation in *buf*. *order* can be ``'C'`` or ``'F'`` or ``'A'`` (for C-style or Fortran-style ordering or either one). ``0`` is returned on success, ``-1`` on error.
uk: Скопіюйте *len* байти з *src* до його безперервного представлення в *buf*. *order* може бути ``'C'`` або ``'F'`` або ``'A'`` (для впорядкування в стилі C або Fortran або будь-якого з них). ``0`` повертається в разі успіху, ``-1`` у разі помилки.

source: This function fails if *len* != *src->len*.
uk: Ця функція не працює, якщо *len* != *src->len*.

source: Fill the *strides* array with byte-strides of a :term:`contiguous` (C-style if *order* is ``'C'`` or Fortran-style if *order* is ``'F'``) array of the given shape with the given number of bytes per element.
uk: Заповніть масив *strides* байтовими кроками :term:`contiguous` (у стилі C, якщо *order* має значення ``'C'``, або у стилі Fortran, якщо *order* має значення ``'F'`` ) масив заданої форми із заданою кількістю байтів на елемент.

source: Handle buffer requests for an exporter that wants to expose *buf* of size *len* with writability set according to *readonly*. *buf* is interpreted as a sequence of unsigned bytes.
uk: Обробляти запити буфера для експортера, який хоче відкрити *buf* розміру *len* із можливістю запису, встановленою відповідно до *readonly*. *buf* інтерпретується як послідовність байтів без знаку.

source: The *flags* argument indicates the request type. This function always fills in *view* as specified by flags, unless *buf* has been designated as read-only and :c:macro:`PyBUF_WRITABLE` is set in *flags*.
uk: Аргумент *flags* вказує на тип запиту. Ця функція завжди заповнює *view*, як зазначено прапорцями, якщо *buf* не призначено лише для читання і :c:macro:`PyBUF_WRITABLE` встановлено у *flags*.

source: If this function is used as part of a :ref:`getbufferproc <buffer-structs>`, *exporter* MUST be set to the exporting object and *flags* must be passed unmodified. Otherwise, *exporter* MUST be ``NULL``.
uk: Якщо ця функція використовується як частина :ref:`getbufferproc <buffer-structs>`, *exporter* ПОВИНЕН бути встановлений на об’єкт експорту, а *flags* мають бути передані без змін. В іншому випадку *exporter* ПОВИНЕН бути ``NULL``.

source: contiguous
uk: суміжний
