Repository: python/python-docs-uk
Catalog: c-api/bytearray.po
Languages: uk

source: Byte Array Objects
uk: Об’єкти байтового масиву

source: This subtype of :c:type:`PyObject` represents a Python bytearray object.
uk: Цей підтип :c:type:`PyObject` представляє об’єкт Python bytearray.

source: This instance of :c:type:`PyTypeObject` represents the Python bytearray type; it is the same object as :class:`bytearray` in the Python layer.
uk: Цей екземпляр :c:type:`PyTypeObject` представляє тип Python bytearray; це той самий об’єкт, що й :class:`bytearray` на рівні Python.

source: Type check macros
uk: Макроси перевірки типу

source: Return true if the object *o* is a bytearray object or an instance of a subtype of the bytearray type. This function always succeeds.
uk: Повертає true, якщо об’єкт *o* є об’єктом bytearray або екземпляром підтипу типу bytearray. Ця функція завжди успішна.

source: Return true if the object *o* is a bytearray object, but not an instance of a subtype of the bytearray type. This function always succeeds.
uk: Повертає true, якщо об’єкт *o* є об’єктом bytearray, але не екземпляром підтипу типу bytearray. Ця функція завжди успішна.

source: Direct API functions
uk: Прямі функції API

source: Return a new bytearray object from any object, *o*, that implements the :ref:`buffer protocol <bufferobjects>`.
uk: Повертає новий об’єкт bytearray з будь-якого об’єкта, *o*, який реалізує :ref:`протокол буфера <bufferobjects>`.

source: Concat bytearrays *a* and *b* and return a new bytearray with the result.
uk: Об’єднайте масиви байтів *a* і *b* та поверніть новий масив байтів із результатом.

source: Return the size of *bytearray* after checking for a ``NULL`` pointer.
uk: Повертає розмір *bytearray* після перевірки вказівника ``NULL``.

source: Return the contents of *bytearray* as a char array after checking for a ``NULL`` pointer. The returned array always has an extra null byte appended.
uk: Повертає вміст *bytearray* як масив char після перевірки вказівника ``NULL``. Повернений масив завжди має додатковий нульовий байт.

source: Resize the internal buffer of *bytearray* to *len*.
uk: Змініть розмір внутрішнього буфера *bytearray* на *len*.

source: Macros
uk: Макроси

source: These macros trade safety for speed and they don't check pointers.
uk: Ці макроси замінюють безпеку на швидкість, і вони не перевіряють покажчики.

source: object
uk: об'єкт
