Repository: python/python-docs-uk
Catalog: c-api/capsule.po
Languages: uk

source: Capsules
uk: Капсули

source: Refer to :ref:`using-capsules` for more information on using these objects.
uk: Зверніться до :ref:`using-capsules` для отримання додаткової інформації про використання цих об’єктів.

source: The type of a destructor callback for a capsule. Defined as::
uk: Тип зворотного виклику деструктора для капсули. Визначається як::

source: See :c:func:`PyCapsule_New` for the semantics of PyCapsule_Destructor callbacks.
uk: Перегляньте :c:func:`PyCapsule_New` для семантики зворотних викликів PyCapsule_Destructor.

source: Return true if its argument is a :c:type:`PyCapsule`. This function always succeeds.
uk: Повертає true, якщо його аргумент :c:type:`PyCapsule`. Ця функція завжди успішна.

source: Create a :c:type:`PyCapsule` encapsulating the *pointer*. The *pointer* argument may not be ``NULL``.
uk: Створіть :c:type:`PyCapsule`, що інкапсулює *вказівник*. Аргумент *покажчик* не може бути ``NULL``.

source: On failure, set an exception and return ``NULL``.
uk: У разі помилки встановіть виняток і поверніть ``NULL``.

source: The *name* string may either be ``NULL`` or a pointer to a valid C string. If non-``NULL``, this string must outlive the capsule. (Though it is permitted to free it inside the *destructor*.)
uk: Рядок *name* може бути ``NULL`` або вказівником на дійсний рядок C. Якщо значення не NULL, цей рядок має пережити капсулу. (Хоча його можна звільнити всередині *деструктора*.)

source: If the *destructor* argument is not ``NULL``, it will be called with the capsule as its argument when it is destroyed.
uk: Якщо аргумент *destructor* не дорівнює ``NULL``, він буде викликаний з капсулою як аргументом під час її знищення.

source: If this capsule will be stored as an attribute of a module, the *name* should be specified as ``modulename.attributename``. This will enable other modules to import the capsule using :c:func:`PyCapsule_Import`.
uk: Якщо ця капсула зберігатиметься як атрибут модуля, *ім’я* слід вказати як ``modulename.attributename``. Це дозволить іншим модулям імпортувати капсулу за допомогою :c:func:`PyCapsule_Import`.

source: Retrieve the *pointer* stored in the capsule. On failure, set an exception and return ``NULL``.
uk: Отримайте *вказівник*, що зберігається в капсулі. У разі помилки встановіть виняток і поверніть ``NULL``.

source: Return the current destructor stored in the capsule. On failure, set an exception and return ``NULL``.
uk: Повертає поточний деструктор, що зберігається в капсулі. У разі помилки встановіть виняток і поверніть ``NULL``.

source: It is legal for a capsule to have a ``NULL`` destructor. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
uk: Для капсули допустимо мати деструктор ``NULL``. Це робить код повернення ``NULL`` дещо неоднозначним; використовуйте :c:func:`PyCapsule_IsValid` або :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Return the current context stored in the capsule. On failure, set an exception and return ``NULL``.
uk: Повертає поточний контекст, що зберігається в капсулі. У разі помилки встановіть виняток і поверніть ``NULL``.

source: It is legal for a capsule to have a ``NULL`` context. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
uk: Для капсули допустимо мати контекст ``NULL``. Це робить код повернення ``NULL`` дещо неоднозначним; використовуйте :c:func:`PyCapsule_IsValid` або :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Return the current name stored in the capsule. On failure, set an exception and return ``NULL``.
uk: Повернути поточну назву, збережену в капсулі. У разі помилки встановіть виняток і поверніть ``NULL``.

source: It is legal for a capsule to have a ``NULL`` name. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
uk: Для капсули є законним ім’я ``NULL``. Це робить код повернення ``NULL`` дещо неоднозначним; використовуйте :c:func:`PyCapsule_IsValid` або :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Return the capsule's internal *pointer* on success. On failure, set an exception and return ``NULL``.
uk: Поверніть внутрішній *покажчик* капсули в разі успіху. У разі помилки встановіть виняток і поверніть ``NULL``.

source: Determines whether or not *capsule* is a valid capsule. A valid capsule is non-``NULL``, passes :c:func:`PyCapsule_CheckExact`, has a non-``NULL`` pointer stored in it, and its internal name matches the *name* parameter. (See :c:func:`PyCapsule_GetPointer` for information on how capsule names are compared.)
uk: Визначає, чи є *capsule* дійсною капсулою. Дійсна капсула не є ``NULL``, передає :c:func:`PyCapsule_CheckExact`, має збережений вказівник не ``NULL``, а її внутрішнє ім’я збігається з параметром *name*. (Див. :c:func:`PyCapsule_GetPointer` для отримання інформації про те, як порівнюються назви капсул.)

source: Return a nonzero value if the object is valid and matches the name passed in. Return ``0`` otherwise. This function will not fail.
uk: Повертає ненульове значення, якщо об’єкт дійсний і відповідає переданому імені. В іншому випадку повертає ``0``. Ця функція не дасть збою.

source: Set the context pointer inside *capsule* to *context*.
uk: Встановіть покажчик контексту всередині *capsule* на *context*.

source: Return ``0`` on success. Return nonzero and set an exception on failure.
uk: У разі успіху повертає ``0``. Повертає ненульове значення та встановлює виняток у разі помилки.

source: Set the destructor inside *capsule* to *destructor*.
uk: Встановіть для деструктора всередині *capsule* значення *destructor*.

source: Set the name inside *capsule* to *name*. If non-``NULL``, the name must outlive the capsule. If the previous *name* stored in the capsule was not ``NULL``, no attempt is made to free it.
uk: Встановіть назву всередині *capsule* на *name*. Якщо значення не NULL, ім’я має пережити капсулу. Якщо попереднє *ім’я*, збережене в капсулі, не було ``NULL``, спроба звільнити його не робиться.

source: Set the void pointer inside *capsule* to *pointer*. The pointer may not be ``NULL``.
uk: Встановіть вказівник пустоти всередині *capsule* на *pointer*. Покажчик не може бути ``NULL``.

source: object
uk: об'єкт
