Repository: python/python-docs-uk
Catalog: c-api/cell.po
Languages: uk

source: Cell Objects
uk: Об'єкти клітинки

source: "Cell" objects are used to implement variables referenced by multiple scopes. For each such variable, a cell object is created to store the value; the local variables of each stack frame that references the value contains a reference to the cells from outer scopes which also use that variable. When the value is accessed, the value contained in the cell is used instead of the cell object itself. This de-referencing of the cell object requires support from the generated byte-code; these are not automatically de-referenced when accessed. Cell objects are not likely to be useful elsewhere.
uk: Об’єкти "Cell" використовуються для реалізації змінних, на які посилаються кілька областей. Для кожної такої змінної створюється об’єкт комірки для зберігання значення; локальні змінні кожного фрейму стека, який посилається на значення, містять посилання на клітинки із зовнішніх областей, які також використовують цю змінну. Коли здійснюється доступ до значення, значення, що міститься в комірці, використовується замість самого об’єкта комірки. Це депосилання об'єкта комірки вимагає підтримки згенерованого байт-коду; вони не знімаються автоматично під час доступу. Об’єкти клітинок навряд чи знадобляться в інших місцях.

source: The C structure used for cell objects.
uk: Структура C, яка використовується для об’єктів клітинки.

source: The type object corresponding to cell objects.
uk: Об’єкт типу, що відповідає об’єктам комірки.

source: Return true if *ob* is a cell object; *ob* must not be ``NULL``. This function always succeeds.
uk: Повертає true, якщо *ob* є об’єктом клітинки; *ob* не має бути ``NULL``. Ця функція завжди успішна.

source: Create and return a new cell object containing the value *ob*. The parameter may be ``NULL``.
uk: Створіть і поверніть новий об’єкт клітинки, що містить значення *ob*. Параметр може бути ``NULL``.

source: Return the contents of the cell *cell*.
uk: Повернути вміст комірки *cell*.

source: Return the contents of the cell *cell*, but without checking that *cell* is non-``NULL`` and a cell object.
uk: Повертає вміст комірки *cell*, але без перевірки того, що *cell* не є ``NULL`` і є об’єктом комірки.

source: Set the contents of the cell object *cell* to *value*. This releases the reference to any current content of the cell. *value* may be ``NULL``. *cell* must be non-``NULL``; if it is not a cell object, ``-1`` will be returned. On success, ``0`` will be returned.
uk: Встановіть для вмісту об’єкта комірки *cell* значення *value*. Це звільняє посилання на будь-який поточний вміст комірки. *значення* може бути ``NULL``. *комірка* не має бути ``NULL``; якщо це не об’єкт комірки, буде повернено ``-1``. У разі успіху буде повернено ``0``.

source: Sets the value of the cell object *cell* to *value*. No reference counts are adjusted, and no checks are made for safety; *cell* must be non-``NULL`` and must be a cell object.
uk: Встановлює для об’єкта клітинки *cell* значення *value*. Підрахунок посилань не коригується, і перевірки безпеки не проводяться; *cell* не має бути ``NULL`` і має бути об’єктом клітинки.
