Repository: python/python-docs-uk
Catalog: c-api/codec.po
Languages: uk

source: Codec registry and support functions
uk: Реєстр кодеків і функції підтримки

source: Register a new codec search function.
uk: Зареєструйте нову функцію пошуку кодеків.

source: As side effect, this tries to load the :mod:`!encodings` package, if not yet done, to make sure that it is always first in the list of search functions.
uk: Як побічний ефект, це намагається завантажити пакет :mod:`!encodings`, якщо він ще не був завантажений, щоб переконатися, що він завжди перший у списку функцій пошуку.

source: Unregister a codec search function and clear the registry's cache. If the search function is not registered, do nothing. Return 0 on success. Raise an exception and return -1 on error.
uk: Скасуйте реєстрацію функції пошуку кодеків і очистіть кеш реєстру. Якщо функція пошуку не зареєстрована, нічого не робіть. Повернути 0 у разі успіху. Викликати виняток і повертати -1 у разі помилки.

source: Return ``1`` or ``0`` depending on whether there is a registered codec for the given *encoding*. This function always succeeds.
uk: Повертає ``1`` або ``0`` залежно від того, чи існує зареєстрований кодек для даного *кодування*. Ця функція завжди успішна.

source: Generic codec based encoding API.
uk: API кодування на основі універсального кодека.

source: *object* is passed through the encoder function found for the given *encoding* using the error handling method defined by *errors*. *errors* may be ``NULL`` to use the default method defined for the codec. Raises a :exc:`LookupError` if no encoder can be found.
uk: *об’єкт* передається через функцію кодувальника, знайдену для даного *кодування* за допомогою методу обробки помилок, визначеного *errors*. *помилки* можуть бути ``NULL`` для використання методу за замовчуванням, визначеного для кодека. Викликає :exc:`LookupError`, якщо кодувальник не знайдено.

source: Generic codec based decoding API.
uk: Загальний API декодування на основі кодеків.

source: *object* is passed through the decoder function found for the given *encoding* using the error handling method defined by *errors*. *errors* may be ``NULL`` to use the default method defined for the codec. Raises a :exc:`LookupError` if no encoder can be found.
uk: *об’єкт* передається через функцію декодера, знайдену для даного *кодування* за допомогою методу обробки помилок, визначеного *errors*. *помилки* можуть бути ``NULL`` для використання методу за замовчуванням, визначеного для кодека. Викликає :exc:`LookupError`, якщо кодувальник не знайдено.

source: Codec lookup API
uk: API пошуку кодеків

source: In the following functions, the *encoding* string is looked up converted to all lower-case characters, which makes encodings looked up through this mechanism effectively case-insensitive. If no codec is found, a :exc:`KeyError` is set and ``NULL`` returned.
uk: У наведених нижче функціях рядок *encoding* перетворюється на всі символи нижнього регістру, що робить кодування, які шукаються за допомогою цього механізму, без урахування регістру. Якщо кодек не знайдено, встановлюється :exc:`KeyError` і повертається ``NULL``.

source: Get an encoder function for the given *encoding*.
uk: Отримайте функцію кодувальника для заданого *кодування*.

source: Get a decoder function for the given *encoding*.
uk: Отримайте функцію декодера для заданого *кодування*.

source: Get an :class:`~codecs.IncrementalEncoder` object for the given *encoding*.
uk: Отримайте об’єкт :class:`~codecs.IncrementalEncoder` для вказаного *кодування*.

source: Get an :class:`~codecs.IncrementalDecoder` object for the given *encoding*.
uk: Отримайте об’єкт :class:`~codecs.IncrementalDecoder` для вказаного *кодування*.

source: Get a :class:`~codecs.StreamReader` factory function for the given *encoding*.
uk: Отримати фабричну функцію :class:`~codecs.StreamReader` для заданого *кодування*.

source: Get a :class:`~codecs.StreamWriter` factory function for the given *encoding*.
uk: Отримати фабричну функцію :class:`~codecs.StreamWriter` для вказаного *кодування*.

source: Registry API for Unicode encoding error handlers
uk: API реєстру для обробників помилок кодування Unicode

source: Register the error handling callback function *error* under the given *name*. This callback function will be called by a codec when it encounters unencodable characters/undecodable bytes and *name* is specified as the error parameter in the call to the encode/decode function.
uk: Зареєструйте функцію зворотного виклику обробки помилок *error* під вказаним *ім’ям*. Ця функція зворотного виклику буде викликана кодеком, коли він зустріне некодовані символи/некодовані байти, а *name* вказано як параметр помилки під час виклику функції кодування/декодування.

source: The callback gets a single argument, an instance of :exc:`UnicodeEncodeError`, :exc:`UnicodeDecodeError` or :exc:`UnicodeTranslateError` that holds information about the problematic sequence of characters or bytes and their offset in the original string (see :ref:`unicodeexceptions` for functions to extract this information). The callback must either raise the given exception, or return a two-item tuple containing the replacement for the problematic sequence, and an integer giving the offset in the original string at which encoding/decoding should be resumed.
uk: Зворотний виклик отримує один аргумент, екземпляр :exc:`UnicodeEncodeError`, :exc:`UnicodeDecodeError` або :exc:`UnicodeTranslateError`, який містить інформацію про проблемну послідовність символів або байтів та їх зсув у вихідному рядку (див. :ref:`unicodeexceptions` для функцій для отримання цієї інформації). Зворотний виклик повинен або викликати заданий виняток, або повертати кортеж із двох елементів, що містить заміну для проблемної послідовності, і ціле число, що дає зсув у вихідному рядку, на якому кодування/декодування має бути відновлено.

source: Return ``0`` on success, ``-1`` on error.
uk: Повертає ``0`` в разі успіху, ``-1`` у разі помилки.

source: Lookup the error handling callback function registered under *name*. As a special case ``NULL`` can be passed, in which case the error handling callback for "strict" will be returned.
uk: Пошук функції зворотного виклику обробки помилок, зареєстрованої під *ім’ям*. Як особливий випадок можна передати ``NULL``, у цьому випадку буде повернено зворотний виклик обробки помилок для "strict".

source: Raise *exc* as an exception.
uk: Підніміть *exc* як виняток.

source: Ignore the unicode error, skipping the faulty input.
uk: Ігноруйте помилку Юнікоду, пропускаючи неправильне введення.

source: Replace the unicode encode error with ``?`` or ``U+FFFD``.
uk: Замініть помилку кодування Unicode на ``?`` або ``U+FFFD``.

source: Replace the unicode encode error with XML character references.
uk: Замініть помилку кодування Unicode посиланнями на символи XML.

source: Replace the unicode encode error with backslash escapes (``\x``, ``\u`` and ``\U``).
uk: Замініть помилку кодування Unicode на екранування зворотної похилої риски (``\x``, ``\u`` і ``\U``).

source: Replace the unicode encode error with ``\N{...}`` escapes.
uk: Замініть помилку кодування Юнікод на символи ``\N{...}``.
