Repository: python/python-docs-uk
Catalog: c-api/complex.po
Languages: uk

source: Complex Number Objects
uk: Об’єкти комплексних чисел

source: Python's complex number objects are implemented as two distinct types when viewed from the C API: one is the Python object exposed to Python programs, and the other is a C structure which represents the actual complex number value. The API provides functions for working with both.
uk: Об’єкти комплексних чисел Python реалізуються як два різних типи, якщо дивитися через C API: один є об’єктом Python, відкритим для програм Python, а інший є структурою C, яка представляє фактичне значення комплексного числа. API надає функції для роботи з обома.

source: Complex Numbers as C Structures
uk: Комплексні числа як C структури

source: Note that the functions which accept these structures as parameters and return them as results do so *by value* rather than dereferencing them through pointers. This is consistent throughout the API.
uk: Зауважте, що функції, які приймають ці структури як параметри та повертають їх як результати, роблять це *за значенням*, а не розіменовують їх через покажчики. Це узгоджено в усьому API.

source: The C structure which corresponds to the value portion of a Python complex number object. Most of the functions for dealing with complex number objects use structures of this type as input or output values, as appropriate. It is defined as::
uk: Структура C, яка відповідає частині значення об’єкта комплексного числа Python. Більшість функцій для роботи з об’єктами комплексних чисел використовують структури цього типу як вхідні чи вихідні значення, відповідно. Він визначається як::

source: Return the sum of two complex numbers, using the C :c:type:`Py_complex` representation.
uk: Повертає суму двох комплексних чисел, використовуючи представлення C :c:type:`Py_complex`.

source: Return the difference between two complex numbers, using the C :c:type:`Py_complex` representation.
uk: Повертає різницю між двома комплексними числами, використовуючи представлення C :c:type:`Py_complex`.

source: Return the negation of the complex number *num*, using the C :c:type:`Py_complex` representation.
uk: Повертає заперечення комплексного числа *num*, використовуючи представлення C :c:type:`Py_complex`.

source: Return the product of two complex numbers, using the C :c:type:`Py_complex` representation.
uk: Повертає добуток двох комплексних чисел, використовуючи представлення C :c:type:`Py_complex`.

source: Return the quotient of two complex numbers, using the C :c:type:`Py_complex` representation.
uk: Повертає частку двох комплексних чисел, використовуючи представлення C :c:type:`Py_complex`.

source: If *divisor* is null, this method returns zero and sets :c:data:`errno` to :c:data:`EDOM`.
uk: Якщо *divisor* має значення null, цей метод повертає нуль і встановлює :c:data:`errno` на :c:data:`EDOM`.

source: Return the exponentiation of *num* by *exp*, using the C :c:type:`Py_complex` representation.
uk: Повертає піднесення *num* до степеня *exp*, використовуючи представлення C :c:type:`Py_complex`.

source: If *num* is null and *exp* is not a positive real number, this method returns zero and sets :c:data:`errno` to :c:data:`EDOM`.
uk: Якщо *num* дорівнює нулю, а *exp* не є додатним дійсним числом, цей метод повертає нуль і встановлює :c:data:`errno` на :c:data:`EDOM`.

source: Complex Numbers as Python Objects
uk: Комплексні числа як об’єкти Python

source: This subtype of :c:type:`PyObject` represents a Python complex number object.
uk: Цей підтип :c:type:`PyObject` представляє об’єкт комплексного числа Python.

source: This instance of :c:type:`PyTypeObject` represents the Python complex number type. It is the same object as :class:`complex` in the Python layer.
uk: Цей екземпляр :c:type:`PyTypeObject` представляє тип комплексного числа Python. Це той самий об’єкт, що й :class:`complex` на рівні Python.

source: Return true if its argument is a :c:type:`PyComplexObject` or a subtype of :c:type:`PyComplexObject`. This function always succeeds.
uk: Повертає true, якщо його аргумент є :c:type:`PyComplexObject` або підтипом :c:type:`PyComplexObject`. Ця функція завжди успішна.

source: Return true if its argument is a :c:type:`PyComplexObject`, but not a subtype of :c:type:`PyComplexObject`. This function always succeeds.
uk: Повертає true, якщо його аргумент є :c:type:`PyComplexObject`, але не підтипом :c:type:`PyComplexObject`. Ця функція завжди успішна.

source: Create a new Python complex number object from a C :c:type:`Py_complex` value.
uk: Створіть новий об’єкт комплексного числа Python зі значення C :c:type:`Py_complex`.

source: Return a new :c:type:`PyComplexObject` object from *real* and *imag*.
uk: Повертає новий об’єкт :c:type:`PyComplexObject` із *real* і *imag*.

source: Return the real part of *op* as a C :c:type:`double`.
uk: Повертає дійсну частину *op* як C :c:type:`double`.

source: Return the imaginary part of *op* as a C :c:type:`double`.
uk: Повертає уявну частину *op* як C :c:type:`double`.

source: Return the :c:type:`Py_complex` value of the complex number *op*.
uk: Повертає значення :c:type:`Py_complex` комплексного числа *op*.

source: If *op* is not a Python complex number object but has a :meth:`__complex__` method, this method will first be called to convert *op* to a Python complex number object. If ``__complex__()`` is not defined then it falls back to :meth:`__float__`. If ``__float__()`` is not defined then it falls back to :meth:`__index__`. Upon failure, this method returns ``-1.0`` as a real value.
uk: Якщо *op* не є об’єктом комплексного числа Python, але має метод :meth:`__complex__`, цей метод спочатку буде викликано для перетворення *op* на об’єкт комплексного числа Python. Якщо ``__complex__()`` не визначено, тоді він повертається до :meth:`__float__`. Якщо ``__float__()`` не визначено, він повертається до :meth:`__index__`. У разі помилки цей метод повертає ``-1.0`` як дійсне значення.

source: Use :meth:`__index__` if available.
uk: Використовуйте :meth:`__index__`, якщо доступний.
