Repository: python/python-docs-uk
Catalog: c-api/concrete.po
Languages: uk

source: Concrete Objects Layer
uk: Шар бетонних об'єктів

source: The functions in this chapter are specific to certain Python object types. Passing them an object of the wrong type is not a good idea; if you receive an object from a Python program and you are not sure that it has the right type, you must perform a type check first; for example, to check that an object is a dictionary, use :c:func:`PyDict_Check`. The chapter is structured like the "family tree" of Python object types.
uk: Функції в цій главі є специфічними для певних типів об’єктів Python. Передавати їм об’єкт неправильного типу – не дуже гарна ідея; якщо ви отримуєте об’єкт із програми Python і не впевнені, що він має правильний тип, ви повинні спочатку виконати перевірку типу; наприклад, щоб перевірити, що об’єкт є словником, використовуйте :c:func:`PyDict_Check`. Глава структурована як "генеалогічне дерево" типів об’єктів Python.

source: While the functions described in this chapter carefully check the type of the objects which are passed in, many of them do not check for ``NULL`` being passed instead of a valid object. Allowing ``NULL`` to be passed in can cause memory access violations and immediate termination of the interpreter.
uk: У той час як функції, описані в цій главі, ретельно перевіряють тип об’єктів, які передаються, багато з них не перевіряють ``NULL``, який передається замість дійсного об’єкта. Дозвіл на передачу ``NULL`` може спричинити порушення доступу до пам’яті та негайне припинення роботи інтерпретатора.

source: Fundamental Objects
uk: Фундаментальні об'єкти

source: This section describes Python type objects and the singleton object ``None``.
uk: У цьому розділі описано об’єкти типу Python і одиночний об’єкт ``None``.

source: Numeric Objects
uk: Числові об'єкти

source: Sequence Objects
uk: Об’єкти послідовності

source: Generic operations on sequence objects were discussed in the previous chapter; this section deals with the specific kinds of sequence objects that are intrinsic to the Python language.
uk: Загальні операції над об’єктами послідовності обговорювалися в попередньому розділі; у цьому розділі розглядаються конкретні типи об’єктів послідовності, властиві мові Python.

source: Container Objects
uk: Контейнерні об’єкти

source: Function Objects
uk: Функціональні об’єкти

source: Other Objects
uk: Інші об'єкти

source: object
uk: об'єкт

source: numeric
uk: числовий

source: sequence
uk: послідовність

source: mapping
uk: відображення
