Repository: python/python-docs-uk
Catalog: c-api/float.po
Languages: uk

source: Floating Point Objects
uk: Об'єкти з плаваючою комою

source: This subtype of :c:type:`PyObject` represents a Python floating point object.
uk: Цей підтип :c:type:`PyObject` представляє об’єкт з плаваючою комою Python.

source: This instance of :c:type:`PyTypeObject` represents the Python floating point type. This is the same object as :class:`float` in the Python layer.
uk: Цей екземпляр :c:type:`PyTypeObject` представляє тип Python з плаваючою комою. Це той самий об’єкт, що й :class:`float` на рівні Python.

source: Return true if its argument is a :c:type:`PyFloatObject` or a subtype of :c:type:`PyFloatObject`. This function always succeeds.
uk: Повертає true, якщо його аргумент є :c:type:`PyFloatObject` або підтипом :c:type:`PyFloatObject`. Ця функція завжди успішна.

source: Return true if its argument is a :c:type:`PyFloatObject`, but not a subtype of :c:type:`PyFloatObject`. This function always succeeds.
uk: Повертає true, якщо його аргумент є :c:type:`PyFloatObject`, але не підтипом :c:type:`PyFloatObject`. Ця функція завжди успішна.

source: Create a :c:type:`PyFloatObject` object based on the string value in *str*, or ``NULL`` on failure.
uk: Створіть об’єкт :c:type:`PyFloatObject` на основі рядкового значення в *str* або ``NULL`` у разі помилки.

source: Create a :c:type:`PyFloatObject` object from *v*, or ``NULL`` on failure.
uk: Створіть об’єкт :c:type:`PyFloatObject` з *v* або ``NULL`` у разі помилки.

source: Return a C :c:type:`double` representation of the contents of *pyfloat*. If *pyfloat* is not a Python floating point object but has a :meth:`__float__` method, this method will first be called to convert *pyfloat* into a float. If ``__float__()`` is not defined then it falls back to :meth:`__index__`. This method returns ``-1.0`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
uk: Повертає C :c:type:`double` представлення вмісту *pyfloat*. Якщо *pyfloat* не є об’єктом з плаваючою комою Python, але має метод :meth:`__float__`, цей метод спочатку буде викликаний для перетворення *pyfloat* на float. Якщо ``__float__()`` не визначено, він повертається до :meth:`__index__`. Цей метод повертає ``-1.0`` у разі помилки, тому слід викликати :c:func:`PyErr_Occurred`, щоб перевірити наявність помилок.

source: Use :meth:`__index__` if available.
uk: Використовуйте :meth:`__index__`, якщо доступний.

source: Return a C :c:type:`double` representation of the contents of *pyfloat*, but without error checking.
uk: Повертає C :c:type:`double` представлення вмісту *pyfloat*, але без перевірки помилок.

source: Return a structseq instance which contains information about the precision, minimum and maximum values of a float. It's a thin wrapper around the header file :file:`float.h`.
uk: Повертає екземпляр structseq, який містить інформацію про точність, мінімальне та максимальне значення float. Це тонка обгортка навколо файлу заголовка :file:`float.h`.

source: Return the maximum representable finite float *DBL_MAX* as C :c:type:`double`.
uk: Повертає максимальний кінцевий float *DBL_MAX*, який можна представити, як C :c:type:`double`.

source: Return the minimum normalized positive float *DBL_MIN* as C :c:type:`double`.
uk: Повертає мінімальне нормалізоване позитивне значення *DBL_MIN* як C :c:type:`double`.
