Repository: python/python-docs-uk
Catalog: c-api/intro.po
Languages: uk

source: The reference count behavior of functions in the Python/C API is best explained in terms of *ownership of references*. Ownership pertains to references, never to objects (objects are not owned: they are always shared). "Owning a reference" means being responsible for calling Py_DECREF on it when the reference is no longer needed. Ownership can also be transferred, meaning that the code that receives ownership of the reference then becomes responsible for eventually decref'ing it by calling :c:func:`Py_DECREF` or :c:func:`Py_XDECREF` when it's no longer needed---or passing on this responsibility (usually to its caller). When a function passes ownership of a reference on to its caller, the caller is said to receive a *new* reference. When no ownership is transferred, the caller is said to *borrow* the reference. Nothing needs to be done for a :term:`borrowed reference`.
uk: Поведінку підрахунку посилань функцій у Python/C API найкраще пояснити з точки зору *володіння посиланнями*. Право власності стосується посилань, а не об’єктів (об’єкти не належать: вони завжди є спільними). "Володіння посиланням" означає відповідальність за виклик Py_DECREF на ньому, коли посилання більше не потрібне. Право власності також може бути передане, тобто код, який отримує право власності на посилання, стає відповідальним за остаточне його дешифрування шляхом виклику :c:func:`Py_DECREF` або :c:func:`Py_XDECREF`, коли він більше не потрібен - --або передача цієї відповідальності (зазвичай абоненту). Коли функція передає право власності на посилання її викликаючому, той, хто викликає, отримує *нове* посилання. Якщо право власності не передається, кажуть, що абонент *позичив* посилання. Нічого не потрібно робити для :term:`borrowed reference`.

source: Conversely, when a calling function passes in a reference to an object, there are two possibilities: the function *steals* a reference to the object, or it does not. *Stealing a reference* means that when you pass a reference to a function, that function assumes that it now owns that reference, and you are not responsible for it any longer.
uk: І навпаки, коли функція, що викликає, передає посилання на об’єкт, є дві можливості: функція *вкрадає* посилання на об’єкт або ні. *Крадіжка посилання* означає, що коли ви передаєте посилання на функцію, ця функція припускає, що вона тепер володіє цим посиланням, і ви більше не несете за це відповідальності.

source: Few functions steal references; the two notable exceptions are :c:func:`PyList_SetItem` and :c:func:`PyTuple_SetItem`, which steal a reference to the item (but not to the tuple or list into which the item is put!). These functions were designed to steal a reference because of a common idiom for populating a tuple or list with newly created objects; for example, the code to create the tuple ``(1, 2, "three")`` could look like this (forgetting about error handling for the moment; a better way to code this is shown below)::
uk: Кілька функцій викрадають посилання; двома помітними винятками є :c:func:`PyList_SetItem` і :c:func:`PyTuple_SetItem`, які викрадають посилання на елемент (але не на кортеж або список, до якого поміщено елемент!). Ці функції були розроблені для викрадення посилання через загальну ідіому для заповнення кортежу або списку новоствореними об’єктами; наприклад, код для створення кортежу ``(1, 2, "three")`` може виглядати так (наразі забувши про обробку помилок; кращий спосіб кодування цього показано нижче):

source: Here, :c:func:`PyLong_FromLong` returns a new reference which is immediately stolen by :c:func:`PyTuple_SetItem`. When you want to keep using an object although the reference to it will be stolen, use :c:func:`Py_INCREF` to grab another reference before calling the reference-stealing function.
uk: Тут :c:func:`PyLong_FromLong` повертає нове посилання, яке негайно викрадає :c:func:`PyTuple_SetItem`. Якщо ви хочете продовжувати використовувати об’єкт, хоча посилання на нього буде вкрадено, використовуйте :c:func:`Py_INCREF`, щоб захопити інше посилання перед викликом функції викрадання посилань.

source: Incidentally, :c:func:`PyTuple_SetItem` is the *only* way to set tuple items; :c:func:`PySequence_SetItem` and :c:func:`PyObject_SetItem` refuse to do this since tuples are an immutable data type. You should only use :c:func:`PyTuple_SetItem` for tuples that you are creating yourself.
uk: До речі, :c:func:`PyTuple_SetItem` є *єдиним* способом встановлення елементів кортежу; :c:func:`PySequence_SetItem` і :c:func:`PyObject_SetItem` відмовляються робити це, оскільки кортежі є незмінним типом даних. Ви повинні використовувати лише :c:func:`PyTuple_SetItem` для кортежів, які ви створюєте самостійно.

source: Equivalent code for populating a list can be written using :c:func:`PyList_New` and :c:func:`PyList_SetItem`.
uk: Еквівалентний код для заповнення списку можна написати за допомогою :c:func:`PyList_New` і :c:func:`PyList_SetItem`.

source: However, in practice, you will rarely use these ways of creating and populating a tuple or list. There's a generic function, :c:func:`Py_BuildValue`, that can create most common objects from C values, directed by a :dfn:`format string`. For example, the above two blocks of code could be replaced by the following (which also takes care of the error checking)::
uk: Однак на практиці ви рідко будете використовувати ці способи створення та заповнення кортежу чи списку. Існує загальна функція, :c:func:`Py_BuildValue`, яка може створювати найбільш поширені об’єкти зі значень C, керованих :dfn:`format string`. Наприклад, наведені вище два блоки коду можна замінити наступним (який також піклується про перевірку помилок):

source: It is much more common to use :c:func:`PyObject_SetItem` and friends with items whose references you are only borrowing, like arguments that were passed in to the function you are writing. In that case, their behaviour regarding reference counts is much saner, since you don't have to increment a reference count so you can give a reference away ("have it be stolen"). For example, this function sets all items of a list (actually, any mutable sequence) to a given item::
uk: Набагато поширеніше використовувати :c:func:`PyObject_SetItem` і друзів з елементами, посилання на які ви лише запозичуєте, наприклад аргументи, які були передані функції, яку ви пишете. У такому випадку їхня поведінка щодо кількості посилань є набагато розумнішою, оскільки вам не потрібно збільшувати кількість посилань, щоб ви могли віддати посилання ("нехай його вкрадуть"). Наприклад, ця функція встановлює всі елементи списку (фактично, будь-яку змінну послідовність) у заданий елемент::

source: The situation is slightly different for function return values. While passing a reference to most functions does not change your ownership responsibilities for that reference, many functions that return a reference to an object give you ownership of the reference. The reason is simple: in many cases, the returned object is created on the fly, and the reference you get is the only reference to the object. Therefore, the generic functions that return object references, like :c:func:`PyObject_GetItem` and :c:func:`PySequence_GetItem`, always return a new reference (the caller becomes the owner of the reference).
uk: Ситуація дещо інша для значень, що повертаються функцією. Хоча передача посилання на більшість функцій не змінює вашу відповідальність за це посилання, багато функцій, які повертають посилання на об’єкт, передають вам право власності на посилання. Причина проста: у багатьох випадках повернутий об’єкт створюється на льоту, і отримане вами посилання є єдиним посиланням на об’єкт. Тому загальні функції, які повертають посилання на об’єкти, як-от :c:func:`PyObject_GetItem` і :c:func:`PySequence_GetItem`, завжди повертають нове посилання (викликач стає власником посилання).

source: It is important to realize that whether you own a reference returned by a function depends on which function you call only --- *the plumage* (the type of the object passed as an argument to the function) *doesn't enter into it!* Thus, if you extract an item from a list using :c:func:`PyList_GetItem`, you don't own the reference --- but if you obtain the same item from the same list using :c:func:`PySequence_GetItem` (which happens to take exactly the same arguments), you do own a reference to the returned object.
uk: Важливо розуміти, що чи володієте ви посиланням, яке повертає функція, залежить лише від того, яку функцію ви викликаєте --- *оперення* (тип об’єкта, переданого як аргумент функції) *не входить до нього !* Таким чином, якщо ви витягуєте елемент зі списку за допомогою :c:func:`PyList_GetItem`, ви не володієте посиланням --- але якщо ви отримуєте той самий елемент із того самого списку за допомогою :c:func:`PySequence_GetItem` (який приймає точно ті самі аргументи), у вас є посилання на повернутий об’єкт.

source: Here is an example of how you could write a function that computes the sum of the items in a list of integers; once using :c:func:`PyList_GetItem`, and once using :c:func:`PySequence_GetItem`. ::
uk: Ось приклад того, як можна написати функцію, яка обчислює суму елементів у списку цілих чисел; один раз за допомогою :c:func:`PyList_GetItem` і один раз за допомогою :c:func:`PySequence_GetItem`. ::

source: Types
uk: Типи

source: There are few other data types that play a significant role in the Python/C API; most are simple C types such as :c:type:`int`, :c:type:`long`, :c:type:`double` and :c:type:`char*`. A few structure types are used to describe static tables used to list the functions exported by a module or the data attributes of a new object type, and another is used to describe the value of a complex number. These will be discussed together with the functions that use them.
uk: Є кілька інших типів даних, які відіграють значну роль в API Python/C; більшість є простими типами C, такими як :c:type:`int`, :c:type:`long`, :c:type:`double` і :c:type:`char*`. Кілька типів структури використовуються для опису статичних таблиць, які використовуються для переліку функцій, експортованих модулем, або атрибутів даних нового типу об’єкта, а інший використовується для опису значення комплексного числа. Вони будуть обговорюватися разом із функціями, які їх використовують.

source: A signed integral type such that ``sizeof(Py_ssize_t) == sizeof(size_t)``. C99 doesn't define such a thing directly (size_t is an unsigned integral type). See :pep:`353` for details. ``PY_SSIZE_T_MAX`` is the largest positive value of type :c:type:`Py_ssize_t`.
uk: Інтегральний тип зі знаком, такий що ``sizeof(Py_ssize_t) == sizeof(size_t)``. C99 не визначає таку річ безпосередньо (size_t є беззнаковим інтегральним типом). Подробиці див. :pep:`353`. ``PY_SSIZE_T_MAX`` є найбільшим додатним значенням типу :c:type:`Py_ssize_t`.

source: Exceptions
uk: Винятки

source: The Python programmer only needs to deal with exceptions if specific error handling is required; unhandled exceptions are automatically propagated to the caller, then to the caller's caller, and so on, until they reach the top-level interpreter, where they are reported to the user accompanied by a stack traceback.
uk: Програміст на Python має мати справу лише з винятками, якщо потрібна спеціальна обробка помилок; необроблені винятки автоматично поширюються до абонента, потім до абонента, що викликає, і так далі, доки вони не досягнуть інтерпретатора верхнього рівня, де про них повідомляється користувачеві в супроводі стека.

source: For C programmers, however, error checking always has to be explicit. All functions in the Python/C API can raise exceptions, unless an explicit claim is made otherwise in a function's documentation. In general, when a function encounters an error, it sets an exception, discards any object references that it owns, and returns an error indicator. If not documented otherwise, this indicator is either ``NULL`` or ``-1``, depending on the function's return type. A few functions return a Boolean true/false result, with false indicating an error. Very few functions return no explicit error indicator or have an ambiguous return value, and require explicit testing for errors with :c:func:`PyErr_Occurred`. These exceptions are always explicitly documented.
uk: Однак для програмістів на C перевірка помилок завжди має бути явною. Усі функції в Python/C API можуть викликати винятки, якщо в документації до функції не вказано інше. Загалом, коли функція стикається з помилкою, вона встановлює виняток, відкидає будь-які посилання на об’єкти, якими вона володіє, і повертає індикатор помилки. Якщо не задокументовано інше, цей індикатор має значення ``NULL`` або ``-1``, залежно від типу повернення функції. Кілька функцій повертають логічний результат true/false, де false вказує на помилку. Дуже небагато функцій не повертають явного індикатора помилки або мають неоднозначне значення, що повертається, і вимагають явного тестування помилок за допомогою :c:func:`PyErr_Occurred`. Ці винятки завжди чітко задокументовані.

source: Exception state is maintained in per-thread storage (this is equivalent to using global storage in an unthreaded application). A thread can be in one of two states: an exception has occurred, or not. The function :c:func:`PyErr_Occurred` can be used to check for this: it returns a borrowed reference to the exception type object when an exception has occurred, and ``NULL`` otherwise. There are a number of functions to set the exception state: :c:func:`PyErr_SetString` is the most common (though not the most general) function to set the exception state, and :c:func:`PyErr_Clear` clears the exception state.
uk: Винятковий стан підтримується в потоковому сховищі (це еквівалентно використанню глобального сховища в непотоковій програмі). Потік може перебувати в одному з двох станів: сталася виняток чи ні. Для перевірки цього можна використати функцію :c:func:`PyErr_Occurred`: вона повертає запозичене посилання на об’єкт типу винятку, коли виняток стався, і ``NULL`` в іншому випадку. Існує кілька функцій для встановлення виняткового стану: :c:func:`PyErr_SetString` є найпоширенішою (хоча і не найзагальнішою) функцією для встановлення виняткового стану, а :c:func:`PyErr_Clear` очищає виняток стан.

source: The full exception state consists of three objects (all of which can be ``NULL``): the exception type, the corresponding exception value, and the traceback. These have the same meanings as the Python result of ``sys.exc_info()``; however, they are not the same: the Python objects represent the last exception being handled by a Python :keyword:`try` ... :keyword:`except` statement, while the C level exception state only exists while an exception is being passed on between C functions until it reaches the Python bytecode interpreter's main loop, which takes care of transferring it to ``sys.exc_info()`` and friends.
uk: Повний винятковий стан складається з трьох об’єктів (усі з яких можуть бути ``NULL``): типу винятку, відповідного значення винятку та зворотного відстеження. Вони мають ті самі значення, що й результат Python для ``sys.exc_info()``; однак вони не однакові: об’єкти Python представляють останній виняток, який обробляється оператором Python :keyword:`try` ... :keyword:`except`, тоді як винятковий стан рівня C існує лише під час виключення передається між функціями C, доки він не досягне головного циклу інтерпретатора байт-коду Python, який піклується про його передачу до ``sys.exc_info()`` та друзів.

source: Note that starting with Python 1.5, the preferred, thread-safe way to access the exception state from Python code is to call the function :func:`sys.exc_info`, which returns the per-thread exception state for Python code. Also, the semantics of both ways to access the exception state have changed so that a function which catches an exception will save and restore its thread's exception state so as to preserve the exception state of its caller. This prevents common bugs in exception handling code caused by an innocent-looking function overwriting the exception being handled; it also reduces the often unwanted lifetime extension for objects that are referenced by the stack frames in the traceback.
uk: Зауважте, що, починаючи з Python 1.5, бажаним, потоково-безпечним способом доступу до виняткового стану з коду Python є виклик функції :func:`sys.exc_info`, яка повертає винятковий стан для кожного потоку для коду Python. Крім того, семантика обох способів доступу до виняткового стану була змінена таким чином, що функція, яка перехоплює виняток, збереже та відновить винятковий стан свого потоку, щоб зберегти винятковий стан свого викликаючого. Це запобігає поширеним помилкам у коді обробки виключень, спричинених невинною функцією, яка перезаписує виняток, що обробляється; це також зменшує часто небажане подовження тривалості життя для об’єктів, на які посилаються фрейми стека в трасуванні.

source: As a general principle, a function that calls another function to perform some task should check whether the called function raised an exception, and if so, pass the exception state on to its caller. It should discard any object references that it owns, and return an error indicator, but it should *not* set another exception --- that would overwrite the exception that was just raised, and lose important information about the exact cause of the error.
uk: Як загальний принцип, функція, яка викликає іншу функцію для виконання певного завдання, повинна перевіряти, чи викликана функція викликала виняток, і якщо так, передати стан винятку її викликаючому. Він має відкидати будь-які посилання на об’єкти, якими він володіє, і повертати індикатор помилки, але *не* встановлювати інший виняток --- який би перезаписував щойно викликаний виняток і втрачав важливу інформацію про точну причину помилки.

source: A simple example of detecting exceptions and passing them on is shown in the :c:func:`sum_sequence` example above. It so happens that this example doesn't need to clean up any owned references when it detects an error. The following example function shows some error cleanup. First, to remind you why you like Python, we show the equivalent Python code::
uk: Простий приклад виявлення винятків і їх передачі показано у прикладі :c:func:`sum_sequence` вище. Так сталося, що цьому прикладу не потрібно очищати будь-які належні посилання, коли він виявляє помилку. Наступний приклад функції показує деяке очищення помилок. По-перше, щоб нагадати вам, чому вам подобається Python, ми показуємо еквівалентний код Python:

source: Here is the corresponding C code, in all its glory::
uk: Ось відповідний код C у всій його красі:

source: This example represents an endorsed use of the ``goto`` statement in C! It illustrates the use of :c:func:`PyErr_ExceptionMatches` and :c:func:`PyErr_Clear` to handle specific exceptions, and the use of :c:func:`Py_XDECREF` to dispose of owned references that may be ``NULL`` (note the ``'X'`` in the name; :c:func:`Py_DECREF` would crash when confronted with a ``NULL`` reference). It is important that the variables used to hold owned references are initialized to ``NULL`` for this to work; likewise, the proposed return value is initialized to ``-1`` (failure) and only set to success after the final call made is successful.
uk: Цей приклад представляє схвалене використання оператора ``goto`` у C! Він ілюструє використання :c:func:`PyErr_ExceptionMatches` і :c:func:`PyErr_Clear` для обробки конкретних винятків, а також використання :c:func:`Py_XDECREF` для утилізації власних посилань, які можуть бути ``NULL`` (зверніть увагу на ``'X'`` в назві; :c:func:`Py_DECREF` аварійно завершував би роботу, якщо зіткнутися з посиланням ``NULL``). Щоб це працювало, важливо, щоб змінні, які використовуються для зберігання належних посилань, були ініціалізовані як ``NULL``; аналогічно запропоноване значення, що повертається, ініціалізується як ``-1`` (помилка) і встановлюється як успішне лише після успішного останнього виклику.

source: Embedding Python
uk: Вбудовування Python

source: The one important task that only embedders (as opposed to extension writers) of the Python interpreter have to worry about is the initialization, and possibly the finalization, of the Python interpreter. Most functionality of the interpreter can only be used after the interpreter has been initialized.
uk: Єдине важливе завдання, про яке мають турбуватися лише вбудовувачі (на відміну від авторів розширень) інтерпретатора Python, це ініціалізація та, можливо, фіналізація інтерпретатора Python. Більшість функцій інтерпретатора можна використовувати лише після ініціалізації інтерпретатора.

source: The basic initialization function is :c:func:`Py_Initialize`. This initializes the table of loaded modules, and creates the fundamental modules :mod:`builtins`, :mod:`__main__`, and :mod:`sys`. It also initializes the module search path (``sys.path``).
uk: Основною функцією ініціалізації є :c:func:`Py_Initialize`. Це ініціалізує таблицю завантажених модулів і створює фундаментальні модулі :mod:`builtins`, :mod:`__main__` і :mod:`sys`. Він також ініціалізує шлях пошуку модуля (``sys.path``).

source: On most systems (in particular, on Unix and Windows, although the details are slightly different), :c:func:`Py_Initialize` calculates the module search path based upon its best guess for the location of the standard Python interpreter executable, assuming that the Python library is found in a fixed location relative to the Python interpreter executable. In particular, it looks for a directory named :file:`lib/python{X.Y}` relative to the parent directory where the executable named :file:`python` is found on the shell command search path (the environment variable :envvar:`PATH`).
uk: У більшості систем (зокрема, в Unix і Windows, хоча деталі дещо відрізняються), :c:func:`Py_Initialize` обчислює шлях пошуку модуля на основі свого найкращого припущення щодо розташування стандартного виконуваного файлу інтерпретатора Python, припускаючи, що бібліотека Python знаходиться у фіксованому місці відносно виконуваного файлу інтерпретатора Python. Зокрема, він шукає каталог під назвою :file:`lib/python{X.Y}` відносно батьківського каталогу, де виконуваний файл під назвою :file:`python` знайдено на шляху пошуку команд оболонки (змінна середовища :envvar:`PATH`).

source: For instance, if the Python executable is found in :file:`/usr/local/bin/python`, it will assume that the libraries are in :file:`/usr/local/lib/python{X.Y}`. (In fact, this particular path is also the "fallback" location, used when no executable file named :file:`python` is found along :envvar:`PATH`.) The user can override this behavior by setting the environment variable :envvar:`PYTHONHOME`, or insert additional directories in front of the standard path by setting :envvar:`PYTHONPATH`.
uk: Наприклад, якщо виконуваний файл Python знайдено в :file:`/usr/local/bin/python`, буде вважатися, що бібліотеки знаходяться в :file:`/usr/local/lib/python{X.Y}`. (Насправді цей конкретний шлях також є "резервним" розташуванням, яке використовується, коли вздовж :envvar:`PATH` не знайдено виконуваного файлу з назвою :file:`python`.) Користувач може змінити цю поведінку, встановивши змінну середовища :envvar:`PYTHONHOME`, або вставте додаткові каталоги перед стандартним шляхом, встановивши :envvar:`PYTHONPATH`.
