Repository: python/python-docs-uk
Catalog: c-api/intro.po
Languages: uk

source: Introduction
uk: Вступ

source: The Application Programmer's Interface to Python gives C and C++ programmers access to the Python interpreter at a variety of levels. The API is equally usable from C++, but for brevity it is generally referred to as the Python/C API. There are two fundamentally different reasons for using the Python/C API. The first reason is to write *extension modules* for specific purposes; these are C modules that extend the Python interpreter. This is probably the most common use. The second reason is to use Python as a component in a larger application; this technique is generally referred to as :dfn:`embedding` Python in an application.
uk: Інтерфейс прикладного програміста для Python надає програмістам C і C++ доступ до інтерпретатора Python на різних рівнях. API так само можна використовувати з C++, але для стислості його зазвичай називають Python/C API. Є дві принципово різні причини використання Python/C API. Перша причина полягає в написанні *модулів розширення* для певних цілей; це модулі C, які розширюють інтерпретатор Python. Мабуть, це найпоширеніше використання. Друга причина полягає в тому, щоб використовувати Python як компонент у більшій програмі; цей прийом зазвичай називають :dfn:`embedding` Python у програму.

source: Writing an extension module is a relatively well-understood process, where a "cookbook" approach works well. There are several tools that automate the process to some extent. While people have embedded Python in other applications since its early existence, the process of embedding Python is less straightforward than writing an extension.
uk: Написання модуля розширення є відносно добре зрозумілим процесом, де добре працює підхід "кулінарної книги". Є кілька інструментів, які певною мірою автоматизують процес. Хоча люди вбудовували Python в інші програми з самого початку його існування, процес вбудовування Python менш простий, ніж написання розширення.

source: Many API functions are useful independent of whether you're embedding or extending Python; moreover, most applications that embed Python will need to provide a custom extension as well, so it's probably a good idea to become familiar with writing an extension before attempting to embed Python in a real application.
uk: Багато функцій API корисні незалежно від того, чи ви вбудовуєте чи розширюєте Python; крім того, більшість програм, які вбудовують Python, потребуватимуть також надати спеціальне розширення, тому, мабуть, доцільно ознайомитися з написанням розширення перед тим, як намагатися вставити Python у реальну програму.

source: Coding standards
uk: Стандарти кодування

source: If you're writing C code for inclusion in CPython, you **must** follow the guidelines and standards defined in :PEP:`7`. These guidelines apply regardless of the version of Python you are contributing to. Following these conventions is not necessary for your own third party extension modules, unless you eventually expect to contribute them to Python.
uk: Якщо ви пишете код C для включення в CPython, ви **повинні** дотримуватися вказівок і стандартів, визначених у :PEP:`7`. Ці вказівки застосовуються незалежно від версії Python, до якої ви робите внесок. Дотримання цих умов не є обов’язковим для ваших власних модулів розширення сторонніх розробників, якщо тільки ви не плануєте додати їх до Python.

source: Include Files
uk: Включати файли

source: All function, type and macro definitions needed to use the Python/C API are included in your code by the following line::
uk: Усі визначення функцій, типів і макросів, необхідні для використання API Python/C, включено у ваш код у такий рядок::

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
uk: Оскільки Python може визначати деякі визначення попереднього процесора, які впливають на стандартні заголовки в деяких системах, ви *мусите* включити :file:`Python.h` перед тим, як включити будь-які стандартні заголовки.

source: It is recommended to always define ``PY_SSIZE_T_CLEAN`` before including ``Python.h``. See :ref:`arg-parsing` for a description of this macro.
uk: Рекомендується завжди визначати ``PY_SSIZE_T_CLEAN`` перед включенням ``Python.h``. Перегляньте :ref:`arg-parsing` для опису цього макросу.

source: All user visible names defined by Python.h (except those defined by the included standard headers) have one of the prefixes ``Py`` or ``_Py``. Names beginning with ``_Py`` are for internal use by the Python implementation and should not be used by extension writers. Structure member names do not have a reserved prefix.
uk: Усі видимі для користувача імена, визначені Python.h (крім тих, що визначені включеними стандартними заголовками), мають один із префіксів ``Py`` або ``_Py``. Імена, що починаються з ``_Py`` призначені для внутрішнього використання реалізацією Python і не повинні використовуватися розробниками розширень. Імена членів структури не мають зарезервованого префікса.

source: User code should never define names that begin with ``Py`` or ``_Py``. This confuses the reader, and jeopardizes the portability of the user code to future Python versions, which may define additional names beginning with one of these prefixes.
uk: Код користувача ніколи не повинен визначати імена, які починаються з ``Py`` або ``_Py``. Це заплутує читача та ставить під загрозу перенесення коду користувача на майбутні версії Python, які можуть визначати додаткові імена, що починаються з одного з цих префіксів.

source: The header files are typically installed with Python. On Unix, these are located in the directories :file:`{prefix}/include/pythonversion/` and :file:`{exec_prefix}/include/pythonversion/`, where :envvar:`prefix` and :envvar:`exec_prefix` are defined by the corresponding parameters to Python's :program:`configure` script and *version* is ``'%d.%d' % sys.version_info[:2]``. On Windows, the headers are installed in :file:`{prefix}/include`, where :envvar:`prefix` is the installation directory specified to the installer.
uk: Файли заголовків зазвичай встановлюються за допомогою Python. В Unix вони розташовані в каталогах :file:`{prefix}/include/pythonversion/` і :file:`{exec_prefix}/include/pythonversion/`, де :envvar:`prefix` і :envvar:`exec_prefix` визначаються відповідними параметрами сценарію :program:`configure` Python, а *версією* є ``'%d.%d' % sys.version_info[:2]``. У Windows заголовки встановлюються в :file:`{prefix}/include`, де :envvar:`prefix` — це каталог встановлення, указаний інсталятором.

source: To include the headers, place both directories (if different) on your compiler's search path for includes. Do *not* place the parent directories on the search path and then use ``#include <pythonX.Y/Python.h>``; this will break on multi-platform builds since the platform independent headers under :envvar:`prefix` include the platform specific headers from :envvar:`exec_prefix`.
uk: Щоб включити заголовки, розмістіть обидва каталоги (якщо різні) на шляху пошуку вашого компілятора для включення. *Не* розміщуйте батьківські каталоги на шляху пошуку, а потім використовуйте ``#include <pythonX.Y/Python.h>``; це порушиться на мультиплатформенних збірках, оскільки незалежні від платформи заголовки в :envvar:`prefix` включають специфічні заголовки платформи з :envvar:`exec_prefix`.

source: C++ users should note that although the API is defined entirely using C, the header files properly declare the entry points to be ``extern "C"``. As a result, there is no need to do anything special to use the API from C++.
uk: Користувачі C++ повинні мати на увазі, що хоча API повністю визначено за допомогою C, файли заголовків належним чином оголошують точки входу як ``extern "C"``. Як наслідок, немає потреби робити щось особливе для використання API із C++.

source: Useful macros
uk: Корисні макроси

source: Several useful macros are defined in the Python header files. Many are defined closer to where they are useful (e.g. :c:macro:`Py_RETURN_NONE`). Others of a more general utility are defined here. This is not necessarily a complete listing.
uk: У файлах заголовків Python визначено кілька корисних макросів. Багато визначено ближче до того, де вони корисні (наприклад, :c:macro:`Py_RETURN_NONE`). Тут визначено інші більш загальні корисності. Це не обов’язково повний список.

source: Use this when you have a code path that cannot be reached by design. For example, in the ``default:`` clause in a ``switch`` statement for which all possible values are covered in ``case`` statements. Use this in places where you might be tempted to put an ``assert(0)`` or ``abort()`` call.
uk: Використовуйте це, якщо у вас є шлях коду, який неможливий за проектом. Наприклад, у реченні ``default:`` в операторі ``switch``, для якого всі можливі значення охоплюються в операторах ``case``. Використовуйте це в місцях, де у вас може виникнути спокуса викликати ``assert(0)`` або ``abort()``.

source: In release mode, the macro helps the compiler to optimize the code, and avoids a warning about unreachable code. For example, the macro is implemented with ``__builtin_unreachable()`` on GCC in release mode.
uk: У режимі випуску макрос допомагає компілятору оптимізувати код і уникає попередження про недоступність коду. Наприклад, макрос реалізовано за допомогою ``__builtin_unreachable()`` на GCC у режимі випуску.

source: A use for ``Py_UNREACHABLE()`` is following a call a function that never returns but that is not declared :c:macro:`_Py_NO_RETURN`.
uk: Використання ``Py_UNREACHABLE()`` — це виклик функції, яка ніколи не повертається, але не оголошена :c:macro:`_Py_NO_RETURN`.

source: If a code path is very unlikely code but can be reached under exceptional case, this macro must not be used. For example, under low memory condition or if a system call returns a value out of the expected range. In this case, it's better to report the error to the caller. If the error cannot be reported to caller, :c:func:`Py_FatalError` can be used.
uk: Якщо кодовий шлях є дуже малоймовірним кодом, але його можна досягти у виняткових випадках, цей макрос не можна використовувати. Наприклад, у разі недостатнього обсягу пам’яті або якщо системний виклик повертає значення за межами очікуваного діапазону. У цьому випадку краще повідомити про помилку абонента. Якщо про помилку неможливо повідомити абоненту, можна використати :c:func:`Py_FatalError`.

source: Return the absolute value of ``x``.
uk: Повертає абсолютне значення ``x``.

source: Return the minimum value between ``x`` and ``y``.
uk: Повертає мінімальне значення між ``x`` і ``y``.

source: Return the maximum value between ``x`` and ``y``.
uk: Повертає максимальне значення між ``x`` і ``y``.

source: Convert ``x`` to a C string. E.g. ``Py_STRINGIFY(123)`` returns ``"123"``.
uk: Перетворіть ``x`` на рядок C. наприклад ``Py_STRINGIFY(123)`` повертає ``"123"``.

source: Return the size of a structure (``type``) ``member`` in bytes.
uk: Повертає розмір члена структури (``type``) у байтах.

source: Argument must be a character or an integer in the range [-128, 127] or [0, 255]. This macro returns ``c`` cast to an ``unsigned char``.
uk: Аргумент має бути символом або цілим числом у діапазоні [-128, 127] або [0, 255]. Цей макрос повертає ``c``, приведений до ``unsigned char``.

source: Like ``getenv(s)``, but returns ``NULL`` if :option:`-E` was passed on the command line (i.e. if ``Py_IgnoreEnvironmentFlag`` is set).
uk: Подібно до ``getenv(s)``, але повертає ``NULL``, якщо :option:`-E` було передано в командному рядку (тобто якщо ``Py_IgnoreEnvironmentFlag`` встановлено).

source: Use this for unused arguments in a function definition to silence compiler warnings. Example: ``int func(int a, int Py_UNUSED(b)) { return a; }``.
uk: Використовуйте це для невикористаних аргументів у визначенні функції, щоб заглушити попередження компілятора. Приклад: ``int func(int a, int Py_UNUSED(b)) { return a; }``.

source: Use this for deprecated declarations. The macro must be placed before the symbol name.
uk: Використовуйте це для застарілих декларацій. Макрос необхідно розмістити перед назвою символу.

source: Example::
uk: Приклад::

source: MSVC support was added.
uk: Додано підтримку MSVC.

source: Creates a variable with name ``name`` that can be used in docstrings. If Python is built without docstrings, the value will be empty.
uk: Створює змінну з назвою ``name``, яку можна використовувати в рядках документів. Якщо Python створено без рядків документації, значення буде порожнім.

source: Use :c:macro:`PyDoc_STRVAR` for docstrings to support building Python without docstrings, as specified in :pep:`7`.
uk: Використовуйте :c:macro:`PyDoc_STRVAR` для рядків документів, щоб підтримувати створення Python без рядків документів, як зазначено в :pep:`7`.

source: Creates a docstring for the given input string or an empty string if docstrings are disabled.
uk: Створює рядок документації для заданого рядка введення або порожній рядок, якщо рядки документації вимкнено.

source: Use :c:macro:`PyDoc_STR` in specifying docstrings to support building Python without docstrings, as specified in :pep:`7`.
uk: Використовуйте :c:macro:`PyDoc_STR` у визначенні рядків документів, щоб підтримувати створення Python без рядків документів, як зазначено в :pep:`7`.

source: Objects, Types and Reference Counts
uk: Об’єкти, типи та кількість посилань

source: Most Python/C API functions have one or more arguments as well as a return value of type :c:type:`PyObject*`. This type is a pointer to an opaque data type representing an arbitrary Python object. Since all Python object types are treated the same way by the Python language in most situations (e.g., assignments, scope rules, and argument passing), it is only fitting that they should be represented by a single C type. Almost all Python objects live on the heap: you never declare an automatic or static variable of type :c:type:`PyObject`, only pointer variables of type :c:type:`PyObject*` can be declared. The sole exception are the type objects; since these must never be deallocated, they are typically static :c:type:`PyTypeObject` objects.
uk: Більшість функцій API Python/C мають один або кілька аргументів, а також повертається значення типу :c:type:`PyObject*`. Цей тип є вказівником на непрозорий тип даних, що представляє довільний об’єкт Python. Оскільки всі типи об’єктів Python обробляються мовою Python однаково в більшості ситуацій (наприклад, призначення, правила області та передача аргументів), цілком доречно, щоб вони були представлені одним типом C. Майже всі об’єкти Python живуть у купі: ви ніколи не оголошуєте автоматичну чи статичну змінну типу :c:type:`PyObject`, можна оголошувати лише змінні-вказівники типу :c:type:`PyObject*`. Єдиним винятком є об'єкти типу; оскільки їх ніколи не можна звільняти, зазвичай це статичні об’єкти :c:type:`PyTypeObject`.

source: All Python objects (even Python integers) have a :dfn:`type` and a :dfn:`reference count`. An object's type determines what kind of object it is (e.g., an integer, a list, or a user-defined function; there are many more as explained in :ref:`types`). For each of the well-known types there is a macro to check whether an object is of that type; for instance, ``PyList_Check(a)`` is true if (and only if) the object pointed to by *a* is a Python list.
uk: Усі об’єкти Python (навіть цілі числа Python) мають :dfn:`type` і :dfn:`reference counting`. Тип об’єкта визначає тип об’єкта (наприклад, ціле число, список або визначена користувачем функція; їх багато інших, як пояснюється в :ref:`types`). Для кожного з добре відомих типів існує макрос, щоб перевірити, чи належить об’єкт до цього типу; наприклад, ``PyList_Check(a)`` є істинним, якщо (і тільки якщо) об’єкт, на який вказує *a*, є списком Python.

source: Reference Counts
uk: Довідкова кількість

source: The reference count is important because today's computers have a finite (and often severely limited) memory size; it counts how many different places there are that have a reference to an object. Such a place could be another object, or a global (or static) C variable, or a local variable in some C function. When an object's reference count becomes zero, the object is deallocated. If it contains references to other objects, their reference count is decremented. Those other objects may be deallocated in turn, if this decrement makes their reference count become zero, and so on. (There's an obvious problem with objects that reference each other here; for now, the solution is "don't do that.")
uk: Кількість посилань є важливою, оскільки сучасні комп’ютери мають кінцевий (і часто дуже обмежений) розмір пам’яті; він підраховує, скільки існує різних місць, які мають посилання на об’єкт. Таким місцем може бути інший об’єкт, або глобальна (або статична) змінна C, або локальна змінна в деякій функції C. Коли кількість посилань об’єкта стає нульовою, об’єкт звільняється. Якщо він містить посилання на інші об’єкти, їх кількість посилань зменшується. Ці інші об’єкти можуть бути звільнені по черзі, якщо це зменшення призведе до того, що їх число посилань стане нульовим і так далі. (Тут є очевидна проблема з об’єктами, які посилаються один на одного; поки що рішенням є "не робіть цього".)

source: Reference counts are always manipulated explicitly. The normal way is to use the macro :c:func:`Py_INCREF` to increment an object's reference count by one, and :c:func:`Py_DECREF` to decrement it by one. The :c:func:`Py_DECREF` macro is considerably more complex than the incref one, since it must check whether the reference count becomes zero and then cause the object's deallocator to be called. The deallocator is a function pointer contained in the object's type structure. The type-specific deallocator takes care of decrementing the reference counts for other objects contained in the object if this is a compound object type, such as a list, as well as performing any additional finalization that's needed. There's no chance that the reference count can overflow; at least as many bits are used to hold the reference count as there are distinct memory locations in virtual memory (assuming ``sizeof(Py_ssize_t) >= sizeof(void*)``). Thus, the reference count increment is a simple operation.
uk: Кількість посилань завжди маніпулюється явно. Звичайним способом є використання макросу :c:func:`Py_INCREF`, щоб збільшити кількість посилань на об’єкт на одиницю, і :c:func:`Py_DECREF`, щоб зменшити його на одиницю. Макрос :c:func:`Py_DECREF` є значно складнішим, ніж макрос incref, оскільки він має перевіряти, чи кількість посилань стає нульовою, а потім викликає виклик засобу звільнення об’єкта. Deallocator — це покажчик на функцію, що міститься в структурі типу об’єкта. Спеціальний для типу делокатор піклується про зменшення лічильників посилань для інших об’єктів, що містяться в об’єкті, якщо це складений тип об’єкта, наприклад список, а також виконує будь-яку додаткову фіналізацію, яка потрібна. Немає шансів, що кількість посилань може переповнитися; для підрахунку посилань використовується принаймні стільки бітів, скільки є окремих ділянок пам’яті у віртуальній пам’яті (за умови, що ``sizeof(Py_ssize_t) >= sizeof(void*)``). Таким чином, збільшення кількості посилань є простою операцією.

source: It is not necessary to increment an object's reference count for every local variable that contains a pointer to an object. In theory, the object's reference count goes up by one when the variable is made to point to it and it goes down by one when the variable goes out of scope. However, these two cancel each other out, so at the end the reference count hasn't changed. The only real reason to use the reference count is to prevent the object from being deallocated as long as our variable is pointing to it. If we know that there is at least one other reference to the object that lives at least as long as our variable, there is no need to increment the reference count temporarily. An important situation where this arises is in objects that are passed as arguments to C functions in an extension module that are called from Python; the call mechanism guarantees to hold a reference to every argument for the duration of the call.
uk: Немає необхідності збільшувати кількість посилань на об’єкт для кожної локальної змінної, яка містить покажчик на об’єкт. Теоретично кількість посилань на об’єкт збільшується на одиницю, коли змінна вказує на нього, і зменшується на одиницю, коли змінна виходить за межі видимості. Однак ці два скасовують один одного, тому в кінці кількість посилань не змінилася. Єдина реальна причина використовувати підрахунок посилань — це запобігти звільненню об’єкта, доки наша змінна вказує на нього. Якщо ми знаємо, що існує принаймні ще одне посилання на об’єкт, яке живе принаймні стільки ж, скільки наша змінна, немає потреби тимчасово збільшувати кількість посилань. Важливою ситуацією, в якій це виникає, є об’єкти, які передаються як аргументи функціям C у модулі розширення, які викликаються з Python; механізм виклику гарантує збереження посилання на кожен аргумент протягом тривалості виклику.

source: However, a common pitfall is to extract an object from a list and hold on to it for a while without incrementing its reference count. Some other operation might conceivably remove the object from the list, decrementing its reference count and possibly deallocating it. The real danger is that innocent-looking operations may invoke arbitrary Python code which could do this; there is a code path which allows control to flow back to the user from a :c:func:`Py_DECREF`, so almost any operation is potentially dangerous.
uk: Однак поширеною підводним каменем є вилучення об’єкта зі списку та утримання його деякий час, не збільшуючи його кількість посилань. Якась інша операція може ймовірно видалити об’єкт зі списку, зменшивши кількість його посилань і, можливо, звільнивши його розміщення. Реальна небезпека полягає в тому, що невинні на вигляд операції можуть викликати довільний код Python, який міг би це зробити; існує шлях до коду, який дозволяє повертати користувачеві керування з :c:func:`Py_DECREF`, тому майже будь-яка операція є потенційно небезпечною.

source: A safe approach is to always use the generic operations (functions whose name begins with ``PyObject_``, ``PyNumber_``, ``PySequence_`` or ``PyMapping_``). These operations always increment the reference count of the object they return. This leaves the caller with the responsibility to call :c:func:`Py_DECREF` when they are done with the result; this soon becomes second nature.
uk: Безпечним підходом є завжди використовувати загальні операції (функції, назва яких починається з ``PyObject_``, ``PyNumber_``, ``PySequence_`` або ``PyMapping_``). Ці операції завжди збільшують кількість посилань на об’єкт, який вони повертають. Це залишає абонента відповідальним за виклик :c:func:`Py_DECREF`, коли вони закінчили з результатом; незабаром це стає другою натурою.

source: Reference Count Details
uk: Деталі кількості посилань
