Repository: python/python-docs-uk
Catalog: c-api/intro.po
Languages: uk

source: The embedding application can steer the search by calling ``Py_SetProgramName(file)`` *before* calling :c:func:`Py_Initialize`. Note that :envvar:`PYTHONHOME` still overrides this and :envvar:`PYTHONPATH` is still inserted in front of the standard path. An application that requires total control has to provide its own implementation of :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, and :c:func:`Py_GetProgramFullPath` (all defined in :file:`Modules/getpath.c`).
uk: Програма для вбудовування може керувати пошуком, викликаючи ``Py_SetProgramName(file)`` *перед* викликом :c:func:`Py_Initialize`. Зауважте, що :envvar:`PYTHONHOME` все ще перевизначає це, а :envvar:`PYTHONPATH` все ще вставляється перед стандартним шляхом. Програма, яка потребує повного контролю, має забезпечити власну реалізацію :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix` і :c:func:`Py_GetProgramFullPath` ( все визначено в :file:`Modules/getpath.c`).

source: Sometimes, it is desirable to "uninitialize" Python. For instance, the application may want to start over (make another call to :c:func:`Py_Initialize`) or the application is simply done with its use of Python and wants to free memory allocated by Python. This can be accomplished by calling :c:func:`Py_FinalizeEx`. The function :c:func:`Py_IsInitialized` returns true if Python is currently in the initialized state. More information about these functions is given in a later chapter. Notice that :c:func:`Py_FinalizeEx` does *not* free all memory allocated by the Python interpreter, e.g. memory allocated by extension modules currently cannot be released.
uk: Іноді бажано "деініціалізувати" Python. Наприклад, програма може захотіти почати спочатку (здійснити ще один виклик :c:func:`Py_Initialize`) або програма просто завершила роботу з Python і хоче звільнити пам’ять, виділену Python. Це можна зробити, викликавши :c:func:`Py_FinalizeEx`. Функція :c:func:`Py_IsInitialized` повертає істину, якщо Python зараз перебуває в ініціалізованому стані. Більше інформації про ці функції наведено в наступному розділі. Зауважте, що :c:func:`Py_FinalizeEx` *не* звільняє всю пам’ять, виділену інтерпретатором Python, напр. Пам'ять, виділена модулями розширення, наразі не може бути звільнена.

source: Debugging Builds
uk: Налагодження збірок

source: Python can be built with several macros to enable extra checks of the interpreter and extension modules. These checks tend to add a large amount of overhead to the runtime so they are not enabled by default.
uk: Python можна створити з кількома макросами, щоб увімкнути додаткові перевірки інтерпретатора та модулів розширення. Ці перевірки, як правило, додають велику кількість накладних витрат до середовища виконання, тому їх не ввімкнено за замовчуванням.

source: A full list of the various types of debugging builds is in the file :file:`Misc/SpecialBuilds.txt` in the Python source distribution. Builds are available that support tracing of reference counts, debugging the memory allocator, or low-level profiling of the main interpreter loop. Only the most frequently-used builds will be described in the remainder of this section.
uk: Повний список різних типів збірок для налагодження міститься у файлі :file:`Misc/SpecialBuilds.txt` у вихідному дистрибутиві Python. Доступні збірки, які підтримують відстеження лічильників посилань, налагодження розподільника пам’яті або низькорівневе профілювання основного циклу інтерпретатора. У решті цього розділу буде описано лише найбільш часто використовувані збірки.

source: Compiling the interpreter with the :c:macro:`Py_DEBUG` macro defined produces what is generally meant by :ref:`a debug build of Python <debug-build>`. :c:macro:`Py_DEBUG` is enabled in the Unix build by adding :option:`--with-pydebug` to the :file:`./configure` command. It is also implied by the presence of the not-Python-specific :c:macro:`_DEBUG` macro. When :c:macro:`Py_DEBUG` is enabled in the Unix build, compiler optimization is disabled.
uk: Компіляція інтерпретатора з визначеним макросом :c:macro:`Py_DEBUG` створює те, що зазвичай мається на увазі під :ref:`збіркою налагодження Python <debug-build>`. :c:macro:`Py_DEBUG` увімкнено в збірці Unix шляхом додавання :option:`--with-pydebug` до команди :file:`./configure`. Це також передбачається наявністю неспецифічного для Python макросу :c:macro:`_DEBUG`. Коли :c:macro:`Py_DEBUG` увімкнено в збірці Unix, оптимізація компілятора вимкнена.

source: In addition to the reference count debugging described below, extra checks are performed, see :ref:`Python Debug Build <debug-build>`.
uk: На додаток до налагодження кількості посилань, описаного нижче, виконуються додаткові перевірки, див. :ref:`Python Debug Build <debug-build>`.

source: Defining :c:macro:`Py_TRACE_REFS` enables reference tracing (see the :option:`configure --with-trace-refs option <--with-trace-refs>`). When defined, a circular doubly linked list of active objects is maintained by adding two extra fields to every :c:type:`PyObject`. Total allocations are tracked as well. Upon exit, all existing references are printed. (In interactive mode this happens after every statement run by the interpreter.)
uk: Визначення :c:macro:`Py_TRACE_REFS` увімкне трасування посилань (див. опцію :option:`configure --with-trace-refs <--with-trace-refs>`). Коли визначено, круговий подвійний зв’язаний список активних об’єктів підтримується шляхом додавання двох додаткових полів до кожного :c:type:`PyObject`. Також відстежуються загальні асигнування. Після виходу друкуються всі наявні посилання. (В інтерактивному режимі це відбувається після кожного оператора, виконаного інтерпретатором.)

source: Please refer to :file:`Misc/SpecialBuilds.txt` in the Python source distribution for more detailed information.
uk: Будь ласка, зверніться до :file:`Misc/SpecialBuilds.txt` у дистрибутиві вихідних кодів Python для отримання більш детальної інформації.
