Repository: python/python-docs-uk
Catalog: c-api/iter.po
Languages: uk

source: Iterator Protocol
uk: Протокол ітератора

source: There are two functions specifically for working with iterators.
uk: Є дві функції спеціально для роботи з ітераторами.

source: Return non-zero if the object *o* can be safely passed to :c:func:`PyIter_Next`, and ``0`` otherwise. This function always succeeds.
uk: Повертає ненульове значення, якщо об’єкт *o* можна безпечно передати в :c:func:`PyIter_Next`, і ``0`` інакше. Ця функція завжди успішна.

source: Return non-zero if the object *o* provides the :class:`AsyncIterator` protocol, and ``0`` otherwise. This function always succeeds.
uk: Повертає відмінне від нуля значення, якщо об’єкт *o* забезпечує протокол :class:`AsyncIterator`, і ``0`` інакше. Ця функція завжди успішна.

source: Return the next value from the iterator *o*. The object must be an iterator according to :c:func:`PyIter_Check` (it is up to the caller to check this). If there are no remaining values, returns ``NULL`` with no exception set. If an error occurs while retrieving the item, returns ``NULL`` and passes along the exception.
uk: Повертає наступне значення з ітератора *o*. Об’єкт має бути ітератором відповідно до :c:func:`PyIter_Check` (це залежить від того, хто викликає). Якщо не залишилося значень, повертає ``NULL`` без винятку. Якщо під час отримання елемента виникає помилка, повертається ``NULL`` і передається виняток.

source: To write a loop which iterates over an iterator, the C code should look something like this::
uk: Щоб написати цикл, який повторює ітератор, код C має виглядати приблизно так:

source: The enum value used to represent different results of :c:func:`PyIter_Send`.
uk: Значення enum, яке використовується для представлення різних результатів :c:func:`PyIter_Send`.

source: Sends the *arg* value into the iterator *iter*. Returns:
uk: Надсилає значення *arg* в ітератор *iter*. Повернення:

source: ``PYGEN_RETURN`` if iterator returns. Return value is returned via *presult*.
uk: ``PYGEN_RETURN``, якщо повертає ітератор. Повернене значення повертається через *presult*.

source: ``PYGEN_NEXT`` if iterator yields. Yielded value is returned via *presult*.
uk: ``PYGEN_NEXT``, якщо ітератор дає результат. Отримане значення повертається через *presult*.

source: ``PYGEN_ERROR`` if iterator has raised and exception. *presult* is set to ``NULL``.
uk: ``PYGEN_ERROR``, якщо ітератор підняв і виняток. *presult* має значення ``NULL``.
