Repository: python/python-docs-uk
Catalog: c-api/mapping.po
Languages: uk

source: Mapping Protocol
uk: Протокол відображення

source: See also :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` and :c:func:`PyObject_DelItem`.
uk: Дивіться також :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` і :c:func:`PyObject_DelItem`.

source: Return ``1`` if the object provides the mapping protocol or supports slicing, and ``0`` otherwise. Note that it returns ``1`` for Python classes with a :meth:`__getitem__` method, since in general it is impossible to determine what type of keys the class supports. This function always succeeds.
uk: Повертає ``1``, якщо об’єкт забезпечує протокол відображення або підтримує нарізку, і ``0`` в іншому випадку. Зверніть увагу, що він повертає ``1`` для класів Python за допомогою методу :meth:`__getitem__`, оскільки загалом неможливо визначити, який тип ключів підтримує клас. Ця функція завжди успішна.

source: Returns the number of keys in object *o* on success, and ``-1`` on failure. This is equivalent to the Python expression ``len(o)``.
uk: Повертає кількість ключів в об’єкті *o* в разі успіху та ``-1`` у разі невдачі. Це еквівалентно виразу Python ``len(o)``.

source: Return element of *o* corresponding to the string *key* or ``NULL`` on failure. This is the equivalent of the Python expression ``o[key]``. See also :c:func:`PyObject_GetItem`.
uk: Повертає елемент *o*, що відповідає рядку *key* або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o[key]``. Дивіться також :c:func:`PyObject_GetItem`.

source: Map the string *key* to the value *v* in object *o*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``o[key] = v``. See also :c:func:`PyObject_SetItem`. This function *does not* steal a reference to *v*.
uk: Зіставте рядок *key* зі значенням *v* в об’єкті *o*. Повертає ``-1`` у разі помилки. Це еквівалент оператора Python ``o[key] = v``. Дивіться також :c:func:`PyObject_SetItem`. Ця функція *не* викрадає посилання на *v*.

source: Remove the mapping for the object *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``. This is an alias of :c:func:`PyObject_DelItem`.
uk: Видаліть зіставлення для об’єкта *key* з об’єкта *o*. Повернути ``-1`` у разі помилки. Це еквівалентно оператору Python ``del o[key]``. Це псевдонім :c:func:`PyObject_DelItem`.

source: Remove the mapping for the string *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``.
uk: Видаліть зіставлення для рядка *key* з об’єкта *o*. Повернути ``-1`` у разі помилки. Це еквівалентно оператору Python ``del o[key]``.

source: Return ``1`` if the mapping object has the key *key* and ``0`` otherwise. This is equivalent to the Python expression ``key in o``. This function always succeeds.
uk: Повертає ``1``, якщо об’єкт зіставлення має ключ *key*, і ``0`` інакше. Це еквівалентно виразу Python ``key in o``. Ця функція завжди успішна.

source: Note that exceptions which occur while calling the :meth:`__getitem__` method will get suppressed. To get error reporting use :c:func:`PyObject_GetItem()` instead.
uk: Зауважте, що винятки, які виникають під час виклику методу :meth:`__getitem__`, будуть придушені. Щоб отримати повідомлення про помилки, замість цього використовуйте :c:func:`PyObject_GetItem()`.

source: Note that exceptions which occur while calling the :meth:`__getitem__` method and creating a temporary string object will get suppressed. To get error reporting use :c:func:`PyMapping_GetItemString()` instead.
uk: Зауважте, що винятки, які виникають під час виклику методу :meth:`__getitem__` і створення тимчасового рядкового об’єкта, будуть придушені. Щоб отримати звіт про помилку, замість цього використовуйте :c:func:`PyMapping_GetItemString()`.

source: On success, return a list of the keys in object *o*. On failure, return ``NULL``.
uk: У разі успіху повертає список ключів в об’єкті *o*. У разі помилки поверніть ``NULL``.

source: Previously, the function returned a list or a tuple.
uk: Раніше функція повертала список або кортеж.

source: On success, return a list of the values in object *o*. On failure, return ``NULL``.
uk: У разі успіху повертає список значень в об’єкті *o*. У разі помилки поверніть ``NULL``.

source: On success, return a list of the items in object *o*, where each item is a tuple containing a key-value pair. On failure, return ``NULL``.
uk: У разі успіху повертає список елементів в об’єкті *o*, де кожен елемент є кортежем, що містить пару ключ-значення. У разі помилки поверніть ``NULL``.
