Repository: python/python-docs-uk
Catalog: c-api/marshal.po
Languages: uk

source: Data marshalling support
uk: Підтримка маршалінгу даних

source: These routines allow C code to work with serialized objects using the same data format as the :mod:`marshal` module. There are functions to write data into the serialization format, and additional functions that can be used to read the data back. Files used to store marshalled data must be opened in binary mode.
uk: Ці процедури дозволяють коду C працювати з серіалізованими об’єктами, використовуючи той самий формат даних, що й модуль :mod:`marshal`. Існують функції для запису даних у формат серіалізації та додаткові функції, які можна використовувати для зворотного читання даних. Файли, які використовуються для зберігання маршалованих даних, необхідно відкривати в двійковому режимі.

source: Numeric values are stored with the least significant byte first.
uk: Числові значення зберігаються з молодшим байтом першим.

source: The module supports two versions of the data format: version 0 is the historical version, version 1 shares interned strings in the file, and upon unmarshalling. Version 2 uses a binary format for floating point numbers. ``Py_MARSHAL_VERSION`` indicates the current file format (currently 2).
uk: Модуль підтримує дві версії формату даних: версія 0 є історичною версією, версія 1 надає спільний доступ до вбудованих рядків у файлі та після демаршалінгу. Версія 2 використовує двійковий формат для чисел з плаваючою комою. ``Py_MARSHAL_VERSION`` вказує на поточний формат файлу (наразі 2).

source: Marshal a :c:type:`long` integer, *value*, to *file*. This will only write the least-significant 32 bits of *value*; regardless of the size of the native :c:type:`long` type. *version* indicates the file format.
uk: Маршал :c:type:`long` integer, *value*, до *file*. Це запише лише найменш значущі 32 біти *значення*; незалежно від розміру рідного типу :c:type:`long`. *версія* вказує на формат файлу.

source: Marshal a Python object, *value*, to *file*. *version* indicates the file format.
uk: Маршал об’єкта Python, *значення*, до *файлу*. *версія* вказує на формат файлу.

source: Return a bytes object containing the marshalled representation of *value*. *version* indicates the file format.
uk: Повертає об’єкт bytes, що містить упорядковане представлення *value*. *версія* вказує на формат файлу.

source: The following functions allow marshalled values to be read back in.
uk: Наступні функції дозволяють зчитувати упорядковані значення.

source: Return a C :c:type:`long` from the data stream in a :c:type:`FILE*` opened for reading. Only a 32-bit value can be read in using this function, regardless of the native size of :c:type:`long`.
uk: Повертає C :c:type:`long` із потоку даних у :c:type:`FILE*`, відкритому для читання. За допомогою цієї функції можна прочитати лише 32-бітове значення, незалежно від рідного розміру :c:type:`long`.

source: On error, sets the appropriate exception (:exc:`EOFError`) and returns ``-1``.
uk: У разі помилки встановлює відповідний виняток (:exc:`EOFError`) і повертає ``-1``.

source: Return a C :c:type:`short` from the data stream in a :c:type:`FILE*` opened for reading. Only a 16-bit value can be read in using this function, regardless of the native size of :c:type:`short`.
uk: Повертає C :c:type:`short` із потоку даних у :c:type:`FILE*`, відкритому для читання. За допомогою цієї функції можна прочитати лише 16-бітове значення, незалежно від рідного розміру :c:type:`short`.

source: Return a Python object from the data stream in a :c:type:`FILE*` opened for reading.
uk: Повертає об’єкт Python із потоку даних у :c:type:`FILE*`, відкритому для читання.

source: On error, sets the appropriate exception (:exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`) and returns ``NULL``.
uk: У разі помилки встановлює відповідний виняток (:exc:`EOFError`, :exc:`ValueError` або :exc:`TypeError`) і повертає ``NULL``.

source: Return a Python object from the data stream in a :c:type:`FILE*` opened for reading. Unlike :c:func:`PyMarshal_ReadObjectFromFile`, this function assumes that no further objects will be read from the file, allowing it to aggressively load file data into memory so that the de-serialization can operate from data in memory rather than reading a byte at a time from the file. Only use these variant if you are certain that you won't be reading anything else from the file.
uk: Повертає об’єкт Python із потоку даних у :c:type:`FILE*`, відкритому для читання. На відміну від :c:func:`PyMarshal_ReadObjectFromFile`, ця функція припускає, що жодні подальші об’єкти не читатимуться з файлу, дозволяючи їй агресивно завантажувати дані файлу в пам’ять, щоб десеріалізація могла працювати з даними в пам’яті, а не читати байт за раз із файлу. Використовуйте ці варіанти, лише якщо ви впевнені, що більше нічого не читатимете з файлу.

source: Return a Python object from the data stream in a byte buffer containing *len* bytes pointed to by *data*.
uk: Повертає об’єкт Python із потоку даних у байтовий буфер, що містить *len* байти, на які вказує *data*.
