Repository: python/python-docs-uk
Catalog: c-api/memory.po
Languages: uk

source: Memory Management
uk: Управління пам'яттю

source: Overview
uk: Огляд

source: Memory management in Python involves a private heap containing all Python objects and data structures. The management of this private heap is ensured internally by the *Python memory manager*. The Python memory manager has different components which deal with various dynamic storage management aspects, like sharing, segmentation, preallocation or caching.
uk: Керування пам’яттю в Python включає приватну купу, що містить усі об’єкти та структури даних Python. Управління цією приватною купою забезпечується внутрішньо за допомогою *Менеджера пам’яті Python*. Менеджер пам’яті Python має різні компоненти, які стосуються різноманітних аспектів керування динамічним сховищем, наприклад спільного використання, сегментації, попереднього розподілу чи кешування.

source: At the lowest level, a raw memory allocator ensures that there is enough room in the private heap for storing all Python-related data by interacting with the memory manager of the operating system. On top of the raw memory allocator, several object-specific allocators operate on the same heap and implement distinct memory management policies adapted to the peculiarities of every object type. For example, integer objects are managed differently within the heap than strings, tuples or dictionaries because integers imply different storage requirements and speed/space tradeoffs. The Python memory manager thus delegates some of the work to the object-specific allocators, but ensures that the latter operate within the bounds of the private heap.
uk: На найнижчому рівні розподільник необробленої пам’яті забезпечує наявність достатнього місця в приватній купі для зберігання всіх пов’язаних із Python даних шляхом взаємодії з диспетчером пам’яті операційної системи. Окрім необробленого розподільника пам’яті, кілька об’єктно-специфічних розподільників працюють на одній купі та реалізують різні політики керування пам’яттю, адаптовані до особливостей кожного типу об’єкта. Наприклад, цілими об’єктами в купі керують інакше, ніж рядками, кортежами чи словниками, оскільки цілі числа передбачають різні вимоги до сховища та компроміси між швидкістю та простором. Таким чином, менеджер пам’яті Python делегує частину роботи об’єктно-специфічним розподільникам, але гарантує, що останні працюють у межах приватної купи.

source: It is important to understand that the management of the Python heap is performed by the interpreter itself and that the user has no control over it, even if they regularly manipulate object pointers to memory blocks inside that heap. The allocation of heap space for Python objects and other internal buffers is performed on demand by the Python memory manager through the Python/C API functions listed in this document.
uk: Важливо розуміти, що керування купою Python виконується самим інтерпретатором і що користувач не має контролю над нею, навіть якщо вони регулярно маніпулюють покажчиками об’єктів на блоки пам’яті всередині цієї купи. Виділення простору купи для об’єктів Python та інших внутрішніх буферів виконується на вимогу менеджером пам’яті Python за допомогою функцій API Python/C, перелічених у цьому документі.

source: To avoid memory corruption, extension writers should never try to operate on Python objects with the functions exported by the C library: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`. This will result in mixed calls between the C allocator and the Python memory manager with fatal consequences, because they implement different algorithms and operate on different heaps. However, one may safely allocate and release memory blocks with the C library allocator for individual purposes, as shown in the following example::
uk: Щоб уникнути пошкодження пам’яті, автори розширень ніколи не повинні намагатися працювати з об’єктами Python за допомогою функцій, експортованих бібліотекою C: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` і :c:func:`free`. Це призведе до змішаних викликів між розподільником C і диспетчером пам’яті Python із фатальними наслідками, оскільки вони реалізують різні алгоритми та працюють із різними купами. Однак можна безпечно виділяти та звільняти блоки пам’яті за допомогою розподільника бібліотеки C для окремих цілей, як показано в наступному прикладі:

source: In this example, the memory request for the I/O buffer is handled by the C library allocator. The Python memory manager is involved only in the allocation of the bytes object returned as a result.
uk: У цьому прикладі запит пам’яті для буфера введення/виведення обробляється розподільником бібліотеки C. Менеджер пам’яті Python бере участь лише у розподілі об’єкта bytes, який повертається в результаті.

source: In most situations, however, it is recommended to allocate memory from the Python heap specifically because the latter is under control of the Python memory manager. For example, this is required when the interpreter is extended with new object types written in C. Another reason for using the Python heap is the desire to *inform* the Python memory manager about the memory needs of the extension module. Even when the requested memory is used exclusively for internal, highly-specific purposes, delegating all memory requests to the Python memory manager causes the interpreter to have a more accurate image of its memory footprint as a whole. Consequently, under certain circumstances, the Python memory manager may or may not trigger appropriate actions, like garbage collection, memory compaction or other preventive procedures. Note that by using the C library allocator as shown in the previous example, the allocated memory for the I/O buffer escapes completely the Python memory manager.
uk: Однак у більшості ситуацій рекомендується виділяти пам’ять із купи Python спеціально, оскільки остання знаходиться під контролем менеджера пам’яті Python. Наприклад, це потрібно, коли інтерпретатор розширюється новими типами об’єктів, написаними на C. Іншою причиною використання купи Python є бажання *інформувати* менеджера пам’яті Python про потреби модуля розширення в пам’яті. Навіть коли запитана пам’ять використовується виключно для внутрішніх, дуже специфічних цілей, делегування всіх запитів пам’яті диспетчеру пам’яті Python змушує інтерпретатора мати більш точне зображення його сліду пам’яті в цілому. Отже, за певних обставин диспетчер пам’яті Python може запускати або не запускати відповідні дії, як-от збирання сміття, стиснення пам’яті чи інші профілактичні процедури. Зауважте, що за допомогою розподілювача бібліотеки C, як показано в попередньому прикладі, виділена пам’ять для буфера вводу/виводу повністю виходить з диспетчера пам’яті Python.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to configure the memory allocators used by Python.
uk: Змінну середовища :envvar:`PYTHONMALLOC` можна використовувати для налаштування розподільників пам’яті, які використовує Python.

source: The :envvar:`PYTHONMALLOCSTATS` environment variable can be used to print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
uk: Змінну середовища :envvar:`PYTHONMALLOCSTATS` можна використовувати для виведення статистики :ref:`розподільника пам’яті pymalloc <pymalloc>` кожного разу, коли створюється нова арена об’єкта pymalloc, і після завершення роботи.

source: Allocator Domains
uk: Розподільник доменів

source: All allocating functions belong to one of three different "domains" (see also :c:type:`PyMemAllocatorDomain`). These domains represent different allocation strategies and are optimized for different purposes. The specific details on how every domain allocates memory or what internal functions each domain calls is considered an implementation detail, but for debugging purposes a simplified table can be found at :ref:`here <default-memory-allocators>`. There is no hard requirement to use the memory returned by the allocation functions belonging to a given domain for only the purposes hinted by that domain (although this is the recommended practice). For example, one could use the memory returned by :c:func:`PyMem_RawMalloc` for allocating Python objects or the memory returned by :c:func:`PyObject_Malloc` for allocating memory for buffers.
uk: Усі функції розподілу належать до одного з трьох різних "доменів" (див. також :c:type:`PyMemAllocatorDomain`). Ці домени представляють різні стратегії розподілу та оптимізовані для різних цілей. Конкретні відомості про те, як кожен домен розподіляє пам’ять або які внутрішні функції викликає кожен домен, вважаються деталями реалізації, але для цілей налагодження спрощену таблицю можна знайти за адресою :ref:`тут <default-memory-allocators>`. Немає жорстких вимог щодо використання пам’яті, повернутої функціями розподілу, що належить даному домену, лише для цілей, визначених цим доменом (хоча це рекомендована практика). Наприклад, можна використати пам’ять, яку повертає :c:func:`PyMem_RawMalloc` для виділення об’єктів Python, або пам’ять, яку повертає :c:func:`PyObject_Malloc`, для виділення пам’яті для буферів.

source: The three allocation domains are:
uk: Три домени розподілу:

source: Raw domain: intended for allocating memory for general-purpose memory buffers where the allocation *must* go to the system allocator or where the allocator can operate without the :term:`GIL`. The memory is requested directly to the system.
uk: Необроблений домен: призначений для розподілу пам’яті для буферів пам’яті загального призначення, де розподіл *має* надходити до системного розподілювача або де розподільник може працювати без :term:`GIL`. Пам'ять запитується безпосередньо системою.

source: "Mem" domain: intended for allocating memory for Python buffers and general-purpose memory buffers where the allocation must be performed with the :term:`GIL` held. The memory is taken from the Python private heap.
uk: Домен "Mem": призначений для виділення пам’яті для буферів Python і буферів пам’яті загального призначення, де розподіл має виконуватися з утриманням :term:`GIL`. Пам'ять береться з приватної купи Python.

source: Object domain: intended for allocating memory belonging to Python objects. The memory is taken from the Python private heap.
uk: Домен об’єктів: призначений для розподілу пам’яті, що належить об’єктам Python. Пам'ять береться з приватної купи Python.

source: When freeing memory previously allocated by the allocating functions belonging to a given domain,the matching specific deallocating functions must be used. For example, :c:func:`PyMem_Free` must be used to free memory allocated using :c:func:`PyMem_Malloc`.
uk: Під час звільнення пам’яті, попередньо виділеної функціями розподілу, що належать до даного домену, необхідно використовувати відповідні спеціальні функції звільнення. Наприклад, :c:func:`PyMem_Free` потрібно використовувати для звільнення пам’яті, виділеної за допомогою :c:func:`PyMem_Malloc`.

source: Raw Memory Interface
uk: Інтерфейс необробленої пам'яті

source: The following function sets are wrappers to the system allocator. These functions are thread-safe, the :term:`GIL <global interpreter lock>` does not need to be held.
uk: Наступні набори функцій є оболонками для системного розподілювача. Ці функції є потокобезпечними, :term:`GIL <global interpreter lock>` не потрібно зберігати.

source: The :ref:`default raw memory allocator <default-memory-allocators>` uses the following functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`; call ``malloc(1)`` (or ``calloc(1, 1)``) when requesting zero bytes.
uk: :ref:`за замовчуванням необроблений розподільник пам’яті <default-memory-allocators>` використовує такі функції: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` і :c:func:`free`; викликати ``malloc(1)`` (або ``calloc(1, 1)``), коли запитує нульові байти.

source: Allocates *n* bytes and returns a pointer of type :c:type:`void*` to the allocated memory, or ``NULL`` if the request fails.
uk: Виділяє *n* байт і повертає вказівник типу :c:type:`void*` на виділену пам’ять або ``NULL``, якщо запит не вдається.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawMalloc(1)`` had been called instead. The memory will not have been initialized in any way.
uk: Запит нульових байтів повертає окремий вказівник, відмінний від ``NULL``, якщо це можливо, ніби замість цього було викликано ``PyMem_RawMalloc(1)``. Пам'ять жодним чином не буде ініціалізовано.

source: Allocates *nelem* elements each whose size in bytes is *elsize* and returns a pointer of type :c:type:`void*` to the allocated memory, or ``NULL`` if the request fails. The memory is initialized to zeros.
uk: Виділяє елементи *nelem*, розмір кожного з яких у байтах дорівнює *elsize*, і повертає вказівник типу :c:type:`void*` на виділену пам’ять або ``NULL``, якщо запит не вдається. Пам'ять ініціалізується нулями.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawCalloc(1, 1)`` had been called instead.
uk: Запит нульових елементів або елементів розміром нуль байтів повертає окремий вказівник, відмінний від ``NULL``, якщо це можливо, ніби замість цього було викликано ``PyMem_RawCalloc(1, 1)``.

source: Resizes the memory block pointed to by *p* to *n* bytes. The contents will be unchanged to the minimum of the old and the new sizes.
uk: Змінює розмір блоку пам'яті, на який вказує *p*, до *n* байтів. Вміст буде незмінним до мінімуму старого та нового розмірів.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_RawMalloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
uk: Якщо *p* має значення ``NULL``, виклик еквівалентний ``PyMem_RawMalloc(n)``; інакше, якщо *n* дорівнює нулю, розмір блоку пам’яті змінюється, але не звільняється, а повернутий вказівник не є ``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`.
uk: Якщо *p* не має значення ``NULL``, воно має бути повернуто попереднім викликом :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` або :c:func:`PyMem_RawCalloc`.

source: If the request fails, :c:func:`PyMem_RawRealloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
uk: Якщо запит завершується невдало, :c:func:`PyMem_RawRealloc` повертає ``NULL``, а *p* залишається дійсним покажчиком на попередню область пам’яті.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`. Otherwise, or if ``PyMem_RawFree(p)`` has been called before, undefined behavior occurs.
uk: Звільняє блок пам’яті, на який вказує *p*, який мав бути повернутий попереднім викликом :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` або :c:func:`PyMem_RawCalloc`. В іншому випадку, або якщо ``PyMem_RawFree(p)`` був викликаний раніше, виникає невизначена поведінка.

source: If *p* is ``NULL``, no operation is performed.
uk: Якщо *p* має значення ``NULL``, жодна операція не виконується.

source: Memory Interface
uk: Інтерфейс пам'яті

source: The following function sets, modeled after the ANSI C standard, but specifying behavior when requesting zero bytes, are available for allocating and releasing memory from the Python heap.
uk: Наступні набори функцій, створені за стандартом ANSI C, але вказуючи поведінку під час запиту нульових байтів, доступні для виділення та звільнення пам’яті з купи Python.

source: The :ref:`default memory allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
uk: :ref:`розподільник пам’яті за замовчуванням <default-memory-allocators>` використовує :ref:`розподільник пам’яті pymalloc <pymalloc>`.

source: The :term:`GIL <global interpreter lock>` must be held when using these functions.
uk: :term:`GIL <global interpreter lock>` має зберігатися під час використання цих функцій.

source: The default allocator is now pymalloc instead of system :c:func:`malloc`.
uk: Типовим розподільником тепер є pymalloc замість system :c:func:`malloc`.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
uk: Запит нульових байтів повертає окремий вказівник, відмінний від ``NULL``, якщо це можливо, ніби замість цього було викликано ``PyMem_Malloc(1)``. Пам'ять жодним чином не буде ініціалізовано.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Calloc(1, 1)`` had been called instead.
uk: Запит нульових елементів або елементів розміром нуль байтів повертає окремий вказівник, відмінний від ``NULL``, якщо це можливо, як якщо б замість цього було викликано ``PyMem_Calloc(1, 1)``.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
uk: Якщо *p* має значення ``NULL``, виклик еквівалентний ``PyMem_Malloc(n)``; інакше, якщо *n* дорівнює нулю, розмір блоку пам’яті змінюється, але не звільняється, а повернутий вказівник не є ``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`.
uk: Якщо *p* не має значення ``NULL``, воно має бути повернуто попереднім викликом :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` або :c:func:`PyMem_Calloc`.

source: If the request fails, :c:func:`PyMem_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
uk: Якщо запит не вдається, :c:func:`PyMem_Realloc` повертає ``NULL``, а *p* залишається дійсним покажчиком на попередню область пам’яті.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`. Otherwise, or if ``PyMem_Free(p)`` has been called before, undefined behavior occurs.
uk: Звільняє блок пам’яті, на який вказує *p*, який мав бути повернутий попереднім викликом :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` або :c:func:`PyMem_Calloc`. В іншому випадку, або якщо ``PyMem_Free(p)`` був викликаний раніше, виникає невизначена поведінка.

source: The following type-oriented macros are provided for convenience. Note that *TYPE* refers to any C type.
uk: Для зручності надано наступні типоорієнтовані макроси. Зауважте, що *TYPE* відноситься до будь-якого типу C.

source: Same as :c:func:`PyMem_Malloc`, but allocates ``(n * sizeof(TYPE))`` bytes of memory. Returns a pointer cast to :c:type:`TYPE*`. The memory will not have been initialized in any way.
uk: Те саме, що :c:func:`PyMem_Malloc`, але виділяє ``(n * sizeof(TYPE))`` байти пам'яті. Повертає покажчик, приведений до :c:type:`TYPE*`. Пам'ять жодним чином не буде ініціалізовано.

source: Same as :c:func:`PyMem_Realloc`, but the memory block is resized to ``(n * sizeof(TYPE))`` bytes. Returns a pointer cast to :c:type:`TYPE*`. On return, *p* will be a pointer to the new memory area, or ``NULL`` in the event of failure.
uk: Те саме, що :c:func:`PyMem_Realloc`, але розмір блоку пам’яті змінено до ``(n * sizeof(TYPE))`` байтів. Повертає покажчик, приведений до :c:type:`TYPE*`. Після повернення *p* буде вказівником на нову область пам’яті або ``NULL`` у разі помилки.

source: This is a C preprocessor macro; *p* is always reassigned. Save the original value of *p* to avoid losing memory when handling errors.
uk: Це макрос препроцесора C; *p* завжди перепризначається. Збережіть початкове значення *p*, щоб уникнути втрати пам’яті під час обробки помилок.

source: Same as :c:func:`PyMem_Free`.
uk: Те саме, що :c:func:`PyMem_Free`.

source: In addition, the following macro sets are provided for calling the Python memory allocator directly, without involving the C API functions listed above. However, note that their use does not preserve binary compatibility across Python versions and is therefore deprecated in extension modules.
uk: Крім того, наведені нижче набори макросів надаються для безпосереднього виклику розподільника пам’яті Python без залучення функцій C API, перелічених вище. Однак зауважте, що їх використання не зберігає двійкову сумісність між версіями Python і тому не підтримується в модулях розширення.

source: ``PyMem_MALLOC(size)``
uk: ``PyMem_MALLOC(розмір)``

source: ``PyMem_NEW(type, size)``
uk: ``PyMem_NEW(тип, розмір)``

source: ``PyMem_RESIZE(ptr, type, size)``
uk: ``PyMem_RESIZE(ptr, тип, розмір)``

source: Object allocators
uk: Розподільники об'єктів

source: There is no guarantee that the memory returned by these allocators can be successfully cast to a Python object when intercepting the allocating functions in this domain by the methods described in the :ref:`Customize Memory Allocators <customize-memory-allocators>` section.
uk: Немає жодної гарантії, що пам’ять, повернута цими розподільниками, може бути успішно передана об’єкту Python під час перехоплення функцій виділення в цьому домені за допомогою методів, описаних у розділі :ref:`Налаштування розподільників пам’яті <customize-memory-allocators>`.

source: The :ref:`default object allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
uk: :ref:`розподільник об’єктів за замовчуванням <default-memory-allocators>` використовує :ref:`розподільник пам’яті pymalloc <pymalloc>`.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
uk: Запит нульових байтів повертає окремий покажчик, відмінний від ``NULL``, якщо це можливо, ніби замість цього було викликано ``PyObject_Malloc(1)``. Пам'ять жодним чином не буде ініціалізовано.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Calloc(1, 1)`` had been called instead.
uk: Запит нульових елементів або елементів розміром нуль байтів повертає окремий вказівник, відмінний від ``NULL``, якщо це можливо, як якщо б замість цього було викликано ``PyObject_Calloc(1, 1)``.

source: If *p* is ``NULL``, the call is equivalent to ``PyObject_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
uk: Якщо *p* має значення ``NULL``, виклик еквівалентний ``PyObject_Malloc(n)``; інакше, якщо *n* дорівнює нулю, розмір блоку пам’яті змінюється, але не звільняється, а повернутий вказівник не є ``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`.
uk: Якщо *p* не має значення ``NULL``, воно має бути повернуто попереднім викликом :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` або :c:func:`PyObject_Calloc`.

source: If the request fails, :c:func:`PyObject_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
uk: Якщо запит не вдається, :c:func:`PyObject_Realloc` повертає ``NULL``, а *p* залишається дійсним покажчиком на попередню область пам’яті.
