Repository: python/python-docs-uk
Catalog: c-api/memory.po
Languages: uk

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`. Otherwise, or if ``PyObject_Free(p)`` has been called before, undefined behavior occurs.
uk: Звільняє блок пам’яті, на який вказує *p*, який мав бути повернутий попереднім викликом :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` або :c:func:`PyObject_Calloc`. В іншому випадку, або якщо ``PyObject_Free(p)`` був викликаний раніше, виникає невизначена поведінка.

source: Default Memory Allocators
uk: Типові розподілювачі пам'яті

source: Default memory allocators:
uk: Розподільники пам'яті за замовчуванням:

source: Configuration
uk: Конфігурація

source: Name
uk: Ім'я

source: Release build
uk: Реліз збірки

source: Debug build
uk: Налагодити збірку

source: ``malloc`` + debug
uk: ``malloc`` + налагодження

source: ``pymalloc`` + debug
uk: ``pymalloc`` + налагодження

source: Release build, without pymalloc
uk: Випуск збірки без pymalloc

source: Debug build, without pymalloc
uk: Збірка налагодження без pymalloc

source: Legend:
uk: Легенда:

source: Name: value for :envvar:`PYTHONMALLOC` environment variable.
uk: Ім’я: значення для змінної середовища :envvar:`PYTHONMALLOC`.

source: ``malloc``: system allocators from the standard C library, C functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`.
uk: ``malloc``: системні розподільники зі стандартної бібліотеки C, функції C: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` і :c:func:`free`.

source: ``pymalloc``: :ref:`pymalloc memory allocator <pymalloc>`.
uk: ``pymalloc``: :ref:`розподіл пам'яті pymalloc <pymalloc>`.

source: "+ debug": with :ref:`debug hooks on the Python memory allocators <pymem-debug-hooks>`.
uk: "+ debug": з :ref:`debug хуками розподільників пам’яті Python <pymem-debug-hooks>`.

source: "Debug build": :ref:`Python build in debug mode <debug-build>`.
uk: "Налагоджувальна збірка": :ref:`Збірка Python у режимі налагодження <debug-build>`.

source: Customize Memory Allocators
uk: Налаштувати розподільники пам'яті

source: Structure used to describe a memory block allocator. The structure has the following fields:
uk: Структура, яка використовується для опису розподілювача блоків пам'яті. Структура має такі поля:

source: Field
uk: Поле

source: Meaning
uk: Значення

source: ``void *ctx``
uk: ``недійсний *ctx``

source: user context passed as first argument
uk: контекст користувача, переданий як перший аргумент

source: allocate a memory block
uk: виділити блок пам'яті

source: allocate a memory block initialized with zeros
uk: виділити блок пам'яті, ініціалізований нулями

source: allocate or resize a memory block
uk: виділити або змінити розмір блоку пам'яті

source: free a memory block
uk: звільнити блок пам'яті

source: The :c:type:`PyMemAllocator` structure was renamed to :c:type:`PyMemAllocatorEx` and a new ``calloc`` field was added.
uk: Структуру :c:type:`PyMemAllocator` було перейменовано на :c:type:`PyMemAllocatorEx` і додано нове поле ``calloc``.

source: Enum used to identify an allocator domain. Domains:
uk: Enum використовується для визначення домену розподілювача. Домени:

source: Functions:
uk: функції:

source: Get the memory block allocator of the specified domain.
uk: Отримати розподільник блоків пам’яті вказаного домену.

source: Set the memory block allocator of the specified domain.
uk: Установіть розподільник блоків пам'яті для вказаного домену.

source: The new allocator must return a distinct non-``NULL`` pointer when requesting zero bytes.
uk: Новий розподільник має повертати окремий покажчик, відмінний від ``NULL``, коли запитує нульові байти.

source: For the :c:data:`PYMEM_DOMAIN_RAW` domain, the allocator must be thread-safe: the :term:`GIL <global interpreter lock>` is not held when the allocator is called.
uk: Для домену :c:data:`PYMEM_DOMAIN_RAW` розподільник має бути потокобезпечним: :term:`GIL <global interpreter lock>` не утримується під час виклику розподілювача.

source: If the new allocator is not a hook (does not call the previous allocator), the :c:func:`PyMem_SetupDebugHooks` function must be called to reinstall the debug hooks on top on the new allocator.
uk: Якщо новий розподільник не є хуком (не викликає попереднього розподільника), необхідно викликати функцію :c:func:`PyMem_SetupDebugHooks`, щоб перевстановити налагоджувальні хуки поверх нового розподільника.

source: Setup :ref:`debug hooks in the Python memory allocators <pymem-debug-hooks>` to detect memory errors.
uk: Налаштування :ref:`налагоджувальних хуків у розподільниках пам’яті Python <pymem-debug-hooks>` для виявлення помилок пам’яті.

source: Debug hooks on the Python memory allocators
uk: Налагодження перехоплювачів розподілювачів пам’яті Python

source: When :ref:`Python is built in debug mode <debug-build>`, the :c:func:`PyMem_SetupDebugHooks` function is called at the :ref:`Python preinitialization <c-preinit>` to setup debug hooks on Python memory allocators to detect memory errors.
uk: Коли :ref:`Python зібрано в режимі налагодження <debug-build>`, функція :c:func:`PyMem_SetupDebugHooks` викликається під час :ref:`попередньої ініціалізації Python <c-preinit>`, щоб налаштувати перехоплення налагодження на розподільниках пам’яті Python для виявлення помилок пам’яті.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to install debug hooks on a Python compiled in release mode (ex: ``PYTHONMALLOC=debug``).
uk: Змінну оточення :envvar:`PYTHONMALLOC` можна використовувати для встановлення хуків налагодження на Python, скомпільованому в режимі випуску (наприклад: ``PYTHONMALLOC=debug``).

source: The :c:func:`PyMem_SetupDebugHooks` function can be used to set debug hooks after calling :c:func:`PyMem_SetAllocator`.
uk: Функцію :c:func:`PyMem_SetupDebugHooks` можна використати для встановлення хуків налагодження після виклику :c:func:`PyMem_SetAllocator`.

source: These debug hooks fill dynamically allocated memory blocks with special, recognizable bit patterns. Newly allocated memory is filled with the byte ``0xCD`` (``PYMEM_CLEANBYTE``), freed memory is filled with the byte ``0xDD`` (``PYMEM_DEADBYTE``). Memory blocks are surrounded by "forbidden bytes" filled with the byte ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Strings of these bytes are unlikely to be valid addresses, floats, or ASCII strings.
uk: Ці хуки налагодження заповнюють динамічно виділені блоки пам’яті спеціальними розпізнаваними бітовими шаблонами. Щойно виділена пам'ять заповнюється байтом ``0xCD`` (``PYMEM_CLEANBYTE``), звільнена пам'ять заповнюється байтом ``0xDD`` (``PYMEM_DEADBYTE``). Блоки пам'яті оточені "забороненими байтами", заповненими байтом ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Рядки цих байтів навряд чи будуть дійсними адресами, числами з плаваючою точкою або рядками ASCII.

source: Runtime checks:
uk: Перевірки виконання:

source: Detect API violations. For example, detect if :c:func:`PyObject_Free` is called on a memory block allocated by :c:func:`PyMem_Malloc`.
uk: Виявлення порушень API. Наприклад, виявити, чи викликається :c:func:`PyObject_Free` для блоку пам’яті, виділеного :c:func:`PyMem_Malloc`.

source: Detect write before the start of the buffer (buffer underflow).
uk: Виявлення запису до початку буфера (переповнення буфера).

source: Detect write after the end of the buffer (buffer overflow).
uk: Виявлення запису після закінчення буфера (переповнення буфера).

source: Check that the :term:`GIL <global interpreter lock>` is held when allocator functions of :c:data:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) and :c:data:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) domains are called.
uk: Переконайтеся, що :term:`GIL <global interpreter lock>` зберігається, коли функції розподільника :c:data:`PYMEM_DOMAIN_OBJ` (наприклад: :c:func:`PyObject_Malloc`) і :c:data:`PYMEM_DOMAIN_MEM` (наприклад: :c:func:`PyMem_Malloc`) викликаються домени.

source: On error, the debug hooks use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated. The traceback is only displayed if :mod:`tracemalloc` is tracing Python memory allocations and the memory block was traced.
uk: У разі помилки хуки налагодження використовують модуль :mod:`tracemalloc`, щоб отримати зворотне відстеження, де було виділено блок пам’яті. Зворотне відстеження відображається, лише якщо :mod:`tracemalloc` відстежує виділення пам’яті Python і блок пам’яті відстежується.

source: Let *S* = ``sizeof(size_t)``. ``2*S`` bytes are added at each end of each block of *N* bytes requested. The memory layout is like so, where p represents the address returned by a malloc-like or realloc-like function (``p[i:j]`` means the slice of bytes from ``*(p+i)`` inclusive up to ``*(p+j)`` exclusive; note that the treatment of negative indices differs from a Python slice):
uk: Нехай *S* = ``sizeof(size_t)``. ``2*S`` байти додаються на кожному кінці кожного запитуваного блоку *N* байтів. Схема пам’яті така, де p представляє адресу, повернуту функцією, подібною до malloc або realloc (``p[i:j]`` означає зріз байтів з ``*(p+i)`` включно до ``*(p+j)`` винятково; зауважте, що обробка від’ємних індексів відрізняється від фрагмента Python):

source: Number of bytes originally asked for. This is a size_t, big-endian (easier to read in a memory dump).
uk: Первісно запитана кількість байтів. Це size_t, big-endian (легше читати в дампі пам’яті).

source: API identifier (ASCII character):
uk: Ідентифікатор API (символ ASCII):

source: ``'r'`` for :c:data:`PYMEM_DOMAIN_RAW`.
uk: ``'r'`` для :c:data:`PYMEM_DOMAIN_RAW`.

source: ``'m'`` for :c:data:`PYMEM_DOMAIN_MEM`.
uk: ``'m''`` для :c:data:`PYMEM_DOMAIN_MEM`.

source: ``'o'`` for :c:data:`PYMEM_DOMAIN_OBJ`.
uk: ``'o'`` для :c:data:`PYMEM_DOMAIN_OBJ`.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch under- writes and reads.
uk: Копії PYMEM_FORBIDDENBYTE. Використовується для перехоплення недописів і читань.

source: The requested memory, filled with copies of PYMEM_CLEANBYTE, used to catch reference to uninitialized memory. When a realloc-like function is called requesting a larger memory block, the new excess bytes are also filled with PYMEM_CLEANBYTE. When a free-like function is called, these are overwritten with PYMEM_DEADBYTE, to catch reference to freed memory. When a realloc- like function is called requesting a smaller memory block, the excess old bytes are also filled with PYMEM_DEADBYTE.
uk: Запитана пам'ять, заповнена копіями PYMEM_CLEANBYTE, використовувалася для перехоплення посилань на неініціалізовану пам'ять. Коли функція, подібна до realloc, викликається із запитом більшого блоку пам’яті, нові надлишкові байти також заповнюються PYMEM_CLEANBYTE. Коли викликається функція, подібна до вільної, вони перезаписуються на PYMEM_DEADBYTE, щоб перехопити посилання на звільнену пам’ять. Коли функція, подібна до realloc, викликається із запитом на менший блок пам’яті, зайві старі байти також заповнюються PYMEM_DEADBYTE.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch over- writes and reads.
uk: Копії PYMEM_FORBIDDENBYTE. Використовується для перехоплення перезапису та читання.

source: Only used if the ``PYMEM_DEBUG_SERIALNO`` macro is defined (not defined by default).
uk: Використовується, лише якщо визначено макрос ``PYMEM_DEBUG_SERIALNO`` (не визначено за замовчуванням).

source: A serial number, incremented by 1 on each call to a malloc-like or realloc-like function. Big-endian ``size_t``. If "bad memory" is detected later, the serial number gives an excellent way to set a breakpoint on the next run, to capture the instant at which this block was passed out. The static function bumpserialno() in obmalloc.c is the only place the serial number is incremented, and exists so you can set such a breakpoint easily.
uk: Серійний номер, збільшений на 1 під час кожного виклику функції, подібної до malloc або realloc. Стартовий порядок ``size_t``. Якщо "погана пам’ять" буде виявлена пізніше, серійний номер дає чудовий спосіб встановити точку зупинки під час наступного запуску, щоб зафіксувати момент, коли цей блок було видалено. Статична функція bumpserialno() у obmalloc.c є єдиним місцем, де збільшується серійний номер, і існує, тому ви можете легко встановити таку точку зупину.

source: A realloc-like or free-like function first checks that the PYMEM_FORBIDDENBYTE bytes at each end are intact. If they've been altered, diagnostic output is written to stderr, and the program is aborted via Py_FatalError(). The other main failure mode is provoking a memory error when a program reads up one of the special bit patterns and tries to use it as an address. If you get in a debugger then and look at the object, you're likely to see that it's entirely filled with PYMEM_DEADBYTE (meaning freed memory is getting used) or PYMEM_CLEANBYTE (meaning uninitialized memory is getting used).
uk: Функція, подібна до realloc або free, спочатку перевіряє, чи не пошкоджені байти PYMEM_FORBIDDENBYTE на кожному кінці. Якщо їх було змінено, діагностичний вихід записується в stderr, а програма переривається через Py_FatalError(). Інший основний тип помилки - це провокація помилки пам'яті, коли програма зчитує один із спеціальних бітових шаблонів і намагається використати його як адресу. Якщо ви зайдете в налагоджувач і подивіться на об’єкт, ви, ймовірно, побачите, що він повністю заповнений PYMEM_DEADBYTE (це означає, що звільнена пам’ять використовується) або PYMEM_CLEANBYTE (це означає, що неініціалізована пам’ять використовується).

source: The :c:func:`PyMem_SetupDebugHooks` function now also works on Python compiled in release mode. On error, the debug hooks now use :mod:`tracemalloc` to get the traceback where a memory block was allocated. The debug hooks now also check if the GIL is held when functions of :c:data:`PYMEM_DOMAIN_OBJ` and :c:data:`PYMEM_DOMAIN_MEM` domains are called.
uk: Функція :c:func:`PyMem_SetupDebugHooks` тепер також працює на Python, скомпільованому в режимі випуску. У разі помилки хуки налагодження тепер використовують :mod:`tracemalloc` для отримання зворотного відстеження, де було виділено блок пам’яті. Хуки налагодження тепер також перевіряють, чи утримується GIL під час виклику функцій доменів :c:data:`PYMEM_DOMAIN_OBJ` і :c:data:`PYMEM_DOMAIN_MEM`.

source: Byte patterns ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) and ``0xFB`` (``PYMEM_FORBIDDENBYTE``) have been replaced with ``0xCD``, ``0xDD`` and ``0xFD`` to use the same values than Windows CRT debug ``malloc()`` and ``free()``.
uk: Шаблони байтів ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) і ``0xFB`` (``PYMEM_FORBIDDENBYTE``) були замінені на ``0xCD``, ``0xDD`` і ``0xFD``, щоб використовувати ті самі значення, що й ``malloc()`` і ``free()`` для налагодження Windows CRT.

source: The pymalloc allocator
uk: Розподільник pymalloc

source: Python has a *pymalloc* allocator optimized for small objects (smaller or equal to 512 bytes) with a short lifetime. It uses memory mappings called "arenas" with a fixed size of 256 KiB. It falls back to :c:func:`PyMem_RawMalloc` and :c:func:`PyMem_RawRealloc` for allocations larger than 512 bytes.
uk: Python має розподільник *pymalloc*, оптимізований для малих об’єктів (менших або рівних 512 байтам) із коротким часом життя. Він використовує відображення пам’яті, які називаються "аренами" з фіксованим розміром 256 КБ. Він повертається до :c:func:`PyMem_RawMalloc` і :c:func:`PyMem_RawRealloc` для розподілу розміром більше 512 байт.

source: *pymalloc* is the :ref:`default allocator <default-memory-allocators>` of the :c:data:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) and :c:data:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) domains.
uk: *pymalloc* є :ref:`розподільником за замовчуванням <default-memory-allocators>` :c:data:`PYMEM_DOMAIN_MEM` (наприклад: :c:func:`PyMem_Malloc`) і :c:data:`PYMEM_DOMAIN_OBJ` (наприклад: :c:func:`PyObject_Malloc`).

source: The arena allocator uses the following functions:
uk: Розподільник арени використовує такі функції:

source: :c:func:`VirtualAlloc` and :c:func:`VirtualFree` on Windows,
uk: :c:func:`VirtualAlloc` і :c:func:`VirtualFree` у Windows,

source: :c:func:`mmap` and :c:func:`munmap` if available,
uk: :c:func:`mmap` і :c:func:`munmap`, якщо доступні,

source: :c:func:`malloc` and :c:func:`free` otherwise.
uk: :c:func:`malloc` і :c:func:`free` інакше.

source: This allocator is disabled if Python is configured with the :option:`--without-pymalloc` option. It can also be disabled at runtime using the :envvar:`PYTHONMALLOC` environment variable (ex: ``PYTHONMALLOC=malloc``).
uk: Цей розподільник вимкнено, якщо Python налаштовано з параметром :option:`--without-pymalloc`. Його також можна вимкнути під час виконання за допомогою змінної середовища :envvar:`PYTHONMALLOC` (наприклад: ``PYTHONMALLOC=malloc``).

source: Customize pymalloc Arena Allocator
uk: Налаштувати pymalloc Arena Allocator

source: Structure used to describe an arena allocator. The structure has three fields:
uk: Структура, яка використовується для опису розподільника арен. Структура має три поля:

source: allocate an arena of size bytes
uk: виділити арену розміром байт

source: free an arena
uk: звільнити арену

source: Get the arena allocator.
uk: Отримайте розподільник арен.

source: Set the arena allocator.
uk: Встановіть розподільник арен.

source: Track an allocated memory block in the :mod:`tracemalloc` module.
uk: Відстежуйте виділений блок пам’яті в модулі :mod:`tracemalloc`.

source: Return ``0`` on success, return ``-1`` on error (failed to allocate memory to store the trace). Return ``-2`` if tracemalloc is disabled.
uk: Повертає ``0`` у разі успіху, повертає ``-1`` у разі помилки (не вдалося виділити пам’ять для збереження трасування). Повертає ``-2``, якщо tracemalloc вимкнено.

source: If memory block is already tracked, update the existing trace.
uk: Якщо блок пам’яті вже відстежується, оновіть наявне трасування.

source: Untrack an allocated memory block in the :mod:`tracemalloc` module. Do nothing if the block was not tracked.
uk: Скасувати відстеження виділеного блоку пам’яті в модулі :mod:`tracemalloc`. Нічого не робити, якщо блок не відстежується.

source: Return ``-2`` if tracemalloc is disabled, otherwise return ``0``.
uk: Повертає ``-2``, якщо tracemalloc вимкнено, інакше повертає ``0``.

source: Examples
uk: Приклади

source: Here is the example from section :ref:`memoryoverview`, rewritten so that the I/O buffer is allocated from the Python heap by using the first function set::
uk: Ось приклад із розділу :ref:`memoryoverview`, переписаний таким чином, що буфер введення/виведення виділяється з купи Python за допомогою першого набору функцій::

source: The same code using the type-oriented function set::
uk: Той самий код із використанням типу орієнтованого набору функцій::

source: Note that in the two examples above, the buffer is always manipulated via functions belonging to the same set. Indeed, it is required to use the same memory API family for a given memory block, so that the risk of mixing different allocators is reduced to a minimum. The following code sequence contains two errors, one of which is labeled as *fatal* because it mixes two different allocators operating on different heaps. ::
uk: Зауважте, що у двох наведених вище прикладах буфером завжди керують функції, що належать одному набору. Дійсно, для певного блоку пам’яті потрібно використовувати одне й те саме сімейство API пам’яті, щоб ризик змішування різних розподільників був зведений до мінімуму. Наступна кодова послідовність містить дві помилки, одна з яких позначена як *фатальна*, оскільки вона змішує два різних розподільника, що працюють на різних купах. ::

source: In addition to the functions aimed at handling raw memory blocks from the Python heap, objects in Python are allocated and released with :c:func:`PyObject_New`, :c:func:`PyObject_NewVar` and :c:func:`PyObject_Del`.
uk: На додаток до функцій, спрямованих на обробку необроблених блоків пам’яті з купи Python, об’єкти в Python виділяються та звільняються за допомогою :c:func:`PyObject_New`, :c:func:`PyObject_NewVar` і :c:func:`PyObject_Del` .

source: These will be explained in the next chapter on defining and implementing new object types in C.
uk: Це буде пояснено в наступному розділі про визначення та реалізацію нових типів об’єктів у C.
