Repository: python/python-docs-uk
Catalog: c-api/memoryview.po
Languages: uk

source: MemoryView objects
uk: Об'єкти MemoryView

source: A :class:`memoryview` object exposes the C level :ref:`buffer interface <bufferobjects>` as a Python object which can then be passed around like any other object.
uk: Об’єкт :class:`memoryview` розкриває :ref:`інтерфейс буфера рівня C <bufferobjects>` як об’єкт Python, який потім можна передавати, як будь-який інший об’єкт.

source: Create a memoryview object from an object that provides the buffer interface. If *obj* supports writable buffer exports, the memoryview object will be read/write, otherwise it may be either read-only or read/write at the discretion of the exporter.
uk: Створіть об’єкт memoryview з об’єкта, який забезпечує інтерфейс буфера. Якщо *obj* підтримує експорт буфера для запису, об’єкт memoryview буде читати/записувати, інакше він може бути або лише для читання, або для читання/запису на розсуд експортера.

source: Create a memoryview object using *mem* as the underlying buffer. *flags* can be one of :c:macro:`PyBUF_READ` or :c:macro:`PyBUF_WRITE`.
uk: Створіть об’єкт memoryview, використовуючи *mem* як базовий буфер. *flags* може бути одним із :c:macro:`PyBUF_READ` або :c:macro:`PyBUF_WRITE`.

source: Create a memoryview object wrapping the given buffer structure *view*. For simple byte buffers, :c:func:`PyMemoryView_FromMemory` is the preferred function.
uk: Створіть об’єкт memoryview, що обгортає задану структуру буфера *view*. Для простих байтових буферів перевагою є функція :c:func:`PyMemoryView_FromMemory`.

source: Create a memoryview object to a :term:`contiguous` chunk of memory (in either 'C' or 'F'ortran *order*) from an object that defines the buffer interface. If memory is contiguous, the memoryview object points to the original memory. Otherwise, a copy is made and the memoryview points to a new bytes object.
uk: Створіть об’єкт memoryview для :term:`contiguous` фрагмента пам’яті (у *порядку* "C" або "F'ortran) з об’єкта, який визначає інтерфейс буфера. Якщо пам’ять є суміжною, об’єкт memoryview вказує на вихідну пам’ять. В іншому випадку буде зроблено копію, і memoryview вкаже на новий об’єкт bytes.

source: Return true if the object *obj* is a memoryview object. It is not currently allowed to create subclasses of :class:`memoryview`. This function always succeeds.
uk: Повертає true, якщо об’єкт *obj* є об’єктом memoryview. Наразі не можна створювати підкласи :class:`memoryview`. Ця функція завжди успішна.

source: Return a pointer to the memoryview's private copy of the exporter's buffer. *mview* **must** be a memoryview instance; this macro doesn't check its type, you must do it yourself or you will risk crashes.
uk: Повертає вказівник на приватну копію буфера експортера для memoryview. *mview* **має** бути екземпляром memoryview; цей макрос не перевіряє свій тип, ви повинні зробити це самостійно, інакше ви ризикуєте збої.

source: Return either a pointer to the exporting object that the memoryview is based on or ``NULL`` if the memoryview has been created by one of the functions :c:func:`PyMemoryView_FromMemory` or :c:func:`PyMemoryView_FromBuffer`. *mview* **must** be a memoryview instance.
uk: Повертає вказівник на об’єкт експорту, на якому базується memoryview, або ``NULL``, якщо memoryview було створено однією з функцій :c:func:`PyMemoryView_FromMemory` або :c:func:`PyMemoryView_FromBuffer`. *mview* **має** бути екземпляром memoryview.

source: object
uk: об'єкт
