Repository: python/python-docs-uk
Catalog: c-api/module.po
Languages: uk

source: Module Objects
uk: Об’єкти модуля

source: This instance of :c:type:`PyTypeObject` represents the Python module type. This is exposed to Python programs as ``types.ModuleType``.
uk: Цей екземпляр :c:type:`PyTypeObject` представляє тип модуля Python. Це доступно для програм Python як ``types.ModuleType``.

source: Return true if *p* is a module object, or a subtype of a module object. This function always succeeds.
uk: Повертає true, якщо *p* є об’єктом модуля або підтипом об’єкта модуля. Ця функція завжди успішна.

source: Return true if *p* is a module object, but not a subtype of :c:data:`PyModule_Type`. This function always succeeds.
uk: Повертає true, якщо *p* є об’єктом модуля, але не підтипом :c:data:`PyModule_Type`. Ця функція завжди успішна.

source: Return a new module object with the :attr:`__name__` attribute set to *name*. The module's :attr:`__name__`, :attr:`__doc__`, :attr:`__package__`, and :attr:`__loader__` attributes are filled in (all but :attr:`__name__` are set to ``None``); the caller is responsible for providing a :attr:`__file__` attribute.
uk: Повертає новий об’єкт модуля з атрибутом :attr:`__name__`, встановленим на *name*. Атрибути модуля :attr:`__name__`, :attr:`__doc__`, :attr:`__package__` і :attr:`__loader__` заповнюються (для всіх, крім :attr:`__name__`, встановлено значення ``None``); абонент відповідає за надання атрибута :attr:`__file__`.

source: :attr:`__package__` and :attr:`__loader__` are set to ``None``.
uk: :attr:`__package__` і :attr:`__loader__` мають значення ``None``.

source: Similar to :c:func:`PyModule_NewObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
uk: Подібно до :c:func:`PyModule_NewObject`, але ім’я — це рядок у кодуванні UTF-8, а не об’єкт Unicode.

source: Return the dictionary object that implements *module*'s namespace; this object is the same as the :attr:`~object.__dict__` attribute of the module object. If *module* is not a module object (or a subtype of a module object), :exc:`SystemError` is raised and ``NULL`` is returned.
uk: Повертає об’єкт словника, який реалізує простір імен *module*; цей об’єкт збігається з атрибутом :attr:`~object.__dict__` об’єкта модуля. Якщо *module* не є об’єктом модуля (або підтипом об’єкта модуля), виникає :exc:`SystemError` і повертається ``NULL``.

source: It is recommended extensions use other :c:func:`PyModule_\*` and :c:func:`PyObject_\*` functions rather than directly manipulate a module's :attr:`~object.__dict__`.
uk: Рекомендується, щоб розширення використовували інші функції :c:func:`PyModule_\*` і :c:func:`PyObject_\*`, а не безпосередньо маніпулювали :attr:`~object.__dict__` модуля.

source: Return *module*'s :attr:`__name__` value. If the module does not provide one, or if it is not a string, :exc:`SystemError` is raised and ``NULL`` is returned.
uk: Повертає значення *module* :attr:`__name__`. Якщо модуль не надає його або якщо це не рядок, виникає :exc:`SystemError` і повертається ``NULL``.

source: Similar to :c:func:`PyModule_GetNameObject` but return the name encoded to ``'utf-8'``.
uk: Подібно до :c:func:`PyModule_GetNameObject`, але повертає назву, закодовану в ``'utf-8'``.

source: Return the "state" of the module, that is, a pointer to the block of memory allocated at module creation time, or ``NULL``. See :c:member:`PyModuleDef.m_size`.
uk: Повертає "стан" модуля, тобто вказівник на блок пам’яті, виділений під час створення модуля, або ``NULL``. Перегляньте :c:member:`PyModuleDef.m_size`.

source: Return a pointer to the :c:type:`PyModuleDef` struct from which the module was created, or ``NULL`` if the module wasn't created from a definition.
uk: Повертає вказівник на структуру :c:type:`PyModuleDef`, з якої було створено модуль, або ``NULL``, якщо модуль не було створено з визначення.

source: Return the name of the file from which *module* was loaded using *module*'s :attr:`__file__` attribute. If this is not defined, or if it is not a unicode string, raise :exc:`SystemError` and return ``NULL``; otherwise return a reference to a Unicode object.
uk: Повертає назву файлу, з якого було завантажено *module*, використовуючи атрибут *module* :attr:`__file__`. Якщо це не визначено, або якщо це не рядок Юнікод, викликати :exc:`SystemError` і повернути ``NULL``; інакше повертає посилання на об’єкт Unicode.

source: Similar to :c:func:`PyModule_GetFilenameObject` but return the filename encoded to 'utf-8'.
uk: Подібно до :c:func:`PyModule_GetFilenameObject`, але повертає назву файлу, закодовану як 'utf-8'.

source: :c:func:`PyModule_GetFilename` raises :c:type:`UnicodeEncodeError` on unencodable filenames, use :c:func:`PyModule_GetFilenameObject` instead.
uk: :c:func:`PyModule_GetFilename` викликає :c:type:`UnicodeEncodeError` на некодованих іменах файлів, замість цього використовуйте :c:func:`PyModule_GetFilenameObject`.

source: Initializing C modules
uk: Ініціалізація модулів C

source: Modules objects are usually created from extension modules (shared libraries which export an initialization function), or compiled-in modules (where the initialization function is added using :c:func:`PyImport_AppendInittab`). See :ref:`building` or :ref:`extending-with-embedding` for details.
uk: Об’єкти Modules зазвичай створюються з модулів розширення (спільних бібліотек, які експортують функцію ініціалізації) або скомпільованих модулів (куди функція ініціалізації додається за допомогою :c:func:`PyImport_AppendInittab`). Дивіться :ref:`building` або :ref:`extending-with-embedding` для деталей.

source: The initialization function can either pass a module definition instance to :c:func:`PyModule_Create`, and return the resulting module object, or request "multi-phase initialization" by returning the definition struct itself.
uk: Функція ініціалізації може або передати екземпляр визначення модуля до :c:func:`PyModule_Create` і повернути результуючий об’єкт модуля, або запросити "багатофазову ініціалізацію", повернувши саму структуру визначення.

source: The module definition struct, which holds all information needed to create a module object. There is usually only one statically initialized variable of this type for each module.
uk: Структура визначення модуля, яка містить всю інформацію, необхідну для створення об’єкта модуля. Зазвичай існує лише одна статично ініціалізована змінна цього типу для кожного модуля.

source: Always initialize this member to :const:`PyModuleDef_HEAD_INIT`.
uk: Завжди ініціалізуйте цей член :const:`PyModuleDef_HEAD_INIT`.

source: Name for the new module.
uk: Назва для нового модуля.

source: Docstring for the module; usually a docstring variable created with :c:macro:`PyDoc_STRVAR` is used.
uk: Рядок документації для модуля; зазвичай використовується змінна docstring, створена за допомогою :c:macro:`PyDoc_STRVAR`.

source: Module state may be kept in a per-module memory area that can be retrieved with :c:func:`PyModule_GetState`, rather than in static globals. This makes modules safe for use in multiple sub-interpreters.
uk: Стан модуля може зберігатися в області пам’яті для кожного модуля, яку можна отримати за допомогою :c:func:`PyModule_GetState`, а не в статичних глобалах. Це робить модулі безпечними для використання в кількох субінтерпретаторах.

source: This memory area is allocated based on *m_size* on module creation, and freed when the module object is deallocated, after the :c:member:`m_free` function has been called, if present.
uk: Ця область пам’яті виділяється на основі *m_size* під час створення модуля та звільняється, коли об’єкт модуля звільняється, після виклику функції :c:member:`m_free`, якщо вона є.

source: Setting ``m_size`` to ``-1`` means that the module does not support sub-interpreters, because it has global state.
uk: Встановлення ``m_size`` на ``-1`` означає, що модуль не підтримує суб-інтерпретатори, оскільки він має глобальний стан.

source: Setting it to a non-negative value means that the module can be re-initialized and specifies the additional amount of memory it requires for its state. Non-negative ``m_size`` is required for multi-phase initialization.
uk: Встановлення невід’ємного значення означає, що модуль можна повторно ініціалізувати, і вказує додатковий обсяг пам’яті, який йому потрібен для його стану. Для багатофазної ініціалізації необхідний невід’ємний ``m_size``.

source: See :PEP:`3121` for more details.
uk: Додаткову інформацію див. :PEP:`3121`.

source: A pointer to a table of module-level functions, described by :c:type:`PyMethodDef` values. Can be ``NULL`` if no functions are present.
uk: Покажчик на таблицю функцій рівня модуля, описану значеннями :c:type:`PyMethodDef`. Може бути ``NULL``, якщо функції відсутні.

source: An array of slot definitions for multi-phase initialization, terminated by a ``{0, NULL}`` entry. When using single-phase initialization, *m_slots* must be ``NULL``.
uk: Масив визначень слотів для багатофазної ініціалізації, що завершується записом ``{0, NULL}``. У разі використання однофазної ініціалізації *m_slots* має бути ``NULL``.

source: Prior to version 3.5, this member was always set to ``NULL``, and was defined as:
uk: До версії 3.5 цей член завжди мав значення ``NULL`` і визначався як:

source: A traversal function to call during GC traversal of the module object, or ``NULL`` if not needed.
uk: Функція обходу, яка викликається під час обходу GC об’єкта модуля, або ``NULL``, якщо не потрібна.

source: This function is not called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, this function is not called if :c:member:`m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
uk: Ця функція не викликається, якщо стан модуля було запитано, але ще не виділено. Це відбувається одразу після створення модуля та перед його виконанням (функція :c:data:`Py_mod_exec`). Точніше, ця функція не викликається, якщо :c:member:`m_size` більше 0, а стан модуля (як повертається :c:func:`PyModule_GetState`) дорівнює ``NULL``.

source: No longer called before the module state is allocated.
uk: Більше не викликається до виділення стану модуля.

source: A clear function to call during GC clearing of the module object, or ``NULL`` if not needed.
uk: Очистити функцію для виклику під час очищення GC об’єкта модуля або ``NULL``, якщо не потрібно.

source: Like :c:member:`PyTypeObject.tp_clear`, this function is not *always* called before a module is deallocated. For example, when reference counting is enough to determine that an object is no longer used, the cyclic garbage collector is not involved and :c:member:`~PyModuleDef.m_free` is called directly.
uk: Як і :c:member:`PyTypeObject.tp_clear`, ця функція не *завжди* викликається до того, як модуль буде звільнено. Наприклад, коли підрахунку посилань достатньо, щоб визначити, що об’єкт більше не використовується, циклічний збирач сміття не задіяний і :c:member:`~PyModuleDef.m_free` викликається безпосередньо.

source: A function to call during deallocation of the module object, or ``NULL`` if not needed.
uk: Функція для виклику під час звільнення об’єкта модуля або ``NULL``, якщо вона не потрібна.

source: Single-phase initialization
uk: Однофазна ініціалізація

source: The module initialization function may create and return the module object directly. This is referred to as "single-phase initialization", and uses one of the following two module creation functions:
uk: Функція ініціалізації модуля може створювати та повертати об’єкт модуля безпосередньо. Це називається "однофазною ініціалізацією" та використовує одну з наступних двох функцій створення модуля:

source: Create a new module object, given the definition in *def*. This behaves like :c:func:`PyModule_Create2` with *module_api_version* set to :const:`PYTHON_API_VERSION`.
uk: Створіть новий об’єкт модуля відповідно до визначення в *def*. Це поводиться як :c:func:`PyModule_Create2` з *module_api_version* встановленим на :const:`PYTHON_API_VERSION`.

source: Create a new module object, given the definition in *def*, assuming the API version *module_api_version*. If that version does not match the version of the running interpreter, a :exc:`RuntimeWarning` is emitted.
uk: Створіть новий об’єкт модуля, враховуючи визначення в *def*, припускаючи версію API *module_api_version*. Якщо ця версія не збігається з версією запущеного інтерпретатора, видається :exc:`RuntimeWarning`.

source: Most uses of this function should be using :c:func:`PyModule_Create` instead; only use this if you are sure you need it.
uk: Більшість випадків використання цієї функції має використовувати замість неї :c:func:`PyModule_Create`; використовуйте це, лише якщо ви впевнені, що це вам потрібно.

source: Before it is returned from in the initialization function, the resulting module object is typically populated using functions like :c:func:`PyModule_AddObjectRef`.
uk: Перед поверненням у функції ініціалізації результуючий об’єкт модуля зазвичай заповнюється за допомогою таких функцій, як :c:func:`PyModule_AddObjectRef`.

source: Multi-phase initialization
uk: Багатофазова ініціалізація

source: An alternate way to specify extensions is to request "multi-phase initialization". Extension modules created this way behave more like Python modules: the initialization is split between the *creation phase*, when the module object is created, and the *execution phase*, when it is populated. The distinction is similar to the :py:meth:`__new__` and :py:meth:`__init__` methods of classes.
uk: Альтернативним способом визначення розширень є запит на "багатофазову ініціалізацію". Модулі розширення, створені таким чином, поводяться більше як модулі Python: ініціалізація розподіляється між *фазою створення*, коли створюється об’єкт модуля, і *фазою виконання*, коли він заповнюється. Розрізнення подібне до методів класів :py:meth:`__new__` і :py:meth:`__init__`.

source: Unlike modules created using single-phase initialization, these modules are not singletons: if the *sys.modules* entry is removed and the module is re-imported, a new module object is created, and the old module is subject to normal garbage collection -- as with Python modules. By default, multiple modules created from the same definition should be independent: changes to one should not affect the others. This means that all state should be specific to the module object (using e.g. using :c:func:`PyModule_GetState`), or its contents (such as the module's :attr:`__dict__` or individual classes created with :c:func:`PyType_FromSpec`).
uk: На відміну від модулів, створених за допомогою однофазної ініціалізації, ці модулі не є одиночними: якщо запис *sys.modules* видаляється та модуль імпортується повторно, створюється новий об’єкт модуля, а старий модуль підлягає звичайному збиранню сміття -- як і з модулями Python. За замовчуванням кілька модулів, створених з одного визначення, мають бути незалежними: зміни в одному не повинні впливати на інші. Це означає, що весь стан має бути специфічним для об’єкта модуля (використовуючи, наприклад, використання :c:func:`PyModule_GetState`), або його вмісту (наприклад, :attr:`__dict__` модуля або окремих класів, створених за допомогою :c:func:`PyType_FromSpec`).

source: All modules created using multi-phase initialization are expected to support :ref:`sub-interpreters <sub-interpreter-support>`. Making sure multiple modules are independent is typically enough to achieve this.
uk: Очікується, що всі модулі, створені за допомогою багатофазної ініціалізації, підтримуватимуть :ref:`sub-інтерпретатори <sub-interpreter-support>`. Переконавшись, що декілька модулів є незалежними, як правило, достатньо, щоб досягти цього.

source: To request multi-phase initialization, the initialization function (PyInit_modulename) returns a :c:type:`PyModuleDef` instance with non-empty :c:member:`~PyModuleDef.m_slots`. Before it is returned, the ``PyModuleDef`` instance must be initialized with the following function:
uk: Для запиту багатофазної ініціалізації функція ініціалізації (PyInit_modulename) повертає екземпляр :c:type:`PyModuleDef` з непорожнім :c:member:`~PyModuleDef.m_slots`. Перш ніж його буде повернуто, примірник ``PyModuleDef`` має бути ініціалізований такою функцією:

source: Ensures a module definition is a properly initialized Python object that correctly reports its type and reference count.
uk: Гарантує, що визначення модуля є правильно ініціалізованим об’єктом Python, який правильно повідомляє про свій тип і кількість посилань.

source: Returns *def* cast to ``PyObject*``, or ``NULL`` if an error occurred.
uk: Повертає *def* приведення до ``PyObject*`` або ``NULL``, якщо сталася помилка.

source: The *m_slots* member of the module definition must point to an array of ``PyModuleDef_Slot`` structures:
uk: Член *m_slots* у визначенні модуля має вказувати на масив структур ``PyModuleDef_Slot``:

source: A slot ID, chosen from the available values explained below.
uk: Ідентифікатор слота, вибраний із доступних значень, пояснених нижче.

source: Value of the slot, whose meaning depends on the slot ID.
uk: Значення слота, значення якого залежить від ідентифікатора слота.

source: The *m_slots* array must be terminated by a slot with id 0.
uk: Масив *m_slots* повинен закінчуватися слотом з ідентифікатором 0.

source: The available slot types are:
uk: Доступні типи слотів:

source: Specifies a function that is called to create the module object itself. The *value* pointer of this slot must point to a function of the signature:
uk: Визначає функцію, яка викликається для створення самого об’єкта модуля. Покажчик *значення* цього слота має вказувати на функцію підпису:

source: The function receives a :py:class:`~importlib.machinery.ModuleSpec` instance, as defined in :PEP:`451`, and the module definition. It should return a new module object, or set an error and return ``NULL``.
uk: Функція отримує екземпляр :py:class:`~importlib.machinery.ModuleSpec`, як визначено в :PEP:`451`, і визначення модуля. Він має повернути новий об’єкт модуля або встановити помилку та повернути ``NULL``.

source: This function should be kept minimal. In particular, it should not call arbitrary Python code, as trying to import the same module again may result in an infinite loop.
uk: Ця функція повинна бути мінімальною. Зокрема, він не повинен викликати довільний код Python, оскільки повторна спроба імпортувати той самий модуль може призвести до нескінченного циклу.

source: Multiple ``Py_mod_create`` slots may not be specified in one module definition.
uk: Кілька слотів ``Py_mod_create`` не можуть бути вказані в одному визначенні модуля.

source: If ``Py_mod_create`` is not specified, the import machinery will create a normal module object using :c:func:`PyModule_New`. The name is taken from *spec*, not the definition, to allow extension modules to dynamically adjust to their place in the module hierarchy and be imported under different names through symlinks, all while sharing a single module definition.
uk: Якщо ``Py_mod_create`` не вказано, механізм імпорту створить звичайний об’єкт модуля за допомогою :c:func:`PyModule_New`. Ім’я взято з *spec*, а не з визначення, щоб дозволити модулям розширення динамічно адаптуватися до свого місця в ієрархії модулів і імпортуватися під різними іменами за допомогою символічних посилань, водночас користуючись єдиним визначенням модуля.

source: There is no requirement for the returned object to be an instance of :c:type:`PyModule_Type`. Any type can be used, as long as it supports setting and getting import-related attributes. However, only ``PyModule_Type`` instances may be returned if the ``PyModuleDef`` has non-``NULL`` ``m_traverse``, ``m_clear``, ``m_free``; non-zero ``m_size``; or slots other than ``Py_mod_create``.
uk: Немає вимоги, щоб повернутий об’єкт був екземпляром :c:type:`PyModule_Type`. Можна використовувати будь-який тип, якщо він підтримує встановлення та отримання пов’язаних з імпортом атрибутів. Однак лише екземпляри ``PyModule_Type`` можуть повертатися, якщо ``PyModuleDef`` має не-``NULL`` ``m_traverse``, ``m_clear``, ``m_free``; ненульовий ``m_size``; або слоти, відмінні від ``Py_mod_create``.

source: Specifies a function that is called to *execute* the module. This is equivalent to executing the code of a Python module: typically, this function adds classes and constants to the module. The signature of the function is:
uk: Визначає функцію, яка викликається для *виконання* модуля. Це еквівалентно виконанню коду модуля Python: зазвичай ця функція додає класи та константи до модуля. Сигнатура функції:

source: If multiple ``Py_mod_exec`` slots are specified, they are processed in the order they appear in the *m_slots* array.
uk: Якщо вказано кілька слотів ``Py_mod_exec``, вони обробляються в тому порядку, в якому вони з’являються в масиві *m_slots*.

source: See :PEP:`489` for more details on multi-phase initialization.
uk: Перегляньте :PEP:`489` для отримання додаткової інформації про багатофазову ініціалізацію.

source: Low-level module creation functions
uk: Функції створення модулів низького рівня

source: The following functions are called under the hood when using multi-phase initialization. They can be used directly, for example when creating module objects dynamically. Note that both ``PyModule_FromDefAndSpec`` and ``PyModule_ExecDef`` must be called to fully initialize a module.
uk: Наступні функції викликаються під капотом під час використання багатофазної ініціалізації. Їх можна використовувати безпосередньо, наприклад, при динамічному створенні об’єктів модуля. Зауважте, що для повної ініціалізації модуля необхідно викликати як ``PyModule_FromDefAndSpec``, так і ``PyModule_ExecDef``.

source: Create a new module object, given the definition in *module* and the ModuleSpec *spec*. This behaves like :c:func:`PyModule_FromDefAndSpec2` with *module_api_version* set to :const:`PYTHON_API_VERSION`.
uk: Створіть новий об’єкт модуля, враховуючи визначення в *module* і ModuleSpec *spec*. Це поводиться як :c:func:`PyModule_FromDefAndSpec2` з *module_api_version* встановленим на :const:`PYTHON_API_VERSION`.

source: Create a new module object, given the definition in *module* and the ModuleSpec *spec*, assuming the API version *module_api_version*. If that version does not match the version of the running interpreter, a :exc:`RuntimeWarning` is emitted.
uk: Створіть новий об’єкт модуля, враховуючи визначення в *module* та ModuleSpec *spec*, припускаючи версію API *module_api_version*. Якщо ця версія не збігається з версією запущеного інтерпретатора, видається :exc:`RuntimeWarning`.

source: Most uses of this function should be using :c:func:`PyModule_FromDefAndSpec` instead; only use this if you are sure you need it.
uk: У більшості випадків використання цієї функції має використовувати :c:func:`PyModule_FromDefAndSpec`; використовуйте це, лише якщо ви впевнені, що це вам потрібно.

source: Process any execution slots (:c:data:`Py_mod_exec`) given in *def*.
uk: Обробити будь-які слоти виконання (:c:data:`Py_mod_exec`), указані в *def*.

source: Set the docstring for *module* to *docstring*. This function is called automatically when creating a module from ``PyModuleDef``, using either ``PyModule_Create`` or ``PyModule_FromDefAndSpec``.
uk: Встановіть рядок документації для *module* на *string*. Ця функція викликається автоматично під час створення модуля з ``PyModuleDef`` за допомогою ``PyModule_Create`` або ``PyModule_FromDefAndSpec``.
