Repository: python/python-docs-uk
Catalog: c-api/module.po
Languages: uk

source: Add the functions from the ``NULL`` terminated *functions* array to *module*. Refer to the :c:type:`PyMethodDef` documentation for details on individual entries (due to the lack of a shared module namespace, module level "functions" implemented in C typically receive the module as their first parameter, making them similar to instance methods on Python classes). This function is called automatically when creating a module from ``PyModuleDef``, using either ``PyModule_Create`` or ``PyModule_FromDefAndSpec``.
uk: Додайте функції з масиву *functions* із закінченням ``NULL`` до *module*. Зверніться до документації :c:type:`PyMethodDef`, щоб дізнатися більше про окремі записи (через відсутність спільного простору імен модуля "функції" рівня модуля, реалізовані в C, зазвичай отримують модуль як свій перший параметр, що робить їх схожими на екземпляр методи на класах Python). Ця функція викликається автоматично під час створення модуля з ``PyModuleDef`` за допомогою ``PyModule_Create`` або ``PyModule_FromDefAndSpec``.

source: Support functions
uk: Допоміжні функції

source: The module initialization function (if using single phase initialization) or a function called from a module execution slot (if using multi-phase initialization), can use the following functions to help initialize the module state:
uk: Функція ініціалізації модуля (якщо використовується однофазна ініціалізація) або функція, що викликається зі слота виконання модуля (якщо використовується багатофазова ініціалізація), може використовувати такі функції, щоб допомогти ініціалізувати стан модуля:

source: Add an object to *module* as *name*. This is a convenience function which can be used from the module's initialization function.
uk: Додайте об’єкт до *модуля* як *ім’я*. Це зручна функція, яку можна використовувати з функції ініціалізації модуля.

source: On success, return ``0``. On error, raise an exception and return ``-1``.
uk: У разі успіху поверніть ``0``. У разі помилки викликає виняток і повертає ``-1``.

source: Return ``NULL`` if *value* is ``NULL``. It must be called with an exception raised in this case.
uk: Повертає ``NULL``, якщо *значення* дорівнює ``NULL``. У цьому випадку його потрібно викликати з винятком.

source: Example usage::
uk: Приклад використання::

source: The example can also be written without checking explicitly if *obj* is ``NULL``::
uk: Приклад також можна написати без явної перевірки, якщо *obj* має значення ``NULL``::

source: Note that ``Py_XDECREF()`` should be used instead of ``Py_DECREF()`` in this case, since *obj* can be ``NULL``.
uk: Зверніть увагу, що в цьому випадку слід використовувати ``Py_XDECREF()`` замість ``Py_DECREF()``, оскільки *obj* може бути ``NULL``.

source: Similar to :c:func:`PyModule_AddObjectRef`, but steals a reference to *value* on success (if it returns ``0``).
uk: Подібно до :c:func:`PyModule_AddObjectRef`, але в разі успіху викрадає посилання на *value* (якщо повертає ``0``).

source: The new :c:func:`PyModule_AddObjectRef` function is recommended, since it is easy to introduce reference leaks by misusing the :c:func:`PyModule_AddObject` function.
uk: Рекомендовано використовувати нову функцію :c:func:`PyModule_AddObjectRef`, оскільки внаслідок неправильного використання функції :c:func:`PyModule_AddObject` легко створити витоки посилань.

source: Unlike other functions that steal references, ``PyModule_AddObject()`` only decrements the reference count of *value* **on success**.
uk: На відміну від інших функцій, які викрадають посилання, ``PyModule_AddObject()`` лише зменшує кількість посилань *значення* **у разі успіху**.

source: This means that its return value must be checked, and calling code must :c:func:`Py_DECREF` *value* manually on error.
uk: Це означає, що його повертане значення має бути перевірено, а код виклику повинен :c:func:`Py_DECREF` *значення* вручну у разі помилки.

source: Add an integer constant to *module* as *name*. This convenience function can be used from the module's initialization function. Return ``-1`` on error, ``0`` on success.
uk: Додайте цілу константу до *module* як *name*. Цю зручну функцію можна використовувати з функції ініціалізації модуля. Повертає ``-1`` у разі помилки, ``0`` у разі успіху.

source: Add a string constant to *module* as *name*. This convenience function can be used from the module's initialization function. The string *value* must be ``NULL``-terminated. Return ``-1`` on error, ``0`` on success.
uk: Додайте рядкову константу до *module* як *name*. Цю зручну функцію можна використовувати з функції ініціалізації модуля. Рядок *значення* має завершуватися ``NULL``. Повертає ``-1`` у разі помилки, ``0`` у разі успіху.

source: Add an int constant to *module*. The name and the value are taken from *macro*. For example ``PyModule_AddIntMacro(module, AF_INET)`` adds the int constant *AF_INET* with the value of *AF_INET* to *module*. Return ``-1`` on error, ``0`` on success.
uk: Додайте константу int до *module*. Ім'я та значення взято з *макросу*. Наприклад, ``PyModule_AddIntMacro(module, AF_INET)`` додає константу int *AF_INET* зі значенням *AF_INET* до *module*. Повертає ``-1`` у разі помилки, ``0`` у разі успіху.

source: Add a string constant to *module*.
uk: Додайте рядкову константу до *module*.

source: Add a type object to *module*. The type object is finalized by calling internally :c:func:`PyType_Ready`. The name of the type object is taken from the last component of :c:member:`~PyTypeObject.tp_name` after dot. Return ``-1`` on error, ``0`` on success.
uk: Додайте об’єкт типу до *module*. Об’єкт типу завершується внутрішнім викликом :c:func:`PyType_Ready`. Ім’я об’єкта типу береться з останнього компонента :c:member:`~PyTypeObject.tp_name` після крапки. Повертає ``-1`` у разі помилки, ``0`` у разі успіху.

source: Module lookup
uk: Пошук модуля

source: Single-phase initialization creates singleton modules that can be looked up in the context of the current interpreter. This allows the module object to be retrieved later with only a reference to the module definition.
uk: Однофазова ініціалізація створює однотонні модулі, які можна шукати в контексті поточного інтерпретатора. Це дозволяє пізніше отримати об’єкт модуля лише з посиланням на визначення модуля.

source: These functions will not work on modules created using multi-phase initialization, since multiple such modules can be created from a single definition.
uk: Ці функції не працюватимуть на модулях, створених за допомогою багатофазної ініціалізації, оскільки кілька таких модулів можна створити з одного визначення.

source: Returns the module object that was created from *def* for the current interpreter. This method requires that the module object has been attached to the interpreter state with :c:func:`PyState_AddModule` beforehand. In case the corresponding module object is not found or has not been attached to the interpreter state yet, it returns ``NULL``.
uk: Повертає об’єкт модуля, який було створено з *def* для поточного інтерпретатора. Цей метод вимагає, щоб об’єкт модуля був прикріплений до стану інтерпретатора за допомогою :c:func:`PyState_AddModule` заздалегідь. Якщо відповідний об’єкт модуля не знайдено або ще не приєднано до стану інтерпретатора, він повертає ``NULL``.

source: Attaches the module object passed to the function to the interpreter state. This allows the module object to be accessible via :c:func:`PyState_FindModule`.
uk: Приєднує об’єкт модуля, переданий у функцію, до стану інтерпретатора. Це дозволяє об’єкту модуля бути доступним через :c:func:`PyState_FindModule`.

source: Only effective on modules created using single-phase initialization.
uk: Діє лише для модулів, створених за допомогою однофазної ініціалізації.

source: Python calls ``PyState_AddModule`` automatically after importing a module, so it is unnecessary (but harmless) to call it from module initialization code. An explicit call is needed only if the module's own init code subsequently calls ``PyState_FindModule``. The function is mainly intended for implementing alternative import mechanisms (either by calling it directly, or by referring to its implementation for details of the required state updates).
uk: Python автоматично викликає ``PyState_AddModule`` після імпортування модуля, тому непотрібно (але нешкідливо) викликати його з коду ініціалізації модуля. Явний виклик потрібен, лише якщо власний код ініціалізації модуля згодом викликає ``PyState_FindModule``. Ця функція в основному призначена для впровадження альтернативних механізмів імпорту (або через її прямий виклик, або шляхом посилання на її реалізацію для отримання деталей необхідних оновлень стану).

source: The caller must hold the GIL.
uk: Абонент повинен тримати GIL.

source: Return 0 on success or -1 on failure.
uk: Повертає 0 у разі успіху або -1 у разі невдачі.

source: Removes the module object created from *def* from the interpreter state. Return 0 on success or -1 on failure.
uk: Видаляє об’єкт модуля, створений з *def*, зі стану інтерпретатора. Повертає 0 у разі успіху або -1 у разі невдачі.
