Repository: python/python-docs-uk
Catalog: c-api/number.po
Languages: uk

source: Number Protocol
uk: Номер протоколу

source: Returns ``1`` if the object *o* provides numeric protocols, and false otherwise. This function always succeeds.
uk: Повертає ``1``, якщо об’єкт *o* надає числові протоколи, і false в іншому випадку. Ця функція завжди успішна.

source: Returns ``1`` if *o* is an index integer.
uk: Повертає ``1``, якщо *o* є цілим індексом.

source: Returns the result of adding *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 + o2``.
uk: Повертає результат додавання *o1* і *o2* або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 + o2``.

source: Returns the result of subtracting *o2* from *o1*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 - o2``.
uk: Повертає результат віднімання *o2* від *o1* або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 - o2``.

source: Returns the result of multiplying *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 * o2``.
uk: Повертає результат множення *o1* і *o2* або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 * o2``.

source: Returns the result of matrix multiplication on *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 @ o2``.
uk: Повертає результат множення матриці на *o1* та *o2* або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 @ o2``.

source: Return the floor of *o1* divided by *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 // o2``.
uk: Повертає нижню частину *o1*, поділену на *o2*, або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 // o2``.

source: Return a reasonable approximation for the mathematical value of *o1* divided by *o2*, or ``NULL`` on failure. The return value is "approximate" because binary floating point numbers are approximate; it is not possible to represent all real numbers in base two. This function can return a floating point value when passed two integers. This is the equivalent of the Python expression ``o1 / o2``.
uk: Повертає прийнятне наближення для математичного значення *o1*, поділеного на *o2*, або ``NULL`` у разі помилки. Повернене значення є "приблизним", оскільки двійкові числа з плаваючою комою є приблизними; неможливо представити всі дійсні числа за основою два. Ця функція може повернути значення з плаваючою комою, коли передано два цілі числа. Це еквівалент виразу Python ``o1 / o2``.

source: Returns the remainder of dividing *o1* by *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 % o2``.
uk: Повертає залишок від ділення *o1* на *o2* або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 % o2``.

source: See the built-in function :func:`divmod`. Returns ``NULL`` on failure. This is the equivalent of the Python expression ``divmod(o1, o2)``.
uk: Перегляньте вбудовану функцію :func:`divmod`. Повертає ``NULL`` у разі помилки. Це еквівалент виразу Python ``divmod(o1, o2)``.

source: See the built-in function :func:`pow`. Returns ``NULL`` on failure. This is the equivalent of the Python expression ``pow(o1, o2, o3)``, where *o3* is optional. If *o3* is to be ignored, pass :c:data:`Py_None` in its place (passing ``NULL`` for *o3* would cause an illegal memory access).
uk: Перегляньте вбудовану функцію :func:`pow`. Повертає ``NULL`` у разі помилки. Це еквівалент виразу Python ``pow(o1, o2, o3)``, де *o3* є необов’язковим. Якщо *o3* потрібно ігнорувати, передайте замість нього :c:data:`Py_None` (передача ``NULL`` для *o3* призведе до незаконного доступу до пам’яті).

source: Returns the negation of *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``-o``.
uk: Повертає заперечення *o* у разі успіху або ``NULL`` у разі невдачі. Це еквівалент виразу Python ``-o``.

source: Returns *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``+o``.
uk: Повертає *o* у разі успіху або ``NULL`` у разі невдачі. Це еквівалент виразу Python ``+o``.

source: Returns the absolute value of *o*, or ``NULL`` on failure. This is the equivalent of the Python expression ``abs(o)``.
uk: Повертає абсолютне значення *o* або ``NULL`` у разі помилки. Це еквівалент виразу Python ``abs(o)``.

source: Returns the bitwise negation of *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``~o``.
uk: Повертає порозрядне заперечення *o* у разі успіху або ``NULL`` у разі невдачі. Це еквівалент виразу Python ``~o``.

source: Returns the result of left shifting *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 << o2``.
uk: Повертає результат зсуву вліво *o1* на *o2* у разі успіху або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 << o2``.

source: Returns the result of right shifting *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 >> o2``.
uk: Повертає результат зсуву праворуч *o1* на *o2* у разі успіху або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 >> o2``.

source: Returns the "bitwise and" of *o1* and *o2* on success and ``NULL`` on failure. This is the equivalent of the Python expression ``o1 & o2``.
uk: Повертає "порозрядне та" *o1* і *o2* у разі успіху та ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 & o2``.

source: Returns the "bitwise exclusive or" of *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 ^ o2``.
uk: Повертає "порозрядне виняткове або" *o1* на *o2* у разі успіху або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 ^ o2``.

source: Returns the "bitwise or" of *o1* and *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 | o2``.
uk: Повертає "порозрядне або" *o1* і *o2* у разі успіху або ``NULL`` у разі помилки. Це еквівалент виразу Python ``o1 | o2``.

source: Returns the result of adding *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 += o2``.
uk: Повертає результат додавання *o1* і *o2* або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 += o2``.

source: Returns the result of subtracting *o2* from *o1*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 -= o2``.
uk: Повертає результат віднімання *o2* від *o1* або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 -= o2``.

source: Returns the result of multiplying *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 *= o2``.
uk: Повертає результат множення *o1* і *o2* або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 *= o2``.

source: Returns the result of matrix multiplication on *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 @= o2``.
uk: Повертає результат множення матриці на *o1* і *o2* або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 @= o2``.

source: Returns the mathematical floor of dividing *o1* by *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 //= o2``.
uk: Повертає математичний рівень ділення *o1* на *o2* або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 //= o2``.

source: Return a reasonable approximation for the mathematical value of *o1* divided by *o2*, or ``NULL`` on failure. The return value is "approximate" because binary floating point numbers are approximate; it is not possible to represent all real numbers in base two. This function can return a floating point value when passed two integers. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 /= o2``.
uk: Повертає прийнятне наближення для математичного значення *o1*, поділеного на *o2*, або ``NULL`` у разі помилки. Повернене значення є "приблизним", оскільки двійкові числа з плаваючою комою є приблизними; неможливо представити всі дійсні числа за основою два. Ця функція може повернути значення з плаваючою комою, коли передано два цілі числа. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 /= o2``.

source: Returns the remainder of dividing *o1* by *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 %= o2``.
uk: Повертає залишок від ділення *o1* на *o2* або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 %= o2``.

source: See the built-in function :func:`pow`. Returns ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 **= o2`` when o3 is :c:data:`Py_None`, or an in-place variant of ``pow(o1, o2, o3)`` otherwise. If *o3* is to be ignored, pass :c:data:`Py_None` in its place (passing ``NULL`` for *o3* would cause an illegal memory access).
uk: Перегляньте вбудовану функцію :func:`pow`. Повертає ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 **= o2``, коли o3 дорівнює :c:data:`Py_None`, або альтернативного варіанту ``pow(o1, o2, o3)`` інакше. Якщо *o3* потрібно ігнорувати, передайте замість нього :c:data:`Py_None` (передача ``NULL`` для *o3* призведе до незаконного доступу до пам’яті).

source: Returns the result of left shifting *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 <<= o2``.
uk: Повертає результат зсуву ліворуч *o1* на *o2* у разі успіху або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 <<= o2``.

source: Returns the result of right shifting *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 >>= o2``.
uk: Повертає результат зсуву праворуч *o1* на *o2* у разі успіху або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 >>= o2``.

source: Returns the "bitwise and" of *o1* and *o2* on success and ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 &= o2``.
uk: Повертає "порозрядне та" *o1* і *o2* у разі успіху та ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 &= o2``.

source: Returns the "bitwise exclusive or" of *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 ^= o2``.
uk: Повертає "порозрядне виняткове або" *o1* на *o2* у разі успіху або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 ^= o2``.

source: Returns the "bitwise or" of *o1* and *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 |= o2``.
uk: Повертає "порозрядне або" *o1* і *o2* у разі успіху або ``NULL`` у разі помилки. Операція виконується *на місці*, якщо *o1* її підтримує. Це еквівалент оператора Python ``o1 |= o2``.

source: Returns the *o* converted to an integer object on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``int(o)``.
uk: Повертає *o*, перетворений на цілий об’єкт у разі успіху, або ``NULL`` у разі помилки. Це еквівалент виразу Python ``int(o)``.

source: Returns the *o* converted to a float object on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``float(o)``.
uk: Повертає *o*, перетворений на об’єкт float у разі успіху, або ``NULL`` у разі помилки. Це еквівалент виразу Python ``float(o)``.

source: Returns the *o* converted to a Python int on success or ``NULL`` with a :exc:`TypeError` exception raised on failure.
uk: Повертає *o*, перетворений на Python int у разі успіху або ``NULL`` з виключенням :exc:`TypeError`, яке виникає в разі помилки.

source: The result always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``.
uk: Результат завжди має точний тип :class:`int`. Раніше результат міг бути екземпляром підкласу ``int``.

source: Returns the integer *n* converted to base *base* as a string. The *base* argument must be one of 2, 8, 10, or 16. For base 2, 8, or 16, the returned string is prefixed with a base marker of ``'0b'``, ``'0o'``, or ``'0x'``, respectively. If *n* is not a Python int, it is converted with :c:func:`PyNumber_Index` first.
uk: Повертає ціле число *n*, перетворене на базу *base* як рядок. Аргумент *base* має бути одним із 2, 8, 10 або 16. Для base 2, 8 або 16 повернутий рядок має префікс базового маркера ``'0b'``, ``'0o'`` або ``'0x''`` відповідно. Якщо *n* не є int Python, воно спочатку перетворюється за допомогою :c:func:`PyNumber_Index`.

source: Returns *o* converted to a :c:type:`Py_ssize_t` value if *o* can be interpreted as an integer. If the call fails, an exception is raised and ``-1`` is returned.
uk: Повертає *o*, перетворене на значення :c:type:`Py_ssize_t`, якщо *o* можна інтерпретувати як ціле число. Якщо виклик не вдається, виникає виняток і повертається ``-1``.

source: If *o* can be converted to a Python int but the attempt to convert to a :c:type:`Py_ssize_t` value would raise an :exc:`OverflowError`, then the *exc* argument is the type of exception that will be raised (usually :exc:`IndexError` or :exc:`OverflowError`). If *exc* is ``NULL``, then the exception is cleared and the value is clipped to ``PY_SSIZE_T_MIN`` for a negative integer or ``PY_SSIZE_T_MAX`` for a positive integer.
uk: Якщо *o* можна перетворити на Python int, але спроба перетворити на значення :c:type:`Py_ssize_t` призведе до появи :exc:`OverflowError`, тоді аргумент *exc* є типом винятку, який викличе бути викликано (зазвичай :exc:`IndexError` або :exc:`OverflowError`). Якщо *exc* дорівнює ``NULL``, тоді виняток очищається, а значення обрізається до ``PY_SSIZE_T_MIN`` для від’ємного цілого числа або ``PY_SSIZE_T_MAX`` для додатного цілого числа.

source: Returns ``1`` if *o* is an index integer (has the ``nb_index`` slot of the ``tp_as_number`` structure filled in), and ``0`` otherwise. This function always succeeds.
uk: Повертає ``1``, якщо *o* є цілим індексом (має заповнений слот ``nb_index`` структури ``tp_as_number``), і ``0`` інакше. Ця функція завжди успішна.
