Repository: python/python-docs-uk
Catalog: c-api/slice.po
Languages: uk

source: Slice Objects
uk: Об'єкти фрагментів

source: The type object for slice objects. This is the same as :class:`slice` in the Python layer.
uk: Об’єкт типу для об’єктів фрагмента. Це те саме, що :class:`slice` на рівні Python.

source: Return true if *ob* is a slice object; *ob* must not be ``NULL``. This function always succeeds.
uk: Повертає true, якщо *ob* є об’єктом фрагмента; *ob* не має бути ``NULL``. Ця функція завжди успішна.

source: Retrieve the start, stop and step indices from the slice object *slice*, assuming a sequence of length *length*. Treats indices greater than *length* as errors.
uk: Отримати індекси початку, зупинки та кроку з об’єкта фрагмента *slice*, припускаючи послідовність довжини *length*. Розглядає індекси, більші за *length*, як помилки.

source: You probably do not want to use this function.
uk: Ймовірно, ви не хочете використовувати цю функцію.

source: The parameter type for the *slice* parameter was ``PySliceObject*`` before.
uk: Раніше тип параметра для параметра *slice* був ``PySliceObject*``.

source: Usable replacement for :c:func:`PySlice_GetIndices`. Retrieve the start, stop, and step indices from the slice object *slice* assuming a sequence of length *length*, and store the length of the slice in *slicelength*. Out of bounds indices are clipped in a manner consistent with the handling of normal slices.
uk: Корисна заміна для :c:func:`PySlice_GetIndices`. Отримати індекси початку, зупинки та кроку з об’єкта фрагмента *slice*, припускаючи послідовність довжини *length*, і зберегти довжину фрагмента в *slicelength*. Індекси поза межами обрізаються таким чином, що відповідає обробці звичайних фрагментів.

source: This function is considered not safe for resizable sequences. Its invocation should be replaced by a combination of :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices` where ::
uk: Ця функція вважається небезпечною для послідовностей змінного розміру. Його виклик слід замінити комбінацією :c:func:`PySlice_Unpack` і :c:func:`PySlice_AdjustIndices`, де:

source: is replaced by ::
uk: замінюється на ::

source: If ``Py_LIMITED_API`` is not set or set to the value between ``0x03050400`` and ``0x03060000`` (not including) or ``0x03060100`` or higher :c:func:`!PySlice_GetIndicesEx` is implemented as a macro using :c:func:`!PySlice_Unpack` and :c:func:`!PySlice_AdjustIndices`. Arguments *start*, *stop* and *step* are evaluated more than once.
uk: Якщо ``Py_LIMITED_API`` не встановлено або встановлено значення між ``0x03050400`` і ``0x03060000`` (не включаючи) або ``0x03060100`` або вище :c:func:`!PySlice_GetIndicesEx` реалізовано як макрос із використанням :c:func:`!PySlice_Unpack` і :c:func:`!PySlice_AdjustIndices`. Аргументи *start*, *stop* і *step* обчислюються більше одного разу.

source: If ``Py_LIMITED_API`` is set to the value less than ``0x03050400`` or between ``0x03060000`` and ``0x03060100`` (not including) :c:func:`!PySlice_GetIndicesEx` is a deprecated function.
uk: Якщо для ``Py_LIMITED_API`` встановлено значення, менше ніж ``0x03050400`` або між ``0x03060000`` і ``0x03060100`` (не включаючи) :c:func:`!PySlice_GetIndicesEx` є застарілою функцією.

source: Extract the start, stop and step data members from a slice object as C integers. Silently reduce values larger than ``PY_SSIZE_T_MAX`` to ``PY_SSIZE_T_MAX``, silently boost the start and stop values less than ``PY_SSIZE_T_MIN`` to ``PY_SSIZE_T_MIN``, and silently boost the step values less than ``-PY_SSIZE_T_MAX`` to ``-PY_SSIZE_T_MAX``.
uk: Витягти елементи даних початку, зупинки та кроку з об’єкта зрізу як цілі числа C. Безшумне зменшення значень, що перевищують ``PY_SSIZE_T_MAX``, до ``PY_SSIZE_T_MAX``, миттєве підвищення початкових і кінцевих значень, менших за ``PY_SSIZE_T_MIN``, до ``PY_SSIZE_T_MIN``, і миттєве збільшення значень кроку, менших за ``-PY_SSIZE_T_MAX`` до ``-PY_SSIZE_T_MAX``.

source: Adjust start/end slice indices assuming a sequence of the specified length. Out of bounds indices are clipped in a manner consistent with the handling of normal slices.
uk: Налаштуйте початкові/кінцеві індекси фрагментів, припускаючи послідовність зазначеної довжини. Індекси поза межами обрізаються таким чином, що відповідає обробці звичайних фрагментів.

source: Return the length of the slice. Always successful. Doesn't call Python code.
uk: Повернути довжину зрізу. Завжди успішний. Не викликає код Python.

source: Ellipsis Object
uk: Еліпсис
