Repository: python/python-docs-uk
Catalog: c-api/stable.po
Languages: uk

source: C API Stability
uk: Стабільність C API

source: Python's C API is covered by the Backwards Compatibility Policy, :pep:`387`. While the C API will change with every minor release (e.g. from 3.9 to 3.10), most changes will be source-compatible, typically by only adding new API. Changing existing API or removing API is only done after a deprecation period or to fix serious issues.
uk: C API Python регулюється Політикою зворотної сумісності, :pep:`387`. Хоча C API змінюватиметься з кожним незначним випуском (наприклад, з 3.9 на 3.10), більшість змін будуть сумісними з вихідним кодом, як правило, шляхом додавання лише нового API. Зміна існуючого API або видалення API виконується лише після закінчення періоду застарілості або для вирішення серйозних проблем.

source: CPython's Application Binary Interface (ABI) is forward- and backwards-compatible across a minor release (if these are compiled the same way; see :ref:`stable-abi-platform` below). So, code compiled for Python 3.10.0 will work on 3.10.8 and vice versa, but will need to be compiled separately for 3.9.x and 3.10.x.
uk: Двійковий інтерфейс додатків (ABI) CPython є прямо- та зворотно сумісним у незначних випусках (якщо вони скомпільовані таким же чином; див. :ref:`stable-abi-platform` нижче). Отже, код, скомпільований для Python 3.10.0, працюватиме на 3.10.8 і навпаки, але його потрібно буде скомпілювати окремо для 3.9.x і 3.10.x.

source: Names prefixed by an underscore, such as ``_Py_InternalState``, are private API that can change without notice even in patch releases.
uk: Імена з префіксом підкреслення, як-от ``_Py_InternalState``, є приватним API, який можна змінювати без попередження навіть у випусках виправлень.

source: Stable Application Binary Interface
uk: Стабільний бінарний інтерфейс програми

source: Python 3.2 introduced the *Limited API*, a subset of Python's C API. Extensions that only use the Limited API can be compiled once and work with multiple versions of Python. Contents of the Limited API are :ref:`listed below <stable-abi-list>`.
uk: Python 3.2 представив *Limited API*, підмножину C API Python. Розширення, які використовують лише Limited API, можна скомпільувати один раз і працювати з кількома версіями Python. Вміст обмеженого API :ref:`наведено нижче <stable-abi-list>`.

source: To enable this, Python provides a *Stable ABI*: a set of symbols that will remain compatible across Python 3.x versions. The Stable ABI contains symbols exposed in the Limited API, but also other ones – for example, functions necessary to support older versions of the Limited API.
uk: Щоб увімкнути це, Python надає *Stable ABI*: набір символів, який залишатиметься сумісним у версіях Python 3.x. Стабільний ABI містить символи, доступні в Limited API, а також інші – наприклад, функції, необхідні для підтримки старіших версій Limited API.

source: (For simplicity, this document talks about *extensions*, but the Limited API and Stable ABI work the same way for all uses of the API – for example, embedding Python.)
uk: (Для простоти, у цьому документі йдеться про *розширення*, але Limited API і Stable ABI працюють однаково для всіх видів використання API – наприклад, для вбудовування Python.)

source: Define this macro before including ``Python.h`` to opt in to only use the Limited API, and to select the Limited API version.
uk: Визначте цей макрос, перш ніж включати ``Python.h``, щоб увімкнути використання лише обмеженого API та вибрати обмежену версію API.

source: Define ``Py_LIMITED_API`` to the value of :c:data:`PY_VERSION_HEX` corresponding to the lowest Python version your extension supports. The extension will work without recompilation with all Python 3 releases from the specified one onward, and can use Limited API introduced up to that version.
uk: Визначте для ``Py_LIMITED_API`` значення :c:data:`PY_VERSION_HEX`, що відповідає найстаршій версії Python, яку підтримує ваше розширення. Розширення працюватиме без перекомпіляції з усіма випусками Python 3, починаючи з зазначеного, і може використовувати обмежений API, представлений до цієї версії.

source: Rather than using the ``PY_VERSION_HEX`` macro directly, hardcode a minimum minor version (e.g. ``0x030A0000`` for Python 3.10) for stability when compiling with future Python versions.
uk: Замість безпосереднього використання макросу ``PY_VERSION_HEX`` жорстко закодуйте мінімальну проміжну версію (наприклад, ``0x030A0000`` для Python 3.10) для стабільності під час компіляції з майбутніми версіями Python.

source: You can also define ``Py_LIMITED_API`` to ``3``. This works the same as ``0x03020000`` (Python 3.2, the version that introduced Limited API).
uk: Ви також можете визначити ``Py_LIMITED_API`` як ``3``. Це працює так само, як ``0x03020000`` (Python 3.2, версія, яка представила Limited API).

source: On Windows, extensions that use the Stable ABI should be linked against ``python3.dll`` rather than a version-specific library such as ``python39.dll``.
uk: У Windows розширення, які використовують стабільний ABI, слід пов’язувати з ``python3.dll``, а не з бібліотекою для певної версії, такою як ``python39.dll``.

source: On some platforms, Python will look for and load shared library files named with the ``abi3`` tag (e.g. ``mymodule.abi3.so``). It does not check if such extensions conform to a Stable ABI. The user (or their packaging tools) need to ensure that, for example, extensions built with the 3.10+ Limited API are not installed for lower versions of Python.
uk: На деяких платформах Python шукатиме та завантажуватиме спільні бібліотечні файли, названі тегом ``abi3`` (наприклад, ``mymodule.abi3.so``). Він не перевіряє, чи такі розширення відповідають стабільному ABI. Користувач (або його інструменти пакування) повинні переконатися, що, наприклад, розширення, створені за допомогою обмеженого API 3.10+, не встановлено для нижчих версій Python.

source: All functions in the Stable ABI are present as functions in Python's shared library, not solely as macros. This makes them usable from languages that don't use the C preprocessor.
uk: Усі функції в Stable ABI присутні як функції в спільній бібліотеці Python, а не лише як макроси. Це робить їх придатними для використання з мов, які не використовують препроцесор C.

source: Limited API Scope and Performance
uk: Обмежений обсяг і продуктивність API

source: The goal for the Limited API is to allow everything that is possible with the full C API, but possibly with a performance penalty.
uk: Мета обмеженого API полягає в тому, щоб дозволити все, що можливо з повним API C, але, можливо, зі зниженням продуктивності.

source: For example, while :c:func:`PyList_GetItem` is available, its “unsafe” macro variant :c:func:`PyList_GET_ITEM` is not. The macro can be faster because it can rely on version-specific implementation details of the list object.
uk: Наприклад, хоча :c:func:`PyList_GetItem` доступний, його "небезпечний" варіант макросу :c:func:`PyList_GET_ITEM` ні. Макрос може бути швидшим, оскільки він може покладатися на специфічні для версії деталі реалізації об’єкта списку.

source: Without ``Py_LIMITED_API`` defined, some C API functions are inlined or replaced by macros. Defining ``Py_LIMITED_API`` disables this inlining, allowing stability as Python's data structures are improved, but possibly reducing performance.
uk: Без визначення ``Py_LIMITED_API`` деякі функції C API вбудовані або замінені макросами. Визначення ``Py_LIMITED_API`` вимикає це вбудовування, забезпечуючи стабільність у міру вдосконалення структур даних Python, але, можливо, знижуючи продуктивність.

source: By leaving out the ``Py_LIMITED_API`` definition, it is possible to compile a Limited API extension with a version-specific ABI. This can improve performance for that Python version, but will limit compatibility. Compiling with ``Py_LIMITED_API`` will then yield an extension that can be distributed where a version-specific one is not available – for example, for prereleases of an upcoming Python version.
uk: Виключивши визначення ``Py_LIMITED_API``, можна скомпілювати обмежене розширення API із спеціальним ABI для версії. Це може покращити продуктивність цієї версії Python, але обмежить сумісність. Компіляція за допомогою ``Py_LIMITED_API`` дасть розширення, яке можна розповсюджувати там, де недоступне розширення для конкретної версії – наприклад, для попередніх версій майбутньої версії Python.

source: Limited API Caveats
uk: Обмежені застереження щодо API

source: Note that compiling with ``Py_LIMITED_API`` is *not* a complete guarantee that code conforms to the Limited API or the Stable ABI. ``Py_LIMITED_API`` only covers definitions, but an API also includes other issues, such as expected semantics.
uk: Зауважте, що компіляція за допомогою ``Py_LIMITED_API`` *не* є повною гарантією того, що код відповідає Limited API або Stable ABI. ``Py_LIMITED_API`` охоплює лише визначення, але API також містить інші проблеми, такі як очікувана семантика.

source: One issue that ``Py_LIMITED_API`` does not guard against is calling a function with arguments that are invalid in a lower Python version. For example, consider a function that starts accepting ``NULL`` for an argument. In Python 3.9, ``NULL`` now selects a default behavior, but in Python 3.8, the argument will be used directly, causing a ``NULL`` dereference and crash. A similar argument works for fields of structs.
uk: Одна проблема, від якої ``Py_LIMITED_API`` не захищає, це виклик функції з аргументами, які недійсні в старішій версії Python. Наприклад, розглянемо функцію, яка починає приймати ``NULL`` для аргументу. У Python 3.9 ``NULL`` тепер вибирає поведінку за замовчуванням, але в Python 3.8 аргумент використовуватиметься безпосередньо, спричиняючи розіменування ``NULL`` і збій. Подібний аргумент працює для полів структур.

source: Another issue is that some struct fields are currently not hidden when ``Py_LIMITED_API`` is defined, even though they're part of the Limited API.
uk: Інша проблема полягає в тому, що деякі поля структури наразі не приховані, коли визначено ``Py_LIMITED_API``, навіть якщо вони є частиною обмеженого API.

source: For these reasons, we recommend testing an extension with *all* minor Python versions it supports, and preferably to build with the *lowest* such version.
uk: З цих причин ми рекомендуємо тестувати розширення з *усіма* проміжними версіями Python, які воно підтримує, і бажано створювати з *найнижчою* такою версією.

source: We also recommend reviewing documentation of all used API to check if it is explicitly part of the Limited API. Even with ``Py_LIMITED_API`` defined, a few private declarations are exposed for technical reasons (or even unintentionally, as bugs).
uk: Ми також рекомендуємо переглянути документацію щодо всіх використовуваних API, щоб перевірити, чи вони є частиною обмеженого API. Навіть якщо визначено ``Py_LIMITED_API``, кілька приватних заяв виявляються з технічних причин (або навіть ненавмисно, як помилки).

source: Also note that the Limited API is not necessarily stable: compiling with ``Py_LIMITED_API`` with Python 3.8 means that the extension will run with Python 3.12, but it will not necessarily *compile* with Python 3.12. In particular, parts of the Limited API may be deprecated and removed, provided that the Stable ABI stays stable.
uk: Також зауважте, що обмежений API не обов’язково є стабільним: компіляція за допомогою ``Py_LIMITED_API`` з Python 3.8 означає, що розширення працюватиме з Python 3.12, але воно не обов’язково *компілюється* з Python 3.12. Зокрема, частини обмеженого API можуть бути застарілими та видалені за умови, що стабільний ABI залишається стабільним.

source: Platform Considerations
uk: Розгляд платформи

source: ABI stability depends not only on Python, but also on the compiler used, lower-level libraries and compiler options. For the purposes of the Stable ABI, these details define a “platform”. They usually depend on the OS type and processor architecture
uk: Стабільність ABI залежить не тільки від Python, а й від використовуваного компілятора, бібліотек нижчого рівня та параметрів компілятора. Для цілей стабільного ABI ці деталі визначають "платформу". Зазвичай вони залежать від типу ОС і архітектури процесора

source: It is the responsibility of each particular distributor of Python to ensure that all Python versions on a particular platform are built in a way that does not break the Stable ABI. This is the case with Windows and macOS releases from ``python.org`` and many third-party distributors.
uk: Кожен окремий розповсюджувач Python несе відповідальність за те, щоб усі версії Python на певній платформі створювалися таким чином, щоб не порушувати стабільний ABI. Це стосується випусків Windows і macOS від ``python.org`` і багатьох сторонніх розповсюджувачів.

source: Contents of Limited API
uk: Вміст обмеженого API

source: Currently, the Limited API includes the following items:
uk: Наразі Limited API містить такі елементи:
