Repository: python/python-docs-uk
Catalog: c-api/structures.po
Languages: uk

source: Common Object Structures
uk: Загальні структури об'єктів

source: There are a large number of structures which are used in the definition of object types for Python. This section describes these structures and how they are used.
uk: Існує велика кількість структур, які використовуються для визначення типів об’єктів для Python. У цьому розділі описано ці структури та як вони використовуються.

source: Base object types and macros
uk: Базові типи об'єктів і макроси

source: All Python objects ultimately share a small number of fields at the beginning of the object's representation in memory. These are represented by the :c:type:`PyObject` and :c:type:`PyVarObject` types, which are defined, in turn, by the expansions of some macros also used, whether directly or indirectly, in the definition of all other Python objects.
uk: Зрештою, усі об’єкти Python мають спільну невелику кількість полів на початку представлення об’єкта в пам’яті. Вони представлені типами :c:type:`PyObject` і :c:type:`PyVarObject`, які, у свою чергу, визначаються розширеннями деяких макросів, які також використовуються, прямо чи опосередковано, у визначенні всіх інші об’єкти Python.

source: All object types are extensions of this type. This is a type which contains the information Python needs to treat a pointer to an object as an object. In a normal "release" build, it contains only the object's reference count and a pointer to the corresponding type object. Nothing is actually declared to be a :c:type:`PyObject`, but every pointer to a Python object can be cast to a :c:type:`PyObject*`. Access to the members must be done by using the macros :c:macro:`Py_REFCNT` and :c:macro:`Py_TYPE`.
uk: Усі типи об’єктів є розширеннями цього типу. Це тип, який містить інформацію, необхідну Python, щоб розглядати покажчик на об’єкт як об’єкт. У звичайній "релізній" збірці він містить лише кількість посилань на об’єкт і вказівник на об’єкт відповідного типу. Насправді нічого не оголошено як :c:type:`PyObject`, але кожен вказівник на об’єкт Python може бути приведений до :c:type:`PyObject*`. Доступ до учасників має здійснюватися за допомогою макросів :c:macro:`Py_REFCNT` і :c:macro:`Py_TYPE`.

source: This is an extension of :c:type:`PyObject` that adds the :attr:`ob_size` field. This is only used for objects that have some notion of *length*. This type does not often appear in the Python/C API. Access to the members must be done by using the macros :c:macro:`Py_REFCNT`, :c:macro:`Py_TYPE`, and :c:macro:`Py_SIZE`.
uk: Це розширення :c:type:`PyObject`, яке додає поле :attr:`ob_size`. Це використовується лише для об’єктів, які мають деяке поняття *довжини*. Цей тип не часто зустрічається в Python/C API. Доступ до учасників має здійснюватися за допомогою макросів :c:macro:`Py_REFCNT`, :c:macro:`Py_TYPE` і :c:macro:`Py_SIZE`.

source: This is a macro used when declaring new types which represent objects without a varying length. The PyObject_HEAD macro expands to::
uk: Це макрос, який використовується під час оголошення нових типів, які представляють об’єкти без змінної довжини. Макрос PyObject_HEAD розширюється до:

source: See documentation of :c:type:`PyObject` above.
uk: Перегляньте документацію :c:type:`PyObject` вище.

source: This is a macro used when declaring new types which represent objects with a length that varies from instance to instance. The PyObject_VAR_HEAD macro expands to::
uk: Це макрос, який використовується під час оголошення нових типів, які представляють об’єкти з довжиною, що змінюється від екземпляра до екземпляра. Макрос PyObject_VAR_HEAD розширюється до:

source: See documentation of :c:type:`PyVarObject` above.
uk: Перегляньте документацію :c:type:`PyVarObject` вище.

source: Test if the *x* object is the *y* object, the same as ``x is y`` in Python.
uk: Перевірте, чи є об’єкт *x* об’єктом *y*, так само як "x є y" в Python.

source: Test if an object is the ``None`` singleton, the same as ``x is None`` in Python.
uk: Перевірте, чи є об’єкт єдиним елементом ``None``, так само як ``x is None`` у Python.

source: Test if an object is the ``True`` singleton, the same as ``x is True`` in Python.
uk: Перевірте, чи є об’єкт єдиним елементом ``True``, так само, як ``x is True`` у Python.

source: Test if an object is the ``False`` singleton, the same as ``x is False`` in Python.
uk: Перевірте, чи є об’єкт синглетом ``False``, так само, як ``x is False`` у Python.

source: Get the type of the Python object *o*.
uk: Отримайте тип об'єкта Python *o*.

source: Return a :term:`borrowed reference`.
uk: Повертає :term:`borrowed reference`.

source: Return non-zero if the object *o* type is *type*. Return zero otherwise. Equivalent to: ``Py_TYPE(o) == type``.
uk: Повертає ненульове значення, якщо тип об’єкта *o* є *type*. Інакше поверніть нуль. Еквівалент: ``Py_TYPE(o) == type``.

source: Set the object *o* type to *type*.
uk: Встановіть тип об’єкта *o* на *type*.

source: Get the reference count of the Python object *o*.
uk: Отримати кількість посилань на об’єкт Python *o*.

source: Set the object *o* reference counter to *refcnt*.
uk: Встановіть лічильник посилань *o* на *refcnt*.

source: Get the size of the Python object *o*.
uk: Отримайте розмір об'єкта Python *o*.

source: Set the object *o* size to *size*.
uk: Встановіть розмір об’єкта *o* на *size*.

source: This is a macro which expands to initialization values for a new :c:type:`PyObject` type. This macro expands to::
uk: Це макрос, який розширюється до значень ініціалізації для нового типу :c:type:`PyObject`. Цей макрос розширюється до:

source: This is a macro which expands to initialization values for a new :c:type:`PyVarObject` type, including the :attr:`ob_size` field. This macro expands to::
uk: Це макрос, який розширюється до значень ініціалізації для нового типу :c:type:`PyVarObject`, включаючи поле :attr:`ob_size`. Цей макрос розширюється до:

source: Implementing functions and methods
uk: Реалізація функцій і методів

source: Type of the functions used to implement most Python callables in C. Functions of this type take two :c:type:`PyObject*` parameters and return one such value. If the return value is ``NULL``, an exception shall have been set. If not ``NULL``, the return value is interpreted as the return value of the function as exposed in Python. The function must return a new reference.
uk: Тип функцій, які використовуються для реалізації більшості викликів Python у C. Функції цього типу приймають два параметри :c:type:`PyObject*` і повертають одне таке значення. Якщо повертається значення ``NULL``, має бути встановлено виняток. Якщо не ``NULL``, повернене значення інтерпретується як повернене значення функції, представлене в Python. Функція має повертати нове посилання.

source: The function signature is::
uk: Сигнатура функції:

source: Type of the functions used to implement Python callables in C with signature :const:`METH_VARARGS | METH_KEYWORDS`. The function signature is::
uk: Тип функцій, які використовуються для реалізації викликів Python у C із підписом :const:`METH_VARARGS | METH_KEYWORDS`. Сигнатура функції:

source: Type of the functions used to implement Python callables in C with signature :const:`METH_FASTCALL`. The function signature is::
uk: Тип функцій, які використовуються для реалізації викликів Python у C із підписом :const:`METH_FASTCALL`. Сигнатура функції:

source: Type of the functions used to implement Python callables in C with signature :const:`METH_FASTCALL | METH_KEYWORDS`. The function signature is::
uk: Тип функцій, які використовуються для реалізації викликів Python у C із підписом :const:`METH_FASTCALL | METH_KEYWORDS`. Сигнатура функції:

source: Type of the functions used to implement Python callables in C with signature :const:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS`. The function signature is::
uk: Тип функцій, які використовуються для реалізації викликів Python у C із підписом :const:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS`. Сигнатура функції:

source: Structure used to describe a method of an extension type. This structure has four fields:
uk: Структура, що використовується для опису методу типу розширення. Ця структура має чотири поля:

source: Field
uk: Поле

source: C Type
uk: C Тип

source: Meaning
uk: Значення

source: name of the method
uk: назва методу

source: pointer to the C implementation
uk: покажчик на реалізацію C

source: int
uk: внутр

source: flag bits indicating how the call should be constructed
uk: біти прапорців, що вказують, як має бути побудований виклик

source: points to the contents of the docstring
uk: вказує на вміст рядка документації

source: The :attr:`ml_meth` is a C function pointer. The functions may be of different types, but they always return :c:type:`PyObject*`. If the function is not of the :c:type:`PyCFunction`, the compiler will require a cast in the method table. Even though :c:type:`PyCFunction` defines the first parameter as :c:type:`PyObject*`, it is common that the method implementation uses the specific C type of the *self* object.
uk: :attr:`ml_meth` — це покажчик на функцію C. Функції можуть бути різних типів, але вони завжди повертають :c:type:`PyObject*`. Якщо функція не є :c:type:`PyCFunction`, компілятор вимагатиме приведення в таблиці методів. Незважаючи на те, що :c:type:`PyCFunction` визначає перший параметр як :c:type:`PyObject*`, зазвичай у реалізації методу використовується конкретний тип C об’єкта *self*.

source: The :attr:`ml_flags` field is a bitfield which can include the following flags. The individual flags indicate either a calling convention or a binding convention.
uk: Поле :attr:`ml_flags` — це бітове поле, яке може містити наступні прапорці. Окремі прапорці вказують або на угоду про виклик, або на прив’язувальну угоду.

source: There are these calling conventions:
uk: Існують такі умови виклику:

source: This is the typical calling convention, where the methods have the type :c:type:`PyCFunction`. The function expects two :c:type:`PyObject*` values. The first one is the *self* object for methods; for module functions, it is the module object. The second parameter (often called *args*) is a tuple object representing all arguments. This parameter is typically processed using :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_UnpackTuple`.
uk: Це типова угода про виклики, де методи мають тип :c:type:`PyCFunction`. Функція очікує два значення :c:type:`PyObject*`. Перший — об’єкт *self* для методів; для функцій модуля це об’єкт модуля. Другий параметр (часто званий *args*) — це об’єкт кортежу, що представляє всі аргументи. Цей параметр зазвичай обробляється за допомогою :c:func:`PyArg_ParseTuple` або :c:func:`PyArg_UnpackTuple`.

source: Methods with these flags must be of type :c:type:`PyCFunctionWithKeywords`. The function expects three parameters: *self*, *args*, *kwargs* where *kwargs* is a dictionary of all the keyword arguments or possibly ``NULL`` if there are no keyword arguments. The parameters are typically processed using :c:func:`PyArg_ParseTupleAndKeywords`.
uk: Методи з цими прапорцями мають бути типу :c:type:`PyCFunctionWithKeywords`. Функція очікує три параметри: *self*, *args*, *kwargs*, де *kwargs* є словником усіх аргументів ключового слова або, можливо, ``NULL``, якщо аргументів ключового слова немає. Параметри зазвичай обробляються за допомогою :c:func:`PyArg_ParseTupleAndKeywords`.

source: Fast calling convention supporting only positional arguments. The methods have the type :c:type:`_PyCFunctionFast`. The first parameter is *self*, the second parameter is a C array of :c:type:`PyObject*` values indicating the arguments and the third parameter is the number of arguments (the length of the array).
uk: Правила швидкого виклику, які підтримують лише позиційні аргументи. Методи мають тип :c:type:`_PyCFunctionFast`. Перший параметр — *self*, другий параметр — це масив C значень :c:type:`PyObject*`, що вказує на аргументи, а третій параметр — це кількість аргументів (довжина масиву).

source: ``METH_FASTCALL`` is now part of the stable ABI.
uk: ``METH_FASTCALL`` тепер є частиною стабільного ABI.

source: Extension of :const:`METH_FASTCALL` supporting also keyword arguments, with methods of type :c:type:`_PyCFunctionFastWithKeywords`. Keyword arguments are passed the same way as in the :ref:`vectorcall protocol <vectorcall>`: there is an additional fourth :c:type:`PyObject*` parameter which is a tuple representing the names of the keyword arguments (which are guaranteed to be strings) or possibly ``NULL`` if there are no keywords. The values of the keyword arguments are stored in the *args* array, after the positional arguments.
uk: Розширення :const:`METH_FASTCALL`, що також підтримує ключові аргументи з методами типу :c:type:`_PyCFunctionFastWithKeywords`. Аргументи ключових слів передаються так само, як у протоколі :ref:`vectorcall <vectorcall>`: є додатковий четвертий параметр :c:type:`PyObject*`, який є кортежем, що представляє імена аргументів ключових слів (які гарантовано бути рядками) або, можливо, ``NULL``, якщо немає ключових слів. Значення аргументів ключових слів зберігаються в масиві *args* після позиційних аргументів.

source: Extension of :const:`METH_FASTCALL | METH_KEYWORDS` supporting the *defining class*, that is, the class that contains the method in question. The defining class might be a superclass of ``Py_TYPE(self)``.
uk: Розширення :const:`METH_FASTCALL | METH_KEYWORDS`, що підтримує *визначальний клас*, тобто клас, який містить відповідний метод. Визначальним класом може бути суперклас ``Py_TYPE(self)``.

source: The method needs to be of type :c:type:`PyCMethod`, the same as for ``METH_FASTCALL | METH_KEYWORDS`` with ``defining_class`` argument added after ``self``.
uk: Метод має мати тип :c:type:`PyCMethod`, такий самий, як і для ``METH_FASTCALL | METH_KEYWORDS`` з аргументом ``defining_class``, доданим після ``self``.

source: Methods without parameters don't need to check whether arguments are given if they are listed with the :const:`METH_NOARGS` flag. They need to be of type :c:type:`PyCFunction`. The first parameter is typically named *self* and will hold a reference to the module or object instance. In all cases the second parameter will be ``NULL``.
uk: Методам без параметрів не потрібно перевіряти, чи надано аргументи, якщо вони вказані з прапорцем :const:`METH_NOARGS`. Вони мають бути типу :c:type:`PyCFunction`. Перший параметр зазвичай називається *self* і містить посилання на екземпляр модуля або об’єкта. У всіх випадках другий параметр буде ``NULL``.

source: Methods with a single object argument can be listed with the :const:`METH_O` flag, instead of invoking :c:func:`PyArg_ParseTuple` with a ``"O"`` argument. They have the type :c:type:`PyCFunction`, with the *self* parameter, and a :c:type:`PyObject*` parameter representing the single argument.
uk: Методи з одним аргументом об’єкта можна вказати з прапорцем :const:`METH_O` замість виклику :c:func:`PyArg_ParseTuple` з аргументом ``"O"``. Вони мають тип :c:type:`PyCFunction` з параметром *self* і параметром :c:type:`PyObject*`, що представляє єдиний аргумент.

source: These two constants are not used to indicate the calling convention but the binding when use with methods of classes. These may not be used for functions defined for modules. At most one of these flags may be set for any given method.
uk: Ці дві константи не використовуються для вказівки умов виклику, а для прив’язки під час використання з методами класів. Їх не можна використовувати для функцій, визначених для модулів. Щонайбільше один із цих прапорів може бути встановлений для будь-якого методу.

source: The method will be passed the type object as the first parameter rather than an instance of the type. This is used to create *class methods*, similar to what is created when using the :func:`classmethod` built-in function.
uk: Методу буде передано об’єкт типу як перший параметр, а не екземпляр типу. Це використовується для створення *методів класу*, подібних до того, що створюється під час використання вбудованої функції :func:`classmethod`.

source: The method will be passed ``NULL`` as the first parameter rather than an instance of the type. This is used to create *static methods*, similar to what is created when using the :func:`staticmethod` built-in function.
uk: Методу буде передано ``NULL`` як перший параметр, а не екземпляр типу. Це використовується для створення *статичних методів*, подібних до того, що створюється під час використання вбудованої функції :func:`staticmethod`.

source: One other constant controls whether a method is loaded in place of another definition with the same method name.
uk: Ще одна константа контролює, чи завантажується метод замість іншого визначення з таким же ім’ям методу.

source: The method will be loaded in place of existing definitions. Without *METH_COEXIST*, the default is to skip repeated definitions. Since slot wrappers are loaded before the method table, the existence of a *sq_contains* slot, for example, would generate a wrapped method named :meth:`__contains__` and preclude the loading of a corresponding PyCFunction with the same name. With the flag defined, the PyCFunction will be loaded in place of the wrapper object and will co-exist with the slot. This is helpful because calls to PyCFunctions are optimized more than wrapper object calls.
uk: Метод буде завантажено замість існуючих визначень. Без *METH_COEXIST* за замовчуванням повторювані визначення пропускаються. Оскільки обгортки слотів завантажуються перед таблицею методів, існування слота *sq_contains*, наприклад, створить обернутий метод під назвою :meth:`__contains__` і завадить завантаженню відповідної функції PyCFunction з такою ж назвою. З визначеним прапором PyCFunction буде завантажено замість об’єкта-огортки та співіснуватиме зі слотом. Це корисно, оскільки виклики PyCFunctions оптимізовані більше, ніж виклики об’єктів-огорток.

source: Accessing attributes of extension types
uk: Доступ до атрибутів типів розширень

source: Structure which describes an attribute of a type which corresponds to a C struct member. Its fields are:
uk: Структура, яка описує атрибут типу, який відповідає члену структури C. Його поля:

source: name of the member
uk: ім'я учасника

source: the type of the member in the C struct
uk: тип члена в структурі C

source: the offset in bytes that the member is located on the type's object struct
uk: зсув у байтах, що член розташований у структурі об’єкта типу

source: flag bits indicating if the field should be read-only or writable
uk: біти прапорців, які вказують, чи має поле бути доступним лише для читання чи доступним для запису

source: :attr:`!type` can be one of many ``T_`` macros corresponding to various C types. When the member is accessed in Python, it will be converted to the equivalent Python type.
uk: :attr:`!type` може бути одним із багатьох макросів ``T_``, що відповідають різним типам C. Коли до елемента звертаються в Python, його буде перетворено на еквівалентний тип Python.

source: Macro name
uk: Назва макросу

source: C type
uk: тип С

source: short
uk: короткий

source: long
uk: довгота

source: float
uk: плавати

source: double
uk: подвійний

source: unsigned char
uk: беззнаковий символ

source: unsigned short
uk: непідписаний короткий

source: unsigned long
uk: беззнаковий довгий

source: long long
uk: довгий довгий

source: unsigned long long
uk: без знака довгий довгий

source: :c:macro:`T_OBJECT` and :c:macro:`T_OBJECT_EX` differ in that :c:macro:`T_OBJECT` returns ``None`` if the member is ``NULL`` and :c:macro:`T_OBJECT_EX` raises an :exc:`AttributeError`. Try to use :c:macro:`T_OBJECT_EX` over :c:macro:`T_OBJECT` because :c:macro:`T_OBJECT_EX` handles use of the :keyword:`del` statement on that attribute more correctly than :c:macro:`T_OBJECT`.
uk: :c:macro:`T_OBJECT` і :c:macro:`T_OBJECT_EX` відрізняються тим, що :c:macro:`T_OBJECT` повертає ``None``, якщо член має значення ``NULL`` і :c:macro:`T_OBJECT_EX` викликає :exc:`AttributeError`. Спробуйте використовувати :c:macro:`T_OBJECT_EX` замість :c:macro:`T_OBJECT`, оскільки :c:macro:`T_OBJECT_EX` обробляє використання оператора :keyword:`del` для цього атрибута правильніше, ніж :c:macro:`T_OBJECT`.

source: :attr:`flags` can be ``0`` for write and read access or :c:macro:`READONLY` for read-only access. Using :c:macro:`T_STRING` for :attr:`type` implies :c:macro:`READONLY`. :c:macro:`T_STRING` data is interpreted as UTF-8. Only :c:macro:`T_OBJECT` and :c:macro:`T_OBJECT_EX` members can be deleted. (They are set to ``NULL``).
uk: :attr:`flags` може мати значення ``0`` для доступу до запису та читання або :c:macro:`READONLY` для доступу лише для читання. Використання :c:macro:`T_STRING` для :attr:`type` означає :c:macro:`READONLY`. Дані :c:macro:`T_STRING` інтерпретуються як UTF-8. Можна видалити лише учасників :c:macro:`T_OBJECT` і :c:macro:`T_OBJECT_EX`. (Їм встановлено значення ``NULL``).

source: Heap allocated types (created using :c:func:`PyType_FromSpec` or similar), ``PyMemberDef`` may contain definitions for the special members ``__dictoffset__``, ``__weaklistoffset__`` and ``__vectorcalloffset__``, corresponding to :c:member:`~PyTypeObject.tp_dictoffset`, :c:member:`~PyTypeObject.tp_weaklistoffset` and :c:member:`~PyTypeObject.tp_vectorcall_offset` in type objects. These must be defined with ``T_PYSSIZET`` and ``READONLY``, for example::
uk: Виділені типи купи (створені за допомогою :c:func:`PyType_FromSpec` або подібного), ``PyMemberDef`` може містити визначення для спеціальних членів ``__dictoffset__``, ``__weaklistoffset__`` та ``__vectorcalloffset__``, що відповідають :c:member:`~PyTypeObject.tp_dictoffset`, :c:member:`~PyTypeObject.tp_weaklistoffset` і :c:member:`~PyTypeObject.tp_vectorcall_offset` в об’єктах типу. Їх потрібно визначити за допомогою ``T_PYSSIZET`` і ``READONLY``, наприклад:

source: Get an attribute belonging to the object at address *obj_addr*. The attribute is described by ``PyMemberDef`` *m*. Returns ``NULL`` on error.
uk: Отримати атрибут, що належить об’єкту за адресою *obj_addr*. Атрибут описується ``PyMemberDef`` *m*. Повертає ``NULL`` у разі помилки.

source: Set an attribute belonging to the object at address *obj_addr* to object *o*. The attribute to set is described by ``PyMemberDef`` *m*. Returns ``0`` if successful and a negative value on failure.
uk: Установіть атрибут, що належить об’єкту за адресою *obj_addr*, на об’єкт *o*. Атрибут, який потрібно встановити, описується ``PyMemberDef`` *m*. Повертає ``0`` у разі успіху та від'ємне значення у випадку невдачі.

source: Structure to define property-like access for a type. See also description of the :c:member:`PyTypeObject.tp_getset` slot.
uk: Структура для визначення доступу типу властивості. Дивіться також опис слота :c:member:`PyTypeObject.tp_getset`.

source: name
uk: назва

source: attribute name
uk: назва атрибута

source: get
uk: отримати

source: getter
uk: добувач

source: C function to get the attribute
uk: Функція C для отримання атрибута

source: set
uk: встановити

source: setter
uk: сетер

source: optional C function to set or delete the attribute, if omitted the attribute is readonly
uk: необов'язкова функція C для встановлення або видалення атрибута, якщо не вказана, атрибут доступний лише для читання

source: doc
uk: док

source: optional docstring
uk: додатковий рядок документації

source: closure
uk: закриття

source: void \*
uk: порожній \*

source: optional function pointer, providing additional data for getter and setter
uk: додатковий покажчик функції, що надає додаткові дані для геттера та сеттера

source: The ``get`` function takes one :c:type:`PyObject*` parameter (the instance) and a function pointer (the associated ``closure``)::
uk: Функція ``get`` приймає один параметр :c:type:`PyObject*` (екземпляр) і покажчик на функцію (пов’язане ``closure``)::
