Repository: python/python-docs-uk
Catalog: c-api/structures.po
Languages: uk

source: It should return a new reference on success or ``NULL`` with a set exception on failure.
uk: Він повинен повертати нове посилання в разі успіху або ``NULL`` із встановленим винятком у випадку невдачі.

source: ``set`` functions take two :c:type:`PyObject*` parameters (the instance and the value to be set) and a function pointer (the associated ``closure``)::
uk: Функції ``set`` приймають два параметри :c:type:`PyObject*` (екземпляр і значення, яке потрібно встановити) і покажчик на функцію (пов’язане ``closure``)::

source: In case the attribute should be deleted the second parameter is ``NULL``. Should return ``0`` on success or ``-1`` with a set exception on failure.
uk: У випадку, якщо атрибут потрібно видалити, другим параметром є ``NULL``. Має повертати ``0`` у разі успіху або ``-1`` із встановленим винятком у випадку невдачі.
