Repository: python/python-docs-uk
Catalog: c-api/sys.po
Languages: uk

source: Print a fatal error message and kill the process. No cleanup is performed. This function should only be invoked when a condition is detected that would make it dangerous to continue using the Python interpreter; e.g., when the object administration appears to be corrupted. On Unix, the standard C library function :c:func:`abort` is called which will attempt to produce a :file:`core` file.
uk: Надрукуйте повідомлення про фатальну помилку та завершіть процес. Очищення не виконується. Цю функцію слід викликати лише тоді, коли виявлено стан, який може зробити небезпечним продовження використання інтерпретатора Python; наприклад, коли адміністрування об’єкта виглядає пошкодженим. В Unix викликається стандартна функція бібліотеки C :c:func:`abort`, яка намагатиметься створити файл :file:`core`.

source: The ``Py_FatalError()`` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined.
uk: Функцію ``Py_FatalError()`` замінено макросом, який автоматично реєструє назву поточної функції, якщо не визначено макрос ``Py_LIMITED_API``.

source: Log the function name automatically.
uk: Автоматично реєструйте назву функції.

source: Exit the current process. This calls :c:func:`Py_FinalizeEx` and then calls the standard C library function ``exit(status)``. If :c:func:`Py_FinalizeEx` indicates an error, the exit status is set to 120.
uk: Вийти з поточного процесу. Це викликає :c:func:`Py_FinalizeEx`, а потім викликає стандартну функцію бібліотеки C ``exit(status)``. Якщо :c:func:`Py_FinalizeEx` вказує на помилку, статус виходу встановлюється на 120.

source: Errors from finalization no longer ignored.
uk: Помилки під час фіналізації більше не ігноруються.

source: Register a cleanup function to be called by :c:func:`Py_FinalizeEx`. The cleanup function will be called with no arguments and should return no value. At most 32 cleanup functions can be registered. When the registration is successful, :c:func:`Py_AtExit` returns ``0``; on failure, it returns ``-1``. The cleanup function registered last is called first. Each cleanup function will be called at most once. Since Python's internal finalization will have completed before the cleanup function, no Python APIs should be called by *func*.
uk: Зареєструйте функцію очищення, яку буде викликати :c:func:`Py_FinalizeEx`. Функція очищення буде викликана без аргументів і не повинна повертати значення. Можна зареєструвати щонайбільше 32 функції очищення. Після успішної реєстрації :c:func:`Py_AtExit` повертає ``0``; у разі помилки повертає ``-1``. Першою викликається функція очищення, зареєстрована останньою. Кожна функція очищення буде викликана щонайбільше один раз. Оскільки внутрішня фіналізація Python буде завершена до виконання функції очищення, жодні API Python не повинні викликатися за допомогою *func*.
