Repository: python/python-docs-uk
Catalog: c-api/tuple.po
Languages: uk

source: Tuple Objects
uk: Кортежні об'єкти

source: This subtype of :c:type:`PyObject` represents a Python tuple object.
uk: Цей підтип :c:type:`PyObject` представляє об’єкт кортежу Python.

source: This instance of :c:type:`PyTypeObject` represents the Python tuple type; it is the same object as :class:`tuple` in the Python layer.
uk: Цей екземпляр :c:type:`PyTypeObject` представляє тип кортежу Python; це той самий об’єкт, що й :class:`tuple` на рівні Python.

source: Return true if *p* is a tuple object or an instance of a subtype of the tuple type. This function always succeeds.
uk: Повертає true, якщо *p* є об’єктом кортежу або екземпляром підтипу типу кортежу. Ця функція завжди успішна.

source: Return true if *p* is a tuple object, but not an instance of a subtype of the tuple type. This function always succeeds.
uk: Повертає true, якщо *p* є об’єктом кортежу, але не екземпляром підтипу типу кортежу. Ця функція завжди успішна.

source: Return a new tuple object of size *len*, or ``NULL`` on failure.
uk: Повертає новий об’єкт кортежу розміром *len* або ``NULL`` у разі помилки.

source: Return a new tuple object of size *n*, or ``NULL`` on failure. The tuple values are initialized to the subsequent *n* C arguments pointing to Python objects. ``PyTuple_Pack(2, a, b)`` is equivalent to ``Py_BuildValue("(OO)", a, b)``.
uk: Повертає новий об’єкт кортежу розміром *n* або ``NULL`` у разі помилки. Значення кортежу ініціалізуються наступними *n* аргументами C, що вказують на об’єкти Python. ``PyTuple_Pack(2, a, b)`` еквівалентний ``Py_BuildValue("(OO)", a, b)``.

source: Take a pointer to a tuple object, and return the size of that tuple.
uk: Візьміть вказівник на об’єкт кортежу та поверніть розмір цього кортежу.

source: Return the size of the tuple *p*, which must be non-``NULL`` and point to a tuple; no error checking is performed.
uk: Повертає розмір кортежу *p*, який має бути відмінним від ``NULL`` і вказувати на кортеж; перевірка помилок не виконується.

source: Return the object at position *pos* in the tuple pointed to by *p*. If *pos* is negative or out of bounds, return ``NULL`` and set an :exc:`IndexError` exception.
uk: Повертає об’єкт у позицію *pos* у кортежі, на який вказує *p*. Якщо *pos* є негативним або виходить за межі, поверніть ``NULL`` і встановіть виняток :exc:`IndexError`.

source: Like :c:func:`PyTuple_GetItem`, but does no checking of its arguments.
uk: Як :c:func:`PyTuple_GetItem`, але не перевіряє його аргументи.

source: Return the slice of the tuple pointed to by *p* between *low* and *high*, or ``NULL`` on failure. This is the equivalent of the Python expression ``p[low:high]``. Indexing from the end of the list is not supported.
uk: Повертає фрагмент кортежу, на який вказує *p*, між *low* і *high* або ``NULL`` у разі помилки. Це еквівалент виразу Python ``p[low:high]``. Індексація з кінця списку не підтримується.

source: Insert a reference to object *o* at position *pos* of the tuple pointed to by *p*. Return ``0`` on success. If *pos* is out of bounds, return ``-1`` and set an :exc:`IndexError` exception.
uk: Вставте посилання на об’єкт *o* у позиції *pos* кортежу, на який вказує *p*. У разі успіху повертає ``0``. Якщо *pos* виходить за межі, поверніть ``-1`` і встановіть виняток :exc:`IndexError`.

source: This function "steals" a reference to *o* and discards a reference to an item already in the tuple at the affected position.
uk: Ця функція "викрадає" посилання на *o* та відкидає посилання на елемент, який уже міститься в кортежі в ураженій позиції.

source: Like :c:func:`PyTuple_SetItem`, but does no error checking, and should *only* be used to fill in brand new tuples.
uk: Подібно до :c:func:`PyTuple_SetItem`, але не перевіряє помилки, і його слід використовувати *лише* для заповнення абсолютно нових кортежів.

source: Can be used to resize a tuple. *newsize* will be the new length of the tuple. Because tuples are *supposed* to be immutable, this should only be used if there is only one reference to the object. Do *not* use this if the tuple may already be known to some other part of the code. The tuple will always grow or shrink at the end. Think of this as destroying the old tuple and creating a new one, only more efficiently. Returns ``0`` on success. Client code should never assume that the resulting value of ``*p`` will be the same as before calling this function. If the object referenced by ``*p`` is replaced, the original ``*p`` is destroyed. On failure, returns ``-1`` and sets ``*p`` to ``NULL``, and raises :exc:`MemoryError` or :exc:`SystemError`.
uk: Можна використовувати для зміни розміру кортежу. *newsize* буде новою довжиною кортежу. Оскільки кортежі *вважаються* незмінними, це слід використовувати, лише якщо є лише одне посилання на об’єкт. *Не* використовуйте це, якщо кортеж може бути вже відомий іншій частині коду. Кортеж завжди зростатиме або зменшуватиметься в кінці. Думайте про це як про знищення старого кортежу та створення нового, але більш ефективного. У разі успіху повертає ``0``. Клієнтський код ніколи не повинен вважати, що результуюче значення ``*p`` буде таким самим, як і до виклику цієї функції. Якщо об’єкт, на який посилається ``*p``, замінюється, оригінальний ``*p`` знищується. У разі помилки повертає ``-1`` і встановлює ``*p`` значення ``NULL`` і викликає :exc:`MemoryError` або :exc:`SystemError`.

source: Struct Sequence Objects
uk: Структуруйте об’єкти послідовності

source: Struct sequence objects are the C equivalent of :func:`~collections.namedtuple` objects, i.e. a sequence whose items can also be accessed through attributes. To create a struct sequence, you first have to create a specific struct sequence type.
uk: Об’єкти послідовності структур є еквівалентом C об’єктів :func:`~collections.namedtuple`, тобто послідовності, до елементів якої також можна отримати доступ через атрибути. Щоб створити послідовність структур, спочатку потрібно створити певний тип послідовності структур.

source: Create a new struct sequence type from the data in *desc*, described below. Instances of the resulting type can be created with :c:func:`PyStructSequence_New`.
uk: Створіть новий тип послідовності структур із даних у *desc*, як описано нижче. Екземпляри отриманого типу можна створити за допомогою :c:func:`PyStructSequence_New`.

source: Initializes a struct sequence type *type* from *desc* in place.
uk: Ініціалізує структурну послідовність типу *type* з *desc* на місці.

source: The same as ``PyStructSequence_InitType``, but returns ``0`` on success and ``-1`` on failure.
uk: Те саме, що ``PyStructSequence_InitType``, але повертає ``0`` у разі успіху та ``-1`` у разі невдачі.

source: Contains the meta information of a struct sequence type to create.
uk: Містить метаінформацію типу послідовності структур, яку потрібно створити.

source: Field
uk: Поле

source: C Type
uk: C Тип

source: Meaning
uk: Значення

source: ``name``
uk: ``ім'я``

source: name of the struct sequence type
uk: ім'я типу послідовності структур

source: pointer to docstring for the type or ``NULL`` to omit
uk: вказівник на рядок документації для типу або ``NULL`` для пропуску

source: ``fields``
uk: ``поля``

source: pointer to ``NULL``-terminated array with field names of the new type
uk: вказівник на масив із закінченням ``NULL`` з іменами полів нового типу

source: number of fields visible to the Python side (if used as tuple)
uk: кількість полів, видимих стороні Python (якщо використовується як кортеж)

source: Describes a field of a struct sequence. As a struct sequence is modeled as a tuple, all fields are typed as :c:type:`PyObject*`. The index in the :attr:`fields` array of the :c:type:`PyStructSequence_Desc` determines which field of the struct sequence is described.
uk: Описує поле структурної послідовності. Оскільки послідовність структур моделюється як кортеж, усі поля вводяться як :c:type:`PyObject*`. Індекс у масиві :attr:`fields` :c:type:`PyStructSequence_Desc` визначає, яке поле послідовності структур описано.

source: name for the field or ``NULL`` to end the list of named fields, set to :c:data:`PyStructSequence_UnnamedField` to leave unnamed
uk: ім’я для поля або ``NULL``, щоб завершити список іменованих полів, встановіть значення :c:data:`PyStructSequence_UnnamedField`, щоб залишити без назви

source: field docstring or ``NULL`` to omit
uk: поле docstring або ``NULL`` для пропуску

source: Special value for a field name to leave it unnamed.
uk: Спеціальне значення для імені поля, щоб залишити його без імені.

source: The type was changed from ``char *``.
uk: Тип змінено з ``char *``.

source: Creates an instance of *type*, which must have been created with :c:func:`PyStructSequence_NewType`.
uk: Створює екземпляр *type*, який має бути створено за допомогою :c:func:`PyStructSequence_NewType`.

source: Return the object at position *pos* in the struct sequence pointed to by *p*. No bounds checking is performed.
uk: Повертає об’єкт у позицію *pos* у послідовності структур, на яку вказує *p*. Перевірка меж не виконується.

source: Macro equivalent of :c:func:`PyStructSequence_GetItem`.
uk: Макроеквівалент :c:func:`PyStructSequence_GetItem`.

source: Sets the field at index *pos* of the struct sequence *p* to value *o*. Like :c:func:`PyTuple_SET_ITEM`, this should only be used to fill in brand new instances.
uk: Встановлює поле за індексом *pos* послідовності структур *p* на значення *o*. Як і :c:func:`PyTuple_SET_ITEM`, це слід використовувати лише для заповнення абсолютно нових екземплярів.

source: This function "steals" a reference to *o*.
uk: Ця функція "краде" посилання на *o*.
