Repository: python/python-docs-uk
Catalog: c-api/unicode.po
Languages: uk

source: Unicode Objects and Codecs
uk: Об’єкти та кодеки Unicode

source: Unicode Objects
uk: Об'єкти Unicode

source: Since the implementation of :pep:`393` in Python 3.3, Unicode objects internally use a variety of representations, in order to allow handling the complete range of Unicode characters while staying memory efficient. There are special cases for strings where all code points are below 128, 256, or 65536; otherwise, code points must be below 1114112 (which is the full Unicode range).
uk: З моменту впровадження :pep:`393` у Python 3.3 об’єкти Unicode внутрішньо використовують різноманітні представлення, щоб дозволити обробку повного діапазону символів Unicode, залишаючись ефективним для пам’яті. Існують особливі випадки для рядків, де всі кодові точки нижчі за 128, 256 або 65536; інакше кодові точки повинні бути нижче 1114112 (що є повним діапазоном Unicode).

source: :c:type:`Py_UNICODE*` and UTF-8 representations are created on demand and cached in the Unicode object. The :c:type:`Py_UNICODE*` representation is deprecated and inefficient.
uk: :c:type:`Py_UNICODE*` і представлення UTF-8 створюються на вимогу та кешуються в об’єкті Unicode. Представлення :c:type:`Py_UNICODE*` є застарілим і неефективним.

source: Due to the transition between the old APIs and the new APIs, Unicode objects can internally be in two states depending on how they were created:
uk: Завдяки переходу між старими і новими API об’єкти Unicode можуть внутрішньо перебувати в двох станах залежно від того, як вони були створені:

source: "canonical" Unicode objects are all objects created by a non-deprecated Unicode API. They use the most efficient representation allowed by the implementation.
uk: "Канонічні" об’єкти Unicode — це всі об’єкти, створені за допомогою API Unicode, який не підтримується. Вони використовують найбільш ефективне представлення, дозволене реалізацією.

source: "legacy" Unicode objects have been created through one of the deprecated APIs (typically :c:func:`PyUnicode_FromUnicode`) and only bear the :c:type:`Py_UNICODE*` representation; you will have to call :c:func:`PyUnicode_READY` on them before calling any other API.
uk: "застарілі" об’єкти Unicode були створені через один із застарілих API (зазвичай :c:func:`PyUnicode_FromUnicode`) і мають лише представлення :c:type:`Py_UNICODE*`; вам доведеться викликати :c:func:`PyUnicode_READY` на них, перш ніж викликати будь-який інший API.

source: The "legacy" Unicode object will be removed in Python 3.12 with deprecated APIs. All Unicode objects will be "canonical" since then. See :pep:`623` for more information.
uk: "Застарілий" об’єкт Unicode буде видалено в Python 3.12 із застарілими API. Відтоді всі об’єкти Unicode будуть "канонічними". Перегляньте :pep:`623` для отримання додаткової інформації.

source: Unicode Type
uk: Тип Unicode

source: These are the basic Unicode object types used for the Unicode implementation in Python:
uk: Ось основні типи об’єктів Unicode, які використовуються для реалізації Unicode в Python:

source: These types are typedefs for unsigned integer types wide enough to contain characters of 32 bits, 16 bits and 8 bits, respectively. When dealing with single Unicode characters, use :c:type:`Py_UCS4`.
uk: Ці типи є визначеннями типів для беззнакових цілих типів, достатньо широких, щоб містити символи 32 біти, 16 бітів і 8 бітів відповідно. При роботі з окремими символами Unicode використовуйте :c:type:`Py_UCS4`.

source: This is a typedef of :c:type:`wchar_t`, which is a 16-bit type or 32-bit type depending on the platform.
uk: Це визначення типу :c:type:`wchar_t`, який є 16-бітним або 32-бітним типом залежно від платформи.

source: In previous versions, this was a 16-bit type or a 32-bit type depending on whether you selected a "narrow" or "wide" Unicode version of Python at build time.
uk: У попередніх версіях це був 16-розрядний або 32-розрядний тип залежно від того, чи ви вибрали "вузьку" чи "широку" версію Unicode Python під час збирання.

source: These subtypes of :c:type:`PyObject` represent a Python Unicode object. In almost all cases, they shouldn't be used directly, since all API functions that deal with Unicode objects take and return :c:type:`PyObject` pointers.
uk: Ці підтипи :c:type:`PyObject` представляють об’єкт Python Unicode. Майже у всіх випадках їх не слід використовувати напряму, оскільки всі функції API, які працюють з об’єктами Unicode, приймають і повертають покажчики :c:type:`PyObject`.

source: This instance of :c:type:`PyTypeObject` represents the Python Unicode type. It is exposed to Python code as ``str``.
uk: Цей екземпляр :c:type:`PyTypeObject` представляє тип Python Unicode. Він доступний коду Python як ``str``.

source: Return true if the object *o* is a Unicode object or an instance of a Unicode subtype. This function always succeeds.
uk: Повертає true, якщо об’єкт *o* є об’єктом Unicode або екземпляром підтипу Unicode. Ця функція завжди успішна.

source: Return true if the object *o* is a Unicode object, but not an instance of a subtype. This function always succeeds.
uk: Повертає true, якщо об’єкт *o* є об’єктом Unicode, але не екземпляром підтипу. Ця функція завжди успішна.

source: Ensure the string object *o* is in the "canonical" representation. This is required before using any of the access macros described below.
uk: Переконайтеся, що рядковий об’єкт *o* знаходиться в "канонічному" представленні. Це необхідно зробити перед використанням будь-якого з описаних нижче макросів доступу.

source: Returns ``0`` on success and ``-1`` with an exception set on failure, which in particular happens if memory allocation fails.
uk: Повертає ``0`` у разі успіху та ``-1`` з винятком, встановленим у випадку невдачі, що, зокрема, трапляється, якщо виділення пам’яті не вдається.

source: This API will be removed with :c:func:`PyUnicode_FromUnicode`.
uk: Цей API буде видалено за допомогою :c:func:`PyUnicode_FromUnicode`.

source: Return the length of the Unicode string, in code points. *o* has to be a Unicode object in the "canonical" representation (not checked).
uk: Повертає довжину рядка Юнікод у кодових точках. *o* має бути об’єктом Unicode у "канонічному" представленні (не позначено).

source: Return a pointer to the canonical representation cast to UCS1, UCS2 or UCS4 integer types for direct character access. No checks are performed if the canonical representation has the correct character size; use :c:func:`PyUnicode_KIND` to select the right macro. Make sure :c:func:`PyUnicode_READY` has been called before accessing this.
uk: Повертайте вказівник на канонічне представлення, перетворене на цілі типи UCS1, UCS2 або UCS4 для прямого доступу до символів. Перевірки не виконуються, якщо канонічне представлення має правильний розмір символів; використовуйте :c:func:`PyUnicode_KIND`, щоб вибрати правильний макрос. Переконайтеся, що :c:func:`PyUnicode_READY` викликано перед тим, як отримати доступ до цього.

source: Return values of the :c:func:`PyUnicode_KIND` macro.
uk: Повертає значення макросу :c:func:`PyUnicode_KIND`.

source: ``PyUnicode_WCHAR_KIND`` is deprecated.
uk: ``PyUnicode_WCHAR_KIND`` застаріло.

source: Return one of the PyUnicode kind constants (see above) that indicate how many bytes per character this Unicode object uses to store its data. *o* has to be a Unicode object in the "canonical" representation (not checked).
uk: Повертає одну з констант типу PyUnicode (див. вище), яка вказує, скільки байтів на символ цей об’єкт Unicode використовує для зберігання своїх даних. *o* має бути об’єктом Unicode у "канонічному" представленні (не позначено).

source: Return a void pointer to the raw Unicode buffer. *o* has to be a Unicode object in the "canonical" representation (not checked).
uk: Повертає вказівник недійсності на необроблений буфер Unicode. *o* має бути об’єктом Unicode у "канонічному" представленні (не позначено).

source: Read a code point from a canonical representation *data* (as obtained with :c:func:`PyUnicode_DATA`). No checks or ready calls are performed.
uk: Прочитайте кодову точку з канонічного представлення *data* (отриманого за допомогою :c:func:`PyUnicode_DATA`). Перевірки чи готові виклики не виконуються.

source: Read a character from a Unicode object *o*, which must be in the "canonical" representation. This is less efficient than :c:func:`PyUnicode_READ` if you do multiple consecutive reads.
uk: Прочитати символ з об’єкта Unicode *o*, який має бути в "канонічному" представленні. Це менш ефективно, ніж :c:func:`PyUnicode_READ`, якщо ви виконуєте кілька послідовних читань.

source: Return the maximum code point that is suitable for creating another string based on *o*, which must be in the "canonical" representation. This is always an approximation but more efficient than iterating over the string.
uk: Повертає максимальну кодову точку, придатну для створення іншого рядка на основі *o*, який має бути в "канонічному" представленні. Це завжди наближення, але ефективніше, ніж ітерація по рядку.

source: Return the size of the deprecated :c:type:`Py_UNICODE` representation, in code units (this includes surrogate pairs as 2 units). *o* has to be a Unicode object (not checked).
uk: Повертає розмір застарілого представлення :c:type:`Py_UNICODE` в одиницях коду (це включає сурогатні пари як 2 одиниці). *o* має бути об’єктом Unicode (не позначено).

source: Part of the old-style Unicode API, please migrate to using :c:func:`PyUnicode_GET_LENGTH`.
uk: Частина старого стилю Unicode API, будь ласка, перейдіть на використання :c:func:`PyUnicode_GET_LENGTH`.

source: Return the size of the deprecated :c:type:`Py_UNICODE` representation in bytes. *o* has to be a Unicode object (not checked).
uk: Повертає розмір застарілого представлення :c:type:`Py_UNICODE` в байтах. *o* має бути об’єктом Unicode (не позначено).

source: Return a pointer to a :c:type:`Py_UNICODE` representation of the object. The returned buffer is always terminated with an extra null code point. It may also contain embedded null code points, which would cause the string to be truncated when used in most C functions. The ``AS_DATA`` form casts the pointer to :c:type:`const char *`. The *o* argument has to be a Unicode object (not checked).
uk: Повертає вказівник на представлення об’єкта :c:type:`Py_UNICODE`. Повернений буфер завжди закінчується додатковою нульовою кодовою точкою. Він також може містити вбудовані нульові кодові точки, які призведуть до скорочення рядка під час використання в більшості функцій C. Форма ``AS_DATA`` перетворює вказівник на :c:type:`const char *`. Аргумент *o* має бути об’єктом Unicode (не позначено).

source: Part of the old-style Unicode API, please migrate to using the :c:func:`PyUnicode_nBYTE_DATA` family of macros.
uk: Частина API старого стилю Unicode, будь ласка, перейдіть на використання сімейства макросів :c:func:`PyUnicode_nBYTE_DATA`.

source: Return ``1`` if the string is a valid identifier according to the language definition, section :ref:`identifiers`. Return ``0`` otherwise.
uk: Повертає ``1``, якщо рядок є дійсним ідентифікатором відповідно до визначення мови, розділ :ref:`identifiers`. Інакше поверніть ``0``.

source: The function does not call :c:func:`Py_FatalError` anymore if the string is not ready.
uk: Функція більше не викликає :c:func:`Py_FatalError`, якщо рядок не готовий.

source: Unicode Character Properties
uk: Властивості символів Unicode

source: Unicode provides many different character properties. The most often needed ones are available through these macros which are mapped to C functions depending on the Python configuration.
uk: Unicode надає багато різних властивостей символів. Найпотрібніші з них доступні через ці макроси, які зіставляються з функціями C залежно від конфігурації Python.

source: Return ``1`` or ``0`` depending on whether *ch* is a whitespace character.
uk: Повертає "1" або "0" залежно від того, чи *ch* є пробілом.

source: Return ``1`` or ``0`` depending on whether *ch* is a lowercase character.
uk: Повертає "1" або "0" залежно від того, чи *ch* є символом нижнього регістру.

source: Return ``1`` or ``0`` depending on whether *ch* is an uppercase character.
uk: Повертає ``1`` або ``0`` залежно від того, чи *ch* є символом у верхньому регістрі.

source: Return ``1`` or ``0`` depending on whether *ch* is a titlecase character.
uk: Повертає ``1`` або ``0`` залежно від того, чи *ch* є символом заголовка.

source: Return ``1`` or ``0`` depending on whether *ch* is a linebreak character.
uk: Повертає "1" або "0" залежно від того, чи є *ch* символом розриву рядка.

source: Return ``1`` or ``0`` depending on whether *ch* is a decimal character.
uk: Повертає "1" або "0" залежно від того, чи є *ch* десятковим символом.

source: Return ``1`` or ``0`` depending on whether *ch* is a digit character.
uk: Повертає "1" або "0" залежно від того, чи є *ch* символом цифри.

source: Return ``1`` or ``0`` depending on whether *ch* is a numeric character.
uk: Повертає "1" або "0" залежно від того, чи є *ch* цифровим символом.

source: Return ``1`` or ``0`` depending on whether *ch* is an alphabetic character.
uk: Повертає "1" або "0" залежно від того, чи *ch* є буквою.

source: Return ``1`` or ``0`` depending on whether *ch* is an alphanumeric character.
uk: Повертає "1" або "0" залежно від того, чи є *ch* буквено-цифровим символом.

source: Return ``1`` or ``0`` depending on whether *ch* is a printable character. Nonprintable characters are those characters defined in the Unicode character database as "Other" or "Separator", excepting the ASCII space (0x20) which is considered printable. (Note that printable characters in this context are those which should not be escaped when :func:`repr` is invoked on a string. It has no bearing on the handling of strings written to :data:`sys.stdout` or :data:`sys.stderr`.)
uk: Повертає "1" або "0" залежно від того, чи є *ch* символом для друку. Символи, що не друкуються, — це символи, визначені в базі даних символів Unicode як "Інші" або "Розділювачі", за винятком пробілу ASCII (0x20), який вважається придатним для друку. (Зауважте, що друковані символи в цьому контексті – це ті символи, які не слід екранувати, коли :func:`repr` викликається в рядку. Це не впливає на обробку рядків, записаних у :data:`sys.stdout` або :data:`sys.stderr`.)

source: These APIs can be used for fast direct character conversions:
uk: Ці API можна використовувати для швидкого прямого перетворення символів:

source: Return the character *ch* converted to lower case.
uk: Повертає символ *ch*, перетворений на нижній регістр.

source: This function uses simple case mappings.
uk: Ця функція використовує прості відображення регістру.

source: Return the character *ch* converted to upper case.
uk: Повертає символ *ch*, перетворений у верхній регістр.

source: Return the character *ch* converted to title case.
uk: Повертає символ *ch*, перетворений на регістр заголовка.

source: Return the character *ch* converted to a decimal positive integer. Return ``-1`` if this is not possible. This macro does not raise exceptions.
uk: Повертає символ *ch*, перетворений на десяткове позитивне ціле число. Поверніть ``-1``, якщо це неможливо. Цей макрос не створює винятків.

source: Return the character *ch* converted to a single digit integer. Return ``-1`` if this is not possible. This macro does not raise exceptions.
uk: Повертає символ *ch*, перетворений на однозначне ціле число. Поверніть ``-1``, якщо це неможливо. Цей макрос не створює винятків.

source: Return the character *ch* converted to a double. Return ``-1.0`` if this is not possible. This macro does not raise exceptions.
uk: Повертає символ *ch*, перетворений на подвійну. Поверніть ``-1.0``, якщо це неможливо. Цей макрос не створює винятків.

source: These APIs can be used to work with surrogates:
uk: Ці API можна використовувати для роботи із сурогатами:

source: Check if *ch* is a surrogate (``0xD800 <= ch <= 0xDFFF``).
uk: Перевірте, чи *ch* є сурогатом (``0xD800 <= ch <= 0xDFFF``).

source: Check if *ch* is a high surrogate (``0xD800 <= ch <= 0xDBFF``).
uk: Перевірте, чи *ch* є високим сурогатом (``0xD800 <= ch <= 0xDBFF``).

source: Check if *ch* is a low surrogate (``0xDC00 <= ch <= 0xDFFF``).
uk: Перевірте, чи *ch* є низьким сурогатом (``0xDC00 <= ch <= 0xDFFF``).

source: Join two surrogate characters and return a single Py_UCS4 value. *high* and *low* are respectively the leading and trailing surrogates in a surrogate pair.
uk: Об’єднайте два сурогатних символи та поверніть одне значення Py_UCS4. *високий* і *низький* є відповідно початковими та кінцевими сурогатами в сурогатній парі.

source: Creating and accessing Unicode strings
uk: Створення та доступ до рядків Unicode

source: To create Unicode objects and access their basic sequence properties, use these APIs:
uk: Щоб створити об’єкти Unicode та отримати доступ до їхніх основних властивостей послідовності, використовуйте ці API:

source: Create a new Unicode object. *maxchar* should be the true maximum code point to be placed in the string. As an approximation, it can be rounded up to the nearest value in the sequence 127, 255, 65535, 1114111.
uk: Створіть новий об’єкт Unicode. *maxchar* має бути справжньою максимальною кодовою точкою, яка буде розміщена в рядку. Приблизно його можна округлити до найближчого значення в послідовності 127, 255, 65535, 1114111.

source: This is the recommended way to allocate a new Unicode object. Objects created using this function are not resizable.
uk: Це рекомендований спосіб виділення нового об’єкта Unicode. Розмір об’єктів, створених за допомогою цієї функції, неможливо змінити.

source: Create a new Unicode object with the given *kind* (possible values are :c:macro:`PyUnicode_1BYTE_KIND` etc., as returned by :c:func:`PyUnicode_KIND`). The *buffer* must point to an array of *size* units of 1, 2 or 4 bytes per character, as given by the kind.
uk: Створіть новий об’єкт Unicode із заданим *kind* (можливі значення: :c:macro:`PyUnicode_1BYTE_KIND` тощо, як повертає :c:func:`PyUnicode_KIND`). *Буфер* має вказувати на масив одиниць *розміру* по 1, 2 або 4 байти на символ, як задано типом.

source: Create a Unicode object from the char buffer *u*. The bytes will be interpreted as being UTF-8 encoded. The buffer is copied into the new object. If the buffer is not ``NULL``, the return value might be a shared object, i.e. modification of the data is not allowed.
uk: Створіть об’єкт Unicode з буфера char *u*. Байти інтерпретуватимуться як закодовані в UTF-8. Буфер копіюється в новий об'єкт. Якщо буфер не ``NULL``, значення, що повертається, може бути спільним об’єктом, тобто модифікація даних не дозволяється.

source: If *u* is ``NULL``, this function behaves like :c:func:`PyUnicode_FromUnicode` with the buffer set to ``NULL``. This usage is deprecated in favor of :c:func:`PyUnicode_New`, and will be removed in Python 3.12.
uk: Якщо *u* має значення ``NULL``, ця функція поводиться як :c:func:`PyUnicode_FromUnicode` з буфером, встановленим на ``NULL``. Це використання застаріло на користь :c:func:`PyUnicode_New` і буде видалено в Python 3.12.

source: Create a Unicode object from a UTF-8 encoded null-terminated char buffer *u*.
uk: Створіть об’єкт Юнікод із буфера символів *u* із кодуванням UTF-8 із закінченням нулем.

source: Take a C :c:func:`printf`\ -style *format* string and a variable number of arguments, calculate the size of the resulting Python Unicode string and return a string with the values formatted into it. The variable arguments must be C types and must correspond exactly to the format characters in the *format* ASCII-encoded string. The following format characters are allowed:
uk: Візьміть рядок C :c:func:`printf`\ -style *format* і змінну кількість аргументів, обчисліть розмір результуючого рядка Python Unicode та поверніть рядок із значеннями, відформатованими в ньому. Змінні аргументи мають бути типу C і точно відповідати символам формату в рядку *format* у кодуванні ASCII. Дозволяються такі символи формату:

source: Format Characters
uk: Формат символів

source: Type
uk: Тип

source: Comment
uk: коментар

source: *n/a*
uk: *немає*

source: The literal % character.
uk: Літеральний символ %.

source: int
uk: внутр

source: A single character, represented as a C int.
uk: Один символ, представлений як C int.

source: Equivalent to ``printf("%d")``. [1]_
uk: Еквівалент ``printf("%d")``. [1]_

source: Equivalent to ``printf("%u")``. [1]_
uk: Еквівалент ``printf("%u")``. [1]_

source: long
uk: довгота

source: Equivalent to ``printf("%ld")``. [1]_
uk: Еквівалент ``printf("%ld")``. [1]_

source: Equivalent to ``printf("%li")``. [1]_
uk: Еквівалент ``printf("%li")``. [1]_

source: unsigned long
uk: беззнаковий довгий

source: Equivalent to ``printf("%lu")``. [1]_
uk: Еквівалент ``printf("%lu")``. [1]_

source: long long
uk: довгий довгий

source: Equivalent to ``printf("%lld")``. [1]_
uk: Еквівалент ``printf("%lld")``. [1]_

source: Equivalent to ``printf("%lli")``. [1]_
uk: Еквівалент ``printf("%lli")``. [1]_

source: unsigned long long
uk: без знака довгий довгий

source: Equivalent to ``printf("%llu")``. [1]_
uk: Еквівалент ``printf("%llu")``. [1]_

source: Equivalent to ``printf("%zd")``. [1]_
uk: Еквівалент ``printf("%zd")``. [1]_

source: Equivalent to ``printf("%zi")``. [1]_
uk: Еквівалент ``printf("%zi")``. [1]_

source: Equivalent to ``printf("%zu")``. [1]_
uk: Еквівалент ``printf("%zu")``. [1]_

source: Equivalent to ``printf("%i")``. [1]_
uk: Еквівалент ``printf("%i")``. [1]_

source: Equivalent to ``printf("%x")``. [1]_
uk: Еквівалент ``printf("%x")``. [1]_

source: A null-terminated C character array.
uk: Масив символів C із закінченням нулем.

source: The hex representation of a C pointer. Mostly equivalent to ``printf("%p")`` except that it is guaranteed to start with the literal ``0x`` regardless of what the platform's ``printf`` yields.
uk: Шістнадцяткове представлення покажчика C. Здебільшого еквівалентний ``printf("%p")`` за винятком того, що він гарантовано починається з літералу ``0x`` незалежно від того, що дає ``printf`` платформи.

source: The result of calling :func:`ascii`.
uk: Результат виклику :func:`ascii`.

source: A Unicode object.
uk: Об'єкт Unicode.

source: A Unicode object (which may be ``NULL``) and a null-terminated C character array as a second parameter (which will be used, if the first parameter is ``NULL``).
uk: Об’єкт Unicode (який може бути ``NULL``) і масив символів C із нульовим закінченням як другий параметр (який використовуватиметься, якщо перший параметр ``NULL``).

source: The result of calling :c:func:`PyObject_Str`.
uk: Результат виклику :c:func:`PyObject_Str`.

source: The result of calling :c:func:`PyObject_Repr`.
uk: Результат виклику :c:func:`PyObject_Repr`.

source: An unrecognized format character causes all the rest of the format string to be copied as-is to the result string, and any extra arguments discarded.
uk: Нерозпізнаний символ формату спричиняє копіювання всієї решти рядка формату як є до рядка результату, а всі додаткові аргументи відкидаються.

source: The width formatter unit is number of characters rather than bytes. The precision formatter unit is number of bytes for ``"%s"`` and ``"%V"`` (if the ``PyObject*`` argument is ``NULL``), and a number of characters for ``"%A"``, ``"%U"``, ``"%S"``, ``"%R"`` and ``"%V"`` (if the ``PyObject*`` argument is not ``NULL``).
uk: Одиницею форматування ширини є кількість символів, а не байти. Одиницею точного форматування є кількість байтів для ``"%s"`` і ``"%V"`` (якщо аргумент ``PyObject*`` має значення ``NULL``), і кількість символів для` `"%A"``, ``"%U"``, ``"%S"``, ``"%R"`` і ``"%V"`` (якщо ``PyObject*`` аргумент не є ``NULL``).
