Repository: python/python-docs-uk
Catalog: c-api/unicode.po
Languages: uk

source: For integer specifiers (d, u, ld, li, lu, lld, lli, llu, zd, zi, zu, i, x): the 0-conversion flag has effect even when a precision is given.
uk: Для специфікаторів цілих чисел (d, u, ld, li, lu, lld, lli, llu, zd, zi, zu, i, x): прапор 0-конверсії діє, навіть якщо задано точність.

source: Support for ``"%lld"`` and ``"%llu"`` added.
uk: Додано підтримку ``"%lld"`` і ``"%llu"``.

source: Support for ``"%li"``, ``"%lli"`` and ``"%zi"`` added.
uk: Додано підтримку ``"%li"``, ``"%lli"`` і ``"%zi"``.

source: Support width and precision formatter for ``"%s"``, ``"%A"``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"`` added.
uk: Підтримка ширини та точного форматування для ``"%s"``, ``"%A"``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"`` додано.

source: Identical to :c:func:`PyUnicode_FromFormat` except that it takes exactly two arguments.
uk: Ідентичний :c:func:`PyUnicode_FromFormat` за винятком того, що він приймає рівно два аргументи.

source: Decode an encoded object *obj* to a Unicode object.
uk: Декодуйте закодований об’єкт *obj* в об’єкт Unicode.

source: :class:`bytes`, :class:`bytearray` and other :term:`bytes-like objects <bytes-like object>` are decoded according to the given *encoding* and using the error handling defined by *errors*. Both can be ``NULL`` to have the interface use the default values (see :ref:`builtincodecs` for details).
uk: :class:`bytes`, :class:`bytearray` та інші :term:`bytes-подібні об’єкти <bytes-like object>` декодуються відповідно до заданого *кодування* та з використанням обробки помилок, визначеної *errors*. Обидва можуть бути ``NULL``, щоб інтерфейс використовував значення за замовчуванням (дивіться :ref:`builtincodecs` для деталей).

source: All other objects, including Unicode objects, cause a :exc:`TypeError` to be set.
uk: Усі інші об’єкти, включно з об’єктами Unicode, викликають встановлення :exc:`TypeError`.

source: The API returns ``NULL`` if there was an error. The caller is responsible for decref'ing the returned objects.
uk: API повертає ``NULL``, якщо сталася помилка. Виклик відповідає за декодування повернутих об'єктів.

source: Return the length of the Unicode object, in code points.
uk: Повертає довжину об’єкта Юнікод у кодових точках.

source: Copy characters from one Unicode object into another. This function performs character conversion when necessary and falls back to :c:func:`memcpy` if possible. Returns ``-1`` and sets an exception on error, otherwise returns the number of copied characters.
uk: Копіювати символи з одного об’єкта Unicode в інший. Ця функція виконує перетворення символів, якщо це необхідно, і повертається до :c:func:`memcpy`, якщо це можливо. Повертає ``-1`` і встановлює виняток у випадку помилки, інакше повертає кількість скопійованих символів.

source: Fill a string with a character: write *fill_char* into ``unicode[start:start+length]``.
uk: Заповніть рядок символом: напишіть *fill_char* у ``unicode[start:start+length]``.

source: Fail if *fill_char* is bigger than the string maximum character, or if the string has more than 1 reference.
uk: Помилка, якщо *fill_char* перевищує максимальний символ рядка або якщо рядок має більше ніж 1 посилання.

source: Return the number of written character, or return ``-1`` and raise an exception on error.
uk: Повертає номер написаного символу або повертає ``-1`` і викликає виняток у разі помилки.

source: Write a character to a string. The string must have been created through :c:func:`PyUnicode_New`. Since Unicode strings are supposed to be immutable, the string must not be shared, or have been hashed yet.
uk: Записати символ у рядок. Рядок має бути створено через :c:func:`PyUnicode_New`. Оскільки рядки Юнікоду мають бути незмінними, рядок не можна надавати спільно або хешувати.

source: This function checks that *unicode* is a Unicode object, that the index is not out of bounds, and that the object can be modified safely (i.e. that it its reference count is one).
uk: Ця функція перевіряє, що *unicode* є об’єктом Unicode, що індекс не виходить за межі та чи можна безпечно змінювати об’єкт (тобто чи кількість посилань дорівнює одиниці).

source: Return a substring of *str*, from character index *start* (included) to character index *end* (excluded). Negative indices are not supported.
uk: Повертає підрядок *str* від символьного індексу *start* (включено) до символьного індексу *end* (виключено). Негативні індекси не підтримуються.

source: Copy the string *u* into a UCS4 buffer, including a null character, if *copy_null* is set. Returns ``NULL`` and sets an exception on error (in particular, a :exc:`SystemError` if *buflen* is smaller than the length of *u*). *buffer* is returned on success.
uk: Скопіюйте рядок *u* у буфер UCS4, включаючи нульовий символ, якщо встановлено *copy_null*. Повертає ``NULL`` і встановлює виняток у випадку помилки (зокрема, :exc:`SystemError`, якщо *buflen* менший за довжину *u*). *buffer* повертається в разі успіху.

source: Copy the string *u* into a new UCS4 buffer that is allocated using :c:func:`PyMem_Malloc`. If this fails, ``NULL`` is returned with a :exc:`MemoryError` set. The returned buffer always has an extra null code point appended.
uk: Скопіюйте рядок *u* у новий буфер UCS4, який виділено за допомогою :c:func:`PyMem_Malloc`. Якщо це не вдається, повертається ``NULL`` із набором :exc:`MemoryError`. Повернений буфер завжди має додаткову нульову кодову точку.

source: Deprecated Py_UNICODE APIs
uk: Застарілі API Py_UNICODE

source: These API functions are deprecated with the implementation of :pep:`393`. Extension modules can continue using them, as they will not be removed in Python 3.x, but need to be aware that their use can now cause performance and memory hits.
uk: Ці функції API застаріли з реалізацією :pep:`393`. Модулі розширення можуть продовжувати використовувати їх, оскільки вони не будуть видалені в Python 3.x, але потрібно знати, що їхнє використання тепер може призвести до погіршення продуктивності та пам’яті.

source: Create a Unicode object from the Py_UNICODE buffer *u* of the given size. *u* may be ``NULL`` which causes the contents to be undefined. It is the user's responsibility to fill in the needed data. The buffer is copied into the new object.
uk: Створіть об’єкт Unicode з буфера Py_UNICODE *u* заданого розміру. *u* може бути ``NULL``, через що вміст буде невизначеним. Користувач несе відповідальність за заповнення необхідних даних. Буфер копіюється в новий об'єкт.

source: If the buffer is not ``NULL``, the return value might be a shared object. Therefore, modification of the resulting Unicode object is only allowed when *u* is ``NULL``.
uk: Якщо буфер не ``NULL``, повернуте значення може бути спільним об’єктом. Таким чином, модифікація отриманого об’єкта Unicode дозволена лише тоді, коли *u* має значення ``NULL``.

source: If the buffer is ``NULL``, :c:func:`PyUnicode_READY` must be called once the string content has been filled before using any of the access macros such as :c:func:`PyUnicode_KIND`.
uk: Якщо буфер має значення ``NULL``, :c:func:`PyUnicode_READY` потрібно викликати після заповнення вмісту рядка перед використанням будь-якого макросу доступу, наприклад :c:func:`PyUnicode_KIND`.

source: Part of the old-style Unicode API, please migrate to using :c:func:`PyUnicode_FromKindAndData`, :c:func:`PyUnicode_FromWideChar`, or :c:func:`PyUnicode_New`.
uk: Частина API Unicode старого стилю, перейдіть на використання :c:func:`PyUnicode_FromKindAndData`, :c:func:`PyUnicode_FromWideChar` або :c:func:`PyUnicode_New`.

source: Return a read-only pointer to the Unicode object's internal :c:type:`Py_UNICODE` buffer, or ``NULL`` on error. This will create the :c:type:`Py_UNICODE*` representation of the object if it is not yet available. The buffer is always terminated with an extra null code point. Note that the resulting :c:type:`Py_UNICODE` string may also contain embedded null code points, which would cause the string to be truncated when used in most C functions.
uk: Повертає вказівник лише для читання на внутрішній буфер :c:type:`Py_UNICODE` об’єкта Unicode або ``NULL`` у разі помилки. Це створить представлення об’єкта :c:type:`Py_UNICODE*`, якщо він ще недоступний. Буфер завжди закінчується додатковою нульовою кодовою точкою. Зауважте, що отриманий рядок :c:type:`Py_UNICODE` також може містити вбудовані нульові кодові точки, що спричинило б скорочення рядка під час використання в більшості функцій C.

source: Part of the old-style Unicode API, please migrate to using :c:func:`PyUnicode_AsUCS4`, :c:func:`PyUnicode_AsWideChar`, :c:func:`PyUnicode_ReadChar` or similar new APIs.
uk: Частина API старого стилю Unicode, перейдіть на використання :c:func:`PyUnicode_AsUCS4`, :c:func:`PyUnicode_AsWideChar`, :c:func:`PyUnicode_ReadChar` або подібних нових API.

source: Like :c:func:`PyUnicode_AsUnicode`, but also saves the :c:func:`Py_UNICODE` array length (excluding the extra null terminator) in *size*. Note that the resulting :c:type:`Py_UNICODE*` string may contain embedded null code points, which would cause the string to be truncated when used in most C functions.
uk: Подібно до :c:func:`PyUnicode_AsUnicode`, але також зберігає довжину масиву :c:func:`Py_UNICODE` (за винятком додаткового нульового термінатора) у *розмірі*. Зауважте, що отриманий рядок :c:type:`Py_UNICODE*` може містити вбудовані нульові кодові точки, що спричинило б скорочення рядка під час використання в більшості функцій C.

source: Return the size of the deprecated :c:type:`Py_UNICODE` representation, in code units (this includes surrogate pairs as 2 units).
uk: Повертає розмір застарілого представлення :c:type:`Py_UNICODE` в одиницях коду (це включає сурогатні пари як 2 одиниці).

source: Copy an instance of a Unicode subtype to a new true Unicode object if necessary. If *obj* is already a true Unicode object (not a subtype), return the reference with incremented refcount.
uk: Якщо необхідно, скопіюйте екземпляр підтипу Unicode до нового справжнього об’єкта Unicode. Якщо *obj* вже є справжнім об’єктом Юнікод (а не підтипом), поверніть посилання зі збільшеним числом посилань.

source: Objects other than Unicode or its subtypes will cause a :exc:`TypeError`.
uk: Об’єкти, відмінні від Unicode або його підтипів, викличуть :exc:`TypeError`.

source: Locale Encoding
uk: Кодування мови

source: The current locale encoding can be used to decode text from the operating system.
uk: Поточне кодування мови можна використовувати для декодування тексту з операційної системи.

source: Decode a string from UTF-8 on Android and VxWorks, or from the current locale encoding on other platforms. The supported error handlers are ``"strict"`` and ``"surrogateescape"`` (:pep:`383`). The decoder uses ``"strict"`` error handler if *errors* is ``NULL``. *str* must end with a null character but cannot contain embedded null characters.
uk: Декодуйте рядок з UTF-8 на Android і VxWorks або з поточного кодування мови на інших платформах. Підтримуваними обробниками помилок є ``"strict"`` і ``"surrogateescape"`` (:pep:`383`). Декодер використовує ``"strict"`` обробник помилок, якщо *errors* має значення ``NULL``. *str* має закінчуватися нульовим символом, але не може містити вбудовані нульові символи.

source: Use :c:func:`PyUnicode_DecodeFSDefaultAndSize` to decode a string from :c:data:`Py_FileSystemDefaultEncoding` (the locale encoding read at Python startup).
uk: Використовуйте :c:func:`PyUnicode_DecodeFSDefaultAndSize`, щоб декодувати рядок із :c:data:`Py_FileSystemDefaultEncoding` (кодування локалі, яке читається під час запуску Python).

source: This function ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
uk: Ця функція ігнорує :ref:`Режим Python UTF-8 <utf8-mode>`.

source: The :c:func:`Py_DecodeLocale` function.
uk: Функція :c:func:`Py_DecodeLocale`.

source: The function now also uses the current locale encoding for the ``surrogateescape`` error handler, except on Android. Previously, :c:func:`Py_DecodeLocale` was used for the ``surrogateescape``, and the current locale encoding was used for ``strict``.
uk: Функція тепер також використовує поточне кодування мови для обробника помилок ``surrogateescape``, за винятком Android. Раніше :c:func:`Py_DecodeLocale` використовувався для ``surrogateescape``, а поточне кодування мови використовувалося для ``strict``.

source: Similar to :c:func:`PyUnicode_DecodeLocaleAndSize`, but compute the string length using :c:func:`strlen`.
uk: Подібно до :c:func:`PyUnicode_DecodeLocaleAndSize`, але обчислюйте довжину рядка за допомогою :c:func:`strlen`.

source: Encode a Unicode object to UTF-8 on Android and VxWorks, or to the current locale encoding on other platforms. The supported error handlers are ``"strict"`` and ``"surrogateescape"`` (:pep:`383`). The encoder uses ``"strict"`` error handler if *errors* is ``NULL``. Return a :class:`bytes` object. *unicode* cannot contain embedded null characters.
uk: Закодуйте об’єкт Unicode до UTF-8 на Android і VxWorks або до поточного кодування мови на інших платформах. Підтримуваними обробниками помилок є ``"strict"`` і ``"surrogateescape"`` (:pep:`383`). Кодер використовує ``"strict"`` обробник помилок, якщо *errors* має значення ``NULL``. Повертає об’єкт :class:`bytes`. *unicode* не може містити вбудовані нульові символи.

source: Use :c:func:`PyUnicode_EncodeFSDefault` to encode a string to :c:data:`Py_FileSystemDefaultEncoding` (the locale encoding read at Python startup).
uk: Використовуйте :c:func:`PyUnicode_EncodeFSDefault`, щоб закодувати рядок у :c:data:`Py_FileSystemDefaultEncoding` (кодування локалі, яке читається під час запуску Python).

source: The :c:func:`Py_EncodeLocale` function.
uk: Функція :c:func:`Py_EncodeLocale`.

source: The function now also uses the current locale encoding for the ``surrogateescape`` error handler, except on Android. Previously, :c:func:`Py_EncodeLocale` was used for the ``surrogateescape``, and the current locale encoding was used for ``strict``.
uk: Функція тепер також використовує поточне кодування мови для обробника помилок ``surrogateescape``, за винятком Android. Раніше :c:func:`Py_EncodeLocale` використовувався для ``surrogateescape``, а поточне кодування мови використовувалося для ``strict``.

source: File System Encoding
uk: Кодування файлової системи

source: To encode and decode file names and other environment strings, :c:data:`Py_FileSystemDefaultEncoding` should be used as the encoding, and :c:data:`Py_FileSystemDefaultEncodeErrors` should be used as the error handler (:pep:`383` and :pep:`529`). To encode file names to :class:`bytes` during argument parsing, the ``"O&"`` converter should be used, passing :c:func:`PyUnicode_FSConverter` as the conversion function:
uk: Для кодування та декодування імен файлів та інших рядків середовища слід використовувати :c:data:`Py_FileSystemDefaultEncoding` як кодування, а :c:data:`Py_FileSystemDefaultEncodeErrors` — як обробник помилок (:pep:`383` і :pep:`529`). Щоб кодувати імена файлів у :class:`bytes` під час аналізу аргументів, слід використовувати конвертер ``"O&"``, передаючи :c:func:`PyUnicode_FSConverter` як функцію перетворення:

source: ParseTuple converter: encode :class:`str` objects -- obtained directly or through the :class:`os.PathLike` interface -- to :class:`bytes` using :c:func:`PyUnicode_EncodeFSDefault`; :class:`bytes` objects are output as-is. *result* must be a :c:type:`PyBytesObject*` which must be released when it is no longer used.
uk: Перетворювач ParseTuple: кодувати об’єкти :class:`str`, отримані безпосередньо або через інтерфейс :class:`os.PathLike`, у :class:`bytes` за допомогою :c:func:`PyUnicode_EncodeFSDefault`; :class:`bytes` об'єкти виводяться як є. *результат* має бути :c:type:`PyBytesObject*`, який має бути звільнений, коли він більше не використовується.

source: Accepts a :term:`path-like object`.
uk: Приймає :term:`path-like object`.

source: To decode file names to :class:`str` during argument parsing, the ``"O&"`` converter should be used, passing :c:func:`PyUnicode_FSDecoder` as the conversion function:
uk: Щоб декодувати імена файлів у :class:`str` під час синтаксичного аналізу аргументів, слід використовувати конвертер ``"O&"``, передаючи :c:func:`PyUnicode_FSDecoder` як функцію перетворення:

source: ParseTuple converter: decode :class:`bytes` objects -- obtained either directly or indirectly through the :class:`os.PathLike` interface -- to :class:`str` using :c:func:`PyUnicode_DecodeFSDefaultAndSize`; :class:`str` objects are output as-is. *result* must be a :c:type:`PyUnicodeObject*` which must be released when it is no longer used.
uk: Перетворювач ParseTuple: декодувати об’єкти :class:`bytes`, отримані безпосередньо чи опосередковано через інтерфейс :class:`os.PathLike`, у :class:`str` за допомогою :c:func:`PyUnicode_DecodeFSDefaultAndSize`; :class:`str` об'єкти виводяться як є. *результат* має бути :c:type:`PyUnicodeObject*`, який має бути звільнений, коли він більше не використовується.

source: Decode a string from the :term:`filesystem encoding and error handler`.
uk: Декодуйте рядок із :term:`filesystem encoding and error handler`.

source: If :c:data:`Py_FileSystemDefaultEncoding` is not set, fall back to the locale encoding.
uk: Якщо :c:data:`Py_FileSystemDefaultEncoding` не встановлено, поверніться до кодування мови.

source: :c:data:`Py_FileSystemDefaultEncoding` is initialized at startup from the locale encoding and cannot be modified later. If you need to decode a string from the current locale encoding, use :c:func:`PyUnicode_DecodeLocaleAndSize`.
uk: :c:data:`Py_FileSystemDefaultEncoding` ініціалізується під час запуску з кодування мови та не може бути змінено пізніше. Якщо вам потрібно декодувати рядок із поточного кодування мови, використовуйте :c:func:`PyUnicode_DecodeLocaleAndSize`.

source: Use :c:data:`Py_FileSystemDefaultEncodeErrors` error handler.
uk: Використовуйте обробник помилок :c:data:`Py_FileSystemDefaultEncodeErrors`.

source: Decode a null-terminated string from the :term:`filesystem encoding and error handler`.
uk: Декодуйте рядок із нульовим закінченням із :term:`filesystem encoding and error handler`.

source: Use :c:func:`PyUnicode_DecodeFSDefaultAndSize` if you know the string length.
uk: Використовуйте :c:func:`PyUnicode_DecodeFSDefaultAndSize`, якщо вам відома довжина рядка.

source: Encode a Unicode object to :c:data:`Py_FileSystemDefaultEncoding` with the :c:data:`Py_FileSystemDefaultEncodeErrors` error handler, and return :class:`bytes`. Note that the resulting :class:`bytes` object may contain null bytes.
uk: Закодуйте об’єкт Юнікод у :c:data:`Py_FileSystemDefaultEncoding` за допомогою обробника помилок :c:data:`Py_FileSystemDefaultEncodeErrors` і поверніть :class:`bytes`. Зауважте, що отриманий об’єкт :class:`bytes` може містити нульові байти.

source: :c:data:`Py_FileSystemDefaultEncoding` is initialized at startup from the locale encoding and cannot be modified later. If you need to encode a string to the current locale encoding, use :c:func:`PyUnicode_EncodeLocale`.
uk: :c:data:`Py_FileSystemDefaultEncoding` ініціалізується під час запуску з кодування мови та не може бути змінено пізніше. Якщо вам потрібно закодувати рядок до поточного кодування мови, використовуйте :c:func:`PyUnicode_EncodeLocale`.

source: wchar_t Support
uk: Підтримка wchar_t

source: :c:type:`wchar_t` support for platforms which support it:
uk: :c:type:`wchar_t` підтримка платформ, які її підтримують:

source: Create a Unicode object from the :c:type:`wchar_t` buffer *w* of the given *size*. Passing ``-1`` as the *size* indicates that the function must itself compute the length, using wcslen. Return ``NULL`` on failure.
uk: Створіть об’єкт Юнікод із буфера :c:type:`wchar_t` *w* заданого *розміру*. Передача ``-1`` як *size* вказує на те, що функція повинна сама обчислити довжину за допомогою wcslen. Повертає ``NULL`` у разі помилки.

source: Copy the Unicode object contents into the :c:type:`wchar_t` buffer *w*. At most *size* :c:type:`wchar_t` characters are copied (excluding a possibly trailing null termination character). Return the number of :c:type:`wchar_t` characters copied or ``-1`` in case of an error. Note that the resulting :c:type:`wchar_t*` string may or may not be null-terminated. It is the responsibility of the caller to make sure that the :c:type:`wchar_t*` string is null-terminated in case this is required by the application. Also, note that the :c:type:`wchar_t*` string might contain null characters, which would cause the string to be truncated when used with most C functions.
uk: Скопіюйте вміст об’єкта Unicode в буфер :c:type:`wchar_t` *w*. Копіюється щонайбільше символів *size* :c:type:`wchar_t` (за винятком можливого кінцевого нульового символу). Повертає кількість скопійованих символів :c:type:`wchar_t` або ``-1`` у разі помилки. Зауважте, що результуючий рядок :c:type:`wchar_t*` може завершуватися нульовим значенням, а може і не мати. Абонент зобов’язаний переконатися, що рядок :c:type:`wchar_t*` завершується нульовим значенням, якщо цього вимагає програма. Також зауважте, що рядок :c:type:`wchar_t*` може містити нульові символи, через що рядок буде скорочено під час використання з більшістю функцій C.

source: Convert the Unicode object to a wide character string. The output string always ends with a null character. If *size* is not ``NULL``, write the number of wide characters (excluding the trailing null termination character) into *\*size*. Note that the resulting :c:type:`wchar_t` string might contain null characters, which would cause the string to be truncated when used with most C functions. If *size* is ``NULL`` and the :c:type:`wchar_t*` string contains null characters a :exc:`ValueError` is raised.
uk: Перетворіть об’єкт Unicode на широкий символьний рядок. Виведений рядок завжди закінчується нульовим символом. Якщо *size* не є ``NULL``, запишіть кількість широких символів (за винятком завершального нульового символу закінчення) у *\*size*. Зауважте, що отриманий рядок :c:type:`wchar_t` може містити нульові символи, що призведе до скорочення рядка під час використання з більшістю функцій C. Якщо *size* має значення ``NULL``, а рядок :c:type:`wchar_t*` містить нульові символи, виникає :exc:`ValueError`.

source: Returns a buffer allocated by :c:func:`PyMem_Alloc` (use :c:func:`PyMem_Free` to free it) on success. On error, returns ``NULL`` and *\*size* is undefined. Raises a :exc:`MemoryError` if memory allocation is failed.
uk: У разі успіху повертає буфер, виділений :c:func:`PyMem_Alloc` (використовуйте :c:func:`PyMem_Free`, щоб звільнити його). У разі помилки повертає ``NULL`` і *\*size* не визначено. Викликає :exc:`MemoryError`, якщо виділення пам’яті не вдалося.

source: Raises a :exc:`ValueError` if *size* is ``NULL`` and the :c:type:`wchar_t*` string contains null characters.
uk: Викликає :exc:`ValueError`, якщо *size* має значення ``NULL``, а рядок :c:type:`wchar_t*` містить нульові символи.

source: Built-in Codecs
uk: Вбудовані кодеки

source: Python provides a set of built-in codecs which are written in C for speed. All of these codecs are directly usable via the following functions.
uk: Python надає набір вбудованих кодеків, написаних на C для швидкості. Усі ці кодеки можна безпосередньо використовувати за допомогою наведених нижче функцій.

source: Many of the following APIs take two arguments encoding and errors, and they have the same semantics as the ones of the built-in :func:`str` string object constructor.
uk: Багато з наведених нижче API приймають кодування двох аргументів і помилки, і вони мають таку саму семантику, як і вбудовані конструктори рядкових об’єктів :func:`str`.
