Repository: python/python-docs-uk
Catalog: c-api/unicode.po
Languages: uk

source: Setting encoding to ``NULL`` causes the default encoding to be used which is UTF-8. The file system calls should use :c:func:`PyUnicode_FSConverter` for encoding file names. This uses the variable :c:data:`Py_FileSystemDefaultEncoding` internally. This variable should be treated as read-only: on some systems, it will be a pointer to a static string, on others, it will change at run-time (such as when the application invokes setlocale).
uk: Встановлення кодування на ``NULL`` призводить до використання кодування за умовчанням, яке є UTF-8. Виклики файлової системи мають використовувати :c:func:`PyUnicode_FSConverter` для кодування імен файлів. Тут використовується змінна :c:data:`Py_FileSystemDefaultEncoding` внутрішньо. Цю змінну слід розглядати як доступну лише для читання: на деяких системах вона буде вказівником на статичний рядок, на інших вона змінюватиметься під час виконання (наприклад, коли програма викликає setlocale).

source: Error handling is set by errors which may also be set to ``NULL`` meaning to use the default handling defined for the codec. Default error handling for all built-in codecs is "strict" (:exc:`ValueError` is raised).
uk: Обробка помилок встановлюється помилками, які також можуть мати значення ``NULL``, що означає використання обробки за замовчуванням, визначеної для кодека. Обробка помилок за замовчуванням для всіх вбудованих кодеків є "суворою" (:exc:`ValueError` викликається).

source: The codecs all use a similar interface. Only deviations from the following generic ones are documented for simplicity.
uk: Усі кодеки використовують подібний інтерфейс. Для простоти документуються лише відхилення від наступних загальних.

source: Generic Codecs
uk: Загальні кодеки

source: These are the generic codec APIs:
uk: Це загальні кодеки API:

source: Create a Unicode object by decoding *size* bytes of the encoded string *s*. *encoding* and *errors* have the same meaning as the parameters of the same name in the :func:`str` built-in function. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти закодованого рядка *s*. *encoding* і *errors* мають те саме значення, що й однойменні параметри у вбудованій функції :func:`str`. Кодек, який буде використовуватися, шукається за допомогою реєстру кодеків Python. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Encode a Unicode object and return the result as Python bytes object. *encoding* and *errors* have the same meaning as the parameters of the same name in the Unicode :meth:`~str.encode` method. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
uk: Закодуйте об’єкт Unicode та поверніть результат як об’єкт Python bytes. *encoding* і *errors* мають те саме значення, що й однойменні параметри в методі Unicode :meth:`~str.encode`. Кодек, який буде використовуватися, шукається за допомогою реєстру кодеків Python. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: UTF-8 Codecs
uk: Кодеки UTF-8

source: These are the UTF-8 codec APIs:
uk: Це API кодека UTF-8:

source: Create a Unicode object by decoding *size* bytes of the UTF-8 encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти рядка *s* у кодуванні UTF-8. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF8`. If *consumed* is not ``NULL``, trailing incomplete UTF-8 byte sequences will not be treated as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
uk: Якщо *consumed* дорівнює ``NULL``, поводьтеся як :c:func:`PyUnicode_DecodeUTF8`. Якщо *consumed* не має значення ``NULL``, кінцеві неповні послідовності байтів UTF-8 не розглядатимуться як помилка. Ці байти не будуть декодовані, а кількість декодованих байтів зберігатиметься в *спожитих*.

source: Encode a Unicode object using UTF-8 and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Закодуйте об’єкт Unicode за допомогою UTF-8 і поверніть результат як об’єкт Python bytes. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Return a pointer to the UTF-8 encoding of the Unicode object, and store the size of the encoded representation (in bytes) in *size*. The *size* argument can be ``NULL``; in this case no size will be stored. The returned buffer always has an extra null byte appended (not included in *size*), regardless of whether there are any other null code points.
uk: Поверніть вказівник на кодування UTF-8 об’єкта Unicode та збережіть розмір закодованого представлення (у байтах) у *size*. Аргумент *size* може бути ``NULL``; у цьому випадку розмір не буде збережено. До поверненого буфера завжди додається додатковий нульовий байт (не включений у *size*), незалежно від того, чи є інші нульові кодові точки.

source: In the case of an error, ``NULL`` is returned with an exception set and no *size* is stored.
uk: У разі помилки повертається ``NULL`` із набором винятків і *розмір* не зберігається.

source: This caches the UTF-8 representation of the string in the Unicode object, and subsequent calls will return a pointer to the same buffer. The caller is not responsible for deallocating the buffer. The buffer is deallocated and pointers to it become invalid when the Unicode object is garbage collected.
uk: Це кешує представлення UTF-8 рядка в об’єкті Unicode, а наступні виклики повертатимуть вказівник на той самий буфер. Абонент не несе відповідальності за звільнення буфера. Буфер звільняється, і покажчики на нього стають недійсними, коли об’єкт Unicode збирається як сміття.

source: The return type is now ``const char *`` rather of ``char *``.
uk: Тип повернення тепер ``const char *``, а не ``char *``.

source: This function is a part of the :ref:`limited API <stable>`.
uk: Ця функція є частиною :ref:`limited API <stable>`.

source: As :c:func:`PyUnicode_AsUTF8AndSize`, but does not store the size.
uk: Як :c:func:`PyUnicode_AsUTF8AndSize`, але не зберігає розмір.

source: UTF-32 Codecs
uk: Кодеки UTF-32

source: These are the UTF-32 codec APIs:
uk: Це API кодеків UTF-32:

source: Decode *size* bytes from a UTF-32 encoded buffer string and return the corresponding Unicode object. *errors* (if non-``NULL``) defines the error handling. It defaults to "strict".
uk: Декодуйте байти *size* із рядка буфера, закодованого в UTF-32, і повертайте відповідний об’єкт Unicode. *errors* (якщо не ``NULL``) визначає обробку помилок. За замовчуванням встановлено "суворий".

source: If *byteorder* is non-``NULL``, the decoder starts decoding using the given byte order::
uk: Якщо *byteorder* не ``NULL``, декодер починає декодування, використовуючи вказаний порядок байтів::

source: If ``*byteorder`` is zero, and the first four bytes of the input data are a byte order mark (BOM), the decoder switches to this byte order and the BOM is not copied into the resulting Unicode string. If ``*byteorder`` is ``-1`` or ``1``, any byte order mark is copied to the output.
uk: Якщо ``*byteorder`` дорівнює нулю, а перші чотири байти вхідних даних є міткою порядку байтів (BOM), декодер перемикається на цей порядок байтів і BOM не копіюється в результуючий рядок Unicode. Якщо ``*byteorder`` дорівнює ``-1`` або ``1``, будь-яка позначка порядку байтів копіюється до виводу.

source: After completion, *\*byteorder* is set to the current byte order at the end of input data.
uk: Після завершення *\*byteorder* встановлюється на поточний порядок байтів у кінці вхідних даних.

source: If *byteorder* is ``NULL``, the codec starts in native order mode.
uk: Якщо *byteorder* дорівнює ``NULL``, кодек запускається в режимі власного порядку.

source: Return ``NULL`` if an exception was raised by the codec.
uk: Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF32`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeUTF32Stateful` will not treat trailing incomplete UTF-32 byte sequences (such as a number of bytes not divisible by four) as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
uk: Якщо *consumed* дорівнює ``NULL``, поводьтеся як :c:func:`PyUnicode_DecodeUTF32`. Якщо *consumed* не дорівнює ``NULL``, :c:func:`PyUnicode_DecodeUTF32Stateful` не розглядатиме кінцеві неповні послідовності байтів UTF-32 (наприклад, кількість байтів, що не ділиться на чотири) як помилку. Ці байти не будуть декодовані, а кількість декодованих байтів зберігатиметься в *спожитих*.

source: Return a Python byte string using the UTF-32 encoding in native byte order. The string always starts with a BOM mark. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Повертає байтовий рядок Python, використовуючи кодування UTF-32 у рідному порядку байтів. Рядок завжди починається з позначки BOM. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: UTF-16 Codecs
uk: Кодеки UTF-16

source: These are the UTF-16 codec APIs:
uk: Це API кодека UTF-16:

source: Decode *size* bytes from a UTF-16 encoded buffer string and return the corresponding Unicode object. *errors* (if non-``NULL``) defines the error handling. It defaults to "strict".
uk: Декодуйте байти *size* із рядка буфера, закодованого в UTF-16, і повертайте відповідний об’єкт Unicode. *errors* (якщо не ``NULL``) визначає обробку помилок. За замовчуванням встановлено "суворий".

source: If ``*byteorder`` is zero, and the first two bytes of the input data are a byte order mark (BOM), the decoder switches to this byte order and the BOM is not copied into the resulting Unicode string. If ``*byteorder`` is ``-1`` or ``1``, any byte order mark is copied to the output (where it will result in either a ``\ufeff`` or a ``\ufffe`` character).
uk: Якщо ``*byteorder`` дорівнює нулю, а перші два байти вхідних даних є міткою порядку байтів (BOM), декодер перемикається на цей порядок байтів і BOM не копіюється в результуючий рядок Unicode. Якщо ``*byteorder`` дорівнює ``-1`` або ``1``, будь-яка позначка порядку байтів копіюється до виводу (де це призведе до ``\ufeff`` або ``\ufffe`` символ).

source: After completion, ``*byteorder`` is set to the current byte order at the end of input data.
uk: Після завершення ``*byteorder`` встановлюється на поточний порядок байтів у кінці вхідних даних.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF16`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` will not treat trailing incomplete UTF-16 byte sequences (such as an odd number of bytes or a split surrogate pair) as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
uk: Якщо *consumed* дорівнює ``NULL``, поводьтеся як :c:func:`PyUnicode_DecodeUTF16`. Якщо *consumed* не дорівнює ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` не розглядатиме кінцеві неповні послідовності байтів UTF-16 (наприклад, непарну кількість байтів або розділену сурогатну пару) як помилку. Ці байти не будуть декодовані, а кількість декодованих байтів зберігатиметься в *спожитих*.

source: Return a Python byte string using the UTF-16 encoding in native byte order. The string always starts with a BOM mark. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Повертає байтовий рядок Python, використовуючи кодування UTF-16 у рідному порядку байтів. Рядок завжди починається з позначки BOM. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: UTF-7 Codecs
uk: Кодеки UTF-7

source: These are the UTF-7 codec APIs:
uk: Це API кодека UTF-7:

source: Create a Unicode object by decoding *size* bytes of the UTF-7 encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти рядка *s* у кодуванні UTF-7. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF7`. If *consumed* is not ``NULL``, trailing incomplete UTF-7 base-64 sections will not be treated as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
uk: Якщо *consumed* дорівнює ``NULL``, поводьтеся як :c:func:`PyUnicode_DecodeUTF7`. Якщо *consumed* не дорівнює ``NULL``, кінцеві неповні розділи UTF-7 base-64 не розглядатимуться як помилка. Ці байти не будуть декодовані, а кількість декодованих байтів зберігатиметься в *спожитих*.

source: Unicode-Escape Codecs
uk: Кодеки Unicode-Escape

source: These are the "Unicode Escape" codec APIs:
uk: Це API кодека "Unicode Escape":

source: Create a Unicode object by decoding *size* bytes of the Unicode-Escape encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти рядка *s*, закодованого Unicode-Escape. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Encode a Unicode object using Unicode-Escape and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Закодуйте об’єкт Unicode за допомогою Unicode-Escape та поверніть результат як об’єкт bytes. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Raw-Unicode-Escape Codecs
uk: Кодеки Raw-Unicode-Escape

source: These are the "Raw Unicode Escape" codec APIs:
uk: Це API кодека "Raw Unicode Escape":

source: Create a Unicode object by decoding *size* bytes of the Raw-Unicode-Escape encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти рядка *s*, закодованого Raw-Unicode-Escape. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Encode a Unicode object using Raw-Unicode-Escape and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Закодуйте об’єкт Unicode за допомогою Raw-Unicode-Escape та поверніть результат як об’єкт bytes. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Latin-1 Codecs
uk: Кодеки Latin-1

source: These are the Latin-1 codec APIs: Latin-1 corresponds to the first 256 Unicode ordinals and only these are accepted by the codecs during encoding.
uk: Це API кодека Latin-1: Latin-1 відповідає першим 256 порядковим номерам Unicode, і лише вони приймаються кодеками під час кодування.

source: Create a Unicode object by decoding *size* bytes of the Latin-1 encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти рядка *s* у кодуванні Latin-1. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Encode a Unicode object using Latin-1 and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Закодуйте об’єкт Unicode за допомогою Latin-1 і поверніть результат як об’єкт Python bytes. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: ASCII Codecs
uk: Кодеки ASCII

source: These are the ASCII codec APIs. Only 7-bit ASCII data is accepted. All other codes generate errors.
uk: Це API кодеків ASCII. Приймаються лише 7-бітні дані ASCII. Усі інші коди генерують помилки.

source: Create a Unicode object by decoding *size* bytes of the ASCII encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти рядка *s* у кодуванні ASCII. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Encode a Unicode object using ASCII and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Закодуйте об’єкт Unicode за допомогою ASCII і поверніть результат як об’єкт Python bytes. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Character Map Codecs
uk: Кодеки карти символів

source: This codec is special in that it can be used to implement many different codecs (and this is in fact what was done to obtain most of the standard codecs included in the :mod:`encodings` package). The codec uses mappings to encode and decode characters. The mapping objects provided must support the :meth:`__getitem__` mapping interface; dictionaries and sequences work well.
uk: Цей кодек особливий тим, що його можна використовувати для реалізації багатьох різних кодеків (і саме це було зроблено, щоб отримати більшість стандартних кодеків, включених до пакета :mod:`encodings`). Кодек використовує відображення для кодування та декодування символів. Надані об’єкти відображення мають підтримувати інтерфейс відображення :meth:`__getitem__`; словники та послідовності працюють добре.

source: These are the mapping codec APIs:
uk: Це API кодека відображення:

source: Create a Unicode object by decoding *size* bytes of the encoded string *s* using the given *mapping* object. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти закодованого рядка *s* за допомогою заданого об’єкта *mapping*. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: If *mapping* is ``NULL``, Latin-1 decoding will be applied. Else *mapping* must map bytes ordinals (integers in the range from 0 to 255) to Unicode strings, integers (which are then interpreted as Unicode ordinals) or ``None``. Unmapped data bytes -- ones which cause a :exc:`LookupError`, as well as ones which get mapped to ``None``, ``0xFFFE`` or ``'\ufffe'``, are treated as undefined mappings and cause an error.
uk: Якщо *mapping* має значення ``NULL``, буде застосовано декодування Latin-1. Інакше *відображення* має зіставляти порядкові номери байтів (цілі числа в діапазоні від 0 до 255) на рядки Unicode, цілі числа (які потім інтерпретуються як порядкові номери Unicode) або ``None``. Невідображені байти даних – ті, які викликають :exc:`LookupError`, а також ті, які відображаються на ``None``, ``0xFFFE`` або ``'\ufffe``, розглядаються як невизначені відображення і викликати помилку.

source: Encode a Unicode object using the given *mapping* object and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Закодуйте об’єкт Unicode за допомогою даного об’єкта *mapping* і поверніть результат як об’єкт bytes. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: The *mapping* object must map Unicode ordinal integers to bytes objects, integers in the range from 0 to 255 or ``None``. Unmapped character ordinals (ones which cause a :exc:`LookupError`) as well as mapped to ``None`` are treated as "undefined mapping" and cause an error.
uk: Об’єкт *mapping* має зіставляти порядкові цілі числа Unicode з об’єктами bytes, цілі числа в діапазоні від 0 до 255 або ``None``. Невідображені порядкові символи (які спричиняють :exc:`LookupError`), а також відображені на ``None`` розглядаються як "невизначене відображення" та викликають помилку.

source: The following codec API is special in that maps Unicode to Unicode.
uk: Наступний кодек API є особливим у тому, що відображає Unicode на Unicode.

source: Translate a string by applying a character mapping table to it and return the resulting Unicode object. Return ``NULL`` if an exception was raised by the codec.
uk: Перекладіть рядок, застосувавши до нього таблицю зіставлення символів і поверніть отриманий об’єкт Unicode. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: The mapping table must map Unicode ordinal integers to Unicode ordinal integers or ``None`` (causing deletion of the character).
uk: Таблиця відображення має зіставляти порядкові цілі числа Unicode з порядковими цілими числами Unicode або "Немає" (спричиняючи видалення символу).

source: Mapping tables need only provide the :meth:`__getitem__` interface; dictionaries and sequences work well. Unmapped character ordinals (ones which cause a :exc:`LookupError`) are left untouched and are copied as-is.
uk: Таблиці відображення повинні надавати лише інтерфейс :meth:`__getitem__`; словники та послідовності працюють добре. Незіставлені порядкові символи (які викликають :exc:`LookupError`) залишаються недоторканими та копіюються як є.

source: *errors* has the usual meaning for codecs. It may be ``NULL`` which indicates to use the default error handling.
uk: *помилки* має звичайне значення для кодеків. Це може бути ``NULL``, що вказує на використання стандартної обробки помилок.

source: MBCS codecs for Windows
uk: Кодеки MBCS для Windows

source: These are the MBCS codec APIs. They are currently only available on Windows and use the Win32 MBCS converters to implement the conversions. Note that MBCS (or DBCS) is a class of encodings, not just one. The target encoding is defined by the user settings on the machine running the codec.
uk: Це API кодека MBCS. Наразі вони доступні лише у Windows і використовують конвертери Win32 MBCS для реалізації перетворень. Зауважте, що MBCS (або DBCS) — це клас кодувань, а не одне. Цільове кодування визначається налаштуваннями користувача на машині, на якій працює кодек.

source: Create a Unicode object by decoding *size* bytes of the MBCS encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
uk: Створіть об’єкт Unicode, декодуючи *size* байти рядка *s* у кодуванні MBCS. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeMBCS`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` will not decode trailing lead byte and the number of bytes that have been decoded will be stored in *consumed*.
uk: Якщо *consumed* дорівнює ``NULL``, поводьтеся як :c:func:`PyUnicode_DecodeMBCS`. Якщо *consumed* не дорівнює ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` не декодуватиме кінцевий провідний байт, а кількість декодованих байтів зберігатиметься в *consumed*.

source: Encode a Unicode object using MBCS and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
uk: Закодуйте об’єкт Unicode за допомогою MBCS і поверніть результат як об’єкт Python bytes. Обробка помилок "строга". Повертає ``NULL``, якщо кодек викликав виняткову ситуацію.

source: Encode the Unicode object using the specified code page and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec. Use :c:data:`CP_ACP` code page to get the MBCS encoder.
uk: Закодуйте об’єкт Unicode за допомогою вказаної кодової сторінки та поверніть об’єкт Python bytes. Повертає ``NULL``, якщо кодек викликав виняткову ситуацію. Використовуйте кодову сторінку :c:data:`CP_ACP`, щоб отримати кодувальник MBCS.

source: Methods & Slots
uk: Методи та слоти

source: Methods and Slot Functions
uk: Методи та функції слота

source: The following APIs are capable of handling Unicode objects and strings on input (we refer to them as strings in the descriptions) and return Unicode objects or integers as appropriate.
uk: Наступні API здатні обробляти об’єкти Unicode та рядки на вхідних даних (ми називаємо їх рядками в описах) і повертати об’єкти Unicode або цілі числа відповідно.
