Repository: python/python-docs-uk
Catalog: c-api/unicode.po
Languages: uk

source: They all return ``NULL`` or ``-1`` if an exception occurs.
uk: Усі вони повертають ``NULL`` або ``-1``, якщо виникає виняткова ситуація.

source: Concat two strings giving a new Unicode string.
uk: Concat два рядки дають новий рядок Unicode.

source: Split a string giving a list of Unicode strings. If *sep* is ``NULL``, splitting will be done at all whitespace substrings. Otherwise, splits occur at the given separator. At most *maxsplit* splits will be done. If negative, no limit is set. Separators are not included in the resulting list.
uk: Розділити рядок, що дасть список рядків Unicode. Якщо *sep* дорівнює ``NULL``, розділення буде виконано на всіх пробільних підрядках. В іншому випадку на даному сепараторі відбуваються розбивання. Буде виконано не більше ніж *maxsplit*. Якщо значення від’ємне, обмеження не встановлено. Розділювачі не включені в отриманий список.

source: Split a Unicode string at line breaks, returning a list of Unicode strings. CRLF is considered to be one line break. If *keepend* is ``0``, the line break characters are not included in the resulting strings.
uk: Розділіть рядок Unicode на розриви рядків, повертаючи список рядків Unicode. CRLF вважається розривом одного рядка. Якщо *keepend* дорівнює ``0``, символи розриву рядка не включаються в отримані рядки.

source: Join a sequence of strings using the given *separator* and return the resulting Unicode string.
uk: З’єднайте послідовність рядків за допомогою заданого *роздільника* та поверніть отриманий рядок Unicode.

source: Return ``1`` if *substr* matches ``str[start:end]`` at the given tail end (*direction* == ``-1`` means to do a prefix match, *direction* == ``1`` a suffix match), ``0`` otherwise. Return ``-1`` if an error occurred.
uk: Повертає ``1``, якщо *substr* збігається з ``str[start:end]`` у вказаному кінці (*direction* == ``-1`` означає збіг префікса, *direction* == ``1`` відповідає суфіксу), ``0`` інакше. Повертає ``-1``, якщо сталася помилка.

source: Return the first position of *substr* in ``str[start:end]`` using the given *direction* (*direction* == ``1`` means to do a forward search, *direction* == ``-1`` a backward search). The return value is the index of the first match; a value of ``-1`` indicates that no match was found, and ``-2`` indicates that an error occurred and an exception has been set.
uk: Повертає першу позицію *substr* у ``str[start:end]``, використовуючи заданий *напрям* (*напрямок* == ``1`` означає пошук вперед, *напрямок* == ``-1`` пошук назад). Повернене значення є індексом першого збігу; значення ``-1`` вказує на те, що відповідності не знайдено, а ``-2`` вказує на те, що сталася помилка та встановлено виняток.

source: Return the first position of the character *ch* in ``str[start:end]`` using the given *direction* (*direction* == ``1`` means to do a forward search, *direction* == ``-1`` a backward search). The return value is the index of the first match; a value of ``-1`` indicates that no match was found, and ``-2`` indicates that an error occurred and an exception has been set.
uk: Повертає першу позицію символу *ch* у ``str[start:end]``, використовуючи вказаний *напрямок* (*напрямок* == ``1`` означає пошук вперед, *напрямок* == ``-1`` пошук у зворотному напрямку). Повернене значення є індексом першого збігу; значення ``-1`` вказує на те, що відповідності не знайдено, а ``-2`` вказує на те, що сталася помилка та встановлено виняток.

source: *start* and *end* are now adjusted to behave like ``str[start:end]``.
uk: *start* і *end* тепер налаштовані так, щоб поводитися як ``str[start:end]``.

source: Return the number of non-overlapping occurrences of *substr* in ``str[start:end]``. Return ``-1`` if an error occurred.
uk: Повертає кількість неперекриваючих входжень *substr* у ``str[start:end]``. Повертає ``-1``, якщо сталася помилка.

source: Replace at most *maxcount* occurrences of *substr* in *str* with *replstr* and return the resulting Unicode object. *maxcount* == ``-1`` means replace all occurrences.
uk: Замініть щонайбільше *maxcount* входжень *substr* у *str* на *replstr* і поверніть отриманий об’єкт Unicode. *maxcount* == ``-1`` означає заміну всіх входжень.

source: Compare two strings and return ``-1``, ``0``, ``1`` for less than, equal, and greater than, respectively.
uk: Порівняйте два рядки та поверніть ``-1``, ``0``, ``1`` для меншого, рівного та більшого відповідно.

source: This function returns ``-1`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
uk: Ця функція повертає ``-1`` у разі помилки, тому слід викликати :c:func:`PyErr_Occurred`, щоб перевірити наявність помилок.

source: Compare a Unicode object, *uni*, with *string* and return ``-1``, ``0``, ``1`` for less than, equal, and greater than, respectively. It is best to pass only ASCII-encoded strings, but the function interprets the input string as ISO-8859-1 if it contains non-ASCII characters.
uk: Порівняйте об’єкт Unicode, *uni*, з *string* і поверніть ``-1``, ``0``, ``1`` для меншого, рівного та більшого відповідно. Найкраще передавати лише рядки в кодуванні ASCII, але функція інтерпретує вхідний рядок як ISO-8859-1, якщо він містить символи, відмінні від ASCII.

source: This function does not raise exceptions.
uk: Ця функція не викликає винятків.

source: Rich compare two Unicode strings and return one of the following:
uk: Rich порівнює два рядки Unicode та повертає одне з наступного:

source: ``NULL`` in case an exception was raised
uk: ``NULL`` у разі виникнення винятку

source: :const:`Py_True` or :const:`Py_False` for successful comparisons
uk: :const:`Py_True` або :const:`Py_False` для успішних порівнянь

source: :const:`Py_NotImplemented` in case the type combination is unknown
uk: :const:`Py_NotImplemented` у випадку, якщо комбінація типів невідома

source: Possible values for *op* are :const:`Py_GT`, :const:`Py_GE`, :const:`Py_EQ`, :const:`Py_NE`, :const:`Py_LT`, and :const:`Py_LE`.
uk: Можливі значення для *op*: :const:`Py_GT`, :const:`Py_GE`, :const:`Py_EQ`, :const:`Py_NE`, :const:`Py_LT` і :const:`Py_LE`.

source: Return a new string object from *format* and *args*; this is analogous to ``format % args``.
uk: Повертає новий рядковий об’єкт із *format* і *args*; це аналогічно ``format % args``.

source: Check whether *element* is contained in *container* and return true or false accordingly.
uk: Перевірте, чи *елемент* міститься в *контейнері*, і поверніть відповідно true або false.

source: *element* has to coerce to a one element Unicode string. ``-1`` is returned if there was an error.
uk: *element* має привести до одноелементного рядка Unicode. ``-1`` повертається, якщо була помилка.

source: Intern the argument *\*string* in place. The argument must be the address of a pointer variable pointing to a Python Unicode string object. If there is an existing interned string that is the same as *\*string*, it sets *\*string* to it (decrementing the reference count of the old string object and incrementing the reference count of the interned string object), otherwise it leaves *\*string* alone and interns it (incrementing its reference count). (Clarification: even though there is a lot of talk about reference counts, think of this function as reference-count-neutral; you own the object after the call if and only if you owned it before the call.)
uk: Інтернувати аргумент *\*рядок* на місці. Аргумент має бути адресою змінної покажчика, що вказує на рядковий об’єкт Python Unicode. Якщо існує вбудований рядок, який збігається з *\*string*, він встановлює для нього *\*string* (зменшуючи кількість посилань старого рядкового об’єкта та збільшуючи кількість посилань вбудованого рядкового об’єкта), інакше він залишає *\*рядок* у спокої та інтернує його (збільшуючи його кількість посилань). (Роз’яснення: незважаючи на те, що багато говорять про підрахунок посилань, сприймайте цю функцію як нейтральну до підрахунку посилань; ви володієте об’єктом після виклику тоді і тільки тоді, коли він вам належав до виклику.)

source: A combination of :c:func:`PyUnicode_FromString` and :c:func:`PyUnicode_InternInPlace`, returning either a new Unicode string object that has been interned, or a new ("owned") reference to an earlier interned string object with the same value.
uk: Комбінація :c:func:`PyUnicode_FromString` і :c:func:`PyUnicode_InternInPlace`, що повертає новий об’єкт рядка Unicode, який було інтерновано, або нове ("власне") посилання на попередній об’єкт інтернованого рядка з те саме значення.
